{
    "accessibility": "Open access",
    "additionDate": "2022-05-08T09:54:28.400876Z",
    "biotoolsCURIE": "biotools:geneconet",
    "biotoolsID": "geneconet",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Byungkyu Park"
        },
        {
            "name": "Kyungsook Han"
        },
        {
            "name": "Wook Lee"
        }
    ],
    "description": "A web application server for constructing cancer patient-specific gene correlation networks with prognostic gene pairs.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Database ID",
                        "uri": "http://edamontology.org/data_1048"
                    }
                },
                {
                    "data": {
                        "term": "Gene name",
                        "uri": "http://edamontology.org/data_2299"
                    }
                }
            ],
            "operation": [
                {
                    "term": "Gene prediction",
                    "uri": "http://edamontology.org/operation_2454"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "http://geneconet.inha.ac.kr",
    "lastUpdate": "2022-05-08T09:55:08.924030Z",
    "name": "GeneCoNet",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1016/J.CMPB.2021.106465",
            "metadata": {
                "abstract": "© 2021 Elsevier B.V.Background and objective: Most prognostic gene signatures that have been known for cancer are either individual genes or combination of genes. Both individual genes and combination of genes do not provide information on gene-gene relations, and often have less prognostic significance than random genes associated with cell proliferation. Several methods for generating sample-specific gene networks have been proposed, but programs implementing the methods are not publicly available. Methods: We have developed a method that builds gene correlation networks specific to individual cancer patients and derives prognostic gene correlations from the networks. A gene correlation network specific to a patient is constructed by identifying gene-gene relations that are significantly different from normal samples. Prognostic gene pairs are obtained by carrying out the Cox proportional hazards regression and the log-rank test for every gene pair. Results: We built a web application server called GeneCoNet with thousands of tumor samples in TCGA. Given a tumor sample ID of TCGA, GeneCoNet dynamically constructs a gene correlation network specific to the sample as output. As an additional output, it provides information on prognostic gene correlations in the network. GeneCoNet found several prognostic gene correlations for six types of cancer, but there were no prognostic gene pairs common to multiple cancer types. Conclusion: Extensive analysis of patient-specific gene correlation networks suggests that patients with a larger subnetwork of prognostic gene pairs have shorter survival time than the others and that patients with a subnetwork that contains more genes participating in prognostic gene pairs have shorter survival time than the others. GeneCoNet can be used as a valuable resource for generating gene correlation networks specific to individual patients and for identifying prognostic gene correlations. It is freely accessible at http://geneconet.inha.ac.kr.",
                "authors": [
                    {
                        "name": "Han K."
                    },
                    {
                        "name": "Lee W."
                    },
                    {
                        "name": "Park B."
                    }
                ],
                "date": "2021-11-01T00:00:00Z",
                "journal": "Computer Methods and Programs in Biomedicine",
                "title": "GeneCoNet: A web application server for constructing cancer patient-specific gene correlation networks with prognostic gene pairs"
            },
            "pmid": "34715518"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        }
    ]
}
