{
    "additionDate": "2021-01-18T11:19:58Z",
    "biotoolsCURIE": "biotools:kyrix-s",
    "biotoolsID": "kyrix-s",
    "confidence_flag": "tool",
    "description": "Authoring Scalable Scatterplot Visualizations of Big Data.\n\nKyrix - democratizing details-on-demand data visualizations.\n\nKyrix facilitates the creation of data visualizations with details-on-demand interactions (e.g. pan and zoom, see the demo gallery1 above). In visualizations of such, the underlying dataset is often large. To deal with large data, Kyrix is focused on optimizing two goals: 1) usable declarative API library for visualization developers and 2) 500ms response time to user interactions, which is required to enable interactive browsing.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                },
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                },
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                }
            ]
        }
    ],
    "homepage": "https://github.com/tracyhenry/kyrix",
    "language": [
        "JavaScript",
        "Java",
        "Shell"
    ],
    "lastUpdate": "2021-02-12T11:06:46Z",
    "license": "MIT",
    "name": "Kyrix-S",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1109/TVCG.2020.3030372",
            "metadata": {
                "abstract": "© 2020 IEEE.Static scatterplots often suffer from the overdraw problem on big datasets where object overlap causes undesirable visual clutter. The use of zooming in scatterplots can help alleviate this problem. With multiple zoom levels, more screen real estate is available, allowing objects to be placed in a less crowded way. We call this type of visualization scalable scatterplot visualizations, or SSV for short. Despite the potential of SSVs, existing systems and toolkits fall short in supporting the authoring of SSVs due to three limitations. First, many systems have limited scalability, assuming that data fits in the memory of one computer. Second, too much developer work, e.g., using custom code to generate mark layouts or render objects, is required. Third, many systems focus on only a small subset of the SSV design space (e.g. supporting a specific type of visual marks). To address these limitations, we have developed Kyrix-S, a system for easy authoring of SSVs at scale. Kyrix-S derives a declarative grammar that enables specification of a variety of SSVs in a few tens of lines of code, based on an existing survey of scatterplot tasks and designs. The declarative grammar is supported by a distributed layout algorithm which automatically places visual marks onto zoom levels. We store data in a multi-node database and use multi-node spatial indexes to achieve interactive browsing of large SSVs. Extensive experiments show that 1) Kyrix-S enables interactive browsing of SSVs of billions of objects, with response times under 500ms and 2) Kyrix-S achieves 4X-9X reduction in specification compared to a state-of-the-art authoring system.",
                "authors": [
                    {
                        "name": "Tao W."
                    },
                    {
                        "name": "Hou X."
                    },
                    {
                        "name": "Sah A."
                    },
                    {
                        "name": "Battle L."
                    },
                    {
                        "name": "Chang R."
                    },
                    {
                        "name": "Stonebraker M."
                    }
                ],
                "date": "2021-02-01T00:00:00Z",
                "journal": "IEEE Transactions on Visualization and Computer Graphics",
                "title": "Kyrix-S: Authoring Scalable Scatterplot Visualizations of Big Data"
            },
            "pmid": "33048700"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Data visualisation",
            "uri": "http://edamontology.org/topic_0092"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Mathematics",
            "uri": "http://edamontology.org/topic_3315"
        }
    ]
}