{
    "additionDate": "2021-01-18T10:18:04Z",
    "biotoolsCURIE": "biotools:svad",
    "biotoolsID": "svad",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "huanghsienda@cuhk.edu.cn",
            "name": "Yu-Feng Hu",
            "typeEntity": "Person"
        },
        {
            "email": "huhuhu0609@gmail.com",
            "name": "Hsien-Da Huang",
            "orcidid": "https://orcid.org/0000-0003-2857-7023",
            "typeEntity": "Person"
        }
    ],
    "description": "A genetic database curates non-ischemic sudden cardiac death-associated variants.\n\nSudden cardiac death (SCD) is an important cause of mortality worldwide. It accounts for approximately half of all deaths from cardiovascular disease. While coronary artery disease and acute myocardial infarction account for the majority of SCD in the elderly population, inherited cardiac diseases (inherited CDs) comprise a substantial proportion of younger SCD victims with a significant genetic component. Currently, the use of next-generation sequencing enables the rapid analysis to investigate relationships between genetic variants and inherited CDs causing SCD. Genetic contribution to risk has been considered an alternate predictor of SCD. In the past years, large numbers of SCD susceptibility variants were reported, but these results are scattered in numerous publications",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Variant classification",
                    "uri": "http://edamontology.org/operation_3225"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                }
            ]
        }
    ],
    "homepage": "http://svad.mbc.nctu.edu.tw/",
    "lastUpdate": "2021-02-24T13:03:54Z",
    "name": "SVAD",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PONE.0237731",
            "metadata": {
                "abstract": "© 2020 Huang et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Sudden cardiac death (SCD) is an important cause of mortality worldwide. It accounts for approximately half of all deaths from cardiovascular disease. While coronary artery disease and acute myocardial infarction account for the majority of SCD in the elderly population, inherited cardiac diseases (inherited CDs) comprise a substantial proportion of younger SCD victims with a significant genetic component. Currently, the use of next-generation sequencing enables the rapid analysis to investigate relationships between genetic variants and inherited CDs causing SCD. Genetic contribution to risk has been considered an alternate predictor of SCD. In the past years, large numbers of SCD susceptibility variants were reported, but these results are scattered in numerous publications. Here, we present the SCD-associated Variants Annotation Database (SVAD) to facilitate the interpretation of variants and to meet the needs of data integration. SVAD contains data from a broad screening of scientific literature. It was constructed to provide a comprehensive collection of genetic variants along with integrated information regarding their effects. At present, SVAD has accumulated 2,292 entries within 1,239 variants by manually surveying pertinent literature, and approximately one-third of the collected variants are pathogenic/likely-pathogenic following the ACMG guidelines. To the best of our knowledge, SVAD is the most comprehensive database that can provide integrated information on the associated variants in various types of inherited CDs. SVAD represents a valuable source of variant information based on scientific literature and benefits clinicians and researchers, and it is now available on http://svad.mbc.nctu.edu.tw/.",
                "authors": [
                    {
                        "name": "Huang W.-C."
                    },
                    {
                        "name": "Huang H.-T."
                    },
                    {
                        "name": "Chen P.-Y."
                    },
                    {
                        "name": "Wang W.-C."
                    },
                    {
                        "name": "Ko T.-M."
                    },
                    {
                        "name": "Shrestha S."
                    },
                    {
                        "name": "Yang C.-D."
                    },
                    {
                        "name": "Tai C.-S."
                    },
                    {
                        "name": "Chiew M.-Y."
                    },
                    {
                        "name": "Chou Y.-P."
                    },
                    {
                        "name": "Hu Y.-F."
                    },
                    {
                        "name": "Huang H.-D."
                    }
                ],
                "date": "2020-08-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "SVAD: A genetic database curates non-ischemic sudden cardiac death-associated variants"
            },
            "pmcid": "PMC7437891",
            "pmid": "32813752"
        }
    ],
    "topic": [
        {
            "term": "Cardiology",
            "uri": "http://edamontology.org/topic_3335"
        },
        {
            "term": "Population genetics",
            "uri": "http://edamontology.org/topic_3056"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Human genetics",
            "uri": "http://edamontology.org/topic_3574"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        }
    ]
}