{"credit":[{"name":"Contact Form","typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://www.tmanavigator.org/contact/"}],"documentation":[{"type":"TERMS_OF_USE","url":"http://www.tmanavigator.org/help/#terms"},{"type":"GENERAL","url":"http://www.tmanavigator.org/help/#introduction"}],"function":[{"operation":[{"term":"Protein interaction network analysis","uri":"http://edamontology.org/operation_0276"},{"term":"Pathway or network analysis","uri":"http://edamontology.org/operation_2497"},{"term":"Gene expression profiling","uri":"http://edamontology.org/operation_0314"},{"term":"Gene expression analysis","uri":"http://edamontology.org/operation_2495"}]}],"labels":{"operatingSystem":["Linux","Windows","Mac"],"toolType":["Web application"],"topic":[{"term":"Microarray experiment","uri":"http://edamontology.org/topic_3518"},{"term":"Biomarkers","uri":"http://edamontology.org/topic_3360"},{"term":"Molecular interactions, pathways and networks","uri":"http://edamontology.org/topic_0602"},{"term":"Gene expression","uri":"http://edamontology.org/topic_0203"},{"term":"Data architecture, analysis and design","uri":"http://edamontology.org/topic_3365"}]},"publication":[{"abstract":"Tissue microarrays (TMAs) allow multiplexed analysis of tissue samples and are frequently used to estimate biomarker protein expression in tumour biopsies. TMA Navigator (www.tmanavigator.org) is an open access web application for analysis of TMA data and related information, accommodating categorical, semi-continuous and continuous expression scores. Non-biological variation, or batch effects, can hinder data analysis and may be mitigated using the ComBat algorithm, which is incorporated with enhancements for automated application to TMA data. Unsupervised grouping of samples (patients) is provided according to Gaussian mixture modelling of marker scores, with cardinality selected by Bayesian information criterion regularization. Kaplan-Meier survival analysis is available, including comparison of groups identified by mixture modelling using the Mantel-Cox log-rank test. TMA Navigator also supports network inference approaches useful for TMA datasets, which often constitute comparatively few markers. Tissue and cell-type specific networks derived from TMA expression data offer insights into the molecular logic underlying pathophenotypes, towards more effective and personalized medicine. Output is interactive, and results may be exported for use with external programs. Private anonymous access is available, and user accounts may be generated for easier data management.","authors":["Lubbock A.L.","Katz E.","Harrison D.J.","Overton I.M."],"cit_count":8,"journal":"Nucleic acids research","pmid":"23761446","title":"TMA Navigator: Network inference, patient stratification and survival analysis with tissue microarray data.","year":"2013-01-01"}],"summary":{"biotoolsCURIE":"biotools:tma_navigator","biotoolsID":"tma_navigator","description":"TMA Navigator is a suite of tools developed specifically for tissue microarray data. It allows network inference, patient stratification and survival analysis from tissue microarray data.","homepage":"http://www.tmanavigator.org","name":"TMA Navigator"}}