{
    "additionDate": "2017-08-03T18:46:11Z",
    "biotoolsCURIE": "biotools:htsmix",
    "biotoolsID": "htsmix",
    "credit": [
        {
            "email": "o.vitek@northeastern.edu",
            "name": "Olga Vitek",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://olga-vitek-lab.ccis.northeastern.edu/lab-members/"
        }
    ],
    "description": "Represents the structure of signals in the screen using linear mixed models, normalizes and summarizes the phenotypes to make them comparable across samples, and outputs a list of hits while controlling the False Discovery Rate. The methodology is appropriate for experimental designs with at least two control samples profiled throughout the screen.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://www.stat.purdue.edu/~ovitek/HTSmix_files/HTSmix_help.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "http://www.stat.purdue.edu/~ovitek/HTSmix.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-10T12:58:57Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/htsmix-1-0-interpretation-high-throughput-perturbation-screens-low-dimensional-phenotypes.html"
        }
    ],
    "name": "HTSmix",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Motivation: High-throughput perturbation screens measure the phenotypes of thousands of biological samples under various conditions. The phenotypes measured in the screens are subject to substantial biological and technical variation. At the same time, in order to enable high throughput, it is often impossible to include a large number of replicates, and to randomize their order throughout the screens. Distinguishing true changes in the phenotype from stochastic variation in such experimental designs is extremely challenging, and requires adequate statistical methodology. Results: We propose a statistical modeling framework that is based on experimental designs with at least two controls profiled throughout the experiment, and a normalization and variance estimation procedure with linear mixed-effects models. We evaluate the framework using three comprehensive screens of Saccharomyces cerevisiae, which involve 4940 single-gene knockout haploid mutants, 1127 single-gene knock-out diploid mutants and 5798 single-gene overexpression haploid strains. We show that the proposed approach (i) can be used in conjunction with practical experimental designs; (ii) allows extensions to alternative experimental workflows; (iii) enables a sensitive discovery of biologically meaningful changes; and (iv) strongly outperforms the existing noise reduction procedures. © The Author 2011. Published by Oxford University Press. All rights reserved.",
                "authors": [
                    {
                        "name": "Yu D."
                    },
                    {
                        "name": "Danku J."
                    },
                    {
                        "name": "Baxter I."
                    },
                    {
                        "name": "Kim S."
                    },
                    {
                        "name": "Vatamaniuk O.K."
                    },
                    {
                        "name": "Salt D.E."
                    },
                    {
                        "name": "Vitek O."
                    }
                ],
                "citationCount": 8,
                "date": "2011-08-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Noise reduction in genome-wide perturbation screens using linear mixed-effect models"
            },
            "pmid": "21685046"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Sample collections",
            "uri": "http://edamontology.org/topic_3277"
        }
    ],
    "validated": 1
}