
{
    "credit": [
        {
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://salilab.org/index.html"
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "https://integrativemodeling.org/doc.html"
        }
    ],
    "labels": {
        "language": [
            "C++",
            "Python"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "NMR",
                "uri": "http://edamontology.org/topic_0593"
            },
            {
                "term": "Electron microscopy",
                "uri": "http://edamontology.org/topic_0611"
            },
            {
                "term": "Imaging",
                "uri": "http://edamontology.org/topic_3382"
            },
            {
                "term": "Small molecules",
                "uri": "http://edamontology.org/topic_0154"
            },
            {
                "term": "Molecular interactions, pathways and networks",
                "uri": "http://edamontology.org/topic_0602"
            },
            {
                "term": "X-ray diffraction",
                "uri": "http://edamontology.org/topic_2828"
            },
            {
                "term": "Molecular modelling",
                "uri": "http://edamontology.org/topic_2275"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://www.mybiosoftware.com/imp-1-0-integrative-modeling-platform.html"
        }
    ],
    "publication": [
        {
            "abstract": "To understand the workings of the living cell, we need to characterize protein assemblies that constitute the cell (for example, the ribosome, 26S proteasome, and the nuclear pore complex). A reliable high-resolution structural characterization of these assemblies is frequently beyond the reach of current experimental methods, such as X-ray crystallography, NMR spectroscopy, electron microscopy, footprinting, chemical cross-linking, FRET spectroscopy, small-angle X-ray scattering, and proteomics. However, the information garnered from different methods can be combined and used to build computational models of the assembly structures that are consistent with all of the available datasets. Here, we describe a protocol for this integration, whereby the information is converted to a set of spatial restraints and a variety of optimization procedures can be used to generate models that satisfy the restraints as much as possible. These generated models can then potentially inform about the precision and accuracy of structure determination, the accuracy of the input datasets, and further data generation. We also demonstrate the Integrative Modeling Platform (IMP) software, which provides the necessary computational framework to implement this protocol, and several applications for specific-use cases. © 2011 Springer Science+Business Media, LLC.",
            "authors": [
                "Webb B.",
                "Lasker K.",
                "Schneidman-Duhovny D.",
                "Tjioe E.",
                "Phillips J.",
                "Kim S.J.",
                "Velazquez-Muriel J.",
                "Russel D.",
                "Sali A."
            ],
            "cit_count": 16,
            "journal": "Methods in Molecular Biology",
            "pmid": "21877292",
            "title": "Modeling of proteins and their assemblies with the integrative modeling platform",
            "year": "2011-10-24"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:imp_biomolecules",
        "biotoolsID": "imp_biomolecules",
        "description": "Integrative Modeling Platform broad goal is to contribute to a comprehensive structural characterization of biomolecules ranging in size and complexity from small peptides to large macromolecular assemblies. Detailed structural characterization of assemblies is generally impossible by any single existing experimental or computational method. This barrier can be overcome by hybrid approaches that integrate data from diverse biochemical and biophysical experiments.",
        "homepage": "http://www.salilab.org/imp/",
        "name": "IMP"
    }
}