
{
    "credit": [
        {
            "email": "wanglk@hsc.pku.edu.cn",
            "name": "Likun Wang",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "User manual",
            "url": "http://bioconductor.org/packages/release/bioc/html/ASEB.html"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://bioconductor/packages/release/bioc/src/contrib/ASEB_1.18.0.tar.gz"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Post-translation modification site prediction",
                    "uri": "http://edamontology.org/operation_0417"
                }
            ]
        }
    ],
    "labels": {
        "collectionID": [
            "BioConductor"
        ],
        "language": [
            "R"
        ],
        "license": "GPL-3.0",
        "operatingSystem": [
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Command-line tool",
            "Library"
        ],
        "topic": [
            {
                "term": "Protein sites, features and motifs",
                "uri": "http://edamontology.org/topic_3510"
            }
        ]
    },
    "publication": [
        {
            "abstract": "Protein lysine acetylation plays an important role in the normal functioning of cells, including gene expression regulation, protein stability and metabolism regulation. Although large amounts of lysine acetylation sites have been identified via large-scale mass spectrometry or traditional experimental methods, the lysine (K)-acetyl-transferase (KAT) responsible for the acetylation of a given protein or lysine site remains largely unknown due to the experimental limitations of KAT substrate identification. Hence, the in silico prediction of KAT-specific acetylation sites may provide direction for further experiments. In our previous study, we developed the acetylation set enrichment based (ASEB) computer program to predict which KAT-families are responsible for the acetylation of a given protein or lysine site. In this article, we provide KAT-specific acetylation site prediction as a web service. This web server not only provides the online tool and R package for the method in our previous study, but several useful services are also included, such as the integration of protein-protein interaction information to enhance prediction accuracy. This web server can be freely accessed at http://cmbi.bjmu.edu.cn/ huac. © 2012 The Author(s).",
            "authors": [
                "Wang L.",
                "Du Y.",
                "Lu M.",
                "Li T."
            ],
            "cit_count": 37,
            "doi": "10.1093/nar/gks437",
            "journal": "Nucleic Acids Research",
            "title": "ASEB: A web server for KAT-specific acetylation site prediction",
            "type": "Primary",
            "year": "2012-07-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:aseb",
        "biotoolsID": "aseb",
        "description": "R package to predict lysine sites that can be acetylated by a specific KAT-family.",
        "homepage": "http://bioconductor.org/packages/release/bioc/html/ASEB.html",
        "name": "ASEB",
        "version": [
            "1.18.0"
        ]
    }
}