{
    "additionDate": "2024-01-29T11:59:35.473811Z",
    "biotoolsCURIE": "biotools:geniepool",
    "biotoolsID": "geniepool",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "obirk@bgu.ac.il",
            "name": "Ohad S Birk",
            "typeEntity": "Person"
        }
    ],
    "description": "Genomic database with corresponding annotated samples based on a cloud data lake architecture.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genetic variation analysis",
                    "uri": "http://edamontology.org/operation_3197"
                },
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                },
                {
                    "term": "Variant filtering",
                    "uri": "http://edamontology.org/operation_3675"
                }
            ]
        }
    ],
    "homepage": "https://geniepool.link",
    "lastUpdate": "2024-11-24T14:18:24.743094Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/geniepool"
        }
    ],
    "name": "GeniePool",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/database/baad043",
            "metadata": {
                "abstract": "In recent years, there are a huge influx of genomic data and a growing need for its phenotypic correlations, yet existing genomic databases do not allow easy storage and accessibility to the combined phenotypic-genotypic information. Freely accessible allele frequency (AF) databases, such as gnomAD, are crucial for evaluating variants but lack correlated phenotype data. The Sequence Read Archive (SRA) accumulates hundreds of thousands of next-generation sequencing (NGS) samples tagged by their submitters and various attributes. However, samples are stored in large raw format files, inaccessible for a common user. To make thousands of NGS samples and their corresponding additional attributes easily available to clinicians and researchers, we generated a pipeline that continuously downloads raw human NGS data uploaded to SRA using SRAtoolkit and preprocesses them using GATK pipeline. Data are then stored efficiently in a cloud data lake and can be accessed via a representational state transfer application programming interface (REST API) and a user-friendly website. We thus generated GeniePool, a simple and intuitive web service and API for querying NGS data from SRA with direct access to information related to each sample and related studies, providing significant advantages over existing databases for both clinical and research usages. Utilizing data lake infrastructure, we were able to generate a multi-purpose tool that can serve many clinical and research use cases. We expect users to explore the meta-data served via GeniePool both in daily clinical practice and in versatile research endeavours. Database URL https://geniepool.link",
                "authors": [
                    {
                        "name": "Birk O.S."
                    },
                    {
                        "name": "Dolev S."
                    },
                    {
                        "name": "Gudes E."
                    },
                    {
                        "name": "Hadar N."
                    },
                    {
                        "name": "Weintraub G."
                    }
                ],
                "citationCount": 3,
                "date": "2023-01-01T00:00:00Z",
                "journal": "Database",
                "title": "GeniePool: genomic database with corresponding annotated samples based on a cloud data lake architecture"
            },
            "pmcid": "PMC10263466",
            "pmid": "37311148"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Exome sequencing",
            "uri": "http://edamontology.org/topic_3676"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Whole genome sequencing",
            "uri": "http://edamontology.org/topic_3673"
        }
    ]
}
