
{
    "credit": [
        {
            "email": "estiyl@bgu.ac.il",
            "name": "Esti Yeger-Lotem",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "FAQ",
            "url": "http://netbio.bgu.ac.il/labwebsite/the-responsenet-v-3-faq/"
        },
        {
            "type": "Training material",
            "url": "http://netbio.bgu.ac.il/labwebsite/the-responsenet-v-3-tutorial/"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Pathway or network prediction",
                    "uri": "http://edamontology.org/operation_3439"
                },
                {
                    "term": "Data handling",
                    "uri": "http://edamontology.org/operation_2409"
                },
                {
                    "term": "Gene regulatory network analysis",
                    "uri": "http://edamontology.org/operation_1781"
                },
                {
                    "term": "Over-representation analysis",
                    "uri": "http://edamontology.org/operation_3501"
                }
            ]
        }
    ],
    "labels": {
        "accessibility": [
            "Open access"
        ],
        "cost": "Free of charge",
        "license": "Unlicense",
        "maturity": "Mature",
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web API",
            "Web application"
        ],
        "topic": [
            {
                "term": "Molecular interactions, pathways and networks",
                "uri": "http://edamontology.org/topic_0602"
            },
            {
                "term": "Functional, regulatory and non-coding RNA",
                "uri": "http://edamontology.org/topic_0659"
            },
            {
                "term": "Transcriptomics",
                "uri": "http://edamontology.org/topic_3308"
            },
            {
                "term": "Pathology",
                "uri": "http://edamontology.org/topic_0634"
            },
            {
                "term": "Humans",
                "uri": "http://edamontology.org/topic_2815"
            }
        ]
    },
    "publication": [
        {
            "abstract": "Genome sequencing and transcriptomic profiling are two widely used approaches for the identification of human disease pathways. However, each approach typically provides a limited view of disease pathways: Genome sequencing can identify disease-related mutations but rarely reveals their mode-of-action, while transcriptomic assays do not reveal the series of events that lead to the transcriptomic change. ResponseNet is an integrative network-optimization approach that we developed to fill these gaps by highlighting major signaling and regulatory molecular interaction paths that connect disease-related mutations and genes. The ResponseNet web-server provides a user-friendly interface to ResponseNet. Specifically, users can upload weighted lists of proteins and genes and obtain a sparse, weighted, molecular interaction subnetwork connecting them, that is biased toward regulatory and signaling pathways. ResponseNet2.0 enhances the functionality of the ResponseNet web-server in two important ways. First, it supports analysis of human data by offering a human interactome composed of proteins, genes and micro-RNAs. Second, it offers a new informative view of the output, including a randomization analysis, to help users assess the biological relevance of the output subnetwork. ResponseNet2.0 is available at http://netbio.bgu.ac.il/respnet .",
            "authors": [
                "Basha O.",
                "Tirman S.",
                "Eluk A.",
                "Yeger-Lotem E."
            ],
            "cit_count": 15,
            "journal": "Nucleic acids research",
            "pmid": "23761447",
            "title": "ResponseNet2.0: Revealing signaling and regulatory pathways connecting your proteins and genes--now with human data.",
            "year": "2013-01-01"
        },
        {
            "abstract": "Cellular response to stimuli is typically complex and involves both regulatory and metabolic processes. Large-scale experimental efforts to identify components of these processes often comprise of genetic screening and transcriptomic profiling assays. We previously established that in yeast genetic screens tend to identify response regulators, while transcriptomic profiling assays tend to identify components of metabolic processes. ResponseNet is a network-optimization approach that integrates the results from these assays with data of known molecular interactions. Specifically, ResponseNet identifies a high-probability sub-network, composed of signaling and regulatory molecular interaction paths, through which putative response regulators may lead to the measured transcriptomic changes. Computationally, this is achieved by formulating a minimum-cost flow optimization problem and solving it efficiently using linear programming tools. The ResponseNet web server offers a simple interface for applying ResponseNet. Users can upload weighted lists of proteins and genes and obtain a sparse, weighted, molecular interaction sub-network connecting their data. The predicted sub-network and its gene ontology enrichment analysis are presented graphically or as text. Consequently, the ResponseNet web server enables researchers that were previously limited to separate analysis of their distinct, large-scale experiments, to meaningfully integrate their data and substantially expand their understanding of the underlying cellular response. ResponseNet is available at http://bioinfo.bgu.ac. il/respnet. © 2011 The Author(s).",
            "authors": [
                "Lan A.",
                "Smoly I.Y.",
                "Rapaport G.",
                "Lindquist S.",
                "Fraenkel E.",
                "Yeger-Lotem E."
            ],
            "cit_count": 49,
            "journal": "Nucleic Acids Research",
            "pmid": "21576238",
            "title": "ResponseNet: Revealing signaling and regulatory networks linking genetic and transcriptomic screening data",
            "year": "2011-07-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:responsenet",
        "biotoolsID": "responsenet",
        "description": "Network optimization approach for revealing signaling and regulatory networks linking genetic and transcriptomic screening data. Users upload weighted lists of proteins and genes. 2.0 version enhances the functionality by offering a human interactome of proteins, genes and micro-RNAs, and better output visualization.",
        "homepage": "http://netbio.bgu.ac.il/respnet/",
        "name": "ResponseNet"
    }
}