
{
    "credit": [
        {
            "email": "help@pancreasexpression.org.uk",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://www.pancreasexpression.org/includes/help.html"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Gene expression clustering",
                    "uri": "http://edamontology.org/operation_0313"
                },
                {
                    "term": "Gene expression comparison",
                    "uri": "http://edamontology.org/operation_0315"
                },
                {
                    "term": "Gene expression profiling",
                    "uri": "http://edamontology.org/operation_0314"
                },
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                },
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Database portal"
        ],
        "topic": [
            {
                "term": "Functional, regulatory and non-coding RNA",
                "uri": "http://edamontology.org/topic_0659"
            },
            {
                "term": "Gene expression",
                "uri": "http://edamontology.org/topic_0203"
            },
            {
                "term": "Omics",
                "uri": "http://edamontology.org/topic_3391"
            },
            {
                "term": "Oncology",
                "uri": "http://edamontology.org/topic_2640"
            }
        ]
    },
    "publication": [
        {
            "abstract": "The Pancreatic Expression database (PED, http:// www.pancreasexpression. org) has established itself as the main repository for pancreatic-derived -omics data. For the past 3 years, its data content and access have increased substantially. Here we describe several of its new and improved features, such as data content, which now includes over 60 000 measurements derived from transcriptomics, proteomics, genomics and miRNA profiles from various pancreas-centred reports on a broad range of specimen and experimental types. We also illustrate the capabilities of its interface, which allows integrative queries that can combine PED data with a growing number of biological resources such as NCBI, Ensembl, UniProt and Reactome. Thus, PED is capable of retrieving and integrating different types of -omics, annotations and clinical data. We also focus on the importance of data sharing and interoperability in the cancer field, and the integration of PED into the International Cancer Genome Consortium (ICGC) data portal. © The Author(s) 2010.",
            "authors": [
                "Cutts R.J.",
                "Gadaleta E.",
                "Hahn S.A.",
                "Crnogorac-Jurcevic T.",
                "Lemoine N.R.",
                "Chelala C."
            ],
            "cit_count": 25,
            "journal": "Nucleic Acids Research",
            "pmid": "20959292",
            "title": "The pancreatic expression database: 2011 update",
            "year": "2011-01-01"
        },
        {
            "abstract": "We describe the Pancreatic Expression Database (PED), the first cancer database originally designed based on the BioMart infrastructure. The PED portal brings together multidimensional pancreatic cancer data from the literature including genomic, proteomic, miRNA and gene expression profiles. Based on the BioMart 0.7 framework, the database is easily integrated with other BioMart-compliant resources, such as Ensembl and Reactome, to give access to a wide range of annotations alongside detailed experimental conditions. This article is intended to give an overview of PED, describe its data content and work through examples of how to successfully mine and integrate pancreatic cancer data sets and other BioMart resources. © The Author(s) 2011.",
            "authors": [
                "Cutts R.J.",
                "Gadaleta E.",
                "Lemoine N.R.",
                "Chelala C."
            ],
            "cit_count": 10,
            "journal": "Database",
            "pmid": "21666272",
            "title": "Using BioMart as a framework to manage and query pancreatic cancer data",
            "year": "2011-12-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:ped",
        "biotoolsID": "ped",
        "description": "Repository for pancreatic-derived -omics data. It includes easurements derived from transcriptomics, proteomics, genomics and miRNA profiles from various pancreas-centred reports on a broad range of specimen and experimental types.",
        "homepage": "http://www.pancreasexpression.org",
        "name": "Pancreatic Expression Database (PED)"
    }
}