{
    "additionDate": "2024-04-08T10:39:51.095647Z",
    "biotoolsCURIE": "biotools:trap_t",
    "biotoolsID": "trap_t",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "hashem.koohy@rdm.ox.ac.uk",
            "name": "Hashem Koohy",
            "orcidid": "https://orcid.org/0000-0002-3640-7043",
            "typeEntity": "Person"
        }
    ],
    "description": "A robust deep learning workflow to predict CD8 + T-cell epitopes.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Epitope mapping",
                    "uri": "http://edamontology.org/operation_0416"
                },
                {
                    "term": "Peptide immunogenicity prediction",
                    "uri": "http://edamontology.org/operation_0252"
                },
                {
                    "term": "Side chain modelling",
                    "uri": "http://edamontology.org/operation_0480"
                },
                {
                    "term": "Virulence prediction",
                    "uri": "http://edamontology.org/operation_3461"
                }
            ]
        }
    ],
    "homepage": "https://github.com/ChloeHJ/TRAP",
    "language": [
        "R"
    ],
    "lastUpdate": "2024-04-08T10:39:51.098348Z",
    "license": "CC-BY-NC-SA-3.0",
    "link": [
        {
            "type": [
                "Service"
            ],
            "url": "http://35.176.114.129:8050/"
        }
    ],
    "name": "TRAP",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S13073-023-01225-Z",
            "metadata": {
                "abstract": "Background: T-cells play a crucial role in the adaptive immune system by triggering responses against cancer cells and pathogens, while maintaining tolerance against self-antigens, which has sparked interest in the development of various T-cell-focused immunotherapies. However, the identification of antigens recognised by T-cells is low-throughput and laborious. To overcome some of these limitations, computational methods for predicting CD8 + T-cell epitopes have emerged. Despite recent developments, most immunogenicity algorithms struggle to learn features of peptide immunogenicity from small datasets, suffer from HLA bias and are unable to reliably predict pathology-specific CD8 + T-cell epitopes. Methods: We developed TRAP (T-cell recognition potential of HLA-I presented peptides), a robust deep learning workflow for predicting CD8 + T-cell epitopes from MHC-I presented pathogenic and self-peptides. TRAP uses transfer learning, deep learning architecture and MHC binding information to make context-specific predictions of CD8 + T-cell epitopes. TRAP also detects low-confidence predictions for peptides that differ significantly from those in the training datasets to abstain from making incorrect predictions. To estimate the immunogenicity of pathogenic peptides with low-confidence predictions, we further developed a novel metric, RSAT (relative similarity to autoantigens and tumour-associated antigens), as a complementary to ‘dissimilarity to self’ from cancer studies. Results: TRAP was used to identify epitopes from glioblastoma patients as well as SARS-CoV-2 peptides, and it outperformed other algorithms in both cancer and pathogenic settings. TRAP was especially effective at extracting immunogenicity-associated properties from restricted data of emerging pathogens and translating them onto related species, as well as minimising the loss of likely epitopes in imbalanced datasets. We also demonstrated that the novel metric termed RSAT was able to estimate immunogenic of pathogenic peptides of various lengths and species. TRAP implementation is available at: https://github.com/ChloeHJ/TRAP . Conclusions: This study presents a novel computational workflow for accurately predicting CD8 + T-cell epitopes to foster a better understanding of antigen-specific T-cell response and the development of effective clinical therapeutics.",
                "authors": [
                    {
                        "name": "Antanaviciute A."
                    },
                    {
                        "name": "Buckley P.R."
                    },
                    {
                        "name": "Fernandes R.A."
                    },
                    {
                        "name": "Huh J."
                    },
                    {
                        "name": "Jang M."
                    },
                    {
                        "name": "Koohy H."
                    },
                    {
                        "name": "Lee C.H."
                    },
                    {
                        "name": "Pinho M.P."
                    },
                    {
                        "name": "Simmons A."
                    }
                ],
                "date": "2023-12-01T00:00:00Z",
                "journal": "Genome Medicine",
                "title": "A robust deep learning workflow to predict CD8 + T-cell epitopes"
            },
            "pmcid": "PMC10498576",
            "pmid": "37705109"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Immunogenetics",
            "uri": "http://edamontology.org/topic_3930"
        },
        {
            "term": "Immunoinformatics",
            "uri": "http://edamontology.org/topic_3948"
        },
        {
            "term": "Immunoproteins and antigens",
            "uri": "http://edamontology.org/topic_2830"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Vaccinology",
            "uri": "http://edamontology.org/topic_3966"
        }
    ]
}
