{
    "additionDate": "2021-01-18T11:12:43Z",
    "biotoolsCURIE": "biotools:metalaffa",
    "biotoolsID": "metalaffa",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "elbo@tauex.tau.ac.il",
            "name": "Elhanan Borenstein",
            "typeEntity": "Person"
        }
    ],
    "description": "A flexible, end-to-end, distributed computing-compatible metagenomic functional annotation pipeline.\n\nMetaLAFFA is a flexible, end-to-end, and compute cluster-compatible metagenomic functional annotation pipeline.\nMetaLAFFA is a pipeline for annotating shotgun metagenomic data with abundances of functional orthology groups. This process consists of several steps to go from raw FASTQs (with sequencing adapters removed) to functional profiles:.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genome annotation",
                    "uri": "http://edamontology.org/operation_0362"
                },
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                },
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                },
                {
                    "term": "Sequence trimming",
                    "uri": "http://edamontology.org/operation_3192"
                },
                {
                    "term": "Sequence assembly",
                    "uri": "http://edamontology.org/operation_0310"
                }
            ]
        }
    ],
    "homepage": "https://github.com/borenstein-lab/MetaLAFFA",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-02-22T07:53:25Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "http://borensteinlab.com/software_metalaffa.html"
        }
    ],
    "name": "MetaLAFFA",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1186/S12859-020-03815-9",
            "metadata": {
                "abstract": "© 2020, The Author(s).Background: Microbial communities have become an important subject of research across multiple disciplines in recent years. These communities are often examined via shotgun metagenomic sequencing, a technology which can offer unique insights into the genomic content of a microbial community. Functional annotation of shotgun metagenomic data has become an increasingly popular method for identifying the aggregate functional capacities encoded by the community’s constituent microbes. Currently available metagenomic functional annotation pipelines, however, suffer from several shortcomings, including limited pipeline customization options, lack of standard raw sequence data pre-processing, and insufficient capabilities for integration with distributed computing systems. Results: Here we introduce MetaLAFFA, a functional annotation pipeline designed to take unfiltered shotgun metagenomic data as input and generate functional profiles. MetaLAFFA is implemented as a Snakemake pipeline, which enables convenient integration with distributed computing clusters, allowing users to take full advantage of available computing resources. Default pipeline settings allow new users to run MetaLAFFA according to common practices while a Python module-based configuration system provides advanced users with a flexible interface for pipeline customization. MetaLAFFA also generates summary statistics for each step in the pipeline so that users can better understand pre-processing and annotation quality. Conclusions: MetaLAFFA is a new end-to-end metagenomic functional annotation pipeline with distributed computing compatibility and flexible customization options. MetaLAFFA source code is available at https://github.com/borenstein-lab/MetaLAFFA and can be installed via Conda as described in the accompanying documentation.",
                "authors": [
                    {
                        "name": "Eng A."
                    },
                    {
                        "name": "Verster A.J."
                    },
                    {
                        "name": "Borenstein E."
                    }
                ],
                "citationCount": 1,
                "date": "2020-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "MetaLAFFA: a flexible, end-to-end, distributed computing-compatible metagenomic functional annotation pipeline"
            },
            "pmcid": "PMC7579964",
            "pmid": "33087062"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        },
        {
            "term": "Metagenomic sequencing",
            "uri": "http://edamontology.org/topic_3837"
        },
        {
            "term": "Microbial ecology",
            "uri": "http://edamontology.org/topic_3697"
        }
    ]
}