{
    "accessibility": "Open access",
    "additionDate": "2022-05-09T18:32:48.441807Z",
    "biotoolsCURIE": "biotools:fcngru",
    "biotoolsID": "fcngru",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Qinhu Zhang",
            "orcidid": "https://orcid.org/0000-0002-4232-7736"
        },
        {
            "name": "Siguo Wang",
            "orcidid": "https://orcid.org/0000-0002-3244-3629"
        },
        {
            "name": "Ying He",
            "orcidid": "https://orcid.org/0000-0002-9592-7727"
        },
        {
            "name": "Zhanheng Chen",
            "orcidid": "https://orcid.org/0000-0002-2331-4446"
        }
    ],
    "description": "Locating Transcription Factor Binding Sites by combing Fully Convolutional Neural Network with Gated Recurrent Unit.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                },
                {
                    "term": "Transcription factor binding site prediction",
                    "uri": "http://edamontology.org/operation_0445"
                }
            ]
        }
    ],
    "homepage": "https://github.com/wangguoguoa/FCNGRU",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-05-09T18:32:48.444420Z",
    "license": "Not licensed",
    "name": "FCNGRU",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1109/JBHI.2021.3117616",
            "metadata": {
                "abstract": "© 2013 IEEE.Deciphering the relationship between transcription factors (TFs) and DNA sequences is very helpful for computational inference of gene regulation and a comprehensive understanding of gene regulation mechanisms. Transcription factor binding sites (TFBSs) are specific DNA short sequences that play a pivotal role in controlling gene expression through interaction with TF proteins. Although recently many computational and deep learning methods have been proposed to predict TFBSs aiming to predict sequence specificity of TF-DNA binding, there is still a lack of effective methods to directly locate TFBSs. In order to address this problem, we propose FCNGRU combing a fully convolutional neural network (FCN) with the gated recurrent unit (GRU) to directly locate TFBSs in this paper. Furthermore, we present a two-task framework (FCNGRU-double): one is a classification task at nucleotide level which predicts the probability of each nucleotide and locates TFBSs, and the other is a regression task at sequence level which predicts the intensity of each sequence. A series of experiments are conducted on 45 in-vitro datasets collected from the UniPROBE database derived from universal protein binding microarrays (uPBMs). Compared with competing methods, FCNGRU-double achieves much better results on these datasets. Moreover, FCNGRU-double has an advantage over a single-task framework, FCNGRU-single, which only contains the branch of locating TFBSs. In addition, we combine with in vivo datasets to make a further analysis and discussion.",
                "authors": [
                    {
                        "name": "Chen Z."
                    },
                    {
                        "name": "He Y."
                    },
                    {
                        "name": "Wang S."
                    },
                    {
                        "name": "Zhang Q."
                    }
                ],
                "date": "2022-04-01T00:00:00Z",
                "journal": "IEEE Journal of Biomedical and Health Informatics",
                "title": "FCNGRU: Locating Transcription Factor Binding Sites by Combing Fully Convolutional Neural Network With Gated Recurrent Unit"
            },
            "pmid": "34613923"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Gene regulation",
            "uri": "http://edamontology.org/topic_0204"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ],
    "validated": 1
}
