
{
    "credit": [
        {
            "name": "C.N.R. - IBIOM",
            "typeEntity": "Institute",
            "typeRoles": [
                "Developer"
            ],
            "url": "http://www.ibiom.cnr.it/"
        },
        {
            "name": "C.N.R. - ITB, Bari",
            "typeEntity": "Institute",
            "typeRoles": [
                "Developer"
            ],
            "url": "http://www.ba.itb.cnr.it"
        },
        {
            "name": "ELIXIR-ITA-CNR",
            "typeEntity": "Consortium",
            "typeRoles": [
                "Provider"
            ],
            "url": "http://elixir-italy.org/"
        },
        {
            "email": "graziano.pesole@uniba.it",
            "name": "Graziano Pesole",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://itsonedb.ba.itb.cnr.it/"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                }
            ]
        }
    ],
    "labels": {
        "cost": "Free of charge",
        "elixirNode": [
            "Italy"
        ],
        "elixirPlatform": [
            "Data"
        ],
        "maturity": "Emerging",
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Database portal"
        ],
        "topic": [
            {
                "term": "Metagenomics",
                "uri": "http://edamontology.org/topic_3174"
            }
        ]
    },
    "publication": [
        {
            "abstract": "Metagenomics is providing an unprecedented access to the environmental microbial diversity. The amplicon-based metagenomics approach involves the PCR-targeted sequencing of a genetic locus fitting different features. Namely, it must be ubiquitous in the taxonomic range of interest, variable enough to discriminate between different species but flanked by highly conserved sequences, and of suitable size to be sequenced through next-generation platforms. The internal transcribed spacers 1 and 2 (ITS1 and ITS2) of the ribosomal DNA operon and one or more hyper-variable regions of 16S ribosomal RNA gene are typically used to identify fungal and bacterial species, respectively. In this context, reliable reference databases and taxonomies are crucial to assign amplicon sequence reads to the correct phylogenetic ranks. Several resources provide consistent phylogenetic classification of publicly available 16S ribosomal DNA sequences, whereas the state of ribosomal internal transcribed spacers reference databases is notably less advanced. In this review, we aim to give an overview of existing reference resources for both types of markers, highlighting strengths and possible shortcomings of their use for metagenomics purposes. Moreover, we present a new database, ITSoneDB, of well annotated and phylogenetically classified ITS1 sequences to be used as a reference collection in metagenomic studies of environmental fungal communities. ITSoneDB is available for download and browsing at http://itsonedb.ba.itb.cnr.it/. © The Author 2012. Published by Oxford University Press.",
            "authors": [
                "Santamaria M.",
                "Fosso B.",
                "Consiglio A.",
                "De caro G.",
                "Grillo G.",
                "Licciulli F.",
                "Liuni S.",
                "Marzano M.",
                "Alonso-alemany D.",
                "Valiente G.",
                "Pesole G."
            ],
            "cit_count": 50,
            "doi": "10.1093/bib/bbs036",
            "journal": "Briefings in Bioinformatics",
            "title": "Reference databases for taxonomic assignment in metagenomics",
            "type": "Primary",
            "year": "2012-11-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:itsonedb",
        "biotoolsID": "itsonedb",
        "description": "A comprehensive collection of the fungal ribosomal RNA Internal Transcribed Spacer 1 (ITS1) sequences aimed at supporting metagenomic surveys of fungal environmental communities.",
        "homepage": "http://itsonedb.ba.itb.cnr.it",
        "name": "ITSoneDB"
    }
}