{
    "additionDate": "2024-04-18T13:06:12.987089Z",
    "biotoolsCURIE": "biotools:listiwiki",
    "biotoolsID": "listiwiki",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "halbedels@rki.de",
            "name": "Sven Halbedel",
            "orcidid": "https://orcid.org/0000-0002-5575-8973",
            "typeEntity": "Person"
        },
        {
            "email": "jstuelk@gwdg.de",
            "name": "Jörg Stülke",
            "typeEntity": "Person"
        }
    ],
    "description": "A database for the foodborne pathogen Listeria monocytogenes.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genome annotation",
                    "uri": "http://edamontology.org/operation_0362"
                },
                {
                    "term": "Genome visualisation",
                    "uri": "http://edamontology.org/operation_3208"
                },
                {
                    "term": "Protein interaction prediction",
                    "uri": "http://edamontology.org/operation_2492"
                }
            ]
        }
    ],
    "homepage": "http://listiwiki.uni-goettingen.de/",
    "lastUpdate": "2024-04-18T13:06:12.989886Z",
    "name": "ListiWiki",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1016/J.IJMM.2023.151591",
            "metadata": {
                "abstract": "Listeria monocytogenes is a Gram positive foodborne pathogen that regularly causes outbreaks of systemic infectious diseases. The bacterium maintains a facultative intracellular lifestyle; it thrives under a variety of environmental conditions and is able to infect human host cells. L. monocytogenes is genetically tractable and therefore has become an attractive model system to study the mechanisms employed by facultative intracellular bacteria to invade eukaryotic cells and to replicate in their cytoplasm. Besides its importance for basic research, L. monocytogenes also serves as a paradigmatic pathogen in genomic epidemiology, where the relative stability of its genome facilitates successful outbreak detection and elucidation of transmission chains in genomic pathogen surveillance systems. In both terms, it is necessary to keep the annotation of the L. monocytogenes genome up to date. Therefore, we have created the database ListiWiki (http://listiwiki.uni-goettingen.de/) which stores comprehensive information on the widely used L. monocytogenes reference strain EDG-e. ListiWiki is designed to collect information on genes, proteins and RNAs and their relevant functional characteristics, but also further information such as mutant phenotypes, available biological material, and publications. In its present form, ListiWiki combines the most recent annotation of the EDG-e genome with published data on gene essentiality, gene expression and subcellular protein localization. ListiWiki also predicts protein-protein interactions networks based on protein homology to Bacillus subtilis proteins, for which detailed interaction maps have been compiled in the sibling database SubtiWiki. Furthermore, crystallographic information of proteins is made accessible through integration of Protein Structure Database codes and AlphaFold structure predictions. ListiWiki is an easy-to-use web interface that has been developed with a focus on an intuitive access to all information. Use of ListiWiki is free of charge and its content can be edited by all members of the scientific community after registration. In our labs, ListiWiki has already become an important and easy to use tool to quickly access genome annotation details that we can keep updated with advancing knowledge. It also might be useful to promote the comprehensive understanding of the physiology and virulence of an important human pathogen.",
                "authors": [
                    {
                        "name": "Elfmann C."
                    },
                    {
                        "name": "Halbedel S."
                    },
                    {
                        "name": "Stulke J."
                    },
                    {
                        "name": "Zhu B."
                    }
                ],
                "citationCount": 1,
                "date": "2023-11-01T00:00:00Z",
                "journal": "International Journal of Medical Microbiology",
                "title": "ListiWiki: A database for the foodborne pathogen Listeria monocytogenes"
            },
            "pmid": "38043216"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Infectious disease",
            "uri": "http://edamontology.org/topic_3324"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "Public health and epidemiology",
            "uri": "http://edamontology.org/topic_3305"
        }
    ]
}
