{
    "additionDate": "2020-01-09T18:17:01Z",
    "biotoolsCURIE": "biotools:TFTRs",
    "biotoolsID": "TFTRs",
    "confidence_flag": "medium",
    "credit": [
        {
            "email": "J.m.a.blair@bham.ac.uk",
            "name": "J. M. A. Blair",
            "orcidid": "https://orcid.org/0000-0001-6904-4253",
            "typeEntity": "Person"
        }
    ],
    "description": "conservation, variation and implications for efflux-mediated antimicrobial resistance.\n\nBACKGROUND:TetR-family transcriptional regulators (TFTRs) are DNA binding factors that regulate gene expression in bacteria. Well-studied TFTRs, such as AcrR, which regulates efflux pump expression, are usually encoded alongside target operons. Recently, it has emerged that there are many TFTRs which act as global multi-target regulators. Our classical view of TFTRs as simple, single-target regulators therefore needs to be reconsidered. As some TFTRs regulate essential processes (e.g. metabolism) or processes which are important determinants of resistance and virulence (e.g. biofilm formation and efflux gene expression) and as TFTRs are present throughout pathogenic bacteria, they may be good drug discovery targets for tackling antimicrobial resistant infections.\n\n||| HOMEPAGE MISSING!.\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'TetR-family transcription factors Gram-negative bacteria'",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Antimicrobial resistance prediction",
                    "uri": "http://edamontology.org/operation_3482"
                }
            ]
        }
    ],
    "homepage": "https://www.ncbi.nlm.nih.gov/pubmed/?term=31606035",
    "lastUpdate": "2020-01-09T18:17:01Z",
    "name": "TFTRs",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12864-019-6075-5",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: TetR-family transcriptional regulators (TFTRs) are DNA binding factors that regulate gene expression in bacteria. Well-studied TFTRs, such as AcrR, which regulates efflux pump expression, are usually encoded alongside target operons. Recently, it has emerged that there are many TFTRs which act as global multi-target regulators. Our classical view of TFTRs as simple, single-target regulators therefore needs to be reconsidered. As some TFTRs regulate essential processes (e.g. metabolism) or processes which are important determinants of resistance and virulence (e.g. biofilm formation and efflux gene expression) and as TFTRs are present throughout pathogenic bacteria, they may be good drug discovery targets for tackling antimicrobial resistant infections. However, the prevalence and conservation of individual TFTR genes in Gram-negative species, has to our knowledge, not yet been studied. Results: Here, a wide-scale search for TFTRs in available proteomes of clinically relevant pathogens Salmonella and Escherichia species was performed and these regulators further characterised. The majority of identified TFTRs are involved in efflux regulation in both Escherichia and Salmonella. The percentage variance in TFTR genes of these genera was found to be higher in those regulating genes involved in efflux, bleach survival or biofilm formation than those regulating more constrained processes. Some TFTRs were found to be present in all strains and species of these two genera, whereas others (i.e. TetR) are only present in some strains and some (i.e. RamR) are genera-specific. Two further pathogens on the WHO priority pathogen list (K. pneumoniae and P. aeruginosa) were then searched for the presence of the TFTRs conserved in Escherichia and Salmonella. Conclusions: Through bioinformatics and literature analyses, we present that TFTRs are a varied and heterogeneous family of proteins required for the regulation of numerous important processes, with consequences to antimicrobial resistance and virulence, and that the roles and responses of these proteins are frequently underestimated.",
                "authors": [
                    {
                        "name": "Colclough A.L."
                    },
                    {
                        "name": "Scadden J."
                    },
                    {
                        "name": "Blair J.M.A."
                    }
                ],
                "date": "2019-10-12T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "TetR-family transcription factors in Gram-negative bacteria: Conservation, variation and implications for efflux-mediated antimicrobial resistance"
            },
            "pmcid": "PMC6790063",
            "pmid": "31606035"
        }
    ],
    "topic": [
        {
            "term": "Gene regulation",
            "uri": "http://edamontology.org/topic_0204"
        },
        {
            "term": "Gene structure",
            "uri": "http://edamontology.org/topic_0114"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Endocrinology and metabolism",
            "uri": "http://edamontology.org/topic_3407"
        }
    ]
}