{
    "additionDate": "2017-12-18T00:12:56Z",
    "biotoolsCURIE": "biotools:scoregene",
    "biotoolsID": "scoregene",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://systemsbio.cs.huji.ac.il/Friedmans_Lab/Home.html"
        }
    ],
    "description": "Data analysis toolkit designed for large sets of gene expressions over various experiments. Includes methods for evaluating data sets, discovering informative genes that are differentially expressed across the classes, classifying the experiments using supervised learning algorithms, and clustering the genes using semi-supervised learning method.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://www.cs.huji.ac.il/labs/compbio/scoregenes/ScoreGenesManual.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Microarray data analysis",
                    "uri": "http://edamontology.org/operation_2495"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Gene expression data analysis",
                    "uri": "http://edamontology.org/operation_2495"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                }
            ]
        }
    ],
    "homepage": "http://www.cs.huji.ac.il/labs/compbio/scoregenes/",
    "lastUpdate": "2018-12-10T12:58:58Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/scoregene-1-0-gene-expression-data-analysis-toolkit.html"
        }
    ],
    "name": "ScoreGene",
    "operatingSystem": [
        "Linux",
        "Windows"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btg487",
            "metadata": {
                "abstract": "Motivation: Recent years' exponential increase in DNA microarrays experiments has motivated the development of many signal quantitation (SQ) algorithms. These algorithms perform various transformations on the actual measurements aimed to enable researchers to compare readings of different genes quantitatively within one experiment and across separate experiments. However, it is relatively unclear whether there is a 'best' algorithm to quantitate microarray data. The ability to compare and assess such algorithms is crucial for any downstream analysis. In this work, we suggest a methodology for comparing different signal quantitation algorithms for gene expression data. Our aim is to enable researchers to compare the effect of different SQ algorithms on the specific dataset they are dealing with. We combine two kinds of tests to assess the effect of an SQ algorithm in terms of signal to noise ratio. To assess noise, we exploit redundancy within the experimental dataset to test the variability of a given SQ algorithm output. For the effect of the SQ on the signal we evaluate the overabundance of differentially expressed genes using various statistical significance tests. Results: We demonstrate our analysis approach with three SQ algorithms for oligonucleotide microarrays. We compare the results of using the dChip software and the RMAExpress software to the ones obtained by using the standard Affymetrix MAS5 on a dataset containing pairs of repeated hybridizations. Our analysis suggests that dChip is more robust and stable than the MAS5 tools for about 60% of the genes while RMAExpress is able to achieve an even greater improvement in terms of signal to noise, for more than 95% of the genes. © Oxford University Press 2004; all rights reserved.",
                "authors": [
                    {
                        "name": "Barash Y."
                    },
                    {
                        "name": "Dehan E."
                    },
                    {
                        "name": "Krupsky M."
                    },
                    {
                        "name": "Franklin W."
                    },
                    {
                        "name": "Geraci M."
                    },
                    {
                        "name": "Friedman N."
                    },
                    {
                        "name": "Kaminski N."
                    }
                ],
                "citationCount": 74,
                "date": "2004-04-12T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Comparative analysis of algorithms for signal quantitation from oligonucleotide microarrays"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        }
    ],
    "validated": 1,
    "version": [
        "1.0"
    ]
}