{
    "additionDate": "2017-02-10T14:16:00Z",
    "biotoolsCURIE": "biotools:promals3d",
    "biotoolsID": "promals3d",
    "credit": [
        {
            "email": "jpei@chop.swmed.edu",
            "name": "PROMALS3D Support",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "PROMALS (Profile Multiple Alignment with Local Structure) is a progressive mutliple sequence alignment method that improves alignment quality by using additional homologs from PSI-BLAST searches and secondary structure predictions from PSIPRED.  PROMALS3D constructs alignments for multiple protein sequences and/or structures using information from sequence database searches, secondary structure prediction, available homologs with 3D structures and user-defined constraints.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://prodata.swmed.edu/promals3d/info/promals3d_help.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Multiple sequence alignment",
                    "uri": "http://edamontology.org/operation_0492"
                },
                {
                    "term": "Protein secondary structure comparison",
                    "uri": "http://edamontology.org/operation_2488"
                },
                {
                    "term": "Protein secondary structure prediction",
                    "uri": "http://edamontology.org/operation_0267"
                }
            ]
        }
    ],
    "homepage": "http://prodata.swmed.edu/promals3d",
    "lastUpdate": "2018-12-10T12:58:56Z",
    "name": "PROMALS3D",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "Multiple sequence alignments are essential in computational sequence and structural analysis, with applications in homology detection, structure modeling, function prediction and phylogenetic analysis. We report PROMALS3D web server for constructing alignments for multiple protein sequences and/or structures using information from available 3D structures, database homologs and predicted secondary structures. PROMALS3D shows higher alignment accuracy than a number of other advanced methods. Input of PROMALS3D web server can be FASTA format protein sequences, PDB format protein structures and/or user-defined alignment constraints. The output page provides alignments with several formats, including a colored alignment augmented with useful information about sequence grouping, predicted secondary structures and consensus sequences. Intermediate results of sequence and structural database searches are also available. The PROMALS3D web server is available at: http://prodata.swmed.edu/promals3d/.",
                "authors": [
                    {
                        "name": "Pei J."
                    },
                    {
                        "name": "Tang M."
                    },
                    {
                        "name": "Grishin N.V."
                    }
                ],
                "citationCount": 112,
                "date": "2008-01-01T00:00:00Z",
                "journal": "Nucleic acids research",
                "title": "PROMALS3D web server for accurate multiple protein sequence and structure alignments."
            },
            "pmid": "18503087"
        },
        {
            "metadata": {
                "abstract": "Motivation: Accurate multiple sequence alignments are essential in protein structure modeling, functional prediction and efficient planning of experiments. Although the alignment problem has attracted considerable attention, preparation of high-quality alignments for distantly related sequences remains a difficult task. Results: We developed PROMALS, a multiple alignment method that shows promising results for protein homologs with sequence identity below 10%, aligning close to half of the amino acid residues correctly on average. This is about three times more accurate than traditional pairwise sequence alignment methods. PROMALS algorithm derives its strength from several sources: (i) sequence database searches to retrieve additional homologs; (ii) accurate secondary structure prediction; (iii) a hidden Markov model that uses a novel combined scoring of amino acids and secondary structures; (iv) probabilistic consistency-based scoring applied to progressive alignment of profiles. Compared to the best alignment methods that do not use secondary structure prediction and database searches (e.g. MUMMALS, ProbCons and MAFFT), PROMALS is up to 30% more accurate, with improvement being most prominent for highly divergent homologs. Compared to SPEM and HHalign, which also employ database searches and secondary structure prediction, PROMALS shows an accuracy improvement of several percent. © The Author 2007. Published by Oxford University Press. All rights reserved.",
                "authors": [
                    {
                        "name": "Pei J."
                    },
                    {
                        "name": "Grishin N.V."
                    }
                ],
                "citationCount": 238,
                "date": "2007-04-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "PROMALS: Towards accurate multiple sequence alignments of distantly related proteins"
            },
            "pmid": "17267437"
        },
        {
            "metadata": {
                "abstract": "Multiple sequence alignments are essential in homology inference, structure modeling, functional prediction and phylogenetic analysis. We developed a web server that constructs multiple protein sequence alignments using PROMALS, a progressive method that improves alignment quality by using additional homologs from PSI-BLAST searches and secondary structure predictions from PSIPRED. PROMALS shows higher alignment accuracy than other advanced methods, such as MUMMALS, ProbCons, MAFFT and SPEM. The PROMALS web server takes FASTA format protein sequences as input. The output includes a colored alignment augmented with information about sequence grouping, predicted secondary structures and positional conservation. The PROMALS web server is available at: http://prodata.swmed.edu/promals/. © 2007 The Author(s).",
                "authors": [
                    {
                        "name": "Pei J."
                    },
                    {
                        "name": "Kim B.-H."
                    },
                    {
                        "name": "Tang M."
                    },
                    {
                        "name": "Grishin N.V."
                    }
                ],
                "citationCount": 54,
                "date": "2007-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "PROMALS web server for accurate multiple protein sequence alignments"
            },
            "pmid": "17452345"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Structure prediction",
            "uri": "http://edamontology.org/topic_0082"
        },
        {
            "term": "Protein secondary structure",
            "uri": "http://edamontology.org/topic_3542"
        },
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        },
        {
            "term": "Structure analysis",
            "uri": "http://edamontology.org/topic_0081"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        }
    ],
    "validated": 1
}