{
    "additionDate": "2021-01-18T09:39:27Z",
    "biotoolsCURIE": "biotools:metu",
    "biotoolsID": "metu",
    "confidence_flag": "tool",
    "description": "Projecting the Course of COVID-19 in Turkey.\n\nCOVID 19 Case Projection Model for Turkey.\n\nCOVID-19 Salgın Yönetimi ve Çalışma Rehberi.\n\nTo fit data using all observations up to latest known day and project 20 days in the future:.\n\nTo fit using observations up to a certain date (e.g. May 12th, 2020):.\n\nERİŞKİN YOĞUN BAKIM DOLULUK ORANI.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Modelling and simulation",
                    "uri": "http://edamontology.org/operation_2426"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "https://github.com/kansil/covid-19",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-01-27T17:50:17Z",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "https://covid19.saglik.gov.tr/"
        }
    ],
    "name": "Projecting Course COVID-19 Turkey",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.3906/SAG-2005-378",
            "metadata": {
                "abstract": "© TÜBİTAK.Background/aim: The COVID-19 pandemic originated in Wuhan, China, in December 2019 and became one of the worst global health crises ever. While struggling with the unknown nature of this novel coronavirus, many researchers and groups attempted to project the progress of the pandemic using empirical or mechanistic models, each one having its drawbacks. The first confirmed cases were announced early in March, and since then, serious containment measures have taken place in Turkey. Materials and methods: Here, we present a different approach, a Bayesian negative binomial multilevel model with mixed effects, for the projection of the COVID-19 pandemic and we apply this model to the Turkish case. The model source code is available at https:// github.com/kansil/covid-19. We predicted the confirmed daily cases and cumulative numbers from June 6th to June 26th with 80%, 95%, and 99% prediction intervals (PI). Results: Our projections showed that if we continued to comply with the measures and no drastic changes were seen in diagnosis or management protocols, the epidemic curve would tend to decrease in this time interval. Also, the predictive validity analysis suggests that the proposed model projections should have a PI around 95% for the first 12 days of the projections. Conclusion: We expect that drastic changes in the course of COVID-19 in Turkey will cause the model to suffer in predictive validity, and this can be used to monitor the epidemic. We hope that the discussion on these projections and the limitations of the epidemiological forecasting will be beneficial to the medical community, and policy makers.",
                "authors": [
                    {
                        "name": "Acar A.C."
                    },
                    {
                        "name": "Ahmet Gorkem E.R."
                    },
                    {
                        "name": "Akin L."
                    },
                    {
                        "name": "Aydin Son Y."
                    },
                    {
                        "name": "Burduroglu H.C."
                    },
                    {
                        "name": "Sulku S.N."
                    },
                    {
                        "name": "Unal S."
                    }
                ],
                "citationCount": 2,
                "date": "2021-01-01T00:00:00Z",
                "journal": "Turkish Journal of Medical Sciences",
                "title": "Projecting the course of COVID-19 in Turkey: A probabilistic modeling approach"
            },
            "pmid": "32530587"
        }
    ],
    "topic": [
        {
            "term": "Infectious disease",
            "uri": "http://edamontology.org/topic_3324"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Public health and epidemiology",
            "uri": "http://edamontology.org/topic_3305"
        }
    ]
}
