{
    "additionDate": "2023-12-08T08:58:13.450577Z",
    "biotoolsCURIE": "biotools:fireprot_2.0",
    "biotoolsID": "fireprot_2.0",
    "description": "FireProt 2.0 is an extension of the original FireProt web for the fully automated design of stable multiple-point mutants. FireProt constructs stable mutants using both structural and evolutionary information. FireProt 2.0 also integrates the AlphaFold database and the homology modelling for structure prediction, enabling calculations starting from a sequence. Multiple-point designs are constructed using the Bron–Kerbosch algorithm minimizing the antagonistic effect between the individual mutations. Users can newly limit the FireProt calculation to a set of user-defined mutations, run saturation mutagenesis of the whole protein or select rigidifying mutations based on B-factors. Evolution-based back-to-consensus strategy is complemented by ancestral sequence reconstruction.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Protein sequence",
                        "uri": "http://edamontology.org/data_2976"
                    }
                },
                {
                    "data": {
                        "term": "Protein structure",
                        "uri": "http://edamontology.org/data_1460"
                    }
                }
            ],
            "operation": [
                {
                    "term": "Protein design",
                    "uri": "http://edamontology.org/operation_4008"
                }
            ]
        }
    ],
    "homepage": "https://loschmidt.chemi.muni.cz/fireprotweb/",
    "lastUpdate": "2024-11-24T14:28:54.237913Z",
    "link": [
        {
            "type": [
                "Service"
            ],
            "url": "https://loschmidt.chemi.muni.cz/fireprotweb/"
        }
    ],
    "name": "FireProt 2.0",
    "owner": "m.musil",
    "publication": [
        {
            "doi": "10.1093/bib/bbad425",
            "metadata": {
                "abstract": "Thermostable proteins find their use in numerous biomedical and biotechnological applications. However, the computational design of stable proteins often results in single-point mutations with a limited effect on protein stability. However, the construction of stable multiple-point mutants can prove difficult due to the possibility of antagonistic effects between individual mutations. FireProt protocol enables the automated computational design of highly stable multiple-point mutants. FireProt 2.0 builds on top of the previously published FireProt web, retaining the original functionality and expanding it with several new stabilization strategies. FireProt 2.0 integrates the AlphaFold database and the homology modeling for structure prediction, enabling calculations starting from a sequence. Multiple-point designs are constructed using the Bron-Kerbosch algorithm minimizing the antagonistic effect between the individual mutations. Users can newly limit the FireProt calculation to a set of user-defined mutations, run a saturation mutagenesis of the whole protein or select rigidifying mutations based on B-factors. Evolution-based back-to-consensus strategy is complemented by ancestral sequence reconstruction. FireProt 2.0 is significantly faster and a reworked graphical user interface broadens the tool's availability even to users with older hardware. FireProt 2.0 is freely available at http://loschmidt.chemi.muni.cz/fireprotweb.",
                "authors": [
                    {
                        "name": "Bednar D."
                    },
                    {
                        "name": "Borko S."
                    },
                    {
                        "name": "Damborsky J."
                    },
                    {
                        "name": "Horackova J."
                    },
                    {
                        "name": "Jezik A."
                    },
                    {
                        "name": "Kabourek P."
                    },
                    {
                        "name": "Musil M."
                    }
                ],
                "citationCount": 10,
                "date": "2024-01-01T00:00:00Z",
                "journal": "Briefings in Bioinformatics",
                "title": "FireProt 2.0: web-based platform for the fully automated design of thermostable proteins"
            },
            "pmcid": "PMC10685400",
            "pmid": "38018911"
        }
    ],
    "toolType": [
        "Web service"
    ],
    "topic": [
        {
            "term": "Computational biology",
            "uri": "http://edamontology.org/topic_3307"
        }
    ],
    "version": [
        "2.0"
    ]
}
