{
    "additionDate": "2017-01-17T15:04:02Z",
    "biotoolsCURIE": "biotools:biggr",
    "biotoolsID": "biggr",
    "collectionID": [
        "BioConductor"
    ],
    "credit": [
        {
            "email": "anand.gavai@bioinformatics.nl",
            "name": "Anand K. Gavai",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "hannes.hettling@naturalis.nl",
            "name": "Hannes Hettling",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "This package provides an interface to simulate metabolic reconstruction from the BiGG database and other metabolic reconstruction databases. The package facilitates flux balance analysis (FBA) and the sampling of feasible flux distributions. Metabolic networks and estimated fluxes can be visualized with hypergraphs.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://bioconductor.org/packages/release/bioc/html/BiGGR.html"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://bioconductor/packages/release/bioc/src/contrib/BiGGR_1.10.0.tar.gz"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Metabolic network modelling",
                    "uri": "http://edamontology.org/operation_3660"
                }
            ]
        }
    ],
    "homepage": "http://bioconductor.org/packages/release/bioc/html/BiGGR.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2019-01-11T00:29:19Z",
    "link": [
        {
            "type": [
                "Mirror"
            ],
            "url": "http://www.bioconductor.org/"
        }
    ],
    "name": "BiGGR",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "bioconductor_import",
    "publication": [
        {
            "doi": "10.1371/journal.pone.0119016",
            "metadata": {
                "abstract": "© 2015 Gavai et al.Predicting the distribution of metabolic fluxes in biochemical networks is of major interest in systems biology. Several databases provide metabolic reconstructions for different organisms. Software to analyze flux distributions exists, among others for the proprietary MATLAB environment. Given the large user community for the R computing environment, a simple implementation of flux analysis in R appears desirable and will facilitate easy interaction with computational tools to handle gene expression data. We extended the R software package BiGGR, an implementation of metabolic flux analysis in R. BiGGR makes use of public metabolic reconstruction databases, and contains the BiGG database and the reconstruction of human metabolism Recon2 as Systems Biology Markup Language (SBML) objects. Models can be assembled by querying the databases for pathways, genes or reactions of interest. Fluxes can then be estimated by maximization or minimization of an objective function using linear inverse modeling algorithms. Furthermore, BiGGR provides functionality to quantify the uncertainty in flux estimates by sampling the constrained multidimensional flux space. As a result, ensembles of possible flux configurations are constructed that agree with measured data within precision limits. BiGGR also features automatic visualization of selected parts of metabolic networks using hypergraphs, with hyperedge widths proportional to estimated flux values. BiGGR supports import and export of models encoded in SBML and is therefore interoperable with different modeling and analysis tools. As an application example, we calculated the flux distribution in healthy human brain using a model of central carbon metabolism. We introduce a new algorithm termed Least-squares with equalities and inequalities Flux Balance Analysis (Lsei-FBA) to predict flux changes from gene expression changes, for instance during disease. Our estimates of brain metabolic flux pattern with Lsei-FBA for Alzheimer's disease agree with independent measurements of cerebral metabolism in patients. This second version of BiGGR is available from Bioconductor.",
                "authors": [
                    {
                        "name": "Gavai A.K."
                    },
                    {
                        "name": "Hettling H."
                    },
                    {
                        "name": "Leunissen J.A.M."
                    },
                    {
                        "name": "Murrell P."
                    },
                    {
                        "name": "Supandi F."
                    },
                    {
                        "name": "Van Beek J.H.G.M."
                    }
                ],
                "citationCount": 11,
                "date": "2015-03-25T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "Using bioconductor package BiGGR for metabolic flux estimation based on gene expression changes in brain"
            },
            "pmcid": "PMC4373785",
            "pmid": "25806817",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool",
        "Library"
    ],
    "topic": [
        {
            "term": "Endocrinology and metabolism",
            "uri": "http://edamontology.org/topic_3407"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ],
    "validated": 1,
    "version": [
        "1.10.0"
    ]
}
