{
    "accessibility": [],
    "additionDate": "2017-05-01T17:08:35Z",
    "biotoolsCURIE": "biotools:biomoby",
    "biotoolsID": "biomoby",
    "collectionID": [],
    "confidence_flag": null,
    "cost": null,
    "credit": [
        {
            "email": "mwilkinson@gene.pbi.nrc.ca",
            "gridid": null,
            "name": "M. D. Wilkinson",
            "note": null,
            "orcidid": null,
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": null
        }
    ],
    "description": "BioMOBY is an international research project involving biological data hosts, biological data service providers, and coders whose aim is to explore various methodologies for biological data representation, distribution, and discovery.",
    "documentation": [
        {
            "note": null,
            "type": "General",
            "url": "http://biomoby.open-bio.org/for-developers/perl_tutorial/"
        }
    ],
    "download": [],
    "editPermission": {
        "authors": [],
        "type": "private"
    },
    "elixirNode": [],
    "elixirPlatform": [],
    "elixir_badge": 0,
    "function": [
        {
            "cmd": null,
            "input": [],
            "note": null,
            "operation": [
                {
                    "term": "Service discovery",
                    "uri": "http://edamontology.org/operation_3761"
                },
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                },
                {
                    "term": "Service composition",
                    "uri": "http://edamontology.org/operation_3762"
                }
            ],
            "output": []
        }
    ],
    "homepage": "http://biomoby.org/",
    "homepage_status": 0,
    "language": [
        "Java",
        "Perl"
    ],
    "lastUpdate": "2018-12-10T12:58:56Z",
    "license": null,
    "link": [],
    "maturity": null,
    "name": "BioMoby",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "otherID": [],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "doi": null,
            "metadata": {
                "abstract": "BioMOBY is an Open Source research project which aims to generate an architecture for the discovery and distribution of biological data through web services; data and services are decentralised, but the availability of these resources, and the instructions for interacting with them, are registered in a central location called MOBY Central. BioMOBY adds to the web services paradigm, as exemplified by Universal Data Discovery and Integration (UDDI), by having an object-driven registry query system with object and service ontologies. This allows users to traverse expansive and disparate data sets where each possible next step is presented based on the data object currently in-hand. Moreover, a path from the current data object to a desired final data object could be automatically discovered using the registry. Native BioMOBY objects are lightweight XML, and make up both the query and the response of a simple object access protocol (SOAP) transaction.",
                "authors": [
                    {
                        "name": "Wilkinson M.D."
                    },
                    {
                        "name": "Links M."
                    }
                ],
                "citationCount": 233,
                "date": "2002-01-01T00:00:00Z",
                "journal": "Briefings in bioinformatics",
                "title": "BioMOBY: an open source biological web services proposal."
            },
            "note": null,
            "pmcid": null,
            "pmid": "12511062",
            "type": null,
            "version": null
        },
        {
            "doi": null,
            "metadata": {
                "abstract": "Facile and meaningful integration of data from disparate resources is the 'holy grail' of bioinformatics. Some resources have begun to address this problem by providing their data using Semantic Web standards, specifically the Resource Description Framework (RDF) and the Web Ontology Language (OWL). Unfortunately, adoption of Semantic Web standards has been slow overall, and even in cases where the standards are being utilized, interconnectivity between resources is rare. In response, we have seen the emergence of centralized 'semantic warehouses' that collect public data from third parties, integrate it, translate it into OWL/RDF and provide it to the community as a unified and queryable resource. One limitation of the warehouse approach is that queries are confined to the resources that have been selected for inclusion. A related problem, perhaps of greater concern, is that the majority of bioinformatics data exists in the 'Deep Web' - that is, the data does not exist until an application or analytical tool is invoked, and therefore does not have a predictable Web address. The inability to utilize Uniform Resource Identifiers (URIs) to address this data is a barrier to its accessibility via URI-centric Semantic Web technologies. Here we examine 'The State of the Union' for the adoption of Semantic Web standards in the health care and life sciences domain by key bioinformatics resources, explore the nature and connectivity of several community-driven semantic warehousing projects, and report on our own progress with the CardioSHARE/Moby-2 project, which aims to make the resources of the Deep Web transparently accessible through SPARQL queries. © The Author 2009. Published by Oxford University Press.",
                "authors": [
                    {
                        "name": "Vandervalk B.P."
                    },
                    {
                        "name": "McCarthy E.L."
                    },
                    {
                        "name": "Wilkinson M.D."
                    }
                ],
                "citationCount": 16,
                "date": "2009-04-03T00:00:00Z",
                "journal": "Briefings in Bioinformatics",
                "title": "Moby and moby 2: Creatures of the deep (Web)"
            },
            "note": null,
            "pmcid": null,
            "pmid": "19151099",
            "type": null,
            "version": null
        },
        {
            "doi": null,
            "metadata": {
                "abstract": "Researchers in the life-sciences are currently limited to small-scale informatics experiments and analyses because of the lack of interoperability among life-sciences web services. This limitation can be addressed by annotating services and their interfaces with semantic information, so that interoperability problems can be reasoned about programmatically. The Moby semantic web framework is a popular and mature platform that is used for this purpose. However, the number of services that are available to select from when building a workflow is becoming unmanageable for users. As such, attempts have been made to assist with service selection and composition. These tasks fall under the general label of automated service composition. We present a prototype workflow assembly client that reduces the number of choices that users have to make by (1) restricting the overall set of services presented to them and (2) ranking services so that the the most desirable ones are presented first. We demonstrate via an evaluation of this prototype that a unification of relatively simple techniques can rank desirable services highly while maintaining interactive response times. © 2008 Elsevier Inc. All rights reserved.",
                "authors": [
                    {
                        "name": "DiBernardo M."
                    },
                    {
                        "name": "Pottinger R."
                    },
                    {
                        "name": "Wilkinson M."
                    }
                ],
                "citationCount": 41,
                "date": "2008-10-01T00:00:00Z",
                "journal": "Journal of Biomedical Informatics",
                "title": "Semi-automatic web service composition for the life sciences using the BioMoby semantic web framework"
            },
            "note": null,
            "pmcid": null,
            "pmid": "18373957",
            "type": null,
            "version": null
        }
    ],
    "relation": [],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Informatics",
            "uri": "http://edamontology.org/topic_0605"
        },
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        },
        {
            "term": "Database management",
            "uri": "http://edamontology.org/topic_3489"
        },
        {
            "term": "Ontology and terminology",
            "uri": "http://edamontology.org/topic_0089"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ],
    "validated": 1,
    "version": []
}