{
    "additionDate": "2017-02-10T11:34:11Z",
    "biotoolsCURIE": "biotools:castp",
    "biotoolsID": "castp",
    "credit": [
        {
            "email": "uic.lianglab@gmail.com",
            "name": "Support",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Locates and measures concave surface regions on 3D protein structures. This tool can be used to study surface features, binding sites, and functional regions of proteins.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://sts.bioe.uic.edu/castp/background.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein structure assignment",
                    "uri": "http://edamontology.org/operation_0320"
                },
                {
                    "term": "Molecular surface calculation",
                    "uri": "http://edamontology.org/operation_0387"
                },
                {
                    "term": "Protein binding site prediction",
                    "uri": "http://edamontology.org/operation_2575"
                },
                {
                    "term": "Protein structure analysis",
                    "uri": "http://edamontology.org/operation_2406"
                }
            ]
        }
    ],
    "homepage": "http://sts.bioe.uic.edu/castp/",
    "lastUpdate": "2018-12-10T12:58:55Z",
    "name": "CASTp",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "Identification and size characterization of surface pockets and occluded cavities are initial steps in protein structure-based ligand design. A new program, CAST, for automatically locating and measuring protein pockets and cavities, is based on precise computational geometry methods, including alpha shape and discrete flow theory. CAST identifies and measures pockets and pocket mouth openings, as well as cavities. The program specifies the atoms lining pockets, pocket openings, and buried cavities; the volume and area of pockets and cavities; and the area and circumference of mouth openings. CAST analysis of over 100 proteins has been carried out; proteins examined include a set of 51 monomeric enzyme-ligand structures, several elastase-inhibitor complexes, the FK506 binding protein, 30 HIV-1 protease-inhibitor complexes, and a number of small and large protein inhibitors. Medium-sized globular proteins typically have 10-20 pockets/cavities. Most often, binding sites are pockets with 1-2 mouth openings; much less frequently they are cavities. Ligand binding pockets vary widely in size, most within the range 102-103 Å3. Statistical analysis reveals that the number of pockets and cavities is correlated with protein size, but there is no correlation between the size of the protein and the size of binding sites. Most frequently, the largest pocket/cavity is the active site, but there are a number of instructive exceptions. Ligand volume and binding site volume are somewhat correlated when binding site volume is ≤700 Å3, but the ligand seldom occupies the entire site. Auxiliary pockets near the active site have been suggested as additional binding surface for designed ligands (Mattos C et al., 1994, Nat Struct Biol 1:55-58). Analysis of elastase-inhibitor complexes suggests that CAST can identify ancillary pockets suitable for recruitment in ligand design strategies. Analysis of the FK506 binding protein, and of compounds developed in SAR by NMR (Shuker SB et al., 1996, Science 274:1531-1534), indicates that CAST pocket computation may provide a priori identification of target proteins for linked-fragment design. CAST analysis of 30 HIV-1 protease- inhibitor complexes shows that the flexible active site pocket can vary over a range of 853-1,566 Å3, and that there are two pockets near or adjoining the active site that may be recruited for ligand design.",
                "authors": [
                    {
                        "name": "Liang J."
                    },
                    {
                        "name": "Edelsbrunner H."
                    },
                    {
                        "name": "Woodward C."
                    }
                ],
                "citationCount": 822,
                "date": "1998-09-01T00:00:00Z",
                "journal": "Protein Science",
                "title": "Anatomy of protein pockets and cavities: Measurement of binding site geometry and implications for ligand design"
            },
            "pmid": "9761470"
        },
        {
            "metadata": {
                "abstract": "Computed Atlas of Surface Topography of proteins (CASTp) provides an online resource for locating, delineating and measuring concave surface regions on three-dimensional structures of proteins. These include pockets located on protein surfaces and voids buried in the interior of proteins. The measurement includes the area and volume of pocket or void by solvent accessible surface model (Richards' surface) and by molecular surface model (Connolly's surface), all calculated analytically. CASTp can be used to study surface features and functional regions of proteins. CASTp includes a graphical user interface, flexible interactive visualization, as well as on-the-fly calculation for user uploaded structures. CASTp is updated daily and can be accessed at http://cast.engr.uic.edu.",
                "authors": [
                    {
                        "name": "Binkowski T.A."
                    },
                    {
                        "name": "Naghibzadeh S."
                    },
                    {
                        "name": "Liang J."
                    }
                ],
                "citationCount": 524,
                "date": "2003-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "CASTp: Computed Atlas of Surface Topography of proteins"
            },
            "pmid": "12824325"
        },
        {
            "metadata": {
                "abstract": "Cavities on a proteins surface as well as specific amino acid positioning within it create the physicochemical properties needed for a protein to perform its function. CASTp (http://cast.engr.uic.edu) is an online tool that locates and measures pockets and voids on 3D protein structures. This new version of CASTp includes annotated functional information of specific residues on the protein structure. The annotations are derived from the Protein Data Bank (PDB), Swiss-Prot, as well as Online Mendelian Inheritance in Man (OMIM), the latter contains information on the variant single nucleotide polymorphisms (SNPs) that are known to cause disease. These annotated residues are mapped to surface pockets, interior voids or other regions of the PDB structures. We use a semi-global pair-wise sequence alignment method to obtain sequence mapping between entries in Swiss-Prot, OMIM and entries in PDB. The updated CASTp web server can be used to study surface features, functional regions and specific roles of key residues of proteins. © The Author 2006. Published by Oxford University Press. All rights reserved.",
                "authors": [
                    {
                        "name": "Dundas J."
                    },
                    {
                        "name": "Ouyang Z."
                    },
                    {
                        "name": "Tseng J."
                    },
                    {
                        "name": "Binkowski A."
                    },
                    {
                        "name": "Turpaz Y."
                    },
                    {
                        "name": "Liang J."
                    }
                ],
                "citationCount": 1315,
                "date": "2006-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "CASTp: Computed atlas of surface topography of proteins with structural and topographical mapping of functionally annotated residues"
            },
            "pmid": "16844972"
        },
        {
            "metadata": {
                "abstract": "The size and shape of macromolecules such as proteins and nucleic acids play an important role in their functions. Prior efforts to quantify these properties have been based on various discretization or tessellation procedures involving analytical or numerical computations. In this article, we present an analytically exact method for computing the metric properties of macromolecules based on the alpha shape theory. This method uses the duality between alpha complex and the weighted Voronoi decomposition of a molecule. We describe the intuitive ideas and concepts behind the alpha shape theory and the algorithm for computing areas and volumes of macromolecules. We apply our method to compute areas and volumes of a number of protein systems. We also discuss several difficulties commonly encountered in molecular shape computations and outline methods to overcome these problems.",
                "authors": [
                    {
                        "name": "Liang J."
                    },
                    {
                        "name": "Edelsbrunner H."
                    },
                    {
                        "name": "Fu P."
                    },
                    {
                        "name": "Sudhakar P.V."
                    },
                    {
                        "name": "Subramaniam S."
                    }
                ],
                "citationCount": 263,
                "date": "1998-10-01T00:00:00Z",
                "journal": "Proteins: Structure, Function and Genetics",
                "title": "Analytical shape computation of macromolecules: I. Molecular area and volume through alpha shape"
            },
            "pmid": "9741840"
        },
        {
            "metadata": {
                "abstract": "The structures of proteins are well-packed, yet they contain numerous cavities which play key roles in accommodating small molecules, or enabling conformational changes. From high-resolution structures it is possible to identify these cavities. We have developed a precise algorithm based on alpha shapes for measuring space-filling-based molecular models (such as van der Waals, solvent accessible, and molecular surface descriptions). We applied this method for accurate computation of the surface area and volume of cavities in several proteins. In addition, all of the atoms/residues lining the cavities are identified. We use this method to study the structure and the stability of proteins, as well as to locate cavities that could contain structural water molecules in the proton transport pathway in the membrane protein bacteriorhodopsin.",
                "authors": [
                    {
                        "name": "Liang J."
                    },
                    {
                        "name": "Edelsbrunner H."
                    },
                    {
                        "name": "Fu P."
                    },
                    {
                        "name": "Sudhakar P.V."
                    },
                    {
                        "name": "Subramaniam S."
                    }
                ],
                "citationCount": 186,
                "date": "1998-10-01T00:00:00Z",
                "journal": "Proteins: Structure, Function and Genetics",
                "title": "Analytical shape computation of macromolecules: II. Inaccessible cavities in proteins"
            },
            "pmid": "9741841"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Protein structural motifs and surfaces",
            "uri": "http://edamontology.org/topic_0166"
        },
        {
            "term": "Protein binding sites",
            "uri": "http://edamontology.org/topic_3534"
        },
        {
            "term": "Protein structure analysis",
            "uri": "http://edamontology.org/topic_2814"
        },
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        },
        {
            "term": "Structure prediction",
            "uri": "http://edamontology.org/topic_0082"
        }
    ],
    "validated": 1
}