{
    "accessibility": "Open access (with restrictions)",
    "additionDate": "2022-06-11T10:38:14.098052Z",
    "biotoolsCURIE": "biotools:covnet",
    "biotoolsID": "covnet",
    "collectionID": [
        "COVID-19"
    ],
    "confidence_flag": "tool",
    "cost": "Free of charge (with restrictions)",
    "credit": [
        {
            "email": "y.chang20@imperial.ac.uk",
            "name": "Yi Chang",
            "typeEntity": "Person"
        },
        {
            "email": "zren@l3s.de",
            "name": "Zhao Ren",
            "typeEntity": "Person"
        }
    ],
    "description": "A Transfer Learning Framework for Automatic COVID-19 Detection From Crowd-Sourced Cough Sounds.",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://github.com/ychang74/CovNet",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-06-11T10:38:14.100621Z",
    "license": "MIT",
    "name": "CovNet",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.3389/FDGTH.2021.799067",
            "metadata": {
                "abstract": "Copyright © 2022 Chang, Jing, Ren and Schuller.Since the COronaVIrus Disease 2019 (COVID-19) outbreak, developing a digital diagnostic tool to detect COVID-19 from respiratory sounds with computer audition has become an essential topic due to its advantages of being swift, low-cost, and eco-friendly. However, prior studies mainly focused on small-scale COVID-19 datasets. To build a robust model, the large-scale multi-sound FluSense dataset is utilised to help detect COVID-19 from cough sounds in this study. Due to the gap between FluSense and the COVID-19-related datasets consisting of cough only, the transfer learning framework (namely CovNet) is proposed and applied rather than simply augmenting the training data with FluSense. The CovNet contains (i) a parameter transferring strategy and (ii) an embedding incorporation strategy. Specifically, to validate the CovNet's effectiveness, it is used to transfer knowledge from FluSense to COUGHVID, a large-scale cough sound database of COVID-19 negative and COVID-19 positive individuals. The trained model on FluSense and COUGHVID is further applied under the CovNet to another two small-scale cough datasets for COVID-19 detection, the COVID-19 cough sub-challenge (CCS) database in the INTERSPEECH Computational Paralinguistics challengE (ComParE) challenge and the DiCOVA Track-1 database. By training four simple convolutional neural networks (CNNs) in the transfer learning framework, our approach achieves an absolute improvement of 3.57% over the baseline of DiCOVA Track-1 validation of the area under the receiver operating characteristic curve (ROC AUC) and an absolute improvement of 1.73% over the baseline of ComParE CCS test unweighted average recall (UAR).",
                "authors": [
                    {
                        "name": "Chang Y."
                    },
                    {
                        "name": "Jing X."
                    },
                    {
                        "name": "Ren Z."
                    },
                    {
                        "name": "Schuller B.W."
                    }
                ],
                "citationCount": 1,
                "date": "2022-01-03T00:00:00Z",
                "journal": "Frontiers in Digital Health",
                "title": "CovNet: A Transfer Learning Framework for Automatic COVID-19 Detection From Crowd-Sourced Cough Sounds"
            },
            "pmcid": "PMC8761863",
            "pmid": "35047869"
        }
    ],
    "toolType": [
        "Workbench"
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Respiratory medicine",
            "uri": "http://edamontology.org/topic_3322"
        }
    ]
}
