{
    "additionDate": "2021-01-18T07:42:41Z",
    "biotoolsCURIE": "biotools:phylosofs",
    "biotoolsID": "phylosofs",
    "confidence_flag": "tool",
    "description": "Transcripts' Evolutionary History and Structural Dynamics Give Mechanistic Insights into the Functional Diversity of the JNK Family.\n\nA tool to model the evolution and structural impact of alternative splicing.\n\nPhyloSofS (Phylogenies of Splicing isoforms Structures) is a fully automated computational tool that infers plausible evolutionary scenarios explaining a set of transcripts observed in several species and models the three-dimensional structures of the produced protein isoforms.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Phylogenetic reconstruction",
                    "uri": "http://edamontology.org/operation_3478"
                },
                {
                    "term": "Alternative splicing prediction",
                    "uri": "http://edamontology.org/operation_0264"
                },
                {
                    "term": "Protein modelling",
                    "uri": "http://edamontology.org/operation_0477"
                }
            ]
        }
    ],
    "homepage": "https://github.com/PhyloSofS-Team/PhyloSofS",
    "language": [
        "Python",
        "Julia"
    ],
    "lastUpdate": "2021-01-23T15:55:31Z",
    "license": "MIT",
    "name": "PhyloSofS",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1016/J.JMB.2020.01.032",
            "metadata": {
                "abstract": "© 2020 Elsevier LtdAlternative splicing and alternative initiation/termination transcription sites have the potential to greatly expand the proteome in eukaryotes by producing several transcript isoforms from the same gene. Although these mechanisms are well described at the genomic level, little is known about their contribution to protein evolution and their impact at the protein structure level. Here, we address both issues by reconstructing the evolutionary history of transcripts and by modeling the tertiary structures of the corresponding protein isoforms. We reconstruct phylogenetic forests relating 60 protein-coding transcripts from the c-Jun N-terminal kinase (JNK) family observed in seven species. We identify two alternative splicing events of ancient origin and show that they induce subtle changes in the protein's structural dynamics. We highlight a previously uncharacterized transcript whose predicted structure seems stable in solution. We further demonstrate that orphan transcripts, for which no phylogeny could be reconstructed, display peculiar sequence and structural properties. Our approach is implemented in PhyloSofS (Phylogenies of Splicing Isoforms Structures), a fully automated computational tool freely available at https://github.com/PhyloSofS-Team/PhyloSofS.",
                "authors": [
                    {
                        "name": "Ait-hamlat A."
                    },
                    {
                        "name": "Zea D.J."
                    },
                    {
                        "name": "Labeeuw A."
                    },
                    {
                        "name": "Polit L."
                    },
                    {
                        "name": "Richard H."
                    },
                    {
                        "name": "Laine E."
                    }
                ],
                "date": "2020-03-27T00:00:00Z",
                "journal": "Journal of Molecular Biology",
                "title": "Transcripts’ Evolutionary History and Structural Dynamics Give Mechanistic Insights into the Functional Diversity of the JNK Family"
            },
            "pmid": "32067951"
        }
    ],
    "topic": [
        {
            "term": "Phylogeny",
            "uri": "http://edamontology.org/topic_0084"
        },
        {
            "term": "RNA splicing",
            "uri": "http://edamontology.org/topic_3320"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ],
    "validated": 1
}