{"credit":[{"email":"hqzhu@pku.edu.cn","name":"Huaiqiu Zhu","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"http://cqb.pku.edu.cn/ZhuLab/lncadeep/"}],"function":[{"operation":[{"term":"Enrichment analysis","uri":"http://edamontology.org/operation_3501"},{"term":"Ab initio structure prediction","uri":"http://edamontology.org/operation_0476"},{"term":"Expression analysis","uri":"http://edamontology.org/operation_2495"}]}],"labels":{"accessibility":["Open access"],"cost":"Free of charge","language":["R","Python"],"license":"Unlicense","maturity":"Mature","operatingSystem":["Linux","Mac"],"toolType":["Command-line tool"],"topic":[{"term":"Functional, regulatory and non-coding RNA","uri":"http://edamontology.org/topic_0659"},{"term":"Molecular interactions, pathways and networks","uri":"http://edamontology.org/topic_0602"},{"term":"Literature and language","uri":"http://edamontology.org/topic_3068"}]},"link":[{"type":"ISSUE_TRACKER","url":"https://github.com/cyang235/LncADeep/issues"}],"publication":[{"abstract":"© The Author(s) 2018. Published by Oxford University Press. All rights reserved. Motivation To characterize long non-coding RNAs (lncRNAs), both identifying and functionally annotating them are essential to be addressed. Moreover, a comprehensive construction for lncRNA annotation is desired to facilitate the research in the field. Results We present LncADeep, a novel lncRNA identification and functional annotation tool. For lncRNA identification, LncADeep integrates intrinsic and homology features into a deep belief network and constructs models targeting both full- and partial-length transcripts. For functional annotation, LncADeep predicts a lncRNA's interacting proteins based on deep neural networks, using both sequence and structure information. Furthermore, LncADeep integrates KEGG and Reactome pathway enrichment analysis and functional module detection with the predicted interacting proteins, and provides the enriched pathways and functional modules as functional annotations for lncRNAs. Test results show that LncADeep outperforms state-of-the-art tools, both for lncRNA identification and lncRNA-protein interaction prediction, and then presents a functional interpretation. We expect that LncADeep can contribute to identifying and annotating novel lncRNAs. Availability and implementation LncADeep is freely available for academic use at http://cqb.pku.edu.cn/ZhuLab/lncadeep/ and https://github.com/cyang235/LncADeep/. Supplementary informationSupplementary dataare available at Bioinformatics online.","authors":["Yang C.","Yang L.","Zhou M.","Xie H.","Zhang C.","Wang M.D.","Zhu H."],"cit_count":3,"doi":"10.1093/bioinformatics/bty428","journal":"Bioinformatics","title":"LncADeep: An ab initio lncRNA identification and functional annotation tool based on deep learning","type":"Primary","year":"2018-11-15"}],"summary":{"biotoolsCURIE":"biotools:LncADeep","biotoolsID":"LncADeep","description":"ab initio lncRNA identification and functional annotation tool based on deep learning.","homepage":"https://github.com/cyang235/LncADeep/","name":"LncADeep"}}