{
    "additionDate": "2020-01-14T09:10:29Z",
    "biotoolsCURIE": "biotools:Clirc",
    "biotoolsID": "Clirc",
    "confidence_flag": "tool",
    "description": "Large-Scale Profiling of RBP-circRNA Interactions from Public CLIP-Seq Datasets.\n\nClirc: a user-friendly bioinformatics software to identify RBP-bound circRNAs through analysis of CLIP-Seq data.\n\nThe Clirc software is designed to identify RBP-bound circRNAs in CLIP-Seq data. The Clirc software internally calls the gsnap aligner for alignment of CLIP-Seq reads. The CLIP-Seq technology comprises of three variants: HITS-CLIP, PAR-CLIP, and iCLIP. The Clirc software works on all three versions of them. It can also work on any type of RNA-Seq data in general, although non-polyA selected RNA-Seq is preferred. The Clirc software is designed to search for known circRNAs in high-throughput sequencing data whose coordinates are provided by users. The users can collect these coordinates from previous publication or their own search using RNA-Seq data. This avoids the common problem of short sequncing reads in CLIP-Seq data. But this approach cannot identify novel circRNAs in CLIP-Seq data",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence trimming",
                    "uri": "http://edamontology.org/operation_3192"
                },
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                },
                {
                    "term": "Read mapping",
                    "uri": "http://edamontology.org/operation_3198"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Minzhe/Clirc",
    "language": [
        "Perl"
    ],
    "lastUpdate": "2020-12-16T14:49:13Z",
    "name": "Clirc",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.20944/PREPRINTS201911.0202.V1"
        },
        {
            "doi": "10.3390/genes11010054",
            "metadata": {
                "abstract": "© 2020 by the authors. Licensee MDPI, Basel, Switzerland.Circular RNAs are a special type of RNA that has recently attracted a lot of research interest in studying its formation and function. RNA binding proteins (RBPs) that bind circRNAs are important in these processes, but have been relatively less studied. CLIP-Seq technology has been invented and applied to profile RBP-RNA interactions on the genome-wide scale. While mRNAs are usually the focus of CLIP-Seq experiments, RBP-circRNA interactions could also be identified through specialized analysis of CLIP-Seq datasets. However, many technical difficulties are involved in this process, such as the usually short read length of CLIP-Seq reads. In this study, we created a pipeline called Clirc specialized for profiling circRNAs in CLIP-Seq data and analyzing the characteristics of RBP-circRNA interactions. In conclusion, to our knowledge, this is one of the first studies to investigate circRNAs and their binding partners through repurposing CLIP-Seq datasets, and we hope our work will become a valuable resource for future studies into the biogenesis and function of circRNAs.",
                "authors": [
                    {
                        "name": "Zhang M."
                    },
                    {
                        "name": "Wang T."
                    },
                    {
                        "name": "Xiao G."
                    },
                    {
                        "name": "Xie Y."
                    }
                ],
                "citationCount": 3,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Genes",
                "title": "Large-scale profiling of RBP-circRNA interactions from public CLIP-seq datasets"
            },
            "pmcid": "PMC7016857",
            "pmid": "31947823"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "RNA immunoprecipitation",
            "uri": "http://edamontology.org/topic_3794"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "RNA splicing",
            "uri": "http://edamontology.org/topic_3320"
        }
    ],
    "validated": 1
}