
{
    "credit": [
        {
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "https://watson.hgen.pitt.edu/#Contact"
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "https://watson.hgen.pitt.edu/pub/qtlall/QTLALL_1.0.1_User_Guide.pdf"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Linkage analysis",
                    "uri": "http://edamontology.org/operation_0283"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Statistics and probability",
                "uri": "http://edamontology.org/topic_2269"
            },
            {
                "term": "Phylogenetics",
                "uri": "http://edamontology.org/topic_3293"
            },
            {
                "term": "Genetics",
                "uri": "http://edamontology.org/topic_3053"
            },
            {
                "term": "Sequence analysis",
                "uri": "http://edamontology.org/topic_0080"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/qtl-all-1-0-1-qtl-analysis-linkage-library.html"
        }
    ],
    "publication": [
        {
            "abstract": "Type 2 diabetes mellitus (T2DM) is a common complex phenotype that by the year 2010 is predicted to affect 221 million people globally. In the present study we performed a genome-wide linkage scan using the allele-sharing statistic Sall implemented in Allegro and a novel two-dimensional genome-wide strategy implemented in Merloc that searches for pairwise interaction between genetic markers located on different chromosomes linked to T2DM. In addition, we used a robust score statistic from the newly developed QTL-ALL software to search for linkage to variation in adult height. The strategies were applied to a study sample consisting of 238 sib-pairs affected with T2DM from American Samoa. We did not detect any genome-wide significant susceptibility loci for T2DM. However, our two-dimensional linkage investigation detected several loci pairs of interest, including 11q22 and 21q21, 9q21 and 11q22, 1p22-p21 and 4p15, and 4p15 and 15q11-q14, with a two-loci maximum LOD score (MLS) greater than 2.00. Most detected individual loci have previously been identified as susceptibility loci for diabetes-related traits. Our two-dimensional linkage results may facilitate the selection of potential candidate genes and molecular pathways for further diabetes studies because these results, besides providing candidate loci, also demonstrate that polygenic effects may play an important role in T2DM. Linkage was delected (p value of 0.005) for variation in adult height on chromosome 9q31, which was reported previously in other populations. Our finding suggests that the 9q31 region may be a strong quantitative trait locus for adult height, which is likely to be of importance across populations. Copyright © 2008 Wayne State University Press.",
            "authors": [
                "Aberg K.",
                "Sun G.",
                "Smelser D.",
                "Indugula S.R.",
                "Tsai H.-J.",
                "Steele M.S.",
                "Tuitele J.",
                "Deka R.",
                "Mcgarvey S.T.",
                "Weeks D.E."
            ],
            "cit_count": 3,
            "journal": "Human Biology",
            "pmid": "18720898",
            "title": "Applying novel genome-wide linkage strategies to search for loci influencing type 2 diabetes and adult height in American Samoa",
            "year": "2008-04-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:qtl-all",
        "biotoolsID": "qtl-all",
        "description": "QTL linkage analysis program. It calculates a wide variety of QTL linkage statistics for nuclear families. Score statistics are emphasized, as are statistics appropriate for ascertained (nonpopulation) samples such as concordant and discordant sibling pairs. Currently, only sib-pair and sibship data are supported, but we plan to extend the capability to arbitrary pedigrees soon.",
        "homepage": "https://watson.hgen.pitt.edu/register/",
        "name": "QTL-ALL"
    }
}