{
    "accessibility": "Open access",
    "additionDate": "2019-08-09T13:22:09Z",
    "biotoolsCURIE": "biotools:ADHD",
    "biotoolsID": "ADHD",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "cfpaim@hcpa.ufrgs.br",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Risk calculator to predict ADHD in young adulthood.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Imputation",
                    "uri": "http://edamontology.org/operation_3557"
                }
            ]
        }
    ],
    "homepage": "https://ufrgs.br/prodah/adhd-calculator/",
    "lastUpdate": "2020-06-16T10:55:25Z",
    "license": "Unlicense",
    "maturity": "Mature",
    "name": "ADHD",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "hans",
    "publication": [
        {
            "doi": "10.1017/S2045796019000283",
            "metadata": {
                "abstract": "© 2019 Cambridge University Press.AimFew personalised medicine investigations have been conducted for mental health. We aimed to generate and validate a risk tool that predicts adult attention-deficit/hyperactivity disorder (ADHD).MethodsUsing logistic regression models, we generated a risk tool in a representative population cohort (ALSPAC - UK, 5113 participants, followed from birth to age 17) using childhood clinical and sociodemographic data with internal validation. Predictors included sex, socioeconomic status, single-parent family, ADHD symptoms, comorbid disruptive disorders, childhood maltreatment, ADHD symptoms, depressive symptoms, mother's depression and intelligence quotient. The outcome was defined as a categorical diagnosis of ADHD in young adulthood without requiring age at onset criteria. We also tested Machine Learning approaches for developing the risk models: Random Forest, Stochastic Gradient Boosting and Artificial Neural Network. The risk tool was externally validated in the E-Risk cohort (UK, 2040 participants, birth to age 18), the 1993 Pelotas Birth Cohort (Brazil, 3911 participants, birth to age 18) and the MTA clinical sample (USA, 476 children with ADHD and 241 controls followed for 16 years from a minimum of 8 and a maximum of 26 years old).ResultsThe overall prevalence of adult ADHD ranged from 8.1 to 12% in the population-based samples, and was 28.6% in the clinical sample. The internal performance of the model in the generating sample was good, with an area under the curve (AUC) for predicting adult ADHD of 0.82 (95% confidence interval (CI) 0.79-0.83). Calibration plots showed good agreement between predicted and observed event frequencies from 0 to 60% probability. In the UK birth cohort test sample, the AUC was 0.75 (95% CI 0.71-0.78). In the Brazilian birth cohort test sample, the AUC was significantly lower -0.57 (95% CI 0.54-0.60). In the clinical trial test sample, the AUC was 0.76 (95% CI 0.73-0.80). The risk model did not predict adult anxiety or major depressive disorder. Machine Learning approaches did not outperform logistic regression models. An open-source and free risk calculator was generated for clinical use and is available online at https://ufrgs.br/prodah/adhd-calculator/.ConclusionsThe risk tool based on childhood characteristics specifically predicts adult ADHD in European and North-American population-based and clinical samples with comparable discrimination to commonly used clinical tools in internal medicine and higher than most previous attempts for mental and neurological disorders. However, its use in middle-income settings requires caution.",
                "authors": [
                    {
                        "name": "Caye A."
                    },
                    {
                        "name": "Agnew-Blais J."
                    },
                    {
                        "name": "Arseneault L."
                    },
                    {
                        "name": "Goncalves H."
                    },
                    {
                        "name": "Kieling C."
                    },
                    {
                        "name": "Langley K."
                    },
                    {
                        "name": "Menezes A.M.B."
                    },
                    {
                        "name": "Moffitt T.E."
                    },
                    {
                        "name": "Passos I.C."
                    },
                    {
                        "name": "Rocha T.B."
                    },
                    {
                        "name": "Sibley M.H."
                    },
                    {
                        "name": "Swanson J.M."
                    },
                    {
                        "name": "Thapar A."
                    },
                    {
                        "name": "Wehrmeister F."
                    },
                    {
                        "name": "Rohde L.A."
                    }
                ],
                "citationCount": 7,
                "date": "2019-01-01T00:00:00Z",
                "journal": "Epidemiology and Psychiatric Sciences",
                "title": "A risk calculator to predict adult attention-deficit/hyperactivity disorder: Generation and external validation in three birth cohorts and one clinical sample"
            },
            "pmid": "31088588",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Psychiatry",
            "uri": "http://edamontology.org/topic_3419"
        },
        {
            "term": "Public health and epidemiology",
            "uri": "http://edamontology.org/topic_3305"
        },
        {
            "term": "Neurology",
            "uri": "http://edamontology.org/topic_3334"
        }
    ],
    "validated": 1
}