{
    "accessibility": "Open access",
    "additionDate": "2017-02-10T11:35:12Z",
    "biotoolsCURIE": "biotools:deqor",
    "biotoolsID": "deqor",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "surendra@mpi-cbg.de",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Tool which aids in the design and quality control of small interfering RNAs (siRNAs) for RNA interference (RNAi) and gene silencing. It evaluates the inhibitory potency of potential siRNA sequences as well as identifying gene regions that have a high silencing capacity.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "siRNA duplex prediction",
                    "uri": "http://edamontology.org/operation_2008"
                },
                {
                    "term": "Sequencing quality control",
                    "uri": "http://edamontology.org/operation_3218"
                },
                {
                    "term": "Validation",
                    "uri": "http://edamontology.org/operation_2428"
                },
                {
                    "term": "Sequence assembly validation",
                    "uri": "http://edamontology.org/operation_3180"
                }
            ]
        }
    ],
    "homepage": "http://144.76.155.9/deqor_new/input.html",
    "lastUpdate": "2020-06-16T10:55:24Z",
    "license": "Unlicense",
    "maturity": "Mature",
    "name": "DEQOR",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "doi": "10.1093/nar/gkh408",
            "metadata": {
                "abstract": "RNA interference (RNAi) is a powerful tool for inhibiting the expression of a gene by mediating the degradation of the corresponding mRNA. The basis of this gene-specific inhibition is small, double-stranded RNAs (dsRNAs), also referred to as small interfering RNAs (siRNAs), that correspond in sequence to a part of the exon sequence of a silenced gene. The selection of siRNAs for a target gene is a crucial step in siRNA-mediated gene silencing. According to present knowledge, siRNAs must fulfill certain properties including sequence length, GC-content and nucleotide composition. Furthermore, the cross-silencing capability of dsRNAs for other genes must be evaluated. When designing siRNAs for chemical synthesis, most of these criteria are achievable by simple sequence analysis of target mRNAs, and the specificity can be evaluated by a single BLAST search against the transcriptome of the studied organism. A different method for raising siRNAs has, however, emerged which uses enzymatic digestion to hydrolyze long pieces of dsRNA into shorter molecules. These endoribonuclease-prepared siRNAs (esiRNAs or 'diced' RNAs) are less variable in their silencing capabilities and circumvent the laborious process of sequence selection for RNAi due to a broader range of products. Though powerful, this method might be more susceptible to cross-silencing genes other than the target itself. We have developed a web-based tool that facilitates the design and quality control of siRNAs for RNAi. The program, DEQOR, uses a scoring system based on state-of-the-art parameters for siRNA design to evaluate the inhibitory potency of siRNAs. DEQOR, therefore, can help to predict (i) regions in a gene that show high silencing capacity based on the base pair composition and (ii) siRNAs with high silencing potential for chemical synthesis. In addition, each siRNA arising from the input query is evaluated for possible cross-silencing activities by performing BLAST searches against the transcriptome or genome of a selected organism. DEQOR can therefore predict the probability that an mRNA fragment will cross-react with other genes in the cell and helps researchers to design experiments to test the specificity of esiRNAs or chemically designed siRNAs. DEQOR is freely available at http://cluster-1.mpi-cbg.de/Deqor/deqor.html. © Oxford University Press 2004; all rights reserved.",
                "authors": [
                    {
                        "name": "Henschel A."
                    },
                    {
                        "name": "Buchholz F."
                    },
                    {
                        "name": "Habermann B."
                    }
                ],
                "citationCount": 128,
                "date": "2004-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "DEQOR: A web-based tool for the design and quality control of siRNAs"
            },
            "pmcid": "PMC441546",
            "pmid": "15215362",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        },
        {
            "term": "RNA-seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ],
    "validated": 1,
    "version": [
        "3"
    ]
}