{
    "additionDate": "2017-02-10T11:35:50Z",
    "biotoolsCURIE": "biotools:conreal",
    "biotoolsID": "conreal",
    "credit": [
        {
            "email": "berezikov@niob.knaw.nl",
            "name": "Eigene Berezikov",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "CONREAL (Conserved Regulatory Elements Anchored Alignment) allows identification of transcription factor binding sites (TFBS) that are conserved between two orthologous promoter sequences.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://conreal.niob.knaw.nl/description.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Transcription factor binding site prediction",
                    "uri": "http://edamontology.org/operation_0445"
                },
                {
                    "term": "Transcriptional regulatory element prediction",
                    "uri": "http://edamontology.org/operation_0438"
                },
                {
                    "term": "cis-regulatory element prediction",
                    "uri": "http://edamontology.org/operation_0441"
                }
            ]
        }
    ],
    "homepage": "http://conreal.niob.knaw.nl/",
    "homepage_status": 1,
    "lastUpdate": "2018-12-10T12:58:56Z",
    "name": "CONREAL",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "The use of orthologous sequences and phylogenetic footprinting approaches have become popular for the recognition of conserved and potentially functional sequences. Several algorithms have been developed for the identification of conserved transcription factor binding sites (TFBSs), which are characterized by their relatively short and degenerative recognition sequences. The CONREAL (conserved regulatory elements anchored alignment) web server provides a versatile interface to CONREAL-, LAGAN-, BLASTZ- and AVID-based predictions of conserved TFBSs in orthologous promoters. Comparative analysis using different algorithms can be started by keyword without any prior sequence retrieval. The interface is available at http://conreal.niob.knaw.nl. © 2005 Oxford University Press.",
                "authors": [
                    {
                        "name": "Berezikov E."
                    },
                    {
                        "name": "Guryev V."
                    },
                    {
                        "name": "Cuppen E."
                    }
                ],
                "citationCount": 21,
                "date": "2005-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "CONREAL web server: Identification and visualization of conserved transcription factor binding sites"
            },
            "pmid": "15980509"
        },
        {
            "metadata": {
                "abstract": "Prediction of transcription-factor target sites in promoters remains difficult due to the short length and degeneracy of the target sequences. Although the use of orthologous sequences and phylogenetic footprinting approaches may help in the recognition of conserved and potentially functional sequences, correct alignment of the short transcription-factor binding sites can be problematic for established algorithms, especially when aligning more divergent species. Here, we report a novel phylogenetic footprinting approach, CONREAL, that uses biologically relevant information, that is, potential transcription-factor binding sites as represented by positional weight matrices, to establish anchors between orthologous sequences and to guide promoter sequence alignment. Comparison of the performance of CONREAL with the global alignment programs LAGAN and AVID using a reference data set, shows that CONREAL performs equally well for closely related species like rodents and human, and has a clear added value for aligning promoter elements of more divergent species like human and fish, as it identifies conserved transcription-factor binding sites that are not found by other methods.",
                "authors": [
                    {
                        "name": "Berezikov E."
                    },
                    {
                        "name": "Guryev V."
                    },
                    {
                        "name": "Plasterk R.H.A."
                    },
                    {
                        "name": "Cuppen E."
                    }
                ],
                "citationCount": 70,
                "date": "2004-01-01T00:00:00Z",
                "journal": "Genome Research",
                "title": "CORNEAL: Conserved regulatory elements anchored alignment algorithm for identification of transcription factor binding sites by phylogenetic footprinting"
            },
            "pmid": "14672977"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "Nucleic acid sites, features and motifs",
            "uri": "http://edamontology.org/topic_3511"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "DNA binding sites",
            "uri": "http://edamontology.org/topic_3125"
        },
        {
            "term": "Protein binding sites",
            "uri": "http://edamontology.org/topic_3534"
        }
    ],
    "validated": 1
}