{
    "additionDate": "2017-08-03T19:04:09Z",
    "biotoolsCURIE": "biotools:viramp",
    "biotoolsID": "viramp",
    "credit": [
        {
            "email": "mls164@psu.edu",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://szparalab.psu.edu/"
        }
    ],
    "description": "Web-based semi-de novo fast virus genome assembly pipeline designed for extremely high coverage NGS data. It is a collection of existing tools, combined into a single Galaxy interface. Users without further computational knowledge can easily operate the pipeline.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://viramp.readthedocs.io/en/latest/index.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genome assembly",
                    "uri": "http://edamontology.org/operation_0525"
                },
                {
                    "term": "De-novo assembly",
                    "uri": "http://edamontology.org/operation_0524"
                }
            ]
        }
    ],
    "homepage": "http://docs.viramp.com/en/latest/introduction.html",
    "language": [
        "Python"
    ],
    "lastUpdate": "2018-12-10T12:58:50Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/viramp-galaxy-based-viral-genome-assembly-pipeline.html"
        }
    ],
    "name": "VirAmp",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "© 2015 Wan et al.Background: Advances in next generation sequencing make it possible to obtain high-coverage sequence data for large numbers of viral strains in a short time. However, since most bioinformatics tools are developed for command line use, the selection and accessibility of computational tools for genome assembly and variation analysis limits the ability of individual labs to perform further bioinformatics analysis. Findings: We have developed a multi-step viral genome assembly pipeline named VirAmp, which combines existing tools and techniques and presents them to end users via a web-enabled Galaxy interface. Our pipeline allows users to assemble, analyze, and interpret high coverage viral sequencing data with an ease and efficiency that was not possible previously. Our software makes a large number of genome assembly and related tools available to life scientists and automates the currently recommended best practices into a single, easy to use interface. We tested our pipeline with three different datasets from human herpes simplex virus (HSV). Conclusions: VirAmp provides a user-friendly interface and a complete pipeline for viral genome analysis. We make our software available via an Amazon Elastic Cloud disk image that can be easily launched by anyone with an Amazon web service account. A fully functional demonstration instance of our system can be found at http://viramp.com/. We also maintain detailed documentation on each tool and methodology at http://docs.viramp.com.",
                "authors": [
                    {
                        "name": "Wan Y."
                    },
                    {
                        "name": "Renner D.W."
                    },
                    {
                        "name": "Albert I."
                    },
                    {
                        "name": "Szpara M.L."
                    }
                ],
                "citationCount": 19,
                "date": "2015-01-01T00:00:00Z",
                "journal": "GigaScience",
                "title": "VirAmp: A galaxy-based viral genome assembly pipeline"
            },
            "pmid": "25918639"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        },
        {
            "term": "Virology",
            "uri": "http://edamontology.org/topic_0781"
        }
    ],
    "validated": 1
}