{
    "additionDate": "2020-01-14T20:02:50Z",
    "biotoolsCURIE": "biotools:Transition_Scale-Spaces",
    "biotoolsID": "Transition_Scale-Spaces",
    "confidence_flag": "tool",
    "description": "A Computational Theory for the Discretized Entorhinal Cortex.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                }
            ]
        }
    ],
    "homepage": "https://github.com/rochus/transitionscalespace",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-01-16T17:15:04Z",
    "license": "MIT",
    "name": "Transition Scale-Spaces",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1162/NECO_A_01255",
            "metadata": {
                "abstract": "© 2019 Massachusetts Institute of Technology.Although hippocampal grid cells are thought to be crucial for spatial navigation, their computational purpose remains disputed. Recently, they were proposed to represent spatial transitions and convey this knowledge downstream to place cells. However, a single scale of transitions is insufficient to plan long goal-directed sequences in behaviorally acceptable time. Here, a scale-space data structure is suggested to optimally accelerate retrievals from transition systems, called transition scale-space (TSS). Remaining exclusively on an algorithmic level, the scale increment is proved to be ideally√2 for biologically plausible receptive fields. It is then argued that temporal buffering is necessary to learn the scale-space online. Next, two modes for retrieval of sequences from the TSS are presented: top down and bottom up. The two modes are evaluated in symbolic simulations (i.e., without biologically plausible spiking neurons). Additionally, a TSS is used for short-cut discovery in a simulated Morris water maze. Finally, the results are discussed in depth with respect to biological plausibility, and several testable predictions are derived. Moreover, relations to other grid cell models, multiresolution path planning, and scale-space theory are highlighted. Summarized, reward-free transition encoding is shown here, in a theoretical model, to be compatible with the observed discretization along the dorso-ventral axis of the medial entorhinal cortex. Because the theoretical model generalizes beyond navigation, the TSS is suggested to be a general-purpose cortical data structure for fast retrieval of sequences and relational knowledge. Source code for all simulations presented in this paper can be found at https://github.com/rochus/transitionscalespace.",
                "authors": [
                    {
                        "name": "Waniek N."
                    }
                ],
                "citationCount": 1,
                "date": "2020-02-01T00:00:00Z",
                "journal": "Neural Computation",
                "title": "Transition scale-spaces: A computational theory for the discretized entorhinal cortex"
            },
            "pmid": "31835003"
        }
    ],
    "topic": [
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        }
    ],
    "validated": 1
}