{
    "additionDate": "2017-08-03T18:38:13Z",
    "biotoolsCURIE": "biotools:ccomp",
    "biotoolsID": "ccomp",
    "credit": [
        {
            "email": "piotr@pirx.com",
            "name": "Piotr Rotkiewicz",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.pirx.com/"
        }
    ],
    "description": "Complex COMParison, is a simple command-line tool for comparing ligand/receptor complexes. It can also be used for calculating pairwise all-atom RMSD of slightly different protein structures, taking care of missing atoms, sequence inconsistencies, etc.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://www.pirx.com/ccomp/index.shtml"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Pairwise sequence alignment",
                    "uri": "http://edamontology.org/operation_0491"
                }
            ]
        }
    ],
    "homepage": "http://www.pirx.com/ccomp/index.shtml",
    "language": [
        "C"
    ],
    "lastUpdate": "2018-12-10T12:58:56Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/ccomp-3-70-compare-ligandreceptor-complexes.html"
        }
    ],
    "name": "CCOMP",
    "operatingSystem": [
        "Windows"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "We have developed a program CCOMP that compares overlapping fragments of two protein complexes and identifies differently oriented amino acids. CCOMP initially performs a sequence alignment of the analyzed receptors, then superimposes the corresponding aligned residues, and finally calculates the root mean square deviation (RMSD) of individual atoms, every amino acid and the entire complex. Thus, amino acids important for functional differences between both complexes can be detected. Application of CCOMP to 1α,25-(OH)2D3-hVDR (1DB1) [Proc. Natl. Acad. Sci. U.S.A. 98 (2001) 5491] and 1α,25-(OH)2D3-rVDR-peptide (1RK3) [Biochemistry 43 (2004) 4101] complexes revealed that the peptide (KNHPMLMNLLKDN) mimicking a co-activator sequence significantly changes the side chain conformation of 35 amino acids. Four of these residues (K242, I256, K260, E416) actually contact the peptide, but all of them are essential for biological activity. Only two (L309 and L400) of the 35 differently oriented amino acids contact the ligand. Interestingly, when the peptide is present (1RK3) leucine 400 shifts closer (0.7 Å) to the vitamin D 26-methyl group. Applying the CCOMP and DSSP programs to binary and ternary VDR complexes also resulted in establishing that seven amino acids (I238, S252, I256, L413, L415, E416, V417) exhibit significant differences in solvent accessibility and are capable of interacting with co-activators. © 2006 Elsevier Ltd. All rights reserved.",
                "authors": [
                    {
                        "name": "Rotkiewicz P."
                    },
                    {
                        "name": "Sicinska W."
                    }
                ],
                "citationCount": 2,
                "date": "2007-03-01T00:00:00Z",
                "journal": "Journal of Steroid Biochemistry and Molecular Biology",
                "title": "Computational analysis of the active sites in binary and ternary complexes of the vitamin D receptor"
            },
            "pmid": "17267206"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Molecular modelling",
            "uri": "http://edamontology.org/topic_2275"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        }
    ],
    "validated": 1
}
