{
    "additionDate": "2019-11-14T18:07:09Z",
    "biotoolsCURIE": "biotools:Taba",
    "biotoolsID": "Taba",
    "confidence_flag": "tool",
    "description": "A Tool to Analyze the Binding Affinity | Taba: Tool to Analyze Binding Affinity | Taba is free software: you can redistribute it and/or modify it under the terms of the GNU General Public License as published by the Free Software Foundation, either version 3 of the License, or (at your option) any later version. You can use a higher version as well",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Residue distance calculation",
                    "uri": "http://edamontology.org/operation_2950"
                },
                {
                    "term": "Protein-ligand docking",
                    "uri": "http://edamontology.org/operation_0482"
                }
            ]
        }
    ],
    "homepage": "https://github.com/azevedolab/taba",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-12-27T14:01:07Z",
    "name": "Taba",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1002/JCC.26048",
            "metadata": {
                "abstract": "© 2019 Wiley Periodicals, Inc.Evaluation of ligand-binding affinity using the atomic coordinates of a protein-ligand complex is a challenge from the computational point of view. The availability of crystallographic structures of complexes with binding affinity data opens the possibility to create machine-learning models targeted to a specific protein system. Here, we describe a new methodology that combines a mass-spring system approach with supervised machine-learning techniques to predict the binding affinity of protein-ligand complexes. The combination of these techniques allows exploring the scoring function space, generating a model targeted to a protein system of interest. The new model shows superior predictive performance when compared with classical scoring functions implemented in the programs Molegro Virtual Docker, AutoDock4, and AutoDock Vina. We implemented this methodology in a new program named Taba. Taba is implemented in Python and available to download under the GNU license at https://github.com/azevedolab/taba. © 2019 Wiley Periodicals, Inc.",
                "authors": [
                    {
                        "name": "da Silva A.D."
                    },
                    {
                        "name": "Bitencourt-Ferreira G."
                    },
                    {
                        "name": "de Azevedo W.F."
                    }
                ],
                "citationCount": 12,
                "date": "2020-01-05T00:00:00Z",
                "journal": "Journal of Computational Chemistry",
                "title": "Taba: A Tool to Analyze the Binding Affinity"
            },
            "pmid": "31410856"
        }
    ],
    "topic": [
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        }
    ],
    "validated": 1
}