
{
    "credit": [
        {
            "email": "genabel.project@gmail.com",
            "name": "GenABEL project developers",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://forum.genabel.org/viewforum.php?f=6&sid=55df5ed482235ae6e13fef77734c5a68"
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "https://cran.r-project.org/web/packages/GenABEL/index.html"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Mapping",
                    "uri": "http://edamontology.org/operation_2429"
                }
            ]
        }
    ],
    "labels": {
        "collectionID": [
            "Animal and Crop Genomics"
        ],
        "language": [
            "R"
        ],
        "license": "CC-BY-SA-3.0",
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Library",
            "Suite"
        ],
        "topic": [
            {
                "term": "GWAS study",
                "uri": "http://edamontology.org/topic_3517"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© 2016 Karssen LC et al. Development of free/libre open source software is usually done by a community of people with an interest in the tool. For scientific software, however, this is less often the case. Most scientific software is written by only a few authors, often a student working on a thesis. Once the paper describing the tool has been published, the tool is no longer developed further and is left to its own device. Here we describe the broad, multidisciplinary community we formed around a set of tools for statistical genomics. The GenABEL project for statistical omics actively promotes open interdisciplinary development of statistical methodology and its implementation in efficient and user-friendly software under an open source licence. The software tools developed withing the project collectively make up the GenABEL suite, which currently consists of eleven tools. The open framework of the project actively encourages involvement of the community in all stages, from formulation of methodological ideas to application of software to specific data sets. A web forum is used to channel user questions and discussions, further promoting the use of the GenABEL suite. Developer discussions take place on a dedicated mailing list, and development is further supported by robust development practices including use of public version control, code review and continuous integration. Use of this open science model attracts contributions from users and developers outside the \"core team\", facilitating agile statistical omics methodology development and fast dissemination.",
            "authors": [
                "Karssen L.C.",
                "van Duijn C.M.",
                "Aulchenko Y.S."
            ],
            "cit_count": 14,
            "doi": "10.12688/f1000research.8733.1",
            "journal": "F1000Research",
            "title": "The GenABEL Project for statistical genomics [version 1; referees: 2 approved]",
            "type": "Primary",
            "year": "2016-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:genabel",
        "biotoolsID": "genabel",
        "description": "Genome-wide association analysis between quantitative or binary traits and SNPs.",
        "homepage": "https://cran.r-project.org/web/packages/GenABEL/index.html",
        "name": "GenABEL"
    }
}