{
    "accessibility": "Open access",
    "additionDate": "2022-08-30T12:15:12.805862Z",
    "biotoolsCURIE": "biotools:aucpred",
    "biotoolsID": "aucpred",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "jinboxu@gmail.com",
            "name": "Jinbo Xu"
        },
        {
            "email": "wangsheng@uchicago.edu",
            "name": "Sheng Wang"
        }
    ],
    "description": "AUCpreD is a method that predicts intrinsically disordered regions (IDR). AUCpreD works well without sequence profile, comparing favorably to or even outperforming many methods using sequence profile.",
    "editPermission": {
        "authors": [
            "damiano.piovesan",
            "tlazar"
        ],
        "type": "group"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Protein globularity",
                        "uri": "http://edamontology.org/data_1526"
                    }
                },
                {
                    "data": {
                        "term": "Sequence image",
                        "uri": "http://edamontology.org/data_2969"
                    }
                },
                {
                    "data": {
                        "term": "Sequence profile",
                        "uri": "http://edamontology.org/data_1354"
                    }
                }
            ],
            "operation": [
                {
                    "term": "Protein disorder prediction",
                    "uri": "http://edamontology.org/operation_3904"
                },
                {
                    "term": "Protein secondary structure prediction (coils)",
                    "uri": "http://edamontology.org/operation_0470"
                }
            ]
        }
    ],
    "homepage": "http://raptorx2.uchicago.edu/StructurePropertyPred/predict/",
    "language": [
        "C",
        "C++"
    ],
    "lastUpdate": "2024-11-24T15:19:44.354341Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/realbigws/RaptorX_Property_Fast"
        }
    ],
    "name": "AUCpreD",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "daniela.mereuta",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btw446",
            "metadata": {
                "abstract": "Motivation: Protein intrinsically disordered regions (IDRs) play an important role in many biological processes. Two key properties of IDRs are (i) the occurrence is proteome-wide and (ii) the ratio of disordered residues is about 6%, which makes it challenging to accurately predict IDRs. Most IDR prediction methods use sequence profile to improve accuracy, which prevents its application to proteome-wide prediction since it is time-consuming to generate sequence profiles. On the other hand, the methods without using sequence profile fare much worse than using sequence profile. Method: This article formulates IDR prediction as a sequence labeling problem and employs a new machine learning method called Deep Convolutional Neural Fields (DeepCNF) to solve it. DeepCNF is an integration of deep convolutional neural networks (DCNN) and conditional random fields (CRF); it can model not only complex sequence-structure relationship in a hierarchical manner, but also correlation among adjacent residues. To deal with highly imbalanced order/disorder ratio, instead of training DeepCNF by widely used maximum-likelihood, we develop a novel approach to train it by maximizing area under the ROC curve (AUC), which is an unbiased measure for class-imbalanced data. Results: Our experimental results show that our IDR prediction method AUCpreD outperforms existing popular disorder predictors. More importantly, AUCpreD works very well even without sequence profile, comparing favorably to or even outperforming many methods using sequence profile. Therefore, our method works for proteome-wide disorder prediction while yielding similar or better accuracy than the others. Availability and Implementation: http://raptorx2.uchicago.edu/StructurePropertyPred/predict/.",
                "authors": [
                    {
                        "name": "Ma J."
                    },
                    {
                        "name": "Wang S."
                    },
                    {
                        "name": "Xu J."
                    }
                ],
                "citationCount": 97,
                "date": "2016-09-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "AUCpreD: Proteome-level protein disorder prediction by AUC-maximized deep convolutional neural fields"
            },
            "pmcid": "PMC5013916",
            "pmid": "27587688",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Sequence sites, features and motifs",
            "uri": "http://edamontology.org/topic_0160"
        }
    ]
}
