{
    "additionDate": "2020-03-30T09:15:35Z",
    "biotoolsCURIE": "biotools:unired",
    "biotoolsID": "unired",
    "description": "UniReD is a Text Mining tool that collects high quality, manually annotated and non-redundant Human or Mouse proteins from UniProtKB/Swiss-Prot (reviewed). Using a combination of publications that are i. manually assigned to each protein by UniProt and ii.automatically calculated (as related documents) by PubMed, UniReD creates clusters of proteins that are putatively functionally related.",
    "editPermission": {
        "type": "private"
    },
    "homepage": "http://bioinformatics.med.uoc.gr/unired/",
    "lastUpdate": "2024-11-25T13:58:36.365205Z",
    "maturity": "Mature",
    "name": "UniReD",
    "owner": "g.pavlopoulos",
    "publication": [
        {
            "doi": "10.1093/nargab/lqaa005",
            "metadata": {
                "abstract": "The in-depth study of protein–protein interactions (PPIs) is of key importance for understanding how cells operate. Therefore, in the past few years, many experimental as well as computational approaches have been developed for the identification and discovery of such interactions. Here, we present UniReD, a user-friendly, computational prediction tool which analyses biomedical literature in order to extract known protein associations and suggest undocumented ones. As a proof of concept, we demonstrate its usefulness by experimentally validating six predicted interactions and by benchmarking it against public databases of experimentally validated PPIs succeeding a high coverage. We believe that UniReD can become an important and intuitive resource for experimental biologists in their quest for finding novel associations within a protein network and a useful tool to complement experimental approaches (e.g. mass spectrometry) by producing sorted lists of candidate proteins for further experimental validation. UniReD is available at http://bioinformatics.med.uoc.gr/unired/.",
                "authors": [
                    {
                        "name": "Aivaliotis M."
                    },
                    {
                        "name": "Amoutzias G.D."
                    },
                    {
                        "name": "Bonetto G."
                    },
                    {
                        "name": "Eliopoulos A.G."
                    },
                    {
                        "name": "Fakoureli E."
                    },
                    {
                        "name": "Iliopoulos I."
                    },
                    {
                        "name": "Karagogeos D."
                    },
                    {
                        "name": "Maxouri S."
                    },
                    {
                        "name": "Nikoletopoulou V."
                    },
                    {
                        "name": "Papanikolaou N."
                    },
                    {
                        "name": "Pavlopoulos G.A."
                    },
                    {
                        "name": "Savvaki M."
                    },
                    {
                        "name": "Tavernarakis N."
                    },
                    {
                        "name": "Theodosiou T."
                    },
                    {
                        "name": "Tzamarias D."
                    }
                ],
                "citationCount": 10,
                "date": "2020-03-01T00:00:00Z",
                "journal": "NAR Genomics and Bioinformatics",
                "title": "UniProt-Related Documents (UniReD): assisting wet lab biologists in their quest on finding novel counterparts in a protein network"
            },
            "pmcid": "PMC7671407",
            "pmid": "33575553"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Functional genomics",
            "uri": "http://edamontology.org/topic_0085"
        }
    ],
    "validated": 1
}
