{
    "name": "FuNeL", 
    "description": "Protocol to infer functional networks from machine learning models. It is a general approach that uses BioHEL, a rule-based evolutionary classifier, to describe the expression samples as a set of rules and then infers interactions between genes that act together within rules to predict the samples class. It generates co-prediction networks, that capture biological knowledge complementary to that contained in popular similarity-based co-expression networks.", 
    "homepage": "http://ico2s.org/software/funel.html", 
    "biotoolsID": "funel", 
    "biotoolsCURIE": "biotools:funel", 
    "version": [], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_3439", 
                    "term": "Pathway or network prediction"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": "FuNeL can be used to generate biological functional networks from rule-based machine learning models", 
            "cmd": null
        }
    ], 
    "toolType": [
        "Command-line tool"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_2259", 
            "term": "Systems biology"
        }, 
        {
            "uri": "http://edamontology.org/topic_3307", 
            "term": "Computational biology"
        }
    ], 
    "operatingSystem": [
        "Linux", 
        "Mac"
    ], 
    "language": [
        "R", 
        "Python"
    ], 
    "license": "AGPL-3.0", 
    "collectionID": [], 
    "maturity": "Emerging", 
    "cost": "Free of charge", 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [], 
    "download": [
        {
            "url": "http://ico2s.org/data/code/funel.tar.xz", 
            "type": "Source code", 
            "note": null, 
            "version": null
        }, 
        {
            "url": "http://ico2s.org/data/code/funel.tar.xz", 
            "type": "Binaries", 
            "note": null, 
            "version": null
        }
    ], 
    "documentation": [
        {
            "url": "http://ico2s.org/software/tutorials/funel.html", 
            "type": "General", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": "10.1186/s13040-016-0106-4", 
            "pmid": null, 
            "pmcid": null, 
            "type": "Primary", 
            "version": null, 
            "metadata": {
                "title": "Functional networks inference from rule-based machine learning models", 
                "abstract": "© 2016 The Author(s). Background: Functional networks play an important role in the analysis of biological processes and systems. The inference of these networks from high-throughput (-omics) data is an area of intense research. So far, the similarity-based inference paradigm (e.g. gene co-expression) has been the most popular approach. It assumes a functional relationship between genes which are expressed at similar levels across different samples. An alternative to this paradigm is the inference of relationships from the structure of machine learning models. These models are able to capture complex relationships between variables, that often are different/complementary to the similarity-based methods. Results: We propose a protocol to infer functional networks from machine learning models, called FuNeL. It assumes, that genes used together within a rule-based machine learning model to classify the samples, might also be functionally related at a biological level. The protocol is first tested on synthetic datasets and then evaluated on a test suite of 8 real-world datasets related to human cancer. The networks inferred from the real-world data are compared against gene co-expression networks of equal size, generated with 3 different methods. The comparison is performed from two different points of view. We analyse the enriched biological terms in the set of network nodes and the relationships between known disease-associated genes in a context of the network topology. The comparison confirms both the biological relevance and the complementary character of the knowledge captured by the FuNeL networks in relation to similarity-based methods and demonstrates its potential to identify known disease associations as core elements of the network. Finally, using a prostate cancer dataset as a case study, we confirm that the biological knowledge captured by our method is relevant to the disease and consistent with the specialised literature and with an independent dataset not used in the inference process. Availability: The implementation of our network inference protocol is available at: http://ico2s.org/software/funel.HTML.", 
                "date": "2016-09-05T00:00:00Z", 
                "citationCount": 5, 
                "authors": [
                    {
                        "name": "Lazzarini N."
                    }, 
                    {
                        "name": "Widera P."
                    }, 
                    {
                        "name": "Williamson S."
                    }, 
                    {
                        "name": "Heer R."
                    }, 
                    {
                        "name": "Krasnogor N."
                    }, 
                    {
                        "name": "Bacardit J."
                    }
                ], 
                "journal": "BioData Mining"
            }
        }
    ], 
    "credit": [
        {
            "name": "Nicola Lazzarini", 
            "email": "n.lazzarini@newcastle.ac.uk", 
            "url": "http://homepages.cs.ncl.ac.uk/n.lazzarini/", 
            "orcidid": null, 
            "typeEntity": null, 
            "typeRole": [
                "Developer"
            ], 
            "note": null
        }, 
        {
            "name": "Jaume Bacardit", 
            "email": "jaume.bacardit@newcastle.ac.uk", 
            "url": "http://homepages.cs.ncl.ac.uk/jaume.bacardit/", 
            "orcidid": null, 
            "typeEntity": null, 
            "typeRole": [
                "Support"
            ], 
            "note": null
        }, 
        {
            "name": "Nicola Lazzarini", 
            "email": "n.lazzarini@newcastle.ac.uk", 
            "url": "http://homepages.cs.ncl.ac.uk/n.lazzarini/", 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }, 
        {
            "name": "Jaume Bacardit", 
            "email": "jaume.bacardit@newcastle.ac.uk", 
            "url": "http://homepages.cs.ncl.ac.uk/jaume.bacardit/", 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "nvl", 
    "additionDate": "2016-09-12T14:02:21Z", 
    "lastUpdate": "2018-12-10T12:58:53Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 1, 
    "homepage_status": 0, 
    "elixir_badge": 0
}