{
    "additionDate": "2020-01-14T09:11:25Z",
    "biotoolsCURIE": "biotools:MySeq",
    "biotoolsID": "MySeq",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "mlinderman@middlebury.edu",
            "name": "Michael D. Linderman",
            "orcidid": "https://orcid.org/0000-0002-9643-7148",
            "typeEntity": "Person"
        }
    ],
    "description": "Privacy-protecting browser-based personal Genome analysis for genomics education and exploration.\n\nMySeq is a web-application for privacy-protecting interactive analysis of personal genomes (distributed as compressed-and-indexed VCF files) inspired by GENOtation (previously the Interpretome) and DNA.LAND Compass. MySeq is intended for use as a genomics educational platform.\n\nAnalyzing the PTC Tasting Phenotype with MySeq.\n\nThis page is an example analysis of the \"bitter tasting\" trait using the MySeq application in an embedded context. Here MySeq is used to both query a whole genome VCF for NA12878 (from Genome in a Bottle) by genomic coordinates and predict the bitter tasting phenotype directly. All of the queries demonstrated here are performed \"live\" in the browser, that is these are not pre-generated results. Try MySeq as a \"standalone\" application.\n\nMySeq is a single-page web application for privacy-protecting personal genome analysis",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Anonymisation",
                    "uri": "http://edamontology.org/operation_3283"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Parsing",
                    "uri": "http://edamontology.org/operation_1812"
                },
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                },
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                }
            ]
        }
    ],
    "homepage": "https://go.middlebury.edu/myseq-demo",
    "language": [
        "JavaScript"
    ],
    "lastUpdate": "2021-01-04T07:11:35Z",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "https://go.middlebury.edu/myseq"
        },
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/mlinderm/myseq"
        }
    ],
    "name": "MySeq",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12920-019-0615-3",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: The complexity of genome informatics is a recurring challenge for genome exploration and analysis by students and other non-experts. This complexity creates a barrier to wider implementation of experiential genomics education, even in settings with substantial computational resources and expertise. Reducing the need for specialized software tools will increase access to hands-on genomics pedagogy. Results: MySeq is a React.js single-page web application for privacy-protecting interactive personal genome analysis. All analyses are performed entirely in the user's web browser eliminating the need to install and use specialized software tools or to upload sensitive data to an external web service. MySeq leverages Tabix-indexing to efficiently query whole genome-scale variant call format (VCF) files stored locally or available remotely via HTTP(s) without loading the entire file. MySeq currently implements variant querying and annotation, physical trait prediction, pharmacogenomic, polygenic disease risk and ancestry analyses to provide representative pedagogical examples; and can be readily extended with new analysis or visualization components. Conclusions: MySeq supports multiple pedagogical approaches including independent exploration and interactive online tutorials. MySeq has been successfully employed in an undergraduate human genome analysis course where it reduced the barriers-to-entry for hands-on human genome analysis.",
                "authors": [
                    {
                        "name": "Chang L."
                    },
                    {
                        "name": "Linderman M.D."
                    },
                    {
                        "name": "McElroy L."
                    }
                ],
                "date": "2019-11-27T00:00:00Z",
                "journal": "BMC Medical Genomics",
                "title": "MySeq: Privacy-protecting browser-based personal Genome analysis for genomics education and exploration"
            },
            "pmcid": "PMC6882182",
            "pmid": "31775760"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Exome sequencing",
            "uri": "http://edamontology.org/topic_3676"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Informatics",
            "uri": "http://edamontology.org/topic_0605"
        },
        {
            "term": "Pharmacogenomics",
            "uri": "http://edamontology.org/topic_0208"
        },
        {
            "term": "Whole genome sequencing",
            "uri": "http://edamontology.org/topic_3673"
        }
    ],
    "validated": 1
}
