{
    "additionDate": "2021-11-15T11:41:20.031248Z",
    "biotoolsCURIE": "biotools:acp-da",
    "biotoolsID": "acp-da",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "zhangwen@mail.hzau.edu.cn",
            "name": "Wen Zhang",
            "typeEntity": "Person"
        }
    ],
    "description": "Improving the Prediction of Anticancer Peptides Using Data Augmentation.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Dimensionality reduction",
                    "uri": "http://edamontology.org/operation_3935"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "http://github.com/chenxgscuec/ACPDA",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-11-15T11:41:20.033870Z",
    "name": "ACP-DA",
    "operatingSystem": [
        "Mac",
        "Linux",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.3389/FGENE.2021.698477",
            "metadata": {
                "abstract": "© Copyright © 2021 Chen, Zhang, Yang, Li and Chen.Anticancer peptides (ACPs) have provided a promising perspective for cancer treatment, and the prediction of ACPs is very important for the discovery of new cancer treatment drugs. It is time consuming and expensive to use experimental methods to identify ACPs, so computational methods for ACP identification are urgently needed. There have been many effective computational methods, especially machine learning-based methods, proposed for such predictions. Most of the current machine learning methods try to find suitable features or design effective feature learning techniques to accurately represent ACPs. However, the performance of these methods can be further improved for cases with insufficient numbers of samples. In this article, we propose an ACP prediction model called ACP-DA (Data Augmentation), which uses data augmentation for insufficient samples to improve the prediction performance. In our method, to better exploit the information of peptide sequences, peptide sequences are represented by integrating binary profile features and AAindex features, and then the samples in the training set are augmented in the feature space. After data augmentation, the samples are used to train the machine learning model, which is used to predict ACPs. The performance of ACP-DA exceeds that of existing methods, and ACP-DA achieves better performance in the prediction of ACPs compared with a method without data augmentation. The proposed method is available at http://github.com/chenxgscuec/ACPDA.",
                "authors": [
                    {
                        "name": "Chen X.-G."
                    },
                    {
                        "name": "Zhang W."
                    },
                    {
                        "name": "Yang X."
                    },
                    {
                        "name": "Li C."
                    },
                    {
                        "name": "Chen H."
                    }
                ],
                "date": "2021-06-30T00:00:00Z",
                "journal": "Frontiers in Genetics",
                "title": "ACP-DA: Improving the Prediction of Anticancer Peptides Using Data Augmentation"
            },
            "pmcid": "PMC8279753",
            "pmid": "34276801"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Mathematics",
            "uri": "http://edamontology.org/topic_3315"
        }
    ]
}