{
    "additionDate": "2022-10-11T12:39:24.803449Z",
    "biotoolsCURIE": "biotools:vaxinpad",
    "biotoolsID": "vaxinpad",
    "credit": [
        {
            "name": "Dr Gajendra P.S. Raghava",
            "url": "https://webs.iiitd.edu.in/raghava/vaxinpad/index.php"
        }
    ],
    "description": "A website for designing peptide based vaccine adjuvants.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://webs.iiitd.edu.in/raghava/vaxinpad/index.php"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Analysis",
                    "uri": "http://edamontology.org/operation_2945"
                }
            ]
        }
    ],
    "homepage": "https://webs.iiitd.edu.in/raghava/vaxinpad/index.php",
    "lastUpdate": "2022-10-11T12:39:30.517230Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "https://webs.iiitd.edu.in/raghava/vaxinpad/index.php"
        }
    ],
    "name": "vaxinpad",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "raghavagps",
    "publication": [
        {
            "doi": "10.1186/s12967-018-1560-1",
            "metadata": {
                "abstract": "© 2018 The Author(s).Background: Evidences in literature strongly advocate the potential of immunomodulatory peptides for use as vaccine adjuvants. All the mechanisms of vaccine adjuvants ensuing immunostimulatory effects directly or indirectly stimulate antigen presenting cells (APCs). While numerous methods have been developed in the past for predicting B cell and T-cell epitopes; no method is available for predicting the peptides that can modulate the APCs. Methods: We named the peptides that can activate APCs as A-cell epitopes and developed methods for their prediction in this study. A dataset of experimentally validated A-cell epitopes was collected and compiled from various resources. To predict A-cell epitopes, we developed support vector machine-based machine learning models using different sequence-based features. Results: A hybrid model developed on a combination of sequence-based features (dipeptide composition and motif occurrence), achieved the highest accuracy of 95.71% with Matthews correlation coefficient (MCC) value of 0.91 on the training dataset. We also evaluated the hybrid models on an independent dataset and achieved a comparable accuracy of 95.00% with MCC 0.90. Conclusion: The models developed in this study were implemented in a web-based platform VaxinPAD to predict and design immunomodulatory peptides or A-cell epitopes. This web server available at http://webs.iiitd.edu.in/raghava/vaxinpad/will facilitate researchers in designing peptide-based vaccine adjuvants.",
                "authors": [
                    {
                        "name": "Agrawal P."
                    },
                    {
                        "name": "Chaudhary K."
                    },
                    {
                        "name": "Nagpal G."
                    },
                    {
                        "name": "Raghava G.P.S."
                    }
                ],
                "citationCount": 40,
                "date": "2018-07-03T00:00:00Z",
                "journal": "Journal of Translational Medicine",
                "title": "Computer-aided prediction of antigen presenting cell modulators for designing peptide-based vaccine adjuvants"
            },
            "pmcid": "PMC6029051",
            "pmid": "29970096"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Computational biology",
            "uri": "http://edamontology.org/topic_3307"
        }
    ]
}
