{"collectionID": [], "accessibility": [], "topic": [{"term": "Small molecules", "uri": "http://edamontology.org/topic_0154"}, {"term": "Protein targeting and localisation", "uri": "http://edamontology.org/topic_0140"}, {"term": "Protein folding, stability and design", "uri": "http://edamontology.org/topic_0130"}, {"term": "Proteins", "uri": "http://edamontology.org/topic_0078"}], "owner": "ELIXIR-EE", "cost": null, "relation": [], "download": [], "validated": 1, "publication": [{"doi": null, "note": null, "version": null, "pmid": "12592412", "type": null, "pmcid": null, "metadata": {"title": "Scanning the human genome with combinatorial transcription factor libraries", "abstract": "Despite the critical importance of transcription factors in mediating gene regulation, there exists no general, genome-wide tool that uses transcription factors to induce or silence a target gene or select for a particular phenotype. In the strategy described here, we prepared large combinatorial libraries of artificial transcription factors comprising three or six zinc-finger domains, and selected transcription factor-DNA interactions able to upregulate several genes in human cells. Selected transcription factors either induced the expression of an endothelial-specific differentiation marker, VE-cadherin, in non-endothelial cell lines or, when combined with a repression domain, knocked down expression. Potential binding sites for a number of these transcription factors were mapped along the promoter of CDH5, the gene encoding VE-cadherin. Transcription factor libraries represent a useful approach for studying and modulating gene function in cells and potentially in whole organisms.", "citationCount": 101, "authors": [{"name": "Blancafort P."}, {"name": "Magnenat L."}, {"name": "Barbas III C.F."}], "date": "2003-03-01T00:00:00Z", "journal": "Nature Biotechnology"}}, {"doi": null, "note": null, "version": null, "pmid": "16107335", "type": null, "pmcid": null, "metadata": {"title": "Development of zinc finger domains for recognition of the 5′-CNN-3′ family DNA sequences and their use in the construction of artificial transcription factors", "abstract": "Considerable progress has been made in recent years in the design of transcription factors for the directed regulation of endogenous genes. Although many strategies involve selection methods that must be applied for each new target sequence, we have developed an approach based on linkage of predefined zinc finger domains that each recognize a three-base pair DNA sequence to construct artificial transcription factors that bind to a desired sequence. These domains can be assembled to recognize unique 18-base pair DNA sequences with high specificity. Here we report the development and characterization of zinc finger domains that bind to 15 of the 16 5′-CNN-3′ subsites. These domains were created through a combination of phage display selection, site-directed mutagenesis, and de novo design. Furthermore, these domains were used to generate a highly specific six-finger protein targeting the ERBB-2 promoter. When fused to regulatory domains, this protein was capable of up- and down-regulating the expression of the endogenous ERBB-2 gene. With the addition of this collection of predefined zinc finger domains, most 5′-CNN- 3′-, 5′-GNN-3′-, and 5′-ANN-3′-containing sequences can now be rapidly targeted for directed gene regulation and nuclease cleavage. © 2005 by The American Society for Biochemistry and Molecular Biology, Inc.", "citationCount": 151, "authors": [{"name": "Dreier B."}, {"name": "Fuller R.P."}, {"name": "Segal D.J."}, {"name": "Lund C.V."}, {"name": "Blancafort P."}, {"name": "Huber A."}, {"name": "Koksch B."}, {"name": "Barbas III C.F."}], "date": "2005-10-21T00:00:00Z", "journal": "Journal of Biological Chemistry"}}, {"doi": null, "note": null, "version": null, "pmid": "11054286", "type": null, "pmcid": null, "metadata": {"title": "Insights into the molecular recognition of the 5'-GNN-3' family of DNA sequences by zinc finger domains", "abstract": "In order to construct zinc finger domains that recognize all of the possible 64 DNA triplets, it is necessary to understand the mechanisms of protein/DNA interactions on the molecular level. Previously we reported 16 zinc finger domains which had been characterized in detail to bind specifically to the 5'-GNN-3' family of DNA sequences. Artificial transcription factors constructed from these domains can regulate the expression of endogenous genes. These domains were created by phage-display selection followed by site-directed mutagenesis. A total of 84 mutants of a three-domain zinc finger protein have been analyzed for their DNA-binding specificity. Here, we report the results of this systematic and extensive mutagenesis study. New insights into zinc finger/DNA interactions were obtained by combining specificity data with computer modeling and comparison with known structural data from NMR and crystallographic studies. This analysis suggests that unusual cross-strand and inter-helical contacts are made by some of these proteins, and the general orientation of the recognition helix to the DNA is flexible, even when constrained by flanking zinc finger domains. These findings disfavor the utility of existing simple recognition codes and suggest that highly specific domains cannot be obtained from phage display alone in most cases, but only in combination with rational design. The molecular basis of zinc finger/DNA interaction is complex and its understanding is dependent on the analysis of a large number of proteins. This understanding should enable us to refine rapidly the specificity of other zinc finger domains, as well as polydactyl proteins constructed with these domains to recognize extended DNA sequences. (C) 2000 Academic Press.", "citationCount": 119, "authors": [{"name": "Dreier B."}, {"name": "Segal D.J."}, {"name": "Barbas III C.F."}], "date": "2000-11-03T00:00:00Z", "journal": "Journal of Molecular Biology"}}, {"doi": null, "note": null, "version": null, "pmid": "16845061", "type": null, "pmcid": null, "metadata": {"title": "Zinc Finger Tools: Custom DNA-binding domains for transcription factors and nucleases", "abstract": "Individual zinc finger (ZF) domains that recognize DNA triplets with high specificity and affinity can be used to create designer transcription factors and nucleases that are specific for nearly any site in the genome. These domains can be treated as modular units and assembled to create a polydactyl protein that recognizes extended DNA sequences. Determination of valid target sites and the subsequent design of ZF proteins (ZFPs) is error-prone and not trivial, however. As a result, the use of ZFPs have been restricted primarily to those labs with the appropriate expertise. To address these limitations, we have created a user-friendly utility called Zinc Finger Tools (ZF Tools) that can be accessed at the URL http://www.zincfingertools.org. User-supplied DNA sequences can be searched for target sites appropriate for either gene regulation or nuclease targeting. Using a database of experimentally characterized zinc finger domains, the amino acid sequence for a ZFP expected to bind to any chosen target site can be generated. A reverse engineering utility is provided to predict the binding site for a ZFP of known sequence. © The Author 2006. Published by Oxford University Press. All rights reserved.", "citationCount": 205, "authors": [{"name": "Mandell J.G."}, {"name": "Barbas III C.F."}], "date": "2006-07-01T00:00:00Z", "journal": "Nucleic Acids Research"}}, {"doi": null, "note": null, "version": null, "pmid": "11340073", "type": null, "pmcid": null, "metadata": {"title": "Development of Zinc Finger Domains for Recognition of the 5′-ANN-3′ Family of DNA Sequences and Their Use in the Construction of Artificial Transcription Factors", "abstract": "In previous studies we have developed Cys2-His2 zinc finger domains that specifically recognized each of the 16 5′-GNN-3′ DNA target sequences and could be used to assemble six-finger proteins that bind 18-base pair DNA sequences (Beerli, R. R., Dreier, B., and Barbas, C. F., III (2000) Proc. Natl. Acad. Sci. U. S. A. 97, 1495-1500). Such proteins provide the basis for the construction of artificial transcription factors to study gene/function relationships in the post-genomic era. Central to the universal application of this approach is the development of zinc finger domains that specifically recognize each of the 64 possible DNA triplets. Here we describe the construction of a novel phage display library that enables the selection of zinc finger domains recognizing the 5′-ANN-3′ family of DNA sequences. Library selections provided domains that in most cases showed binding specificity for the 3-base pair target site that they were selected to bind. These zinc finger domains were used to construct 6-finger proteins that specifically bound their 18-base pair target site with affinities in the pM to low nM range. When fused to regulatory domains, these proteins containing various numbers of 5′-ANN-3′ domains were capable of specific transcriptional regulation of a reporter gene and the endogenous human ERBB-2 and ERBB-3 genes. These results suggest that modular DNA recognition by zinc finger domains is not limited to the 5′-GNN-3′ family of DNA sequences and can be extended to the 5′-ANN-3′ family. The domains characterized in this work provide for the rapid construction of artificial transcription factors, thereby greatly increasing the number of sequences and genes that can be targeted by DNA-binding proteins built from pre-defined zinc finger domains.", "citationCount": 230, "authors": [{"name": "Dreier B."}, {"name": "Beerli R.R."}, {"name": "Segal D.J."}, {"name": "Flippin J.D."}, {"name": "Barbas III C.F."}], "date": "2001-08-03T00:00:00Z", "journal": "Journal of Biological Chemistry"}}, {"doi": null, "note": null, "version": null, "pmid": "10077584", "type": null, "pmcid": null, "metadata": {"title": "Toward controlling gene expression at will: Selection and design of zinc finger domains recognizing each of the 5′-GNN-3′ DNA target sequences", "abstract": "We have taken a comprehensive approach to the generation of novel DNA binding zinc finger domains of defined specificity. Herein we describe the generation and characterization of a family of zinc finger domains developed for the recognition of each of the 16 possible 3-bp DNA binding sites having the sequence 5′-GNN-3′. Phage display libraries of zinc finger proteins were created and selected under conditions that favor enrichment of sequence-specific proteins. Zinc finger domains recognizing a number of sequences required refinement by site-directed mutagenesis that was guided by both phage selection data and structural information. In many cases, residues not expected to make base-specific contacts had effects on specificity. A number of these domains demonstrate exquisite specificity and discriminate between sequences that differ by a single base with >100-fold loss in affinity. We conclude that the three helical positions -1, 3, and 6 of a zinc finger domain are insufficient to allow for the fine specificity of the DNA binding domain to be predicted. These domains are functionally modular and may be recombined with one another to create polydactyl proteins capable of binding 18-bp sequences with subnanomolar affinity. The family of zinc finger domains described here is sufficient for the construction of 17 million novel proteins that bind the 5′-(GNN)6-3′ family of DNA sequences. These materials and methods should allow for the rapid construction of novel gene switches and provide the basis for a universal system for gene control.", "citationCount": 334, "authors": [{"name": "Segal D.J."}, {"name": "Dreier B."}, {"name": "Beerli R.R."}, {"name": "Barbas III C.F."}], "date": "1999-03-16T00:00:00Z", "journal": "Proceedings of the National Academy of Sciences of the United States of America"}}], "homepage_status": 0, "credit": [{"typeRole": ["Primary contact"], "name": "Contact Form", "url": "http://www.scripps.edu/barbas/zfdesign/feedback.php", "gridid": null, "note": null, "orcidid": null, "typeEntity": "Person", "email": null}], "biotoolsCURIE": "biotools:zinc_finger_tools", "elixirPlatform": [], "elixirNode": [], "version": [], "elixir_badge": 0, "homepage": "http://www.scripps.edu/mb/barbas/zfdesign/zfdesignhome.php", "function": [{"note": null, "input": [], "operation": [{"term": "Protein subcellular localisation prediction", "uri": "http://edamontology.org/operation_2489"}, {"term": "Protein-nucleic acid binding prediction", "uri": "http://edamontology.org/operation_0420"}], "cmd": null, "output": []}], "lastUpdate": "2018-12-10T12:58:55Z", "otherID": [], "description": "Provides several tools for selecting zinc finger protein target sites and for designing the proteins that will target them.", "toolType": ["Web application"], "editPermission": {"type": "private", "authors": []}, "language": [], "link": [], "biotoolsID": "zinc_finger_tools", "additionDate": "2017-02-10T14:16:01Z", "name": "Zinc Finger Tools", "license": null, "documentation": [{"url": "http://www.scripps.edu/barbas/zfdesign/intro.php#overview", "note": null, "type": "General"}], "maturity": null, "confidence_flag": null, "operatingSystem": ["Linux", "Windows", "Mac"]}