
{
    "credit": [
        {
            "email": "piero.dallepezze@babraham.ac.uk",
            "name": "Piero Dallepezze",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "https://sbpipe.readthedocs.io/en/latest/"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Service composition",
                    "uri": "http://edamontology.org/operation_3762"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "R",
            "Python"
        ],
        "license": "MIT",
        "operatingSystem": [
            "Linux",
            "Mac"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Systems biology",
                "uri": "http://edamontology.org/topic_2259"
            },
            {
                "term": "Simulation experiment",
                "uri": "http://edamontology.org/topic_3524"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© 2017 The Author(s).Background: The rapid growth of the number of mathematical models in Systems Biology fostered the development of many tools to simulate and analyse them. The reliability and precision of these tasks often depend on multiple repetitions and they can be optimised if executed as pipelines. In addition, new formal analyses can be performed on these repeat sequences, revealing important insights about the accuracy of model predictions. Results: Here we introduce SBpipe, an open source software tool for automating repetitive tasks in model building and simulation. Using basic YAML configuration files, SBpipe builds a sequence of repeated model simulations or parameter estimations, performs analyses from this generated sequence, and finally generates a LaTeX/PDF report. The parameter estimation pipeline offers analyses of parameter profile likelihood and parameter correlation using samples from the computed estimates. Specific pipelines for scanning of one or two model parameters at the same time are also provided. Pipelines can run on multicore computers, Sun Grid Engine (SGE), or Load Sharing Facility (LSF) clusters, speeding up the processes of model building and simulation. SBpipe can execute models implemented in COPASI, Python or coded in any other programming language using Python as a wrapper module. Future support for other software simulators can be dynamically added without affecting the current implementation. Conclusions: SBpipe allows users to automatically repeat the tasks of model simulation and parameter estimation, and extract robustness information from these repeat sequences in a solid and consistent manner, facilitating model development and analysis. The source code and documentation of this project are freely available at the web site: https://pdp10.github.io/sbpipe/.",
            "authors": [
                "Dalle Pezze P.",
                "Le Novere N."
            ],
            "cit_count": 3,
            "doi": "10.1186/s12918-017-0423-3",
            "journal": "BMC Systems Biology",
            "title": "SBpipe: A collection of pipelines for automating repetitive simulation and analysis tasks",
            "year": "2017-04-10"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:sbpipe",
        "biotoolsID": "sbpipe",
        "description": "Allows mathematical modellers to automatically repeat the tasks of model simulation and parameter estimation, and extract robustness information from these repeat sequences in a solid and consistent manner, facilitating model development and analysis.",
        "homepage": "https://pdp10.github.io/sbpipe/",
        "name": "SBpipe"
    }
}