{
    "additionDate": "2021-01-20T10:57:06Z",
    "biotoolsCURIE": "biotools:ursahd",
    "biotoolsID": "ursahd",
    "collectionID": [
        "Rare Disease"
    ],
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "chandrat@princeton.edu",
            "name": "Chandra L. Theesfeld",
            "typeEntity": "Person"
        },
        {
            "email": "ogt@cs.princeton.edu",
            "name": "Olga G. Troyanskaya",
            "typeEntity": "Person"
        }
    ],
    "description": "A Computational Framework for Genome-wide Characterization of the Human Disease Landscape.\n\nA data-driven perspective to your gene expression profile for human tissues and diseases.\n\nLeveraging gene expression profiles of thousands of tissue and disease samples by comparing them all to each other, URSA and URSA(HD) identify distinct molecular signatures of individual tissues and diseases. To ascertain the tissue and disease signals in your data, submit your gene expression profiles one at a time. A link to a single list of all your results is sent by email.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Differential gene expression analysis",
                    "uri": "http://edamontology.org/operation_3223"
                },
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                }
            ]
        }
    ],
    "homepage": "http://ursahd.princeton.edu",
    "lastUpdate": "2021-05-21T06:44:07Z",
    "name": "URSAHD",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1016/J.CELS.2018.12.010",
            "metadata": {
                "abstract": "© 2018 Elsevier Inc. A key challenge for the diagnosis and treatment of complex human diseases is identifying their molecular basis. Here, we developed a unified computational framework, URSA HD (Unveiling RNA Sample Annotation for Human Diseases), that leverages machine learning and the hierarchy of anatomical relationships present among diseases to integrate thousands of clinical gene expression profiles and identify molecular characteristics specific to each of the hundreds of complex diseases. URSA HD can distinguish between closely related diseases more accurately than literature-validated genes or traditional differential-expression-based computational approaches and is applicable to any disease, including rare and understudied ones. We demonstrate the utility of URSA HD in classifying related nervous system cancers and experimentally verifying novel neuroblastoma-associated genes identified by URSA HD . We highlight the applications for potential targeted drug-repurposing and for quantitatively assessing the molecular response to clinical therapies. URSA HD is freely available for public use, including the use of underlying models, at ursahd.princeton.edu. Discovering unique properties among diseases is needed to develop targeted treatments, especially for related disorders. To address this, we developed a unified framework, URSA HD , which leverages physiological relationships between diseases and integrates thousands of clinical samples across >300 diseases to identify distinct characteristics that can be used to guide biomedical research. We demonstrate applications of URSA HD , including guiding hypothesis generation and experiments, drug repurposing, and quantitatively tracking drug response.",
                "authors": [
                    {
                        "name": "Chang C.S."
                    },
                    {
                        "name": "Dolinski K."
                    },
                    {
                        "name": "Krishnan A."
                    },
                    {
                        "name": "Kristensen V.N."
                    },
                    {
                        "name": "Lee Y.-S."
                    },
                    {
                        "name": "Oughtred R."
                    },
                    {
                        "name": "Rust J."
                    },
                    {
                        "name": "Ryu J."
                    },
                    {
                        "name": "Theesfeld C.L."
                    },
                    {
                        "name": "Troyanskaya O.G."
                    }
                ],
                "citationCount": 5,
                "date": "2019-02-27T00:00:00Z",
                "journal": "Cell Systems",
                "title": "A Computational Framework for Genome-wide Characterization of the Human Disease Landscape"
            },
            "pmcid": "PMC7374759",
            "pmid": "30685436"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Endocrinology and metabolism",
            "uri": "http://edamontology.org/topic_3407"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Rare diseases",
            "uri": "http://edamontology.org/topic_3325"
        }
    ]
}
