
{
    "credit": [
        {
            "email": "anthonyw@wildcats.unh.edu",
            "name": "Anthony Westbrook",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "https://github.com/twestbrookunh/paladin"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence alignment",
                    "uri": "http://edamontology.org/operation_0292"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Python"
        ],
        "operatingSystem": [
            "Linux",
            "Mac"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Metagenomics",
                "uri": "http://edamontology.org/topic_3174"
            },
            {
                "term": "Proteins",
                "uri": "http://edamontology.org/topic_0078"
            },
            {
                "term": "Nucleic acid structure analysis",
                "uri": "http://edamontology.org/topic_0097"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© The Author 2017. Motivation: Whole metagenome shotgun sequencing is a powerful approach for assaying the functional potential of microbial communities. We currently lack tools that efficiently and accurately align DNA reads against protein references, the technique necessary for constructing a functional profile. Here, we present PALADIN-a novel modification of the Burrows-Wheeler Aligner that provides accurate alignment, robust reporting capabilities and orders-of-magnitude improved efficiency by directly mapping in protein space. Results: We compared the accuracy and efficiency of PALADIN against existing tools that employ nucleotide or protein alignment algorithms. Using simulated reads, PALADIN consistently outperformed the popular DNA read mappers BWA and NovoAlign in detected proteins, percentage of reads mapped and ontological similarity. We also compared PALADIN against four existing protein alignment tools: BLASTX, RAPSearch2, DIAMOND and Lambda, using empirically obtained reads. PALADIN yielded results seven times faster than the best performing alternative, DIAMOND and nearly 8000 times faster than BLASTX. PALADIN's accuracy was comparable to all tested solutions. Availability and Implementation: PALADIN was implemented in C, and its source code and documentation are available at https://github.com/twestbrookunh/paladin .",
            "authors": [
                "Westbrook A.",
                "Ramsdell J.",
                "Schuelke T.",
                "Normington L.",
                "Bergeron R.D.",
                "Thomas W.K.",
                "MacManes M.D."
            ],
            "cit_count": 5,
            "doi": "10.1093/bioinformatics/btx021",
            "journal": "Bioinformatics",
            "title": "PALADIN: Protein alignment for functional profiling whole metagenome shotgun data",
            "year": "2017-05-15"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:paladin",
        "biotoolsID": "paladin",
        "description": "Protein alignment for functional profiling whole metagenome shotgun data.",
        "homepage": "https://github.com/twestbrookunh/paladin",
        "name": "PALADIN"
    }
}