{
    "name": "Bio-Docklets", 
    "description": "Virtualization containers for single-step execution of NGS pipelines.", 
    "homepage": "https://github.com/BCIL/BioDocklets", 
    "biotoolsID": "bio-docklets", 
    "biotoolsCURIE": "biotools:bio-docklets", 
    "version": [], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_3763", 
                    "term": "Service invocation"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Command-line tool"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_3168", 
            "term": "NGS"
        }, 
        {
            "uri": "http://edamontology.org/topic_3372", 
            "term": "Software engineering"
        }, 
        {
            "uri": "http://edamontology.org/topic_3170", 
            "term": "RNA-seq"
        }
    ], 
    "operatingSystem": [
        "Linux", 
        "Mac"
    ], 
    "language": [
        "Shell", 
        "Python"
    ], 
    "license": "MIT", 
    "collectionID": [], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [], 
    "download": [], 
    "documentation": [
        {
            "url": "https://github.com/BCIL/BioDocklets/blob/master/Supplemental_User_Manual.pdf", 
            "type": "General", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": "10.1093/gigascience/gix048", 
            "pmid": null, 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "Bio-Docklets: Virtualization containers for single-step execution of NGS pipelines", 
                "abstract": "© The Author 2017. Published by Oxford University Press.Processing of next-generation sequencing (NGS) data requires significant technical skills, involving installation, configuration, and execution of bioinformatics data pipelines, in addition to specialized postanalysis visualization and data mining software. In order to address some of these challenges, developers have leveraged virtualization containers toward seamless deployment of preconfigured bioinformatics software and pipelines on any computational platform. We present an approach for abstracting the complex data operations of multistep, bioinformatics pipelines for NGS data analysis. As examples, we have deployed 2 pipelines for RNA sequencing and chromatin immunoprecipitation sequencing, preconfigured within Docker virtualization containers we call Bio-Docklets. Each Bio-Docklet exposes a single data input and output endpoint and from a user perspective, running the pipelines as simply as running a single bioinformatics tool. This is achieved using a \"meta-script\" that automatically starts the Bio-Docklets and controls the pipeline execution through the BioBlend software library and the Galaxy Application Programming Interface. The pipeline output is postprocessed by integration with the Visual Omics Explorer framework, providing interactive data visualizations that users can access through a web browser. Our goal is to enable easy access to NGS data analysis pipelines for nonbioinformatics experts on any computing environment, whether a laboratory workstation, university computer cluster, or a cloud service provider. Beyond end users, the Bio-Docklets also enables developers to programmatically deploy and run a large number of pipeline instances for concurrent analysis of multiple datasets.", 
                "date": "2017-08-01T00:00:00Z", 
                "citationCount": 2, 
                "authors": [
                    {
                        "name": "Kim B."
                    }, 
                    {
                        "name": "Ali T."
                    }, 
                    {
                        "name": "Lijeron C."
                    }, 
                    {
                        "name": "Afgan E."
                    }, 
                    {
                        "name": "Krampis K."
                    }
                ], 
                "journal": "GigaScience"
            }
        }
    ], 
    "credit": [
        {
            "name": "Konstantinos Krampis", 
            "email": "kk104@hunter.cuny.edu", 
            "url": null, 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "d.gabrielaitis", 
    "additionDate": "2018-07-15T09:00:37Z", 
    "lastUpdate": "2018-12-10T12:59:00Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 1, 
    "homepage_status": 0, 
    "elixir_badge": 0
}