{
    "accessibility": "Open access",
    "additionDate": "2019-06-20T08:46:28Z",
    "biotoolsCURIE": "biotools:PhenoDis",
    "biotoolsID": "PhenoDis",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "andreas.ruepp@helmholtz-muenchen.de",
            "name": "Dr. Andreas Ruepp",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Database for phenotypic characterization of rare cardiac diseases.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://mips.helmholtz-muenchen.de/pheno/help/showHelp"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                }
            ]
        }
    ],
    "homepage": "http://mips.helmholtz-muenchen.de/phenodis/",
    "lastUpdate": "2020-06-16T10:55:23Z",
    "maturity": "Mature",
    "name": "PhenoDis",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "Ruta",
    "publication": [
        {
            "doi": "10.1186/s13023-018-0765-y",
            "metadata": {
                "abstract": "© 2018 The Author(s).Background: Thoroughly annotated data resources are a key requirement in phenotype dependent analysis and diagnosis of diseases in the area of precision medicine. Recent work has shown that curation and systematic annotation of human phenome data can significantly improve the quality and selectivity for the interpretation of inherited diseases. We have therefore developed PhenoDis, a comprehensive, manually annotated database providing symptomatic, genetic and imprinting information about rare cardiac diseases. Results: PhenoDis includes 214 rare cardiac diseases from Orphanet and 94 more from OMIM. For phenotypic characterization of the diseases, we performed manual annotation of diseases with articles from the biomedical literature. Detailed description of disease symptoms required the use of 2247 different terms from the Human Phenotype Ontology (HPO). Diseases listed in PhenoDis frequently cover a broad spectrum of symptoms with 28% from the branch of 'cardiovascular abnormality' and others from areas such as neurological (11.5%) and metabolism (6%). We collected extensive information on the frequency of symptoms in respective diseases as well as on disease-associated genes and imprinting data. The analysis of the abundance of symptoms in patient studies revealed that most of the annotated symptoms (71%) are found in less than half of the patients of a particular disease. Comprehensive and systematic characterization of symptoms including their frequency is a pivotal prerequisite for computer based prediction of diseases and disease causing genetic variants. To this end, PhenoDis provides in-depth annotation for a complete group of rare diseases, including information on pathogenic and likely pathogenic genetic variants for 206 diseases as listed in ClinVar. We integrated all results in an online database (http://mips.helmholtz-muenchen.de/phenodis/) with multiple search options and provide the complete dataset for download. Conclusion: PhenoDis provides a comprehensive set of manually annotated rare cardiac diseases that enables computational approaches for disease prediction via decision support systems and phenotype-driven strategies for the identification of disease causing genes.",
                "authors": [
                    {
                        "name": "Adler A."
                    },
                    {
                        "name": "Kirchmeier P."
                    },
                    {
                        "name": "Reinhard J."
                    },
                    {
                        "name": "Brauner B."
                    },
                    {
                        "name": "Dunger I."
                    },
                    {
                        "name": "Fobo G."
                    },
                    {
                        "name": "Frishman G."
                    },
                    {
                        "name": "Montrone C."
                    },
                    {
                        "name": "Mewes H.-W."
                    },
                    {
                        "name": "Arnold M."
                    },
                    {
                        "name": "Ruepp A."
                    }
                ],
                "citationCount": 11,
                "date": "2018-01-25T00:00:00Z",
                "journal": "Orphanet Journal of Rare Diseases",
                "title": "PhenoDis: A comprehensive database for phenotypic characterization of rare cardiac diseases"
            },
            "pmcid": "PMC5785853",
            "pmid": "29370821",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application",
        "Database portal"
    ],
    "topic": [
        {
            "term": "Cardiology",
            "uri": "http://edamontology.org/topic_3335"
        },
        {
            "term": "Rare diseases",
            "uri": "http://edamontology.org/topic_3325"
        },
        {
            "term": "Personalised medicine",
            "uri": "http://edamontology.org/topic_3577"
        }
    ],
    "validated": 1
}