{
    "additionDate": "2022-10-04T08:58:48.628859Z",
    "biotoolsCURIE": "biotools:dpprom",
    "biotoolsID": "dpprom",
    "confidence_flag": "tool",
    "credit": [
        {
            "name": "Chen Wang"
        },
        {
            "name": "Yannan Bin"
        }
    ],
    "description": "DPProm: A two-layer model combined DPProm-1L and DPProm-2L, named DPProm, for predicting promoters and their types on the whole genomes of phages.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://bioinfo.ahu.edu.cn/DPProm/Help"
        }
    ],
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Feature extraction",
                    "uri": "http://edamontology.org/operation_3937"
                },
                {
                    "term": "Genome annotation",
                    "uri": "http://edamontology.org/operation_0362"
                },
                {
                    "term": "Promoter prediction",
                    "uri": "http://edamontology.org/operation_0440"
                }
            ]
        }
    ],
    "homepage": "http://bioinfo.ahu.edu.cn/DPProm",
    "lastUpdate": "2024-11-24T15:30:40.477761Z",
    "license": "Other",
    "name": "DPProm",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1109/jbhi.2022.3193224",
            "metadata": {
                "abstract": "With the number of phage genomes increasing, it is urgent to develop new bioinformatics methods for phage genome annotation. Promoter, a DNA region, is important for gene transcriptional regulation. In the era of post-genomics, the availability of data makes it possible to establish computational models for promoter identification with robustness. In this work, we introduce DPProm, a two-layer model composed of DPProm-1L and DPProm-2L, to predict promoters and their types for phages. On the first layer, as a dual-channel deep neural network ensemble method fusing multi-view features (sequence feature and handcrafted feature), the model DPProm-1L is proposed to identify whether a DNA sequence is a promoter or non-promoter. The sequence feature is extracted with convolutional neural network (CNN). And the handcrafted feature is the combination of free energy, GC content, cumulative skew, and Z curve features. On the second layer, DPProm-2L based on CNN is trained to predict the promoters' types (host or phage). For the realization of prediction on the whole genomes, the model DPProm, combines with a novel sequence data processing workflow, which contains sliding window and merging sequences modules. Experimental results show that DPProm outperforms the state-of-the-art methods, and decreases the false positive rate effectively on whole genome prediction. Furthermore, we provide a user-friendly web at http://bioinfo.ahu.edu.cn/DPProm. We expect that DPProm can serve as a useful tool for identification of promoters and their types.",
                "authors": [
                    {
                        "name": "Bin Y."
                    },
                    {
                        "name": "Cheng L."
                    },
                    {
                        "name": "Wang C."
                    },
                    {
                        "name": "Wu J."
                    },
                    {
                        "name": "Xia J."
                    },
                    {
                        "name": "Xiao M."
                    },
                    {
                        "name": "Zhang J."
                    }
                ],
                "citationCount": 3,
                "date": "2022-10-01T00:00:00Z",
                "journal": "IEEE Journal of Biomedical and Health Informatics",
                "title": "DPProm: A Two-Layer Predictor for Identifying Promoters and Their Types on Phage Genome Using Deep Learning"
            },
            "pmid": "35867364"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Gene regulation",
            "uri": "http://edamontology.org/topic_0204"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ],
    "validated": 1
}
