{
    "accessibility": "Open access",
    "additionDate": "2019-08-11T18:01:16Z",
    "biotoolsCURIE": "biotools:miRTissue",
    "biotoolsID": "miRTissue",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "tblab@icar.cnr.it",
            "name": "Translational Bioinformatics Laboratory at CNR-ICAR",
            "typeEntity": "Division",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Web application for the analysis of miRNA-target interactions in human tissues.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://tblab.pa.icar.cnr.it/mirtissue.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Pathway or network analysis",
                    "uri": "http://edamontology.org/operation_2497"
                },
                {
                    "term": "miRNA target prediction",
                    "uri": "http://edamontology.org/operation_0463"
                },
                {
                    "term": "miRNA expression analysis",
                    "uri": "http://edamontology.org/operation_3792"
                }
            ]
        }
    ],
    "homepage": "http://150.145.111.118:3838/mirTissue/",
    "lastUpdate": "2020-06-16T10:55:25Z",
    "license": "Unlicense",
    "maturity": "Mature",
    "name": "miRTissue",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "Ruta",
    "publication": [
        {
            "doi": "10.1186/s12859-018-2418-5",
            "metadata": {
                "abstract": "© 2018 The Author(s).Background: microRNAs act as regulators of gene expression interacting with their gene targets. Current bioinformatics services, such as databases of validated miRNA-target interactions and prediction tools, usually provide interactions without any information about what tissue that interaction is more likely to appear nor information about the type of interactions, causing mRNA degradation or translation inhibition respectively. Results: In this work, we introduce miRTissue, a web application that combines validated miRNA-target interactions with statistical correlation among expression profiles of miRNAs, genes and proteins in 15 different human tissues. Validated interactions are taken from the miRTarBase database, while expression profiles are downloaded from The Cancer Genome Atlas repository. As a result, the service provides a tissue-specific characterisation of each couple of miRNA and gene together with its statistical significance (p-value). The inclusion of protein data also allows providing the type of interaction. Moreover, miRTissue offers several views for analysing interactions, focusing for example on the comparison between different cancer types or different tissue conditions. All the results are freely downloadable in the most common formats. Conclusions: miRTissue fills a gap concerning current bioinformatics services related to miRNA-target interactions because it provides a tissue-specific context to each validated interaction and the type of interaction itself. miRTissue is easily browsable allowing the user to select miRNAs, genes, cancer types and tissue conditions. The results can be sorted according to p-values to immediately identify those interactions that are more likely to occur in a given tissue. miRTissue is available at http://tblab.pa.icar.cnr.it/mirtissue.html.",
                "authors": [
                    {
                        "name": "Fiannaca A."
                    },
                    {
                        "name": "La Rosa M."
                    },
                    {
                        "name": "La Paglia L."
                    },
                    {
                        "name": "Urso A."
                    }
                ],
                "citationCount": 4,
                "date": "2018-11-30T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "miRTissue: A web application for the analysis of miRNA-target interactions in human tissues"
            },
            "pmcid": "PMC6266954",
            "pmid": "30497361",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application",
        "Web service"
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Protein expression",
            "uri": "http://edamontology.org/topic_0108"
        }
    ]
}