{
    "additionDate": "2019-11-14T18:23:00Z",
    "biotoolsCURIE": "biotools:atlasBREX",
    "biotoolsID": "atlasBREX",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "johannes.lohmeier@charite.de",
            "name": "Johannes Lohmeier",
            "orcidid": "https://orcid.org/0000-0002-8927-2453",
            "typeEntity": "Person"
        },
        {
            "email": "hidokano@a2.keio.jp",
            "name": "Hideyuki Okano",
            "typeEntity": "Person"
        }
    ],
    "description": "Automated template-derived brain extraction in animal MRI | atlasBREX: Automated averaged template-derived brain extraction in animal MRI | Copy all gzipped (.nii.gz) NIFTI volumes and atlasBREX.sh into a common folder. There should be no directory or file containing 'orig', 'temp' or '_.nii.gz' in this folder",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://www.github.com/jlohmeier/atlasBREX",
    "language": [
        "Shell"
    ],
    "lastUpdate": "2020-12-02T16:05:19Z",
    "license": "BSD-3-Clause",
    "name": "atlasBREX",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1038/S41598-019-48489-3",
            "metadata": {
                "abstract": "© 2019, The Author(s).We proposed a generic template-derived approach for (semi-) automated brain extraction in animal MRI studies and evaluated our implementation with different animal models (macaque, marmoset, rodent) and MRI protocols (T1, T2). While conventional MR-neuroimaging studies perform brain extraction as an initial step priming subsequent image-registration from subject to template, our proposed approach propagates an anatomical template to (whole-head) individual subjects in reverse order, which is challenging due to the surrounding extracranial tissue, greater differences in contrast pattern and larger areas with field inhomogeneity. As a novel approach, the herein introduced brain extraction algorithm derives whole-brain segmentation using rigid and non-rigid deformation based on unbiased anatomical atlas building with a priori estimates from study-cohort and an initial approximate brain extraction. We evaluated our proposed method in comparison to several other technical approaches including “Marker based watershed scalper”, “Brain-Extraction-Tool”, “3dSkullStrip”, “Primatologist-Toolbox”, “Rapid Automatic Tissue Segmentation” and “Robust automatic rodent brain extraction using 3D pulse-coupled neural networks” with manual skull-stripping as reference standard. ABX demonstrated best performance with accurate (≥92%) and consistent results throughout datasets and across species, age and MRI protocols. ABX was made available to the public with documentation, templates and sample material (https://www.github.com/jlohmeier/atlasBREX).",
                "authors": [
                    {
                        "name": "Lohmeier J."
                    },
                    {
                        "name": "Kaneko T."
                    },
                    {
                        "name": "Hamm B."
                    },
                    {
                        "name": "Makowski M.R."
                    },
                    {
                        "name": "Okano H."
                    }
                ],
                "citationCount": 6,
                "date": "2019-12-01T00:00:00Z",
                "journal": "Scientific Reports",
                "title": "atlasBREX: Automated template-derived brain extraction in animal MRI"
            },
            "pmcid": "PMC6704255",
            "pmid": "31434923"
        }
    ],
    "topic": [
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        },
        {
            "term": "Zoology",
            "uri": "http://edamontology.org/topic_3500"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        }
    ],
    "validated": 1
}