{
    "accessibility": "Open access",
    "additionDate": "2017-02-14T09:36:29Z",
    "biotoolsCURIE": "biotools:pep-fold",
    "biotoolsID": "pep-fold",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "pierre.tuffery@univ-paris-diderot.fr",
            "name": "Pierre Tufféry",
            "orcidid": "https://orcid.org/0000-0003-1033-9895",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "PEP-FOLD uses a hidden Markov model-derived structural alphabet for de novo modeling of 3D conformations of peptides between 9-25 amino acids in aqueous solution. Updates to PEP-FOLD allow for modeling of linear and disulphide bonded cyclic peptides with 9-36 amino acids using benchmarked peptides.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://bioserv.rpbs.univ-paris-diderot.fr/services/PEP-FOLD3"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Protein sequence",
                        "uri": "http://edamontology.org/data_2976"
                    },
                    "format": [
                        {
                            "term": "FASTA",
                            "uri": "http://edamontology.org/format_1929"
                        }
                    ]
                }
            ],
            "operation": [
                {
                    "term": "Ab initio structure prediction",
                    "uri": "http://edamontology.org/operation_0476"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Protein structure",
                        "uri": "http://edamontology.org/data_1460"
                    },
                    "format": [
                        {
                            "term": "PDB",
                            "uri": "http://edamontology.org/format_1476"
                        }
                    ]
                }
            ]
        }
    ],
    "homepage": "https://mobyle.rpbs.univ-paris-diderot.fr/cgi-bin/portal.py#forms::PEP-FOLD3",
    "lastUpdate": "2024-11-24T20:59:57.942237Z",
    "license": "Freeware",
    "maturity": "Mature",
    "name": "PEP-FOLD",
    "owner": "reyjul",
    "publication": [
        {
            "doi": "10.1093/nar/gkp323",
            "metadata": {
                "abstract": "Rational peptide design and large-scale prediction of peptide structure from sequence remain a challenge for chemical biologists. We present PEP-FOLD, an online service, aimed at de novo modelling of 3D conformations for peptides between 9 and 25 amino acids in aqueous solution. Using a hidden Markov model-derived structural alphabet (SA) of 27 four-residue letters, PEP-FOLD first predicts the SA letter profiles from the amino acid sequence and then assembles the predicted fragments by a greedy procedure driven by a modified version of the OPEP coarse-grained force field. Starting from an amino acid sequence, PEP-FOLD performs series of 50 simulations and returns the most representative conformations identified in terms of energy and population. Using a benchmark of 25 peptides with 9-23 amino acids, and considering the reproducibility of the runs, we find that, on average, PEP-FOLD locates lowest energy conformations differing by 2.6 Å Cα root mean square deviation from the full NMR structures. PEP-FOLD can be accessed at http://bioserv.rpbs.univ-paris-diderot.fr/ PEP-FOLD.",
                "authors": [
                    {
                        "name": "Derreumaux P."
                    },
                    {
                        "name": "Maupetit J."
                    },
                    {
                        "name": "Tuffery P."
                    }
                ],
                "citationCount": 331,
                "date": "2009-08-04T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "PEP-FOLD: An online resource for de novo peptide structure prediction"
            },
            "pmcid": "PMC2703897",
            "pmid": "19433514",
            "type": [
                "Primary"
            ]
        },
        {
            "doi": "10.1093/nar/gks419",
            "metadata": {
                "abstract": "In the context of the renewed interest of peptides as therapeutics, it is important to have an on-line resource for 3D structure prediction of peptides with well-defined structures in aqueous solution. We present an updated version of PEP-FOLD allowing the treatment of both linear and disulphide bonded cyclic peptides with 9-36 amino acids. The server makes possible to define disulphide bonds and any residue-residue proximity under the guidance of the biologists. Using a benchmark of 34 cyclic peptides with one, two and three disulphide bonds, the best PEP-FOLD models deviate by an average RMS of 2.75Å from the full NMR structures. Using a benchmark of 37 linear peptides, PEP-FOLD locates lowest-energy conformations deviating by 3Å RMS from the NMR rigid cores. The evolution of PEP-FOLD comes as a new on-line service to supersede the previous server. The server is available at: http://bioserv.rpbs.univ-paris- diderot.fr/PEP-FOLD. © 2012 The Author(s).",
                "authors": [
                    {
                        "name": "Derreumaux P."
                    },
                    {
                        "name": "Guyon F."
                    },
                    {
                        "name": "Maupetit J."
                    },
                    {
                        "name": "Shen Y."
                    },
                    {
                        "name": "Thevenet P."
                    },
                    {
                        "name": "Tuffery P."
                    }
                ],
                "citationCount": 492,
                "date": "2012-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "PEP-FOLD: An updated de novo structure prediction server for both linear and disulfide bonded cyclic peptides"
            },
            "pmcid": "PMC3394260",
            "pmid": "22581768",
            "type": [
                "Primary"
            ]
        },
        {
            "doi": "10.1093/nar/gkw329",
            "metadata": {
                "abstract": "Structure determination of linear peptides of 5-50 amino acids in aqueous solution and interacting with proteins is a key aspect in structural biology. PEPFOLD3 is a novel computational framework, that allows both (i) de novo free or biased prediction for linear peptides between 5 and 50 amino acids, and (ii) the generation of native-like conformations of peptides interacting with a protein when the interaction site is known in advance. PEP-FOLD3 is fast, and usually returns solutions in a few minutes. Testing PEP-FOLD3 on 56 peptides in aqueous solution led to experimental-like conformations for 80% of the targets. Using a benchmark of 61 peptide-protein targets starting from the unbound form of the protein receptor, PEP-FOLD3 was able to generate peptide poses deviating on average by 3.3A from the experimental conformation and return a native-like pose in the first 10 clusters for 52% of the targets. PEPFOLD3 is available at http://bioserv.rpbs.univ-parisdiderot. fr/services/PEP-FOLD3.",
                "authors": [
                    {
                        "name": "Derreumaux P."
                    },
                    {
                        "name": "Lamiable A."
                    },
                    {
                        "name": "Rey J."
                    },
                    {
                        "name": "Thevenet P."
                    },
                    {
                        "name": "Tuffery P."
                    },
                    {
                        "name": "Vavrusa M."
                    }
                ],
                "citationCount": 709,
                "date": "2016-07-08T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "PEP-FOLD3: faster denovo structure prediction for linear peptides in solution and in complex"
            },
            "pmcid": "PMC4987898",
            "pmid": "27131374",
            "type": [
                "Primary"
            ]
        },
        {
            "doi": "10.1021/ct500592m",
            "metadata": {
                "abstract": "Peptides and mini proteins have many biological and biomedical implications, which motivates the development of accurate methods, suitable for large-scale experiments, to predict their experimental or native conformations solely from sequences. In this study, we report PEP-FOLD2, an improved coarse grained approach for peptide de novo structure prediction and compare it with PEP-FOLD1 and the state-of-the-art Rosetta program. Using a benchmark of 56 structurally diverse peptides with 25-52 amino acids and a total of 600 simulations for each system, PEP-FOLD2 generates higher quality models than PEP-FOLD1, and PEP-FOLD2 and Rosetta generate near-native or native models for 95% and 88% of the targets, respectively. In the situation where we do not have any experimental structures at hand, PEP-FOLD2 and Rosetta return a near-native or native conformation among the top five best scored models for 80% and 75% of the targets, respectively. While the PEP-FOLD2 prediction rate is better than the ROSETTA prediction rate by 5%, this improvement is non-negligible because PEP-FOLD2 explores a larger conformational space than ROSETTA and consists of a single coarse-grained phase. Our results indicate that if the coarse-grained PEP-FOLD2 method is approaching maturity, we are not at the end of the game of mini-protein structure prediction, but this opens new perspectives for large-scale in silico experiments.",
                "authors": [
                    {
                        "name": "Derreumaux P."
                    },
                    {
                        "name": "Maupetit J."
                    },
                    {
                        "name": "Shen Y."
                    },
                    {
                        "name": "Tuffery P."
                    }
                ],
                "citationCount": 479,
                "date": "2014-10-14T00:00:00Z",
                "journal": "Journal of Chemical Theory and Computation",
                "title": "Improved PEP-FOLD approach for peptide and miniprotein structure prediction"
            },
            "pmid": "26588162",
            "type": [
                "Benchmarking study"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Molecular modelling",
            "uri": "http://edamontology.org/topic_2275"
        }
    ],
    "validated": 1,
    "version": [
        "2.0",
        "3.5"
    ]
}
