{
    "accessibility": "Open access",
    "additionDate": "2022-10-31T19:57:31.740338Z",
    "biotoolsCURIE": "biotools:silvi",
    "biotoolsID": "silvi",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "joana.s.pissarra@gmail.com",
            "name": "Joana Pissarra",
            "orcidid": "https://orcid.org/0000-0002-0506-8042",
            "typeEntity": "Person"
        },
        {
            "name": "Jean-Loup Lemesre"
        },
        {
            "name": "Philippe Holzmuller"
        },
        {
            "name": "Denis Sereno",
            "orcidid": "https://orcid.org/0000-0002-0034-9291"
        }
    ],
    "description": "Open-source pipeline for T-cell epitope selection.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Epitope mapping",
                    "uri": "http://edamontology.org/operation_0416"
                },
                {
                    "term": "Peptide immunogenicity prediction",
                    "uri": "http://edamontology.org/operation_0252"
                },
                {
                    "term": "Side chain modelling",
                    "uri": "http://edamontology.org/operation_0480"
                }
            ]
        }
    ],
    "homepage": "http://github.com/JoanaPissarra/SILVI2020",
    "language": [
        "R"
    ],
    "lastUpdate": "2022-10-31T19:57:50.567689Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://doi.org/10.5281/zenodo.6865909"
        }
    ],
    "name": "SILVI",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PONE.0273494",
            "metadata": {
                "abstract": "Copyright: © 2022 Pissarra et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.High-throughput screening of available genomic data and identification of potential antigenic candidates have promoted the development of epitope-based vaccines and therapeutics. Several immunoinformatic tools are available to predict potential epitopes and other immunogenicity-related features, yet it is still challenging and time-consuming to compare and integrate results from different algorithms. We developed the R script SILVI (short for: from in silico to in vivo), to assist in the selection of the potentially most immunogenic T-cell epitopes from Human Leukocyte Antigen (HLA)-binding prediction data. SILVI merges and compares data from available HLA-binding prediction servers, and integrates additional relevant information of predicted epitopes, namely BLASTp alignments with host proteins and physical-chemical properties. The two default criteria applied by SILVI and additional filtering allow the fast selection of the most conserved, promiscuous, strong binding T-cell epitopes. Users may adapt the script at their discretion as it is written in open-source R language. To demonstrate the workflow and present selection options, SILVI was used to integrate HLA-binding prediction results of three example proteins, from viral, bacterial and parasitic microorganisms, containing validated epitopes included in the Immune Epitope Database (IEDB), plus the Human Papillomavirus (HPV) proteome. Applying different filters on predicted IC50, hydrophobicity and mismatches with host proteins allows to significantly reduce the epitope lists with favourable sensitivity and specificity to select immunogenic epitopes. We contemplate SILVI will assist T-cell epitope selections and can be continuously refined in a community-driven manner, helping the improvement and design of peptide-based vaccines or immunotherapies. SILVI development version is available at: github.com/JoanaPissarra/SILVI2020 and https://doi.org/10.5281/zenodo.6865909.",
                "authors": [
                    {
                        "name": "Bonhomme V."
                    },
                    {
                        "name": "Dorkeld F."
                    },
                    {
                        "name": "Holzmuller P."
                    },
                    {
                        "name": "Lemesre J.-L."
                    },
                    {
                        "name": "Loire E."
                    },
                    {
                        "name": "Pissarra J."
                    },
                    {
                        "name": "Sereno D."
                    }
                ],
                "date": "2022-09-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "SILVI, an open-source pipeline for T-cell epitope selection"
            },
            "pmcid": "PMC9451077",
            "pmid": "36070252"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Immunogenetics",
            "uri": "http://edamontology.org/topic_3930"
        },
        {
            "term": "Immunoinformatics",
            "uri": "http://edamontology.org/topic_3948"
        },
        {
            "term": "Immunoproteins and antigens",
            "uri": "http://edamontology.org/topic_2830"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Vaccinology",
            "uri": "http://edamontology.org/topic_3966"
        }
    ]
}
