
{
    "credit": [
        {
            "email": "janne.h.korhonen@aalto.fi",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "https://github.com/jhkorhonen/MOODS/wiki/Getting-started"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence motif recognition",
                    "uri": "http://edamontology.org/operation_0239"
                }
            ]
        }
    ],
    "labels": {
        "collectionID": [
            "Animal and Crop Genomics"
        ],
        "language": [
            "C++",
            "Python"
        ],
        "license": "GPL-3.0",
        "operatingSystem": [
            "Linux"
        ],
        "toolType": [
            "Command-line tool",
            "Script"
        ],
        "topic": [
            {
                "term": "Mapping",
                "uri": "http://edamontology.org/topic_0102"
            },
            {
                "term": "Sequence composition, complexity and repeats",
                "uri": "http://edamontology.org/topic_0157"
            }
        ]
    },
    "link": [
        {
            "type": "REPOSITORY",
            "url": "https://github.com/jhkorhonen/MOODS"
        },
        {
            "type": "ISSUE_TRACKER",
            "url": "https://github.com/jhkorhonen/MOODS/issues"
        }
    ],
    "publication": [
        {
            "abstract": "Position weight matrices are an important method for modeling signals or motifs in biological sequences, both in DNA and protein contexts. In this paper, we present fast algorithms for the problem of finding significant matches of such matrices. Our algorithms are of the online type, and they generalize classical multipattern matching, filtering, and superalphabet techniques of combinatorial string matching to the problem of weight matrix matching. Several variants of the algorithms are developed, including multiple matrix extensions that perform the search for several matrices in one scan through the sequence database. Experimental performance evaluation is provided to compare the new techniques against each other as well as against some other online and index-based algorithms proposed in the literature. Compared to the brute-force O(mn) approach, our solutions can be faster by a factor that is proportional to the matrix length m. Our multiple-matrix filtration algorithm had the best performance in the experiments. On a current PC, this algorithm finds significant matches (p = 0.0001) of the 123 JASPAR matrices in the human genome in about 18 minutes. © 2011 IEEE.",
            "authors": [
                "Pizzi C.",
                "Rastas P.",
                "Ukkonen E."
            ],
            "cit_count": 17,
            "doi": "10.1109/TCBB.2009.35",
            "journal": "IEEE/ACM Transactions on Computational Biology and Bioinformatics",
            "title": "Finding significant matches of position weight matrices in linear time",
            "type": "Primary",
            "year": "2011-01-01"
        },
        {
            "abstract": "© 2017 The Author.Motivation: While the position weight matrix (PWM) is the most popular model for sequence motifs, there is growing evidence of the usefulness of more advanced models such as first-order Markov representations, and such models are also becoming available in well-known motif databases. There has been lots of research of how to learn these models from training data but the problem of predicting putative sites of the learned motifs by matching the model against new sequences has been given less attention. Moreover, motif site analysis is often concerned about how different variants in the sequence affect the sites. So far, though, the corresponding efficient software tools for motif matching have been lacking. Results: We develop fast motif matching algorithms for the aforementioned tasks. First, we formalize a framework based on high-order position weight matrices for generic representation of motif models with dinucleotide or general q-mer dependencies, and adapt fast PWM matching algorithms to the high-order PWM framework. Second, we show how to incorporate different types of sequence variants, such as SNPs and indels, and their combined effects into efficient PWM matching workflows. Benchmark results show that our algorithms perform well in practice on genome-sized sequence sets and are for multiple motif search much faster than the basic sliding window algorithm.",
            "authors": [
                "Korhonen J.H.",
                "Palin K.",
                "Taipale J.",
                "Ukkonen E."
            ],
            "cit_count": 0,
            "doi": "10.1093/bioinformatics/btw683",
            "journal": "Bioinformatics",
            "title": "Fast motif matching revisited: High-order PWMs, SNPs and indels",
            "type": "Primary",
            "year": "2017-02-15"
        },
        {
            "abstract": "Summary: MOODS (MOtif Occurrence Detection Suite) is a software package for matching position weight matrices against DNA sequences. MOODS implements state-of-the-art online matching algorithms, achieving considerably faster scanning speed than with a simple brute-force search. MOODS is written in C++, with bindings for the popular BioPerl and Biopython toolkits. It can easily be adapted for different purposes and integrated into existing workflows. It can also be used as a C++ library. © The Author(s) 2009. Published by Oxford University Press.",
            "authors": [
                "Korhonen J.",
                "Martinmaki P.",
                "Pizzi C.",
                "Rastas P.",
                "Ukkonen E."
            ],
            "cit_count": 61,
            "doi": "10.1093/bioinformatics/btp554",
            "journal": "Bioinformatics",
            "title": "MOODS: Fast search for position weight matrix matches in DNA sequences",
            "type": "Primary",
            "year": "2009-09-22"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:moods",
        "biotoolsID": "moods",
        "description": "A suite of algorithms for matching position weight matrices (PWM) against DNA sequences. It features advanced matrix matching algorithms implemented in C++ that can be used to scan hundreds of matrices against chromosome-sized sequences in few seconds. MOODS can also process high-order PWMs with dependencies between adjacent positions and sequence variants such as SNPs, insertions and deletions.",
        "homepage": "https://www.cs.helsinki.fi/group/pssmfind/",
        "name": "MOODS"
    }
}