{
    "additionDate": "2020-01-09T18:15:27Z",
    "biotoolsCURIE": "biotools:RICE-GUARD",
    "biotoolsID": "RICE-GUARD",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "david.nettleton@iris.cat",
            "name": "David F. Nettleton",
            "orcidid": "https://orcid.org/0000-0002-5852-7716",
            "typeEntity": "Person"
        }
    ],
    "description": "The RICE-GUARD project will develop a wireless sensor network comprised of low-cost measurement nodes that will be capable of transmitting readings of the relevant in-field site-specific environmental variables in real-time to a central server.\n\nRice blast is the most serious disease of cultivated rice. It is caused by the fungus Magnaporthe grisea (Pyricularia oryzae Cav.), which in favourable conditions can produce yield losses of up to 100 %. Although rice blast is present wherever rice is cultivated, its intensity (incidence and severity of disease) is highly variable and depends on cropping system and climate.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "http://multisite.iris.cat/riceguard/",
    "lastUpdate": "2021-01-15T19:36:32Z",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "http://multisite.iris.cat/riceguard/"
        }
    ],
    "name": "RICE-GUARD",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12859-019-3065-1",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: In this study, we compared four models for predicting rice blast disease, two operational process-based models (Yoshino and Water Accounting Rice Model (WARM)) and two approaches based on machine learning algorithms (M5Rules and Recurrent Neural Networks (RNN)), the former inducing a rule-based model and the latter building a neural network. In situ telemetry is important to obtain quality in-field data for predictive models and this was a key aspect of the RICE-GUARD project on which this study is based. According to the authors, this is the first time process-based and machine learning modelling approaches for supporting plant disease management are compared. Results: Results clearly showed that the models succeeded in providing a warning of rice blast onset and presence, thus representing suitable solutions for preventive remedial actions targeting the mitigation of yield losses and the reduction of fungicide use. All methods gave significant \"signals\" during the \"early warning\" period, with a similar level of performance. M5Rules and WARM gave the maximum average normalized scores of 0.80 and 0.77, respectively, whereas Yoshino gave the best score for one site (Kalochori 2015). The best average values of r and r2 and %MAE (Mean Absolute Error) for the machine learning models were 0.70, 0.50 and 0.75, respectively and for the process-based models the corresponding values were 0.59, 0.40 and 0.82. Thus it has been found that the ML models are competitive with the process-based models. This result has relevant implications for the operational use of the models, since most of the available studies are limited to the analysis of the relationship between the model outputs and the incidence of rice blast. Results also showed that machine learning methods approximated the performances of two process-based models used for years in operational contexts. Conclusions: Process-based and data-driven models can be used to provide early warnings to anticipate rice blast and detect its presence, thus supporting fungicide applications. Data-driven models derived from machine learning methods are a viable alternative to process-based approaches and-in cases when training datasets are available-offer a potentially greater adaptability to new contexts.",
                "authors": [
                    {
                        "name": "Nettleton D.F."
                    },
                    {
                        "name": "Katsantonis D."
                    },
                    {
                        "name": "Kalaitzidis A."
                    },
                    {
                        "name": "Sarafijanovic-Djukic N."
                    },
                    {
                        "name": "Puigdollers P."
                    },
                    {
                        "name": "Confalonieri R."
                    }
                ],
                "citationCount": 7,
                "date": "2019-10-22T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Predicting rice blast disease: Machine learning versus process-based models"
            },
            "pmcid": "PMC6806664",
            "pmid": "31640541"
        }
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        }
    ],
    "validated": 1
}