{"credit":[{"email":"xzhousph@umich.edu","name":"Xiang Zhou","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"https://github.com/biostatpzeng/iMAP"}],"function":[{"operation":[{"term":"Genetic mapping","uri":"http://edamontology.org/operation_0282"}]}],"labels":{"language":["R"],"license":"GPL-3.0","operatingSystem":["Linux","Windows","Mac"],"toolType":["Library"],"topic":[{"term":"Mapping","uri":"http://edamontology.org/topic_0102"},{"term":"GWAS study","uri":"http://edamontology.org/topic_3517"},{"term":"Statistics and probability","uri":"http://edamontology.org/topic_2269"}]},"publication":[{"abstract":"© The Author(s) 2018. Motivation: Genome-wide association studies (GWASs) have identified many genetic loci associated with complex traits. A substantial fraction of these identified loci is associated with multiple traits-a phenomena known as pleiotropy. Identification of pleiotropic associations can help characterize the genetic relationship among complex traits and can facilitate our understanding of disease etiology. Effective pleiotropic association mapping requires the development of statistical methods that can jointly model multiple traits with genome-wide single nucleic polymorphisms (SNPs) together. Results: We develop a joint modeling method, which we refer to as the integrative MApping of Pleiotropic association (iMAP). iMAP models summary statistics from GWASs, uses a multivariate Gaussian distribution to account for phenotypic correlation, simultaneously infers genome-wide SNP association pattern using mixture modeling and has the potential to reveal causal relationship between traits. Importantly, iMAP integrates a large number of SNP functional annotations to substantially improve association mapping power, and, with a sparsity-inducing penalty, is capable of selecting informative annotations from a large, potentially non-informative set. To enable scalable inference of iMAP to association studies with hundreds of thousands of individuals and millions of SNPs, we develop an efficient expectation maximization algorithm based on an approximate penalized regression algorithm. With simulations and comparisons to existing methods, we illustrate the benefits of iMAP in terms of both high association mapping power and accurate estimation of genome-wide SNP association patterns. Finally, we apply iMAP to perform a joint analysis of 48 traits from 31 GWAS consortia together with 40 tissue-specific SNP annotations generated from the Roadmap Project.","authors":["Zeng P.","Hao X.","Zhou X."],"cit_count":0,"doi":"10.1093/bioinformatics/bty204","journal":"Bioinformatics","title":"Pleiotropic mapping and annotation selection in genome-wide association studies with penalized Gaussian mixture models","year":"2018-01-01"}],"summary":{"biotoolsCURIE":"biotools:imap","biotoolsID":"imap","description":"Pleiotropic mapping and annotation selection in genome-wide association studies with penalized Gaussian mixture models.","homepage":"https://github.com/biostatpzeng/iMAP","name":"iMAP"}}