{
    "accessibility": "Open access",
    "additionDate": "2023-12-30T20:10:19.967157Z",
    "biotoolsCURIE": "biotools:lrt",
    "biotoolsID": "lrt",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "chung.911@osu.edu",
            "name": "Dongjun Chung",
            "orcidid": "https://orcid.org/0000-0002-8072-5671",
            "typeEntity": "Person"
        },
        {
            "name": "Gang Xin",
            "typeEntity": "Person"
        },
        {
            "name": "Hyeongseon Jeon",
            "typeEntity": "Person"
        },
        {
            "name": "Juan Xie",
            "typeEntity": "Person"
        },
        {
            "name": "Qin Ma",
            "typeEntity": "Person"
        }
    ],
    "description": "Integrative analysis of scRNA-seq and scTCR-seq data to investigate clonal differentiation heterogeneity.\nscTCR-seq data compliments the scRNA-seq data in the sense that it provides the clonotype information for each cell, and it is generally assumed that cells sharing the same clonotype share the same progenitor. By integrating scTCR-seq data with scRNA-seq data, we could have a detailed insight of transcriptional changes that occur as clonal related cells differentiate. The LRT package utilizes the complementary nature of these two data type and investigate clonal differentiation heterogeneity by integrative analysis of scTCR-seq data and scRNA-seq data.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Gene expression profiling",
                    "uri": "http://edamontology.org/operation_0314"
                }
            ]
        }
    ],
    "homepage": "https://github.com/JuanXie19/LRT",
    "language": [
        "R"
    ],
    "lastUpdate": "2023-12-30T20:10:19.969921Z",
    "license": "CC-BY-4.0",
    "name": "LRT",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PCBI.1011300",
            "metadata": {
                "abstract": "Single-cell RNA sequencing (scRNA-seq) data has been widely used for cell trajectory inference, with the assumption that cells with similar expression profiles share the same differentiation state. However, the inferred trajectory may not reveal clonal differentiation heterogeneity among T cell clones. Single-cell T cell receptor sequencing (scTCR-seq) data provides invaluable insights into the clonal relationship among cells, yet it lacks functional characteristics. Therefore, scRNA-seq and scTCR-seq data complement each other in improving trajectory inference, where a reliable computational tool is still missing. We developed LRT, a computational framework for the integrative analysis of scTCR-seq and scRNA-seq data to explore clonal differentiation trajectory heterogeneity. Specifically, LRT uses the transcriptomics information from scRNA-seq data to construct overall cell trajectories and then utilizes both the TCR sequence information and phenotype information to identify clonotype clusters with distinct differentiation biasedness. LRT provides a comprehensive analysis workflow, including preprocessing, cell trajectory inference, clonotype clustering, trajectory biasedness evaluation, and clonotype cluster characterization. We illustrated its utility using scRNA-seq and scTCR-seq data of CD8+ T cells and CD4+ T cells with acute lymphocytic choriomeningitis virus infection. These analyses identified several clonotype clusters with distinct skewed distribution along the differentiation path, which cannot be revealed solely based on scRNA-seq data. Clones from different clonotype clusters exhibited diverse expansion capability, V-J gene usage pattern and CDR3 motifs. The LRT framework was implemented as an R package ‘LRT’, and it is now publicly accessible at https://github.com/JuanXie19/LRT. In addition, it provides two Shiny apps ‘shinyClone’ and ‘shinyClust’ that allow users to interactively explore distributions of clonotypes, conduct repertoire analysis, implement clustering of clonotypes, trajectory biasedness evaluation, and clonotype cluster characterization.",
                "authors": [
                    {
                        "name": "Chung D."
                    },
                    {
                        "name": "Jeon H."
                    },
                    {
                        "name": "Ma Q."
                    },
                    {
                        "name": "Xie J."
                    },
                    {
                        "name": "Xin G."
                    }
                ],
                "date": "2023-07-01T00:00:00Z",
                "journal": "PLoS Computational Biology",
                "title": "LRT: Integrative analysis of scRNA-seq and scTCR-seq data to investigate clonal differentiation heterogeneity"
            },
            "pmcid": "PMC10358952",
            "pmid": "37428794"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Immunoproteins and antigens",
            "uri": "http://edamontology.org/topic_2830"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ]
}
