{
    "additionDate": "2017-02-10T14:14:27Z",
    "biotoolsCURIE": "biotools:pi2pe",
    "biotoolsID": "pi2pe",
    "credit": [
        {
            "email": "pi2pe.fsu@gmail.com",
            "name": "Pi2PE Support",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "PI2PE (Protein Interface/Interior Prediction Engine) consists of three predictors (WESA, cons-PPISP, and DISPLAR) for predicting solvent accessibility and interface residues from the structure of a protein-binding or DNA-binding protein.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://pipe.scs.fsu.edu/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Accessible surface calculation",
                    "uri": "http://edamontology.org/operation_0384"
                },
                {
                    "term": "Molecular surface calculation",
                    "uri": "http://edamontology.org/operation_0387"
                },
                {
                    "term": "Protein secondary structure prediction",
                    "uri": "http://edamontology.org/operation_0267"
                },
                {
                    "term": "Protein structure prediction",
                    "uri": "http://edamontology.org/operation_0474"
                }
            ]
        }
    ],
    "homepage": "http://pipe.scs.fsu.edu/",
    "lastUpdate": "2018-12-10T12:58:56Z",
    "name": "PI2PE",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "The side chains of the 20 types of amino acids, owing to a large extent to their different physical properties, have characteristic distributions in interior/surface regions of individual proteins and in interface/non-interface portions of protein surfaces that bind proteins or nucleic acids. These distributions have important structural and functional implications. We have developed accurate methods for predicting the solvent accessibility of amino acids from a protein sequence and for predicting interface residues from the structure of a proteinbinding or DNA-binding protein. The methods are called WESA, cons-PPISP and DISPLAR, respectively. The web servers of these methods are now available at http://pipe.scs.fsu.edu. To illustrate the utility of these web servers, cons-PPISP and DISPLAR predictions are used to construct a structural model for a multicomponent protein-DNA complex. © 2007 The Author(s).",
                "authors": [
                    {
                        "name": "Tjong H."
                    },
                    {
                        "name": "Qin S."
                    },
                    {
                        "name": "Zhou H.-X."
                    }
                ],
                "citationCount": 28,
                "date": "2007-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "PI 2PE: Protein interface/interior prediction engine"
            },
            "pmid": "17526530"
        },
        {
            "metadata": {
                "abstract": "A homology-based structure prediction method ideally gives both a correct fold assignment and an accurate query-template alignment. In this article we show that the combination of two existing methods, PSI-BLAST and threading, leads to significant enhancement in the success rate of fold recognition. The combined approach, termed COBLATH, also yields much higher alignment accuracy than found in previous studies. It consists of two-way searches both by PSI-BLAST and by threading. In the PSI-BLAST portion, a query is used to search for hits in a library of potential templates and, conversely, each potential template is used to search for hits in a library of queries. In the threading portion, the scoring function is the sum of a sequence profile and a 6×6 substitution matrix between predicted query and known template secondary structure and solvent exposure. \"Two-way\" in threading means that the query's sequence profile is used to match the sequences of all potential templates and the sequence profiles of all potential templates are used to match the query's sequence. When tested on a set of 533 nonhomologous proteins, COBLATH was able to assign folds for 390 (73%). Among these 390 queries, 265 (68%) had root-mean-square deviations (RMSDs) of less than 8 Å between predicted and actual structures. Such high success rate and accuracy make COBLATH an ideal tool for structural genomics. © 2000 Wiley-Liss, Inc.",
                "authors": [
                    {
                        "name": "Shan Y."
                    },
                    {
                        "name": "Wang G."
                    },
                    {
                        "name": "Zhou H.-X."
                    }
                ],
                "citationCount": 33,
                "date": "2001-01-11T00:00:00Z",
                "journal": "Proteins: Structure, Function and Genetics",
                "title": "Fold recognition and accurate query-template alignment by a combination of PSI-BLAST and threading"
            },
            "pmid": "11093258"
        },
        {
            "metadata": {
                "abstract": "Protein-protein interaction sites are predicted from a neural network with sequence profiles of neighboring residues and solvent exposure as input. The network was trained on 615 pairs of nonhomologous complex-forming proteins. Tested on a different set of 129 pairs of nonhomologous complex-forming proteins, 70% of the 11,004 predicted interface residues are actually located in the interfaces. These 7732 correctly predicted residues account for 65% of the 11,805 residues making up the 129 interfaces. The main strength of the network predictor lies in the fact that neighbor lists and solvent exposure are relatively insensitive to structural changes accompanying complex formation. As such, it performs equally well with bound or unbound structures of the proteins. For a set of 35 test proteins, when the input was calculated from the bound and unbound structures, the correct fractions of the predicted interface residues were 69 and 70%, respectively. © 2001 Wiley-Liss, Inc.",
                "authors": [
                    {
                        "name": "Zhou H.-X."
                    },
                    {
                        "name": "Shan Y."
                    }
                ],
                "citationCount": 255,
                "date": "2001-08-15T00:00:00Z",
                "journal": "Proteins: Structure, Function and Genetics",
                "title": "Prediction of protein interaction sites from sequence profile and residue neighbor list"
            },
            "pmid": "11455607"
        },
        {
            "metadata": {
                "abstract": "Structural and physical properties of DNA provide important constraints on the binding sites formed on surfaces of DNA-targeting proteins. Characteristics of such binding sites may form the basis for predicting DNA-binding sites from the structures of proteins alone. Such an approach has been successfully developed for predicting protein-protein interface. Here this approach is adapted for predicting DNA-binding sites. We used a representative set of 264 protein-DNA complexes from the Protein Data Bank to analyze characteristics and to train and test a neural network predictor of DNA-binding sites. The input to the predictor consisted of PSI-blast sequence profiles and solvent accessibilities of each surface residue and 14 of its closest neighboring residues. Predicted DNA-contacting residues cover 60% of actual DNA-contacting residues and have an accuracy of 76%. This method significantly outperforms previous attempts of DNA-binding site predictions. Its application to the prion protein yielded a DNA-binding site that is consistent with recent NMR chemical shift perturbation data, suggesting that it can complement experimental techniques in characterizing protein-DNA interfaces. © 2007 Oxford University Press.",
                "authors": [
                    {
                        "name": "Tjong H."
                    },
                    {
                        "name": "Zhou H.-X."
                    }
                ],
                "citationCount": 117,
                "date": "2007-03-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "DISPLAR: An accurate method for predicting DNA-binding sites on protein surfaces"
            },
            "pmid": "17284455"
        },
        {
            "metadata": {
                "abstract": "Residues that form the hydrophobic core of a protein are critical for its stability. A number of approaches have been developed to classify residues as buried or exposed. In order to optimize the classification, we have refined a suite of five methods over a large dataset and proposed a metamethod based on an ensemble average of the individual methods, leading to a two-state classification accuracy of 80%. Many studies have suggested that hydrophobic core residues are likely sites of deleterious mutations, so we wanted to see to what extent these sites can be predicted from the putative buried residues. Residues that were most confidently classified as buried were proposed as sites of deleterious mutations. This proposition was tested on six proteins for which sites of deleterious mutations have previously been identified by stability measurement or functional assay. Of the total of 130 residues predicted as sites of deleterious mutations, 104 (or 80%) were correct. © The Author 2005. Published by Oxford University Press. All rights reserved.",
                "authors": [
                    {
                        "name": "Chen H."
                    },
                    {
                        "name": "Zhou H.-X."
                    }
                ],
                "citationCount": 113,
                "date": "2005-09-02T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "Prediction of solvent accessibility and sites of deleterious mutations from protein sequence"
            },
            "pmid": "15937195"
        },
        {
            "metadata": {
                "abstract": "The number of structures of protein-protein complexes deposited to the Protein Data Bank is growing rapidly. These structures embed important information for predicting structures of new protein complexes. This motivated us to develop the PPISP method for predicting interface residues in protein-protein complexes. In PPISP, sequence profiles and solvent accessibility of spatially neighboring surface residues were used as input to a neural network. The network was trained on native interface residues collected from the Protein Data Bank. The prediction accuracy at the time was 70% with 47% coverage of native interface residues. Now we have extensively improved PPISP. The training set now consisted of 1156 nonhomologous protein chains. Test on a set of 100 nonhomologous protein chains showed that the prediction accuracy is now increased to 80% with 51% coverage. To solve the problem of over-prediction and under-prediction associated with individual neural network models, we developed a consensus method that combines predictions from multiple models with different levels of accuracy and coverage. Applied on a benchmark set of 68 proteins for protein-protein docking, the consensus approach outperformed the best individual models by 3-8 percentage points in accuracy. To demonstrate the predictive power of cons-PPISP, eight complex-forming proteins with interfaces characterized by NMR were tested. These proteins are nonhomologous to the training set and have a total of 144 interface residues identified by chemical shift perturbation. cons-PPISP predicted 174 interface residues with 69% accuracy and 47% coverage and promises to complement experimental techniques in characterizing protein-protein interfaces. © 2005 Wiley-Liss, Inc.",
                "authors": [
                    {
                        "name": "Chen H."
                    },
                    {
                        "name": "Zhou H.-X."
                    }
                ],
                "citationCount": 219,
                "date": "2005-10-01T00:00:00Z",
                "journal": "Proteins: Structure, Function and Genetics",
                "title": "Prediction of interface residues in protein-protein complexes by a consensus neural network method: Test against NMR data"
            },
            "pmid": "16080151"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Structure prediction",
            "uri": "http://edamontology.org/topic_0082"
        },
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        },
        {
            "term": "Protein structure analysis",
            "uri": "http://edamontology.org/topic_2814"
        },
        {
            "term": "Protein structural motifs and surfaces",
            "uri": "http://edamontology.org/topic_0166"
        },
        {
            "term": "Protein folding, stability and design",
            "uri": "http://edamontology.org/topic_0130"
        }
    ],
    "validated": 1
}