{
    "accessibility": "Open access",
    "additionDate": "2022-03-29T21:08:11.776176Z",
    "biotoolsCURIE": "biotools:realvs",
    "biotoolsID": "realvs",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "huhf@njupt.edu.cn",
            "name": "Haifeng Hu",
            "orcidid": "https://orcid.org/0000-0002-6585-3106"
        },
        {
            "email": "jansen@njupt.edu.cn",
            "name": "Jiansheng Wu",
            "orcidid": "https://orcid.org/0000-0002-7941-9722"
        },
        {
            "name": "Huajian Xu"
        },
        {
            "name": "Yueming Yin"
        },
        {
            "name": "Zhen Yang"
        }
    ],
    "description": "Toward Enhancing the Precision of Top Hits in Ligand-Based Virtual Screening of Drug Leads from Large Compound Databases.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "SMILES string",
                        "uri": "http://edamontology.org/data_2301"
                    }
                }
            ],
            "operation": [
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                },
                {
                    "term": "Virtual screening",
                    "uri": "http://edamontology.org/operation_3938"
                }
            ]
        }
    ],
    "homepage": "http://noveldelta.com/RealVS",
    "lastUpdate": "2022-03-29T21:08:11.779066Z",
    "name": "RealVS",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1021/ACS.JCIM.1C01021",
            "metadata": {
                "abstract": "© 2021 American Chemical Society.Accurate modeling of compound bioactivities is essential for the virtual screening of drug leads. In real-world scenarios, pharmacists tend to choose from the top-k hit compounds ranked by predicted bioactivities from a large database with interest to continue wet experiments for drug discovery. Significant improvement of the precision of the top hits in ligand-based virtual screening of drug leads is more valuable than conventional schemes for accurately predicting the bioactivities of all compounds from a large database. Here, we proposed a new method, RealVS, to significantly improve the top hits' precision and learn interpretable key substructures associated with compound bioactivities. The features of RealVS involve the following points. (1) Abundant transferable information from the source domain was introduced for alleviating the insufficiency of inactive ligands associated with drug targets. (2) The adversarial domain alignment was adopted to fit the distribution of generated features of compounds from the training data set and that from the screening database for greater model generalization ability. (3) A novel objective function was proposed to simultaneously optimize the classification loss, regression loss, and adversarial loss, where most inactive ligands tend to be screened out before activity regression prediction. (4) Graph attention networks were adopted for learning key substructures associated with ligand bioactivities for better model interpretability. The results on a large number of benchmark data sets show that our method has significantly improved the precision of top hits under various k values in ligand-based virtual screening of drug leads from large compound databases, which is of great value in real-world scenarios. The web server of RealVS is freely available at noveldelta.com/RealVS for academic purposes, where virtual screening of hits from large compound databases is accessible.",
                "authors": [
                    {
                        "name": "Hu H."
                    },
                    {
                        "name": "Wu J."
                    },
                    {
                        "name": "Xu H."
                    },
                    {
                        "name": "Yang Z."
                    },
                    {
                        "name": "Yin Y."
                    }
                ],
                "citationCount": 1,
                "date": "2021-10-25T00:00:00Z",
                "journal": "Journal of Chemical Information and Modeling",
                "title": "RealVS: Toward Enhancing the Precision of Top Hits in Ligand-Based Virtual Screening of Drug Leads from Large Compound Databases"
            },
            "pmid": "34619030"
        }
    ],
    "toolType": [
        "Database portal",
        "Web application"
    ],
    "topic": [
        {
            "term": "Drug discovery",
            "uri": "http://edamontology.org/topic_3336"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Molecular modelling",
            "uri": "http://edamontology.org/topic_2275"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ],
    "validated": 1
}
