{
    "additionDate": "2024-01-26T10:05:01.423735Z",
    "biotoolsCURIE": "biotools:anti_biofilm",
    "biotoolsID": "anti_biofilm",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "manojk@imtech.res.in",
            "name": "Manoj Kumar"
        }
    ],
    "description": "Machine learning assisted prediction of IC50 activity of chemicals against biofilms of microbes causing antimicrobial resistance and implications in drug repurposing.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Antimicrobial resistance prediction",
                    "uri": "http://edamontology.org/operation_3482"
                }
            ]
        }
    ],
    "homepage": "https://bioinfo.imtech.res.in/manojk/antibiofilm/",
    "lastUpdate": "2024-01-26T10:05:01.427277Z",
    "name": "anti-biofilm",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1016/J.JMB.2023.168115",
            "metadata": {
                "abstract": "Biofilms are one of the leading causes of antibiotic resistance. It acts as a physical barrier against the human immune system and drugs. The use of anti-biofilm agents helps in tackling the menace of antibiotic resistance. The identification of efficient anti-biofilm chemicals remains a challenge. Therefore, in this study, we developed ‘anti-Biofilm’, a machine learning technique (MLT) based predictive algorithm for identifying and analyzing the biofilm inhibition of small molecules. The algorithm is developed using experimentally validated anti-biofilm compounds with half maximal inhibitory concentration (IC50) values extracted from aBiofilm resource. Out of the five MLTs, the Support Vector Machine performed best with Pearson's correlation coefficient of 0.75 on the training/testing data set. The robustness of the developed model was further checked using an independent validation dataset. While analyzing the chemical diversity of the anti-biofilm compounds, we observed that they occupy diverse chemical spaces with parent molecules like furanone, urea, phenolic acids, quinolines, and many more. Use of diverse chemicals as input further signifies the robustness of our predictive models. The three best-performing machine learning models were implemented as a user-friendly ‘anti-Biofilm’ web server (https://bioinfo.imtech.res.in/manojk/antibiofilm/) with different other modules which make ‘anti-Biofilm’ a comprehensive platform. Therefore, we hope that our initiative will be helpful for the scientific community engaged in identifying effective anti-biofilm agents to target the problem of antimicrobial resistance.",
                "authors": [
                    {
                        "name": "Bhamare K.T."
                    },
                    {
                        "name": "Kumar M."
                    },
                    {
                        "name": "Rajput A."
                    },
                    {
                        "name": "Thakur A."
                    }
                ],
                "citationCount": 3,
                "date": "2023-07-15T00:00:00Z",
                "journal": "Journal of Molecular Biology",
                "title": "Anti-Biofilm: Machine Learning Assisted Prediction of IC50 Activity of Chemicals Against Biofilms of Microbes Causing Antimicrobial Resistance and Implications in Drug Repurposing"
            },
            "pmid": "37356913",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Molecular biology",
            "uri": "http://edamontology.org/topic_3047"
        },
        {
            "term": "Physics",
            "uri": "http://edamontology.org/topic_3318"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
