
{
    "credit": [
        {
            "email": "liangche@usc.edu",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://www-rcf.usc.edu/~liangche/"
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://www-rcf.usc.edu/~liangche/software.html"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "RNA-Seq analysis",
                    "uri": "http://edamontology.org/operation_3680"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "RNA-Seq",
                "uri": "http://edamontology.org/topic_3170"
            },
            {
                "term": "RNA",
                "uri": "http://edamontology.org/topic_0099"
            },
            {
                "term": "Gene transcripts",
                "uri": "http://edamontology.org/topic_3512"
            },
            {
                "term": "RNA splicing",
                "uri": "http://edamontology.org/topic_3320"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://www.mybiosoftware.com/wemiq-isoform-quantification-method-for-rna-seq-data.html"
        }
    ],
    "publication": [
        {
            "abstract": "© The Author 2014. Published by Oxford University Press. All rights reserved. Motivation: The deconvolution of isoform expression from RNA-seq remains challenging because of non-uniform read sampling and subtle differences among isoforms. Results: We present a weighted-log-likelihood expectation maximization method on isoform quantification (WemIQ). WemIQ integrates an effective bias removal with a weighted expectation maximization (EM) algorithm to distribute reads among isoforms efficiently. The weight represents the oversampling or undersampling of sequence reads and is estimated through a generalized Poisson model without any presumption on the bias sources and formats. WemIQ significantly improves the quantification of isoform and gene expression as well as the derived exon inclusion rates. It provides robust expression estimates across different laboratories and protocols, which is valuable for the integrative analysis of RNA-seq. For the recent single-cell RNA-seq data, WemIQ also provides the opportunity to distinguish bias heterogeneity from true biological heterogeneity and uncovers smaller cell-to-cell expression variability. Availability and implementation: WemIQ can be downloaded from http://www-rcf.usc.edu/∼liangche/software.html.",
            "authors": [
                "Zhang J.",
                "Kuo C.-C.J.",
                "Chen L."
            ],
            "cit_count": 12,
            "journal": "Bioinformatics",
            "pmid": "25406327",
            "title": "WemIQ: An accurate and robust isoform quantification method for RNA-seq data",
            "year": "2015-03-15"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:wemiq",
        "biotoolsID": "wemiq",
        "description": "Software tool to quantify isoform expression and exon splicing ratios from RNA-seq data accurately and robustly.",
        "homepage": "http://www-rcf.usc.edu/~liangche/software.html",
        "name": "WemIQ"
    }
}