{
    "accessibility": "Open access",
    "additionDate": "2024-05-06T09:41:40.146085Z",
    "biotoolsCURIE": "biotools:baymedr",
    "biotoolsID": "baymedr",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "maximilian.linde@gesis.org",
            "name": "Maximilian Linde",
            "orcidid": "https://orcid.org/0000-0001-8421-090X",
            "typeEntity": "Person"
        }
    ],
    "description": "R package and web application for the calculation of Bayes factors for superiority, equivalence, and non-inferiority designs.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Statistical calculation",
                    "uri": "http://edamontology.org/operation_2238"
                }
            ]
        }
    ],
    "homepage": "https://cran.r-project.org/web/packages/baymedr/index.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2024-11-24T14:01:26.099766Z",
    "license": "GPL-3.0",
    "name": "baymedr",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/s12874-023-02097-y",
            "metadata": {
                "abstract": "Background: Clinical trials often seek to determine the superiority, equivalence, or non-inferiority of an experimental condition (e.g., a new drug) compared to a control condition (e.g., a placebo or an already existing drug). The use of frequentist statistical methods to analyze data for these types of designs is ubiquitous even though they have several limitations. Bayesian inference remedies many of these shortcomings and allows for intuitive interpretations, but are currently difficult to implement for the applied researcher. Results: We outline the frequentist conceptualization of superiority, equivalence, and non-inferiority designs and discuss its disadvantages. Subsequently, we explain how Bayes factors can be used to compare the relative plausibility of competing hypotheses. We present baymedr, an R package and web application, that provides user-friendly tools for the computation of Bayes factors for superiority, equivalence, and non-inferiority designs. Instructions on how to use baymedr are provided and an example illustrates how existing results can be reanalyzed with baymedr. Conclusions: Our baymedr R package and web application enable researchers to conduct Bayesian superiority, equivalence, and non-inferiority tests. baymedr is characterized by a user-friendly implementation, making it convenient for researchers who are not statistical experts. Using baymedr, it is possible to calculate Bayes factors based on raw data and summary statistics.",
                "authors": [
                    {
                        "name": "Linde M."
                    },
                    {
                        "name": "vanRavenzwaaij D."
                    }
                ],
                "date": "2023-12-01T00:00:00Z",
                "journal": "BMC Medical Research Methodology",
                "title": "baymedr: an R package and web application for the calculation of Bayes factors for superiority, equivalence, and non-inferiority designs"
            },
            "pmcid": "PMC10668366",
            "pmid": "38001458"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Medicine",
            "uri": "http://edamontology.org/topic_3303"
        },
        {
            "term": "Preclinical and clinical studies",
            "uri": "http://edamontology.org/topic_3379"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ]
}
