
{
    "credit": [
    ],
    "labels": {
        "license": "MIT",
        "topic": [
            {
                "term": "Electron microscopy",
                "uri": "http://edamontology.org/topic_0611"
            },
            {
                "term": "Mapping",
                "uri": "http://edamontology.org/topic_0102"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© 2019 IOP Publishing Ltd.We present a novel framework for the fabrication of geometrically complex structures at the micro- and nano-scale which relies on the synergy of integrated computer-aided design and manufacturing systems (CAD/CAM) and focused ion beam (FIB) technology in a scanning electron microscope. Here we utilise industry standard G-code syntax, for the first time, to FIB machining by designing geometries with CAD, defining machining strategies and exporting G-codes with CAM and generating a coordinate list-based beam path by using a custom-built interpreter program. This allows the fabrication of complex structures from CAD models using syntax which is readily understood in the general fabrication industry. The use of G-code allows optimization of the beam path towards a reduction of beam blanking operations and tracing of contours, leading to minimized re-deposition of material. We give a detailed description of the method, use an application example to demonstrate advantages and prospects of the approach and provide the free and open-source interpreter program CAM2FIB for application of this method. We contrast and compare various existing available milling strategies and demonstrate the versatility of G-code based programming.",
            "authors": [
                "Niessen F.",
                "Nancarrow M.J.B."
            ],
            "cit_count": 0,
            "doi": "10.1088/1361-6528/AB329D",
            "journal": "Nanotechnology",
            "pmid": "31393838",
            "title": "Computer-aided manufacturing and focused ion beam technology enable machining of complex micro- And nano-structures",
            "year": "2019-08-08"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:CAM2FIB",
        "biotoolsID": "CAM2FIB",
        "description": "> MEDIUM CONFIDENCE! | > CORRECT NAME OF TOOL COULD ALSO BE 'G-code', 'machining', 'beam', 'FIB machining' | Computer-aided manufacturing and focused ion beam technology enable machining of complex micro- and nano-structures | Interpretation and interpolation of G-code for creating stream files for FIB/SEM instruments | Program for interpretation and interpolation of G-code to create stream files for FIB/SEM instruments | The currently implemented output format is designed for use with an FEI Helios NanoLab G3 instrument, but may easily be adapted to other instruments. This code accepts most G-code files as an input and was tested with the G-code dialects RS274D, WinCNC and FreeCAD. In its current implementation the overall patterning time is equally distributed over all patterning points. Machining or printing of 3D-structures is therefore currently limited to layered structures. Please read the manual for further instructions on installing and running the interpreter program",
        "homepage": "https://github.com/frankNiessen/CAM2FIB",
        "name": "CAM2FIB"
    }
}