
{
    "credit": [
        {
            "email": "webmaster@ms-utils.org",
            "typeEntity": "Person",
            "typeRoles": [
                "Documentor"
            ],
            "url": "http://ms-utils.org"
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "https://omics.pnl.gov/software/decontools-decon2ls"
        },
        {
            "url": "https://omics.pnl.gov/sites/default/files/software/DeconTools_Tutorial.pdf"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://ncrr.pnl.gov/software/sourcecode_register.asp?id=18"
        },
        {
            "type": "Source code",
            "url": "https://github.com/PNNL-Comp-Mass-Spec/DeconTools"
        }
    ],
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Mass spectrometry spectra",
                        "uri": "http://edamontology.org/data_0943"
                    },
                    "format": [
                        {
                            "term": "WIFF format",
                            "uri": "http://edamontology.org/format_3710"
                        },
                        {
                            "term": "mzML",
                            "uri": "http://edamontology.org/format_3244"
                        },
                        {
                            "term": "Thermo RAW",
                            "uri": "http://edamontology.org/format_3712"
                        },
                        {
                            "term": "mzXML",
                            "uri": "http://edamontology.org/format_3654"
                        }
                    ]
                }
            ],
            "operation": [
                {
                    "term": "Peak detection",
                    "uri": "http://edamontology.org/operation_3215"
                },
                {
                    "term": "Chromatogram visualisation",
                    "uri": "http://edamontology.org/operation_3203"
                },
                {
                    "term": "Mass spectrum visualisation",
                    "uri": "http://edamontology.org/operation_3694"
                },
                {
                    "term": "Isotopic distributions calculation",
                    "uri": "http://edamontology.org/operation_3632"
                },
                {
                    "term": "Deisotoping",
                    "uri": "http://edamontology.org/operation_3629"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Peptide mass fingerprint",
                        "uri": "http://edamontology.org/data_0944"
                    },
                    "format": [
                        {
                            "term": "CSV",
                            "uri": "http://edamontology.org/format_3752"
                        },
                        {
                            "term": "dat",
                            "uri": "http://edamontology.org/format_1637"
                        }
                    ]
                }
            ]
        }
    ],
    "labels": {
        "collectionID": [
            "ms-utils",
            "Proteomics"
        ],
        "language": [
            "C#"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Command-line tool",
            "Desktop application"
        ],
        "topic": [
            {
                "term": "Proteomics",
                "uri": "http://edamontology.org/topic_0121"
            },
            {
                "term": "Proteomics experiment",
                "uri": "http://edamontology.org/topic_3520"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://ms-utils.org"
        }
    ],
    "publication": [
        {
            "abstract": "Here a fully automated computer algorithm is applied to complex mass spectra of peptides and proteins. This method uses a subtractive peak finding routine to locate possible isotopic clusters in the spectrum, subjecting these to a combination of the previous Fourier transform/Patterson method for primary charge determination and the method for least-squares fitting to a theoretically derived isotopic abundance distribution for m/z determination of the most abundant isotopic peak, and the statistical reliability of this determination. If a predicted protein sequence is available, each such m/z value is checked for assignment as a sequence fragment. A new signal-to-noise calculation procedure has been devised for accurate determination of baseline and noise width for spectra with high peak density. In 2 h, the program identified 824 isotopic clusters representing 581 mass values in the spectrum of a GluC digest of a 191 kDa protein; this is >50% more than the number of mass values found by the extremely tedious operator-applied methodology used previously. The program should be generally applicable to classes of large molecules, including DNA and polymers. Thorough high resolution analysis of spectra by Horn (THRASH) is proposed as the program's verb. Copyright © 2000 American Society for Mass Spectrometry.",
            "authors": [
                "Horn D.M.",
                "Zubarev R.A.",
                "McLafferty F.W."
            ],
            "cit_count": 419,
            "journal": "Journal of the American Society for Mass Spectrometry",
            "pmid": "10757168",
            "title": "Automated reduction and interpretation of high resolution electrospray mass spectra of large molecules",
            "year": "2000-12-01"
        },
        {
            "abstract": "Background: Data generated from liquid chromatography coupled to high-resolution mass spectrometry (LC-MS)-based studies of a biological sample can contain large amounts of biologically significant information in the form of proteins, peptides, and metabolites. Interpreting this data involves inferring the masses and abundances of biomolecules injected into the instrument. Because of the inherent complexity of mass spectral patterns produced by these biomolecules, the analysis is significantly enhanced by using visualization capabilities to inspect and confirm results. In this paper we describe Decon2LS, an open-source software package for automated processing and visualization of high-resolution MS data. Drawing extensively on algorithms developed over the last ten years for ICR2LS, Decon2LS packages the algorithms as a rich set of modular, reusable processing classes for performing diverse functions such as reading raw data, routine peak finding, theoretical isotope distribution modelling, and deisotoping. Because the source code is openly available, these functionalities can now be used to build derivative applications in relatively fast manner. In addition, Decon2LS provides an extensive set of visualization tools, such as high performance chart controls. Results: With a variety of options that include peak processing, deisotoping, isotope composition, etc, Decon2LS supports processing of multiple raw data formats. Deisotoping can be performed on an individual scan, an individual dataset, or on multiple datasets using batch processing. Other processing options include creating a two dimensional view of mass and liquid chromatography (LC) elution time features, generating spectrum files for tandem MS data, creating total intensity chromatograms, and visualizing theoretical peptide profiles. Application of Decon2LS to deisotope different datasets obtained across different instruments yielded a high number of features that can be used to identify and quantify peptides in the biological sample. Conclusion: Decon2LS is an efficient software package for discovering and visualizing features in proteomics studies that require automated interpretation of mass spectra. Besides being easy to use, fast, and reliable, Decon2LS is also open-source, which allows developers in the proteomics and bioinformatics communities to reuse and refine the algorithms to meet individual needs. © 2009 Jaitly et al; licensee BioMed Central Ltd.",
            "authors": [
                "Jaitly N.",
                "Mayampurath A.",
                "Littlefield K.",
                "Adkins J.N.",
                "Anderson G.A.",
                "Smith R.D."
            ],
            "cit_count": 152,
            "doi": "10.1186/1471-2105-10-87",
            "journal": "BMC Bioinformatics",
            "pmid": "19292916",
            "title": "Decon2LS: An open-source software package for automated processing and visualization of high resolution mass spectrometry data",
            "type": "Primary",
            "year": "2009-03-17"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:decontools",
        "biotoolsID": "decontools",
        "description": "Advanced peak picking of MS and LC-MS(/MS) data using THRASH and other algorithms.",
        "homepage": "http://omics.pnl.gov/software/DeconTools.php",
        "name": "DeconTools"
    }
}