{
    "additionDate": "2018-10-15T17:35:28Z",
    "biotoolsCURIE": "biotools:beast2",
    "biotoolsID": "beast2",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.beast2.org"
        }
    ],
    "description": "Bayesian phylogenetic analysis of molecular sequences. It estimates rooted, time-measured phylogenies using strict or relaxed molecular clock models. It can be used as a method of reconstructing phylogenies but is also a framework for testing evolutionary hypotheses without conditioning on a single tree topology. It uses Markov chain Monte Carlo (MCMC) to average over tree space, so that each tree is weighted proportional to its posterior probability. It includes a graphical user-interface for setting up standard analyses and a suit of programs for analysing the results.",
    "documentation": [
        {
            "type": [
                "Training material"
            ],
            "url": "http://www.beast2.org/tutorials/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Phylogenetic tree reconstruction",
                    "uri": "http://edamontology.org/operation_3478"
                },
                {
                    "term": "Phylogenetic tree analysis (shape)",
                    "uri": "http://edamontology.org/operation_0551"
                }
            ]
        }
    ],
    "homepage": "http://www.beast2.org",
    "lastUpdate": "2018-12-10T12:59:01Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "http://www.github.com/CompEvol/beast2"
        }
    ],
    "name": "BEAST 2",
    "owner": "aotamendi.1",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PCBI.1003537",
            "metadata": {
                "abstract": "We present a new open source, extensible and flexible software platform for Bayesian evolutionary analysis called BEAST 2. This software platform is a re-design of the popular BEAST 1 platform to correct structural deficiencies that became evident as the BEAST 1 software evolved. Key among those deficiencies was the lack of post-deployment extensibility. BEAST 2 now has a fully developed package management system that allows third party developers to write additional functionality that can be directly installed to the BEAST 2 analysis platform via a package manager without requiring a new software release of the platform. This package architecture is showcased with a number of recently published new models encompassing birth-death-sampling tree priors, phylodynamics and model averaging for substitution models and site partitioning. A second major improvement is the ability to read/write the entire state of the MCMC chain to/from disk allowing it to be easily shared between multiple instances of the BEAST software. This facilitates checkpointing and better support for multi-processor and high-end computing extensions. Finally, the functionality in new packages can be easily added to the user interface (BEAUti 2) by a simple XML template-based mechanism because BEAST 2 has been re-designed to provide greater integration between the analysis engine and the user interface so that, for example BEAST and BEAUti use exactly the same XML file format. © 2014 Bouckaert et al.",
                "authors": [
                    {
                        "name": "Bouckaert R."
                    },
                    {
                        "name": "Heled J."
                    },
                    {
                        "name": "Kuhnert D."
                    },
                    {
                        "name": "Vaughan T."
                    },
                    {
                        "name": "Wu C.-H."
                    },
                    {
                        "name": "Xie D."
                    },
                    {
                        "name": "Suchard M.A."
                    },
                    {
                        "name": "Rambaut A."
                    },
                    {
                        "name": "Drummond A.J."
                    }
                ],
                "citationCount": 2553,
                "date": "2014-01-01T00:00:00Z",
                "journal": "PLoS Computational Biology",
                "title": "BEAST 2: A Software Platform for Bayesian Evolutionary Analysis"
            },
            "pmcid": "PMC3985171",
            "pmid": "24722319"
        }
    ],
    "toolType": [
        "Command-line tool",
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        },
        {
            "term": "Phylogenomics",
            "uri": "http://edamontology.org/topic_0194"
        }
    ],
    "validated": 1,
    "version": [
        "2.5.1"
    ]
}