{
    "accessibility": "Open access",
    "additionDate": "2023-01-17T21:14:36.676546Z",
    "biotoolsCURIE": "biotools:hclc-fc",
    "biotoolsID": "hclc-fc",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "shuzhang@mtu.edu",
            "name": "Shuanglin Zhang",
            "orcidid": "http://orcid.org/0000-0002-9478-1199",
            "typeEntity": "Person"
        },
        {
            "name": "Qiuying Sha",
            "orcidid": "http://orcid.org/0000-0002-9342-3269"
        },
        {
            "name": "Xiaoyu Liang",
            "orcidid": "http://orcid.org/0000-0001-7796-2441"
        },
        {
            "name": "Xuewei Cao",
            "orcidid": "http://orcid.org/0000-0003-2136-0964"
        }
    ],
    "description": "A novel statistical method for phenome-wide association studies.\n\nWe derived a novel and powerful multivariate method, which we referred to as HCLC-FC (Hierarchical Clustering Linear Combination with False discovery rate Control), to test the association between a genetic variant with multiple phenotypes for each phenotypic category in phenome-wide association studies (PheWAS). The R package HCLCFC is a novel tool that allows users to partition a large number of phenotypes into disjoint clusters; applicable to electronic medical records (EMR)-based PheWAS.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/XiaoyuLiang/HCLCFC",
    "language": [
        "R"
    ],
    "lastUpdate": "2023-01-17T21:14:36.679151Z",
    "license": "Not licensed",
    "name": "HCLC-FC",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1371/journal.pone.0276646",
            "metadata": {
                "abstract": "© 2022 Liang et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.The emergence of genetic data coupled to longitudinal electronic medical records (EMRs) offers the possibility of phenome-wide association studies (PheWAS). In PheWAS, the whole phenome can be divided into numerous phenotypic categories according to the genetic architecture across phenotypes. Currently, statistical analyses for PheWAS are mainly univariate analyses, which test the association between one genetic variant and one phenotype at a time. In this article, we derived a novel and powerful multivariate method for PheWAS. The proposed method involves three steps. In the first step, we apply the bottom-up hierarchical clustering method to partition a large number of phenotypes into disjoint clusters within each phenotypic category. In the second step, the clustering linear combination method is used to combine test statistics within each category based on the phenotypic clusters and obtain p-values from each phenotypic category. In the third step, we propose a new false discovery rate (FDR) control approach. We perform extensive simulation studies to compare the performance of our method with that of other existing methods. The results show that our proposed method controls FDR very well and outperforms other methods we compared with. We also apply the proposed approach to a set of EMR-based phenotypes across more than 300,000 samples from the UK Biobank. We find that the proposed approach not only can well-control FDR at a nominal level but also successfully identify 1,244 significant SNPs that are reported to be associated with some phenotypes in the GWAS catalog. Our open-access tools and instructions on how to implement HCLC-FC are available at https://github.com/XiaoyuLiang/HCLCFC.",
                "authors": [
                    {
                        "name": "Cao X."
                    },
                    {
                        "name": "Liang X."
                    },
                    {
                        "name": "Sha Q."
                    },
                    {
                        "name": "Zhang S."
                    }
                ],
                "date": "2022-11-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "HCLC-FC: A novel statistical method for phenome-wide association studies"
            },
            "pmcid": "PMC9645610",
            "pmid": "36350801"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Biobank",
            "uri": "http://edamontology.org/topic_3337"
        },
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "GWAS study",
            "uri": "http://edamontology.org/topic_3517"
        },
        {
            "term": "Phenomics",
            "uri": "http://edamontology.org/topic_3298"
        }
    ],
    "validated": 1
}
