{
    "accessibility": "Open access",
    "additionDate": "2019-05-17T17:42:35Z",
    "biotoolsCURIE": "biotools:fitTetra",
    "biotoolsID": "fitTetra",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "roeland.voorrips@wur.nl",
            "name": "Roeland E. Voorrips",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "R package for genotype calling for tetraploids with multiple population and parental data support.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://cran.r-project.org/web/packages/fitPoly/fitPoly.pdf"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "https://cran.r-project.org/src/contrib/fitPoly_3.0.0.tar.gz"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "SNP detection",
                    "uri": "http://edamontology.org/operation_0484"
                },
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                }
            ]
        }
    ],
    "homepage": "https://cran.r-project.org/package=fitPoly",
    "language": [
        "R"
    ],
    "lastUpdate": "2020-06-16T10:55:22Z",
    "license": "GPL-3.0",
    "maturity": "Mature",
    "name": "fitTetra",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "Ruta",
    "publication": [
        {
            "doi": "10.1186/s12859-019-2703-y",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Genetic studies in tetraploids are lagging behind in comparison with studies of diploids as the complex genetics of tetraploids require much more elaborated computational methodologies. Recent advancements in development of molecular techniques and computational tools facilitate new methods for automated, high-throughput genotype calling in tetraploid species. We report on the upgrade of the widely-used fitTetra software aiming to improve its accuracy, which to date is hampered by technical artefacts in the data. Results: Our upgrade of the fitTetra package is designed for a more accurate modelling of complex collections of samples. The package fits a mixture model where some parameters of the model are estimated separately for each sub-collection. When a full-sib family is analyzed, we use parental genotypes to predict the expected segregation in terms of allele dosages in the offspring. More accurate modelling and use of parental data increases the accuracy of dosage calling. We tested the package on data obtained with an Affymetrix Axiom 60 k array and compared its performance with the original version and the recently published ClusterCall tool, showing that at least 20% more SNPs could be called with our updated. Conclusion: Our updated software package shows clearly improved performance in genotype calling accuracy. Estimation of mixing proportions of the underlying dosage distributions is separated for full-sib families (where mixture proportions can be estimated from the parental dosages and inheritance model) and unstructured populations (where they are based on the assumption of Hardy-Weinberg equilibrium). Additionally, as the distributions of signal ratios of the dosage classes can be assumed to be the same for all populations, including parental data for some subpopulations helps to improve fitting other populations as well. The R package fitTetra 2.0 is freely available under the GNU Public License as Additional file with this article.",
                "authors": [
                    {
                        "name": "Zych K."
                    },
                    {
                        "name": "Gort G."
                    },
                    {
                        "name": "Maliepaard C.A."
                    },
                    {
                        "name": "Jansen R.C."
                    },
                    {
                        "name": "Voorrips R.E."
                    }
                ],
                "citationCount": 2,
                "date": "2019-03-20T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "FitTetra 2.0 - Improved genotype calling for tetraploids with multiple population and parental data support"
            },
            "pmcid": "PMC6425654",
            "pmid": "30894135",
            "type": [
                "Primary"
            ],
            "version": "2.0"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        },
        {
            "term": "Genotyping experiment",
            "uri": "http://edamontology.org/topic_3516"
        }
    ],
    "version": [
        "2.0"
    ]
}