{
    "additionDate": "2021-01-18T11:48:43Z",
    "biotoolsCURIE": "biotools:asdmir",
    "biotoolsID": "asdmir",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "zhangjunpeng_411@yahoo.com",
            "name": "Junpeng Zhang",
            "typeEntity": "Person"
        },
        {
            "name": "Lei Ma",
            "typeEntity": "Person"
        }
    ],
    "description": "ASDmiR is a step-wise method to uncover miRNA regulation related to autism spectrum disorder. MiRNAs (miRNAs) are involved in nervous system developmental, and have potential to cause ASD. However, the miRNA regulation mechanism in ASD is largely unclear. In this work, we present a novel framework, ASDmiR, to identify miRNA-target networks and modules, miRNA sponge networks and modules for uncovering the pathogenesis of ASD, as well as conduct enrichment analysis.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene regulatory network analysis",
                    "uri": "http://edamontology.org/operation_1781"
                },
                {
                    "term": "Gene-set enrichment analysis",
                    "uri": "http://edamontology.org/operation_2436"
                },
                {
                    "term": "miRNA expression analysis",
                    "uri": "http://edamontology.org/operation_3792"
                },
                {
                    "term": "miRNA target prediction",
                    "uri": "http://edamontology.org/operation_0463"
                }
            ]
        }
    ],
    "homepage": "https://github.com/chenchenxiong/ASDmiR",
    "language": [
        "Lisp",
        "R"
    ],
    "lastUpdate": "2021-01-28T20:09:52Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/chenchenxiong/ASD"
        }
    ],
    "name": "ASDmiR",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.3389/FGENE.2020.562971",
            "metadata": {
                "abstract": "© Copyright © 2020 Xiong, Sun, Jiang, Ma and Zhang.Autism spectrum disorder (ASD) is a class of neurodevelopmental disorders characterized by genetic and environmental risk factors. The pathogenesis of ASD has a strong genetic basis, consisting of rare de novo or inherited variants among a variety of multiple molecules. Previous studies have shown that microRNAs (miRNAs) are involved in neurogenesis and brain development and are closely associated with the pathogenesis of ASD. However, the regulatory mechanisms of miRNAs in ASD are largely unclear. In this work, we present a stepwise method, ASDmiR, for the identification of underlying pathogenic genes, networks, and modules associated with ASD. First, we conduct a comparison study on 12 miRNA target prediction methods by using the matched miRNA, lncRNA, and mRNA expression data in ASD. In terms of the number of experimentally confirmed miRNA–target interactions predicted by each method, we choose the best method for identifying miRNA–target regulatory network. Based on the miRNA–target interaction network identified by the best method, we further infer miRNA–target regulatory bicliques or modules. In addition, by integrating high-confidence miRNA–target interactions and gene expression data, we identify three types of networks, including lncRNA–lncRNA, lncRNA–mRNA, and mRNA–mRNA related miRNA sponge interaction networks. To reveal the community of miRNA sponges, we further infer miRNA sponge modules from the identified miRNA sponge interaction network. Functional analysis results show that the identified hub genes, as well as miRNA-associated networks and modules, are closely linked with ASD. ASDmiR is freely available at https://github.com/chenchenxiong/ASDmiR.",
                "authors": [
                    {
                        "name": "Jiang W."
                    },
                    {
                        "name": "Ma L."
                    },
                    {
                        "name": "Sun S."
                    },
                    {
                        "name": "Xiong C."
                    },
                    {
                        "name": "Zhang J."
                    }
                ],
                "date": "2020-10-14T00:00:00Z",
                "journal": "Frontiers in Genetics",
                "title": "ASDmiR: A Stepwise Method to Uncover miRNA Regulation Related to Autism Spectrum Disorder"
            },
            "pmcid": "PMC7591752",
            "pmid": "33173536"
        }
    ],
    "toolType": [
        "Library",
        "Workbench"
    ],
    "topic": [
        {
            "term": "Endocrinology and metabolism",
            "uri": "http://edamontology.org/topic_3407"
        },
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ]
}
