{
    "accessibility": "Open access",
    "additionDate": "2016-03-24T17:11:53Z",
    "biotoolsCURIE": "biotools:oligo-analysis",
    "biotoolsID": "oligo-analysis",
    "collectionID": [
        "FR",
        "Regulatory Sequence Analysis Tools (RSAT)",
        "elixir-fr-sdp-2019"
    ],
    "cost": "Free of charge",
    "credit": [
        {
            "email": "Jacques.van-Helden@univ-amu.fr",
            "name": "Jacques van Helden",
            "orcidid": "https://orcid.org/0000-0002-8799-8584",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "Jacques.van-Helden@univ-amu.fr",
            "name": "Jacques van Helden",
            "orcidid": "https://orcid.org/0000-0002-8799-8584",
            "typeRole": [
                "Maintainer"
            ]
        },
        {
            "name": "RSAT",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        }
    ],
    "description": "Compute k-mer frequencies (oligonucleotides or oligopeptides) and various statistics to discover exceptional motifs (over-represented or under-represented). Typical applications include discovery of transcription factor binding motifs, restriction sites in bacterial genomes, RNA termination and polyadenylation signals, detection of motifs associated with replication origins, analysis of oligopeptide frequencies in protein sequences.",
    "documentation": [
        {
            "type": [
                "Citation instructions"
            ],
            "url": "http://www.ncbi.nlm.nih.gov/pubmed/9719638"
        },
        {
            "type": [
                "General"
            ],
            "url": "http://rsat.eu/"
        }
    ],
    "download": [
        {
            "type": "Binaries",
            "url": "http://rsat.eu/"
        },
        {
            "type": "Source code",
            "url": "http://rsat.eu/"
        }
    ],
    "editPermission": {
        "authors": [
            "MorganeTC",
            "olisand"
        ],
        "type": "group"
    },
    "elixirNode": [
        "France"
    ],
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Sequence set",
                        "uri": "http://edamontology.org/data_0850"
                    },
                    "format": [
                        {
                            "term": "FASTA",
                            "uri": "http://edamontology.org/format_1929"
                        }
                    ]
                }
            ],
            "note": "Compute k-mer occurrences and various derived statistics to discover over- or under-represented motifs. The program expects as input a fasta file containing one or several nucleic or peptidic sequences. The output file is a tab-delimited text file with one row per k-mer (oligonucleotide or oligopeptide) and one row per output statistics. Output statistics depend on user-selected options.",
            "operation": [
                {
                    "term": "Sequence motif discovery",
                    "uri": "http://edamontology.org/operation_0238"
                },
                {
                    "term": "k-mer counting",
                    "uri": "http://edamontology.org/operation_3472"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Sequence motif",
                        "uri": "http://edamontology.org/data_1353"
                    },
                    "format": [
                        {
                            "term": "TSV",
                            "uri": "http://edamontology.org/format_3475"
                        }
                    ]
                }
            ]
        }
    ],
    "homepage": "http://teaching.rsat.eu/oligo-analysis_form.cgi",
    "language": [
        "Perl"
    ],
    "lastUpdate": "2020-06-16T10:55:27Z",
    "license": "AFL-3.0",
    "link": [
        {
            "note": "Fungi-specific RSAT instance",
            "type": [
                "Service"
            ],
            "url": "http://fungi.rsat.eu/oligo-analysis_form.cgi"
        },
        {
            "note": "Metazoa-specific RSAT instance",
            "type": [
                "Service"
            ],
            "url": "http://metazoa.rsat.eu/oligo-analysis_form.cgi"
        },
        {
            "note": "Plant-specific RSAT instance",
            "type": [
                "Service"
            ],
            "url": "http://plants.rsat.eu/oligo-analysis_form.cgi"
        },
        {
            "note": "Prokaryote-specific RSAT instance (Bacteria and Archaea)",
            "type": [
                "Service"
            ],
            "url": "http://prokaryotes.rsat.eu/oligo-analysis_form.cgi"
        },
        {
            "note": "Protist-specific RSAT instance",
            "type": [
                "Service"
            ],
            "url": "http://protists.rsat.eu/oligo-analysis_form.cgi"
        },
        {
            "note": "Teaching RSAT instance",
            "type": [
                "Service"
            ],
            "url": "http://teaching.rsat.eu/oligo-analysis_form.cgi"
        }
    ],
    "maturity": "Mature",
    "name": "RSAT oligo-analysis",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "jvanheld",
    "publication": [
        {
            "metadata": {
                "abstract": "The study of a few genes has permitted the identification of three elements that constitute a yeast polyadenylation signal: the efficiency element (EE), the positioning element and the actual site for cleavage and polyadenylation. In this paper we perform an analysis of oligonucleotide composition on the sequences located downstream of the stop codon of all yeast genes. Several oligonucleotide families appear over-represented with a high significance (referred to herein as 'words'). The family with the highest over-representation includes the oligonucleotides shown experimentally to play a role as EEs. The word with the highest score is TATATA, followed, among others, by a series of single-nucleotide variants (TATGTA, TACATA, TAAATA...) and one-letter shifts (ATATAT). A position analysis reveals that those words have a high preference to be in 3' flanks of yeast genes and there they have a very uneven distribution, with a marked peak around 35 bp after the stop codon. Of the predicted ORFs, 85% show one or more of those sequences. Similar results were obtained using a data set of EST sequences. Other clusters of over-represented words are also detected, namely T- and A-rich signals. Using these results and previously known data we propose a general model for the 3' trailers of yeast mRNAs.",
                "authors": [
                    {
                        "name": "Del Olmo M."
                    },
                    {
                        "name": "Perez-Ortin J.E."
                    },
                    {
                        "name": "Van Helden J."
                    }
                ],
                "citationCount": 112,
                "date": "2000-02-15T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "Statistical analysis of yeast genomic downstream sequences reveals putative polyadenylation signals"
            },
            "pmid": "10648794",
            "type": [
                "Other"
            ]
        },
        {
            "metadata": {
                "abstract": "The web resource Regulatory Sequence Analysis Tools (RSAT) (http://rsat.ulb.ac.be/rsat) offers a collection of software tools dedicated to the prediction of regulatory sites in non-coding DNA sequences. These tools include sequence retrieval, pattern discovery, pattern matching, genome-scale pattern matching, feature-map drawing, random sequence generation and other utilities. Alternative formats are supported for the representation of regulatory motifs (strings or position-specific scoring matrices) and several algorithms are proposed for pattern discovery. RSAT currently holds >100 fully sequenced genomes and these data are regularly updated from GenBank.",
                "authors": [
                    {
                        "name": "van Helden J."
                    }
                ],
                "citationCount": 342,
                "date": "2003-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "Regulatory Sequence Analysis Tools"
            },
            "pmid": "12824373",
            "type": [
                "Other"
            ]
        },
        {
            "metadata": {
                "abstract": "We present here a simple and fast method allowing the isolation of DNA binding sites for transcription factors from families of coregulated genes, with results illustrated in Saccharomyces cerevisiae. Although conceptually simple, the algorithm proved efficient for extracting, from most of the yeast regulatory families analyzed, the upstream regulatory sequences which had been previously found by experimental analysis. Furthermore, putative new regulatory sites are predicted within upstream regions of several regulons. The method is based on the detection of over-represented oligonucleotides. A specificity of this approach is to define the statistical significance of a site based on tables of oligonucleotide frequencies observed in all non-coding sequences from the yeast genome. In contrast with heuristic methods, this oligonucleotide analysis is rigorous and exhaustive. Its range of detection is however limited to relatively simple patterns: short motifs with a highly conserved core. These features seem to be shared by a good number of regulatory sites in yeast. This, and similar methods, should be increasingly required to identify unknown regulatory elements within the numerous new coregulated families resulting from measurements of gene expression levels at the genomic scale.",
                "authors": [
                    {
                        "name": "Andre B."
                    },
                    {
                        "name": "Collado-Vides J."
                    },
                    {
                        "name": "Van Helden J."
                    }
                ],
                "citationCount": 573,
                "date": "1998-09-04T00:00:00Z",
                "journal": "Journal of Molecular Biology",
                "title": "Extracting regulatory sites from the upstream region of yeast genes by computational analysis of oligonucleotide frequencies"
            },
            "pmid": "9719638",
            "type": [
                "Primary"
            ]
        },
        {
            "metadata": {
                "abstract": "© 2015 The Author(s).RSAT (Regulatory Sequence Analysis Tools) is a modular software suite for the analysis of cisregulatory elements in genome sequences. Its main applications are (i) motif discovery, appropriate to genome-wide data sets like ChIP-seq, (ii) transcription factor binding motif analysis (quality assessment, comparisons and clustering), (iii) comparative genomics and (iv) analysis of regulatory variations. Nine new programs have been added to the 43 described in the 2011 NAR Web Software Issue, including a tool to extract sequences from a list of coordinates (fetch-sequences from UCSC), novel programs dedicated to the analysis of regulatory variants from GWAS or population genomics (retrieve-variationseq and variation-scan), a program to cluster motifs and visualize the similarities as trees (matrixclustering). To deal with the drastic increase of sequenced genomes, RSAT public sites have been reorganized into taxon-specific servers. The suite is well-documented with tutorials and published protocols. The software suite is available through Web sites, SOAP/WSDL Web services, virtual machines and stand-alone programs at http://www.rsat.eu/.",
                "authors": [
                    {
                        "name": "Artufel M."
                    },
                    {
                        "name": "Blanchet C."
                    },
                    {
                        "name": "Caron C."
                    },
                    {
                        "name": "Castro-Mondragon J.A."
                    },
                    {
                        "name": "Charbonnier-Khamvongsa L."
                    },
                    {
                        "name": "Contreras-Moreira B."
                    },
                    {
                        "name": "Defrance M."
                    },
                    {
                        "name": "Delerce J."
                    },
                    {
                        "name": "Hernandez C."
                    },
                    {
                        "name": "Herrmann C."
                    },
                    {
                        "name": "Jaeger S."
                    },
                    {
                        "name": "Medina-Rivera A."
                    },
                    {
                        "name": "Sand O."
                    },
                    {
                        "name": "Staines D.M."
                    },
                    {
                        "name": "Thieffry D."
                    },
                    {
                        "name": "Thomas-Chollier M."
                    },
                    {
                        "name": "Van Helden J."
                    },
                    {
                        "name": "Vincens P."
                    }
                ],
                "citationCount": 168,
                "date": "2015-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "RSAT 2015: Regulatory sequence analysis tools"
            },
            "pmid": "25904632",
            "type": [
                "Other"
            ]
        }
    ],
    "toolType": [
        "Command-line tool",
        "Web application",
        "Web service"
    ],
    "topic": [
        {
            "term": "Gene regulation",
            "uri": "http://edamontology.org/topic_0204"
        },
        {
            "term": "Nucleic acid sites, features and motifs",
            "uri": "http://edamontology.org/topic_3511"
        },
        {
            "term": "Protein sites, features and motifs",
            "uri": "http://edamontology.org/topic_3510"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ],
    "validated": 1,
    "version": [
        "1"
    ]
}
