{
    "additionDate": "2023-02-09T13:57:42.181800Z",
    "biotoolsCURIE": "biotools:acl",
    "biotoolsID": "acl",
    "collectionID": [
        "COVID-19"
    ],
    "confidence_flag": "tool",
    "credit": [
        {
            "name": "Shaoning Zeng",
            "typeEntity": "Person"
        }
    ],
    "description": "A framework for adjusting the threshold parameters according to the image contrast. Three functions include Attention mechanism threshold, Contour equalization, and Lung segmentation (ACL).",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Lqs-github/ACL",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2024-11-24T15:04:21.935340Z",
    "license": "Not licensed",
    "name": "ACL",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1016/j.bspc.2022.104486",
            "metadata": {
                "abstract": "The ground glass opacity (GGO) of the lung is one of the essential features of COVID-19. The GGO in computed tomography (CT) images has various features and low-intensity contrast between the GGO and edge structures. These problems pose significant challenges for segmenting the GGO. To tackle these problems, we propose a new threshold method for accurate segmentation of GGO. Specifically, we offer a framework for adjusting the threshold parameters according to the image contrast. Three functions include Attention mechanism threshold, Contour equalization, and Lung segmentation (ACL). The lung is divided into three areas using the attention mechanism threshold. Further, the segmentation parameters of the attention mechanism thresholds of the three parts are adaptively adjusted according to the image contrast. Only the segmentation regions restricted by the lung segmentation results are retained. Extensive experiments on four COVID datasets show that ACL can segment GGO images at low contrast well. Compared with the state-of-the-art methods, the similarity Dice of the ACL segmentation results is improved by 8.9%, the average symmetry surface distance ASD is reduced by 23%, and the required computational power FLOPs are only 0.09% of those of deep learning models. For GGO segmentation, ACL is more lightweight, and the accuracy is higher. Code will be released at https://github.com/Lqs-github/ACL.",
                "authors": [
                    {
                        "name": "Cheng Z."
                    },
                    {
                        "name": "Gao Y."
                    },
                    {
                        "name": "Huang C."
                    },
                    {
                        "name": "Lv Q."
                    },
                    {
                        "name": "Rao Y."
                    },
                    {
                        "name": "Sun J."
                    },
                    {
                        "name": "Yi Y."
                    },
                    {
                        "name": "Zeng S."
                    }
                ],
                "citationCount": 8,
                "date": "2023-03-01T00:00:00Z",
                "journal": "Biomedical Signal Processing and Control",
                "title": "COVID-19 CT ground-glass opacity segmentation based on attention mechanism threshold"
            },
            "pmcid": "PMC9721288",
            "pmid": "36505089"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        },
        {
            "term": "Tomography",
            "uri": "http://edamontology.org/topic_3452"
        }
    ]
}
