{
    "additionDate": "2017-12-18T00:14:35Z",
    "biotoolsCURIE": "biotools:canevolve",
    "biotoolsID": "canevolve",
    "credit": [
        {
            "email": "help@canevolve.org",
            "name": "Support",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Query functionalities are designed to fulfill most frequent analysis needs of cancer researchers with a view to generate novel hypotheses. It stores gene, microRNA (miRNA) and protein expression profiles, copy number alterations for multiple cancer types, and protein-protein interaction information.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://www.canevolve.org/help.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Pathway or network analysis",
                    "uri": "http://edamontology.org/operation_2497"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                }
            ]
        }
    ],
    "homepage": "http://www.canevolve.org/AnalysisResults/AnalysisResults.html",
    "lastUpdate": "2019-02-25T08:56:35Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/canevolve-integrative-cancer-genomics-analysis-expression-copy-number-mirnas-network.html"
        }
    ],
    "name": "canEvolve",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PONE.0056228",
            "metadata": {
                "abstract": "Background & Objective: Genome-wide profiles of tumors obtained using functional genomics platforms are being deposited to the public repositories at an astronomical scale, as a result of focused efforts by individual laboratories and large projects such as the Cancer Genome Atlas (TCGA) and the International Cancer Genome Consortium. Consequently, there is an urgent need for reliable tools that integrate and interpret these data in light of current knowledge and disseminate results to biomedical researchers in a user-friendly manner. We have built the canEvolve web portal to meet this need. Results: canEvolve query functionalities are designed to fulfill most frequent analysis needs of cancer researchers with a view to generate novel hypotheses. canEvolve stores gene, microRNA (miRNA) and protein expression profiles, copy number alterations for multiple cancer types, and protein-protein interaction information. canEvolve allows querying of results of primary analysis, integrative analysis and network analysis of oncogenomics data. The querying for primary analysis includes differential gene and miRNA expression as well as changes in gene copy number measured with SNP microarrays. canEvolve provides results of integrative analysis of gene expression profiles with copy number alterations and with miRNA profiles as well as generalized integrative analysis using gene set enrichment analysis. The network analysis capability includes storage and visualization of gene co-expression, inferred gene regulatory networks and protein-protein interaction information. Finally, canEvolve provides correlations between gene expression and clinical outcomes in terms of univariate survival analysis. Conclusion: At present canEvolve provides different types of information extracted from 90 cancer genomics studies comprising of more than 10,000 patients. The presence of multiple data types, novel integrative analysis for identifying regulators of oncogenesis, network analysis and ability to query gene lists/pathways are distinctive features of canEvolve. canEvolve will facilitate integrative and meta-analysis of oncogenomics datasets. Availability: The canEvolve web portal is available at http://www.canevolve.org/. © 2013 Samur et al.",
                "authors": [
                    {
                        "name": "Samur M.K."
                    },
                    {
                        "name": "Yan Z."
                    },
                    {
                        "name": "Wang X."
                    },
                    {
                        "name": "Cao Q."
                    },
                    {
                        "name": "Munshi N.C."
                    },
                    {
                        "name": "Li C."
                    },
                    {
                        "name": "Shah P.K."
                    }
                ],
                "citationCount": 24,
                "date": "2013-02-13T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "canEvolve: A Web Portal for Integrative Oncogenomics"
            },
            "pmcid": "PMC3572035",
            "pmid": "23418540",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Protein expression",
            "uri": "http://edamontology.org/topic_0108"
        },
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        }
    ],
    "validated": 1
}