
{
    "credit": [
        {
            "email": "hsauro@u.washington.edu",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "https://kkimlab.org/"
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://sbw.sourceforge.net/"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Network simulation",
                    "uri": "http://edamontology.org/operation_3562"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Java",
            "C++",
            "Perl",
            "Python"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Desktop application"
        ],
        "topic": [
            {
                "term": "Biology",
                "uri": "http://edamontology.org/topic_3070"
            },
            {
                "term": "Systems biology",
                "uri": "http://edamontology.org/topic_2259"
            },
            {
                "term": "Bioinformatics",
                "uri": "http://edamontology.org/topic_0091"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://www.mybiosoftware.com/sbw-2-8-1-systems-biology-workbench.html"
        }
    ],
    "publication": [
        {
            "abstract": "Researchers in quantitative systems biology make use of a large number of different software packages for modelling, analysis, visualization, and general data manipulation. In this paper, we describe the Systems Biology Workbench (SBW), a software framework that allows heterogeneous application components-written in diverse programming languages and running on different platforms-to communicate and use each others' capabilities via a fast binary encoded-message system. Our goal was to create a simple, high performance, open-source software infrastructure which is easy to implement and understand. SBW enables applications (potentially running on separate, distributed computers) to communicate via a simple network protocol. The interfaces to the system are encapsulated in client-side libraries that we provide for different programming languages. We describe in this paper the SBW architecture, a selection of current modules, including Jarnac, JDesigner, and SBWMetatool, and the close integration of SBW into BioSPICE, which enables both frameworks to share tools and compliment and strengthen each others capabilities.",
            "authors": [
                "Sauro H.M.",
                "Hucka M.",
                "Finney A.",
                "Wellock C.",
                "Bolouri H.",
                "Doyle J.",
                "Kitano H."
            ],
            "cit_count": 205,
            "journal": "OMICS A Journal of Integrative Biology",
            "pmid": "14683609",
            "title": "Next Generation Simulation Tools: The Systems Biology Workbench and BioSPICE Integration",
            "year": "2003-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:sbw",
        "biotoolsID": "sbw",
        "description": "An open source framework connecting heterogeneous software application components-written in diverse programming languages and running on different platforms-to communicate and use each others' capabilities via a fast binary encoded-message system.",
        "homepage": "http://sbw.sourceforge.net/",
        "name": "SBW"
    }
}