{
    "additionDate": "2019-11-14T18:30:45Z",
    "biotoolsCURIE": "biotools:DTCLab",
    "biotoolsID": "DTCLab",
    "confidence_flag": "medium",
    "credit": [
        {
            "email": "kunal.roy@jadavpuruniversity.in",
            "name": "Kunal Roy",
            "typeEntity": "Person"
        }
    ],
    "description": "> MEDIUM CONFIDENCE! | > CORRECT NAME OF TOOL COULD ALSO BE 'software-tools' | How Precise Are Our Quantitative Structure-Activity Relationship Derived Predictions for New Query Chemicals? | QSPR Modeling of the Refractive Index for Diverse Polymers Using 2D Descriptors | QSAR Model Development Using DTC Lab. Software Tools | DTC lab - Software Tools - DTC lab is working in the field of molecular modelling mainly using different QSAR methodologies in various diverse area such as drug designing, toxicity, anti-oxidant studies etc | Drug Theoretics and Cheminformatics Laboratory | *Genetic Algorithm(MAE-based Fitness Function) | *Intelligent Consensus Predictor",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "http://teqip.jdvu.ac.in/QSAR_Tools/DTCLab/",
    "lastUpdate": "2019-11-14T18:30:45Z",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "http://dtclab.webs.com/software-tools"
        }
    ],
    "name": "DTCLab",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1021/ACSOMEGA.8B01647",
            "metadata": {
                "abstract": "© 2018 American Chemical Society.Quantitative structure-activity relationship (QSAR) models have long been used for making predictions and data gap filling in diverse fields including medicinal chemistry, predictive toxicology, environmental fate modeling, materials science, agricultural science, nanoscience, food science, and so forth. Usually a QSAR model is developed based on chemical information of a properly designed training set and corresponding experimental response data while the model is validated using one or more test set(s) for which the experimental response data are available. However, it is interesting to estimate the reliability of predictions when the model is applied to a completely new data set (true external set) even when the new data points are within applicability domain (AD) of the developed model. In the present study, we have categorized the quality of predictions for the test set or true external set into three groups (good, moderate, and bad) based on absolute prediction errors. Then, we have used three criteria [(a) mean absolute error of leave-one-out predictions for 10 most close training compounds for each query molecule; (b) AD in terms of similarity based on the standardization approach; and (c) proximity of the predicted value of the query compound to the mean training response] in different weighting schemes for making a composite score of predictions. It was found that using the most frequently appearing weighting scheme 0.5-0-0.5, the composite score-based categorization showed concordance with absolute prediction error-based categorization for more than 80% test data points while working with 5 different datasets with 15 models for each set derived in three different splitting techniques. These observations were also confirmed with true external sets for another four endpoints suggesting applicability of the scheme to judge the reliability of predictions for new datasets. The scheme has been implemented in a tool \"Prediction Reliability Indicator\" available at http://dtclab.webs.com/software-tools and http://teqip.jdvu.ac.in/QSAR-Tools/DTCLab/, and the tool is presently valid for multiple linear regression models only.",
                "authors": [
                    {
                        "name": "Roy K."
                    },
                    {
                        "name": "Ambure P."
                    },
                    {
                        "name": "Kar S."
                    }
                ],
                "citationCount": 32,
                "date": "2018-09-30T00:00:00Z",
                "journal": "ACS Omega",
                "title": "How Precise Are Our Quantitative Structure-Activity Relationship Derived Predictions for New Query Chemicals?"
            },
            "pmcid": "PMC6645132",
            "pmid": "31459245"
        },
        {
            "doi": "10.1021/ACSOMEGA.8B01834",
            "metadata": {
                "abstract": "© 2018 American Chemical Society.In the present work, predictive quantitative structure-property relationship models have been developed to predict refractive indices (RIs) of a set of 221 diverse organic polymers using theoretical two-dimensional descriptors generated on the basis of the structures of polymers' monomer units. Four models have been developed by applying partial least squares (PLS) regression with a different combination of six descriptors obtained via double cross-validation approaches. The predictive ability and robustness of the proposed models were checked using multiple validation strategies. Subsequently, the validated models were used for the generation of \"intelligent\" consensus models (http://teqip.jdvu.ac.in/QSAR-Tools/DTCLab/) to improve the quality of predictions for the external data set. The selected consensus models were used for the prediction of refractive index values of various classes of polymers. The final selected model was used to predict the refractive index of four small virtual libraries of monomers recently reported. We also used a true external data set of 98 diverse monomer units with the experimental RI values of the corresponding polymers. The obtained models showed a good predictive ability as evidenced from a very good external predicted variance.",
                "authors": [
                    {
                        "name": "Khan P.M."
                    },
                    {
                        "name": "Rasulev B."
                    },
                    {
                        "name": "Roy K."
                    }
                ],
                "citationCount": 4,
                "date": "2018-10-17T00:00:00Z",
                "journal": "ACS Omega",
                "title": "QSPR Modeling of the Refractive Index for Diverse Polymers Using 2D Descriptors"
            },
            "pmcid": "PMC6645227",
            "pmid": "31458051"
        }
    ],
    "topic": [
        {
            "term": "Medicinal chemistry",
            "uri": "http://edamontology.org/topic_0209"
        },
        {
            "term": "Cheminformatics",
            "uri": "http://edamontology.org/topic_2258"
        },
        {
            "term": "Agricultural science",
            "uri": "http://edamontology.org/topic_3810"
        }
    ]
}