{
    "additionDate": "2024-04-19T09:28:34.739649Z",
    "biotoolsCURIE": "biotools:bracnac",
    "biotoolsID": "bracnac",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "aa_kechin@niboch.nsc.ru",
            "name": "Andrey Kechin",
            "orcidid": "https://orcid.org/0000-0002-4822-0251",
            "typeEntity": "Person"
        }
    ],
    "description": "A BRCA1 and BRCA2 copy number alteration caller from Next-Generation sequencing data.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Copy number variation detection",
                    "uri": "http://edamontology.org/operation_3961"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/aakechin/bracnac/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T14:03:19.448162Z",
    "license": "GPL-3.0",
    "name": "BRACNAC",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.3390/ijms242316630",
            "metadata": {
                "abstract": "Detecting copy number variations (CNVs) and alterations (CNAs) in the BRCA1 and BRCA2 genes is essential for testing patients for targeted therapy applicability. However, the available bioinformatics tools were initially designed for identifying CNVs/CNAs in whole-genome or -exome (WES) NGS data or targeted NGS data without adaptation to the BRCA1/2 genes. Most of these tools were tested on sample cohorts of limited size, with their use restricted to specific library preparation kits or sequencing platforms. We developed BRACNAC, a new tool for detecting CNVs and CNAs in the BRCA1 and BRCA2 genes in NGS data of different origin. The underlying mechanism of this tool involves various coverage normalization steps complemented by CNV probability evaluation. We estimated the sensitivity and specificity of our tool to be 100% and 94%, respectively, with an area under the curve (AUC) of 94%. The estimation was performed using the NGS data obtained from 213 ovarian and prostate cancer samples tested with in-house and commercially available library preparation kits and additionally using multiplex ligation-dependent probe amplification (MLPA) (12 CNV-positive samples). Using freely available WES and targeted NGS data from other research groups, we demonstrated that BRACNAC could also be used for these two types of data, with an AUC of up to 99.9%. In addition, we determined the limitations of the tool in terms of the minimum number of samples per NGS run (≥20 samples) and the minimum expected percentage of CNV-negative samples (≥80%). We expect that our findings will improve the efficacy of BRCA1/2 diagnostics. BRACNAC is freely available at the GitHub server.",
                "authors": [
                    {
                        "name": "Borobova V."
                    },
                    {
                        "name": "Boyarskikh U."
                    },
                    {
                        "name": "Filipenko M."
                    },
                    {
                        "name": "Kechin A."
                    },
                    {
                        "name": "Khrapov E."
                    },
                    {
                        "name": "Subbotin S."
                    }
                ],
                "date": "2023-12-01T00:00:00Z",
                "journal": "International Journal of Molecular Sciences",
                "title": "BRACNAC: A BRCA1 and BRCA2 Copy Number Alteration Caller from Next-Generation Sequencing Data"
            },
            "pmcid": "PMC10706169",
            "pmid": "38068953"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Copy number variation",
            "uri": "http://edamontology.org/topic_3958"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Probes and primers",
            "uri": "http://edamontology.org/topic_0632"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ]
}
