{"credit":[{"email":"salix@bionet.nsc.ru","name":"Vladimir Ivanisenko","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"url":"http://wwwmgs.bionet.nsc.ru/mgs/gnw/pdbsitescan/brief_manual.html"}],"function":[{"operation":[{"term":"Database search","uri":"http://edamontology.org/operation_2421"}]}],"labels":{"operatingSystem":["Linux","Windows","Mac"],"toolType":["Web application"],"topic":[{"term":"Protein binding sites","uri":"http://edamontology.org/topic_3534"},{"term":"Sequence sites, features and motifs","uri":"http://edamontology.org/topic_0160"}]},"publication":[{"abstract":"PDBSiteScan is a web-accessible program designed for searching three-dimensional (3D) protein fragments similar in structure to known active, binding and posttranslational modification sites. A collection of known sites we designated as PDBSite was set up by automated processing of the PDB database using the data on site localization in the SITE field. Additionally, protein-protein interaction sites were generated by analysis of atom coordinates in heterocomplexes. The total number of collected sites was more than 8100; they were assigned to more than 80 functional groups. PDBSiteScan provides automated search of the 3D protein fragments whose maximum distance mismatch (MDM) between N, Cα and C atoms in a fragment and a functional site is not larger than the MDM threshold defined by the user. PDBSiteScan requires perfect matching of amino acids. PDBSiteScan enables recognition of functional sites in tertiary structures of proteins and allows proteins with functional information to be annotated. The program PDBSiteScan is available at http://wwwmgs.bionet.nsc.ru/mgs/systems/fastprot/pdbsitescan.html. © Oxford University Press 2004; all rights reserved.","authors":["Ivanisenko V.A.","Pintus S.S.","Grigorovich D.A.","Kolchanov N.A."],"cit_count":61,"journal":"Nucleic Acids Research","pmid":"15215447","title":"PDBSiteScan: A program for searching for active, binding and posttranslational modification sites in the 3D structures of proteins","year":"2004-07-01"}],"summary":{"biotoolsCURIE":"biotools:pdbsitescan","biotoolsID":"pdbsitescan","description":"Takes a PDB file as input, and searches for stuctural matches with the PDBSite set of known functional sites.","homepage":"http://wwwmgs.bionet.nsc.ru/mgs/systems/fastprot/pdbsitescan.html","name":"PDBSiteScan"}}