{
    "additionDate": "2017-03-25T18:18:03Z",
    "biotoolsCURIE": "biotools:selox",
    "biotoolsID": "selox",
    "description": "Web server identifies degenerate lox-like sites within genomic sequences.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genome comparison",
                    "uri": "http://edamontology.org/operation_3209"
                },
                {
                    "term": "Genome indexing",
                    "uri": "http://edamontology.org/operation_3211"
                },
                {
                    "term": "Recombination detection",
                    "uri": "http://edamontology.org/operation_0451"
                },
                {
                    "term": "Repeat sequence analysis",
                    "uri": "http://edamontology.org/operation_0237"
                }
            ]
        }
    ],
    "homepage": "http://selox.mpi-cbg.de/cgi-bin/selox/index",
    "homepage_status": 1,
    "lastUpdate": "2018-12-10T12:58:40Z",
    "name": "SeLOX",
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "Site-specific recombinases have become a resourceful tool for genome engineering, allowing sophisticated in vivo DNA modifications and rearrangements, including the precise removal of integrated retroviruses from host genomes. In a recent study, a mutant form of Cre recombinase has been used to excise the provirus of a specific HIV-1 strain from the human genome. To achieve provirus excision, the Cre recombinase had to be evolved to recombine an asymmetric locus of recombination (lox)-like sequence present in the long terminal repeat (LTR) regions of a HIV-1 strain. One pre-requisite for this type of work is the identification of degenerate lox-like sites in genomic sequences. Given their nature-two inverted repeats flanking a spacer of variable length-existing search tools like BLAST or RepeatMasker perform poorly. To address this lack of available algorithms, we have developed the web-server SeLOX, which can identify degenerate lox-like sites within genomic sequences. SeLOX calculates a position weight matrix based on lox-like sequences, which is used to search genomic sequences. For computational efficiency, we transform sequences into binary space, which allows us to use a bit-wise AND Boolean operator for comparisons. Next to finding lox-like sites for Cre type recombinases in HIV LTR sequences, we have used SeLOX to identify lox-like sites in HIV LTRs for six yeast recombinases. We finally demonstrate the general usefulness of SeLOX in identifying lox-like sequences in large genomes by searching Cre type recombination sites in the entire human genome. SeLOX is freely available at http://selox.mpi-cbg .de/cgi-bin/selox/index. © The Author(s) 2010. Published by Oxford University Press.",
                "authors": [
                    {
                        "name": "Buchholz F."
                    },
                    {
                        "name": "Chusainow J."
                    },
                    {
                        "name": "Habermann B.H."
                    },
                    {
                        "name": "Hauber J."
                    },
                    {
                        "name": "Surendranath V."
                    }
                ],
                "citationCount": 12,
                "date": "2010-06-05T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "SeLOX-a locus of recombination site search tool for the detection and directed evolution of site-specific recombination systems"
            },
            "pmid": "20529878"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Humans",
            "uri": "http://edamontology.org/topic_2815"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ],
    "validated": 1
}
