{
    "additionDate": "2021-01-18T10:33:56Z",
    "biotoolsCURIE": "biotools:mash_explorer",
    "biotoolsID": "mash_explorer",
    "confidence_flag": "tool",
    "description": "A Universal Software Environment for Top-Down Proteomics.\n\nA Comprehensive User-friendly Software Environment for Top-Down Proteomics.\n\nMASH Explorer is a comprehensive and user-friendly software environment for top-down proteomics, which includes a downloadable software package, MASH Explorer App, as a versatile, comprehensive platform for top-down proteomics with the capability to process data from various vendor formats and incorporate multiple algorithms for deconvolution and database searching. It is developed by an interdisciplinary team consisting of experts in top-down mass spectrometry-based proteomics, computational data science, and bioinformatics/biostatistics.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Deisotoping",
                    "uri": "http://edamontology.org/operation_3629"
                },
                {
                    "term": "PTM localisation",
                    "uri": "http://edamontology.org/operation_3755"
                }
            ]
        }
    ],
    "homepage": "http://ge.crb.wisc.edu/MASH_Explorer/index.htm",
    "lastUpdate": "2021-02-19T09:56:41Z",
    "name": "MASH Explorer",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1021/ACS.JPROTEOME.0C00469",
            "metadata": {
                "abstract": "© 2020 American Chemical Society.Top-down mass spectrometry (MS)-based proteomics enable a comprehensive analysis of proteoforms with molecular specificity to achieve a proteome-wide understanding of protein functions. However, the lack of a universal software for top-down proteomics is becoming increasingly recognized as a major barrier, especially for newcomers. Here, we have developed MASH Explorer, a universal, comprehensive, and user-friendly software environment for top-down proteomics. MASH Explorer integrates multiple spectral deconvolution and database search algorithms into a single, universal platform which can process top-down proteomics data from various vendor formats, for the first time. It addresses the urgent need in the rapidly growing top-down proteomics community and is freely available to all users worldwide. With the critical need and tremendous support from the community, we envision that this MASH Explorer software package will play an integral role in advancing top-down proteomics to realize its full potential for biomedical research.",
                "authors": [
                    {
                        "name": "Bayne E.F."
                    },
                    {
                        "name": "Ge Y."
                    },
                    {
                        "name": "Gu Y."
                    },
                    {
                        "name": "Liu X."
                    },
                    {
                        "name": "McIlwain S.J."
                    },
                    {
                        "name": "Melby J.A."
                    },
                    {
                        "name": "Ong I.M."
                    },
                    {
                        "name": "Ramanathan S.G."
                    },
                    {
                        "name": "Roberts D.S."
                    },
                    {
                        "name": "Sun R."
                    },
                    {
                        "name": "Wenger K."
                    },
                    {
                        "name": "Wetzel M."
                    },
                    {
                        "name": "Wu Z."
                    }
                ],
                "citationCount": 14,
                "date": "2020-09-04T00:00:00Z",
                "journal": "Journal of Proteome Research",
                "title": "MASH Explorer: A Universal Software Environment for Top-Down Proteomics"
            },
            "pmcid": "PMC7728713",
            "pmid": "32786689"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ]
}
