{
    "additionDate": "2021-01-18T11:42:58Z",
    "biotoolsCURIE": "biotools:gmstool",
    "biotoolsID": "gmstool",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "deepreds@kribb.re.kr",
            "name": "Namshin Kim",
            "typeEntity": "Person"
        }
    ],
    "description": "GWAS-based marker selection tool for genomic prediction from genomic data.\n\nGWAS-based Marker Selection Tool for Genomic Prediction from Genomic Data (for continuous phenotype).\n\nGMStool is a tool of selecting an optimal marker-set for predicting a continuous phenotype.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Phasing",
                    "uri": "http://edamontology.org/operation_3454"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                }
            ]
        }
    ],
    "homepage": "http://www.github.com/JaeYoonKim72/GMStool",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-01-25T08:47:21Z",
    "name": "GMStool",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1038/S41598-020-76759-Y",
            "metadata": {
                "abstract": "© 2020, The Author(s).The increased accessibility to genomic data in recent years has laid the foundation for studies to predict various phenotypes of organisms based on the genome. Genomic prediction collectively refers to these studies, and it estimates an individual’s phenotypes mainly using single nucleotide polymorphism markers. Typically, the accuracy of these genomic prediction studies is highly dependent on the markers used; however, in practice, choosing optimal markers with high accuracy for the phenotype to be used is a challenging task. Therefore, we present a new tool called GMStool for selecting optimal marker sets and predicting quantitative phenotypes. The GMStool is based on a genome-wide association study (GWAS) and heuristically searches for optimal markers using statistical and machine-learning methods. The GMStool performs the genomic prediction using statistical and machine/deep-learning models and presents the best prediction model with the optimal marker-set. For the evaluation, the GMStool was tested on real datasets with four phenotypes. The prediction results showed higher performance than using the entire markers or the GWAS-top markers, which have been used frequently in prediction studies. Although the GMStool has several limitations, it is expected to contribute to various studies for predicting quantitative phenotypes. The GMStool written in R is available at www.github.com/JaeYoonKim72/GMStool.",
                "authors": [
                    {
                        "name": "Jeong S."
                    },
                    {
                        "name": "Kim J.-Y."
                    },
                    {
                        "name": "Kim N."
                    }
                ],
                "citationCount": 1,
                "date": "2020-12-01T00:00:00Z",
                "journal": "Scientific Reports",
                "title": "GMStool: GWAS-based marker selection tool for genomic prediction from genomic data"
            },
            "pmcid": "PMC7665227",
            "pmid": "33184432"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "GWAS study",
            "uri": "http://edamontology.org/topic_3517"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        },
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        }
    ],
    "validated": 1
}