{
    "additionDate": "2022-06-28T18:37:33.212074Z",
    "biotoolsCURIE": "biotools:mlmc",
    "biotoolsID": "mlmc",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "jxwang@mail.csu.edu.cn",
            "name": "Jianxin Wang"
        },
        {
            "name": "Yixin Yan"
        }
    ],
    "description": "Drug repositioning based on multi-view learning with matrix completion.",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://github.com/BioinformaticsCSU/MLMC",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2022-06-28T18:37:33.214568Z",
    "license": "Not licensed",
    "name": "MLMC",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1093/BIB/BBAC054",
            "metadata": {
                "abstract": "© The Author(s) 2022. Published by Oxford University Press. All rights reserved.Determining drug indications is a critical part of the drug development process. However, traditional drug discovery is expensive and time-consuming. Drug repositioning aims to find potential indications for existing drugs, which is considered as an important alternative to the traditional drug discovery. In this article, we propose a multi-view learning with matrix completion (MLMC) method to predict the potential associations between drugs and diseases. Specifically, MLMC first learns the comprehensive similarity matrices from five drug similarity matrices and two disease similarity matrices based on the multi-view learning (ML) with Laplacian graph regularization, and updates the drug-disease association matrix simultaneously. Then, we introduce matrix completion (MC) to add some positive entries in original association matrix based on low-rank structure, and re-execute the multi-view learning algorithm for association prediction. At last, the prediction results of the above two operations are integrated as the final output. Evaluated by 10-fold cross-validation and de novo tests, MLMC achieves higher prediction accuracy than the current state-of-the-art methods. Moreover, case studies confirm the ability of our method in novel drug-disease association discovery. The codes of MLMC are available at https://github.com/BioinformaticsCSU/MLMC.",
                "authors": [
                    {
                        "name": "Duan G."
                    },
                    {
                        "name": "Peng X."
                    },
                    {
                        "name": "Wang J."
                    },
                    {
                        "name": "Yan Y."
                    },
                    {
                        "name": "Yang M."
                    },
                    {
                        "name": "Zhao H."
                    }
                ],
                "date": "2022-05-01T00:00:00Z",
                "journal": "Briefings in Bioinformatics",
                "title": "Drug repositioning based on multi-view learning with matrix completion"
            },
            "pmid": "35289352"
        }
    ],
    "toolType": [
        "Workflow"
    ],
    "topic": [
        {
            "term": "Drug development",
            "uri": "http://edamontology.org/topic_3373"
        },
        {
            "term": "Drug discovery",
            "uri": "http://edamontology.org/topic_3336"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        }
    ]
}
