
{
    "credit": [
        {
            "email": "vahid.jalili@polimi.it",
            "name": "Vahid Jalili",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "https://github.com/Genometric/GeMSE/wiki"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Phylogenetic tree visualisation",
                    "uri": "http://edamontology.org/operation_0567"
                },
                {
                    "term": "Expression data visualisation",
                    "uri": "http://edamontology.org/operation_0571"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "R",
            "Java"
        ],
        "license": "GPL-3.0",
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Desktop application"
        ],
        "topic": [
            {
                "term": "Genomics",
                "uri": "http://edamontology.org/topic_0622"
            },
            {
                "term": "Data visualisation",
                "uri": "http://edamontology.org/topic_0092"
            },
            {
                "term": "Sequencing",
                "uri": "http://edamontology.org/topic_3168"
            },
            {
                "term": "Phylogenetics",
                "uri": "http://edamontology.org/topic_3293"
            },
            {
                "term": "Gene expression",
                "uri": "http://edamontology.org/topic_0203"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© 2017 The Author(s). Background: With the wide-spreading of public repositories of NGS processed data, the availability of user-friendly and effective tools for data exploration, analysis and visualization is becoming very relevant. These tools enable interactive analytics, an exploratory approach for the seamless \"sense-making\" of data through on-the-fly integration of analysis and visualization phases, suggested not only for evaluating processing results, but also for designing and adapting NGS data analysis pipelines. Results: This paper presents abstractions for supporting the early analysis of NGS processed data and their implementation in an associated tool, named GenoMetric Space Explorer (GeMSE). This tool serves the needs of the GenoMetric Query Language, an innovative cloud-based system for computing complex queries over heterogeneous processed data. It can also be used starting from any text files in standard BED, BroadPeak, NarrowPeak, GTF, or general tab-delimited format, containing numerical features of genomic regions; metadata can be provided as text files in tab-delimited attribute-value format. GeMSE allows interactive analytics, consisting of on-the-fly cycling among steps of data exploration, analysis and visualization that help biologists and bioinformaticians in making sense of heterogeneous genomic datasets. By means of an explorative interaction support, users can trace past activities and quickly recover their results, seamlessly going backward and forward in the analysis steps and comparative visualizations of heatmaps. Conclusions: GeMSE effective application and practical usefulness is demonstrated through significant use cases of biological interest. GeMSE is available at http://www.bioinformatics.deib.polimi.it/GeMSE/ , and its source code is available at https://github.com/Genometric/GeMSEunder GPLv3 open-source license.",
            "authors": [
                "Jalili V.",
                "Matteucci M.",
                "Masseroli M.",
                "Ceri S."
            ],
            "cit_count": 3,
            "doi": "10.1186/s12859-017-1945-9",
            "journal": "BMC Bioinformatics",
            "title": "Explorative visual analytics on interval-based genomic data and their metadata",
            "type": "Primary",
            "year": "2017-12-04"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:gemse",
        "biotoolsID": "gemse",
        "description": "Explorative visual analytics on interval-based genomic data and their metadata.",
        "homepage": "http://www.bioinformatics.deib.polimi.it/genomic_computing/GeMSE/",
        "name": "GeMSE"
    }
}