{
    "additionDate": "2021-01-18T12:23:24Z",
    "biotoolsCURIE": "biotools:hgimc",
    "biotoolsID": "hgimc",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "jxwang@mail.csu.edu.cn",
            "name": "Jianxin Wang",
            "typeEntity": "Person"
        }
    ],
    "description": "Heterogeneous graph inference with matrix completion for computational drug repositioning.\n\nInspired by the low-rank completion of BNNR and the guilt-by-association principle of HGBI, we propose a heterogeneous graph inference with matrix completion (HGIMC) method to predict potential indications for drugs.\n\nOverview This repository contains data and code for HGIMC method, which is based on the model at https: github.com BioinformaticsCSU HGIMC.\n\nNovember 23, 2020 Software Open Access.",
    "download": [
        {
            "type": "Container file",
            "url": "https://hub.docker.com/repository/docker/yangmy84/hgimc"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "http://doi.org/10.5281/zenodo.4285640",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2021-01-30T11:28:27Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/BioinformaticsCSU/HGIMC"
        }
    ],
    "name": "HGIMC",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAA1024",
            "metadata": {
                "abstract": "© 2020 The Author(s) 2020. Published by Oxford University Press. All rights reserved. For permissions, please e-mail: journals.permissions@oup.com.Motivation: Emerging evidence presents that traditional drug discovery experiment is time-consuming and high costs. Computational drug repositioning plays a critical role in saving time and resources for drug research and discovery. Therefore, developing more accurate and efficient approaches is imperative. Heterogeneous graph inference is a classical method in computational drug repositioning, which not only has high convergence precision, but also has fast convergence speed. However, the method has not fully considered the sparsity of heterogeneous association network. In addition, rough similarity measure can reduce the performance in identifying drug-associated indications. Results: In this article, we propose a heterogeneous graph inference with matrix completion (HGIMC) method to predict potential indications for approved and novel drugs. First, we use a bounded matrix completion (BMC) model to prefill a part of the missing entries in original drug-disease association matrix. This step can add more positive and formative drug-disease edges between drug network and disease network. Second, Gaussian radial basis function (GRB) is employed to improve the drug and disease similarities since the performance of heterogeneous graph inference more relies on similarity measures. Next, based on the updated drug-disease associations and new similarity measures of drug and disease, we construct a novel heterogeneous drug-disease network. Finally, HGIMC utilizes the heterogeneous network to infer the scores of unknown association pairs, and then recommend the promising indications for drugs. To evaluate the performance of our method, HGIMC is compared with five state-of-the-art approaches of drug repositioning in the 10-fold cross-validation and de novo tests. As the numerical results shown, HGIMC not only achieves a better prediction performance but also has an excellent computation efficiency. In addition, cases studies also confirm the effectiveness of our method in practical application. Availabilityand implementation: The HGIMC software and data are freely available at https://github.com/BioinformaticsCSU/HGIMC, https://hub.docker.com/repository/docker/yangmy84/hgimc and http://doi.org/10.5281/zenodo.4285640.",
                "authors": [
                    {
                        "name": "Huang L."
                    },
                    {
                        "name": "Lu C."
                    },
                    {
                        "name": "Wang J."
                    },
                    {
                        "name": "Xu Y."
                    },
                    {
                        "name": "Yang M."
                    }
                ],
                "citationCount": 2,
                "date": "2020-12-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Heterogeneous graph inference with matrix completion for computational drug repositioning"
            },
            "pmid": "33331887"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Drug development",
            "uri": "http://edamontology.org/topic_3373"
        },
        {
            "term": "Drug discovery",
            "uri": "http://edamontology.org/topic_3336"
        },
        {
            "term": "Preclinical and clinical studies",
            "uri": "http://edamontology.org/topic_3379"
        },
        {
            "term": "Safety sciences",
            "uri": "http://edamontology.org/topic_3377"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
