{
    "additionDate": "2021-01-18T11:53:17Z",
    "biotoolsCURIE": "biotools:recipedb",
    "biotoolsID": "recipedb",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "ganesh.bagler@gmail.com",
            "name": "Ganesh Bagler",
            "orcidid": "https://orcid.org/0000-0003-1924-6070",
            "typeEntity": "Person"
        }
    ],
    "description": "RecipeDB is a structured compilation of recipes, ingredients, and nutrition profiles interlinked with flavor profiles and health associations.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://cosylab.iiitd.edu.in/recipedb",
    "lastUpdate": "2021-02-04T16:17:09Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/cosylabiiit/Recipedb-companion-data"
        }
    ],
    "name": "RecipeDB",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1093/DATABASE/BAAA077",
            "metadata": {
                "abstract": "© The Author(s) 2020. Published by Oxford University Press. This is an Open Access article distributed under the terms of the Creative Commons Attribution License (http://creativecommons.org/licenses/by/4.0/), which permits unrestricted reuse, distribution, and reproduction in any medium, provided the original work is properly cited.Cooking is the act of turning nature into the culture, which has enabled the advent of the omnivorous human diet. The cultural wisdom of processing raw ingredients into delicious dishes is embodied in their cuisines. Recipes thus are the cultural capsules that encode elaborate cooking protocols for evoking sensory satiation as well as providing nourishment. As we stand on the verge of an epidemic of diet-linked disorders, it is eminently important to investigate the culinary correlates of recipes to probe their association with sensory responses as well as consequences for nutrition and health. RecipeDB (https://cosylab.iiitd.edu.in/recipedb) is a structured compilation of recipes, ingredients and nutrition profiles interlinked with flavor profiles and health associations. The repertoire comprises of meticulous integration of 118 171 recipes from cuisines across the globe (6 continents, 26 geocultural regions and 74 countries), cooked using 268 processes (heat, cook, boil, simmer, bake, etc.), by blending over 20 262 diverse ingredients, which are further linked to their flavor molecules (FlavorDB), nutritional profiles (US Department of Agriculture) and empirical records of disease associations obtained from MEDLINE (DietRx). This resource is aimed at facilitating scientific explorations of the culinary space (recipe, ingredient, cooking processes/techniques, dietary styles, etc.) linked to taste (flavor profile) and health (nutrition and disease associations) attributes seeking for divergent applications.",
                "authors": [
                    {
                        "name": "Bagler G."
                    },
                    {
                        "name": "Batra D."
                    },
                    {
                        "name": "Diwan N."
                    },
                    {
                        "name": "Kalathil S."
                    },
                    {
                        "name": "Kalra J.S."
                    },
                    {
                        "name": "Khanna D."
                    },
                    {
                        "name": "Marwah J.S."
                    },
                    {
                        "name": "Sharma A.K."
                    },
                    {
                        "name": "Sharma T."
                    },
                    {
                        "name": "Singh N."
                    },
                    {
                        "name": "Tuwani R."
                    },
                    {
                        "name": "Upadhyay U."
                    }
                ],
                "date": "2020-01-01T00:00:00Z",
                "journal": "Database",
                "title": "RecipeDB: A resource for exploring recipes"
            },
            "pmcid": "PMC7687679",
            "pmid": "33238002"
        }
    ],
    "topic": [
        {
            "term": "Agricultural science",
            "uri": "http://edamontology.org/topic_3810"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Nutritional science",
            "uri": "http://edamontology.org/topic_3390"
        },
        {
            "term": "Probes and primers",
            "uri": "http://edamontology.org/topic_0632"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ]
}
