{
    "additionDate": "2021-03-19T09:15:09Z",
    "biotoolsCURIE": "biotools:tidymicro",
    "biotoolsID": "tidymicro",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "charles.carpenter@cuanschutz.edu",
            "name": "Charlie M. Carpenter",
            "orcidid": "https://orcid.org/0000-0002-4698-1516",
            "typeEntity": "Person"
        }
    ],
    "description": "A Pipeline for Microbiome Analysis and Visualization using the tidyverse in R.\n\nThe goal of tidyMicro is to provide a cohesive pipeline for microbiome data analysis and visualization.\n\nA reliable alternative to popular microbiome analysis R packages. We provide standard tools as well as novel extensions on standard analyses to improve interpretability and the analyst’s ability to communicate results, all while maintaining object malleability to encourage open source collaboration.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Principal component visualisation",
                    "uri": "http://edamontology.org/operation_2939"
                },
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "https://github.com/CharlieCarpenter/tidyMicro",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-04-23T15:45:02Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://cran.r-project.org/web/packages/tidyMicro/index.html"
        }
    ],
    "name": "tidyMicro",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1186/S12859-021-03967-2",
            "metadata": {
                "abstract": "© 2021, The Author(s).Background: The drive to understand how microbial communities interact with their environments has inspired innovations across many fields. The data generated from sequence-based analyses of microbial communities typically are of high dimensionality and can involve multiple data tables consisting of taxonomic or functional gene/pathway counts. Merging multiple high dimensional tables with study-related metadata can be challenging. Existing microbiome pipelines available in R have created their own data structures to manage this problem. However, these data structures may be unfamiliar to analysts new to microbiome data or R and do not allow for deviations from internal workflows. Existing analysis tools also focus primarily on community-level analyses and exploratory visualizations, as opposed to analyses of individual taxa. Results: We developed the R package “tidyMicro” to serve as a more complete microbiome analysis pipeline. This open source software provides all of the essential tools available in other popular packages (e.g., management of sequence count tables, standard exploratory visualizations, and diversity inference tools) supplemented with multiple options for regression modelling (e.g., negative binomial, beta binomial, and/or rank based testing) and novel visualizations to improve interpretability (e.g., Rocky Mountain plots, longitudinal ordination plots). This comprehensive pipeline for microbiome analysis also maintains data structures familiar to R users to improve analysts’ control over workflow. A complete vignette is provided to aid new users in analysis workflow. Conclusions: tidyMicro provides a reliable alternative to popular microbiome analysis packages in R. We provide standard tools as well as novel extensions on standard analyses to improve interpretability results while maintaining object malleability to encourage open source collaboration. The simple examples and full workflow from the package are reproducible and applicable to external data sets.",
                "authors": [
                    {
                        "name": "Carpenter C.M."
                    },
                    {
                        "name": "Frank D.N."
                    },
                    {
                        "name": "Williamson K."
                    },
                    {
                        "name": "Arbet J."
                    },
                    {
                        "name": "Wagner B.D."
                    },
                    {
                        "name": "Kechris K."
                    },
                    {
                        "name": "Kroehl M.E."
                    }
                ],
                "date": "2021-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "tidyMicro: a pipeline for microbiome data analysis and visualization using the tidyverse in R"
            },
            "pmcid": "PMC7852128",
            "pmid": "33526006"
        }
    ],
    "toolType": [
        "Command-line tool",
        "Library"
    ],
    "topic": [
        {
            "term": "Microbial ecology",
            "uri": "http://edamontology.org/topic_3697"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ]
}