{
    "additionDate": "2018-07-14T09:28:07Z",
    "biotoolsCURIE": "biotools:fdetect",
    "biotoolsID": "fdetect",
    "credit": [
        {
            "email": "lkurgan@vcu.edu",
            "name": "Lukasz Kurgan",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Fast predictor of propensity for protein production, purification, and crystallization.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://biomine.cs.vcu.edu/servers/fDETECT/help.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein crystallizability prediction",
                    "uri": "http://edamontology.org/operation_0410"
                }
            ]
        }
    ],
    "homepage": "http://biomine.cs.vcu.edu/servers/fDETECT/",
    "lastUpdate": "2024-11-25T14:33:02.042322Z",
    "name": "fDETECT",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "migle_sur",
    "publication": [
        {
            "doi": "10.1186/s12859-017-1995-z",
            "metadata": {
                "abstract": "Background: Development of predictors of propensity of protein sequences for successful crystallization has been actively pursued for over a decade. A few novel methods that expanded the scope of these predictions to address additional steps of protein production and structure determination pipelines were released in recent years. The predictive performance of the current methods is modest. This is because the only input that they use is the protein sequence and since the experimental annotations of these data might be inconsistent given that they were collected across many laboratories and centers. However, even these modest levels of predictive quality are still practical compared to the reported low success rates of crystallization, which are below 10%. We focus on another important aspect related to a high computational cost of running the predictors that offer the expanded scope. Results: We introduce a novel fDETECT webserver that provides very fast and modestly accurate predictions of the success of protein production, purification, crystallization, and structure determination. Empirical tests on two datasets demonstrate that fDETECT is more accurate than the only other similarly fast method, and similarly accurate and three orders of magnitude faster than the currently most accurate predictors. Our method predicts a single protein in about 120 milliseconds and needs less than an hour to generate the four predictions for an entire human proteome. Moreover, we empirically show that fDETECT secures similar levels of predictive performance when compared with four representative methods that only predict success of crystallization, while it also provides the other three predictions. A webserver that implements fDETECT is available at http://biomine.cs.vcu.edu/servers/fDETECT/. Conclusions: fDETECT is a computational tool that supports target selection for protein production and X-ray crystallography-based structure determination. It offers predictive quality that matches or exceeds other state-of-the-art tools and is especially suitable for the analysis of large protein sets.",
                "authors": [
                    {
                        "name": "Kurgan L."
                    },
                    {
                        "name": "Meng F."
                    },
                    {
                        "name": "Wang C."
                    }
                ],
                "citationCount": 16,
                "date": "2018-01-03T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "fDETECT webserver: Fast predictor of propensity for protein production, purification, and crystallization"
            },
            "pmcid": "PMC6389161",
            "pmid": "29295714",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Protein structure analysis",
            "uri": "http://edamontology.org/topic_2814"
        }
    ],
    "validated": 1
}
