{
    "accessibility": "Open access",
    "additionDate": "2022-09-29T06:49:02.441230Z",
    "biotoolsCURIE": "biotools:canary_conversion",
    "biotoolsID": "canary_conversion",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "katie.kh.chan@cityu.edu.hk",
            "name": "Kei Hang Katie Chan",
            "orcidid": "https://orcid.org/0000-0001-9070-5394",
            "typeEntity": "Person"
        },
        {
            "name": "Adam N. Bennett"
        }
    ],
    "description": "Canary is a bioinformatics tool that allows for the automatic conversion of MaCH dosage files (mlinfo and mldose) into PLINK1 and PLINK2 compatible files.",
    "download": [
        {
            "type": "Source code",
            "url": "https://github.com/anb94/Canary/tree/canary_archive"
        }
    ],
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Formatting",
                    "uri": "http://edamontology.org/operation_0335"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Imputation",
                    "uri": "http://edamontology.org/operation_3557"
                }
            ]
        }
    ],
    "homepage": "https://github.com/anb94/Canary",
    "language": [
        "Python",
        "R",
        "Shell"
    ],
    "lastUpdate": "2022-09-29T06:49:02.443760Z",
    "license": "MIT",
    "name": "Canary",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1186/S12859-022-04822-8",
            "metadata": {
                "abstract": "© 2022, The Author(s).Background: Previous studies have demonstrated the value of re-analysing publicly available genetics data with recent analytical approaches. Publicly available datasets, such as the Women’s Health Initiative (WHI) offered by the database of genotypes and phenotypes (dbGaP), provide a wealthy resource for researchers to perform multiple analyses, including Genome-Wide Association Studies. Often, the genetic information of individuals in these datasets are stored in imputed dosage files output by MaCH; mldose and mlinfo files. In order for researchers to perform GWAS studies with this data, they must first be converted to a file format compatible with their tool of choice e.g., PLINK. Currently, there is no published tool which easily converts the datasets provided in MACH dosage files into PLINK-ready files. Results: Herein, we present Canary a singularity-based tool which converts MaCH dosage files into PLINK-compatible files with a single line of user input at the command line. Further, we provide a detailed tutorial on preparation of phenotype files. Moreover, Canary comes with preinstalled software often used during GWAS studies, to further increase the ease-of-use of HPC systems for researchers. Conclusions: Until now, conversion of imputed data in the form of MaCH mldose and mlinfo files needed to be completed manually. Canary uses singularity container technology to allow users to automatically convert these MaCH files into PLINK compatible files. Additionally, Canary provides researchers with a platform to conduct GWAS analysis more easily as it contains essential software needed for conducting GWAS studies, such as PLINK and Bioconductor. We hope that this tool will greatly increase the ease at which researchers can perform GWAS with imputed data, particularly on HPC environments.",
                "authors": [
                    {
                        "name": "Bennett A.N."
                    },
                    {
                        "name": "Chan K.H.K."
                    },
                    {
                        "name": "He Q."
                    },
                    {
                        "name": "Huang X."
                    },
                    {
                        "name": "Rainford J."
                    }
                ],
                "date": "2022-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Canary: an automated tool for the conversion of MaCH imputed dosage files to PLINK files"
            },
            "pmcid": "PMC9327220",
            "pmid": "35896971"
        }
    ],
    "toolType": [
        "Command-line tool",
        "Suite"
    ],
    "topic": [
        {
            "term": "Computer science",
            "uri": "http://edamontology.org/topic_3316"
        },
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "GWAS study",
            "uri": "http://edamontology.org/topic_3517"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Preclinical and clinical studies",
            "uri": "http://edamontology.org/topic_3379"
        }
    ]
}
