{
    "additionDate": "2017-12-18T00:05:55Z",
    "biotoolsCURIE": "biotools:edisa",
    "biotoolsID": "edisa",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.zbit.uni-tuebingen.de/welcome.html"
        }
    ],
    "description": "Extended Dimension Iterative Signature Algorithm is a novel probabilistic clustering approach for 3D gene-condition-time datasets. Based on mathematical definitions of gene expression modules,Its samples initial modules from the dataset which are then refined by removing genes and conditions until they comply with the module definition. A subsequent extension step ensures gene and condition maximality.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                }
            ]
        }
    ],
    "homepage": "http://www.ra.cs.uni-tuebingen.de/software/EDISA/welcome_e.html",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2018-12-10T12:58:59Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/edisa-1-0-extracting-biclusters-multiple-time-series-gene-expression-profiles.html"
        }
    ],
    "name": "EDISA",
    "operatingSystem": [
        "Linux",
        "Windows"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1186/1471-2105-8-334",
            "metadata": {
                "abstract": "Background: Cells dynamically adapt their gene expression patterns in response to various stimuli. This response is orchestrated into a number of gene expression modules consisting of co-regulated genes. A growing pool of publicly available microarray datasets allows the identification of modules by monitoring expression changes over time. These time-series datasets can be searched for gene expression modules by one of the many clustering methods published to date. For an integrative analysis, several time-series datasets can be joined into a three-dimensional gene-condition-time dataset, to which standard clustering or biclustering methods are, however, not applicable. We thus devise a probabilistic clustering algorithm for gene-condition-time datasets. Results: In this work, we present the EDISA (Extended Dimension Iterative Signature Algorithm), a novel probabilistic clustering approach for 3D gene-condition-time datasets. Based on mathematical definitions of gene expression modules, the EDISA samples initial modules from the dataset which are then refined by removing genes and conditions until they comply with the module definition. A subsequent extension step ensures gene and condition maximality. We applied the algorithm to a synthetic dataset and were able to successfully recover the implanted modules over a range of background noise intensities. Analysis of microarray datasets has lead us to define three biologically relevant module types: 1) We found modules with independent response profiles to be the most prevalent ones. These modules comprise genes which are co-regulated under several conditions, yet with a different response pattern under each condition. 2) Coherent modules with similar responses under all conditions occurred frequently, too, and were often contained within these modules. 3) A third module type, which covers a response specific to a single condition was also detected, but rarely. All of these modules are essentially different types of biclusters. Conclusion: We successfully applied the EDISA to different 3D datasets. While previous studies were mostly aimed at detecting coherent modules only, our results show that coherent responses are often part of a more general module type with independent response profiles under different conditions. Our approach thus allows for a more comprehensive view of the gene expression response. After subsequent analysis of the resulting modules, the EDISA helped to shed light on the global organization of transcriptional control. An implementation of the algorithm is available at http://www-ra.informatik.uni-tuebingen.de/software/IAGEN/. © 2007 Supper et al; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Supper J."
                    },
                    {
                        "name": "Strauch M."
                    },
                    {
                        "name": "Wanke D."
                    },
                    {
                        "name": "Harter K."
                    },
                    {
                        "name": "Zell A."
                    }
                ],
                "citationCount": 46,
                "date": "2007-09-12T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "EDISA: Extracting biclusters from multiple time-series of gene expression profiles"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "samples",
            "uri": "http://edamontology.org/topic_3277"
        }
    ],
    "validated": 1,
    "version": [
        "1.0"
    ]
}