{
    "additionDate": "2020-01-14T09:34:23Z",
    "biotoolsCURIE": "biotools:umlsmapper",
    "biotoolsID": "umlsmapper",
    "confidence_flag": "tool",
    "description": "Cross-lingual Semantic Annotation of Biomedical Literature.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Text annotation",
                    "uri": "http://edamontology.org/operation_3778"
                }
            ]
        }
    ],
    "homepage": "https://snlt.vicomtech.org/umlsmapper",
    "lastUpdate": "2021-01-16T17:36:21Z",
    "name": "UMLSmapper",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ853",
            "metadata": {
                "abstract": "© 2019 The Author(s) 2019. Published by Oxford University Press. All rights reserved. For permissions, please e-mail: journals.permissions@oup.com.Motivation: Biomedical literature is one of the most relevant sources of information for knowledge mining in the field of Bioinformatics. In spite of English being the most widely addressed language in the field; in recent years, there has been a growing interest from the natural language processing community in dealing with languages other than English. However, the availability of language resources and tools for appropriate treatment of non-English texts is lacking behind. Our research is concerned with the semantic annotation of biomedical texts in the Spanish language, which can be considered an under-resourced language where biomedical text processing is concerned. Results: We have carried out experiments to assess the effectiveness of several methods for the automatic annotation of biomedical texts in Spanish. One approach is based on the linguistic analysis of Spanish texts and their annotation using an information retrieval and concept disambiguation approach. A second method takes advantage of a Spanish-English machine translation process to annotate English documents and transfer annotations back to Spanish. A third method takes advantage of the combination of both procedures. Our evaluation shows that a combined system has competitive advantages over the two individual procedures.",
                "authors": [
                    {
                        "name": "Perez N."
                    },
                    {
                        "name": "Accuosto P."
                    },
                    {
                        "name": "Bravo A."
                    },
                    {
                        "name": "Cuadros M."
                    },
                    {
                        "name": "Martinez-Garcia E."
                    },
                    {
                        "name": "Saggion H."
                    },
                    {
                        "name": "Rigau G."
                    }
                ],
                "date": "2020-03-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Cross-lingual semantic annotation of biomedical literature: Experiments in Spanish and English"
            },
            "pmid": "31730202"
        }
    ],
    "topic": [
        {
            "term": "Natural language processing",
            "uri": "http://edamontology.org/topic_0218"
        },
        {
            "term": "Medicine",
            "uri": "http://edamontology.org/topic_3303"
        },
        {
            "term": "Bioinformatics",
            "uri": "http://edamontology.org/topic_0091"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        }
    ],
    "validated": 1
}