{
    "additionDate": "2021-11-29T08:25:44.627432Z",
    "biotoolsCURIE": "biotools:pysmash",
    "biotoolsID": "pysmash",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "oriental-cds@163.com",
            "name": "Dong-Sheng Cao",
            "orcidid": "https://orcid.org/0000-0003-3604-3785",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "tingjunhou@zju.edu.cn",
            "name": "Ting-Jun Hou",
            "orcidid": "https://orcid.org/0000-0001-7227-2580",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "liushao999@csu.edu.cn",
            "name": "Shao Liu",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "PySmash is a Python package and individual executable program for representative substructure generation and application. PySmash is a user-friendly and integrated tool which offers convenience and advantage for the automatic structural alerts derivation and application is presented.",
    "documentation": [
        {
            "type": [
                "Training material"
            ],
            "url": "https://github.com/kotori-y/pySmash/blob/master/tutorial/datasets"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence motif recognition",
                    "uri": "http://edamontology.org/operation_0239"
                },
                {
                    "term": "Structural motif discovery",
                    "uri": "http://edamontology.org/operation_0245"
                },
                {
                    "term": "Virtual screening",
                    "uri": "http://edamontology.org/operation_3938"
                }
            ]
        }
    ],
    "homepage": "https://github.com/kotori-y/pySmash",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-11-29T08:25:44.630005Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/kotori-y/pySmash/issues"
        }
    ],
    "name": "PySmash",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/BIB/BBAB017",
            "metadata": {
                "abstract": "© 2021 The Author(s) 2021. Published by Oxford University Press. All rights reserved. For Permissions, please email: journals.permissions@oup.com.Background: Substructure screening is widely applied to evaluate the molecular potency and ADMET properties of compounds in drug discovery pipelines, and it can also be used to interpret QSAR models for the design of new compounds with desirable physicochemical and biological properties. With the continuous accumulation of more experimental data, data-driven computational systems which can derive representative substructures from large chemical libraries attract more attention. Therefore, the development of an integrated and convenient tool to generate and implement representative substructures is urgently needed. Results: In this study, PySmash, a user-friendly and powerful tool to generate different types of representative substructures, was developed. The current version of PySmash provides both a Python package and an individual executable program, which achieves ease of operation and pipeline integration. Three types of substructure generation algorithms, including circular, path-based and functional group-based algorithms, are provided. Users can conveniently customize their own requirements for substructure size, accuracy and coverage, statistical significance and parallel computation during execution. Besides, PySmash provides the function for external data screening. Conclusion: PySmash, a user-friendly and integrated tool for the automatic generation and implementation of representative substructures, is presented. Three screening examples, including toxicophore derivation, privileged motif detection and the integration of substructures with machine learning (ML) models, are provided to illustrate the utility of PySmash in safety profile evaluation, therapeutic activity exploration and molecular optimization, respectively. Its executable program and Python package are available at https://github.com/kotori-y/pySmash.",
                "authors": [
                    {
                        "name": "Cao D.-S."
                    },
                    {
                        "name": "Chen X."
                    },
                    {
                        "name": "Hou T.-J."
                    },
                    {
                        "name": "Liu S."
                    },
                    {
                        "name": "Lu A.-P."
                    },
                    {
                        "name": "Yang Z.-J."
                    },
                    {
                        "name": "Yang Z.-Y."
                    },
                    {
                        "name": "Yin M.-Z."
                    },
                    {
                        "name": "Zhao Y."
                    }
                ],
                "date": "2021-09-01T00:00:00Z",
                "journal": "Briefings in Bioinformatics",
                "title": "PySmash: Python package and individual executable program for representative substructure generation and application"
            },
            "pmid": "33709154",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Cheminformatics",
            "uri": "http://edamontology.org/topic_2258"
        },
        {
            "term": "Compound libraries and screening",
            "uri": "http://edamontology.org/topic_3343"
        },
        {
            "term": "Medicinal chemistry",
            "uri": "http://edamontology.org/topic_0209"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ]
}
