{
    "name": "FatiGOplus", 
    "description": "Tool for the functional profiling of genome-scale experiments oriented to the interpretation of microarray experiments. As part of the Babelomics suite, the tool finds differential distributions of biological terms (GO, KEGG pathways, Interpro motifs, Transfac motifs, CisRed motifs, etc.) between two groups of genes.", 
    "homepage": "http://www.fatigo.org/", 
    "biotoolsID": "fatigoplus", 
    "biotoolsCURIE": "biotools:fatigoplus", 
    "version": [], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_0239", 
                    "term": "Sequence motif recognition"
                }, 
                {
                    "uri": "http://edamontology.org/operation_2454", 
                    "term": "Gene prediction"
                }, 
                {
                    "uri": "http://edamontology.org/operation_3223", 
                    "term": "Differential gene expression analysis"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Web application"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_3518", 
            "term": "Microarray experiment"
        }, 
        {
            "uri": "http://edamontology.org/topic_0602", 
            "term": "Molecular interactions, pathways and networks"
        }, 
        {
            "uri": "http://edamontology.org/topic_0203", 
            "term": "Gene expression"
        }, 
        {
            "uri": "http://edamontology.org/topic_0160", 
            "term": "Sequence sites, features and motifs"
        }, 
        {
            "uri": "http://edamontology.org/topic_0166", 
            "term": "Protein structural motifs and surfaces"
        }
    ], 
    "operatingSystem": [], 
    "language": [], 
    "license": null, 
    "collectionID": [], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [], 
    "download": [], 
    "documentation": [], 
    "publication": [
        {
            "doi": null, 
            "pmid": "16845052", 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "BABELOMICS: A systems biology perspective in the functional annotation of genome-scale experiments", 
                "abstract": "We present a new version of Babelomics, a complete suite of web tools for functional analysis of genome-scale experiments, with new and improved tools. New functionally relevant terms have been included such as CisRed motifs or bioentities obtained by text-mining procedures. An improved indexing has considerably speeded up several of the modules. An improved version of the FatiScan method for studying the coordinate behaviour of groups of functionally related genes is presented, along with a similar tool, the Gene Set Enrichment Analysis. Babelomics is now more oriented to test systems biology inspired hypotheses. Babelomics can be found at http://www.babelomics.org. © The Author 2006. Published by Oxford University Press. All rights reserved.", 
                "date": "2006-07-01T00:00:00Z", 
                "citationCount": 206, 
                "authors": [
                    {
                        "name": "Al-Shahrour F."
                    }, 
                    {
                        "name": "Minguez P."
                    }, 
                    {
                        "name": "Tarraga J."
                    }, 
                    {
                        "name": "Montaner D."
                    }, 
                    {
                        "name": "Alloza E."
                    }, 
                    {
                        "name": "Vaquerizas J.M."
                    }, 
                    {
                        "name": "Conde L."
                    }, 
                    {
                        "name": "Blaschke C."
                    }, 
                    {
                        "name": "Vera J."
                    }, 
                    {
                        "name": "Dopazo J."
                    }
                ], 
                "journal": "Nucleic Acids Research"
            }
        }, 
        {
            "doi": null, 
            "pmid": "14990455", 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "FatiGO: A web tool for finding significant associations of Gene Ontology terms with groups of genes", 
                "abstract": "Summary: We present a simple but powerful procedure to extract Gene Ontology (GO) terms that are significantly over- or under-represented in sets of genes within the context of a genome-scale experiment (DNA microarray, proteomics, etc.). Said procedure has been implemented as a web application, FatiGO, allowing for easy and interactive querying. FatiGO, which takes the multiple-testing nature of statistical contrast into account, currently includes GO associations for diverse organisms (human, mouse, fly, worm and yeast) and the TrEMBL/Swissprot GOAnnotationṡ BI correspondences from the European Bioinformatics Institute. © Oxford University Press 2004; all rights reserved.", 
                "date": "2004-03-01T00:00:00Z", 
                "citationCount": 792, 
                "authors": [
                    {
                        "name": "Al-Shahrour F."
                    }, 
                    {
                        "name": "Diaz-Uriarte R."
                    }, 
                    {
                        "name": "Dopazo J."
                    }
                ], 
                "journal": "Bioinformatics"
            }
        }, 
        {
            "doi": null, 
            "pmid": "17478504", 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "FatiGO +: A functional profiling tool for genomic data. Integration of functional annotation, regulatory motifs and interaction data with microarray experiments", 
                "abstract": "The ultimate goal of any genome-scale experiment is to provide a functional interpretation of the data, relating the available information with the hypotheses that originated the experiment. Thus, functional profiling methods have become essential in diverse scenarios such as microarray experiments, proteomics, etc. We present the FatiGO1, a web-based tool for the functional profiling of genome-scale experiments, specially oriented to the interpretation of microarray experiments. In addition to different functional annotations (gene ontology, KEGG pathways, Interpro motifs, Swissprot keywords and text-mining based bioentities related to diseases and chemical compounds) FatiGO1 includes, as a novelty, regulatory and structural information. The regulatory information used includes predictions of targets for distinct regulatory elements (obtained from the Transfac and CisRed databases). Additionally FatiGO1 uses predictions of target motifs of miRNA to infer which of these can be activated or deactivated in the sample of genes studied. Finally, properties of gene products related to their relative location and connections in the interactome have also been used. Also, enrichment of any of these functional terms can be directly analysed on chromosomal coordinates. FatiGO1 can be found at: http://www.fatigoplus.org and within the Babelomics environment http://www.babelomics.org. © 2007 The Author(s).", 
                "date": "2007-07-01T00:00:00Z", 
                "citationCount": 184, 
                "authors": [
                    {
                        "name": "Al-Shahrour F."
                    }, 
                    {
                        "name": "Minguez P."
                    }, 
                    {
                        "name": "Tarraga J."
                    }, 
                    {
                        "name": "Medina I."
                    }, 
                    {
                        "name": "Alloza E."
                    }, 
                    {
                        "name": "Montaner D."
                    }, 
                    {
                        "name": "Dopazo J."
                    }
                ], 
                "journal": "Nucleic Acids Research"
            }
        }, 
        {
            "doi": null, 
            "pmid": "15980512", 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "BABELOMICS: A suite of web tools for functional annotation and analysis of groups of genes in high-throughput experiments", 
                "abstract": "We present Babelomics, a complete suite of web tools for the functional analysis of groups of genes in high-throughput experiments, which includes the use of information on Gene Ontology terms, interpro motifs, KEGG pathways, Swiss-Prot keywords, analysis of predicted transcription factor binding sites, chromosomal positions and presence in tissues with determined histological characteristics, through five integrated modules: FatiGO (fast assignment and transference of information), FatiWise, transcription factor association test, GenomeGO and tissues mining tool, respectively. Additionally, another module, FatiScan, provides a new procedure that integrates biological information in combination with experimental results in order to find groups of genes with modest but coordinate significant differential behaviour. FatiScan is highly sensitive and is capable of finding significant asymmetries in the distribution of genes of common function across a list of ordered genes even if these asymmetries were not extreme. The strong multiple-testing nature of the contrasts made by the tools is taken into account. All the tools are integrated in the gene expression analysis package GEPAS. Babelomics is the natural evolution of our tool FatiGO (which analysed almost 22 000 experiments during the last year) to include more sources on information and new modes of using it. Babelomics can be found at http://www.babelomics.org. © 2005 Oxford University Press.", 
                "date": "2005-07-01T00:00:00Z", 
                "citationCount": 195, 
                "authors": [
                    {
                        "name": "Al-Shahrour F."
                    }, 
                    {
                        "name": "Minguez P."
                    }, 
                    {
                        "name": "Vaquerizas J.M."
                    }, 
                    {
                        "name": "Conde L."
                    }, 
                    {
                        "name": "Dopazo J."
                    }
                ], 
                "journal": "Nucleic Acids Research"
            }
        }
    ], 
    "credit": [], 
    "owner": "ELIXIR-EE", 
    "additionDate": "2017-02-10T14:14:56Z", 
    "lastUpdate": "2018-12-10T12:58:40Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 1, 
    "homepage_status": 1, 
    "elixir_badge": 0
}