{
    "accessibility": [],
    "additionDate": "2017-08-03T18:36:43Z",
    "biotoolsCURIE": "biotools:balboa",
    "biotoolsID": "balboa",
    "collectionID": [],
    "confidence_flag": null,
    "cost": null,
    "credit": [
        {
            "email": "kenneth.bryan@ucd.ie",
            "gridid": null,
            "name": "Kenneth Bryan",
            "note": null,
            "orcidid": null,
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://mlg.ucd.ie/index.php"
        }
    ],
    "description": "An ORF (Open Reading Frame) annotation approach, in which classifiers are constructed from the class specific expression patterns discovered by bicluster analysis. Firstly a set of bicluster classifiers is build using a labelled training set from the annotated ORFs in the expression data. These biclusters are then used to classify an unlabelled ORF set i.e. the unannotated ORFs from the expression dataset.",
    "documentation": [
        {
            "note": null,
            "type": "General",
            "url": "http://mlg.ucd.ie/balboa.html"
        }
    ],
    "download": [],
    "editPermission": {
        "authors": [],
        "type": "private"
    },
    "elixirNode": [],
    "elixirPlatform": [],
    "elixir_badge": 0,
    "function": [
        {
            "cmd": null,
            "input": [],
            "note": null,
            "operation": [
                {
                    "term": "Gene expression correlation analysis",
                    "uri": "http://edamontology.org/operation_3463"
                }
            ],
            "output": []
        }
    ],
    "homepage": "http://mlg.ucd.ie/balboa.html",
    "homepage_status": 0,
    "language": [],
    "lastUpdate": "2018-12-10T12:58:57Z",
    "license": null,
    "link": [
        {
            "note": null,
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/balboa-extension-bicluster-analysis-functional-classification-orfs.html"
        }
    ],
    "maturity": null,
    "name": "BALBOA",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "otherID": [],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": null,
            "metadata": {
                "abstract": "Background: Microarrays have the capacity to measure the expressions of thousands of genes in parallel over many experimental samples. The unsupervised classification technique of bicluster analysis has been employed previously to uncover gene expression correlations over subsets of samples with the aim of providing a more accurate model of the natural gene functional classes. This approach also has the potential to aid functional annotation of unclassified open reading frames (ORFs). Until now this aspect of biclustering has been under-explored. In this work we illustrate how bicluster analysis may be extended into a 'semi-supervised' ORF annotation approach referred to as BALBOA. Results: The efficacy of the BALBOA ORF classification technique is first assessed via cross validation and compared to a multi-class k-Nearest Neighbour (kNN) benchmark across three independent gene expression datasets. BALBOA is then used to assign putative functional annotations to unclassified yeast ORFs. These predictions are evaluated using existing experimental and protein sequence information. Lastly, we employ a related semi-supervised method to predict the presence of novel functional modules within yeast. Conclusion: In this paper we demonstrate how unsupervised classification methods, such as bicluster analysis, may be extended using of available annotations to form semi-supervised approaches within the gene expression analysis domain. We show that such methods have the potential to improve upon supervised approaches and shed new light on the functions of unclassified ORFs and their co-regulation. © 2008 Bryan and Cunningham; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Bryan K."
                    },
                    {
                        "name": "Cunningham P."
                    }
                ],
                "citationCount": 5,
                "date": "2008-09-16T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "Extending bicluster analysis to annotate unclassified ORFs and predict novel functional modules using expression data"
            },
            "note": null,
            "pmcid": null,
            "pmid": "18831786",
            "type": null,
            "version": null
        }
    ],
    "relation": [],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Data submission, annotation and curation",
            "uri": "http://edamontology.org/topic_0219"
        },
        {
            "term": "Molecular genetics",
            "uri": "http://edamontology.org/topic_3321"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        }
    ],
    "validated": 1,
    "version": []
}