{
    "additionDate": "2020-01-09T17:46:59Z",
    "biotoolsCURIE": "biotools:PathBank",
    "biotoolsID": "PathBank",
    "confidence_flag": "tool",
    "description": "A comprehensive pathway database for model organisms.\n\nQuantitative metabolomics services for biomarker discovery and validation.\n\nSpecializing in ready to use metabolomics kits.\n\nYour source for quantitative metabolomics technologies and bioinformatics.\n\nPathBank is an interactive, visual database containing more than 100 000 machine-readable pathways found in model organisms such as humans, mice, E. coli, yeast, and Arabidopsis thaliana.\n\nA Pathway for Every Protein",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Pathway or network comparison",
                    "uri": "http://edamontology.org/operation_0277"
                },
                {
                    "term": "Expression profile pathway mapping",
                    "uri": "http://edamontology.org/operation_0533"
                },
                {
                    "term": "Pathway or network visualisation",
                    "uri": "http://edamontology.org/operation_3083"
                }
            ]
        }
    ],
    "homepage": "http://www.pathbank.org",
    "lastUpdate": "2021-01-05T09:31:24Z",
    "name": "PathBank",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/NAR/GKZ861",
            "metadata": {
                "abstract": "© 2019 The Author(s). Published by Oxford University Press on behalf of Nucleic Acids Research.PathBank (www.pathbank.org) is a new, comprehensive, visually rich pathway database containing more than 110 000 machine-readable pathways found in 10 model organisms (Homo sapiens, Bos taurus, Rattus norvegicus, Mus musculus, Drosophila melanogaster, Caenorhabditis elegans, Arabidopsis thaliana, Saccharomyces cerevisiae, Escherichia coli and Pseudomonas aeruginosa). PathBank aims to provide a pathway for every protein and a map for every metabolite. This resource is designed specifically to support pathway elucidation and pathway discovery in transcriptomics, proteomics, metabolomics and systems biology. It provides detailed, fully searchable, hyperlinked diagrams of metabolic, metabolite signaling, protein signaling, disease, drug and physiological pathways. All PathBank pathways include information on the relevant organs, organelles, subcellular compartments, cofactors, molecular locations, chemical structures and protein quaternary structures. Each small molecule is hyperlinked to the rich data contained in public chemical databases such as HMDB or DrugBank and each protein or enzyme complex is hyperlinked to UniProt. All PathBank pathways are accompanied with references and detailed descriptions which provide an overview of the pathway, condition or processes depicted in each diagram. Every PathBank pathway is downloadable in several machine-readable and image formats including BioPAX, SBML, PWML, SBGN, RXN, PNG and SVG. PathBank also supports community annotations and submissions through the web-based PathWhiz pathway illustrator. The vast majority of PathBank's pathways (>95%) are not found in any other public pathway database.",
                "authors": [
                    {
                        "name": "Wishart D.S."
                    },
                    {
                        "name": "Li C."
                    },
                    {
                        "name": "Marcu A."
                    },
                    {
                        "name": "Badran H."
                    },
                    {
                        "name": "Pon A."
                    },
                    {
                        "name": "Budinski Z."
                    },
                    {
                        "name": "Patron J."
                    },
                    {
                        "name": "Lipton D."
                    },
                    {
                        "name": "Cao X."
                    },
                    {
                        "name": "Oler E."
                    },
                    {
                        "name": "Li K."
                    },
                    {
                        "name": "Paccoud M."
                    },
                    {
                        "name": "Hong C."
                    },
                    {
                        "name": "Guo A.C."
                    },
                    {
                        "name": "Chan C."
                    },
                    {
                        "name": "Wei W."
                    },
                    {
                        "name": "Ramirez-Gaona M."
                    }
                ],
                "citationCount": 17,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "PathBank: A comprehensive pathway database for model organisms"
            },
            "pmid": "31602464"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Endocrinology and metabolism",
            "uri": "http://edamontology.org/topic_3407"
        }
    ],
    "validated": 1
}