{
    "additionDate": "2019-11-14T19:53:17Z",
    "biotoolsCURIE": "biotools:Microdatasus",
    "biotoolsID": "Microdatasus",
    "confidence_flag": "medium",
    "description": "> MEDIUM CONFIDENCE! | > CORRECT NAME OF TOOL COULD ALSO BE 'DATASUS' | a package for downloading and preprocessing microdata from Brazilian Health Informatics Department (DATASUS)] | Download de dados do DataSUS e pré-processamento no R | O pacote para o R microdatasus apresenta funções para download dos arquivos de microdados do DataSUS (formato DBC), leitura dos arquivos através do pacote read.dbc e pré-processamento para utilização. Nesta última etapa, os rótulos e formato das variáveis são atribuídos e tratados | Plano Diretor de Tecnologia da Informação do Ministério da Saúde, biênio 2017-2018, foi publicada no Diário Oficial da União | Software de gestão hospitalar completo, desenvolvido em tecnologia web que substitui o sistema HOSPUB",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "de Novo sequencing",
                    "uri": "http://edamontology.org/operation_3644"
                }
            ]
        }
    ],
    "homepage": "http://datasus.saude.gov.br/",
    "language": [
        "R"
    ],
    "lastUpdate": "2019-11-14T19:53:17Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": "Repository",
            "url": "https://github.com/rfsaldanha/microdatasus"
        }
    ],
    "name": "Microdatasus",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1590/0102-311X00032419",
            "metadata": {
                "abstract": "This study aimed to develop an algorithm for downloading and preprocessing microdata furnished by the Brazilian Health Informatics Department (DATASUS) for various health information systems, using the R statistical programming language. The package allows downloading and preprocessing data from various health information systems, with the inclusion of labeling categorical fields in the files. The download function was capable of directly accessing and reducing the workload for the selection of microdata files and variables in DATASUS, while the preprocessing function enabled automatic coding of various categorical fields. The package thus enables a continuous workflow in the same program, in which the algorithm allows downloading and preprocessing and other packages in R allow analyzing data from the health information systems in the Brazilian Unified National Health System (SUS). O objetivo do estudo foi desenvolver um algoritmo capaz de realizar o download e o pré-processamento de microdados fornecidos pelo Departamento de Informática do SUS (DATASUS) para diversos sistemas de informações em saúde para a linguagem de programação estatística R. O pacote desenvolvido permite o download e o pré-processamento de dados de diversos sistemas de informação em saúde, com a inclusão da rotulagem dos campos categóricos nos arquivos. A função de download foi capaz de acessar diretamente e reduzir o volume de trabalho para a seleção de arquivos e variáveis de microdados junto ao DATASUS. Já a função de pré-processamento foi capaz de efetuar a codificação automática de diversos campos categóricos. Dessa forma, a utilização desse pacote possibilita um fluxo de trabalho contínuo no mesmo programa, no qual esse algoritmo permite o download e o pré-processamento, e outros pacotes do R permitem a análise de dados dos sistemas de informação em saúde do Sistema Único de Saúde (SUS). El objetivo del estudio fue desarrollar un algoritmo capaz de realizar la descarga y pre-procesamiento de microdatos, proporcionados por el Departamento de Informática del SUS (DATASUS), para diversos sistemas de información en salud, así como para el lenguaje de programación estadístico R. El paquete desarrollado permite la descarga y preprocesamiento de datos de diversos sistemas de información en salud, con la inclusión del rótulo de los campos categóricos en los archivos. La función de descarga se mostró capaz de acceder directamente y reducir el volumen de trabajo para la selección de archivos y variables de microdatos a través del DATASUS, mientras que la función de pre-procesamiento fue capaz de efectuar la codificación automática de diversos campos categóricos. De esta forma, la utilización de este paquete posibilita un flujo de trabajo continuo en el mismo programa, donde este algoritmo permite la descarga y preprocesamiento y otros paquetes del R permiten el análisis de datos de los sistemas de información en salud del Sistema Único de Salud (SUS).",
                "authors": [
                    {
                        "name": "Saldanha R.F."
                    },
                    {
                        "name": "Bastos R.R."
                    },
                    {
                        "name": "Barcellos C."
                    }
                ],
                "date": "2019-09-16T00:00:00Z",
                "journal": "Cadernos de saude publica",
                "title": "Microdatasus: a package for downloading and preprocessing microdata from Brazilian Health Informatics Department (DATASUS) Microdatasus: pacote para download e pré-processamento de microdados do Departamento de Informática do SUS (DATASUS)"
            },
            "pmid": "31531513"
        }
    ],
    "topic": [
        {
            "term": "Medical informatics",
            "uri": "http://edamontology.org/topic_3063"
        },
        {
            "term": "Electron microscopy",
            "uri": "http://edamontology.org/topic_0611"
        },
        {
            "term": "Data mining",
            "uri": "http://edamontology.org/topic_3473"
        }
    ]
}