{
    "additionDate": "2021-01-18T07:42:25Z",
    "biotoolsCURIE": "biotools:lp-hclus",
    "biotoolsID": "lp-hclus",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "gianvito.pio@uniba.it",
            "name": "Gianvito Pio",
            "orcidid": "https://orcid.org/0000-0003-2520-3616",
            "typeEntity": "Person"
        }
    ],
    "description": "Prediction of new associations between ncRNAs and diseases exploiting multi-type hierarchical clustering.\n\nThe system LP-HCLUS and all the necessary files(lphclus.zip).",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "Named-entity and concept recognition",
                    "uri": "http://edamontology.org/operation_3280"
                },
                {
                    "term": "Relation extraction",
                    "uri": "http://edamontology.org/operation_3625"
                }
            ]
        }
    ],
    "homepage": "http://www.di.uniba.it/~gianvitopio/systems/lphclus/",
    "lastUpdate": "2021-02-19T07:58:17Z",
    "name": "LP-HCLUS",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1186/S12859-020-3392-2",
            "metadata": {
                "abstract": "© 2020 The Author(s).Background: The study of functional associations between ncRNAs and human diseases is a pivotal task of modern research to develop new and more effective therapeutic approaches. Nevertheless, it is not a trivial task since it involves entities of different types, such as microRNAs, lncRNAs or target genes whose expression also depends on endogenous or exogenous factors. Such a complexity can be faced by representing the involved biological entities and their relationships as a network and by exploiting network-based computational approaches able to identify new associations. However, existing methods are limited to homogeneous networks (i.e., consisting of only one type of objects and relationships) or can exploit only a small subset of the features of biological entities, such as the presence of a particular binding domain, enzymatic properties or their involvement in specific diseases. Results: To overcome the limitations of existing approaches, we propose the system LP-HCLUS, which exploits a multi-Type hierarchical clustering method to predict possibly unknown ncRNA-disease relationships. In particular, LP-HCLUS analyzes heterogeneous networks consisting of several types of objects and relationships, each possibly described by a set of features, and extracts multi-Type clusters that are subsequently exploited to predict new ncRNA-disease associations. The extracted clusters are overlapping, hierarchically organized, involve entities of different types, and allow LP-HCLUS to catch multiple roles of ncRNAs in diseases at different levels of granularity. Our experimental evaluation, performed on heterogeneous attributed networks consisting of microRNAs, lncRNAs, diseases, genes and their known relationships, shows that LP-HCLUS is able to obtain better results with respect to existing approaches. The biological relevance of the obtained results was evaluated according to both quantitative (i.e., TPR@k, Areas Under the TPR@k, ROC and Precision-Recall curves) and qualitative (i.e., according to the consultation of the existing literature) criteria. Conclusions: The obtained results prove the utility of LP-HCLUS to conduct robust predictive studies on the biological role of ncRNAs in human diseases. The produced predictions can therefore be reliably considered as new, previously unknown, relationships among ncRNAs and diseases.",
                "authors": [
                    {
                        "name": "Barracchia E.P."
                    },
                    {
                        "name": "Ceci M."
                    },
                    {
                        "name": "D'Elia D."
                    },
                    {
                        "name": "Pio G."
                    }
                ],
                "citationCount": 17,
                "date": "2020-02-24T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Prediction of new associations between ncRNAs and diseases exploiting multi-Type hierarchical clustering"
            },
            "pmcid": "PMC7041288",
            "pmid": "32093606"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        }
    ]
}
