{"credit":[{"name":"bils.se","typeEntity":"Institute","typeRoles":["Provider"]},{"email":"jenny.forshed@ki.se","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"http://forshed.se/jenny/index.php?n=Research.SoftwareAmpCode"}],"function":[{"input":[{"data":{"term":"Sequence set (protein)","uri":"http://edamontology.org/data_1233"}}],"operation":[{"term":"Sequencing quality control","uri":"http://edamontology.org/operation_3218"}],"output":[{"data":{"term":"Sequence features","uri":"http://edamontology.org/data_1255"}}]}],"labels":{"language":["MATLAB"],"operatingSystem":["Linux","Windows","Mac"],"toolType":["Desktop application"],"topic":[{"term":"Sequence analysis","uri":"http://edamontology.org/topic_0080"}]},"publication":[{"abstract":"We present a tool to improve quantitative accuracy and precision in mass spectrometry based on shotgun proteomics: protein quantification by peptide quality control, PQPQ. The method is based on the assumption that the quantitative pattern of peptides derived from one protein will correlate over several samples. Dissonant patterns arise either from outlier peptides or because of the presence of different protein species. By correlation analysis, protein quantification by peptide quality control identifies and excludes outliers and detects the existence of different protein species. Alternative protein species are then quantified separately. By validating the algorithm on seven data sets related to different cancer studies we show that data processing by protein quantification by peptide quality control improves the information output from shotgun proteomics. Data from two labeling procedures and three different instrumental platforms was included in the evaluation. With this unique method using both peptide sequence data and quantitative data we can improve the quantitative accuracy and precision on the protein level and detect different protein species. © 2011 by The American Society for Biochemistry and Molecular Biology, Inc.","authors":["Forshed J.","Johansson H.J.","Pernemalm M.","Branca R.M.M.","Sandberg A.","Lehtio J."],"cit_count":15,"doi":"10.1074/mcp.M111.010264","journal":"Molecular and Cellular Proteomics","title":"Enhanced information output from shotgun proteomics data by protein quantification and peptide quality control (PQPQ)","type":"Primary","year":"2011-10-01"}],"summary":{"biotoolsCURIE":"biotools:pqpq","biotoolsID":"pqpq","description":"Matlab code and test data for protein quantification by peptide quality control.","homepage":"http://forshed.se/jenny/index.php?n=Research.SoftwareAmpCode","name":"PQPQ","version":["1"]}}