{
    "accessibility": "Open access",
    "additionDate": "2022-08-16T15:21:02.421491Z",
    "biotoolsCURIE": "biotools:thermobase",
    "biotoolsID": "thermobase",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "juldigiacomo@gmail.com",
            "name": "Juliana DiGiacomo",
            "orcidid": "https://orcid.org/0000-0001-6584-9855",
            "typeEntity": "Person"
        },
        {
            "name": "Alfonso Davila"
        },
        {
            "name": "Christopher McKay"
        }
    ],
    "description": "A database of the phylogeny and physiology of thermophilic and hyperthermophilic organisms.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Formatting",
                    "uri": "http://edamontology.org/operation_0335"
                },
                {
                    "term": "Sorting",
                    "uri": "http://edamontology.org/operation_3802"
                }
            ]
        }
    ],
    "homepage": "http://togodb.org/db/thermobase",
    "lastUpdate": "2022-08-16T15:21:02.425597Z",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "http://togodb.org/sparql/thermobase"
        }
    ],
    "name": "ThermoBase",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PONE.0268253",
            "metadata": {
                "abstract": "Copyright: This is an open access article, free of all copyright, and may be freely reproduced, distributed, transmitted, modified, built upon, or otherwise used by anyone for any lawful purpose. The work is made available under the Creative Commons CC0 public domain dedication.Thermophiles and hyperthermophiles are those organisms which grow at high temperature (> 40◦C). The unusual properties of these organisms have received interest in multiple fields of biological research, and have found applications in biotechnology, especially in industrial processes. However, there are few listings of thermophilic and hyperthermophilic organisms and their relevant environmental and physiological data. Such repositories can be used to standardize definitions of thermophile and hyperthermophile limits and tolerances and would mitigate the need for extracting organism data from diverse literature sources across multiple, sometimes loosely related, research fields. Therefore, we have developed ThermoBase, a web-based and freely available database which currently houses comprehensive descriptions for 1238 thermophilic or hyperthermophilic organisms. ThermoBase reports taxonomic, metabolic, environmental, experimental, and physiological information in addition to literature resources. This includes parameters such as coupling ions for chemiosmosis, optimal pH and range, optimal temperature and range, optimal pressure, and optimal salinity. The database interface allows for search features and sorting of parameters. As such, it is the goal of ThermoBase to facilitate and expedite hypothesis generation, literature research, and understanding relating to thermophiles and hyperthermophiles within the scientific community in an accessible and centralized repository. ThermoBase is freely available online at the Astrobiology Habitable Environments Database (AHED; https://ahed.nasa.gov), at the Database Center for Life Science (TogoDB; http://togodb.org/db/ thermobase), and in the S1 File.",
                "authors": [
                    {
                        "name": "Davila A."
                    },
                    {
                        "name": "DiGiacomo J."
                    },
                    {
                        "name": "McKay C."
                    }
                ],
                "date": "2022-05-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "ThermoBase: A database of the phylogeny and physiology of thermophilic and hyperthermophilic organisms"
            },
            "pmcid": "PMC9089862",
            "pmid": "35536846"
        }
    ],
    "toolType": [
        "Database portal",
        "Web application"
    ],
    "topic": [
        {
            "term": "Biotechnology",
            "uri": "http://edamontology.org/topic_3297"
        },
        {
            "term": "Endocrinology and metabolism",
            "uri": "http://edamontology.org/topic_3407"
        },
        {
            "term": "Literature and language",
            "uri": "http://edamontology.org/topic_3068"
        },
        {
            "term": "Phylogeny",
            "uri": "http://edamontology.org/topic_0084"
        },
        {
            "term": "Physiology",
            "uri": "http://edamontology.org/topic_3300"
        }
    ],
    "validated": 1
}
