{
    "additionDate": "2017-12-18T00:07:30Z",
    "biotoolsCURIE": "biotools:haarseg",
    "biotoolsID": "haarseg",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://webee.technion.ac.il/people/YoninaEldar/"
        }
    ],
    "description": "HaarSeg is a segmentation algorithm for tiling microarrays.HaarSeg identifies statistically significant breakpoints in the data, using the maxima of the Haar wavelet transform, and segments accordingly.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Microarray data analysis",
                    "uri": "http://edamontology.org/operation_2495"
                }
            ]
        }
    ],
    "homepage": "http://webee.technion.ac.il/people/YoninaEldar/Info/software/HaarSeg.htm",
    "language": [
        "R",
        "MATLAB"
    ],
    "lastUpdate": "2018-12-10T12:58:57Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/haarseg-1-2-fast-flexible-microarray-segmentation.html"
        }
    ],
    "name": "HaarSeg",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btn272",
            "metadata": {
                "abstract": "Motivation: Array Comparative Genomic Hybridization (aCGH) is used to scan the entire genome for variations in DNA copy number. A central task in the analysis of aCGH data is the segmentation into groups of probes sharing the same DNA copy number. Some well known segmentation methods suffer from very long running times, preventing interactive data analysis. Results: We suggest a new segmentation method based on wavelet decomposition and thresholding, which detects significant breakpoints in the data. Our algorithm is over 1000 times faster than leading approaches, with similar performance. Another key advantage of the proposed method is its simplicity and flexibility. Due to its intuitive structure, it can be easily generalized to incorporate several types of side information. Here, we consider two extensions which include side information indicating the reliability of each measurement, and compensating for a changing variability in the measurement noise. The resulting algorithm outperforms existing methods, both in terms of speed and performance, when applied on real high density CGH data. © The Author 2008. Published by Oxford University Press. All rights reserved.",
                "authors": [
                    {
                        "name": "Ben-Yaacov E."
                    },
                    {
                        "name": "Eldar Y.C."
                    }
                ],
                "citationCount": 60,
                "date": "2008-08-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "A fast and flexible method for the segmentation of aCGH data"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Microarrays",
            "uri": "http://edamontology.org/topic_3518"
        }
    ],
    "validated": 1,
    "version": [
        "1.2"
    ]
}