{
    "additionDate": "2021-01-18T08:31:53Z",
    "biotoolsCURIE": "biotools:gazer",
    "biotoolsID": "gazer",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "jason-geller@uiowa.edu",
            "name": "Jason Geller",
            "typeEntity": "Person"
        }
    ],
    "description": "A Package for Processing Gaze Position and Pupil Size Data.\n\ngazeR:A package to analyze gaze position and pupil size data.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                },
                {
                    "term": "Read pre-processing",
                    "uri": "http://edamontology.org/operation_3219"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://github.com/dmirman/gazer",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-01-22T17:47:31Z",
    "name": "gazeR",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.3758/S13428-020-01374-8",
            "metadata": {
                "abstract": "© 2020, The Psychonomic Society, Inc.Eye-tracking is widely used throughout the scientific community, from vision science and psycholinguistics to marketing and human-computer interaction. Surprisingly, there is little consistency and transparency in preprocessing steps, making replicability and reproducibility difficult. To increase replicability, reproducibility, and transparency, a package in R (a free and widely used statistical programming environment) called gazeR was created to read and preprocess two types of data: gaze position and pupil size. For gaze position data, gazeR has functions for reading in raw eye-tracking data, formatting it for analysis, converting from gaze coordinates to areas of interest, and binning and aggregating data. For data from pupillometry studies, the gazeR package has functions for reading in and merging multiple raw pupil data files, removing observations with too much missing data, eliminating artifacts, blink identification and interpolation, subtractive baseline correction, and binning and aggregating data. The package is open-source and freely available for download and installation: https://github.com/dmirman/gazer. We provide step-by-step analyses of data from two tasks exemplifying the package’s capabilities.",
                "authors": [
                    {
                        "name": "Geller J."
                    },
                    {
                        "name": "Winn M.B."
                    },
                    {
                        "name": "Mahr T."
                    },
                    {
                        "name": "Mirman D."
                    }
                ],
                "citationCount": 2,
                "date": "2020-10-01T00:00:00Z",
                "journal": "Behavior Research Methods",
                "title": "GazeR: A Package for Processing Gaze Position and Pupil Size Data"
            },
            "pmcid": "PMC7544668",
            "pmid": "32291732"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Literature and language",
            "uri": "http://edamontology.org/topic_3068"
        }
    ],
    "validated": 1
}