{
    "additionDate": "2021-01-18T11:23:18Z",
    "biotoolsCURIE": "biotools:etholoop",
    "biotoolsID": "etholoop",
    "confidence_flag": "tool",
    "credit": [
        {
            "name": "Daniel Huber",
            "typeEntity": "Person"
        }
    ],
    "description": "EthoLoop is a framework for studying the neuroethology of freely roaming animals. Combining real-time optical tracking and behavioral analysis with remote-controlled stimulus-reward boxes, this system allows direct interactions with animals in their habitat. EthoLoop continuously provides close-up views of the tracked individuals and thus allows high-resolution behavioral analysis using deep-learning methods.",
    "download": [
        {
            "type": "Downloads page",
            "url": "http://www.etholoop.org/Downloads.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Trajectory visualization",
                    "uri": "http://edamontology.org/operation_3890"
                }
            ]
        }
    ],
    "homepage": "http://www.etholoop.org/",
    "language": [
        "C++"
    ],
    "lastUpdate": "2021-03-08T09:44:00Z",
    "license": "LGPL-3.0",
    "name": "EthoLoop",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1038/S41592-020-0961-2",
            "metadata": {
                "abstract": "© 2020, The Author(s), under exclusive licence to Springer Nature America, Inc.Accurate tracking and analysis of animal behavior is crucial for modern systems neuroscience. However, following freely moving animals in naturalistic, three-dimensional (3D) or nocturnal environments remains a major challenge. Here, we present EthoLoop, a framework for studying the neuroethology of freely roaming animals. Combining real-time optical tracking and behavioral analysis with remote-controlled stimulus-reward boxes, this system allows direct interactions with animals in their habitat. EthoLoop continuously provides close-up views of the tracked individuals and thus allows high-resolution behavioral analysis using deep-learning methods. The behaviors detected on the fly can be automatically reinforced either by classical conditioning or by optogenetic stimulation via wirelessly controlled portable devices. Finally, by combining 3D tracking with wireless neurophysiology we demonstrate the existence of place-cell-like activity in the hippocampus of freely moving primates. Taken together, we show that the EthoLoop framework enables interactive, well-controlled and reproducible neuroethological studies in large-field naturalistic settings.",
                "authors": [
                    {
                        "name": "Nourizonoz A."
                    },
                    {
                        "name": "Zimmermann R."
                    },
                    {
                        "name": "Ho C.L.A."
                    },
                    {
                        "name": "Pellat S."
                    },
                    {
                        "name": "Ormen Y."
                    },
                    {
                        "name": "Prevost-Solie C."
                    },
                    {
                        "name": "Reymond G."
                    },
                    {
                        "name": "Pifferi F."
                    },
                    {
                        "name": "Aujard F."
                    },
                    {
                        "name": "Herrel A."
                    },
                    {
                        "name": "Huber D."
                    }
                ],
                "citationCount": 4,
                "date": "2020-10-01T00:00:00Z",
                "journal": "Nature Methods",
                "title": "EthoLoop: automated closed-loop neuroethology in naturalistic environments"
            },
            "pmid": "32994566"
        }
    ],
    "toolType": [
        "Workbench"
    ],
    "topic": [
        {
            "term": "Neurobiology",
            "uri": "http://edamontology.org/topic_3304"
        },
        {
            "term": "Zoology",
            "uri": "http://edamontology.org/topic_3500"
        },
        {
            "term": "Animal study",
            "uri": "http://edamontology.org/topic_3679"
        }
    ]
}