{
    "accessibility": "Open access",
    "additionDate": "2019-05-27T14:31:45Z",
    "biotoolsCURIE": "biotools:bhrcr",
    "biotoolsID": "bhrcr",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "cfogarty@mit.edu",
            "name": "Colin B. Fogarty <cfogarty at mit.edu",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "R software package for a Bayesian hierarchical regression model.",
    "download": [
        {
            "type": "Source code",
            "url": "https://github.com/cran/bhrcr"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Phasing",
                    "uri": "http://edamontology.org/operation_3454"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "https://cran.r-project.org/package=bhrcr",
    "language": [
        "R"
    ],
    "lastUpdate": "2020-06-16T10:55:22Z",
    "license": "GPL-3.0",
    "maturity": "Mature",
    "name": "bhrcr",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "Ruta",
    "publication": [
        {
            "doi": "10.1186/s12936-018-2631-8",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Emerging resistance to anti-malarial drugs has led malaria researchers to investigate what covariates (parasite and host factors) are associated with resistance. In this regard, investigation of how covariates impact malaria parasites clearance is often performed using a two-stage approach in which the WWARN Parasite Clearance Estimator or PCE is used to estimate parasite clearance rates and then the estimated parasite clearance is regressed on the covariates. However, the recently developed Bayesian Clearance Estimator instead leads to more accurate results for hierarchial regression modelling which motivated the authors to implement the method as an R package, called \"bhrcr\". Methods: Given malaria parasite clearance profiles of a set of patients, the \"bhrcr\" package performs Bayesian hierarchical regression to estimate malaria parasite clearance rates along with the effect of covariates on them in the presence of \"lag\" and \"tail\" phases. In particular, the model performs a linear regression of the log clearance rates on covariates to estimate the effects within a Bayesian hierarchical framework. All posterior inferences are obtained by a \"Markov Chain Monte Carlo\" based sampling scheme which forms the core of the package. Results: The \"bhrcr\" package can be utilized to study malaria parasite clearance data, and specifically, how covariates affect parasite clearance rates. In addition to estimating the clearance rates and the impact of covariates on them, the \"bhrcr\" package provides tools to calculate the WWARN PCE estimates of the parasite clearance rates as well. The fitted Bayesian model to the clearance profile of each individual, as well as the WWARN PCE estimates, can also be plotted by this package. Conclusions: This paper explains the Bayesian Clearance Estimator for malaria researchers including describing the freely available software, thus making these methods accessible and practical for modelling covariates' effects on parasite clearance rates.",
                "authors": [
                    {
                        "name": "Sharifi-Malvajerdi S."
                    },
                    {
                        "name": "Zhu F."
                    },
                    {
                        "name": "Fogarty C.B."
                    },
                    {
                        "name": "Fay M.P."
                    },
                    {
                        "name": "Fairhurst R.M."
                    },
                    {
                        "name": "Flegg J.A."
                    },
                    {
                        "name": "Stepniewska K."
                    },
                    {
                        "name": "Small D.S."
                    }
                ],
                "citationCount": 2,
                "date": "2019-01-05T00:00:00Z",
                "journal": "Malaria Journal",
                "title": "Malaria parasite clearance rate regression: An R software package for a Bayesian hierarchical regression model 01 Mathematical Sciences 0104 Statistics 11 Medical and Health Sciences 1108 Medical Microbiology"
            },
            "pmcid": "PMC6321728",
            "pmid": "30611278",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Parasitology",
            "uri": "http://edamontology.org/topic_3302"
        },
        {
            "term": "Zoology",
            "uri": "http://edamontology.org/topic_3500"
        }
    ],
    "validated": 1,
    "version": [
        "1.0.3"
    ]
}