{
    "additionDate": "2024-01-02T15:47:02.427280Z",
    "biotoolsCURIE": "biotools:cancerhervdb",
    "biotoolsID": "cancerhervdb",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "scheurer@bcm.edu",
            "name": "Michael E. Scheurer",
            "typeEntity": "Person"
        }
    ],
    "description": "Human endogenous retrovirus (HERV) expression database for human cancer accelerates studies of the retrovirome and predictions for HERV-based therapies.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                }
            ]
        }
    ],
    "homepage": "https://erikstricker.shinyapps.io/cancerHERVdb/",
    "language": [
        "R"
    ],
    "lastUpdate": "2024-01-02T15:47:02.429851Z",
    "name": "CancerHERVdb",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1128/JVI.00059-23",
            "metadata": {
                "abstract": "In this study, we sought to create a database summarizing the expression of human endogenous retroviruses (HERVs) in various human cancers. HERVs are suitable therapeutic targets due to their abundance in the human genome, overexpression in various malignancies, and involvement in various cancer pathways. We identified articles on HERVs from PubMed and then prescreened and automatically categorized them using the portable document format (PDF) data extractor (PDE) R package. We discovered 196 primary research articles with HERV expression data from cancer tissues or cancer cell lines. HERV RNA and protein expression was reported in brain, breast, cervical, colorectal, endocrine, gastrointestinal, kidney/renal/pelvis, liver, lung, genital, oral cavity, pharynx, ovary, pancreas, prostate, skin, testicular, urinary/bladder, and uterus cancers, leukemias, lymphomas, and myelomas. Additionally, we discovered reports of HERV RNA-only overexpression in soft tissue cancers including heart, thyroid, bone, and joint cancers. The CancerHERVdb database is hosted in the form of interactive visualizations of the expression data and a summary data table at https://erikstricker.shinyapps.io/cancerHERVdb/. The user can filter the findings according to cancer type, HERV family, HERV gene, or a combination thereof and easily export the results with the corresponding reference list. In our report, we provide examples of potential uses of the CancerHERVdb, such as identification of cancers suitable for off-target treatment with the multiple sclerosis-associated retrovirus (MSRV)-Env-targeting antibody GNbAC1 (now named temelimab) currently in phase 2b clinical trials for multiple sclerosis or the discovery of cancers overexpressing HERV-H long terminal repeat-associating 2 (HHLA2), a newly emerging immune checkpoint. In summary, the CancerHERVdb allows cross-study comparisons, encourages data exploration, and informs about potential off-target effects of HERV-targeting treatments. IMPORTANCE Human endogenous retroviruses (HERVs), which in the past have inserted themselves in various regions of the human genome, are to various degrees activated in virtually every cancer type. While a centralized naming system and resources summarizing HERV levels in cancers are lacking, the CancerHERVdb database provides a consolidated resource for cross-study comparisons, data exploration, and targeted searches of HERV activation. The user can access data extracted from hundreds of articles spanning 25 human cancer categories. Therefore, the CancerHERVdb database can aid in the identification of prognostic and risk markers, drivers of cancer, tumor-specific targets, multicancer spanning signals, and targets for immune therapies. Consequently, the CancerHERVdb database is of direct relevance for clinical as well as basic research.",
                "authors": [
                    {
                        "name": "Peckham-Gregory E.C."
                    },
                    {
                        "name": "Scheurer M.E."
                    },
                    {
                        "name": "Stricker E."
                    }
                ],
                "date": "2023-06-01T00:00:00Z",
                "journal": "Journal of Virology",
                "title": "CancerHERVdb: Human Endogenous Retrovirus (HERV) Expression Database for Human Cancer Accelerates Studies of the Retrovirome and Predictions for HERV-Based Therapies"
            },
            "pmcid": "PMC10308937",
            "pmid": "37255431"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Human biology",
            "uri": "http://edamontology.org/topic_2815"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Preclinical and clinical studies",
            "uri": "http://edamontology.org/topic_3379"
        }
    ]
}
