{
    "additionDate": "2020-01-14T09:22:31Z",
    "biotoolsCURIE": "biotools:OncoSim_OncoWiki",
    "biotoolsID": "OncoSim_OncoWiki",
    "confidence_flag": "high",
    "credit": [
        {
            "email": "p.schoenborn@plymouth.ac.uk",
            "name": "Priska Schoenborn",
            "typeEntity": "Person"
        },
        {
            "email": "robert.belshaw@plymouth.ac.uk",
            "name": "Robert Belshaw",
            "orcidid": "https://orcid.org/0000-0001-6234-3947",
            "typeEntity": "Person"
        }
    ],
    "description": "an authentic learning approach to teaching cancer genomics.\n\nOn this site you can both (a) make and upload, and (b) download and analyse simulated patient case studies.\n\n||| COMMON LINK WITH (PUB. & NAME DIFFERENT) bio.tools/chooch (CO.UK), bio.tools/dgw (CO.UK), bio.tools/dna_for_windows (CO.UK), bio.tools/translatorx (CO.UK), bio.tools/polygenicpathways (CO.UK).\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'OncoSim'",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Information extraction",
                    "uri": "http://edamontology.org/operation_3907"
                },
                {
                    "term": "Scaffolding",
                    "uri": "http://edamontology.org/operation_3216"
                },
                {
                    "term": "Anonymisation",
                    "uri": "http://edamontology.org/operation_3283"
                }
            ]
        }
    ],
    "homepage": "https://www.oncowiki.co.uk",
    "lastUpdate": "2020-01-14T09:22:31Z",
    "name": "OncoSim OncoWiki",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12909-019-1812-7",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Personalised medicine is rapidly changing the clinical environment, especially in regard to the management of cancer. However, for the large part, methods used to educate undergraduate students as future biomedical scientists and medical doctors have not reflected these changes. In order to make effective use of advances in cancer genomic knowledge, there is a need to expose students to the challenges of genomic medicine and to do so in a manner that makes this complex information accessible. Methods: The teaching method developed, OncoSim, is a scaffolded 'Personal Research' module option for final year biomedical undergraduate students. It uses an authentic learning approach to teach cancer genomics via simulated cancer patient case studies that have identifiable potential therapeutic targets with associated drug therapies (so-called targeted therapy/precision oncology). In addition, these simulated case studies can be uploaded to a dedicated learning website (OncoWiki) where they can be freely downloaded and used to teach medical students the principles of targeted therapy. A preliminary evaluation of OncoSim was carried out using 3 research tools: (1) online questionnaires; (2) semi-structured interviews; and (3) analysis of whole cohort mark ranges. Thematic analysis was used to code and categorise interview data. Results: The teaching materials for OncoSim and the OncoWiki site are freely accessible at https://www.oncowiki.co.uk. Questionnaire data and comparison of whole cohort marks showed OncoSim was at least as effective as alternative choices, and suggested OncoSim provided a valued alternative to traditional laboratory-based projects. No barriers to receptiveness were found. Interview analysis provided 5 broad themes (authentic learning experience; individual challenges; interest in cancer; positive learning experience; supportive structure) supporting the authentic learning aspect of the project, the strong scaffolding provided and the overall effectiveness of the approach. Conclusions: Our preliminary, proof-of-concept, evaluation suggests that OncoSim will be effective in supporting the teaching of genomic medicine to undergraduate students. We plan and hope our study will encourage further formal evaluation in a larger cohort of students, including a control group. The OncoWiki site has the capacity to grow independently as future students create and upload simulated case studies for other students to then download and analyse.",
                "authors": [
                    {
                        "name": "Schoenborn P."
                    },
                    {
                        "name": "Osborne R."
                    },
                    {
                        "name": "Toms N."
                    },
                    {
                        "name": "Johnstone K."
                    },
                    {
                        "name": "Milsom C."
                    },
                    {
                        "name": "Muneer R."
                    },
                    {
                        "name": "Jarvis M.A."
                    },
                    {
                        "name": "Belshaw R."
                    }
                ],
                "date": "2019-11-07T00:00:00Z",
                "journal": "BMC Medical Education",
                "title": "OncoSim and OncoWiki: An authentic learning approach to teaching cancer genomics"
            },
            "pmcid": "PMC6836658",
            "pmid": "31699073"
        }
    ],
    "topic": [
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Personalised medicine",
            "uri": "http://edamontology.org/topic_3577"
        },
        {
            "term": "Surgery",
            "uri": "http://edamontology.org/topic_3421"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        }
    ]
}