{"credit":[{"name":"Benjamin Landsteiner","typeEntity":"Person","typeRoles":["Primary contact"],"url":"https://sourceforge.net/u/landstei/profile/"}],"function":[{"operation":[{"term":"Database search","uri":"http://edamontology.org/operation_2421"}]}],"labels":{"language":["Perl"],"operatingSystem":["Linux","Windows","Mac"],"toolType":["Web application"],"topic":[{"term":"Database management","uri":"http://edamontology.org/topic_3489"},{"term":"Proteins","uri":"http://edamontology.org/topic_0078"},{"term":"Computational biology","uri":"http://edamontology.org/topic_3307"}]},"publication":[{"abstract":"The Current Comparative Table (CCT) software program enables working biologists to automate customized bioinformatics searches, typically of remote sequence or HMM (hidden Markov model) databases. CCT currently supports BLAST, hmmpfam and other programs useful for gene and ortholog identification. The software is web based, has a BioPerl core and can be used remotely via a browser or locally on Mac OS X or Linux machines. CCT is particularly useful to scientists who study large sets of molecules in today's evolving information landscape because it color-codes all result files by age and highlights even tiny changes in sequence or annotation. By empowering non-bioinformaticians to automate custom searches and examine current results in context at a glance, CCT allows a remote database submission in the evening to influence the next morning's bench experiment. A demonstration of CCT is available at http://orb.public.stolaf.edu/CCTdemo and the open source software is freely available from http://sourceforge.net/projects/orb-cct. © 2005 Oxford University Press.","authors":["Landsteiner B.R.","Olson M.R.","Rutherford R."],"cit_count":1,"journal":"Nucleic Acids Research","pmid":"15980582","title":"Current Comparative Table (CCT) automates customized searches of dynamic biological databases","year":"2005-07-01"}],"summary":{"biotoolsCURIE":"biotools:cct","biotoolsID":"cct","description":"CCT (Current Comparative Table) is a software package that you can install and set-up on your own system to help you to maintain and search databases.","homepage":"http://sourceforge.net/projects/orb-cct","name":"CCT"}}