{
    "additionDate": "2017-12-06T18:14:42Z",
    "biotoolsCURIE": "biotools:metanetx",
    "biotoolsID": "metanetx",
    "credit": [
        {
            "email": "help@metanetx.org",
            "name": "MetaNetX Support",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "MetaNetX/MNXref allows to access, analyse and manipulate genome-scale metabolic networks as well as biochemical pathways. It consistently integrates data from various public resources and makes the data accessible in a standardized format using a common namespace. Models can be interactively compared, analysed (e.g. detection of dead-end metabolites/reactions, flux balance analysis or simulation of reaction/gene knockouts), manipulated and exported. Users can upload their own metabolic models.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://www.metanetx.org/mnxdoc/help.html"
        }
    ],
    "download": [
        {
            "type": "Downloads page",
            "url": "https://www.metanetx.org/mnxdoc/mnxref.html"
        }
    ],
    "editPermission": {
        "authors": [
            "proteomics.bio.tools",
            "smoretti"
        ],
        "type": "group"
    },
    "elixirNode": [
        "Switzerland"
    ],
    "elixirPlatform": [
        "Tools"
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Database comparison",
                    "uri": "http://edamontology.org/operation_3561"
                },
                {
                    "term": "ID mapping",
                    "uri": "http://edamontology.org/operation_3282"
                },
                {
                    "term": "Pathway or network comparison",
                    "uri": "http://edamontology.org/operation_0277"
                },
                {
                    "term": "Pathway or network prediction",
                    "uri": "http://edamontology.org/operation_3439"
                }
            ]
        }
    ],
    "homepage": "https://metanetx.org/",
    "lastUpdate": "2021-11-09T13:46:30.703663Z",
    "license": "CC-BY-4.0",
    "name": "MetaNetX",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "metanetx",
    "publication": [
        {
            "doi": "10.1093/bib/bbs058",
            "metadata": {
                "abstract": "Genome-scale metabolic network reconstructions are now routinely used in the study of metabolic pathways, their evolution and design. The development of such reconstructions involves the integration of information on reactions and metabolites from the scientific literature as well as public databases and existing genome-scale metabolic models. The reconciliation of discrepancies between data from these sources generally requires significant manual curation, which constitutes a major obstacle in efforts to develop and apply genome-scalemetabolic network reconstructions. In this work, we discuss some of the major difficulties encountered in the mapping and reconciliation of metabolic resources and review three recent initiatives that aim to accelerate this process, namely BKM-react, MetRxn and MNXref (presented in this article). Each of these resources provides a pre-compiled reconciliation of many of themost commonly usedmetabolic resources. By reducing the time required for manual curation of metabolite and reaction discrepancies, these resources aim to accelerate the development and application of high-quality genome-scale metabolic network reconstructions and models. © The Author 2012. Published by Oxford University Press.",
                "authors": [
                    {
                        "name": "Bernard T."
                    },
                    {
                        "name": "Bridge A."
                    },
                    {
                        "name": "Moretti S."
                    },
                    {
                        "name": "Morgat A."
                    },
                    {
                        "name": "Pagni M."
                    },
                    {
                        "name": "Xenarios I."
                    }
                ],
                "citationCount": 41,
                "date": "2014-01-01T00:00:00Z",
                "journal": "Briefings in Bioinformatics",
                "title": "Reconciliation of metabolites and biochemical reactions for metabolic networks"
            }
        },
        {
            "doi": "10.1093/bioinformatics/btt036",
            "metadata": {
                "abstract": "MetaNetX.org is a website for accessing, analysing and manipulating genome-scale metabolic networks (GSMs) as well as biochemical pathways. It consistently integrates data from various public resources and makes the data accessible in a standardized format using a common namespace. Currently, it provides access to hundreds of GSMs and pathways that can be interactively compared (two or more), analysed (e.g. detection of dead-end metabolites and reactions, flux balance analysis or simulation of reaction and gene knockouts), manipulated and exported. Users can also upload their own metabolic models, choose to automatically map them into the common namespace and subsequently make use of the website's functionality. © The Author 2013.",
                "authors": [
                    {
                        "name": "Bernard T."
                    },
                    {
                        "name": "Ganter M."
                    },
                    {
                        "name": "Moretti S."
                    },
                    {
                        "name": "Pagni M."
                    },
                    {
                        "name": "Stelling"
                    }
                ],
                "citationCount": 62,
                "date": "2013-03-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "MetaNetX.org: A website and repository for accessing, analysing and manipulating metabolic networks"
            }
        },
        {
            "doi": "10.1093/nar/gkaa992",
            "metadata": {
                "abstract": "© The Author(s) 2020. Published by Oxford University Press on behalf of Nucleic Acids Research. This is an Open Access article distributed under the terms of the Creative Commons Attribution License (http://creativecommons.org/licenses/by/4.0/), which permits unrestricted reuse, distribution, and reproduction in any medium, provided the original work is properly cited.MetaNetX/MNXref is a reconciliation of metabolites and biochemical reactions providing cross-links between major public biochemistry and Genome-Scale Metabolic Network (GSMN) databases. The new release brings several improvements with respect to the quality of the reconciliation, with particular attention dedicated to preserving the intrinsic properties of GSMN models. The MetaNetX website (https://www.metanetx.org/) provides access to the full database and online services. A major improvement is for mapping of user-provided GSMNs to MXN-ref, which now provides diagnostic messages about model content. In addition to the website and flat files, the resource can now be accessed through a SPARQL endpoint (https://rdf.metanetx.org).",
                "authors": [
                    {
                        "name": "Ibberson M."
                    },
                    {
                        "name": "Mehl F."
                    },
                    {
                        "name": "Moretti S."
                    },
                    {
                        "name": "Pagni M."
                    },
                    {
                        "name": "Tran V.D.T."
                    }
                ],
                "citationCount": 8,
                "date": "2021-01-08T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "MetaNetX/MNXref: Unified namespace for metabolites and biochemical reactions in the context of metabolic models"
            }
        },
        {
            "doi": "10.1093/nar/gkv1117",
            "metadata": {
                "abstract": "© The Author(s) 2015.MetaNetX is a repository of genome-scale metabolic networks (GSMNs) and biochemical pathways from a number of major resources imported into a common namespace of chemical compounds, reactions, cellular compartments - namely MNXref - and proteins. The MetaNetX.org website (http://www.metanetx.org/) provides access to these integrated data as well as a variety of tools that allow users to import their own GSMNs, map them to the MNXref reconciliation, and manipulate, compare, analyze, simulate (using flux balance analysis) and export the resulting GSMNs. MNXref and MetaNetX are regularly updated and freely available.",
                "authors": [
                    {
                        "name": "Bridge A."
                    },
                    {
                        "name": "Martin O."
                    },
                    {
                        "name": "Moretti S."
                    },
                    {
                        "name": "Morgat A."
                    },
                    {
                        "name": "Pagni M."
                    },
                    {
                        "name": "Van Du Tran T."
                    }
                ],
                "citationCount": 86,
                "date": "2016-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "MetaNetX/MNXref - Reconciliation of metabolites and biochemical reactions to bring together genome-scale metabolic networks"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Database portal",
        "Web application"
    ],
    "topic": [
        {
            "term": "Biochemistry",
            "uri": "http://edamontology.org/topic_3292"
        },
        {
            "term": "Cheminformatics",
            "uri": "http://edamontology.org/topic_2258"
        },
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Systems biology",
            "uri": "http://edamontology.org/topic_2259"
        }
    ],
    "validated": 1
}
