{
    "additionDate": "2015-01-21T13:29:26Z",
    "biotoolsCURIE": "biotools:vardom",
    "biotoolsID": "vardom",
    "credit": [
        {
            "name": "CBS",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        },
        {
            "email": "gorm@cbs.dtu.dk",
            "name": "Anders Gorm Pedersen",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Composition and classification analysis of the malaria antigen family PfEMP1.",
    "documentation": [
        {
            "type": "General",
            "url": "http://toolname.org/docs"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Sequence",
                        "uri": "http://edamontology.org/data_2044"
                    },
                    "format": [
                        {
                            "term": "FASTA",
                            "uri": "http://edamontology.org/format_1929"
                        }
                    ]
                }
            ],
            "note": "predicts PfEMP1 domains and homology blocks",
            "operation": [
                {
                    "term": "Sequence classification",
                    "uri": "http://edamontology.org/operation_2995"
                },
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Sequence report",
                        "uri": "http://edamontology.org/data_2955"
                    },
                    "format": [
                        {
                            "term": "Binary format",
                            "uri": "http://edamontology.org/format_2333"
                        }
                    ]
                }
            ]
        }
    ],
    "homepage": "http://cbs.dtu.dk/services/VarDom/",
    "lastUpdate": "2018-12-10T12:58:49Z",
    "license": "Other",
    "name": "VarDom",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "CBS",
    "publication": [
        {
            "doi": "10.1371/journal.pcbi.1000933",
            "metadata": {
                "abstract": "The var gene encoded hyper-variable Plasmodium falciparum erythrocyte membrane protein 1 (PfEMP1) family mediates cytoadhesion of infected erythrocytes to human endothelium. Antibodies blocking cytoadhesion are important mediators of malaria immunity acquired by endemic populations. The development of a PfEMP1 based vaccine mimicking natural acquired immunity depends on a thorough understanding of the evolved PfEMP1 diversity, balancing antigenic variation against conserved receptor binding affinities. This study redefines and reclassifies the domains of PfEMP1 from seven genomes. Analysis of domains in 399 different PfEMP1 sequences allowed identification of several novel domain classes, and a high degree of PfEMP1 domain compositional order, including conserved domain cassettes not always associated with the established group A-E division of PfEMP1. A novel iterative homology block (HB) detection method was applied, allowing identification of 628 conserved minimal PfEMP1 building blocks, describing on average 83% of a PfEMP1 sequence. Using the HBs, similarities between domain classes were determined, and Duffy binding-like (DBL) domain subclasses were found in many cases to be hybrids of major domain classes. Related to this, a recombination hotspot was uncovered between DBL subdomains S2 and S3. The VarDom server is introduced, from which information on domain classes and homology blocks can be retrieved, and new sequences can be classified. Several conserved sequence elements were found, including: (1) residues conserved in all DBL domains predicted to interact and hold together the three DBL subdomains, (2) potential integrin binding sites in DBLα domains, (3) an acylation motif conserved in group A var genes suggesting Nterminal N-myristoylation, (4) PfEMP1 inter-domain regions proposed to be elastic disordered structures, and (5) several conserved predicted phosphorylation sites. Ideally, this comprehensive categorization of PfEMP1 will provide a platform for future studies on var/PfEMP1 expression and function. © 2010 Rask et al.",
                "authors": [
                    {
                        "name": "Rask T.S."
                    },
                    {
                        "name": "Hansen D.A."
                    },
                    {
                        "name": "Theander T.G."
                    },
                    {
                        "name": "Pedersen A.G."
                    },
                    {
                        "name": "Lavstsen T."
                    }
                ],
                "citationCount": 168,
                "date": "2010-09-01T00:00:00Z",
                "journal": "PLoS Computational Biology",
                "title": "Plasmodium falciparum erythrocyte membrane protein 1 diversity in seven genomes - divide and conquer"
            },
            "type": "Primary"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        }
    ],
    "validated": 1,
    "version": [
        "1.0"
    ]
}