{
    "additionDate": "2020-03-06T15:11:54Z",
    "biotoolsCURIE": "biotools:Laniakea",
    "biotoolsID": "Laniakea",
    "credit": [
        {
            "email": "ma.tangaro@ibiom.cnr.it",
            "name": "Marco Antonio Tangaro",
            "orcidid": "https://orcid.org/0000-0003-3923-2266",
            "typeEntity": "Person",
            "typeRole": [
                "Developer"
            ]
        },
        {
            "name": "Giacinto Donvito",
            "orcidid": "https://orcid.org/0000-0002-0628-1080",
            "typeEntity": "Person",
            "typeRole": [
                "Contributor"
            ]
        },
        {
            "name": "Marica Antonacci",
            "orcidid": "https://orcid.org/0000-0002-2641-9403",
            "typeEntity": "Person",
            "typeRole": [
                "Contributor"
            ]
        },
        {
            "name": "Matteo Chiara",
            "orcidid": "https://orcid.org/0000-0003-3983-4961",
            "typeEntity": "Person",
            "typeRole": [
                "Contributor"
            ]
        },
        {
            "name": "Pietro Mandreoli",
            "orcidid": "https://orcid.org/0000-0002-7088-1283",
            "typeEntity": "Person",
            "typeRole": [
                "Developer"
            ]
        },
        {
            "name": "Graziano Pesole",
            "orcidid": "https://orcid.org/0000-0003-3663-0859",
            "typeEntity": "Person",
            "typeRole": [
                "Contributor"
            ]
        },
        {
            "email": "federico.zambelli@unimi.it",
            "name": "Federico Zambelli",
            "orcidid": "https://orcid.org/0000-0003-3487-4331",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "name": "ELIXIR-ITA-CNR",
            "typeEntity": "Institute",
            "typeRole": [
                "Maintainer"
            ]
        },
        {
            "name": "ELIXIR-ITA-INFN",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        }
    ],
    "description": "Laniakea is a complete software solution to set up a “Galaxy on-demand” Platform as a Service (PaaS). Building on the INDIGO-DataCloud software stack, Laniakea can be deployed over common cloud architectures usually supported both by public and private e-infrastructures. The user interacts with a Laniakea-based service through a simple front-end that allows a general setup of a Galaxy instance, then Laniakea takes care of the automatic deployment of the virtual hardware and the software components. At the end of the process, the user gains access with full administrative privileges to a private, production-grade, fully customisable, Galaxy virtual instance, and to the underlying virtual machine (VM).",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://laniakea.readthedocs.io/en/latest/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "elixirNode": [
        "Italy"
    ],
    "elixirPlatform": [
        "Compute"
    ],
    "homepage": "https://laniakea-elixir-it.github.io/",
    "lastUpdate": "2022-01-17T08:09:50.786960Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/Laniakea-elixir-it"
        }
    ],
    "maturity": "Mature",
    "name": "Laniakea",
    "owner": "ELIXIR-ITA-MILANO",
    "publication": [
        {
            "doi": "10.1093/gigascience/giaa033",
            "metadata": {
                "abstract": "© 2020 The Author(s) 2020.Background: While the popular workflow manager Galaxy is currently made available through several publicly accessible servers, there are scenarios where users can be better served by full administrative control over a private Galaxy instance, including, but not limited to, concerns about data privacy, customisation needs, prioritisation of particular job types, tools development, and training activities. In such cases, a cloud-based Galaxy virtual instance represents an alternative that equips the user with complete control over the Galaxy instance itself without the burden of the hardware and software infrastructure involved in running and maintaining a Galaxy server. Results: We present Laniakea, a complete software solution to set up a \"Galaxy on-demand\" platform as a service. Building on the INDIGO-DataCloud software stack, Laniakea can be deployed over common cloud architectures usually supported both by public and private e-infrastructures. The user interacts with a Laniakea-based service through a simple front-end that allows a general setup of a Galaxy instance, and then Laniakea takes care of the automatic deployment of the virtual hardware and the software components. At the end of the process, the user gains access with full administrative privileges to a private, production-grade, fully customisable, Galaxy virtual instance and to the underlying virtual machine (VM). Laniakea features deployment of single-server or cluster-backed Galaxy instances, sharing of reference data across multiple instances, data volume encryption, and support for VM image-based, Docker-based, and Ansible recipe-based Galaxy deployments. A Laniakea-based Galaxy on-demand service, named Laniakea@ReCaS, is currently hosted at the ELIXIR-IT ReCaS cloud facility. Conclusions: Laniakea offers to scientific e-infrastructures a complete and easy-to-use software solution to provide a Galaxy on-demand service to their users. Laniakea-based cloud services will help in making Galaxy more accessible to a broader user base by removing most of the burdens involved in deploying and running a Galaxy service. In turn, this will facilitate the adoption of Galaxy in scenarios where classic public instances do not represent an optimal solution. Finally, the implementation of Laniakea can be easily adapted and expanded to support different services and platforms beyond Galaxy.",
                "authors": [
                    {
                        "name": "Tangaro M.A."
                    },
                    {
                        "name": "Donvito G."
                    },
                    {
                        "name": "Antonacci M."
                    },
                    {
                        "name": "Chiara M."
                    },
                    {
                        "name": "Mandreoli P."
                    },
                    {
                        "name": "Pesole G."
                    },
                    {
                        "name": "Zambelli F."
                    }
                ],
                "citationCount": 5,
                "date": "2020-04-06T00:00:00Z",
                "journal": "GigaScience",
                "title": "Laniakea: An open solution to provide Galaxy \"on-demand\" instances over heterogeneous cloud infrastructures"
            },
            "type": [
                "Primary"
            ]
        },
        {
            "doi": "10.1186/S12859-021-04401-3",
            "metadata": {
                "abstract": "© 2021, The Author(s).Background: Improving the availability and usability of data and analytical tools is a critical precondition for further advancing modern biological and biomedical research. For instance, one of the many ramifications of the COVID-19 global pandemic has been to make even more evident the importance of having bioinformatics tools and data readily actionable by researchers through convenient access points and supported by adequate IT infrastructures. One of the most successful efforts in improving the availability and usability of bioinformatics tools and data is represented by the Galaxy workflow manager and its thriving community. In 2020 we introduced Laniakea, a software platform conceived to streamline the configuration and deployment of “on-demand” Galaxy instances over the cloud. By facilitating the set-up and configuration of Galaxy web servers, Laniakea provides researchers with a powerful and highly customisable platform for executing complex bioinformatics analyses. The system can be accessed through a dedicated and user-friendly web interface that allows the Galaxy web server’s initial configuration and deployment. Results: “Laniakea@ReCaS”, the first instance of a Laniakea-based service, is managed by ELIXIR-IT and was officially launched in February 2020, after about one year of development and testing that involved several users. Researchers can request access to Laniakea@ReCaS through an open-ended call for use-cases. Ten project proposals have been accepted since then, totalling 18 Galaxy on-demand virtual servers that employ ~ 100 CPUs, ~ 250 GB of RAM and ~ 5 TB of storage and serve several different communities and purposes. Herein, we present eight use cases demonstrating the versatility of the platform. Conclusions: During this first year of activity, the Laniakea-based service emerged as a flexible platform that facilitated the rapid development of bioinformatics tools, the efficient delivery of training activities, and the provision of public bioinformatics services in different settings, including food safety and clinical research. Laniakea@ReCaS provides a proof of concept of how enabling access to appropriate, reliable IT resources and ready-to-use bioinformatics tools can considerably streamline researchers’ work.",
                "authors": [
                    {
                        "name": "Tangaro M.A."
                    },
                    {
                        "name": "Mandreoli P."
                    },
                    {
                        "name": "Chiara M."
                    },
                    {
                        "name": "Donvito G."
                    },
                    {
                        "name": "Antonacci M."
                    },
                    {
                        "name": "Parisi A."
                    },
                    {
                        "name": "Bianco A."
                    },
                    {
                        "name": "Romano A."
                    },
                    {
                        "name": "Bianchi D.M."
                    },
                    {
                        "name": "Cangelosi D."
                    },
                    {
                        "name": "Uva P."
                    },
                    {
                        "name": "Molineris I."
                    },
                    {
                        "name": "Nosi V."
                    },
                    {
                        "name": "Calogero R.A."
                    },
                    {
                        "name": "Alessandri L."
                    },
                    {
                        "name": "Pedrini E."
                    },
                    {
                        "name": "Mordenti M."
                    },
                    {
                        "name": "Bonetti E."
                    },
                    {
                        "name": "Sangiorgi L."
                    },
                    {
                        "name": "Pesole G."
                    },
                    {
                        "name": "Zambelli F."
                    }
                ],
                "date": "2021-11-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Laniakea@ReCaS: exploring the potential of customisable Galaxy on-demand instances as a cloud-based service"
            },
            "pmcid": "PMC8574934",
            "pmid": "34749633",
            "type": [
                "Other"
            ]
        }
    ],
    "relation": [
        {
            "biotoolsID": "galaxy",
            "type": "uses"
        }
    ],
    "toolType": [
        "Web service",
        "Workbench"
    ],
    "validated": 1,
    "version": [
        "2.0.0"
    ]
}