{
    "additionDate": "2021-01-18T09:37:04Z",
    "biotoolsCURIE": "biotools:greencircrna",
    "biotoolsID": "greencircrna",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "glli@snnu.edu.cn",
            "name": "Guanglin Li",
            "typeEntity": "Person"
        }
    ],
    "description": "A database for plant circRNAs that act as miRNA decoys.\n\nCircular RNAs (circRNAs) are a novel type of RNAs that form covalently closed loop structures with neither 5'- 3' polarities nor polyadenylated tails. GreenCircRNA(v1.0) is the most comprehensive database containing 213,494 circRNA informations from over 4100 RNA-seq datasets across 69 different species. Based on these candidate circRNAs, we futher predicted them acting as miRNA decoys and their potential networks involving circRNA-miRNA-mRNA in the corresponding species. This database allows users not only to search, browse and freely download circRNAs with relative informations, such as full-length, graphical, parental gene and interaction network, but also provide some tools for analyze circRNAs.\n\nA Wiki-database of plant CircRNAs(v1.0).",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "miRNA target prediction",
                    "uri": "http://edamontology.org/operation_0463"
                },
                {
                    "term": "miRNA expression analysis",
                    "uri": "http://edamontology.org/operation_3792"
                },
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                }
            ]
        }
    ],
    "homepage": "http://greencirc.cn",
    "lastUpdate": "2021-01-25T10:45:37Z",
    "name": "GreenCircRNA",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1093/DATABASE/BAAA039",
            "metadata": {
                "abstract": "© 2020 The Author(s) 2020. Published by Oxford University Press.Circular RNAs (circRNAs) are endogenous non-coding RNAs that form a covalently closed continuous loop, are widely distributed and play important roles in a series of developmental processes. In plants, an increasing number of studies have found that circRNAs can regulate plant metabolism and are involved in plant responses to biotic or abiotic stress. Acting as miRNA decoys is a critical way for circRNAs to perform their functions. Therefore, we developed GreenCircRNA - a database for plant circRNAs acting as miRNA decoys that is dedicated to providing a plant-based platform for detailed exploration of plant circRNAs and their potential decoy functions. This database includes over 210 000 circRNAs from 69 species of plants; the main data sources of circRNAs in this database are NCBI, EMBL-EBI and Phytozome. To investigate the function of circRNAs as competitive endogenous RNAs, the possibility of circRNAs from 38 plants to act as miRNA decoys was predicted. Moreover, we provide basic information for the circRNAs in the database, including their locations, host genes and relative expression levels, as well as full-length sequences, host gene GO (Gene Ontology) numbers and circRNA visualization. GreenCircRNA is the first database for the prediction of circRNAs that act as miRNA decoys and contains the largest number of plant species. Database URL: http://greencirc.cn",
                "authors": [
                    {
                        "name": "Zhang J."
                    },
                    {
                        "name": "Hao Z."
                    },
                    {
                        "name": "Yin S."
                    },
                    {
                        "name": "Li G."
                    }
                ],
                "citationCount": 5,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Database",
                "title": "GreenCircRNA: A database for plant circRNAs that act as miRNA decoys"
            },
            "pmcid": "PMC7278087",
            "pmid": "32510565"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ],
    "validated": 1
}