{
    "additionDate": "2021-01-18T12:19:40Z",
    "biotoolsCURIE": "biotools:dendroscan",
    "biotoolsID": "dendroscan",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "tobi@hi.is",
            "name": "T. Dürig",
            "typeEntity": "Person"
        }
    ],
    "description": "DendroScan is an open source tool to conduct comparative statistical tests and dendrogrammatic analyses on particle morphometry.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sorting",
                    "uri": "http://edamontology.org/operation_3802"
                },
                {
                    "term": "Statistical calculation",
                    "uri": "http://edamontology.org/operation_2238"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Dendrogram visualisation",
                    "uri": "http://edamontology.org/operation_2938"
                }
            ]
        }
    ],
    "homepage": "https://github.com/lsschmidt/DendroScan",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2021-03-01T07:25:31Z",
    "license": "GPL-3.0",
    "name": "DendroScan",
    "operatingSystem": [
        "Linux",
        "Windows"
    ],
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1038/S41598-020-78698-0",
            "metadata": {
                "abstract": "© 2020, The Author(s).Quantitative shape analysis of juvenile pyroclasts is applied in volcanology to reconstruct the dynamics and styles of eruptions, and to explore the details of tephra transport, dispersal, and emplacement. Morphometric analyses often include comparison of multiple data sets with a set of dimensionless shape parameters. Here we present “DendroScan”, an open source Matlab program that provides the user with all the multivariate statistical methods needed to produce such morphometric comparisons. Serving as a statistical “toolbox”, DendroScan conducts Levene-, t-, and equivalence tests, presenting the results in ad hoc interpretable graphs. Furthermore, it is designed to conduct dendrogrammatic analyses of particle morphometry, a recently developed approach for the inter-comparison of multiple morphometric data sets. DendroScan produces tree diagrams, in which the analysed samples are sorted according to their morphometric dissimilarity, allowing the user to identify, e.g., samples that are statistically equivalent. To demonstrate DendroScan’s potential, ten experimental samples are compared with volcanic ash samples generated by the Havre 2012 deep-sea eruption in the Kermadec arc (New Zealand). We show how, using DendroScan-based results, information on the eruptive mechanism can be inferred, and how the cooling history of the experimental melt is reflected in the dissimilarity of thermally granulated fragments.",
                "authors": [
                    {
                        "name": "Durig T."
                    },
                    {
                        "name": "Schmidt L.S."
                    },
                    {
                        "name": "White J.D.L."
                    },
                    {
                        "name": "Bowman M.H."
                    }
                ],
                "citationCount": 1,
                "date": "2020-12-01T00:00:00Z",
                "journal": "Scientific Reports",
                "title": "DendroScan: an open source tool to conduct comparative statistical tests and dendrogrammatic analyses on particle morphometry"
            },
            "pmcid": "PMC7730387",
            "pmid": "33303855"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ]
}