{
    "additionDate": "2017-02-10T11:34:30Z",
    "biotoolsCURIE": "biotools:rescue-ese",
    "biotoolsID": "rescue-ese",
    "credit": [
        {
            "email": "wgf3@mit.edu",
            "name": "Will Fairbrother",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "geneyeo@mit.edu",
            "name": "Gene Yeo",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "rufang@biostat.ucsf.edu",
            "name": "Ru-Fang Yeh",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Server for the identification of hexnucleotide exonic splicing enhancers (ESEs).  Also contains a list of 238 identified ESEs for human genes.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Exonic splicing enhancer prediction",
                    "uri": "http://edamontology.org/operation_0446"
                }
            ]
        }
    ],
    "homepage": "http://genes.mit.edu/burgelab/rescue-ese/",
    "lastUpdate": "2018-12-10T12:58:56Z",
    "name": "Rescue-ESE",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "Specific short oligonucleotide sequences that enhance pre-mRNA splicing when present in exons, termed exonic splicing enhancers (ESEs), play important roles in constitutive and alternative splicing. A computational method, RESCUE-ESE, was developed that predicts which sequences have ESE activity by statistical analysis of exon-intron and splice site composition. When large data sets of human gene sequences were used, this method identified 10 predicted ESE motifs. Representatives of all 10 motifs were found to display enhancer activity in vivo, whereas point mutants of these sequences exhibited sharply reduced activity. The motifs identified enable prediction of the splicing phenotypes of exonic mutations in human genes.",
                "authors": [
                    {
                        "name": "Fairbrother W.G."
                    },
                    {
                        "name": "Yeh R.-F."
                    },
                    {
                        "name": "Sharp P.A."
                    },
                    {
                        "name": "Burge C.B."
                    }
                ],
                "citationCount": 803,
                "date": "2002-08-09T00:00:00Z",
                "journal": "Science",
                "title": "Predictive identification of exonic splicing enhancers in human genes"
            },
            "pmid": "12114529"
        },
        {
            "metadata": {
                "abstract": "A typical gene contains two levels of information: a sequence that encodes a particular protein and a host of other signals that are necessary for the correct expression of the transcript. While much attention has been focused on the effects of sequence variation on the amino acid sequence, variations that disrupt gene processing signals can dramatically impact gene function. A variation that disrupts an exonic splicing enhancer (ESE), for example, could cause exon skipping which would result in the exclusion of an entire exon from the mRNA transcript. RESCUE-ESE, a computational approach used in conjunction with experimental validation, previously identified 238 candidate ESE hexamers in human genes. The RESCUE-ESE method has recently been implemented in three additional species: mouse, zebrafish and pufferfish. Here we describe an online ESE analysis tool (http://genes.mit.edu/burgelab/rescue-ese/) that annotates RESCUE-ESE hexamers in vertebrate exons and can be used to predict splicing phenotypes by identifying sequence changes that disrupt or alter predicted ESEs. © Oxford University Press 2004; all rights reserved.",
                "authors": [
                    {
                        "name": "Fairbrother W.G."
                    },
                    {
                        "name": "Yeo G.W."
                    },
                    {
                        "name": "Yeh R."
                    },
                    {
                        "name": "Goldstein P."
                    },
                    {
                        "name": "Mawson M."
                    },
                    {
                        "name": "Sharp P.A."
                    },
                    {
                        "name": "Burge C.B."
                    }
                ],
                "citationCount": 209,
                "date": "2004-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "RESCUE-ESE identifies candidate exonic splicing enhancers in vertebrate exons"
            },
            "pmid": "15215377"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "RNA splicing",
            "uri": "http://edamontology.org/topic_3320"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ],
    "validated": 1
}