{
    "additionDate": "2017-02-10T14:14:40Z",
    "biotoolsCURIE": "biotools:genepath",
    "biotoolsID": "genepath",
    "description": "Tool for automated construction of genetic networks and proposal of genetic experiments from mutant data.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                },
                {
                    "term": "Gene regulatory network analysis",
                    "uri": "http://edamontology.org/operation_1781"
                },
                {
                    "term": "Genetic mapping",
                    "uri": "http://edamontology.org/operation_0282"
                },
                {
                    "term": "Pathway or network analysis",
                    "uri": "http://edamontology.org/operation_2497"
                }
            ]
        }
    ],
    "homepage": "http://www.genepath.org/genepath2",
    "lastUpdate": "2018-12-10T12:58:39Z",
    "name": "GenePath2",
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "A genetic network is a formalism that is often used in biology to represent causalities and reason about biological phenomena related to genetic regulation. We present GenePath, a computer-based system that supports the inference of genetic networks from a set of genetic experiments. Implemented in Prolog, GenePath uses abductive inference to elucidate network constraints based on background knowledge and experimental results. Additionally, it can propose genetic experiments that may further refine the discovered network and establish relations between genes that could not be related based on the original experimental data. We illustrate GenePath's approach and utility on analysis of data on aggregation and sporulation of the soil amoeba Dictyostelium discoideum. © 2003 Elsevier Science B.V. All rights reserved.",
                "authors": [
                    {
                        "name": "Beck J.R."
                    },
                    {
                        "name": "Borstnik U."
                    },
                    {
                        "name": "Bratko I."
                    },
                    {
                        "name": "Curk T."
                    },
                    {
                        "name": "Demsar J."
                    },
                    {
                        "name": "Halter J."
                    },
                    {
                        "name": "Juvan P."
                    },
                    {
                        "name": "Kuspa A."
                    },
                    {
                        "name": "Shaulsky G."
                    },
                    {
                        "name": "Zupan B."
                    }
                ],
                "citationCount": 19,
                "date": "2003-01-01T00:00:00Z",
                "journal": "Artificial Intelligence in Medicine",
                "title": "GenePath: A system for inference of genetic networks and proposal of genetic experiments"
            },
            "pmid": "12957783"
        },
        {
            "metadata": {
                "abstract": "GenePath is a web-based application for the analysis of mutant-based experiments and synthesis of genetic networks. Here, we introduce GenePath and describe a number of new approaches, including conflict resolution, handling cyclic pathways, confidence level assignment, what-if analysis and new experiment proposal. We illustrate the key concepts using data from a study of adhesion genes in Dictyostelium discoideum and show that GenePath discovered genetic interactions that were ignored in the original publication. GenePath is available at http://www.genepath.org/genepath2. © 2005 Oxford University Press.",
                "authors": [
                    {
                        "name": "Demsar J."
                    },
                    {
                        "name": "Juvan P."
                    },
                    {
                        "name": "Shaulsky G."
                    },
                    {
                        "name": "Zupan B."
                    }
                ],
                "citationCount": 12,
                "date": "2005-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "GenePath: From mutations to genetic networks and back"
            },
            "pmid": "15980576"
        },
        {
            "metadata": {
                "abstract": "Motivation: Genetic networks are often used in the analysis of biological phenomena. In classical genetics, they are constructed manually from experimental data on mutants. The field lacks formalism to guide such analysis, and accounting for all the data becomes complicated when large amounts of data are considered. Results: We have developed GenePath, an intelligent assistant that automates the analysis of genetic data. GenePath employs expert-defined patterns to uncover gene relations from the data, and uses these relations as constraints in the search for a plausible genetic network. GenePath formalizes genetic data analysis, facilitates the consideration of all the available data in a consistent manner, and the examination of the large, number of possible consequences of planned experiments. It also provides an explanation, mechanism that traces every finding to the pertinent data.",
                "authors": [
                    {
                        "name": "Bratko I."
                    },
                    {
                        "name": "Demsar J."
                    },
                    {
                        "name": "Halter J.A."
                    },
                    {
                        "name": "Juvan P."
                    },
                    {
                        "name": "Kuspa A."
                    },
                    {
                        "name": "Shaulsky G."
                    },
                    {
                        "name": "Zupan B."
                    }
                ],
                "citationCount": 40,
                "date": "2003-02-12T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "GenePath: A system for automated construction of genetic networks from mutant data"
            },
            "pmid": "12584124"
        },
        {
            "metadata": {
                "abstract": "The sequencing of the human genome and the genomes of several model organisms is the first step toward the long-term objective of genetic research: the identification of all genes, and the discovery of their functions and mutual interactions. This article presents a methodology and a computer program called GenePath to support the discovery of gene function. GenePath uses mutant data and available genetic knowledge to identify potential genetic pathways. Several pilot applications based on experimental results from Dictyostelium and C. elegans confirmed the usefulness of the proposed schema. Our results suggest that GenePath is a valuable tool that can be used as an intelligent assistant to support genetic reasoning. © 2001 IMIA. All right reserved.",
                "authors": [
                    {
                        "name": "Beck R.J."
                    },
                    {
                        "name": "Bratko I."
                    },
                    {
                        "name": "Demsar J."
                    },
                    {
                        "name": "Halter J.A."
                    },
                    {
                        "name": "Kuspa A."
                    },
                    {
                        "name": "Shaulsky G."
                    },
                    {
                        "name": "Zupan B."
                    }
                ],
                "citationCount": 5,
                "date": "2001-01-01T00:00:00Z",
                "journal": "Studies in Health Technology and Informatics",
                "title": "GenePath: A computer program for genetic pathway discovery from mutant data"
            },
            "pmid": "11604873"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Experimental design and studies",
            "uri": "http://edamontology.org/topic_3678"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ],
    "validated": 1
}
