{
    "accessibility": "Open access",
    "additionDate": "2023-02-22T10:16:22.884581Z",
    "biotoolsCURIE": "biotools:megabayesc",
    "biotoolsID": "megabayesc",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "deruncie@ucdavis.edu",
            "name": "Daniel Runcie",
            "orcidid": "https://orcid.org/0000-0002-3008-9312",
            "typeEntity": "Person"
        },
        {
            "email": "qtlcheng@ucdavis.edu",
            "name": "Hao Cheng",
            "typeEntity": "Person"
        },
        {
            "name": "Jiayi Qu"
        }
    ],
    "description": "Mega-scale Bayesian Regression methods for genome-wide prediction and association studies with thousands of traits.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Collapsing methods",
                    "uri": "http://edamontology.org/operation_3791"
                },
                {
                    "term": "Gene expression QTL analysis",
                    "uri": "http://edamontology.org/operation_3232"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Jiayi-Qu/Mega-BayesC",
    "language": [
        "R"
    ],
    "lastUpdate": "2024-11-24T14:59:01.465087Z",
    "license": "Not licensed",
    "name": "MegaBayesC",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1093/genetics/iyac183",
            "metadata": {
                "abstract": "Large-scale phenotype data are expected to increase the accuracy of genome-wide prediction and the power of genome-wide association analyses. However, genomic analyses of high-dimensional, highly correlated traits are challenging. We developed a method for implementing high-dimensional Bayesian multivariate regression to simultaneously analyze genetic variants underlying thousands of traits. As a demonstration, we implemented the BayesC prior in the R package MegaLMM. Applied to Genomic Prediction, MegaBayesC effectively integrated hyperspectral reflectance data from 620 hyperspectral wavelengths to improve the accuracy of genetic value prediction on grain yield in a wheat dataset. Applied to Genome-Wide Association Studies, we used simulations to show that MegaBayesC can accurately estimate the effect sizes of QTL across a range of genetic architectures and causes of correlations among traits. To apply MegaBayesC to a realistic scenario involving whole-genome marker data, we developed a 2-stage procedure involving a preliminary step of candidate marker selection prior to multivariate regression. We then used MegaBayesC to identify genetic associations with flowering time in Arabidopsis thaliana, leveraging expression data from 20,843 genes. MegaBayesC selected 15 single nucleotide polymorphisms as important for flowering time, with 13 located within 100 kb of known flowering-time related genes, a higher validation rate than achieved by a single-stage analysis using only the flowering time data itself. These results demonstrate that MegaBayesC can efficiently and effectively leverage high-dimensional phenotypes in genetic analyses.",
                "authors": [
                    {
                        "name": "Cheng H."
                    },
                    {
                        "name": "Qu J."
                    },
                    {
                        "name": "Runcie D."
                    }
                ],
                "citationCount": 1,
                "date": "2023-03-01T00:00:00Z",
                "journal": "Genetics",
                "title": "Mega-scale Bayesian regression methods for genome-wide prediction and association studies with thousands of traits"
            },
            "pmcid": "PMC9991502",
            "pmid": "36529897"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "GWAS study",
            "uri": "http://edamontology.org/topic_3517"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ]
}
