{
    "additionDate": "2021-01-18T07:39:37Z",
    "biotoolsCURIE": "biotools:meta-prism",
    "biotoolsID": "meta-prism",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "ningkang@hust.edu.cn",
            "name": "Kang Ning",
            "typeEntity": "Person"
        }
    ],
    "description": "Ultra-fast and highly accurate microbial community structure search utilizing dual indexing and parallel computation.\n\nMeta-Prism aims to conduct quick query in large-scale metagenomics database. The method is based on three computational techniques: dual-indexing approach for sample sub-grouping, refined scoring function that could scrutinize the minute differences among samples, and parallel computation based on GPU computing.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Sample comparison",
                    "uri": "http://edamontology.org/operation_3731"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "https://github.com/HUST-NingKang-Lab/metaPrism",
    "language": [
        "C++"
    ],
    "lastUpdate": "2021-02-22T07:20:58Z",
    "license": "GPL-3.0",
    "name": "Meta-Prism",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1093/BIB/BBAA009",
            "metadata": {
                "abstract": "© The Author(s) 2020. Published by Oxford University Press. All rights reserved. For Permissions, please email: journals.permissions@oup.com.Microbiome samples are accumulating at an unprecedented speed. As a result, a massive amount of samples have become available for the mining of the intrinsic patterns among them. However, due to the lack of advanced computational tools, fast yet accurate comparisons and searches among thousands to millions of samples are still in urgent need. In this work, we proposed the Meta-Prism method for comparing and searching the microbial community structures amongst tens of thousands of samples. Meta-Prism is at least 10 times faster than contemporary methods serving the same purpose and can provide very accurate search results. The method is based on three computational techniques: dual-indexing approach for sample subgrouping, refined scoring function that could scrutinize the minute differences among samples, and parallel computation on CPU or GPU. The superiority of Meta-Prism on speed and accuracy for multiple sample searches is proven based on searching against ten thousand samples derived from both human and environments. Therefore, Meta-Prism could facilitate similarity search and in-depth understanding among massive number of heterogenous samples in the microbiome universe. The codes of Meta-Prism are available at: https://github.com/HUST-NingKang-Lab/metaPrism.",
                "authors": [
                    {
                        "name": "Zhu M."
                    },
                    {
                        "name": "Kang K."
                    },
                    {
                        "name": "Ning K."
                    }
                ],
                "date": "2021-01-18T00:00:00Z",
                "journal": "Briefings in bioinformatics",
                "title": "Meta-Prism: Ultra-fast and highly accurate microbial community structure search utilizing dual indexing and parallel computation"
            },
            "pmid": "32031567"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Microbial ecology",
            "uri": "http://edamontology.org/topic_3697"
        },
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "Sample collections",
            "uri": "http://edamontology.org/topic_3277"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        }
    ]
}