{
    "additionDate": "2021-01-18T08:42:57Z",
    "biotoolsCURIE": "biotools:econtact",
    "biotoolsID": "econtact",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "hapandya@gujaratuniversity.ac.in",
            "name": "Himanshu A. Pandya",
            "typeEntity": "Person"
        }
    ],
    "description": "ECONTACT (Energetic CONTributions of Amino acid residues and its possible Cross-Talk) is an approach to identify potential cross-talks between amino acid residues of protein pocket involved in ligand binding. This approach utilizes per-residue energy terms derived from multiple protein-ligand complexes as variables for principal component analysis (PCA) and identifies top cross-talks which can be tested in any protein-ligand complex.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Virtual screening",
                    "uri": "http://edamontology.org/operation_3938"
                },
                {
                    "term": "Molecular dynamics",
                    "uri": "http://edamontology.org/operation_2476"
                },
                {
                    "term": "Principal component visualisation",
                    "uri": "http://edamontology.org/operation_2939"
                },
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                }
            ]
        }
    ],
    "homepage": "https://www.gujaratuniversity.ac.in/econtact/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-03-05T15:41:09Z",
    "name": "ECONTACT",
    "operatingSystem": [
        "Mac",
        "Linux",
        "Windows"
    ],
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1002/PROT.25894",
            "metadata": {
                "abstract": "© 2020 Wiley Periodicals, Inc.Receptor-based QSAR approaches can enumerate the energetic contributions of amino acid residues toward ligand binding only when experimental binding affinity is associated. The structural data of protein-ligand complexes are witnessing a tremendous growth in the Protein Data Bank deposited with a few entries on binding affinity. We present here a new approach to compute the Energetic CONTributions of Amino acid residues and its possible Cross-Talk (ECONTACT) to study ligand binding using per-residue energy decomposition, molecular dynamics simulations and rescoring method without the need for experimental binding affinity. This approach recognizes potential cross-talks among amino acid residues imparting a nonadditive effect to the binding affinity with evidence of correlative motions in the dynamics simulations. The protein-ligand interaction energies deduced from multiple structures are decomposed into per-residue energy terms, which are employed as variables to principal component analysis and generated cross-terms. Out of 16 cross-talks derived from eight datasets of protein-ligand systems, the ECONTACT approach is able to associate 10 potential cross-talks with site-directed mutagenesis, free energy, and dynamics simulations data strongly. We modeled these key determinants of ligand binding using joint probability density function (jPDF) to identify cross-talks in protein structures. The top two cross-talks identified by ECONTACT approach corroborated with the experimental findings. Furthermore, virtual screening exercise using ECONTACT models better discriminated known inhibitors from decoy molecules. This approach proposes the jPDF metric to estimate the probability of observing cross-talks in any protein-ligand complex. The source code and related resources to perform ECONTACT modeling is available freely at https://www.gujaratuniversity.ac.in/econtact/.",
                "authors": [
                    {
                        "name": "Kumar S.P."
                    },
                    {
                        "name": "Patel C.N."
                    },
                    {
                        "name": "Rawal R.M."
                    },
                    {
                        "name": "Pandya H.A."
                    }
                ],
                "citationCount": 1,
                "date": "2020-09-01T00:00:00Z",
                "journal": "Proteins: Structure, Function and Bioinformatics",
                "title": "Energetic contributions of amino acid residues and its cross-talk to delineate ligand-binding mechanism"
            },
            "pmid": "32323374"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Molecular dynamics",
            "uri": "http://edamontology.org/topic_0176"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "Molecular modelling",
            "uri": "http://edamontology.org/topic_2275"
        }
    ]
}