{
    "name": "HaploRec", 
    "description": "Statistical haplotype reconstruction algorithm targeted for large-scale disease association studies. It is especially suitable for data sets with a large number of subjects and a large number of possibly sparsely located markers.", 
    "homepage": "https://www.cs.helsinki.fi/group/genetics/haplotyping.html", 
    "biotoolsID": "haplorec", 
    "biotoolsCURIE": "biotools:haplorec", 
    "version": [], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_3454", 
                    "term": "Phasing"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Command-line tool"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_3056", 
            "term": "Population genetics"
        }
    ], 
    "operatingSystem": [
        "Linux"
    ], 
    "language": [
        "Java"
    ], 
    "license": "Proprietary", 
    "collectionID": [
        "Animal and Crop Genomics"
    ], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [], 
    "download": [], 
    "documentation": [
        {
            "url": "https://www.cs.helsinki.fi/group/genetics/haplotyping/distribution/haplorec.txt", 
            "type": "General", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": "10.1186/1471-2105-7-542", 
            "pmid": null, 
            "pmcid": null, 
            "type": "Primary", 
            "version": null, 
            "metadata": {
                "title": "HaploRec: Efficient and accurate large-scale reconstruction of haplotypes", 
                "abstract": "Background: Haplotypes extracted from human DNA can be used for gene mapping and other analysis of genetic patterns within and across populations. A fundamental problem is, however, that current practical laboratory methods do not give haplotype information. Estimation of phased haplotypes of unrelated individuals given their unphased genotypes is known as the haplotype reconstruction or phasing problem. Results: We define three novel statistical models and give an efficient algorithm for haplotype reconstruction, jointly called HaploRec. HaploRec is based on exploiting local regularities conserved in haplotypes: it reconstructs haplotypes so that they have maximal local coherence. This approach - not assuming statistical dependence for remotely located markers - has two useful properties: it is well-suited for sparse marker maps, such as those used in gene mapping, and it can actually take advantage of long maps. Conclusion: Our experimental results with simulated and real data show that HaploRec is a powerful method for the large scale haplotyping needed in association studies. With sample sizes large enough for gene mapping it appeared to be the best compared to all other tested methods (Phase, fastPhase, PL-EM, Snphap, Gerbil; simulated data), with small samples it was competitive with the best available methods (real data). HaploRec is several orders of magnitude faster than Phase and comparable to the other methods; the running times are roughly linear in the number of subjects and the number of markers. HaploRec is publicly available at http://www.cs.helsinki.fi/group/genetics/haplotyping.html. © 2006 Eronen et al; licensee BioMed Central Ltd.", 
                "date": "2006-12-01T00:00:00Z", 
                "citationCount": 43, 
                "authors": [
                    {
                        "name": "Eronen L."
                    }, 
                    {
                        "name": "Geerts F."
                    }, 
                    {
                        "name": "Toivonen H."
                    }
                ], 
                "journal": "BMC Bioinformatics"
            }
        }
    ], 
    "credit": [
        {
            "name": null, 
            "email": "lauri.eronen@cs.helsinki.fi", 
            "url": null, 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "admin", 
    "additionDate": "2017-08-20T15:57:29Z", 
    "lastUpdate": "2019-09-04T08:38:10Z", 
    "editPermission": {
        "type": "group", 
        "authors": [
            "animalandcropgenomics"
        ]
    }, 
    "validated": 1, 
    "homepage_status": 0, 
    "elixir_badge": 0
}