{"credit":[{"email":"asolano@broadinstitute.org","name":"Antonio Solano-Román","typeEntity":"Person","typeRoles":["Primary contact"]},{"email":"allan.orozcosolano@ucr.ac.cr","name":"Allan Orozco-Solano","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"http://vizport.io/vizgvar/doc/"}],"function":[{"operation":[{"term":"Polymorphism detection","uri":"http://edamontology.org/operation_3202"},{"term":"Read binning","uri":"http://edamontology.org/operation_3798"}]}],"labels":{"topic":[{"term":"Genetic variation","uri":"http://edamontology.org/topic_0199"},{"term":"Gene transcripts","uri":"http://edamontology.org/topic_3512"},{"term":"Oncology","uri":"http://edamontology.org/topic_2640"}]},"publication":[{"abstract":"© The Author 2017. Published by Oxford University Press. All rights reserved. Motivation VizGVar was designed to meet the growing need of the research community for improved genomic and proteomic data viewers that benefit from better information visualization. Results We implemented a new information architecture and applied user centered design principles to provide a new improved way of visualizing genetic information and protein data related to human disease. VizGVar connects the entire database of Ensembl protein motifs, domains, genes and exons with annotated SNPs and somatic variations from PharmGKB and COSMIC. VizGVar precisely represents genetic variations and their respective location by colored curves to designate different types of variations. The structured hierarchy of biological data is reflected in aggregated patterns through different levels, integrating several layers of information at once. VizGVar provides a new interactive, web-based JavaScript visualization of somatic mutations and protein variation, enabling fast and easy discovery of clinically relevant variation patterns. Availability and implementation VizGVar is accessible at http://vizport.io/vizgvar; http://vizport.io/vizgvar/doc/. Contact asolano@broadinstitute.org or allan.orozcosolano@ucr.ac.cr.","authors":["Solano-Roman A.","Alfaro-Arias V.","Cruz-Castillo C.","Orozco-Solano A."],"cit_count":0,"doi":"10.1093/bioinformatics/btx694","journal":"Bioinformatics","title":"Visualization portal for genetic variation (VizGVar): A tool for interactive visualization of SNPs and somatic mutations in exons, genes and protein domains","type":"Primary","year":"2018-03-15"}],"summary":{"biotoolsCURIE":"biotools:VizGVar","biotoolsID":"VizGVar","description":"Visualization portal for genetic variation (VizGVar): a tool for interactive visualization of SNPs and somatic mutations in exons, genes and protein domains.","homepage":"http://vizport.io/vizgvar/","name":"VizGVar","version":["1.5"]}}