
{
    "credit": [
        {
            "email": "gongx030@umn.edu",
            "name": "Wuming Gong",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "https://github.com/gongx030/DrImpute/blob/master/README.md"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Imputation",
                    "uri": "http://edamontology.org/operation_3557"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "R"
        ],
        "license": "GPL-3.0",
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Library"
        ],
        "topic": [
            {
                "term": "RNA sequencing",
                "uri": "http://edamontology.org/topic_3170"
            },
            {
                "term": "Next generation sequencing",
                "uri": "http://edamontology.org/topic_3168"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© 2018 The Author(s).Background: The single cell RNA sequencing (scRNA-seq) technique begin a new era by allowing the observation of gene expression at the single cell level. However, there is also a large amount of technical and biological noise. Because of the low number of RNA transcriptomes and the stochastic nature of the gene expression pattern, there is a high chance of missing nonzero entries as zero, which are called dropout events. Results: We develop DrImpute to impute dropout events in scRNA-seq data. We show that DrImpute has significantly better performance on the separation of the dropout zeros from true zeros than existing imputation algorithms. We also demonstrate that DrImpute can significantly improve the performance of existing tools for clustering, visualization and lineage reconstruction of nine published scRNA-seq datasets. Conclusions: DrImpute can serve as a very useful addition to the currently existing statistical tools for single cell RNA-seq analysis. DrImpute is implemented in R and is available at https://github.com/gongx030/DrImpute.",
            "authors": [
                "Gong W.",
                "Kwak I.-Y.",
                "Pota P.",
                "Koyano-Nakagawa N.",
                "Garry D.J."
            ],
            "cit_count": 2,
            "doi": "10.1186/s12859-018-2226-y",
            "journal": "BMC Bioinformatics",
            "title": "DrImpute: Imputing dropout events in single cell RNA sequencing data",
            "type": "Primary",
            "year": "2018-06-08"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:drimpute",
        "biotoolsID": "drimpute",
        "description": "R codes for imputing dropout events. Many statistical methods in cell type identification, visualization and lineage reconstruction do not account for dropout events ('PCAreduce', 'SC3', 'PCA', 't-SNE', 'Monocle', 'TSCAN', etc). It can improve the performance of such software by imputing dropout events.",
        "homepage": "https://github.com/gongx030/DrImpute.",
        "name": "DrImpute"
    }
}