
{
    "credit": [
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Pathway or network visualisation",
                    "uri": "http://edamontology.org/operation_3083"
                },
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                },
                {
                    "term": "Gene methylation analysis",
                    "uri": "http://edamontology.org/operation_3207"
                }
            ]
        }
    ],
    "labels": {
        "topic": [
            {
                "term": "Functional, regulatory and non-coding RNA",
                "uri": "http://edamontology.org/topic_0659"
            },
            {
                "term": "Epigenetics",
                "uri": "http://edamontology.org/topic_3295"
            },
            {
                "term": "Genetic variation",
                "uri": "http://edamontology.org/topic_0199"
            },
            {
                "term": "Oncology",
                "uri": "http://edamontology.org/topic_2640"
            },
            {
                "term": "DNA",
                "uri": "http://edamontology.org/topic_0654"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© 2019 The AuthorsGliomas are one of the most common types of brain cancers. Numerous efforts have been devoted to studying the mechanisms of glioma genesis and identifying biomarkers for diagnosis and treatment. To help further investigations, we present a comprehensive database named GliomaDB. GliomaDB includes 21,086 samples from 4303 patients and integrates genomic, transcriptomic, epigenomic, clinical, and gene-drug association data regarding glioblastoma multiforme (GBM) and low-grade glioma (LGG) from The Cancer Genome Atlas (TCGA), Gene Expression Omnibus (GEO), the Chinese Glioma Genome Atlas (CGGA), the Memorial Sloan Kettering Cancer Center Integrated Mutation Profiling of Actionable Cancer Targets (MSK-IMPACT), the US Food and Drug Administration (FDA), and PharmGKB. GliomaDB offers a user-friendly interface for two main types of functionalities. The first comprises queries of (i) somatic mutations, (ii) gene expression, (iii) microRNA (miRNA) expression, and (iv) DNA methylation. In addition, queries can be executed at the gene, region, and base level. Second, GliomaDB allows users to perform survival analysis, coexpression network visualization, multi-omics data visualization, and targeted drug recommendations based on personalized variations. GliomaDB bridges the gap between glioma genomics big data and the delivery of integrated information for end users, thus enabling both researchers and clinicians to effectively use publicly available data and empowering the progression of precision medicine in glioma. GliomaDB is freely accessible at http://bigd.big.ac.cn/gliomaDB.",
            "authors": [
                "Yang Y.",
                "Sui Y.",
                "Xie B.",
                "Qu H.",
                "Fang X."
            ],
            "cit_count": 1,
            "doi": "10.1016/J.GPB.2018.03.008",
            "journal": "Genomics, Proteomics and Bioinformatics",
            "pmid": "31811943",
            "title": "GliomaDB: A Web Server for Integrating Glioma Omics Data and Interactive Analysis",
            "year": "2019-08-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:GliomaDB",
        "biotoolsID": "GliomaDB",
        "description": "A Web Server for Integrating Glioma Omics Data and Interactive Analysis.\n\nA comprehensive database for both clinicians and scientists.\n\nGliomaDB hosts all the TCGA and MSK-IMPACT projects for somatic mutations of glioma patients. COSMIC, ClinVar and the 1000 Genome Project are integrated in annotation.\n\nNo more difficulty in analyzing big data in glioma.\n\n||| COMMON LINK WITH (PUB. & NAME DIFFERENT) bio.tools/3CDB (BIG.AC.CN)",
        "homepage": "http://bigd.big.ac.cn/gliomaDB",
        "name": "GliomaDB"
    }
}