{
    "name": "PALMA", 
    "description": "A novel approach based on large margin learning that combines accurate splice site predictions with common sequence alignment techniques. By solving a convex optimization problem, this algorithm tunes the parameters of the model such that true alignments score higher than other alignments.", 
    "homepage": "http://www.fml.tuebingen.mpg.de/raetsch/suppl/palma", 
    "biotoolsID": "palma", 
    "biotoolsCURIE": "biotools:palma", 
    "version": [], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_0292", 
                    "term": "Sequence alignment"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Command-line tool"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_3170", 
            "term": "RNA-Seq"
        }
    ], 
    "operatingSystem": [
        "Linux", 
        "Mac"
    ], 
    "language": [
        "C++", 
        "Python"
    ], 
    "license": null, 
    "collectionID": [], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [], 
    "download": [], 
    "documentation": [], 
    "publication": [
        {
            "doi": null, 
            "pmid": "17537755", 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "PALMA: mRNA to genome alignments using large margin algorithms", 
                "abstract": "Motivation: Despite many years of research on how to properly align sequences in the presence of sequencing errors, alternative splicing and micro-exons, the correct alignment of mRNA sequences to genomic DNA is still a challenging task. Results: We present a novel approach based on large margin learning that combines accurate splice site predictions with common sequence alignment techniques. By solving a convex optimization problem, our algorithm - called PALMA - tunes the parameters of the model such that true alignments score higher than other alignments. We study the accuracy of alignments of mRNAs containing artificially generated micro-exons to genomic DNA. In a carefully designed experiment, we show that our algorithm accurately identifies the intron boundaries as well as boundaries of the optimal local alignment. It outperforms all other methods: for 5702 artificially shortened EST sequences from Caenorhabditis elegans and human, it correctly identifies the intron boundaries in all except two cases. The best other method is a recently proposed method called exalin which misaligns 37 of the sequences. Our method also demonstrates robustness to mutations, insertions and deletions, retaining accuracy even at high noise levels. © 2007 The Author(s).", 
                "date": "2007-08-01T00:00:00Z", 
                "citationCount": 9, 
                "authors": [
                    {
                        "name": "Schulze U."
                    }, 
                    {
                        "name": "Hepp B."
                    }, 
                    {
                        "name": "Ong C.S."
                    }, 
                    {
                        "name": "Ratsch G."
                    }
                ], 
                "journal": "Bioinformatics"
            }
        }
    ], 
    "credit": [
        {
            "name": "Uta Schulze", 
            "email": "Uta.Schulze@tuebingen.mpg.de", 
            "url": null, 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "seqwiki_import", 
    "additionDate": "2017-01-13T13:15:45Z", 
    "lastUpdate": "2018-12-10T12:58:55Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 1, 
    "homepage_status": 0, 
    "elixir_badge": 0
}