{
    "additionDate": "2021-01-18T11:31:34Z",
    "biotoolsCURIE": "biotools:gropt",
    "biotoolsID": "gropt",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "mloecher@stanford.edu",
            "name": "Michael Loecher",
            "orcidid": "https://orcid.org/0000-0002-6533-1113",
            "typeEntity": "Person"
        }
    ],
    "description": "A gradient optimization toolbox for general purpose time‐optimal MRI gradient waveform design.\n\nA toolbox for MRI Gradient Optimization (GrOpt).\n\nOpenMP version of TE finder is better implemented. See demo in the test_TE_finder function of src/optimize_kernel.c, which will call multiple GrOpt evals simultaneously to find the shortest feasible T.",
    "editPermission": {
        "type": "private"
    },
    "homepage": "http://www.github.com/cmr-group/gropt",
    "language": [
        "C",
        "MATLAB",
        "Python"
    ],
    "lastUpdate": "2021-01-25T11:08:30Z",
    "license": "GPL-3.0",
    "name": "GrOpt",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1002/MRM.28384",
            "metadata": {
                "abstract": "© 2020 The Authors. Magnetic Resonance in Medicine published by Wiley Periodicals LLC on behalf of International Society for Magnetic Resonance in MedicinePurpose: To introduce and demonstrate a software library for time-optimal gradient waveform optimization with a wide range of applications. The software enables direct on-the-fly gradient waveform design on the scanner hardware for multiple vendors. Methods: The open-source gradient optimization (GrOpt) toolbox was implemented in C with both Matlab and Python wrappers. The toolbox enables gradient waveforms to be generated based on a set of constraints that define the features and encodings for a given acquisition. The GrOpt optimization routine is based on the alternating direction method of multipliers (ADMM). Additional constraints enable error corrections to be added, or patient comfort and safety to be adressed. A range of applications and compute speed metrics are analyzed. Finally, the method is implemented and tested on scanners from different vendors. Results: Time-optimal gradient waveforms for different pulse sequences and the constraints that define them are shown. Additionally, the ability to add, arbitrary motion (gradient moment) compensation or limit peripheral nerve stimulation is demonstrated. There exists a trade-off between computation time and gradient raster time, but it was observed that acceptable gradient waveforms could be generated in 1-40 ms. Gradient waveforms generated and run on the different scanners were functionally equivalent, and the images were comparable. Conclusions: GrOpt is an open source toolbox that enables on-the-fly optimization of gradient waveform design, subject to a set of defined constraints. GrOpt was presented for a range of imaging applications, analyzed in terms of computational complexity, and implemented to run on the scanner for a multi-vendor demonstration.",
                "authors": [
                    {
                        "name": "Ennis D.B."
                    },
                    {
                        "name": "Loecher M."
                    },
                    {
                        "name": "Middione M.J."
                    }
                ],
                "date": "2020-12-01T00:00:00Z",
                "journal": "Magnetic Resonance in Medicine",
                "title": "A gradient optimization toolbox for general purpose time-optimal MRI gradient waveform design"
            },
            "pmcid": "PMC7540314"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Literature and language",
            "uri": "http://edamontology.org/topic_3068"
        },
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        }
    ],
    "validated": 1
}
