{
    "additionDate": "2016-03-03T13:48:22Z",
    "biotoolsCURIE": "biotools:ring",
    "biotoolsID": "ring",
    "credit": [
        {
            "email": "silvio.tosatto@unipd.it",
            "name": "Silvio C.E. Tosatto",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://protein.bio.unipd.it"
        },
        {
            "name": "ELIXIR-ITA-PADOVA",
            "typeEntity": "Project",
            "typeRole": [
                "Support"
            ],
            "url": "http://elixir.bio.unipd.it/"
        },
        {
            "name": "University of Padua, Department of Biomedical Sciences, BioComputing UP lab",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ],
            "url": "https://biocomputingup.it"
        }
    ],
    "description": "Residue interaction network generator",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://ring.biocomputingup.it/help"
        }
    ],
    "download": [
        {
            "type": "Downloads page",
            "url": "https://biocomputingup.it/downloads"
        }
    ],
    "editPermission": {
        "authors": [
            "AlessioDelConte"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Prediction and recognition",
                    "uri": "http://edamontology.org/operation_2423"
                }
            ]
        }
    ],
    "homepage": "https://ring.biocomputingup.it",
    "lastUpdate": "2024-11-24T20:08:55.559086Z",
    "name": "RING",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "ELIXIR-ITA-PADOVA",
    "publication": [
        {
            "doi": "10.1093/nar/gkac365",
            "metadata": {
                "abstract": "Residue interaction networks (RINs) are used to represent residue contacts in protein structures. Thanks to the advances in network theory, RINs have been proved effective as an alternative to coordinate data in the analysis of complex systems. The RING server calculates high quality and reliable non-covalent molecular interactions based on geometrical parameters. Here, we present the new RING 3.0 version extending the previous functionality in several ways. The underlying software library has been re-engineered to improve speed by an order of magnitude. RING now also supports the mmCIF format and provides typed interactions for the entire PDB chemical component dictionary, including nucleic acids. Moreover, RING now employs probabilistic graphs, where multiple conformations (e.g. NMR or molecular dynamics ensembles) are mapped as weighted edges, opening up new ways to analyze structural data. The web interface has been expanded to include a simultaneous view of the RIN alongside a structure viewer, with both synchronized and clickable. Contact evolution across models (or time) is displayed as a heatmap and can help in the discovery of correlating interaction patterns. The web server, together with an extensive help and tutorial, is available from URL: https://ring.biocomputingup.it/.",
                "authors": [
                    {
                        "name": "Camagni G.F."
                    },
                    {
                        "name": "Clementel D."
                    },
                    {
                        "name": "Del Conte A."
                    },
                    {
                        "name": "Minervini G."
                    },
                    {
                        "name": "Monzon A.M."
                    },
                    {
                        "name": "Piovesan D."
                    },
                    {
                        "name": "Tosatto S.C.E."
                    }
                ],
                "citationCount": 86,
                "date": "2022-07-05T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "RING 3.0: fast generation of probabilistic residue interaction networks from structural ensembles"
            },
            "pmcid": "PMC9252747",
            "pmid": "35554554",
            "type": [
                "Primary"
            ]
        },
        {
            "doi": "10.1093/bioinformatics/btr191",
            "metadata": {
                "abstract": "Motivation: Residue interaction networks (RINs) have been used in the literature to describe the protein 3D structure as a graph where nodes represent residues and edges physico-chemical interactions, e.g. hydrogen bonds or van-der-Waals contacts. Topological network parameters can be calculated over RINs and have been correlated with various aspects of protein structure and function. Here we present a novel web server, RING, to construct physico-chemically valid RINs interactively from PDB files for subsequent visualization in the Cytoscape platform. The additional structure-based parameters secondary structure, solvent accessibility and experimental uncertainty can be combined with information regarding residue conservation, mutual information and residue-based energy scoring functions. Different visualization styles are provided to facilitate visualization and standard plugins can be used to calculate topological parameters in Cytoscape. A sample use case analyzing the active site of glutathione peroxidase is presented. © The Author 2011. Published by Oxford University Press. All rights reserved.",
                "authors": [
                    {
                        "name": "Boscariol F."
                    },
                    {
                        "name": "Di Domenico T."
                    },
                    {
                        "name": "Martin A.J.M."
                    },
                    {
                        "name": "Tosatto S.C.E."
                    },
                    {
                        "name": "Vidotto M."
                    },
                    {
                        "name": "Walsh I."
                    }
                ],
                "citationCount": 113,
                "date": "2011-07-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "RING: networking interacting residues, evolutionary information and energetics in protein structures"
            },
            "pmid": "21493660",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool",
        "Web API",
        "Web application"
    ],
    "topic": [
        {
            "term": "Protein structure analysis",
            "uri": "http://edamontology.org/topic_2814"
        }
    ],
    "validated": 1,
    "version": [
        "3.0"
    ]
}
