
{
    "credit": [
        {
            "name": "University of Padua, Department of Biomedical Sciences, BioComputing UP lab",
            "typeEntity": "Institute",
            "typeRoles": [
                "Provider"
            ],
            "url": "http://protein.bio.unipd.it/"
        },
        {
            "name": "ELIXIR-ITA-PADOVA",
            "typeEntity": "Project",
            "typeRoles": [
                "Support"
            ],
            "url": "http://elixir.bio.unipd.it/"
        },
        {
            "email": "silvio.tosatto@unipd.it",
            "name": "Silvio C.E. Tosatto",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://protein.bio.unipd.it"
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://protein.bio.unipd.it/ring/help"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Prediction and recognition",
                    "uri": "http://edamontology.org/operation_2423"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web API",
            "Web application"
        ],
        "topic": [
            {
                "term": "Protein structure analysis",
                "uri": "http://edamontology.org/topic_2814"
            }
        ]
    },
    "publication": [
        {
            "abstract": "Motivation: Residue interaction networks (RINs) have been used in the literature to describe the protein 3D structure as a graph where nodes represent residues and edges physico-chemical interactions, e.g. hydrogen bonds or van-der-Waals contacts. Topological network parameters can be calculated over RINs and have been correlated with various aspects of protein structure and function. Here we present a novel web server, RING, to construct physico-chemically valid RINs interactively from PDB files for subsequent visualization in the Cytoscape platform. The additional structure-based parameters secondary structure, solvent accessibility and experimental uncertainty can be combined with information regarding residue conservation, mutual information and residue-based energy scoring functions. Different visualization styles are provided to facilitate visualization and standard plugins can be used to calculate topological parameters in Cytoscape. A sample use case analyzing the active site of glutathione peroxidase is presented. © The Author 2011. Published by Oxford University Press. All rights reserved.",
            "authors": [
                "Martin A.J.M.",
                "Vidotto M.",
                "Boscariol F.",
                "Di Domenico T.",
                "Walsh I.",
                "Tosatto S.C.E."
            ],
            "cit_count": 60,
            "doi": "10.1093/bioinformatics/btr191",
            "journal": "Bioinformatics",
            "title": "RING: networking interacting residues, evolutionary information and energetics in protein structures",
            "type": "Primary",
            "year": "2011-07-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:ring",
        "biotoolsID": "ring",
        "description": "Residue interaction network generation method for Cytoscape.",
        "homepage": "http://protein.bio.unipd.it/ring",
        "name": "RING",
        "version": [
            "1.0"
        ]
    }
}