{
    "additionDate": "2019-11-14T18:24:48Z",
    "biotoolsCURIE": "biotools:SingleCellNet",
    "biotoolsID": "SingleCellNet",
    "confidence_flag": "tool",
    "description": "> HOMEPAGE MISSING! | A Computational Tool to Classify Single Cell RNA-Seq Data Across Platforms and Across Species | Single-cell RNA-seq has emerged as a powerful tool in diverse applications, from determining the cell-type composition of tissues to uncovering regulators of developmental programs. A near-universal step in the analysis of single-cell RNA-seq data is to hypothesize the identity of each cell. Often, this is achieved by searching for combinations of genes that have previously been implicated as being cell-type specific, an approach that is not quantitative and does not explicitly take advantage of other single-cell RNA-seq studies. Here, we describe our tool, SingleCellNet, which addresses these issues and enables the classification of query single-cell RNA-seq data in comparison to reference single-cell RNA-seq data. SingleCellNet compares favorably to other methods in sensitivity and specificity, and it is able to classify across platforms and species",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "RNA-Seq quantification",
                    "uri": "http://edamontology.org/operation_3800"
                }
            ]
        }
    ],
    "homepage": "https://github.com/pcahan1/singleCellNet/",
    "lastUpdate": "2020-12-20T15:12:47Z",
    "name": "SingleCellNet",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1016/J.CELS.2019.06.004",
            "metadata": {
                "abstract": "© 2019 Elsevier Inc.Single-cell RNA-seq has emerged as a powerful tool in diverse applications, from determining the cell-type composition of tissues to uncovering regulators of developmental programs. A near-universal step in the analysis of single-cell RNA-seq data is to hypothesize the identity of each cell. Often, this is achieved by searching for combinations of genes that have previously been implicated as being cell-type specific, an approach that is not quantitative and does not explicitly take advantage of other single-cell RNA-seq studies. Here, we describe our tool, SingleCellNet, which addresses these issues and enables the classification of query single-cell RNA-seq data in comparison to reference single-cell RNA-seq data. SingleCellNet compares favorably to other methods in sensitivity and specificity, and it is able to classify across platforms and species. We highlight SingleCellNet's utility by classifying previously undetermined cells, and by assessing the outcome of a cell fate engineering experiment. A major obstacle in analyzing single-cell RNA-seq data is determining the identity of each cell. Often this process is time-consuming, error prone, and lacking in quantitative rigor. We have addressed this challenge by developing SingleCellNet (SCN), which provides a quantitative classification of single-cell RNA-seq data. SCN compares favorably to other methods in sensitivity and specificity. One of the major advantages of SCN is that it is possible to use it to classify cells across platforms and across species.",
                "authors": [
                    {
                        "name": "Tan Y."
                    },
                    {
                        "name": "Cahan P."
                    }
                ],
                "citationCount": 17,
                "date": "2019-08-28T00:00:00Z",
                "journal": "Cell Systems",
                "title": "SingleCellNet: A Computational Tool to Classify Single Cell RNA-Seq Data Across Platforms and Across Species"
            },
            "pmcid": "PMC6715530",
            "pmid": "31377170"
        }
    ],
    "topic": [
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ],
    "validated": 1
}