{
    "additionDate": "2019-11-14T20:12:11Z",
    "biotoolsCURIE": "biotools:peritumoral-regions",
    "biotoolsID": "peritumoral-regions",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "Matthew.Schabath@Moffitt.org",
            "name": "Matthew B. Schabath",
            "typeEntity": "Person"
        }
    ],
    "description": "Stability and reproducibility of computed tomography radiomic features extracted from peritumoral regions of lung cancer lesions | Identifying peritumoral regions of lung lesions",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Read binning",
                    "uri": "http://edamontology.org/operation_3798"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/TunaliIlke/peritumoral_regions/",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2021-01-07T19:15:53Z",
    "name": "peritumoral regions",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1002/MP.13808",
            "metadata": {
                "abstract": "© 2019 American Association of Physicists in MedicinePurpose: Recent efforts have demonstrated that radiomic features extracted from the peritumoral region, the area surrounding the tumor parenchyma, have clinical utility in various cancer types. However, as like any radiomic features, peritumoral features could also be unstable and/or nonreproducible. Hence, the purpose of this study was to assess the stability and reproducibility of computed tomography (CT) radiomic features extracted from the peritumoral regions of lung lesions where stability was defined as the consistency of a feature by different segmentations, and reproducibility was defined as the consistency of a feature to different image acquisitions. Methods: Stability was measured utilizing the “moist run” dataset and reproducibility was measured utilizing the Reference Image Database to Evaluate Therapy Response test–retest dataset. Peritumoral radiomic features were extracted from incremental distances of 3–12 mm outside the tumor segmentation. A total of 264 statistical, histogram, and texture radiomic features were assessed from the selected peritumoral region-of-interests (ROIs). All features (except wavelet texture features) were extracted using standardized algorithms defined by the Image Biomarker Standardisation Initiative. Stability and reproducibility of features were assessed using the concordance correlation coefficient. The clinical utility of stable and reproducible peritumoral features was tested in three previously published lung cancer datasets using overall survival as the endpoint. Results: Features found to be stable and reproducible, regardless of the peritumoral distances, included statistical, histogram, and a subset of texture features suggesting that these features are less affected by changes (e.g., size or shape) of the peritumoral region due to different segmentations and image acquisitions. The stability and reproducibility of Laws and wavelet texture features were inconsistent across all peritumoral distances. The analyses also revealed that a subset of features were consistently stable irrespective of the initial parameters (e.g., seed point) for a given segmentation algorithm. No significant differences were found in stability for features that were extracted from ROIs bounded by a lung parenchyma mask versus ROIs that were not bounded by a lung parenchyma mask (i.e., peritumoral regions that extended outside of lung parenchyma). After testing the clinical utility of peritumoral features, stable and reproducible features were shown to be more likely to create repeatable models than unstable and nonreproducible features. Conclusions: This study identified a subset of stable and reproducible CT radiomic features extracted from the peritumoral region of lung lesions. The stable and reproducible features identified in this study could be applied to a feature selection pipeline for CT radiomic analyses. According to our findings, top performing features in survival models were more likely to be stable and reproducible hence, it may be best practice to utilize them to achieve repeatable studies and reduce the chance of overfitting.",
                "authors": [
                    {
                        "name": "Cherezov D."
                    },
                    {
                        "name": "Gillies R.J."
                    },
                    {
                        "name": "Guvenis A."
                    },
                    {
                        "name": "Hall L.O."
                    },
                    {
                        "name": "Napel S."
                    },
                    {
                        "name": "Schabath M.B."
                    },
                    {
                        "name": "Tunali I."
                    }
                ],
                "citationCount": 16,
                "date": "2019-11-01T00:00:00Z",
                "journal": "Medical Physics",
                "title": "Stability and reproducibility of computed tomography radiomic features extracted from peritumoral regions of lung cancer lesions"
            },
            "pmcid": "PMC6842054",
            "pmid": "31494946"
        }
    ],
    "topic": [
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Tomography",
            "uri": "http://edamontology.org/topic_3452"
        }
    ],
    "validated": 1
}
