{
    "accessibility": "Open access",
    "additionDate": "2022-09-04T23:55:33.817009Z",
    "biotoolsCURIE": "biotools:papaml",
    "biotoolsID": "papaml",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "jueschm@uni-muenster.de",
            "name": "Jürgen Schmitz",
            "orcidid": "https://orcid.org/0000-0002-4686-861X",
            "typeEntity": "Person"
        },
        {
            "email": "r_stef04@uni-muenster.de",
            "name": "Raphael Steffen",
            "orcidid": "https://orcid.org/0000-0003-4947-3899",
            "typeEntity": "Person"
        },
        {
            "name": "Anna Pawluchin"
        },
        {
            "name": "Oliver Soehnlein"
        }
    ],
    "description": "An Improved Computational Tool to Explore Selection Pressure on Protein-Coding Sequences.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Phylogenetic footprinting",
                    "uri": "http://edamontology.org/operation_0327"
                },
                {
                    "term": "Phylogenetic reconstruction",
                    "uri": "http://edamontology.org/operation_3478"
                },
                {
                    "term": "Phylogenetic tree editing",
                    "uri": "http://edamontology.org/operation_0326"
                }
            ]
        }
    ],
    "homepage": "https://github.com/RetroWWU/paPAML",
    "language": [
        "Perl"
    ],
    "lastUpdate": "2022-09-04T23:55:33.819441Z",
    "license": "Not licensed",
    "name": "paPAML",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.3390/GENES13061090",
            "metadata": {
                "abstract": "© 2022 by the authors. Licensee MDPI, Basel, Switzerland.Evolution is change over time. Although neutral changes promoted by drift effects are most reliable for phylogenetic reconstructions, selection-relevant changes are of only limited use to reconstruct phylogenies. On the other hand, comparative analyses of neutral and selected changes of protein-coding DNA sequences (CDS) retrospectively tell us about episodic constrained, relaxed, and adaptive incidences. The ratio of sites with nonsynonymous (amino acid altering) versus synonymous (not altering) mutations directly measures selection pressure and can be analysed by using the Phylogenetic Analysis by Maximum Likelihood (PAML) software package. We developed a CDS extractor for compiling protein-coding sequences (CDS-extractor) and parallel PAML (pa-PAML) to simplify, amplify, and accelerate selection analyses via parallel processing, including detection of negatively selected sites. paPAML compiles results of site, branch-site, and branch models and detects site-specific negative selection with the output of a codon list labelling significance values. The tool simplifies selection analyses for casual and inexperienced users and accelerates computing speeds up to the number of allocated computer threads. We then applied paPAML to examine the evolutionary impact on a new GINS Complex Subunit 3 exon, and neutrophil-associated as well as lysin and apolipoprotein genes. Compared with codeml (PAML version 4.9j) and HyPhy (HyPhy FEL version 2.5.26), all paPAML test runs performed with 10 computing threads led to identical selection pressure results, whereas the total selection analysis via paPAML, including all model comparisons, was about 3 to 5 times faster than the longest running codeml model and about 7 to 15 times faster than the entire processing time of these codeml runs.",
                "authors": [
                    {
                        "name": "Grundmann N."
                    },
                    {
                        "name": "Ogoniak L."
                    },
                    {
                        "name": "Pawluchin A."
                    },
                    {
                        "name": "Schmitz J."
                    },
                    {
                        "name": "Soehnlein O."
                    },
                    {
                        "name": "Steffen R."
                    }
                ],
                "date": "2022-06-01T00:00:00Z",
                "journal": "Genes",
                "title": "paPAML: An Improved Computational Tool to Explore Selection Pressure on Protein-Coding Sequences"
            },
            "pmcid": "PMC9222883",
            "pmid": "35741852"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Phylogeny",
            "uri": "http://edamontology.org/topic_0084"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ],
    "validated": 1
}
