{
    "additionDate": "2022-06-08T09:30:43.568424Z",
    "biotoolsCURIE": "biotools:aristotle",
    "biotoolsID": "aristotle",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "mehrdadmansouri@yahoo.com",
            "name": "Mehrdad Mansouri",
            "typeEntity": "Person"
        }
    ],
    "description": "Aristotle addresses the two challenges intrinsic to omics data: high dimensionality and hidden stratification. It employs existing biological knowledge and a state-of-the-art patient stratification method to tackle the above challenges and applies a quasi-experimental design method to each stratum to find stratum-specific potential causes.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "SNP annotation",
                    "uri": "http://edamontology.org/operation_3661"
                },
                {
                    "term": "SNP detection",
                    "uri": "http://edamontology.org/operation_0484"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://github.com/MehrdadMansouri/Aristotle",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2022-06-08T09:31:12.465300Z",
    "name": "Aristotle",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1186/S12859-021-04521-W",
            "metadata": {
                "abstract": "© 2022, The Author(s).Background: There has been a simultaneous increase in demand and accessibility across genomics, transcriptomics, proteomics and metabolomics data, known as omics data. This has encouraged widespread application of omics data in life sciences, from personalized medicine to the discovery of underlying pathophysiology of diseases. Causal analysis of omics data may provide important insight into the underlying biological mechanisms. Existing causal analysis methods yield promising results when identifying potential general causes of an observed outcome based on omics data. However, they may fail to discover the causes specific to a particular stratum of individuals and missing from others. Methods: To fill this gap, we introduce the problem of stratified causal discovery and propose a method, Aristotle, for solving it. Aristotle addresses the two challenges intrinsic to omics data: high dimensionality and hidden stratification. It employs existing biological knowledge and a state-of-the-art patient stratification method to tackle the above challenges and applies a quasi-experimental design method to each stratum to find stratum-specific potential causes. Results: Evaluation based on synthetic data shows better performance for Aristotle in discovering true causes under different conditions compared to existing causal discovery methods. Experiments on a real dataset on Anthracycline Cardiotoxicity indicate that Aristotle’s predictions are consistent with the existing literature. Moreover, Aristotle makes additional predictions that suggest further investigations.",
                "authors": [
                    {
                        "name": "Chindelevitch L."
                    },
                    {
                        "name": "Ester M."
                    },
                    {
                        "name": "Khakabimamaghani S."
                    },
                    {
                        "name": "Mansouri M."
                    }
                ],
                "date": "2022-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Aristotle: stratified causal discovery for omics data"
            },
            "pmcid": "PMC8760642",
            "pmid": "35033007"
        }
    ],
    "topic": [
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        },
        {
            "term": "Personalised medicine",
            "uri": "http://edamontology.org/topic_3577"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        }
    ],
    "validated": 1
}
