{
    "accessibility": "Open access",
    "additionDate": "2022-06-11T12:59:01.314203Z",
    "biotoolsCURIE": "biotools:deepsmote",
    "biotoolsID": "deepsmote",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Damien Dablain"
        },
        {
            "name": "Bartosz Krawczyk",
            "orcidid": "https://orcid.org/0000-0002-9774-0106"
        }
    ],
    "description": "Fusing Deep Learning and SMOTE for Imbalanced Data.",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://github.com/dd1github/DeepSMOTE",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-06-11T12:59:01.316559Z",
    "license": "Not licensed",
    "name": "DeepSMOTE",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1109/TNNLS.2021.3136503",
            "metadata": {
                "abstract": "AuthorDespite over two decades of progress, imbalanced data is still considered a significant challenge for contemporary machine learning models. Modern advances in deep learning have further magnified the importance of the imbalanced data problem, especially when learning from images. Therefore, there is a need for an oversampling method that is specifically tailored to deep learning models, can work on raw images while preserving their properties, and is capable of generating high-quality, artificial images that can enhance minority classes and balance the training set. We propose Deep synthetic minority oversampling technique (SMOTE), a novel oversampling algorithm for deep learning models that leverages the properties of the successful SMOTE algorithm. It is simple, yet effective in its design. It consists of three major components: 1) an encoder/decoder framework; 2) SMOTE-based oversampling; and 3) a dedicated loss function that is enhanced with a penalty term. An important advantage of DeepSMOTE over generative adversarial network (GAN)-based oversampling is that DeepSMOTE does not require a discriminator, and it generates high-quality artificial images that are both information-rich and suitable for visual inspection. DeepSMOTE code is publicly available at https://github.com/dd1github/DeepSMOTE.",
                "authors": [
                    {
                        "name": "Chawla N.V."
                    },
                    {
                        "name": "Dablain D."
                    },
                    {
                        "name": "Krawczyk B."
                    }
                ],
                "citationCount": 2,
                "date": "2022-01-01T00:00:00Z",
                "journal": "IEEE Transactions on Neural Networks and Learning Systems",
                "title": "DeepSMOTE: Fusing Deep Learning and SMOTE for Imbalanced Data"
            },
            "pmid": "35085094"
        }
    ],
    "toolType": [
        "Workbench"
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        }
    ],
    "validated": 1
}
