{
    "additionDate": "2017-12-18T00:15:04Z",
    "biotoolsCURIE": "biotools:isno-aapair",
    "biotoolsID": "isno-aapair",
    "credit": [
        {
            "email": "xuyan@ustb.edu.cn",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "New predictor which was developed by taking into account the coupling effects for all the pairs formed by the nearest residues and the pairs by the next nearest residues along protein chains.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://app.aporc.org/iSNO-AAPair/ReadMe.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein sequence analysis",
                    "uri": "http://edamontology.org/operation_2479"
                }
            ]
        }
    ],
    "homepage": "http://app.aporc.org/iSNO-AAPair/",
    "lastUpdate": "2019-01-10T04:11:15Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/isno-aapair-predicting-the-cysteine-s-nitrosylation-sites-in-proteins.html"
        }
    ],
    "name": "iSNO-AAPair",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.7717/peerj.171",
            "metadata": {
                "abstract": "As one of the most important and universal posttranslational modifications (PTMs) of proteins, S-nitrosylation (SNO) plays crucial roles in a variety of biological processes, including the regulation of cellular dynamics and many signaling events. Knowledge of SNO sites in proteins is very useful for drug development and basic research as well. Unfortunately, it is both time-consuming and costly to determine the SNO sites purely based on biological experiments. Facing the explosive protein sequence data generated in the post-genomic era, we are challenged to develop automated vehicles for timely and effectively determining the SNO sites for uncharacterized proteins. To address the challenge, a new predictor called iSNO-AAPair was developed by taking into account the coupling effects for all the pairs formed by the nearest residues and the pairs by the next nearest residues along protein chains. The cross-validation results on a state-of-the-art benchmark have shown that the new predictor outperformed the existing predictors. The same was true when tested by the independent proteins whose experimental SNO sites were known. A user-friendly web-server for iSNO-AAPair was established at http://app.aporc.org/iSNO-AAPair/, by which users can easily obtain their desired results without the need to follow the mathematical equations involved during its development. © 2013 Xu et al.",
                "authors": [
                    {
                        "name": "Xu Y."
                    },
                    {
                        "name": "Shao X.-J."
                    },
                    {
                        "name": "Wu L.-Y."
                    },
                    {
                        "name": "Deng N.-Y."
                    },
                    {
                        "name": "Chou K.-C."
                    }
                ],
                "citationCount": 252,
                "date": "2013-10-14T00:00:00Z",
                "journal": "PeerJ",
                "title": "ISNO-AAPair: Incorporating amino acid pairwise coupling into PseAAC for predicting cysteine S-nitrosylation sites in proteins"
            },
            "pmcid": "PMC3792191",
            "pmid": "24109555",
            "type": [
                "Primary"
            ]
        },
        {
            "metadata": {
                "abstract": "With the accomplishment of human genome sequencing, the number of sequence-known proteins has increased explosively. In contrast, the pace is much slower in determining their biological attributes. As a consequence, the gap between sequence-known proteins and attribute-known proteins has become increasingly large. The unbalanced situation, which has critically limited our ability to timely utilize the newly discovered proteins for basic research and drug development, has called for developing computational methods or high-throughput automated tools for fast and reliably identifying various attributes of uncharacterized proteins based on their sequence information alone. Actually, during the last two decades or so, many methods in this regard have been established in hope to bridge such a gap. In the course of developing these methods, the following things were often needed to consider: (1) benchmark dataset construction, (2) protein sample formulation, (3) operating algorithm (or engine), (4) anticipated accuracy, and (5) web-server establishment. In this review, we are to discuss each of the five procedures, with a special focus on the introduction of pseudo amino acid composition (PseAAC), its different modes and applications as well as its recent development, particularly in how to use the general formulation of PseAAC to reflect the core and essential features that are deeply hidden in complicated protein sequences. © 2010 Elsevier Ltd.",
                "authors": [
                    {
                        "name": "Chou K.-C."
                    }
                ],
                "citationCount": 1096,
                "date": "2011-03-21T00:00:00Z",
                "journal": "Journal of Theoretical Biology",
                "title": "Some remarks on protein attribute prediction and pseudo amino acid composition"
            },
            "pmid": "21168420"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        }
    ],
    "validated": 1
}