{
    "additionDate": "2017-08-03T19:07:37Z",
    "biotoolsCURIE": "biotools:opph",
    "biotoolsID": "opph",
    "credit": [
        {
            "email": "rvijaya@cs.ucf.edu",
            "name": "Ravi VijayaSatya",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://vlsi.cs.ucf.edu/"
        }
    ],
    "description": "Optimal algorithm for perfect phylogeny haplotyping.The perfect phylogeny haplotyping (PPH) problem is one of the many computational approaches to the haplotype inference (HI)  problem. This algorithm is one of the first O(nm) algorithms presented for the PPH problem.",
    "documentation": [
        {
            "type": "General",
            "url": "http://vlsi.cs.ucf.edu/nsf/software/opph/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Haplotype mapping",
                    "uri": "http://edamontology.org/operation_0487"
                }
            ]
        }
    ],
    "homepage": "http://vlsi.cs.ucf.edu/nsf/software/opph/",
    "language": [
        "C++"
    ],
    "lastUpdate": "2018-12-10T12:58:52Z",
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/opph-1-0-perfect-phylogeny-haplotyping.html"
        }
    ],
    "name": "opph",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Inferring haplotype data from genotype data is a crucial step in linking SNPs to human diseases. Given n genotypes over m SNP sites, the haplotype inference (HI) problem deals with finding a set of haplotypes so that each given genotype can be formed by a combining a pair of haplotypes from the set. The perfect phylogeny haplotyping (PPH) problem is one of the many computational approaches to the HI problem. Though it was conjectured that the complexity of the PPH problem was O(nm), the complexity of all the solutions presented until recently was O(nm2). In this paper, we make complete use of the column-ordering that was presented earlier and show that there must be some interdependencies among the pairwise relationships between SNP sites in order for the given genotypes to allow a perfect phylogeny. Based on these interdependencies, we introduce the FlexTree (flexible tree) data structure that represents all the pairwise relationships in O(m) space. The FlexTree data structure provides a compact representation of all the perfect phylogenies for the given set of genotypes. We also introduce an ordering of the genotypes that allows the genotypes to be added to the FlexTree sequentially. The column ordering, the FlexTree data structure, and the row ordering we introduce make the O(nm) OPPH algorithm possible. We present some results on simulated data which demonstrate that the OPPH algorithm performs quiet impressively when compared to the previous algorithms. The OPPH algorithm is one of the first O(nm) algorithms presented for the PPH problem. © Mary Ann Liebert, Inc.",
                "authors": [
                    {
                        "name": "Vijayasatya R."
                    },
                    {
                        "name": "Mukherjee A."
                    }
                ],
                "citationCount": 13,
                "date": "2006-05-01T00:00:00Z",
                "journal": "Journal of Computational Biology",
                "title": "An optimal algorithm for perfect phylogeny haplotyping"
            },
            "pmid": "16761918"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Phylogeny",
            "uri": "http://edamontology.org/topic_0084"
        },
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        },
        {
            "term": "Human genetics",
            "uri": "http://edamontology.org/topic_3574"
        }
    ],
    "validated": 1
}