{
    "additionDate": "2021-01-18T11:47:37Z",
    "biotoolsCURIE": "biotools:ptmsnp",
    "biotoolsID": "ptmsnp",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "renjian@sysucc.org.cn",
            "name": "Jian Ren",
            "typeEntity": "Person"
        },
        {
            "email": "xieyb6@mail.sysu.edu.cn",
            "name": "Yubin Xie",
            "typeEntity": "Person"
        }
    ],
    "description": "A Web Server for the Identification of Driver Mutations That Affect Protein Post-translational Modification.\n\nPTMsnp! Identifying mutations that.\n\nProtein post-translational modifications (PTMs) is one of the most important regulation mechanisms in mammalian cells, which orchestrates the proper function of almost all cellular proteins. Genetic mutations, can significantly alter the status of PTMs, leading to serious pathological changes in body systems. Therefore, annotation of genetic mutations based on the effects on PTM may be important for providing potential guidance in the development of new therapeutic strategies and drugs for patients. PTMsnp is specifically designed to characterize such genetic mutations, and can be further used to find key proteins that potentially drive disease progression.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "PTM identification",
                    "uri": "http://edamontology.org/operation_3645"
                },
                {
                    "term": "PTM site prediction",
                    "uri": "http://edamontology.org/operation_0417"
                },
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                }
            ]
        }
    ],
    "homepage": "http://ptmsnp.renlab.org",
    "lastUpdate": "2021-01-29T18:17:17Z",
    "name": "PTMsnp",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.3389/FCELL.2020.593661",
            "metadata": {
                "abstract": "© Copyright © 2020 Peng, Li, Hu, Zhang, Chen, Lin, Zuo, Xue, Ren and Xie.High-throughput sequencing technologies have identified millions of genetic mutations in multiple human diseases. However, the interpretation of the pathogenesis of these mutations and the discovery of driver genes that dominate disease progression is still a major challenge. Combining functional features such as protein post-translational modification (PTM) with genetic mutations is an effective way to predict such alterations. Here, we present PTMsnp, a web server that implements a Bayesian hierarchical model to identify driver genetic mutations targeting PTM sites. PTMsnp accepts genetic mutations in a standard variant call format or tabular format as input and outputs several interactive charts of PTM-related mutations that potentially affect PTMs. Additional functional annotations are performed to evaluate the impact of PTM-related mutations on protein structure and function, as well as to classify variants relevant to Mendelian disease. A total of 4,11,574 modification sites from 33 different types of PTMs and 1,776,848 somatic mutations from TCGA across 33 different cancer types are integrated into the web server, enabling identification of candidate cancer driver genes based on PTM. Applications of PTMsnp to the cancer cohorts and a GWAS dataset of type 2 diabetes identified a set of potential drivers together with several known disease-related genes, indicating its reliability in distinguishing disease-related mutations and providing potential molecular targets for new therapeutic strategies. PTMsnp is freely available at: http://ptmsnp.renlab.org.",
                "authors": [
                    {
                        "name": "Chen L."
                    },
                    {
                        "name": "Hu B."
                    },
                    {
                        "name": "Li H."
                    },
                    {
                        "name": "Lin S."
                    },
                    {
                        "name": "Peng D."
                    },
                    {
                        "name": "Ren J."
                    },
                    {
                        "name": "Xie Y."
                    },
                    {
                        "name": "Xue Y."
                    },
                    {
                        "name": "Zhang H."
                    },
                    {
                        "name": "Zuo Z."
                    }
                ],
                "citationCount": 1,
                "date": "2020-11-10T00:00:00Z",
                "journal": "Frontiers in Cell and Developmental Biology",
                "title": "PTMsnp: A Web Server for the Identification of Driver Mutations That Affect Protein Post-translational Modification"
            },
            "pmcid": "PMC7683509",
            "pmid": "33240890"
        }
    ],
    "topic": [
        {
            "term": "GWAS study",
            "uri": "http://edamontology.org/topic_3517"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Protein modifications",
            "uri": "http://edamontology.org/topic_0601"
        }
    ]
}
