{
    "additionDate": "2018-09-25T01:23:31Z",
    "biotoolsCURIE": "biotools:rocketship",
    "biotoolsID": "rocketship",
    "credit": [
        {
            "email": "sabarnes@llu.edu",
            "name": "Sam Barnes",
            "orcidid": "http://orcid.org/0000-0002-1065-8442",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "ROCKETSHIP, an open-source  software for dynamic contrast-enhanced magnetic resonance imaging analysis.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/petmri/ROCKETSHIP/wiki"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                }
            ]
        }
    ],
    "homepage": "https://github.com/petmri/ROCKETSHIP",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2019-01-11T01:05:32Z",
    "license": "GPL-2.0",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/petmri/ROCKETSHIP/issues"
        }
    ],
    "name": "ROCKETSHIP",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "daniel_stefan",
    "publication": [
        {
            "doi": "10.1186/s12880-015-0062-3",
            "metadata": {
                "abstract": "© 2015 Barnes et al.Background: Dynamic contrast-enhanced magnetic resonance imaging (DCE-MRI) is a promising technique to characterize pathology and evaluate treatment response. However, analysis of DCE-MRI data is complex and benefits from concurrent analysis of multiple kinetic models and parameters. Few software tools are currently available that specifically focuses on DCE-MRI analysis with multiple kinetic models. Here, we developed ROCKETSHIP, an open-source, flexible and modular software for DCE-MRI analysis. ROCKETSHIP incorporates analyses with multiple kinetic models, including data-driven nested model analysis. Results: ROCKETSHIP was implemented using the MATLAB programming language. Robustness of the software to provide reliable fits using multiple kinetic models is demonstrated using simulated data. Simulations also demonstrate the utility of the data-driven nested model analysis. Applicability of ROCKETSHIP for both preclinical and clinical studies is shown using DCE-MRI studies of the human brain and a murine tumor model. Conclusion: A DCE-MRI software suite was implemented and tested using simulations. Its applicability to both preclinical and clinical datasets is shown. ROCKETSHIP was designed to be easily accessible for the beginner, but flexible enough for changes or additions to be made by the advanced user as well. The availability of a flexible analysis tool will aid future studies using DCE-MRI.",
                "authors": [
                    {
                        "name": "Barnes S.R."
                    },
                    {
                        "name": "Ng T.S.C."
                    },
                    {
                        "name": "Santa-Maria N."
                    },
                    {
                        "name": "Montagne A."
                    },
                    {
                        "name": "Zlokovic B.V."
                    },
                    {
                        "name": "Jacobs R.E."
                    }
                ],
                "citationCount": 34,
                "date": "2015-06-16T00:00:00Z",
                "journal": "BMC Medical Imaging",
                "title": "ROCKETSHIP: A flexible and modular software tool for the planning, processing and analysis of dynamic MRI studies"
            },
            "pmcid": "PMC4466867",
            "pmid": "26076957",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        }
    ],
    "validated": 1
}