{
    "additionDate": "2018-05-22T18:38:05Z",
    "biotoolsCURIE": "biotools:intb",
    "biotoolsID": "intb",
    "credit": [
        {
            "email": "jleal@igc.gulbenkian.pt",
            "name": "José B Pereira-Leal",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Data integration platform for molecular and clinical epidemiological analysis of tuberculosis.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://www.evocell.org/inTB/media/inTB-UserManual.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Genetic variation analysis",
                    "uri": "http://edamontology.org/operation_3197"
                },
                {
                    "term": "Virulence prediction",
                    "uri": "http://edamontology.org/operation_3461"
                }
            ]
        }
    ],
    "homepage": "http://www.evocell.org/inTB",
    "lastUpdate": "2018-12-10T12:58:58Z",
    "name": "inTB",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1186/1471-2105-14-264",
            "metadata": {
                "abstract": "Background: Tuberculosis is currently the second highest cause of death from infectious diseases worldwide. The emergence of multi and extensive drug resistance is threatening to make tuberculosis incurable. There is growing evidence that the genetic diversity of Mycobacterium tuberculosis may have important clinical consequences. Therefore, combining genetic, clinical and socio-demographic data is critical to understand the epidemiology of this infectious disease, and how virulence and other phenotypic traits evolve over time. This requires dedicated bioinformatics platforms, capable of integrating and enabling analyses of this heterogeneous data.Results: We developed inTB, a web-based system for integrated warehousing and analysis of clinical, socio-demographic and molecular data for Mycobacterium sp. isolates. As a database it can organize and display data from any of the standard genotyping methods (SNP, MIRU-VNTR, RFLP and spoligotype), as well as an extensive array of clinical and socio-demographic variables that are used in multiple countries to characterize the disease. Through the inTB interface it is possible to insert and download data, browse the database and search specific parameters. New isolates are automatically classified into strains according to an internal reference, and data uploaded or typed in is checked for internal consistency. As an analysis framework, the system provides simple, point and click analysis tools that allow multiple types of data plotting, as well as simple ways to download data for external analysis. Individual trees for each genotyping method are available, as well as a super tree combining all of them. The integrative nature of inTB grants the user the ability to generate trees for filtered subsets of data crossing molecular and clinical/socio-demografic information. inTB is built on open source software, can be easily installed locally and easily adapted to other diseases. Its design allows for use by research laboratories, hospitals or public health authorities. The full source code as well as ready to use packages is available at http://www.evocell.org/inTB.Conclusions: To the best of our knowledge, this is the only system capable of integrating different types of molecular data with clinical and socio-demographic data, empowering researchers and clinicians with easy to use analysis tools that were not possible before. © 2013 Soares et al.; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Soares P."
                    },
                    {
                        "name": "Alves R.J."
                    },
                    {
                        "name": "Abecasis A.B."
                    },
                    {
                        "name": "Penha-Goncalves C."
                    },
                    {
                        "name": "Gomes M.G.M."
                    },
                    {
                        "name": "Pereira-Leal J.B."
                    }
                ],
                "citationCount": 7,
                "date": "2013-08-30T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "InTB - a data integration platform for molecular and clinical epidemiological analysis of tuberculosis"
            },
            "pmcid": "PMC3847221",
            "pmid": "24001185"
        }
    ],
    "toolType": [
        "Web application",
        "Database portal"
    ],
    "topic": [
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Public health and epidemiology",
            "uri": "http://edamontology.org/topic_3305"
        },
        {
            "term": "Molecular genetics",
            "uri": "http://edamontology.org/topic_3321"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        }
    ],
    "validated": 1
}