
{
    "credit": [
        {
            "email": "cllu@cs.nthu.edu.tw",
            "name": "Chin Lung Lu",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://genome.cs.nthu.edu.tw/R3D-BLAST2/help.html"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "RNA secondary structure prediction",
                    "uri": "http://edamontology.org/operation_0278"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "PHP"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "RNA",
                "uri": "http://edamontology.org/topic_0099"
            },
            {
                "term": "Nucleic acid structure analysis",
                "uri": "http://edamontology.org/topic_0097"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© 2017 The Author(s). Background: RNA molecules have been known to play a variety of significant roles in cells. In principle, the functions of RNAs are largely determined by their three-dimensional (3D) structures. As more and more RNA 3D structures are available in the Protein Data Bank (PDB), a bioinformatics tool, which is able to rapidly and accurately search the PDB database for similar RNA 3D structures or substructures, is helpful to understand the structural and functional relationships of RNAs. Results: Since its first release in 2011, R3D-BLAST has become a useful tool for searching the PDB database for similar RNA 3D structures and substructures. It was implemented by a structural-alphabet (SA)-based method, which utilizes an SA with 23 structural letters to encode RNA 3D structures into one-dimensional (1D) structural sequences and applies BLAST to the resulting structural sequences for searching similar substructures of RNAs. In this study, we have upgraded R3D-BLAST to develop a new web server named R3D-BLAST2 based on a higher quality SA newly constructed from a representative and sufficiently non-redundant list of RNA 3D structures. In addition, we have modified the kernel program in R3D-BLAST2 so that it can accept an RNA structure in the mmCIF format as an input. The results of our experiments on a benchmark dataset have demonstrated that R3D-BLAST2 indeed performs very well in comparison to its earlier version R3D-BLAST and other similar tools RNA FRABASE, FASTR3D and RAG-3D by searching a larger number of RNA 3D substructures resembling those of the input RNA. Conclusions: R3D-BLAST2 is a valuable BLAST-like search tool that can more accurately scan the PDB database for similar RNA 3D substructures. It is publicly available at http://genome.cs.nthu.edu.tw/R3D-BLAST2/.",
            "authors": [
                "Yen C.-Y.",
                "Lin J.-C.",
                "Chen K.-T.",
                "Lu C.L."
            ],
            "cit_count": 1,
            "doi": "10.1186/s12859-017-1956-6",
            "journal": "BMC Bioinformatics",
            "title": "R3D-BLAST2: An improved search tool for similar RNA 3D substructures",
            "type": "Primary",
            "year": "2017-12-28"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:r3d-blast2",
        "biotoolsID": "r3d-blast2",
        "description": "Search tool for similar RNA 3D substructures.",
        "homepage": "http://140.114.85.168/R3D-BLAST2/",
        "name": "R3D-BLAST2"
    }
}