{
    "additionDate": "2017-08-03T18:44:16Z",
    "biotoolsCURIE": "biotools:ggd-lasso",
    "biotoolsID": "ggd-lasso",
    "credit": [
        {
            "email": "weicheng@nec-labs.com",
            "name": "Wei Cheng",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Robust approach for eQTL mapping.",
    "documentation": [
        {
            "type": "General",
            "url": "http://www.cs.unc.edu/~weicheng/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Pathway or network prediction",
                    "uri": "http://edamontology.org/operation_3439"
                }
            ]
        }
    ],
    "homepage": "http://www.cs.unc.edu/~weicheng/",
    "homepage_status": 1,
    "language": [
        "MATLAB",
        "C++"
    ],
    "lastUpdate": "2018-12-10T12:58:49Z",
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/ggd-lasso-graph-regularized-dual-lasso-for-robust-eqtl-mapping.html"
        }
    ],
    "name": "GGD-Lasso",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Motivation: As a promising tool for dissecting the genetic basis of complex traits, expression quantitative trait loci (eQTL) mapping has attracted increasing research interest. An important issue in eQTL mapping is how to effectively integrate networks representing interactions among genetic markers and genes. Recently, several Lasso-based methods have been proposed to leverage such network information. Despite their success, existing methods have three common limitations: (i) a preprocessing step is usually needed to cluster the networks; (ii) the incompleteness of the networks and the noise in them are not considered; (iii) other available information, such as location of genetic markers and pathway information are not integrated. Results: To address the limitations of the existing methods, we propose Graph-regularized Dual Lasso (GDL), a robust approach for eQTL mapping. GDL integrates the correlation structures among genetic markers and traits simultaneously. It also takes into account the incompleteness of the networks and is robust to the noise. GDL utilizes graph-based regularizers to model the prior networks and does not require an explicit clustering step. Moreover, it enables further refinement of the partial and noisy networks. We further generalize GDL to incorporate the location of genetic makers and gene-pathway information. We perform extensive experimental evaluations using both simulated and real datasets. Experimental results demonstrate that the proposed methods can effectively integrate various available priori knowledge and significantly outperform the state-of-the-art eQTL mapping methods. © 2014 The Author. Published by Oxford University Press. All rights reserved.",
                "authors": [
                    {
                        "name": "Cheng W."
                    },
                    {
                        "name": "Zhang X."
                    },
                    {
                        "name": "Guo Z."
                    },
                    {
                        "name": "Shi Y."
                    },
                    {
                        "name": "Wang W."
                    }
                ],
                "citationCount": 18,
                "date": "2014-06-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Graph-regularized dual Lasso for robust eQTL mapping"
            },
            "pmid": "24931977"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Nucleic acids",
            "uri": "http://edamontology.org/topic_0077"
        }
    ],
    "validated": 1
}