{
    "additionDate": "2021-01-18T11:46:21Z",
    "biotoolsCURIE": "biotools:cloud3dqsar",
    "biotoolsID": "cloud3dqsar",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "gefei_hao@foxmail.com",
            "name": "Ge-Fei Hao",
            "typeEntity": "Person"
        }
    ],
    "description": "a web tool for the development of quantitative structure-activity relationship models in drug discovery.\n\nThe Cloud 3D-QSAR Server is developed to help running 3D-QSAR jobs by submitting molecular structures and pKi values on web pages which is much more convenient than by command line. This server use Open3DQSAR as the QSAR software and Open Babel to process structure stuff.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Relation extraction",
                    "uri": "http://edamontology.org/operation_3625"
                },
                {
                    "term": "Virtual screening",
                    "uri": "http://edamontology.org/operation_3938"
                }
            ]
        }
    ],
    "homepage": "http://chemyang.ccnu.edu.cn/ccb/server/cloud3dQSAR/",
    "lastUpdate": "2021-02-12T16:02:34Z",
    "name": "Cloud 3D-QSAR",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1093/BIB/BBAA276",
            "metadata": {
                "abstract": "© The Author(s) 2020. Published by Oxford University Press. All rights reserved. For Permissions, please email: journals.permissions@oup.com.Effective drug discovery contributes to the treatment of numerous diseases but is limited by high costs and long cycles. The Quantitative Structure-Activity Relationship (QSAR) method was introduced to evaluate the activity of a large number of compounds virtually, reducing the time and labor costs required for chemical synthesis and experimental determination. Hence, this method increases the efficiency of drug discovery. To meet the needs of researchers to utilize this technology, numerous QSAR-related web servers, such as Web-4D-QSAR and DPubChem, have been developed in recent years. However, none of the servers mentioned above can perform a complete QSAR modeling and supply activity prediction functions. We introduce Cloud 3D-QSAR by integrating the functions of molecular structure generation, alignment, molecular interaction field (MIF) computing and results analysis to provide a one-stop solution. We rigidly validated this server, and the activity prediction correlation was R2 = 0.934 in 834 test molecules. The sensitivity, specificity and accuracy were 86.9%, 94.5% and 91.5%, respectively, with AUC = 0.981, AUCPR = 0.971. The Cloud 3D-QSAR server may facilitate the development of good QSAR models in drug discovery. Our server is free and now available at http://chemyang.ccnu.edu.cn/ccb/server/cloud3dQSAR/ and http://agroda.gzu.edu.cn:9999/ccb/server/cloud3dQSAR/.",
                "authors": [
                    {
                        "name": "Hao G.-F."
                    },
                    {
                        "name": "Jia C.-Y."
                    },
                    {
                        "name": "Shi X.-X."
                    },
                    {
                        "name": "Wang F."
                    },
                    {
                        "name": "Wang Y.-L."
                    },
                    {
                        "name": "Wu F.-X."
                    },
                    {
                        "name": "Yang G.-F."
                    }
                ],
                "citationCount": 5,
                "date": "2021-07-20T00:00:00Z",
                "journal": "Briefings in bioinformatics",
                "title": "Cloud 3D-QSAR: a web tool for the development of quantitative structure-activity relationship models in drug discovery"
            },
            "pmid": "33140820"
        }
    ],
    "topic": [
        {
            "term": "Drug development",
            "uri": "http://edamontology.org/topic_3373"
        },
        {
            "term": "Drug discovery",
            "uri": "http://edamontology.org/topic_3336"
        },
        {
            "term": "Pharmacology",
            "uri": "http://edamontology.org/topic_0202"
        },
        {
            "term": "Structure analysis",
            "uri": "http://edamontology.org/topic_0081"
        }
    ]
}
