{
    "additionDate": "2021-01-20T11:01:43Z",
    "biotoolsCURIE": "biotools:dpfact",
    "biotoolsID": "dpfact",
    "collectionID": [
        "Rare Disease"
    ],
    "confidence_flag": "tool",
    "description": "Privacy-Preserving Tensor Factorization for Collaborative Health Data Analysis.\n\nTensor factorization has been demonstrated as an efficient approach for computational phenotyping, where massive electronic health records (EHRs) are converted to concise and meaningful clinical concepts. While distributing the tensor factorization tasks to local sites can avoid direct data sharing, it still requires the exchange of intermediary results which could reveal sensitive patient information. Therefore, the challenge is how to jointly decompose the tensor under rigorous and principled privacy constraints, while still support the model's interpretability. We propose DPFact, a privacy-preserving collaborative tensor factorization method for computational phenotyping using EHR. It embeds advanced privacy-preserving mechanisms with collaborative learning",
    "editPermission": {
        "type": "private"
    },
    "homepage": "https://github.com/jma78/DPFact",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2021-05-14T06:22:34.259796Z",
    "name": "DPFact",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1145/3357384.3357878",
            "metadata": {
                "abstract": "© 2019 Copyright held by the owner/author(s). Publication rights licensed to Association for Computing Machinery.Tensor factorization has been demonstrated as an efficient approach for computational phenotyping, where massive electronic health records (EHRs) are converted to concise and meaningful clinical concepts. While distributing the tensor factorization tasks to local sites can avoid direct data sharing, it still requires the exchange of intermediary results which could reveal sensitive patient information. Therefore, the challenge is how to jointly decompose the tensor under rigorous and principled privacy constraints, while still support the model's interpretability. We propose DPFact, a privacy-preserving collaborative tensor factorization method for computational phenotyping using EHR. It embeds advanced privacy-preserving mechanisms with collaborative learning. Hospitals can keep their EHR database private but also collaboratively learn meaningful clinical concepts by sharing differentially private intermediary results. Moreover, DPFact solves the heterogeneous patient population using a structured sparsity term. In our framework, each hospital decomposes its local tensors and sends the updated intermediary results with output perturbation every several iterations to a semi-trusted server which generates the phenotypes. The evaluation on both real-world and synthetic datasets demonstrated that under strict privacy constraints, our method is more accurate and communication-efficient than state-of-the-art baseline methods.",
                "authors": [
                    {
                        "name": "Ma J."
                    },
                    {
                        "name": "Ho J.C."
                    },
                    {
                        "name": "Zhang Q."
                    },
                    {
                        "name": "Xiong L."
                    },
                    {
                        "name": "Lou J."
                    },
                    {
                        "name": "Jiang X."
                    }
                ],
                "citationCount": 4,
                "date": "2019-11-03T00:00:00Z",
                "journal": "International Conference on Information and Knowledge Management, Proceedings",
                "title": "Privacy-preserving tensor factorization for collaborative health data analysis"
            },
            "pmcid": "PMC6940039",
            "pmid": "31897355"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Data security",
            "uri": "http://edamontology.org/topic_3263"
        },
        {
            "term": "Rare diseases",
            "uri": "http://edamontology.org/topic_3325"
        }
    ]
}