{
    "additionDate": "2018-10-14T20:00:21Z",
    "biotoolsCURIE": "biotools:wavepropagator",
    "biotoolsID": "wavepropagator",
    "credit": [
        {
            "email": "buzmakov@gmail.com",
            "name": "Alexei Buzmakov",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "WavePropaGator is an interactive software framework for coherent and partially coherent X-ray wavefront propagation simulations.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://wpg.readthedocs.io/en/latest/index.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                }
            ]
        }
    ],
    "homepage": "https://github.com/samoylv/WPG",
    "language": [
        "Python"
    ],
    "lastUpdate": "2018-12-10T12:59:01Z",
    "license": "Other",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/samoylv/WPG/issues"
        }
    ],
    "name": "WavePropaGator",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "daniel_stefan",
    "publication": [
        {
            "doi": "10.1107/S160057671600995X",
            "metadata": {
                "abstract": "© Liubov Samoylova et al. 2016.This article describes the WavePropaGator (WPG) package, a new interactive software framework for coherent and partially coherent X-ray wavefront propagation simulations. The package has been developed at European XFEL for users at the existing and emerging free-electron laser (FEL) facilities, as well as at the third-generation synchrotron sources and future diffraction-limited storage rings. The WPG addresses the needs of beamline scientists and user groups to facilitate the design, optimization and improvement of X-ray optics to meet their experimental requirements. The package uses the Synchrotron Radiation Workshop (SRW) C/C++ library and its Python binding for numerical wavefront propagation simulations. The framework runs reliably under Linux, Microsoft Windows 7 and Apple Mac OS X and is distributed under an open-source license. The available tools allow for varying source parameters and optics layouts and visualizing the results interactively. The wavefront history structure can be used for tracking changes in every particular wavefront during propagation. The batch propagation mode enables processing of multiple wavefronts in workflow mode. The paper presents a general description of the package and gives some recent application examples, including modeling of full X-ray FEL beamlines and start-to-end simulation of experiments.The WavePropaGator (WPG) package is a new interactive cross-platform open-source software framework for modeling of coherent and partially coherent X-ray wavefront propagation. The WPG addresses the needs of beamline scientists and user groups to facilitate the design, optimization and improvement of X-ray optics to meet their experimental requirements. The paper presents a general description of the package and gives some recent application examples.",
                "authors": [
                    {
                        "name": "Buzmakov A."
                    },
                    {
                        "name": "Chubar O."
                    },
                    {
                        "name": "Samoylova L."
                    },
                    {
                        "name": "Sinn H."
                    }
                ],
                "citationCount": 25,
                "date": "2016-08-01T00:00:00Z",
                "journal": "Journal of Applied Crystallography",
                "title": "WavePropaGator: Interactive framework for X-ray free-electron laser optics design and simulations"
            },
            "pmcid": "PMC4970499",
            "pmid": "27504080",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Data architecture, analysis and design",
            "uri": "http://edamontology.org/topic_3365"
        },
        {
            "term": "X-ray diffraction",
            "uri": "http://edamontology.org/topic_2828"
        }
    ],
    "validated": 1
}
