{
    "additionDate": "2021-01-20T10:57:52Z",
    "biotoolsCURIE": "biotools:scang",
    "biotoolsID": "scang",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "xlin@hsph.harvard.edu",
            "name": "Xihong Lin",
            "typeEntity": "Person"
        }
    ],
    "description": "Dynamic Scan Procedure for Detecting Rare-Variant Association Regions in Whole-Genome Sequencing Studies.\n\nThis is an R package for performing SCANG procedure in whole genome sequencing studies.\n\nSCANG is an R package for performing a flexible and computationally efficient scan statistic procedure (SCANG) that uses the p-value of a variant set-based test as a scan statistic of each moving window, to detect rare variant association regions for both continuous and dichotomous traits.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Collapsing methods",
                    "uri": "http://edamontology.org/operation_3791"
                },
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                }
            ]
        }
    ],
    "homepage": "https://github.com/zilinli1988/SCANG",
    "language": [
        "C++",
        "R"
    ],
    "lastUpdate": "2021-05-20T05:56:19.334315Z",
    "name": "SCANG",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1016/J.AJHG.2019.03.002",
            "metadata": {
                "abstract": "© 2019 American Society of Human GeneticsWhole-genome sequencing (WGS)studies are being widely conducted in order to identify rare variants associated with human diseases and disease-related traits. Classical single-marker association analyses for rare variants have limited power, and variant-set-based analyses are commonly used by researchers for analyzing rare variants. However, existing variant-set-based approaches need to pre-specify genetic regions for analysis; hence, they are not directly applicable to WGS data because of the large number of intergenic and intron regions that consist of a massive number of non-coding variants. The commonly used sliding-window method requires the pre-specification of fixed window sizes, which are often unknown as a priori, are difficult to specify in practice, and are subject to limitations given that the sizes of genetic-association regions are likely to vary across the genome and phenotypes. We propose a computationally efficient and dynamic scan-statistic method (Scan the Genome [SCANG])for analyzing WGS data; this method flexibly detects the sizes and the locations of rare-variant association regions without the need to specify a prior, fixed window size. The proposed method controls for the genome-wise type I error rate and accounts for the linkage disequilibrium among genetic variants. It allows the detected sizes of rare-variant association regions to vary across the genome. Through extensive simulated studies that consider a wide variety of scenarios, we show that SCANG substantially outperforms several alternative methods for detecting rare-variant-associations while controlling for the genome-wise type I error rates. We illustrate SCANG by analyzing the WGS lipids data from the Atherosclerosis Risk in Communities (ARIC)study.",
                "authors": [
                    {
                        "name": "Li Z."
                    },
                    {
                        "name": "Li X."
                    },
                    {
                        "name": "Liu Y."
                    },
                    {
                        "name": "Shen J."
                    },
                    {
                        "name": "Chen H."
                    },
                    {
                        "name": "Zhou H."
                    },
                    {
                        "name": "Morrison A.C."
                    },
                    {
                        "name": "Boerwinkle E."
                    },
                    {
                        "name": "Lin X."
                    }
                ],
                "citationCount": 8,
                "date": "2019-05-02T00:00:00Z",
                "journal": "American Journal of Human Genetics",
                "title": "Dynamic Scan Procedure for Detecting Rare-Variant Association Regions in Whole-Genome Sequencing Studies"
            },
            "pmcid": "PMC6507043",
            "pmid": "30982610"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Whole genome sequencing",
            "uri": "http://edamontology.org/topic_3673"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        }
    ]
}