{"credit":[{"email":"pal-olof.westermark@charite.de","name":"Paal O. Westermark","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"url":"http://bioconductor.org/packages/release/bioc/html/profileScoreDist.html"}],"download":[{"type":"Source code","url":"http://bioconductor/packages/release/bioc/src/contrib/profileScoreDist_1.2.0.tar.gz"}],"function":[{"operation":[{"term":"Sequence motif recognition","uri":"http://edamontology.org/operation_0239"}]}],"labels":{"collectionID":["BioConductor"],"language":["R"],"license":"MIT","operatingSystem":["Linux","Windows","Mac"],"toolType":["Command-line tool","Library"],"topic":[{"term":"Sequence sites, features and motifs","uri":"http://edamontology.org/topic_0160"}]},"publication":[{"abstract":"© 2016 Pål O. Westermark.Circadian rhythms in transcription are generated by rhythmic abundances and DNA binding activities of transcription factors. Propagation of rhythms to transcriptional initiation involves the core promoter, its chromatin state, and the basal transcription machinery. Here, I characterize core promoters and chromatin states of genes transcribed in a circadian manner in mouse liver and in Drosophila. It is shown that the core promoter is a critical determinant of circadian mRNA expression in both species. A distinct core promoter class, strong circadian promoters (SCPs), is identified in mouse liver but not Drosophila. SCPs are defined by specific core promoter features, and are shown to drive circadian transcriptional activities with both high averages and high amplitudes. Data analysis and mathematical modeling further provided evidence for rhythmic regulation of both polymerase II recruitment and pause release at SCPs. The analysis provides a comprehensive and systematic view of core promoters and their link to circadian mRNA expression in mouse and Drosophila, and thus reveals a crucial role for the core promoter in regulated, dynamic transcription.","authors":["Westermark P.O."],"cit_count":5,"doi":"10.1371/journal.pgen.1006231","journal":"PLoS Genetics","title":"Linking Core Promoter Classes to Circadian Transcription","type":"Other","year":"2016-08-01"}],"summary":{"biotoolsCURIE":"biotools:profilescoredist","biotoolsID":"profilescoredist","description":"Regularization and score distributions for position count matrices.","homepage":"http://bioconductor.org/packages/release/bioc/html/profileScoreDist.html","name":"profileScoreDist","version":["1.2.0"]}}