{
    "accessibility": "Open access",
    "additionDate": "2022-05-21T00:17:00.218395Z",
    "biotoolsCURIE": "biotools:metex",
    "biotoolsID": "metex",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Brett C. Covington"
        },
        {
            "name": "Mohammad R. Seyedsayamdost",
            "orcidid": "https://orcid.org/0000-0003-2707-4854"
        }
    ],
    "description": "Metabolomics Explorer Application for Natural Product Discovery.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Feature extraction",
                    "uri": "http://edamontology.org/operation_3937"
                },
                {
                    "term": "Natural product identification",
                    "uri": "http://edamontology.org/operation_3803"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://mo.princeton.edu/MetEx/",
    "lastUpdate": "2024-11-24T20:09:11.892887Z",
    "name": "MetEx",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1021/acschembio.1c00737",
            "metadata": {
                "abstract": "Advances in next-generation DNA sequencing technologies, bioinformatics, and mass spectrometry-based metabolite detection have ushered in a new era of natural product discovery. Microbial secondary metabolomes are complex, especially when otherwise silent biosynthetic genes are activated, and there is therefore a need for data analysis software to explore and map the resulting multidimensional datasets. To that end, we herein report the Metabolomics Explorer (MetEx), a publicly available web application for the analysis of parallel liquid chromatography-coupled mass spectrometry (LC–MS)-based metabolomics data. MetEx is a highly interactive application that facilitates visualization and analysis of complex metabolomics datasets, consisting of retention time, m/z, and MS intensity features, as a function of hundreds of conditions or elicitors. The software enables prioritization of leads from three-dimensional maps, extraction of two-dimensional slices from various higher order plots, organization of datasets by elicitor chemotypes, customizable library-based dereplication, and automatically scored lead selection. We describe the application of MetEx to the first UPLC–MS-guided high-throughput elicitor screen in which Burkholderia gladioli was challenged with 750 elicitors, and the resulting profiles were interrogated by UPLC-Qtof-MS and subsequently analyzed with the app. We demonstrate the utility of MetEx by reporting elicitors for several cryptic metabolite groups and by uncovering new natural products that remain to be characterized. MetEx is available at https://mo.princeton.edu/MetEx/.",
                "authors": [
                    {
                        "name": "Covington B.C."
                    },
                    {
                        "name": "Seyedsayamdost M.R."
                    }
                ],
                "citationCount": 16,
                "date": "2021-12-17T00:00:00Z",
                "journal": "ACS Chemical Biology",
                "title": "MetEx, a Metabolomics Explorer Application for Natural Product Discovery"
            },
            "pmcid": "PMC9090437",
            "pmid": "34859662"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ],
    "validated": 1
}
