{
    "accessibility": "Open access",
    "additionDate": "2020-07-13T07:39:01Z",
    "biotoolsCURIE": "biotools:swissparam",
    "biotoolsID": "swissparam",
    "collectionID": [
        "3D-BioInfo",
        "3D-BioInfo-Protein-Ligand-Interactions"
    ],
    "cost": "Free of charge",
    "credit": [
        {
            "email": "vincent.zoete@sib.swiss",
            "name": "Vincent Zoete"
        }
    ],
    "description": "This service provides topology and parameters for small organic molecules compatible with the CHARMM all atoms force field, for use with CHARMM and GROMACS.",
    "editPermission": {
        "type": "private"
    },
    "elixirCommunity": [
        "3D-BioInfo"
    ],
    "elixirNode": [
        "Switzerland"
    ],
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Small molecule structure",
                        "uri": "http://edamontology.org/data_1463"
                    },
                    "format": [
                        {
                            "term": "Mol2",
                            "uri": "http://edamontology.org/format_3816"
                        }
                    ]
                }
            ],
            "operation": [
                {
                    "term": "Forcefield parameterisation",
                    "uri": "http://edamontology.org/operation_3893"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Forcefield parameters",
                        "uri": "http://edamontology.org/data_3871"
                    },
                    "format": [
                        {
                            "term": "GROMACS itp",
                            "uri": "http://edamontology.org/format_3883"
                        }
                    ]
                },
                {
                    "data": {
                        "term": "Topology data",
                        "uri": "http://edamontology.org/data_3872"
                    },
                    "format": [
                        {
                            "term": "CHARMM rtf",
                            "uri": "http://edamontology.org/format_3887"
                        }
                    ]
                }
            ]
        }
    ],
    "homepage": "http://swissparam.ch",
    "lastUpdate": "2020-07-13T07:39:01Z",
    "name": "SwissParam",
    "owner": "vzoete",
    "publication": [
        {
            "doi": "10.1002/jcc.21816",
            "metadata": {
                "abstract": "The drug discovery process has been deeply transformed recently by the use of computational ligand-based or structure-based methods, helping the lead compounds identification and optimization, and finally the delivery of new drug candidates more quickly and at lower cost. Structure-based computational methods for drug discovery mainly involve ligand-protein docking and rapid binding free energy estimation, both of which require force field parameterization for many drug candidates. Here, we present a fast force field generation tool, called SwissParam, able to generate, for arbitrary small organic molecule, topologies, and parameters based on the Merck molecular force field, but in a functional form that is compatible with the CHARMM force field. Output files can be used with CHARMM or GROMACS. The topologies and parameters generated by SwissParam are used by the docking software EADock2 and EADock DSS to describe the small molecules to be docked, whereas the protein is described by the CHARMM force field, and allow them to reach success rates ranging from 56 to 78%. We have also developed a rapid binding free energy estimation approach, using SwissParam for ligands and CHARMM22/27 for proteins, which requires only a short minimization to reproduce the experimental binding free energy of 214 ligand-protein complexes involving 62 different proteins, with a standard error of 2.0 kcal mol-1, and a correlation coefficient of 0.74. Together, these results demonstrate the relevance of using SwissParam topologies and parameters to describe small organic molecules in computer-aided drug design applications, together with a CHARMM22/27 description of the target protein. SwissParam is available free of charge for academic users at. © 2011 Wiley Periodicals, Inc.",
                "authors": [
                    {
                        "name": "Zoete V."
                    },
                    {
                        "name": "Cuendet M.A."
                    },
                    {
                        "name": "Grosdidier A."
                    },
                    {
                        "name": "Michielin O."
                    }
                ],
                "citationCount": 639,
                "date": "2011-08-01T00:00:00Z",
                "journal": "Journal of Computational Chemistry",
                "title": "SwissParam: A fast force field generation tool for small organic molecules"
            },
            "pmid": "21541964",
            "type": [
                "Primary"
            ],
            "version": "1"
        }
    ],
    "relation": [
        {
            "biotoolsID": "swissdock",
            "type": "usedBy"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Molecular dynamics",
            "uri": "http://edamontology.org/topic_0176"
        }
    ],
    "version": [
        "1"
    ]
}