
{
    "credit": [
        {
            "name": "Computational Genomics Department. Prince Felipe Research Center (CIPF)",
            "typeEntity": "Institute",
            "typeRoles": [
                "Provider"
            ]
        },
        {
            "name": "http://bioinfo.cipf.es",
            "typeEntity": "Institute",
            "typeRoles": [
                "Provider"
            ]
        },
        {
            "name": "cipf.es",
            "typeEntity": "Institute",
            "typeRoles": [
                "Provider"
            ]
        },
        {
            "email": "babelomics@cipf.es",
            "name": "babelomics@cipf.es  (Francisco García)",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "CITATION_INSTRUCTIONS",
            "url": "https://github.com/opencb/genome-maps/wiki#citing-genome-maps"
        },
        {
            "type": "GENERAL",
            "url": "https://github.com/opencb/genome-maps/wiki"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Genome visualisation",
                    "uri": "http://edamontology.org/operation_3208"
                }
            ]
        }
    ],
    "labels": {
        "collectionID": [
            "ELIXIR-ES"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Systems biology",
                "uri": "http://edamontology.org/topic_2259"
            },
            {
                "term": "Data visualisation",
                "uri": "http://edamontology.org/topic_0092"
            }
        ]
    },
    "link": [
        {
            "type": "REPOSITORY",
            "url": "https://github.com/opencb/genome-maps/"
        }
    ],
    "publication": [
        {
            "abstract": "Genome browsers have gained importance as more genomes and related genomic information become available. However, the increase of information brought about by new generation sequencing technologies is, at the same time, causing a subtle but continuous decrease in the efficiency of conventional genome browsers. Here, we present Genome Maps, a genome browser that implements an innovative model of data transfer and management. The program uses highly efficient technologies from the new HTML5 standard, such as scalable vector graphics, that optimize workloads at both server and client sides and ensure future scalability. Thus, data management and representation are entirely carried out by the browser, without the need of any Java Applet, Flash or other plug-in technology installation. Relevant biological data on genes, transcripts, exons, regulatory features, single-nucleotide polymorphisms, karyotype and so forth, are imported from web services and are available as tracks. In addition, several DAS servers are already included in Genome Maps. As a novelty, this web-based genome browser allows the local upload of huge genomic data files (e.g. VCF or BAM) that can be dynamically visualized in real time at the client side, thus facilitating the management of medical data affected by privacy restrictions. Finally, Genome Maps can easily be integrated in any web application by including only a few lines of code. Genome Maps is an open source collaborative initiative available in the GitHub repository (https://github.com/compbio-bigdata-viz/genome-maps). Genome Maps is available at: http://www.genomemaps.org.",
            "authors": [
                "Medina I.",
                "Salavert F.",
                "Sanchez R.",
                "de Maria A.",
                "Alonso R.",
                "Escobar P.",
                "Bleda M.",
                "Dopazo J."
            ],
            "cit_count": 15,
            "doi": "10.1093/nar/gkt530",
            "journal": "Nucleic acids research",
            "title": "Genome Maps, a new generation genome browser.",
            "type": "Primary",
            "year": "2013-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:genome_maps",
        "biotoolsID": "genome_maps",
        "description": "Open source and high-performance HTML5 web-based genome browser. It allows to browse several genomes and annotations by fetching data from CellBase high-performance REST web services. Custom data (BAMs, VCFs, ...) can also be loaded from remote servers and local disk by using OpenCGA server.",
        "homepage": "http://www.genomemaps.org/",
        "name": "Genome Maps",
        "version": [
            "3"
        ]
    }
}