{
    "additionDate": "2021-01-18T08:35:45Z",
    "biotoolsCURIE": "biotools:cleanbsequences",
    "biotoolsID": "cleanbsequences",
    "confidence_flag": "tool",
    "credit": [
        {
            "name": "Florencia I. Pozzi",
            "typeEntity": "Person"
        }
    ],
    "description": "CleanBSequences is a R package that cleans biological sequences massively, quickly, without errors and without internet connection. Biological sequences cleaning is performed by aligning the forward and / or revers primers or ends of cloning vectors with the sequences to be cleaned. After the alignment, new subsequences are generated without biological fragment not desired by the user.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                },
                {
                    "term": "Sequence alignment",
                    "uri": "http://edamontology.org/operation_0292"
                },
                {
                    "term": "Primer removal",
                    "uri": "http://edamontology.org/operation_3237"
                }
            ]
        }
    ],
    "homepage": "https://cran.r-project.org/web/packages/CleanBSequences/index.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-02-11T20:12:24Z",
    "license": "GPL-3.0",
    "name": "CleanBSequences",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1007/S00438-020-01671-Z",
            "metadata": {
                "abstract": "© 2020, Springer-Verlag GmbH Germany, part of Springer Nature.This work presents a new method and tool to solve a common problem of molecular biologists and geneticists who use molecular markers in their scientific research and developments: curation of sequences. Omic studies conducted by molecular biologists and geneticists usually involve the use of molecular markers. AFLP, cDNA-AFLP, and MSAP are examples of markers that render information at the genomics, transcriptomics, and epigenomics levels, respectively. These three types of molecular markers use adaptors that are the template for PCR amplification. The sequences of the adaptors have to be eliminated for the analysis of the results. Since a large number of sequences are usually obtained in these studies, this clean-up of the data could demand long time and work. To automate this work, an R package, named CleanBSequences, was created that allows the sequences to be curated massively, quickly, without errors and can be used offline. The curating is performed by aligning the forward and/or reverse primers or ends of cloning vectors with the sequences to be removed. After the alignment, new subsequences are generated without biological fragments not desired by the user, i.e., sequences needed by the techniques. In conclusion, the CleanBSequences tool facilitates the work of researchers, reducing time, effort, and working errors. Therefore, the present tool would respond to the problems related to the curation of sequences obtained from the use of some types of molecular markers. In addition to the above, being an open source, CleanBSequences is a flexible tool that has the potential to be used in future improvements to respond to new problems.",
                "authors": [
                    {
                        "name": "Pozzi F.I."
                    },
                    {
                        "name": "Green G.Y."
                    },
                    {
                        "name": "Barbona I.G."
                    },
                    {
                        "name": "Rodriguez G.R."
                    },
                    {
                        "name": "Felitti S.A."
                    }
                ],
                "date": "2020-07-01T00:00:00Z",
                "journal": "Molecular Genetics and Genomics",
                "title": "CleanBSequences: an efficient curator of biological sequences in R"
            },
            "pmid": "32300860"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Probes and primers",
            "uri": "http://edamontology.org/topic_0632"
        },
        {
            "term": "Epigenomics",
            "uri": "http://edamontology.org/topic_3173"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        },
        {
            "term": "Structure analysis",
            "uri": "http://edamontology.org/topic_0081"
        }
    ]
}