{
    "accessibility": "Open access",
    "additionDate": "2023-01-27T14:08:34.564803Z",
    "biotoolsCURIE": "biotools:cg-diva",
    "biotoolsID": "cg-diva",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Manuel Eichenlaub"
        }
    ],
    "description": "A collection of software packages for the statistical performance assessment of CGM systems.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://github.com/IfDTUlm/CGM_Performance_Assessment",
    "language": [
        "Python",
        "R"
    ],
    "lastUpdate": "2024-11-24T15:08:24.702919Z",
    "license": "MIT",
    "name": "CG-DIVA",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1177/19322968221134639",
            "metadata": {
                "abstract": "Background: The accuracy of continuous glucose monitoring (CGM) systems is crucial for the management of glucose levels in individuals with diabetes mellitus. However, the discussion of CGM accuracy is challenged by an abundance of parameters and assessment methods. The aim of this article is to introduce the Continuous Glucose Deviation Interval and Variability Analysis (CG-DIVA), a new approach for a comprehensive characterization of CGM point accuracy which is based on the U.S. Food and Drug Administration requirements for “integrated” CGM systems. Methods: The statistical concept of tolerance intervals and data from two approved CGM systems was used to illustrate the CG-DIVA. Results: The CG-DIVA characterizes the expected range of deviations of the CGM system from a comparison method in different glucose concentration ranges and the variability of accuracy within and between sensors. The results of the CG-DIVA are visualized in an intuitive and straightforward graphical presentation. Compared with conventional accuracy characterizations, the CG-DIVA infers the expected accuracy of a CGM system and highlights important differences between CGM systems. Furthermore, it provides information on the incidence of large errors which are of particular clinical relevance. A software implementation of the CG-DIVA is freely available (https://github.com/IfDTUlm/CGM_Performance_Assessment). Conclusions: We argue that the CG-DIVA can simplify the discussion and comparison of CGM accuracy and could replace the high number of conventional approaches. Future adaptations of the approach could thus become a putative standard for the accuracy characterization of CGM systems and serve as the basis for the definition of future CGM performance requirements.",
                "authors": [
                    {
                        "name": "Diem P."
                    },
                    {
                        "name": "Eichenlaub M."
                    },
                    {
                        "name": "Freckmann G."
                    },
                    {
                        "name": "Haug C."
                    },
                    {
                        "name": "Hinzmann R."
                    },
                    {
                        "name": "Jendle J."
                    },
                    {
                        "name": "Pleus S."
                    },
                    {
                        "name": "Rothenbuhler M."
                    },
                    {
                        "name": "Stephan P."
                    },
                    {
                        "name": "Thomas A."
                    },
                    {
                        "name": "Waldenmaier D."
                    }
                ],
                "citationCount": 11,
                "date": "2024-07-01T00:00:00Z",
                "journal": "Journal of Diabetes Science and Technology",
                "title": "Continuous Glucose Deviation Interval and Variability Analysis (CG-DIVA): A Novel Approach for the Statistical Accuracy Assessment of Continuous Glucose Monitoring Systems"
            },
            "pmcid": "PMC11307236",
            "pmid": "36329636"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Medicine",
            "uri": "http://edamontology.org/topic_3303"
        }
    ]
}
