{
    "accessibility": "Open access",
    "additionDate": "2019-05-31T12:47:40Z",
    "biotoolsCURIE": "biotools:StatAlign",
    "biotoolsID": "StatAlign",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "novak@stats.ox.ac.uk",
            "name": "Adam Novak",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "herman@stats.ox.ac.uk",
            "name": "Joe Herman",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Extendable software package for Bayesian analysis of protein, DNA and RNA sequences. Multiple alignments, phylogenetic trees and evolutionary parameters are co-estimated in a Markov Chain Monte Carlo framework, allowing for reliable quantification of the uncertainty in these estimates.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/statalign/statalign"
        },
        {
            "type": [
                "User manual"
            ],
            "url": "http://statalign.github.io/doc/user_manual.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Phylogenetic tree generation",
                    "uri": "http://edamontology.org/operation_0323"
                },
                {
                    "term": "Pairwise structure alignment",
                    "uri": "http://edamontology.org/operation_0503"
                }
            ]
        }
    ],
    "homepage": "http://statalign.github.io/",
    "language": [
        "Java"
    ],
    "lastUpdate": "2020-06-16T10:55:22Z",
    "license": "GPL-3.0",
    "maturity": "Mature",
    "name": "StatAlign",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "Ruta",
    "publication": [
        {
            "doi": "10.1093/molbev/msu184",
            "pmcid": "PMC4137710",
            "pmid": "24899668",
            "type": [
                "Primary"
            ]
        },
        {
            "doi": "10.1007/978-1-4939-8736-8_10",
            "metadata": {
                "abstract": "© 2019, Springer Science+Business Media, LLC, part of Springer Nature. For highly divergent sequences, there is often insufficient information to reliably construct alignments and phylogenetic trees. Since protein structure may be strongly conserved despite large divergences in sequence, structural information can be used to help identify homology in such cases. While there exist well-studied models of sequence evolution, structurally informed alignment methods have typically made use of geometric measures of deviation that do not take into account the underlying mutational processes. In order to integrate structural information into sequence-based evolutionary models, we recently developed a stochastic model of structural evolution on a phylogenetic tree and implemented this as the StructAlign plugin for the StatAlign statistical alignment package. In this chapter, we will outline the types of analyses that can be carried out using StructAlign, illustrating how the inclusion of structural information can be used to inform joint estimation of alignments and trees. StructAlign can also be used to infer branch-specific rates of structural evolution, and analysis of an example globin dataset highlights strong variation in the inferred rate across the tree. While structure is more highly conserved within clades, the rate of structural divergence as a function of sequence variation is larger between functionally divergent proteins. Allowing for the rate of structural divergence to vary over the tree results in an improved fit to the empirically observed pairwise RMSD values.",
                "authors": [
                    {
                        "name": "Herman J.L."
                    }
                ],
                "date": "2019-01-01T00:00:00Z",
                "journal": "Methods in Molecular Biology",
                "title": "Enhancing Statistical Multiple Sequence Alignment and Tree Inference Using Structural Information"
            },
            "pmid": "30298398",
            "type": [
                "Other"
            ]
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        },
        {
            "term": "Structure prediction",
            "uri": "http://edamontology.org/topic_0082"
        }
    ]
}