{
    "name": "SpliceDetector", 
    "description": "Recognizes alternative splicing events in human and model organisms. Splice Detector employs transcript identifiers to proceed. It provides the frequency of active splice sites in pre-mRNA. This tool can be used to discover genomic coordinates of query transcript exons. It creates a graph showing the alternative splicing regions and gives an understanding of splice sites and alternative splicing events.", 
    "homepage": "https://drive.google.com/file/d/1dlXKzbvxOH3A85_DVR__V2eI5s16-llv/view", 
    "biotoolsID": "splicedetector", 
    "biotoolsCURIE": "biotools:splicedetector", 
    "version": [], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_0433", 
                    "term": "Splice site prediction"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Desktop application"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_3170", 
            "term": "RNA-seq"
        }, 
        {
            "uri": "http://edamontology.org/topic_3320", 
            "term": "RNA splicing"
        }, 
        {
            "uri": "http://edamontology.org/topic_0621", 
            "term": "Model organisms"
        }
    ], 
    "operatingSystem": [
        "Windows"
    ], 
    "language": [], 
    "license": null, 
    "collectionID": [], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [], 
    "download": [], 
    "documentation": [], 
    "publication": [
        {
            "doi": "10.1038/s41598-018-23245-1", 
            "pmid": null, 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "SpliceDetector: A software for detection of alternative splicing events in human and model organisms directly from transcript IDs", 
                "abstract": "© 2018 The Author(s). In eukaryotes, different combinations of exons lead to multiple transcripts with various functions in protein level, in a process called alternative splicing (AS). Unfolding the complexity of functional genomics through genome-wide profiling of AS and determining the altered ultimate products provide new insights for better understanding of many biological processes, disease progress as well as drug development programs to target harmful splicing variants. The current available tools of alternative splicing work with raw data and include heavy computation. In particular, there is a shortcoming in tools to discover AS events directly from transcripts. Here, we developed a Windows-based user-friendly tool for identifying AS events from transcripts without the need to any advanced computer skill or database download. Meanwhile, due to online working mode, our application employs the updated SpliceGraphs without the need to any resource updating. First, SpliceGraph forms based on the frequency of active splice sites in pre-mRNA. Then, the presented approach compares query transcript exons to SpliceGraph exons. The tool provides the possibility of statistical analysis of AS events as well as AS visualization compared to SpliceGraph. The developed application works for transcript sets in human and model organisms.", 
                "date": "2018-12-01T00:00:00Z", 
                "citationCount": 1, 
                "authors": [
                    {
                        "name": "Baharlou Houreh M."
                    }, 
                    {
                        "name": "Ghorbani Kalkhajeh P."
                    }, 
                    {
                        "name": "Niazi A."
                    }, 
                    {
                        "name": "Ebrahimi F."
                    }, 
                    {
                        "name": "Ebrahimie E."
                    }
                ], 
                "journal": "Scientific Reports"
            }
        }
    ], 
    "credit": [
        {
            "name": "Esmaeil Ebrahimie", 
            "email": "esmaeil.ebrahimie@adelaide.edu.au", 
            "url": null, 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "d.gabrielaitis", 
    "additionDate": "2018-07-05T20:46:44Z", 
    "lastUpdate": "2018-12-10T12:58:59Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 1, 
    "homepage_status": 0, 
    "elixir_badge": 0
}