{"credit":[{"email":"zpli21@gmail.com","name":"Zhenpeng Li","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"url":"http://bioconductor.org/packages/release/bioc/html/GeneGA.html"}],"download":[{"type":"Source code","url":"http://bioconductor/packages/release/bioc/src/contrib/GeneGA_1.24.0.tar.gz"}],"function":[{"operation":[{"term":"Codon usage bias plotting","uri":"http://edamontology.org/operation_2963"},{"term":"Codon usage analysis","uri":"http://edamontology.org/operation_0286"}]}],"labels":{"collectionID":["BioConductor"],"language":["R"],"license":"GPL-2.0","operatingSystem":["Linux","Windows","Mac"],"toolType":["Command-line tool","Library"],"topic":[{"term":"Gene expression","uri":"http://edamontology.org/topic_0203"},{"term":"RNA","uri":"http://edamontology.org/topic_0099"}]},"link":[{"type":"MIRROR","url":"http://www.tbi.univie.ac.at/~ivo/RNA/"}],"publication":[{"abstract":"Background: Secondary structure forms an important intermediate level of description of nucleic acids that encapsulates the dominating part of the folding energy, is often well conserved in evolution, and is routinely used as a basis to explain experimental findings. Based on carefully measured thermodynamic parameters, exact dynamic programming algorithms can be used to compute ground states, base pairing probabilities, as well as thermodynamic properties.Results: The ViennaRNA Package has been a widely used compilation of RNA secondary structure related computer programs for nearly two decades. Major changes in the structure of the standard energy model, the Turner 2004 parameters, the pervasive use of multi-core CPUs, and an increasing number of algorithmic variants prompted a major technical overhaul of both the underlying RNAlib and the interactive user programs. New features include an expanded repertoire of tools to assess RNA-RNA interactions and restricted ensembles of structures, additional output information such as centroid structures and maximum expected accuracy structures derived from base pairing probabilities, or z-scores for locally stable secondary structures, and support for input in fasta format. Updates were implemented without compromising the computational efficiency of the core algorithms and ensuring compatibility with earlier versions.Conclusions: The ViennaRNA Package 2.0, supporting concurrent computations via OpenMP, can be downloaded from http://www.tbi.univie.ac.at/RNA. © 2011 Lorenz et al; licensee BioMed Central Ltd.","authors":["Lorenz R.","Bernhart S.H.","Honer zu Siederdissen C.","Tafer H.","Flamm C.","Stadler P.F.","Hofacker I.L."],"cit_count":1086,"doi":"10.1186/1748-7188-6-26","journal":"Algorithms for Molecular Biology","title":"ViennaRNA Package 2.0","type":"Primary","year":"2011-11-24"}],"summary":{"biotoolsCURIE":"biotools:genega","biotoolsID":"genega","description":"R based genetic algorithm for gene expression optimization by considering both mRNA secondary structure and codon usage bias. It includes the information of highly expressed genes of almost 200 genomes. Meanwhile, Vienna RNA Package is needed to ensure that this package functions properly.","homepage":"http://bioconductor.org/packages/release/bioc/html/GeneGA.html","name":"GeneGA","version":["1.24.0"]}}