{
    "additionDate": "2021-01-18T08:30:19Z",
    "biotoolsCURIE": "biotools:bioconceptvec",
    "biotoolsID": "bioconceptvec",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "zhiyong.lu@nih.gov",
            "name": "Zhiyong Lu",
            "orcidid": "https://orcid.org/0000-0001-9998-916X",
            "typeEntity": "Person"
        }
    ],
    "description": "BioConceptVec is a collection of concept embeddings on primary biological concepts mentioned in the biomedical literature.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Named-entity and concept recognition",
                    "uri": "http://edamontology.org/operation_3280"
                },
                {
                    "term": "Relation extraction",
                    "uri": "http://edamontology.org/operation_3625"
                },
                {
                    "term": "Protein interaction prediction",
                    "uri": "http://edamontology.org/operation_2492"
                },
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                }
            ]
        }
    ],
    "homepage": "https://github.com/ncbi-nlp/BioConceptVec",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-02-04T13:28:54Z",
    "name": "BioConceptVec",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PCBI.1007617",
            "metadata": {
                "abstract": "© Copyright: This is an open access article, free of all copyright, and may be freely reproduced, distributed, transmitted, modified, built upon, or otherwise used by anyone for any lawful purpose. The work is made available under the Creative Commons CC0 public domain dedication.A massive number of biological entities, such as genes and mutations, are mentioned in the biomedical literature. The capturing of the semantic relatedness of biological entities is vital to many biological applications, such as protein-protein interaction prediction and literature-based discovery. Concept embeddings—which involve the learning of vector representations of concepts using machine learning models—have been employed to capture the semantics of concepts. To develop concept embeddings, named-entity recognition (NER) tools are first used to identify and normalize concepts from the literature, and then different machine learning models are used to train the embeddings. Despite multiple attempts, existing biomedical concept embeddings generally suffer from suboptimal NER tools, small-scale evaluation, and limited availability. In response, we employed high-performance machine learning-based NER tools for concept recognition and trained our concept embeddings, BioConceptVec, via four different machine learning models on ~30 million PubMed abstracts. BioConceptVec covers over 400,000 biomedical concepts mentioned in the literature and is of the largest among the publicly available biomedical concept embeddings to date. To evaluate the validity and utility of BioConceptVec, we respectively performed two intrinsic evaluations (identifying related concepts based on drug-gene and gene-gene interactions) and two extrinsic evaluations (protein-protein interaction prediction and drug-drug interaction extraction), collectively using over 25 million instances from nine independent datasets (17 million instances from six intrinsic evaluation tasks and 8 million instances from three extrinsic evaluation tasks), which is, by far, the most comprehensive to our best knowledge. The intrinsic evaluation results demonstrate that BioConceptVec consistently has, by a large margin, better performance than existing concept embeddings in identifying similar and related concepts. More importantly, the extrinsic evaluation results demonstrate that using BioConceptVec with advanced deep learning models can significantly improve performance in downstream bioinformatics studies and biomedical text-mining applications.",
                "authors": [
                    {
                        "name": "Chen Q."
                    },
                    {
                        "name": "Lee K."
                    },
                    {
                        "name": "Yan S."
                    },
                    {
                        "name": "Kim S."
                    },
                    {
                        "name": "Wei C.-H."
                    },
                    {
                        "name": "Lu Z."
                    }
                ],
                "citationCount": 11,
                "date": "2020-04-01T00:00:00Z",
                "journal": "PLoS Computational Biology",
                "title": "Bioconceptvec: Creating and evaluating literature-based biomedical concept embeddings on a large scale"
            },
            "pmcid": "PMC7237030",
            "pmid": "32324731"
        }
    ],
    "toolType": [
        "Ontology"
    ],
    "topic": [
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Protein interaction experiment",
            "uri": "http://edamontology.org/topic_3957"
        },
        {
            "term": "Literature and language",
            "uri": "http://edamontology.org/topic_3068"
        },
        {
            "term": "Medicine",
            "uri": "http://edamontology.org/topic_3303"
        }
    ]
}