{
    "accessibility": "Open access",
    "additionDate": "2022-02-16T22:10:44.322118Z",
    "biotoolsCURIE": "biotools:monti",
    "biotoolsID": "monti",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "inukjung@knu.ac.kr",
            "name": "Inuk Jung",
            "typeEntity": "Person"
        },
        {
            "email": "sunkim.bioinfo@snu.ac.kr",
            "name": "Sun Kim",
            "typeEntity": "Person"
        },
        {
            "name": "Minsu Kim"
        },
        {
            "name": "Sangsoo Lim"
        },
        {
            "name": "Sungmin Rhee"
        }
    ],
    "description": "MONTI is a tool for analyzing large multi-omics cancer cohort data in association with clinical featuers",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/inukj/MONTI/blob/main/documentation/documentation.md"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Feature selection",
                    "uri": "http://edamontology.org/operation_3936"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/inukj/MONTI",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-02-16T22:10:44.324523Z",
    "license": "GPL-3.0",
    "name": "MONTI",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.3389/FGENE.2021.682841",
            "metadata": {
                "abstract": "© Copyright © 2021 Jung, Kim, Rhee, Lim and Kim.Multi-omics data is frequently measured to enrich the comprehension of biological mechanisms underlying certain phenotypes. However, due to the complex relations and high dimension of multi-omics data, it is difficult to associate omics features to certain biological traits of interest. For example, the clinically valuable breast cancer subtypes are well-defined at the molecular level, but are poorly classified using gene expression data. Here, we propose a multi-omics analysis method called MONTI (Multi-Omics Non-negative Tensor decomposition for Integrative analysis), which goal is to select multi-omics features that are able to represent trait specific characteristics. Here, we demonstrate the strength of multi-omics integrated analysis in terms of cancer subtyping. The multi-omics data are first integrated in a biologically meaningful manner to form a three dimensional tensor, which is then decomposed using a non-negative tensor decomposition method. From the result, MONTI selects highly informative subtype specific multi-omics features. MONTI was applied to three case studies of 597 breast cancer, 314 colon cancer, and 305 stomach cancer cohorts. For all the case studies, we found that the subtype classification accuracy significantly improved when utilizing all available multi-omics data. MONTI was able to detect subtype specific gene sets that showed to be strongly regulated by certain omics, from which correlation between omics types could be inferred. Furthermore, various clinical attributes of nine cancer types were analyzed using MONTI, which showed that some clinical attributes could be well explained using multi-omics data. We demonstrated that integrating multi-omics data in a gene centric manner improves detecting cancer subtype specific features and other clinical features, which may be used to further understand the molecular characteristics of interest. The software and data used in this study are available at: https://github.com/inukj/MONTI.",
                "authors": [
                    {
                        "name": "Jung I."
                    },
                    {
                        "name": "Kim M."
                    },
                    {
                        "name": "Kim S."
                    },
                    {
                        "name": "Lim S."
                    },
                    {
                        "name": "Rhee S."
                    }
                ],
                "date": "2021-09-10T00:00:00Z",
                "journal": "Frontiers in Genetics",
                "title": "MONTI: A Multi-Omics Non-negative Tensor Decomposition Framework for Gene-Level Integrative Analysis"
            },
            "pmcid": "PMC8461247",
            "pmid": "34567063"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        }
    ]
}
