{
    "accessibility": "Open access",
    "additionDate": "2021-12-14T23:38:52.926015Z",
    "biotoolsCURIE": "biotools:salt_snp",
    "biotoolsID": "salt_snp",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "ydwang@hit.edu.cn",
            "name": "Yadong Wang",
            "typeEntity": "Person"
        },
        {
            "name": "Bo Liu"
        },
        {
            "name": "Wei Quan",
            "orcidid": "https://orcid.org/0000-0001-8387-1896"
        }
    ],
    "description": "A SNP-aware short read aligner",
    "download": [
        {
            "type": "Source code",
            "url": "https://github.com/weiquan/salt/tags"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genome indexing",
                    "uri": "http://edamontology.org/operation_3211"
                },
                {
                    "term": "Read mapping",
                    "uri": "http://edamontology.org/operation_3198"
                },
                {
                    "term": "Salt bridge calculation",
                    "uri": "http://edamontology.org/operation_1839"
                },
                {
                    "term": "Sequence alignment",
                    "uri": "http://edamontology.org/operation_0292"
                },
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                }
            ]
        }
    ],
    "homepage": "https://github.com/weiquan/SALT",
    "language": [
        "C",
        "C++",
        "Perl",
        "Python"
    ],
    "lastUpdate": "2021-12-14T23:38:52.928566Z",
    "license": "GPL-3.0",
    "name": "SALT",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1186/S12859-021-04088-6",
            "metadata": {
                "abstract": "© 2021, The Author(s).Background: DNA sequence alignment is a common first step in most applications of high-throughput sequencing technologies. The accuracy of sequence alignments directly affects the accuracy of downstream analyses, such as variant calling and quantitative analysis of transcriptome; therefore, rapidly and accurately mapping reads to a reference genome is a significant topic in bioinformatics. Conventional DNA read aligners map reads to a linear reference genome (such as the GRCh38 primary assembly). However, such a linear reference genome represents the genome of only one or a few individuals and thus lacks information on variations in the population. This limitation can introduce bias and impact the sensitivity and accuracy of mapping. Recently, a number of aligners have begun to map reads to populations of genomes, which can be represented by a reference genome and a large number of genetic variants. However, compared to linear reference aligners, an aligner that can store and index all genetic variants has a high cost in memory (RAM) space and leads to extremely long run time. Aligning reads to a graph-model-based index that includes all types of variants is ultimately an NP-hard problem in theory. By contrast, considering only single nucleotide polymorphism (SNP) information will reduce the complexity of the index and improve the speed of sequence alignment. Results: The SNP-aware alignment tool (SALT) is a fast, memory-efficient, and SNP-aware short read alignment tool. SALT uses 5.8 GB of RAM to index a human reference genome (GRCh38) and incorporates 12.8M UCSC common SNPs. Compared with a state-of-the-art aligner, SALT has a similar speed but higher accuracy. Conclusions: Herein, we present an SNP-aware alignment tool (SALT) that aligns reads to a reference genome that incorporates an SNP database. We benchmarked SALT using simulated and real datasets. The results demonstrate that SALT can efficiently map reads to the reference genome with significantly improved accuracy. Incorporating SNP information can improve the accuracy of read alignment and can reveal novel variants. The source code is freely available at https://github.com/weiquan/SALT.",
                "authors": [
                    {
                        "name": "Liu B."
                    },
                    {
                        "name": "Quan W."
                    },
                    {
                        "name": "Wang Y."
                    }
                ],
                "date": "2021-08-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Fast and SNP-aware short read alignment with SALT"
            },
            "pmcid": "PMC8386087",
            "pmid": "34433415"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ],
    "validated": 1
}
