{
    "additionDate": "2020-01-14T09:48:28Z",
    "biotoolsCURIE": "biotools:genome_topology_network",
    "biotoolsID": "genome_topology_network",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "zhouy@fudan.edu.cn",
            "name": "Yan Zhou",
            "typeEntity": "Person"
        }
    ],
    "description": "Modification of the genome topology network and its application to the comparison of group B Streptococcus genomes.\n\nThe draft genomes now can be analyzed. Initiate the GTN with \"gtn_CompleteOnly.pl\" if your data consist of complete genomes only, or utilize \"gtn_WithDraft.pl\". The GTN firstly locates the synteny block in genomes if draft data exist.\n\nThe Markov Cluster Algorithm is introduced to assign the gene families. The Markov Cluster (MCL) Algorithm is introduced in this version. This algorithm is also used in many clustering tool, such as orthoMCL,.\n\nUnique gene connection information will be yielded as a result file.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "Phylogenetic tree analysis (shape)",
                    "uri": "http://edamontology.org/operation_0551"
                },
                {
                    "term": "Phylogenetic tree bootstrapping",
                    "uri": "http://edamontology.org/operation_0552"
                },
                {
                    "term": "Phylogenetic tree distances calculation",
                    "uri": "http://edamontology.org/operation_0557"
                },
                {
                    "term": "Phylogenetic tree generation",
                    "uri": "http://edamontology.org/operation_0323"
                }
            ]
        }
    ],
    "homepage": "https://github.com/0232/Genome_topology_network",
    "language": [
        "Perl"
    ],
    "lastUpdate": "2020-12-03T08:18:19Z",
    "name": "genome topology network",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12864-019-6234-8",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: The genome topology network (GTN) is a new approach for studying the phylogenetics of bacterial genomes by analysing their gene order. The previous GTN tool gives a phylogenetic tree and calculate the different degrees (DD) of various adjacent gene families with complete genome data, but it is limited to the gene family level. Result: In this study, we collected 51 published complete and draft group B Streptococcus (GBS) genomes from the NCBI database as the case study data. The phylogenetic tree obtained from the GTN method assigned the genomes into six main clades. Compared with single nucleotide polymorphism (SNP)-based method, the GTN method exhibited a higher resolution in two clades. The gene families located at unique node connections in these clades were associated with the clusters of orthologous groups (COG) functional categories of \"[G] Carbohydrate transport and metabolism,\", \"[L] Replication, recombination, and repair\"and \"[J] translation, ribosomal structure and biogenesis\". Thus, these genes were the major factors affecting the differentiation of these six clades in the phylogenetic tree obtained from the GTN. Conclusion: The modified GTN analyzes draft genomic data and exhibits greater functionality than the previous version. The gene family clustering algorithm embedded in the GTN tool is optimized by introducing the Markov cluster algorithm (MCL) tool to assign genes to functional gene families. A bootstrap test is performed to verify the credibility of the clades when allowing users to adjust the relationships of the clades accordingly. The GTN tool gives additional evolutionary information that is a useful complement to the SNP-based method. Information on the differences in the connections between a gene and its adjacent genes in species or clades is easily obtained. The modified GTN tool can be downloaded from https://github.com/0232/Genome_topology_network",
                "authors": [
                    {
                        "name": "Deng X."
                    },
                    {
                        "name": "Jiang J."
                    },
                    {
                        "name": "Liang Y."
                    },
                    {
                        "name": "Zhang L."
                    },
                    {
                        "name": "Zhao G."
                    },
                    {
                        "name": "Zhao X."
                    },
                    {
                        "name": "Zhou Y."
                    }
                ],
                "date": "2019-11-21T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "Modification of the genome topology network and its application to the comparison of group B Streptococcus genomes"
            },
            "pmcid": "PMC6868693",
            "pmid": "31752672"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Carbohydrates",
            "uri": "http://edamontology.org/topic_0152"
        },
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Gene and protein families",
            "uri": "http://edamontology.org/topic_0623"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        }
    ],
    "validated": 1
}
