{
    "additionDate": "2021-01-18T09:03:10Z",
    "biotoolsCURIE": "biotools:cernaseek",
    "biotoolsID": "cernaseek",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "lixia@hrbmu.edu.cn",
            "name": "Juan Xu",
            "typeEntity": "Person"
        },
        {
            "email": "liyongsheng@ems.hrbmu.edu.cn",
            "name": "Yongsheng Li",
            "typeEntity": "Person"
        },
        {
            "email": "xujuanbiocc@ems.hrbmu.edu.cn",
            "name": "Xia Li",
            "typeEntity": "Person"
        }
    ],
    "description": "CeRNASeek is an R package for identification and analysis of ceRNA regulation. It årovides several functions to identify and analyse miRNA sponge, including popular methods for identifying miRNA sponge interactions, two types of global ceRNA regulation prediction methods and four types of context-specific prediction methods, which are based on miRNA-messenger RNA regulation alone, or by integrating heterogeneous data, respectively. In addition, For predictive ceRNA relationship pairs, this package provides several downstream analysis algorithms, including regulatory network analysis and functional annotation analysis, as well as survival prognosis analysis based on expression of ceRNA ternary pair.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene regulatory network analysis",
                    "uri": "http://edamontology.org/operation_1781"
                },
                {
                    "term": "Gene regulatory network prediction",
                    "uri": "http://edamontology.org/operation_2437"
                },
                {
                    "term": "miRNA expression analysis",
                    "uri": "http://edamontology.org/operation_3792"
                },
                {
                    "term": "miRNA target prediction",
                    "uri": "http://edamontology.org/operation_0463"
                }
            ]
        }
    ],
    "homepage": "https://CRAN.R-project.org/package=CeRNASeek",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-02-10T20:46:22Z",
    "license": "GPL-3.0",
    "name": "CeRNASeek",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/BIB/BBAA048",
            "metadata": {
                "abstract": "© The Author(s) 2020. Published by Oxford University Press. All rights reserved. For Permissions, please email: journals.permissions@oup.com.Competitive endogenous RNA (ceRNA) represents a novel layer of gene regulation that controls both physiological and pathological processes. However, there is still lack of computational tools for quickly identifying ceRNA regulation. To address this problem, we presented an R-package, CeRNASeek, which allows identifying and analyzing ceRNA-ceRNA interactions by integration of multiple-omics data. CeRNASeek integrates six widely used computational methods to identify ceRNA-ceRNA interactions, including two global and four context-specific ceRNA regulation prediction methods. In addition, it provides several downstream analyses for predicted ceRNA-ceRNA pairs, including regulatory network analysis, functional annotation and survival analysis. With examples of cancer-related ceRNA prioritization and cancer subtyping, we demonstrate that CeRNASeek is a valuable tool for investigating the function of ceRNAs in complex diseases. In summary, CeRNASeek provides a comprehensive and efficient tool for identifying and analysis of ceRNA regulation. The package is available on the Comprehensive R Archive Network (CRAN) at https://CRAN.R-project.org/package=CeRNASeek.",
                "authors": [
                    {
                        "name": "Jin X."
                    },
                    {
                        "name": "Li J."
                    },
                    {
                        "name": "Li X."
                    },
                    {
                        "name": "Li X."
                    },
                    {
                        "name": "Li Y."
                    },
                    {
                        "name": "Tian Y."
                    },
                    {
                        "name": "Wang Q."
                    },
                    {
                        "name": "Xu J."
                    },
                    {
                        "name": "Zhang M."
                    }
                ],
                "citationCount": 4,
                "date": "2021-05-20T00:00:00Z",
                "journal": "Briefings in bioinformatics",
                "title": "CeRNASeek: an R package for identification and analysis of ceRNA regulation"
            },
            "pmid": "32363380"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Gene regulation",
            "uri": "http://edamontology.org/topic_0204"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Physiology",
            "uri": "http://edamontology.org/topic_3300"
        }
    ]
}
