{
    "additionDate": "2019-11-14T18:00:56Z",
    "biotoolsCURIE": "biotools:IMAP_autogenerated",
    "biotoolsID": "IMAP_autogenerated",
    "confidence_flag": "high",
    "credit": [
        {
            "email": "jbkim@konkuk.ac.kr",
            "name": "Jaebum Kim",
            "orcidid": "https://orcid.org/0000-0002-2287-9760",
            "typeEntity": "Person"
        }
    ],
    "description": "> NAME (IMAP) SIMILAR TO (PUB. DIFFERENT) bio.tools/imap (iMAP) | Chromosome-level genome assembler combining multiple de novo assemblies | System requirements (Tested versions) | Linux x64 (Tested in CentOS 7.5, Ubuntu 16.04 and Ubuntu 18.04) | Installing IMAP from source codes",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genome assembly",
                    "uri": "http://edamontology.org/operation_0525"
                },
                {
                    "term": "De-novo assembly",
                    "uri": "http://edamontology.org/operation_0524"
                },
                {
                    "term": "Mapping assembly",
                    "uri": "http://edamontology.org/operation_0523"
                }
            ]
        }
    ],
    "homepage": "http://github.com/jkimlab/IMAP",
    "language": [
        "Shell",
        "C++",
        "Perl"
    ],
    "lastUpdate": "2019-11-14T18:00:56Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/jkimlab/IMAP.git"
        }
    ],
    "name": "IMAP_autogenerated",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PONE.0221858",
            "metadata": {
                "abstract": "© 2019 Song et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Background Genomic data have become major resources to understand complex mechanisms at fine-scale temporal and spatial resolution in functional and evolutionary genetic studies, including human diseases, such as cancers. Recently, a large number of whole genomes of evolving populations of yeast (Saccharomyces cerevisiae W303 strain) were sequenced in a time-dependent manner to identify temporal evolutionary patterns. For this type of study, a chromosome-level sequence assembly of the strain or population at time zero is required to compare with the genomes derived later. However, there is no fully automated computational approach in experimental evolution studies to establish the chromosome-level genome assembly using unique features of sequencing data. Methods and results In this study, we developed a new software pipeline, the integrative meta-assembly pipeline (IMAP), to build chromosome-level genome sequence assemblies by generating and combining multiple initial assemblies using three de novo assemblers from short-read sequencing data. We significantly improved the continuity and accuracy of the genome assembly using a large collection of sequencing data and hybrid assembly approaches. We validated our pipeline by generating chromosome-level assemblies of yeast strains W303 and SK1, and compared our results with assemblies built using long-read sequencing and various assembly evaluation metrics. We also constructed chromosome-level sequence assemblies of S. cerevisiae strain Sigma1278b, and three commonly used fungal strains: Aspergillus nidulans A713, Neurospora crassa 73, and Thielavia terrestris CBS 492.74, for which long-read sequencing data are not yet available. Finally, we examined the effect of IMAP parameters, such as reference and resolution, on the quality of the final assembly of the yeast strains W303 and SK1. Conclusions We developed a cost-effective pipeline to generate chromosome-level sequence assemblies using only short-read sequencing data. Our pipeline combines the strengths of reference-guided and meta-assembly approaches. Our pipeline is available online at http:// github.com/jkimlab/IMAP including a Docker image, as well as a Perl script, to help users install the IMAP package, including several prerequisite programs. Users can use IMAP to easily build the chromosome-level assembly for the genome of their interest.",
                "authors": [
                    {
                        "name": "Song G."
                    },
                    {
                        "name": "Lee J."
                    },
                    {
                        "name": "Kim J."
                    },
                    {
                        "name": "Kang S."
                    },
                    {
                        "name": "Lee H."
                    },
                    {
                        "name": "Kwon D."
                    },
                    {
                        "name": "Lee D."
                    },
                    {
                        "name": "Lang G.I."
                    },
                    {
                        "name": "Michael Cherry J."
                    },
                    {
                        "name": "Kim J."
                    }
                ],
                "date": "2019-08-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "Integrative meta-assembly pipeline (IMAP): Chromosome-level genome assembler combining multiple de novo assemblies"
            },
            "pmcid": "PMC6711525",
            "pmid": "31454399"
        }
    ],
    "topic": [
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Whole genome sequencing",
            "uri": "http://edamontology.org/topic_3673"
        }
    ]
}