{
    "accessibility": "Open access",
    "additionDate": "2022-07-17T12:06:46.510068Z",
    "biotoolsCURIE": "biotools:cgmquantify",
    "biotoolsID": "cgmquantify",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "jessilyn.dunn@duke.edu",
            "name": "Jessilyn P. Dunn",
            "orcidid": "https://orcid.org/0000-0002-3241-8183",
            "typeEntity": "Person"
        },
        {
            "name": "Brinnae Bent",
            "orcidid": "https://orcid.org/0000-0002-7039-0177"
        }
    ],
    "description": "The cgmquantify software resource enables comprehensive analysis of continuous glucose monitor data with clinically validated metrics and easy to implement visualizations.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://pypi.org/project/cgmquantify/",
    "language": [
        "Python",
        "R"
    ],
    "lastUpdate": "2022-07-17T12:06:46.512577Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://CRAN.R-project.org/package=cgmquantify"
        },
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/DigitalBiomarkerDiscoveryPipeline/cgmquantify-R"
        }
    ],
    "name": "cgmquantify",
    "operatingSystem": [
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1109/OJEMB.2021.3105816",
            "metadata": {
                "abstract": "© 2020 IEEE.Goal: Continuous glucose monitoring (CGM) is commonly used in Type 1 diabetes management by clinicians and patients and in diabetes research to understand how factors of longitudinal glucose and glucose variability relate to disease onset and severity and the efficacy of interventions. CGM data presents unique bioinformatic challenges because the data is longitudinal, temporal, and there are infinite ways to summarize and use this data. There are over 25 metrics of glucose variability used clinically and in research, metrics are not standardized, and little validation exists across studies. The primary goal of this work is to present a software resource for systematic, reproducible, and comprehensive analysis of interstitial glucose and glycemic variability from continuous glucose monitor data. Methods: Comprehensive literature review informed the clinically-validated functions developed in this work. Software packages were developed and open-sourced through the Python Package Index (PyPi) and the Comprehensive R Archive Network (CRAN). cgmquantify is integrated into the Digital Biomarker Discovery Pipeline and MD2K Cerebral Cortex. Results: Here we present an open-source software toolbox called cgmquantify, which contains 25 functions calculating 28 clinically validated metrics of glucose and glycemic variability, as well as tools for visualizing longitudinal CGM data. Detailed documentation facilitates modification of existing code by the community for customization of input data and visualizations. Conclusions: We have built systematic functions and documentation of metrics and visualizations into a software resource available in both the Python and R languages. This resource will enable digital biomarker development using continuous glucose monitors.",
                "authors": [
                    {
                        "name": "Bent B."
                    },
                    {
                        "name": "Dunn J."
                    },
                    {
                        "name": "Henriquez M."
                    }
                ],
                "citationCount": 1,
                "date": "2021-01-01T00:00:00Z",
                "journal": "IEEE Open Journal of Engineering in Medicine and Biology",
                "title": "Cgmquantify: Python and R Software Packages for Comprehensive Analysis of Interstitial Glucose and Glycemic Variability from Continuous Glucose Monitor Data"
            },
            "pmcid": "PMC8901031",
            "pmid": "35402978"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Literature and language",
            "uri": "http://edamontology.org/topic_3068"
        },
        {
            "term": "Medicine",
            "uri": "http://edamontology.org/topic_3303"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ]
}
