{
    "accessibility": "Open access",
    "additionDate": "2019-05-18T09:40:58Z",
    "biotoolsCURIE": "biotools:apparent",
    "biotoolsID": "apparent",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "arthurmelobio@gmail.com",
            "name": "Arthur Melo",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "R package for accurate SNP-based parentage analysis in the absence of guiding information.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/halelab/apparent"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "SNP annotation",
                    "uri": "http://edamontology.org/operation_3661"
                },
                {
                    "term": "SNP detection",
                    "uri": "http://edamontology.org/operation_0484"
                }
            ]
        }
    ],
    "homepage": "https://cran.r-project.org/package=apparent",
    "language": [
        "R"
    ],
    "lastUpdate": "2020-06-16T10:55:22Z",
    "license": "GPL-2.0",
    "maturity": "Mature",
    "name": "apparent",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Ruta",
    "publication": [
        {
            "doi": "10.1186/s12859-019-2662-3",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: The accurate determination of parent-progeny relationships within both in situ natural populations and ex situ genetic resource collections can greatly enhance plant breeding/domestication efforts and support plant genetic resource conservation strategies. Although a range of parentage analysis tools are available, none are designed to infer such relationships using genome-wide single nucleotide polymorphism (SNP) data in the complete absence of guiding information, such as generational groups, partial pedigrees, or genders. The R package ('apparent') developed and presented here addresses this gap. Results: 'apparent' adopts a novel strategy of parentage analysis based on a test of genetic identity between a theoretically expected progeny (EPij), whose genotypic state can be inferred at all homozygous loci for a pair of putative parents (i and j), and all potential offspring (POk), represented by the k individuals of a given germplasm collection. Using the Gower Dissimilarity metric (GD), genetic identity between EPij and POk is taken as evidence that individuals i and j are the true parents of offspring k. Significance of a given triad (parental pairij + offspringk) is evaluated relative to the distribution of all GDij|k values for the population. With no guiding information provided, 'apparent' correctly identified the parental pairs of 15 lines of known pedigree within a test population of 77 accessions of Actinidia arguta, a performance unmatched by five other commonly used parentage analysis tools. In the case of an inconclusive triad analysis due to the absence of one parent from the test population, 'apparent' can perform a subsequent dyad analysis to identify a likely single parent for a given offspring. Average dyad analysis accuracy was 73.3% in the complete absence of pedigree information but increased to 100% when minimal generational information (adults vs. progeny) was provided. Conclusions: The 'apparent' R package is a fast and accurate parentage analysis tool that uses genome-wide SNP data to identify parent-progeny relationships within populations for which no a priori knowledge of family structure exists.",
                "authors": [
                    {
                        "name": "Hale I."
                    },
                    {
                        "name": "Melo A.T.O."
                    }
                ],
                "citationCount": 1,
                "date": "2019-02-28T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Apparent': A simple and flexible R package for accurate SNP-based parentage analysis in the absence of guiding information"
            },
            "pmcid": "PMC6396488",
            "pmid": "30819089",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Agricultural science",
            "uri": "http://edamontology.org/topic_3810"
        },
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        }
    ],
    "validated": 1,
    "version": [
        "1.1"
    ]
}
