
{
    "credit": [
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Collapsing methods",
                    "uri": "http://edamontology.org/operation_3791"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "R"
        ],
        "topic": [
            {
                "term": "Exome sequencing",
                "uri": "http://edamontology.org/topic_3676"
            },
            {
                "term": "GWAS study",
                "uri": "http://edamontology.org/topic_3517"
            },
            {
                "term": "Whole genome sequencing",
                "uri": "http://edamontology.org/topic_3673"
            },
            {
                "term": "Public health and epidemiology",
                "uri": "http://edamontology.org/topic_3305"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© 2019 Wiley Periodicals, Inc.Single genome-wide studies may be underpowered to detect trait-associated rare variants with moderate or weak effect sizes. As a viable alternative, meta-analysis is widely used to increase power by combining different studies. The power of meta-analysis critically depends on the underlying association patterns and heterogeneity levels, which are unknown and vary from locus to locus. However, existing methods mainly focus on one or only a few combinations of the association pattern and heterogeneity level, thus may lose power in many situations. To address this issue, we propose a general and unified framework by combining a class of tests including and beyond some existing ones, leading to high power across a wide range of scenarios. We demonstrate that the proposed test is more powerful than some existing methods in simulation studies, then show their performance with the NHLBI Exome-Sequencing Project (ESP) data. One gene (B4GALNT2) was found by our proposed test, but not by others, to be statistically significantly associated with plasma triglyceride. The signal was driven by African-ancestry subjects but it was previously reported to be associated with coronary artery disease among European-ancestry subjects. We implemented our method in an R package aSPUmeta, publicly available at https://github.com/ytzhong/metaRV and will be on CRAN soon.",
            "authors": [
                "Yang T.",
                "Kim J.",
                "Wu C.",
                "Ma Y.",
                "Wei P.",
                "Pan W."
            ],
            "cit_count": 0,
            "doi": "10.1002/GEPI.22273",
            "journal": "Genetic Epidemiology",
            "pmid": "31830326",
            "title": "An adaptive test for meta-analysis of rare variant association studies",
            "year": "2019-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:meta-analysis_rare_variant",
        "biotoolsID": "meta-analysis_rare_variant",
        "description": "An adaptive test for meta-analysis of rare variant association studies.\n\nSingle genome-wide studies may be underpowered to detect trait-associated rare variants with moderate or weak effect sizes. As a viable alternative, meta-analysis is widely used to increase power by combining different studies. The power of meta-analysis critically depends on the underlying association patterns and heterogeneity levels, which are unknown and vary from locus to locus. However, existing methods mainly focus on one or only a few combinations of the association pattern and heterogeneity level, thus may lose power in many situations. To address this issue, we propose a general and unified framework by combining a class of tests including and beyond some existing ones, leading to high power across a wide range of scenarios.\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'aSPUmeta'",
        "homepage": "https://github.com/ytzhong/metaRV",
        "name": "meta-analysis rare variant"
    }
}