{
    "accessibility": "Open access",
    "additionDate": "2019-08-09T13:18:15Z",
    "biotoolsCURIE": "biotools:QuickNII",
    "biotoolsID": "QuickNII",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "j.g.bjaalie@medisin.uio.no",
            "name": "Jan G. Bjaalie",
            "orcidid": "https://orcid.org/0000-0001-7899-906X",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Tool for user guided affine registration (anchoring) of 2D experimental image data, typically high resolution microscopic images, to 3D atlas reference space, facilitating data integration through standardized coordinate systems.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://www.nitrc.org/docman/view.php/1341/80848/QuickNII%20user%20guide"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Microscope image visualisation",
                    "uri": "http://edamontology.org/operation_3552"
                }
            ]
        }
    ],
    "homepage": "https://www.nitrc.org/projects/quicknii",
    "lastUpdate": "2020-06-16T10:55:26Z",
    "license": "CC-BY-NC-SA-4.0",
    "maturity": "Mature",
    "name": "QuickNII",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "hans",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PONE.0216796",
            "metadata": {
                "abstract": "© 2019 Puchades et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Modern high throughput brain wide profiling techniques for cells and their morphology, connectivity, and other properties, make the use of reference atlases with 3D coordinate frameworks essential. However, anatomical location of observations made in microscopic sectional images from rodent brains is typically determined by comparison with 2D anatomical reference atlases. A major challenge in this regard is that microscopic sections often are cut with orientations deviating from the standard planes used in the reference atlases, resulting in inaccuracies and a need for tedious correction steps. Overall, efficient tools for registration of large series of section images to reference atlases are currently not widely available. Here we present QuickNII, a stand-alone software tool for semi-automated affine spatial registration of sectional image data to a 3D reference atlas coordinate framework. A key feature in the tool is the capability to generate user defined cut planes through the reference atlas, matching the orientation of the cut plane of the sectional image data. The reference atlas is transformed to match anatomical landmarks in the corresponding experimental images. In this way, the spatial relationship between experimental image and atlas is defined, without introducing distortions in the original experimental images. Following anchoring of a limited number of sections containing key landmarks, transformations are propagated across the entire series of sectional images to reduce the amount of manual steps required. By having coordinates assigned to the experimental images, further analysis of the distribution of features extracted from the images is greatly facilitated.",
                "authors": [
                    {
                        "name": "Bjaalie J.G."
                    },
                    {
                        "name": "Csucs G."
                    },
                    {
                        "name": "Ledergerber D."
                    },
                    {
                        "name": "Leergaard T.B."
                    },
                    {
                        "name": "Puchades M.A."
                    }
                ],
                "citationCount": 16,
                "date": "2019-05-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "Spatial registration of serial microscopic brain images to three-dimensional reference atlases with the QuickNII tool"
            },
            "pmcid": "PMC6541252",
            "pmid": "31141518",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        },
        {
            "term": "Neurobiology",
            "uri": "http://edamontology.org/topic_3304"
        }
    ],
    "validated": 1
}
