{
    "additionDate": "2021-01-18T07:34:55Z",
    "biotoolsCURIE": "biotools:multi-template_matching",
    "biotoolsID": "multi-template_matching",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "l.thomas@acquifer.de",
            "name": "Laurent S. V. Thomas",
            "orcidid": "https://orcid.org/0000-0001-7686-3249",
            "typeEntity": "Person"
        },
        {
            "email": "j.gehrig@acquifer.de",
            "name": "Jochen Gehrig",
            "typeEntity": "Person"
        }
    ],
    "description": "A versatile tool for object-localization in microscopy images.\n\nObject-recognition using multiple templates in python.\n\nMulti-Template Matching for object-detection.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                },
                {
                    "term": "Microscope image visualisation",
                    "uri": "http://edamontology.org/operation_3552"
                },
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                }
            ]
        }
    ],
    "homepage": "https://github.com/multi-template-matching",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-03-02T08:15:05Z",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "https://imagej.nih.gov/ij/plugins/template-matching.html"
        },
        {
            "type": [
                "Other"
            ],
            "url": "https://multi-template-matching.github.io/Multi-Template-Matching/"
        }
    ],
    "name": "multi-template matching",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1186/S12859-020-3363-7",
            "metadata": {
                "abstract": "© 2020 The Author(s).Background: The localization of objects of interest is a key initial step in most image analysis workflows. For biomedical image data, classical image-segmentation methods like thresholding or edge detection are typically used. While those methods perform well for labelled objects, they are reaching a limit when samples are poorly contrasted with the background, or when only parts of larger structures should be detected. Furthermore, the development of such pipelines requires substantial engineering of analysis workflows and often results in case-specific solutions. Therefore, we propose a new straightforward and generic approach for object-localization by template matching that utilizes multiple template images to improve the detection capacity. Results: We provide a new implementation of template matching that offers higher detection capacity than single template approach, by enabling the detection of multiple template images. To provide an easy-to-use method for the automatic localization of objects of interest in microscopy images, we implemented multi-template matching as a Fiji plugin, a KNIME workflow and a python package. We demonstrate its application for the localization of entire, partial and multiple biological objects in zebrafish and medaka high-content screening datasets. The Fiji plugin can be installed by activating the Multi-Template-Matching and IJ-OpenCV update sites. The KNIME workflow is available on nodepit and KNIME Hub. Source codes and documentations are available on GitHub (https://github.com/multi-template-matching). Conclusion: The novel multi-template matching is a simple yet powerful object-localization algorithm, that requires no data-pre-processing or annotation. Our implementation can be used out-of-the-box by non-expert users for any type of 2D-image. It is compatible with a large variety of applications including, for instance, analysis of large-scale datasets originating from automated microscopy, detection and tracking of objects in time-lapse assays, or as a general image-analysis step in any custom processing pipelines. Using different templates corresponding to distinct object categories, the tool can also be used for classification of the detected regions.",
                "authors": [
                    {
                        "name": "Thomas L.S.V."
                    },
                    {
                        "name": "Gehrig J."
                    }
                ],
                "citationCount": 4,
                "date": "2020-02-05T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Multi-template matching: A versatile tool for object-localization in microscopy images"
            },
            "pmcid": "PMC7003318",
            "pmid": "32024462"
        }
    ],
    "toolType": [
        "Plug-in"
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Data mining",
            "uri": "http://edamontology.org/topic_3473"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        },
        {
            "term": "Zoology",
            "uri": "http://edamontology.org/topic_3500"
        }
    ]
}