{
    "additionDate": "2019-11-14T19:40:59Z",
    "biotoolsCURIE": "biotools:RegLinker",
    "biotoolsID": "RegLinker",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "murali@cs.vt.edu",
            "name": "T M Murali",
            "typeEntity": "Person"
        }
    ],
    "description": "Reconstructing signaling pathways using regular language constrained paths | Connect the dots in protein interaction networks ... using regular expressions! | RegLinker is an algorithm for the automated curation of signaling pathways. Given a signaling pathway and a background interactome, RegLinker will automatically rank the interactions in the background interactome as candidates for inclusion into the signaling pathway | Connect the dots in protein interaction networks... using regular expressions!",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Pathway or network prediction",
                    "uri": "http://edamontology.org/operation_3439"
                },
                {
                    "term": "Pathway or network comparison",
                    "uri": "http://edamontology.org/operation_0277"
                },
                {
                    "term": "Pathway or network visualisation",
                    "uri": "http://edamontology.org/operation_3083"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Murali-group/RegLinker",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-12-12T15:17:10Z",
    "license": "GPL-3.0",
    "name": "RegLinker",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ360",
            "metadata": {
                "abstract": "© 2019 The Author(s) 2019. Published by Oxford University Press.Motivation: High-quality curation of the proteins and interactions in signaling pathways is slow and painstaking. As a result, many experimentally detected interactions are not annotated to any pathways. A natural question that arises is whether or not it is possible to automatically leverage existing pathway annotations to identify new interactions for inclusion in a given pathway. Results: We present RegLinker, an algorithm that achieves this purpose by computing multiple short paths from pathway receptors to transcription factors within a background interaction network. The key idea underlying RegLinker is the use of regular language constraints to control the number of non-pathway interactions that are present in the computed paths. We systematically evaluate RegLinker and five alternative approaches against a comprehensive set of 15 signaling pathways and demonstrate that RegLinker recovers withheld pathway proteins and interactions with the best precision and recall. We used RegLinker to propose new extensions to the pathways. We discuss the literature that supports the inclusion of these proteins in the pathways. These results show the broad potential of automated analysis to attenuate difficulties of traditional manual inquiry.",
                "authors": [
                    {
                        "name": "Wagner M.J."
                    },
                    {
                        "name": "Pratapa A."
                    },
                    {
                        "name": "Murali T.M."
                    }
                ],
                "citationCount": 2,
                "date": "2019-07-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Reconstructing signaling pathways using regular language constrained paths"
            },
            "pmcid": "PMC6612893",
            "pmid": "31510694"
        }
    ],
    "topic": [
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "Environmental science",
            "uri": "http://edamontology.org/topic_3855"
        }
    ],
    "validated": 1
}