{
    "additionDate": "2023-11-17T16:34:31.197537Z",
    "biotoolsCURIE": "biotools:opengdc",
    "biotoolsID": "opengdc",
    "credit": [
        {
            "email": "marco.masseroli@polimi.it",
            "name": "Marco Masseroli",
            "orcidid": "https://orcid.org/0000-0003-2574-1174",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "name": "ELIXIR-ITA",
            "typeEntity": "Project",
            "url": "https://elixir-italy.org/"
        },
        {
            "name": "ELIXIR-ITA-POLIMI",
            "typeEntity": "Project",
            "url": "https://www.deib.polimi.it/eng/elixir-iib"
        }
    ],
    "description": "OpenGDC is an open-source Java tool for the automatic extraction, extension, and conversion in BED, GTF, CSV, JSON, and XML format of the genomic experiments and clinical information from the Genomic Data Commons (GDC) portal at https://gdc.cancer.gov/",
    "download": [
        {
            "type": "Software package",
            "url": "https://github.com/DEIB-GECO/OpenGDC"
        }
    ],
    "editPermission": {
        "type": "group"
    },
    "elixirNode": [
        "Italy"
    ],
    "elixirPlatform": [
        "Tools"
    ],
    "homepage": "https://github.com/DEIB-GECO/OpenGDC",
    "language": [
        "Java"
    ],
    "lastUpdate": "2023-11-17T23:05:19.257601Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/DEIB-GECO/OpenGDC"
        }
    ],
    "name": "OpenGDC",
    "owner": "ELIXIR-ITA-POLIMI",
    "publication": [
        {
            "doi": "10.3390/app10186367",
            "metadata": {
                "abstract": "Next Generation Sequencing technologies have produced a substantial increase of publicly available genomic data and related clinical/biospecimen information. New models and methods to easily access, integrate and search them effectively are needed. An effort was made by the Genomic Data Commons (GDC), which defined strict procedures for harmonizing genomic and clinical data of cancer, and created the GDC data portal with its application programming interface (API). In this work, we enhance GDC harmonization by applying a state of the art data model (called Genomic Data Model) made of two components: the genomic data, in Browser Extensible Data (BED) format, and the related metadata, in a tab-delimited key-value format. Furthermore, we extend the GDC genomic data with information extracted from other public genomic databases (e.g., GENCODE, HGNC and miRBase). For metadata, we implemented automatic procedures to extract and normalize them, recognizing and eliminating redundant ones, from both Clinical/Biospecimen Supplements and GDC Data Model, that are present on the two sources of GDC (i.e., data portal and API). We developed and released the OpenGDC software, which is able to extract, integrate, extend, and standardize genomic and clinical data of The Cancer Genome Atlas (TCGA) from the GDC. Additionally, we created a publicly accessible repository, containing such homogenized and enhanced TCGA data (resulting in about 1.3 TB). Our approach, implemented in the OpenGDC software, provides a step forward to the effective and efficient management of big genomic and clinical data of cancer. The strong usability of our data model and utility of our work is demonstrated through the application of the GenoMetric Query Language (GMQL) on the transformed TCGA data from the GDC, achieving promising results, facilitating information retrieval and knowledge discovery analyses.",
                "authors": [
                    {
                        "name": "Bernasconi A."
                    },
                    {
                        "name": "Canakoglu A."
                    },
                    {
                        "name": "Cappelli E."
                    },
                    {
                        "name": "Ceri S."
                    },
                    {
                        "name": "Cumbo F."
                    },
                    {
                        "name": "Masseroli M."
                    },
                    {
                        "name": "Weitschek E."
                    }
                ],
                "citationCount": 10,
                "date": "2020-09-01T00:00:00Z",
                "journal": "Applied Sciences (Switzerland)",
                "title": "OpenGDC: Unifying, modeling, integrating cancer genomic data and clinical metadata"
            }
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Biological databases",
            "uri": "http://edamontology.org/topic_3071"
        },
        {
            "term": "Epigenomics",
            "uri": "http://edamontology.org/topic_3173"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ]
}
