{"credit":[{"email":"msr@asu.edu","name":"Michael S. Rosenberg","typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://www.rosenberglab.net/"}],"documentation":[{"type":"GENERAL","url":"https://github.com/msrosenberg/IndelCoder"}],"function":[{"operation":[{"term":"Sequence alignment refinement","uri":"http://edamontology.org/operation_2089"}]}],"labels":{"language":["Shell","Pascal"],"operatingSystem":["Linux","Windows"],"toolType":["Command-line tool"],"topic":[{"term":"Nucleic acids","uri":"http://edamontology.org/topic_0077"},{"term":"Sequence analysis","uri":"http://edamontology.org/topic_0080"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/indelcoder-1-0-1-1-recodes-gaps-simple-indel-coding-algorithm.html"}],"publication":[{"abstract":"Simulation with indels was used to produce alignments where true site homologies in DNA sequences were known; the gaps from these datasets were removed and the sequences were then aligned to produce hypothesized alignments. Both alignments were then analyzed under three widely used methods of treating gaps during tree reconstruction under the maximum parsimony principle. With the true alignments, for many cases (82%), there was no difference in topological accuracy for the different methods of gap coding. However, in cases where a difference was present, coding gaps as a fifth state character or as separate presence/absence characters outperformed treating gaps as unknown/missing data nearly 90% of the time. For the hypothesized alignments, on average, all gap treatment approaches performed equally well. Data sets with higher sequence divergence and more pectinate tree shapes with variable branch lengths are more affected by gap coding than datasets associated with shallower non-pectinate tree shapes. © 2006 Elsevier Inc. All rights reserved.","authors":["Ogden T.H.","Rosenberg M.S."],"cit_count":65,"journal":"Molecular Phylogenetics and Evolution","pmid":"17011794","title":"How should gaps be treated in parsimony? A comparison of approaches using simulation","year":"2007-03-01"}],"summary":{"biotoolsCURIE":"biotools:indelcoder","biotoolsID":"indelcoder","description":"Takes a NEXUS file containing aligned DNA sequences and recodes the gaps using the simple indel coding algorithm.","homepage":"http://www.rosenberglab.net/software.html#IndelCoder","name":"IndelCoder"}}