{
    "additionDate": "2017-08-03T18:38:01Z",
    "biotoolsCURIE": "biotools:caic",
    "biotoolsID": "caic",
    "credit": [
        {
            "email": "a.purvis@imperial.ac.uk",
            "name": "Andy Purvis",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.bio.ic.ac.uk/research/apurvis/ajpurvis.htm"
        }
    ],
    "description": "Freeware comparative analysis package to find and calculates phylogenetically independent contrasts in one or more variables enabling you to test hypotheses of correlated evolution.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://www.bio.ic.ac.uk/evolve/software/caic/index.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Phylogenetic tree comparison",
                    "uri": "http://edamontology.org/operation_0325"
                }
            ]
        }
    ],
    "homepage": "http://www.bio.ic.ac.uk/evolve/software/caic/index.html",
    "lastUpdate": "2018-12-10T12:58:55Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/caic-v-2-6-9-macrocaic-calculates-phylogenetically-independent-contrasts-variables.html"
        }
    ],
    "name": "CAIC",
    "operatingSystem": [
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "CAIC is an application for the Apple Macintosh which allows the valid analysis of comparative (multi-species) data sets that include continuous variables. Comparison among species is the most common technique for testing hypotheses of how organisms are adapted to their environments, but standard statistical tests like regression should not be used with species data. Such tests assume independence of data points, but related species often share traits by common descent rather than through independent adaptation. CAIC uses a phylogeny of the species in the data set to partition the variance among species into independent comparisons (technically, linear contrasts), each comparison being made at a d node in the phylogeny. There are two partitioning procedures-one used when all variables are continuous, the other when one variable is discrete. The resulting comparisons can be analysed validly in standard statistical packages to lest hypotheses about correlated evolution among trails, to estimate parameters such as allometric exponents, and to compare rates of evolution. Previous versions of the package have already been used widely; this version is simpler to use and works on a wider range of machines. The package and manual are freely available by anonymous ftp or from the authors. © 1995 Oxford University Press.",
                "authors": [
                    {
                        "name": "Purvis A."
                    },
                    {
                        "name": "Rambaut A."
                    }
                ],
                "citationCount": 1004,
                "date": "1995-06-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Comparative analysis by independent contrasts (CAIC): An apple macintosh application for analysing comparative data"
            },
            "pmid": "7583692"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Evolutionary biology",
            "uri": "http://edamontology.org/topic_3299"
        },
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ],
    "validated": 1
}
