{
    "additionDate": "2019-11-14T19:35:58Z",
    "biotoolsCURIE": "biotools:GTACG",
    "biotoolsID": "GTACG",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "caio.santiago@usp.br",
            "name": "Caio Rafael do Nascimento Santiago",
            "typeEntity": "Person"
        },
        {
            "email": "lmmorei@ufop.edu.br",
            "name": "Leandro Marcio Moreira",
            "typeEntity": "Person"
        }
    ],
    "description": "A User-Friendly Framework for Bacterial Comparative Genomics | Backend application for the GTACG project (Gene Tags Assessment by Comparative Genomics) | Frontend application for the GTACG project (Gene Tags Assessment by Comparative Genomics) | This project is the frontend part of the GTACG framework (Gene Tags Assessment by Comparative Genomics): a framework for comparative analysis of bacterial genomes | A proper execution of the GTACG pipeline requires at least genomic files (in fasta format) and coding sequences (CDS, faa, gbf, gb, gff) files. Additionally, you can define phenotypes groups. The following command lines can be used to download files with examples of these formats:",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence trimming",
                    "uri": "http://edamontology.org/operation_3192"
                }
            ]
        }
    ],
    "homepage": "https://github.com/caiorns/GTACG-backend",
    "language": [
        "JavaScript",
        "Java"
    ],
    "lastUpdate": "2020-12-07T08:34:50.081353Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/caiorns/GTACG-frontend"
        }
    ],
    "name": "GTACG",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.3389/FGENE.2019.00725",
            "metadata": {
                "abstract": "Copyright © 2019 Santiago, Assis, Moreira and Digiampietri. This is an open-access article distributed under the terms of the Creative Commons Attribution License (CC BY). The use, distribution or reproduction in other forums is permitted, provided the original author(s) and the copyright owner(s) are credited and that the original publication in this journal is cited, in accordance with accepted academic practice. No use, distribution or reproduction is permitted which does not comply with these terms.Genomics research has produced an exponential amount of data. However, the genetic knowledge pertaining to certain phenotypic characteristics is lacking. Also, a considerable part of these genomes have coding sequences (CDSs) with unknown functions, posing additional challenges to researchers. Phylogenetically close microorganisms share much of their CDSs, and certain phenotypes unique to a set of microorganisms may be the result of the genes found exclusively in those microorganisms. This study presents the GTACG framework, an easy-to-use tool for identifying in the subgroups of bacterial genomes whose microorganisms have common phenotypic characteristics, to find data that differentiates them from other associated genomes in a simple and fast way. The GTACG analysis is based on the formation of homologous CDS clusters from local alignments. The front-end is easy to use, and the installation packages have been developed to enable users lacking knowledge of programming languages or bioinformatics analyze high-throughput data using the tool. The validation of the GTACG framework has been carried out based on a case report involving a set of 161 genomes from the Xanthomonadaceae family, in which 19 families of orthologous proteins were found in 90% of the plant-associated genomes, allowing the identification of the proteins potentially associated with adaptation and virulence in plant tissue. The results show the potential use of GTACG in the search for new targets for molecular studies, and GTACG can be used as a research tool by biologists who lack advanced knowledge in the use of computational tools for bacterial comparative genomics.",
                "authors": [
                    {
                        "name": "De Lo Nascimento Santiago C.R."
                    },
                    {
                        "name": "De Almeida Barbosa Assis R."
                    },
                    {
                        "name": "Moreira L.M."
                    },
                    {
                        "name": "Digiampietri L.A."
                    }
                ],
                "date": "2019-01-01T00:00:00Z",
                "journal": "Frontiers in Genetics",
                "title": "Gene tags assessment by Comparative genomics (GTACG): A user-friendly framework for bacterial comparative genomics"
            },
            "pmcid": "PMC6718126",
            "pmid": "31507629"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Gene and protein families",
            "uri": "http://edamontology.org/topic_0623"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        }
    ]
}