{
    "additionDate": "2020-01-14T19:37:19Z",
    "biotoolsCURIE": "biotools:PiVR",
    "biotoolsID": "PiVR",
    "confidence_flag": "tool",
    "description": "PiVR is an affordable and versatile closed-loop platform to study unrestrained sensorimotor behavior.\n\nPiVR has been developed to track a variety of animals in real time and present them with light stimuli. The manual can be found at www.PiVR.org.\n\nThe tool is described in this paper: https://doi.org/10.1371/journal.pbio.3000712",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://pivr.readthedocs.io/en/latest/"
        }
    ],
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "http://www.PiVR.org",
    "lastUpdate": "2020-12-05T11:16:08.417934Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://gitlab.com/LouisLab/PiVR"
        },
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://gitlab.com/LouisLab/pivr/issues"
        }
    ],
    "name": "PiVR",
    "owner": "dtadres",
    "publication": [
        {
            "doi": "10.1371/journal.pbio.3000712",
            "metadata": {
                "abstract": "Copyright: © 2020 Tadres, Louis. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Tools enabling closed-loop experiments are crucial to delineate causal relationships between the activity of genetically labeled neurons and specific behaviors. We developed the Raspberry Pi Virtual Reality (PiVR) system to conduct closed-loop optogenetic stimulation of neural functions in unrestrained animals. PiVR is an experimental platform that operates at high temporal resolution (70 Hz) with low latencies (<30 milliseconds), while being affordable (<US$500) and easy to build (<6 hours). Through extensive documentation, this tool was designed to be accessible to a wide public, from high school students to professional researchers studying systems neuroscience. We illustrate the functionality of PiVR by focusing on sensory navigation in response to gradients of chemicals (chemotaxis) and light (phototaxis). We show how Drosophila adult flies perform negative chemotaxis by modulating their locomotor speed to avoid locations associated with optogenetically evoked bitter taste. In Drosophila larvae, we use innate positive chemotaxis to compare behavior elicited by real- and virtual-odor gradients. Finally, we examine how positive phototaxis emerges in zebrafish larvae from the modulation of turning maneuvers to orient in virtual white-light gradients. Besides its application to study chemotaxis and phototaxis, PiVR is a versatile tool designed to bolster efforts to map and to functionally characterize neural circuits.",
                "authors": [
                    {
                        "name": "Tadres D."
                    },
                    {
                        "name": "Louis M."
                    }
                ],
                "date": "2020-07-01T00:00:00Z",
                "journal": "PLoS Biology",
                "title": "PiVR: An affordable and versatile closed-loop platform to study unrestrained sensorimotor behavior"
            }
        }
    ],
    "topic": [
        {
            "term": "Neurobiology",
            "uri": "http://edamontology.org/topic_3304"
        },
        {
            "term": "Zoology",
            "uri": "http://edamontology.org/topic_3500"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Literature and language",
            "uri": "http://edamontology.org/topic_3068"
        }
    ]
}