{"credit":[{"email":"yangwl@hkucc.hku.hk","typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://paed.hku.hk/genome/index.html"}],"documentation":[{"type":"GENERAL","url":"http://paed.hku.hk/genome/software/SRinversion/manual.html"}],"function":[{"operation":[{"term":"Sequence analysis","uri":"http://edamontology.org/operation_2403"},{"term":"DNA mapping","uri":"http://edamontology.org/operation_2520"}]}],"labels":{"language":["Perl"],"operatingSystem":["Linux","Windows"],"toolType":["Command-line tool"],"topic":[{"term":"DNA","uri":"http://edamontology.org/topic_0654"},{"term":"Sequencing","uri":"http://edamontology.org/topic_3168"},{"term":"Mapping","uri":"http://edamontology.org/topic_0102"},{"term":"Sequence analysis","uri":"http://edamontology.org/topic_0080"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/srinversion-detection-of-short-inversions-in-human-genome-using-next-generation-sequecing-data.html"}],"publication":[{"abstract":"© The Author 2016. Motivation: Rapid development in sequencing technologies has dramatically improved our ability to detect genetic variants in human genome. However, current methods have variable sensitivities in detecting different types of genetic variants. One type of such genetic variants that is especially hard to detect is inversions. Analysis of public databases showed that few short inversions have been reported so far. Unlike reads that contain small insertions or deletions, which will be considered through gap alignment, reads carrying short inversions often have poor mapping quality or are unmapped, thus are often not further considered. As a result, the majority of short inversions might have been overlooked and require special algorithms for their detection. Results: Here, we introduce SRinversion, a framework to analyze poorly mapped or unmapped reads by splitting and re-aligning them for the purpose of inversion detection. SRinversion is very sensitive to small inversions and can detect those less than 10 bp in size. We applied SRinversion to both simulated data and high-coverage sequencing data from the 1000 Genomes Project and compared the results with those from Pindel, BreakDancer, DELLY, Gustaf and MID. A better performance of SRinversion was achieved for both datasets for the detection of small inversions.","authors":["Chen R.","Lau Y.L.","Zhang Y.","Yang W."],"cit_count":3,"journal":"Bioinformatics","pmid":"27503227","title":"SRinversion: A tool for detecting short inversions by splitting and re-aligning poorly mapped and unmapped sequencing reads","year":"2016-01-01"}],"summary":{"biotoolsCURIE":"biotools:srinversion","biotoolsID":"srinversion","description":"A framework to analyze poorly mapped or unmapped reads by splitting and re-aligning them for the purpose of inversion detection.","homepage":"http://paed.hku.hk/genome/software/SRinversion/index.html","name":"SRinversion"}}