{"credit":[{"email":"savor@pcbi.upenn.edu","name":"SAVoR Support","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"http://tesla.pcbi.upenn.edu/savor/"}],"function":[{"operation":[{"term":"RNA secondary structure prediction","uri":"http://edamontology.org/operation_0278"},{"term":"Structure visualisation","uri":"http://edamontology.org/operation_0570"},{"term":"RNA secondary structure alignment","uri":"http://edamontology.org/operation_0502"},{"term":"RNA secondary structure analysis","uri":"http://edamontology.org/operation_2439"}]}],"labels":{"language":["JavaScript","Ruby","Perl"],"operatingSystem":["Linux","Windows","Mac"],"toolType":["Web application"],"topic":[{"term":"Nucleic acid structure analysis","uri":"http://edamontology.org/topic_0097"},{"term":"Structure prediction","uri":"http://edamontology.org/topic_0082"},{"term":"RNA","uri":"http://edamontology.org/topic_0099"},{"term":"RNA-Seq","uri":"http://edamontology.org/topic_3170"},{"term":"Functional, regulatory and non-coding RNA","uri":"http://edamontology.org/topic_0659"}]},"publication":[{"abstract":"RNA secondary structure is required for the proper regulation of the cellular transcriptome. This is because the functionality, processing, localization and stability of RNAs are all dependent on the folding of these molecules into intricate structures through specific base pairing interactions encoded in their primary nucleotide sequences. Thus, as the number of RNA sequencing (RNA-seq) data sets and the variety of protocols for this technology grow rapidly, it is becoming increasingly pertinent to develop tools that can analyze and visualize this sequence data in the context of RNA secondary structure. Here, we present Sequencing Annotation and Visualization of RNA structures (SAVoR), a web server, which seamlessly links RNA structure predictions with sequencing data and genomic annotations to produce highly informative and annotated models of RNA secondary structure. SAVoR accepts read alignment data from RNA-seq experiments and computes a series of per-base values such as read abundance and sequence variant frequency. These values can then be visualized on a customizable secondary structure model. SAVoR is freely available at http://tesla.pcbi.upenn.edu/savor. © 2012 The Author(s).","authors":["Li F.","Ryvkin P.","Childress D.M.","Valladares O.","Gregory B.D.","Wang L.-S."],"cit_count":11,"journal":"Nucleic Acids Research","pmid":"22492627","title":"SAVoR: A server for sequencing annotation and visualization of RNA structures","year":"2012-07-01"}],"summary":{"biotoolsCURIE":"biotools:savor","biotoolsID":"savor","description":"SAVoR webserver allows the user to visualize RNA-seq data and other genomic annotations on RNA secondary structures. SAVoR is designed to help researchers visualize sequencing data in the context of RNA secondary structures. Useful if you want to see the distribution of smRNA-seq reads along a microRNA precursor, how a set of SNPs might impact RNA structure, or in a control vs. treatment sequencing experiments you would like to see regions of enrichment along an RNA structure.","homepage":"http://tesla.pcbi.upenn.edu/savor","name":"SAVoR"}}