{"collectionID": [], "accessibility": [], "topic": [{"term": "Systems biology", "uri": "http://edamontology.org/topic_2259"}, {"term": "Molecular interactions, pathways and networks", "uri": "http://edamontology.org/topic_0602"}, {"term": "Protein interactions", "uri": "http://edamontology.org/topic_0128"}], "owner": "mbs_import", "cost": null, "relation": [], "download": [], "validated": 1, "publication": [{"doi": null, "note": null, "version": null, "pmid": "25541727", "type": null, "pmcid": null, "metadata": {"title": "ReNE: A cytoscape plugin for regulatory network enhancement", "abstract": "© 2014 Politano et al.One of the biggest challenges in the study of biological regulatory mechanisms is the integration, americanmodeling, and analysis of the complex interactions which take place in biological networks. Despite post transcriptional regulatory elements (i.e., miRNAs) are widely investigated in current research, their usage and visualization in biological networks is very limited. Regulatory networks are commonly limited to gene entities. To integrate networks with post transcriptional regulatory data, researchers are therefore forced to manually resort to specific third party databases. In this context, we introduce ReNE, a Cytoscape 3.x plugin designed to automatically enrich a standard gene-based regulatory network with more detailed transcriptional, post transcriptional, and translational data, resulting in an enhanced network that more precisely models the actual biological regulatory mechanisms. ReNE can automatically import a network layout from the Reactome or KEGG repositories, or work with custom pathways described using a standard OWL/XML data format that the Cytoscape import procedure accepts. Moreover, ReNE allows researchers to merge multiple pathways coming from different sources. The merged network structure is normalized to guarantee a consistent and uniform description of the network nodes and edges and to enrich all integrated data with additional annotations retrieved from genome-wide databases like NCBI, thus producing a pathway fully manageable through the Cytoscape environment. The normalized network is then analyzed to include missing transcription factors, miRNAs, and proteins. The resulting enhanced network is still a fully functional Cytoscape network where each regulatory element (transcription factor, miRNA, gene, protein) and regulatory mechanism (up-regulation/down-regulation) is clearly visually identifiable, thus enabling a better visual understanding of its role and the effect in the network behavior. The enhanced network produced by ReNE is exportable in multiple formats for further analysis via third party applications. ReNE can be freely installed from the Cytoscape App Store (http://apps.cytoscape.org/apps/rene) and the full source code is freely available for download through a SVN repository accessible at http://www.sysbio.polito.it/tools-svn/BioInformatics/Rene/releases/. ReNE enhances a network by only integrating data from public repositories, without any inference or prediction. The reliability of the introduced interactions only depends on the reliability of the source data, which is out of control of ReNe developers.", "citationCount": 9, "authors": [{"name": "Politano G."}, {"name": "Benso A."}, {"name": "Savino A."}, {"name": "Di Carlo S."}], "date": "2014-12-26T00:00:00Z", "journal": "PLoS ONE"}}], "homepage_status": 1, "credit": [{"typeRole": ["Primary contact"], "name": null, "url": "http://www.sysbio.polito.it/", "gridid": null, "note": null, "orcidid": null, "typeEntity": "Person", "email": "gianfranco.politano@polito.it"}], "biotoolsCURIE": "biotools:rene", "elixirPlatform": [], "elixirNode": [], "version": [], "elixir_badge": 0, "homepage": "http://www.sysbio.polito.it/index.php/tools-and-downloads/item/220-rene", "function": [{"note": null, "input": [], "operation": [{"term": "Pathway or network visualisation", "uri": "http://edamontology.org/operation_3083"}], "cmd": null, "output": []}], "lastUpdate": "2018-12-10T12:58:50Z", "otherID": [], "description": "A new Cytoscape 3.x plugin, which enables integration, merging, enhancement, visualization, and exporting of pathways from multiple repositories.", "toolType": ["Plug-in"], "editPermission": {"type": "private", "authors": []}, "language": ["Java"], "link": [{"url": "http://www.mybiosoftware.com/rene-a-cytoscape-plugin-for-regulatory-network-enhancement.html", "note": null, "type": "Software catalogue"}], "biotoolsID": "rene", "additionDate": "2017-08-03T18:58:26Z", "name": "ReNE", "license": null, "documentation": [{"url": "https://www.sysbio.polito.it/rene/", "note": null, "type": "General"}], "maturity": null, "confidence_flag": null, "operatingSystem": ["Linux", "Windows", "Mac"]}