{
    "accessibility": "Open access",
    "additionDate": "2023-03-19T09:04:18.152075Z",
    "biotoolsCURIE": "biotools:egae",
    "biotoolsID": "egae",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "José F. Aldana-Montes"
        }
    ],
    "description": "An image explainer that automizes image segmentation. Ensemble-based Genetic Algorithm Explainer (EGAE) for melanoma cancer detection that automatically detects and presents the informative sections of the image to the user.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Phasing",
                    "uri": "http://edamontology.org/operation_3454"
                }
            ]
        }
    ],
    "homepage": "https://github.com/KhaosResearch/EGAE",
    "language": [
        "Python"
    ],
    "lastUpdate": "2023-03-19T09:04:18.157215Z",
    "license": "MIT",
    "name": "EGAE",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1016/J.COMPBIOMED.2023.106613",
            "metadata": {
                "abstract": "Explainable Artificial Intelligence (XAI) makes AI understandable to the human user particularly when the model is complex and opaque. Local Interpretable Model-agnostic Explanations (LIME) has an image explainer package that is used to explain deep learning models. The image explainer of LIME needs some parameters to be manually tuned by the expert in advance, including the number of top features to be seen and the number of superpixels in the segmented input image. This parameter tuning is a time-consuming task. Hence, with the aim of developing an image explainer that automizes image segmentation, this paper proposes Ensemble-based Genetic Algorithm Explainer (EGAE) for melanoma cancer detection that automatically detects and presents the informative sections of the image to the user. EGAE has three phases. First, the sparsity of chromosomes in GAs is determined heuristically. Then, multiple GAs are executed consecutively. However, the difference between these GAs are in different number of superpixels in the input image that result in different chromosome lengths. Finally, the results of GAs are ensembled using consensus and majority votings. This paper also introduces how Euclidean distance can be used to calculate the distance between the actual explanation (delineated by experts) and the calculated explanation (computed by the explainer) for accuracy measurement. Experimental results on a melanoma dataset show that EGAE automatically detects informative lesions, and it also improves the accuracy of explanation in comparison with LIME efficiently. The python codes for EGAE, the ground truths delineated by clinicians, and the melanoma detection dataset are available at https://github.com/KhaosResearch/EGAE.",
                "authors": [
                    {
                        "name": "Aldana-Montes J.F."
                    },
                    {
                        "name": "Garcia-Nieto J."
                    },
                    {
                        "name": "Navas-Delgado I."
                    },
                    {
                        "name": "Nematzadeh H."
                    }
                ],
                "date": "2023-03-01T00:00:00Z",
                "journal": "Computers in Biology and Medicine",
                "title": "Ensemble-based genetic algorithm explainer with automized image segmentation: A case study on melanoma detection dataset"
            },
            "pmid": "36764157"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        }
    ]
}
