{
    "accessibility": "Open access",
    "additionDate": "2022-08-17T21:38:23.583435Z",
    "biotoolsCURIE": "biotools:rt-cloud",
    "biotoolsID": "rt-cloud",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Jonathan D. Cohen"
        },
        {
            "name": "Kenneth A. Norman"
        },
        {
            "name": "Nicholas B. Turk-Browne"
        },
        {
            "name": "Sebastian Michelmann"
        }
    ],
    "description": "A cloud-based software framework to simplify and standardize real-time fMRI.",
    "editPermission": {
        "type": "private"
    },
    "homepage": "https://github.com/brainiak/rt-cloud",
    "language": [
        "JavaScript",
        "Python"
    ],
    "lastUpdate": "2022-08-17T21:38:23.586368Z",
    "license": "Apache-2.0",
    "name": "RT-Cloud",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1016/J.NEUROIMAGE.2022.119295",
            "metadata": {
                "abstract": "© 2022 The Author(s)Real-time fMRI (RT-fMRI) neurofeedback has been shown to be effective in treating neuropsychiatric disorders and holds tremendous promise for future breakthroughs, both with regard to basic science and clinical applications. However, the prevalence of its use has been hampered by computing hardware requirements, the complexity of setting up and running an experiment, and a lack of standards that would foster collaboration. To address these issues, we have developed RT-Cloud (https://github.com/brainiak/rt-cloud), a flexible, cloud-based, open-source Python software package for the execution of RT-fMRI experiments. RT-Cloud uses standardized data formats and adaptable processing streams to support and expand open science in RT-fMRI research and applications. Cloud computing is a key enabling technology for advancing RT-fMRI because it eliminates the need for on-premise technical expertise and high-performance computing; this allows installation, configuration, and maintenance to be automated and done remotely. Furthermore, the scalability of cloud computing makes it easier to deploy computationally-demanding multivariate analyses in real time. In this paper, we describe how RT-Cloud has been integrated with open standards, including the Brain Imaging Data Structure (BIDS) standard and the OpenNeuro database, how it has been applied thus far, and our plans for further development and deployment of RT-Cloud in the coming years.",
                "authors": [
                    {
                        "name": "Brooks P.P."
                    },
                    {
                        "name": "Cohen J.D."
                    },
                    {
                        "name": "Li K."
                    },
                    {
                        "name": "Mennen A.C."
                    },
                    {
                        "name": "Michelmann S."
                    },
                    {
                        "name": "Norman K.A."
                    },
                    {
                        "name": "Polcyn S."
                    },
                    {
                        "name": "Scotti P.S."
                    },
                    {
                        "name": "Turk-Browne N.B."
                    },
                    {
                        "name": "Wallace G."
                    },
                    {
                        "name": "Zhao K."
                    }
                ],
                "date": "2022-08-15T00:00:00Z",
                "journal": "NeuroImage",
                "title": "RT-Cloud: A cloud-based software framework to simplify and standardize real-time fMRI"
            },
            "pmid": "35580808"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Computer science",
            "uri": "http://edamontology.org/topic_3316"
        },
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        }
    ],
    "validated": 1
}
