{
    "additionDate": "2021-01-18T11:13:19Z",
    "biotoolsCURIE": "biotools:rnathor",
    "biotoolsID": "rnathor",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "mszachniuk@cs.put.poznan.pl",
            "name": "Marta Szachniuk",
            "orcidid": "https://orcid.org/0000-0002-8724-7908",
            "typeEntity": "Person"
        },
        {
            "email": "kasiapw@ibch.poznan.pl",
            "name": "Katarzyna Pachulska-Wieczorek",
            "typeEntity": "Person"
        }
    ],
    "description": "fast, accurate normalization, visualization and statistical analysis of RNA probing data resolved by capillary electrophoresis.\n\nRNAthor is a tool for the fully automated normalization and analysis of SHAPE/DMS data resolved by capillary electrophoresis (CE) and processed in ShapeFinder or QuShape. RNAthor significantly reduces the time required for data analysis and provides tools for fast and easy data visualization and statistical analysis. Main functions of RNAthor:.",
    "editPermission": {
        "authors": [
            "Miroslava"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                },
                {
                    "term": "RNA secondary structure prediction",
                    "uri": "http://edamontology.org/operation_0278"
                },
                {
                    "term": "RNA structure prediction",
                    "uri": "http://edamontology.org/operation_2441"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Structure visualisation",
                    "uri": "http://edamontology.org/operation_0570"
                }
            ]
        }
    ],
    "homepage": "http://rnathor.cs.put.poznan.pl/",
    "lastUpdate": "2021-02-11T11:09:44Z",
    "name": "RNAthor",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PONE.0239287",
            "metadata": {
                "abstract": "Copyright: © 2020 Gumna et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.RNAs adopt specific structures to perform their functions, which are critical to fundamental cellular processes. For decades, these structures have been determined and modeled with strong support from computational methods. Still, the accuracy of the latter ones depends on the availability of experimental data, for example, chemical probing information that can define pseudo-energy constraints for RNA folding algorithms. At the same time, diverse computational tools have been developed to facilitate analysis and visualization of data from RNA structure probing experiments followed by capillary electrophoresis or next-generation sequencing. RNAthor, a new software tool for the fully automated normalization of SHAPE and DMS probing data resolved by capillary electrophoresis, has recently joined this collection. RNAthor automatically identifies unreliable probing data. It normalizes the reactivity information to a uniform scale and uses it in the RNA secondary structure prediction. Our web server also provides tools for fast and easy RNA probing data visualization and statistical analysis that facilitates the comparison of multiple data sets. RNAthor is freely available at http://rnathor.cs.put.poznan.pl/.",
                "authors": [
                    {
                        "name": "Figurski K."
                    },
                    {
                        "name": "Gumna J."
                    },
                    {
                        "name": "Pachulska-Wieczorek K."
                    },
                    {
                        "name": "Szachniuk M."
                    },
                    {
                        "name": "Zok T."
                    }
                ],
                "date": "2020-10-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "RNAthor – Fast, accurate normalization, visualization and statistical analysis of RNA probing data resolved by capillary electrophoresis"
            },
            "pmcid": "PMC7529196",
            "pmid": "33002005"
        }
    ],
    "topic": [
        {
            "term": "Nucleic acid structure analysis",
            "uri": "http://edamontology.org/topic_0097"
        },
        {
            "term": "Probes and primers",
            "uri": "http://edamontology.org/topic_0632"
        },
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Structure prediction",
            "uri": "http://edamontology.org/topic_0082"
        }
    ]
}
