{
    "additionDate": "2021-01-18T07:35:24Z",
    "biotoolsCURIE": "biotools:plantpepdb",
    "biotoolsID": "plantpepdb",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "shailesh@nipgr.ac.in",
            "name": "Shailesh Kumar",
            "orcidid": "https://orcid.org/0000-0002-1872-9903",
            "typeEntity": "Person"
        }
    ],
    "description": "PlantPepDB is a manually curated database of plant peptides having different functions and therapeutic activities. It contains 3848 peptide entries collected from 11 databases and 835 published research articles. Each entry provides comprehensive information about a peptide that includes its sequence, functional information, source, physicochemical properties, tertiary structure, etc. These peptides have been collected and complied from published databases and research articles. On the basis of their activities, we classified the peptides in 9 categories. Detailed information of these categories and sub-categories can be found on statistics page.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Protein identification",
                    "uri": "http://edamontology.org/operation_3767"
                }
            ]
        }
    ],
    "homepage": "http://www.nipgr.ac.in/PlantPepDB/",
    "lastUpdate": "2021-01-24T07:38:27Z",
    "name": "PlantPepDB",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1038/S41598-020-59165-2",
            "metadata": {
                "abstract": "© 2020, The Author(s).Plants produce an array of peptides as part of their innate defense mechanism against pathogens. The potential use of these peptides for various therapeutic purposes is increasing per diem. In order to excel in this research, the community requires web repositories that provide reliable and accurate information about these phyto-peptides. This work is an attempt to bridge the gaps in plant-based peptide research. PlantPepDB is a manually curated database that consists of 3848 plant-derived peptides among which 2821 are experimentally validated at the protein level, 458 have experimental evidence at the transcript level, 530 are predicted and only 39 peptides are inferred from homology. Incorporation of physicochemical properties and tertiary structure into PlantPepDB will help the users to study the therapeutic potential of a peptide, thus, debuts as a powerful resource for therapeutic research. Different options like Simple, Advanced, PhysicoChem and AA composition search along with browsing utilities are provided in the database for the users to execute dynamic search and retrieve the desired data. Interestingly, many peptides that were considered to possess only a single property were found to exhibit multiple properties after careful curation and merging the duplicate data that was collected from published literature and already available databases. Overall, PlantPepDB is the first database comprising detailed analysis and comprehensive information of phyto-peptides from a broad functional range which will be useful for peptide-based applied research. PlantPepDB is freely available at http://www.nipgr.ac.in/PlantPepDB/.",
                "authors": [
                    {
                        "name": "Das D."
                    },
                    {
                        "name": "Jaiswal M."
                    },
                    {
                        "name": "Khan F.N."
                    },
                    {
                        "name": "Ahamad S."
                    },
                    {
                        "name": "Kumar S."
                    }
                ],
                "citationCount": 8,
                "date": "2020-12-01T00:00:00Z",
                "journal": "Scientific Reports",
                "title": "PlantPepDB: A manually curated plant peptide database"
            },
            "pmcid": "PMC7010657",
            "pmid": "32042035"
        }
    ],
    "topic": [
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        },
        {
            "term": "Data submission, annotation and curation",
            "uri": "http://edamontology.org/topic_0219"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Literature and language",
            "uri": "http://edamontology.org/topic_3068"
        }
    ],
    "validated": 1
}