{
    "accessibility": "Open access",
    "additionDate": "2022-04-10T10:42:32.787412Z",
    "biotoolsCURIE": "biotools:oas",
    "biotoolsID": "oas",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "deane@stats.ox.ac.uk",
            "name": "Charlotte M. Deane",
            "orcidid": "https://orcid.org/0000-0003-1388-2252",
            "typeEntity": "Person"
        },
        {
            "name": "Fergus Boyles"
        },
        {
            "name": "Tobias H. Olsen",
            "orcidid": "https://orcid.org/0000-0002-6348-4650"
        }
    ],
    "description": "A diverse database of cleaned, annotated, and translated unpaired and paired antibody sequences.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                }
            ]
        }
    ],
    "homepage": "http://opig.stats.ox.ac.uk/webapps/oas/",
    "lastUpdate": "2022-04-10T10:42:32.789945Z",
    "license": "CC-BY-4.0",
    "name": "OAS",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1002/PRO.4205",
            "metadata": {
                "abstract": "© 2021 The Authors. Protein Science published by Wiley Periodicals LLC on behalf of The Protein Society.The antibody repertoires of individuals and groups have been used to explore disease states, understand vaccine responses, and drive therapeutic development. The arrival of B-cell receptor repertoire sequencing has enabled researchers to get a snapshot of these antibody repertoires, and as more data are generated, increasingly in-depth studies are possible. However, most publicly available data only exist as raw FASTQ files, making the data hard to access, process, and compare. The Observed Antibody Space (OAS) database was created in 2018 to offer clean, annotated, and translated repertoire data. In this paper, we describe an update to OAS that has been driven by the increasing volume of data and the appearance of paired (VH/VL) sequence data. OAS is now accessible via a new web server, with standardized search parameters and a new sequence-based search option. The new database provides both nucleotides and amino acids for every sequence, with additional sequence annotations to make the data Minimal Information about Adaptive Immune Receptor Repertoire compliant, and comments on potential problems with the sequence. OAS now contains 25 new studies, including severe acute respiratory syndrome coronavirus 2 data and paired sequencing data. The new database is accessible at http://opig.stats.ox.ac.uk/webapps/oas/, and all data are freely available for download.",
                "authors": [
                    {
                        "name": "Boyles F."
                    },
                    {
                        "name": "Deane C.M."
                    },
                    {
                        "name": "Olsen T.H."
                    }
                ],
                "date": "2022-01-01T00:00:00Z",
                "journal": "Protein Science",
                "title": "Observed Antibody Space: A diverse database of cleaned, annotated, and translated unpaired and paired antibody sequences"
            },
            "pmcid": "PMC8740823",
            "pmid": "34655133"
        }
    ],
    "toolType": [
        "Database portal",
        "Web application"
    ],
    "topic": [
        {
            "term": "Biotherapeutics",
            "uri": "http://edamontology.org/topic_3374"
        },
        {
            "term": "Immunogenetics",
            "uri": "http://edamontology.org/topic_3930"
        },
        {
            "term": "Immunoproteins and antigens",
            "uri": "http://edamontology.org/topic_2830"
        },
        {
            "term": "Protein expression",
            "uri": "http://edamontology.org/topic_0108"
        },
        {
            "term": "Zoology",
            "uri": "http://edamontology.org/topic_3500"
        }
    ]
}
