{
    "accessibility": [
        "Open access"
    ],
    "additionDate": "2019-06-21T14:47:45Z",
    "biotoolsCURIE": "biotools:MDDGlutar",
    "biotoolsID": "MDDGlutar",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "francis@saturn.yzu.edu.tw",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Web server for identifying glutarylation sites.",
    "documentation": [
        {
            "type": "General",
            "url": "http://csb.cse.yzu.edu.tw/MDDGlutar/introduction.php"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Post-translation modification site prediction",
                    "uri": "http://edamontology.org/operation_0417"
                },
                {
                    "term": "PTM localisation",
                    "uri": "http://edamontology.org/operation_3755"
                }
            ]
        }
    ],
    "homepage": "http://csb.cse.yzu.edu.tw/MDDGlutar/",
    "lastUpdate": "2019-06-21T14:47:45Z",
    "maturity": "Mature",
    "name": "MDDGlutar",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "Ruta",
    "publication": [
        {
            "doi": "10.1186/s12859-018-2394-9",
            "metadata": {
                "abstract": "© 2018 The Author(s). Background: Glutarylation, the addition of a glutaryl group (five carbons) to a lysine residue of a protein molecule, is an important post-translational modification and plays a regulatory role in a variety of physiological and biological processes. As the number of experimentally identified glutarylated peptides increases, it becomes imperative to investigate substrate motifs to enhance the study of protein glutarylation. We carried out a bioinformatics investigation of glutarylation sites based on amino acid composition using a public database containing information on 430 non-homologous glutarylation sites. Results: The TwoSampleLogo analysis indicates that positively charged and polar amino acids surrounding glutarylated sites may be associated with the specificity in substrate site of protein glutarylation. Additionally, the chi-squared test was utilized to explore the intrinsic interdependence between two positions around glutarylation sites. Further, maximal dependence decomposition (MDD), which consists of partitioning a large-scale dataset into subgroups with statistically significant amino acid conservation, was used to capture motif signatures of glutarylation sites. We considered single features, such as amino acid composition (AAC), amino acid pair composition (AAPC), and composition of k-spaced amino acid pairs (CKSAAP), as well as the effectiveness of incorporating MDD-identified substrate motifs into an integrated prediction model. Evaluation by five-fold cross-validation showed that AAC was most effective in discriminating between glutarylation and non-glutarylation sites, according to support vector machine (SVM). Conclusions: The SVM model integrating MDD-identified substrate motifs performed well, with a sensitivity of 0.677, a specificity of 0.619, an accuracy of 0.638, and a Matthews Correlation Coefficient (MCC) value of 0.28. Using an independent testing dataset (46 glutarylated and 92 non-glutarylated sites) obtained from the literature, we demonstrated that the integrated SVM model could improve the predictive performance effectively, yielding a balanced sensitivity and specificity of 0.652 and 0.739, respectively. This integrated SVM model has been implemented as a web-based system (MDDGlutar), which is now freely available at http://csb.cse.yzu.edu.tw/MDDGlutar/.",
                "authors": [
                    {
                        "name": "Huang K.-Y."
                    },
                    {
                        "name": "Kao H.-J."
                    },
                    {
                        "name": "Hsu J.B.-K."
                    },
                    {
                        "name": "Weng S.-L."
                    },
                    {
                        "name": "Lee T.-Y."
                    }
                ],
                "citationCount": 1,
                "date": "2019-02-04T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Characterization and identification of lysine glutarylation based on intrinsic interdependence between positions in the substrate sites"
            },
            "pmid": "30717647",
            "type": "Primary"
        }
    ],
    "toolType": [
        "Web application",
        "Web service"
    ],
    "topic": [
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Protein modifications",
            "uri": "http://edamontology.org/topic_0601"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ]
}