{
    "additionDate": "2019-11-14T18:18:36Z",
    "biotoolsCURIE": "biotools:ROBOT",
    "biotoolsID": "ROBOT",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "rbca.jackson@gmail.com",
            "name": "Rebecca C. Jackson",
            "orcidid": "https://orcid.org/0000-0003-4871-5569",
            "typeEntity": "Person"
        }
    ],
    "description": "A Tool for Automating Ontology Workflows | ROBOT is a tool for working with Open Biomedical Ontologies | R.C. Jackson, J.P. Balhoff, E. Douglass, N.L. Harris, C.J. Mungall, and J.A. Overton. ROBOT: A tool for automating ontology workflows. BMC Bioinformatics, vol. 20, July 2019 | ROBOT is a tool for working with Open Biomedical Ontologies. It can be used as a command-line tool or as a library for any language on the Java Virtual Machine | If no --reasoner is provided, ROBOT will default to ELK. The following other reasoner options are supported: | ROBOT will always perform a logical validation check prior to automatic classification | Equivalent Classes (--equivalent-classes-allowed) | Generated Axioms(--axiom-generators)",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Named-entity and concept recognition",
                    "uri": "http://edamontology.org/operation_3280"
                },
                {
                    "term": "Ontology visualisation",
                    "uri": "http://edamontology.org/operation_3559"
                },
                {
                    "term": "Validation",
                    "uri": "http://edamontology.org/operation_2428"
                }
            ]
        }
    ],
    "homepage": "http://robot.obolibrary.org",
    "language": [
        "Java"
    ],
    "lastUpdate": "2020-12-14T08:38:45Z",
    "license": "BSD-3-Clause",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "http://robot.obolibrary.org/reason"
        },
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/ontodev/robot/"
        }
    ],
    "name": "ROBOT",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12859-019-3002-3",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Ontologies are invaluable in the life sciences, but building and maintaining ontologies often requires a challenging number of distinct tasks such as running automated reasoners and quality control checks, extracting dependencies and application-specific subsets, generating standard reports, and generating release files in multiple formats. Similar to more general software development, automation is the key to executing and managing these tasks effectively and to releasing more robust products in standard forms. For ontologies using the Web Ontology Language (OWL), the OWL API Java library is the foundation for a range of software tools, including the Protégé ontology editor. In the Open Biological and Biomedical Ontologies (OBO) community, we recognized the need to package a wide range of low-level OWL API functionality into a library of common higher-level operations and to make those operations available as a command-line tool. Results: ROBOT (a recursive acronym for \"ROBOT is an OBO Tool\") is an open source library and command-line tool for automating ontology development tasks. The library can be called from any programming language that runs on the Java Virtual Machine (JVM). Most usage is through the command-line tool, which runs on macOS, Linux, and Windows. ROBOT provides ontology processing commands for a variety of tasks, including commands for converting formats, running a reasoner, creating import modules, running reports, and various other tasks. These commands can be combined into larger workflows using a separate task execution system such as GNU Make, and workflows can be automatically executed within continuous integration systems. Conclusions: ROBOT supports automation of a wide range of ontology development tasks, focusing on OBO conventions. It packages common high-level ontology development functionality into a convenient library, and makes it easy to configure, combine, and execute individual tasks in comprehensive, automated workflows. This helps ontology developers to efficiently create, maintain, and release high-quality ontologies, so that they can spend more time focusing on development tasks. It also helps guarantee that released ontologies are free of certain types of logical errors and conform to standard quality control checks, increasing the overall robustness and efficiency of the ontology development lifecycle.",
                "authors": [
                    {
                        "name": "Balhoff J.P."
                    },
                    {
                        "name": "Douglass E."
                    },
                    {
                        "name": "Harris N.L."
                    },
                    {
                        "name": "Jackson R.C."
                    },
                    {
                        "name": "Mungall C.J."
                    },
                    {
                        "name": "Overton J.A."
                    }
                ],
                "citationCount": 22,
                "date": "2019-07-29T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "ROBOT: A Tool for Automating Ontology Workflows"
            },
            "pmcid": "PMC6664714",
            "pmid": "31357927"
        }
    ],
    "topic": [
        {
            "term": "Ontology and terminology",
            "uri": "http://edamontology.org/topic_0089"
        },
        {
            "term": "Software engineering",
            "uri": "http://edamontology.org/topic_3372"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ],
    "validated": 1
}
