{
    "additionDate": "2019-11-14T19:43:55Z",
    "biotoolsCURIE": "biotools:DeepMSPeptide",
    "biotoolsID": "DeepMSPeptide",
    "confidence_flag": "tool",
    "description": "The protein detection and quantification using high-throughput proteomic technologies is still challenging due to the stochastic nature of the peptide selection in the mass spectrometer, the difficulties in the statistical analysis of the results and the presence of degenerated peptides. However, considering in the analysis only those peptides that could be detected by mass spectrometry (MS), also called proteotypic peptides, increases the accuracy of the results. Several approaches have been applied to predict peptide detectability based on the physicochemical properties of the peptides. In this manuscript we present DeepMSPeptide, a bioinformatic tool that uses a deep learning method to predict proteotypic peptides exclusively based on the peptide amino acid sequences",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Peptide immunogenicity prediction",
                    "uri": "http://edamontology.org/operation_0252"
                },
                {
                    "term": "Protein signal peptide detection",
                    "uri": "http://edamontology.org/operation_0418"
                },
                {
                    "term": "Protein fragment weight comparison",
                    "uri": "http://edamontology.org/operation_2929"
                }
            ]
        }
    ],
    "homepage": "https://github.com/vsegurar/DeepMSPeptide",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-12-20T11:13:32Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/vsegurar/DeepMSPeptide/issues"
        }
    ],
    "name": "DeepMSPeptide",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ708",
            "metadata": {
                "abstract": "© 2020 Oxford University Press. All rights reserved.The protein detection and quantification using high-throughput proteomic technologies is still challenging due to the stochastic nature of the peptide selection in the mass spectrometer, the difficulties in the statistical analysis of the results and the presence of degenerated peptides. However, considering in the analysis only those peptides that could be detected by mass spectrometry, also called proteotypic peptides, increases the accuracy of the results. Several approaches have been applied to predict peptide detectability based on the physicochemical properties of the peptides. In this manuscript, we present DeepMSPeptide, a bioinformatic tool that uses a deep learning method to predict proteotypic peptides exclusively based on the peptide amino acid sequences. Availability and implementation: DeepMSPeptide is available at https://github.com/vsegurar/DeepMSPeptide.",
                "authors": [
                    {
                        "name": "Serrano G."
                    },
                    {
                        "name": "Guruceaga E."
                    },
                    {
                        "name": "Segura V."
                    }
                ],
                "citationCount": 3,
                "date": "2020-02-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "DeepMSPeptide: Peptide detectability prediction using deep learning"
            },
            "pmid": "31529040"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        }
    ],
    "validated": 1
}