{
    "accessibility": "Open access",
    "additionDate": "2022-06-20T13:03:33.413583Z",
    "biotoolsCURIE": "biotools:afse",
    "biotoolsID": "afse",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "huhf@njupt.edu.cn",
            "name": "Haifeng Hu",
            "typeEntity": "Person"
        },
        {
            "email": "jansen@njupt.edu.cn",
            "name": "Jiansheng Wu",
            "typeEntity": "Person"
        }
    ],
    "description": "An integrated web-based platform for molecular modeling and screening",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Feature extraction",
                    "uri": "http://edamontology.org/operation_3937"
                },
                {
                    "term": "Transmembrane protein prediction",
                    "uri": "http://edamontology.org/operation_0269"
                },
                {
                    "term": "Virtual screening",
                    "uri": "http://edamontology.org/operation_3938"
                }
            ]
        }
    ],
    "homepage": "http://noveldelta.com/AFSE",
    "lastUpdate": "2022-06-20T13:03:33.416372Z",
    "license": "Not licensed",
    "name": "AFSE",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1093/BIB/BBAC077",
            "metadata": {
                "abstract": "© The Author(s) 2022. Published by Oxford University Press. All rights reserved. For Permissions, please email: journals.permissions@oup.com.Ligand molecules naturally constitute a graph structure. Recently, many excellent deep graph learning (DGL) methods have been proposed and used to model ligand bioactivities, which is critical for the virtual screening of drug hits from compound databases in interest. However, pharmacists can find that these well-trained DGL models usually are hard to achieve satisfying performance in real scenarios for virtual screening of drug candidates. The main challenges involve that the datasets for training models were small-sized and biased, and the inner active cliff cases would worsen model performance. These challenges would cause predictors to overfit the training data and have poor generalization in real virtual screening scenarios. Thus, we proposed a novel algorithm named adversarial feature subspace enhancement (AFSE). AFSE dynamically generates abundant representations in new feature subspace via bi-directional adversarial learning, and then minimizes the maximum loss of molecular divergence and bioactivity to ensure local smoothness of model outputs and significantly enhance the generalization of DGL models in predicting ligand bioactivities. Benchmark tests were implemented on seven state-of-the-art open-source DGL models with the potential of modeling ligand bioactivities, and precisely evaluated by multiple criteria. The results indicate that, on almost all 33 GPCRs datasets and seven DGL models, AFSE greatly improved their enhancement factor (top-10%, 20% and 30%), which is the most important evaluation in virtual screening of hits from compound databases, while ensuring the superior performance on RMSE and $r^2$. The web server of AFSE is freely available at http://noveldelta.com/AFSE for academic purposes.",
                "authors": [
                    {
                        "name": "Hu H."
                    },
                    {
                        "name": "Huang Y."
                    },
                    {
                        "name": "Jiang F."
                    },
                    {
                        "name": "Wu J."
                    },
                    {
                        "name": "Yang Z."
                    },
                    {
                        "name": "Yin Y."
                    }
                ],
                "date": "2022-05-13T00:00:00Z",
                "journal": "Briefings in bioinformatics",
                "title": "AFSE: towards improving model generalization of deep graph learning of ligand bioactivities targeting GPCR proteins"
            },
            "pmid": "35348582"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Medicinal chemistry",
            "uri": "http://edamontology.org/topic_0209"
        },
        {
            "term": "Membrane and lipoproteins",
            "uri": "http://edamontology.org/topic_0820"
        },
        {
            "term": "Molecular biology",
            "uri": "http://edamontology.org/topic_3047"
        },
        {
            "term": "Molecular modelling",
            "uri": "http://edamontology.org/topic_2275"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
