{
    "additionDate": "2021-01-18T07:40:38Z",
    "biotoolsCURIE": "biotools:sisa",
    "biotoolsID": "sisa",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "sippyr@upstate.edu",
            "name": "Rachel Sippy",
            "orcidid": "https://orcid.org/0000-0003-3617-2093",
            "typeEntity": "Person"
        },
        {
            "email": "astewart@dir.iai.int",
            "name": "Anna M. Stewart Ibarra",
            "typeEntity": "Person"
        }
    ],
    "description": "Machine learning for accurate prediction of hospitalization in subjects suspected of arboviral infection.\n\nMachine learning project to predict subject hospitalization.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                }
            ]
        }
    ],
    "homepage": "https://github.com/rsippy/SISASISAL",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-02-19T15:17:27Z",
    "name": "SISA",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PNTD.0007969",
            "metadata": {
                "abstract": "© 2020 Sippy et al.Background Dengue, chikungunya, and Zika are arboviruses of major global health concern. Decisions regarding the clinical management of suspected arboviral infection are challenging in resource-limited settings, particularly when deciding on patient hospitalization. The objective of this study was to determine if hospitalization of individuals with suspected arboviral infections could be predicted using subject intake data. Methodology/Principal findings Two prediction models were developed using data from a surveillance study in Machala, a city in southern coastal Ecuador with a high burden of arboviral infections. Data were obtained from subjects who presented at sentinel medical centers with suspected arboviral infection (November 2013 to September 2017). The first prediction model—called the Severity Index for Suspected Arbovirus (SISA)—used only demographic and symptom data. The second prediction model—called the Severity Index for Suspected Arbovirus with Laboratory (SISAL)—incorporated laboratory data. These models were selected by comparing the prediction ability of seven machine learning algorithms; the area under the receiver operating characteristic curve from the prediction of a test dataset was used to select the final algorithm for each model. After eliminating those with missing data, the SISA dataset had 534 subjects, and the SISAL dataset had 98 subjects. For SISA, the best prediction algorithm was the generalized boosting model, with an AUC of 0.91. For SISAL, the best prediction algorithm was the elastic net with an AUC of 0.94. A sensitivity analysis revealed that SISA and SISAL are not directly comparable to one another. Conclusions/Significance Both SISA and SISAL were able to predict arbovirus hospitalization with a high degree of accuracy in our dataset. These algorithms will need to be tested and validated on new data from future patients. Machine learning is a powerful prediction tool and provides an excellent option for new management tools and clinical assessment of arboviral infection.",
                "authors": [
                    {
                        "name": "Sippyid R."
                    },
                    {
                        "name": "Farrell D.F."
                    },
                    {
                        "name": "Lichtenstein D.A."
                    },
                    {
                        "name": "Nightingale R."
                    },
                    {
                        "name": "Harris M.A."
                    },
                    {
                        "name": "Toth J."
                    },
                    {
                        "name": "Hantztidiamantis P."
                    },
                    {
                        "name": "Usher N."
                    },
                    {
                        "name": "Aponte C.C."
                    },
                    {
                        "name": "Aguilar J.B."
                    },
                    {
                        "name": "Puthumana A."
                    },
                    {
                        "name": "Lupone C.D."
                    },
                    {
                        "name": "Endy T."
                    },
                    {
                        "name": "Ryan S.J."
                    },
                    {
                        "name": "Stewart Ibarra A.M."
                    }
                ],
                "citationCount": 3,
                "date": "2020-02-01T00:00:00Z",
                "journal": "PLoS Neglected Tropical Diseases",
                "title": "Severity index for suspected arbovirus (SISA): Machine learning for accurate prediction of hospitalization in subjects suspected of arboviral infection"
            },
            "pmcid": "PMC7046343",
            "pmid": "32059026"
        }
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Medicine",
            "uri": "http://edamontology.org/topic_3303"
        },
        {
            "term": "Preclinical and clinical studies",
            "uri": "http://edamontology.org/topic_3379"
        }
    ]
}