{
    "name": "GeneNetFinder", 
    "description": "Software to qualitatively infer dynamic gene regulatory interactions from gene expression data. From the time-series data of gene expression, the software identifies not only gene regulatory interactions but also the temporal aspects of the regulatory interactions using two types of scores, R1 and R2. As for the temporal aspect of gene regulatory relations, it identifies the order of the gene regulatory relations and the pace of the relations.", 
    "homepage": "http://bclab.inha.ac.kr/GeneNetFinder/", 
    "biotoolsID": "genenetfinder", 
    "biotoolsCURIE": "biotools:genenetfinder", 
    "version": [], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_1781", 
                    "term": "Gene regulatory network analysis"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Desktop application"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_2259", 
            "term": "Systems biology"
        }, 
        {
            "uri": "http://edamontology.org/topic_0602", 
            "term": "Molecular interactions, pathways and networks"
        }, 
        {
            "uri": "http://edamontology.org/topic_0203", 
            "term": "Gene expression"
        }
    ], 
    "operatingSystem": [
        "Windows"
    ], 
    "language": [], 
    "license": null, 
    "collectionID": [], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [
        {
            "url": "http://www.mybiosoftware.com/genenetfinder-1-0-qualitive-reasoning-of-dynamic-gene-regulatory-interations-form-gene-expression-data.html", 
            "type": "Registry", 
            "note": null
        }
    ], 
    "download": [], 
    "documentation": [
        {
            "url": "http://bclab.inha.ac.kr/GeneNetFinder/usage.htm", 
            "type": "General", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": null, 
            "pmid": "26886731", 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "GeneNetFinder2: Improved Inference of Dynamic Gene Regulatory Relations with Multiple Regulators", 
                "abstract": "© 2016 IEEE.A gene involved in complex regulatory interactions may have multiple regulators since gene expression in such interactions is often controlled by more than one gene. Another thing that makes gene regulatory interactions complicated is that regulatory interactions are not static, but change over time during the cell cycle. Most research so far has focused on identifying gene regulatory relations between individual genes in a particular stage of the cell cycle. In this study we developed a method for identifying dynamic gene regulations of several types from the time-series gene expression data. The method can find gene regulations with multiple regulators that work in combination or individually as well as those with single regulators. The method has been implemented as the second version of GeneNetFinder (hereafter called GeneNetFinder2) and tested on several gene expression datasets. Experimental results with gene expression data revealed the existence of genes that are not regulated by individual genes but rather by a combination of several genes. Such gene regulatory relations cannot be found by conventional methods. Our method finds such regulatory relations as well as those with multiple, independent regulators or single regulators, and represents gene regulatory relations as a dynamic network in which different gene regulatory relations are shown in different stages of the cell cycle. GeneNetFinder2 is available at http://bclab.inha.ac.kr/GeneNetFinder and will be useful for modeling dynamic gene regulations with multiple regulators.", 
                "date": "2016-01-01T00:00:00Z", 
                "citationCount": 1, 
                "authors": [
                    {
                        "name": "Han K."
                    }, 
                    {
                        "name": "Lee J."
                    }
                ], 
                "journal": "IEEE/ACM Transactions on Computational Biology and Bioinformatics"
            }
        }
    ], 
    "credit": [
        {
            "name": null, 
            "email": null, 
            "url": "http://bclab.inha.ac.kr/", 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "mbs_import", 
    "additionDate": "2017-08-03T18:45:06Z", 
    "lastUpdate": "2018-12-10T12:58:45Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 1, 
    "homepage_status": 0, 
    "elixir_badge": 0
}