{"collectionID": [], "accessibility": [], "topic": [{"term": "Assembly", "uri": "http://edamontology.org/topic_0196"}], "owner": "mbs_import", "cost": null, "relation": [], "download": [], "validated": 1, "publication": [{"doi": "10.1371/journal.pone.0001836", "note": null, "version": null, "pmid": null, "type": "Primary", "pmcid": null, "metadata": {"title": "Improving phrap-based assembly of the rat using \"reliable\" overlaps", "abstract": "The assembly methods used for whole-genome shotgun (WGS) data have a major impact on the quality of resulting draft genomes. We present a novel algorithm to generate a set of \"reliable\" overlaps based on identifying repeat k-mers. To demonstrate the benefits of using reliable overlaps, we have created a version of the Phrap assembly program that uses only overlaps from a specific list. We call this version PhrapUMD. Integrating PhrapUMD and our \"reliable-overlap\" algorithm with the Baylor College of Medicine assembler, Atlas, we assemble the BACs from the Rattus norvegicus genome project. Starting with the same data as the Nov. 2002 Atlas assembly, we compare our results and the Atlas assembly to the 4.3 Mb of rat sequence in the 21 BACs that have been finished. Our version of the draft assembly of the 21 BACs increases the coverage of finished sequence from 93.4% to 96.3%, while simultaneously reducing the base error rate from 4.5 to 1.1 errors per 10,000 bases. There are a number of ways of assessing the relative merits of assemblies when the finished sequence is available. If one views the overall quality of an assembly as proportional to the inverse of the product of the error rate and sequence missed, then the assembly presented here is seven times better. The UMD Overlapper with options for reliable overlaps is available from the authors at http://www/genome.umd.edu. We also provide the changes to the Phrap source code enabling it to use only the reliable overlaps. © 2008 Roberts et al.", "citationCount": 3, "authors": [{"name": "Roberts M."}, {"name": "Zimin A.V."}, {"name": "Hayes W."}, {"name": "Hunt B.R."}, {"name": "Ustun C."}, {"name": "White J.R."}, {"name": "Havlak P."}, {"name": "Yorke J."}], "date": "2008-03-19T00:00:00Z", "journal": "PLoS ONE"}}], "homepage_status": 0, "credit": [{"typeRole": ["Primary contact"], "name": null, "url": "http://www.genome.umd.edu/", "gridid": null, "note": null, "orcidid": null, "typeEntity": "Person", "email": null}], "biotoolsCURIE": "biotools:phrapumd", "elixirPlatform": [], "elixirNode": [], "version": ["2"], "elixir_badge": 0, "homepage": "http://www.glue.umd.edu/~ALEKSEYZ/PhrapUMDV2", "function": [{"note": null, "input": [], "operation": [{"term": "Trimming", "uri": "http://edamontology.org/operation_3192"}], "cmd": null, "output": []}], "lastUpdate": "2018-12-10T12:58:59Z", "otherID": [], "description": "It consists of the UMD Trimmer, UMD Overlapper and a modified version of Phrap.It is capable of assembling data downloaded directly from the NCBI Trace Archive. The pipeline runs in 3 stages:  first the vector ends of the reads are examined and the vector is found.  Then the reads are trimmed for vector and quality.  After that the trimmed reads afe fed into the 5-pass UMD Overlapper that finds the overlaps, corrects the base caller errors and performs additional trimming if necessary.", "toolType": ["Command-line tool"], "editPermission": {"type": "private", "authors": []}, "language": [], "link": [{"url": "http://www.mybiosoftware.com/phrapumd-2-modified-version-phrap.html", "note": null, "type": "Software catalogue"}], "biotoolsID": "phrapumd", "additionDate": "2017-12-18T00:10:57Z", "name": "PhrapUMD", "license": null, "documentation": [], "maturity": null, "confidence_flag": null, "operatingSystem": ["Linux"]}