{
    "accessibility": "Open access",
    "additionDate": "2023-03-20T23:20:30.225447Z",
    "biotoolsCURIE": "biotools:lnccat",
    "biotoolsID": "lnccat",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "ys@cczu.edu.cn",
            "name": "Sen Yang",
            "typeEntity": "Person"
        },
        {
            "name": "Hongqi Feng"
        },
        {
            "name": "Shaocong Wang"
        },
        {
            "name": "Xuemei Hu"
        }
    ],
    "description": "An ORF attention model to identify LncRNA based on ensemble learning strategy and fused sequence information.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Coding region prediction",
                    "uri": "http://edamontology.org/operation_0436"
                }
            ]
        }
    ],
    "homepage": "https://github.com/a525076133/LncCat",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T14:52:24.633924Z",
    "license": "Not licensed",
    "name": "LncCat",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1016/j.csbj.2023.02.012",
            "metadata": {
                "abstract": "Background: Long non-coding RNA (lncRNA) is one of the most essential forms of transcripts, playing crucial regulatory roles in the development of cancers and diseases without protein-coding ability. It was assumed that short ORFs (sORFs) in lncRNA were weak to translate proteins. However, recent research has shown that sORFs can encode peptides, which increases the difficulty to identify lncRNA. Therefore, identifying lncRNAs with sORFs facilitates finding novel regulatory factors. Results: In this paper, we propose LncCat for identifying lncRNA based on category boosting (CatBoost) and ORF-attention features. LncCat combines five types of features to encode transcript sequences and employs CatBoost to build a prediction model. In addition, the visualization comparison reveals that the ORF-attention features between lncRNAs and protein-coding transcripts are significantly distinct. The comparison results show that LncCat outperforms competing methods on several benchmark datasets. For Matthew's Correlation Coefficient (MCC), LncCat achieves 0.9503, 0.9219, 0.8591, 0.8672, and 0.9047 on the human, mouse, zebrafish, wheat, and chicken datasets, with improvements ranging from 1.90% to 7.82%, 1.49–17.63%, 6.11–21.50%, 3.02–51.64% and 5.35–26.90%, respectively. Moreover, LncCat dramatically improves the MCC by at least 11.90%, 12.96% and 42.61% on sORF test datasets of human, mouse, and zebrafish, respectively. Conclusions: Experiments indicate that LncCat performs better both on long ORF and sORF datasets, and ORF-attention features show positive effects on predicting lncRNA. In brief, LncCat is a reliable method for identifying lncRNA. Additionally, a user-friendly web server is developed for academics at http://cczubio.top/lnccat.",
                "authors": [
                    {
                        "name": "Feng H."
                    },
                    {
                        "name": "Hu X."
                    },
                    {
                        "name": "Ni X."
                    },
                    {
                        "name": "Sen Yang"
                    },
                    {
                        "name": "Wang S."
                    },
                    {
                        "name": "Wang Y."
                    },
                    {
                        "name": "Yang Z."
                    }
                ],
                "citationCount": 6,
                "date": "2023-01-01T00:00:00Z",
                "journal": "Computational and Structural Biotechnology Journal",
                "title": "LncCat: An ORF attention model to identify LncRNA based on ensemble learning strategy and fused sequence information"
            },
            "pmcid": "PMC9941877",
            "pmid": "36824229"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
