{
    "additionDate": "2018-05-03T17:33:35Z",
    "biotoolsCURIE": "biotools:lassim",
    "biotoolsID": "lassim",
    "credit": [
        {
            "email": "mika.gustafsson@liu.se",
            "name": "Mika Gustafsson",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "A network inference toolbox for genome-wide mechanistic modeling.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://gitlab.com/Gustafsson-lab/lassim"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Network simulation",
                    "uri": "http://edamontology.org/operation_3562"
                }
            ]
        }
    ],
    "homepage": "https://gitlab.com/Gustafsson-lab/lassim",
    "language": [
        "Python"
    ],
    "lastUpdate": "2018-12-10T12:58:57Z",
    "name": "LASSIM",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PCBI.1005608",
            "metadata": {
                "abstract": "© 2017 Magnusson et al.Recent technological advancements have made time-resolved, quantitative, multi-omics data available for many model systems, which could be integrated for systems pharmacokinetic use. Here, we present large-scale simulation modeling (LASSIM), which is a novel mathematical tool for performing large-scale inference using mechanistically defined ordinary differential equations (ODE) for gene regulatory networks (GRNs). LASSIM integrates structural knowledge about regulatory interactions and non-linear equations with multiple steady state and dynamic response expression datasets. The rationale behind LASSIM is that biological GRNs can be simplified using a limited subset of core genes that are assumed to regulate all other gene transcription events in the network. The LASSIM method is implemented as a general-purpose toolbox using the PyGMO Python package to make the most of multicore computers and high performance clusters, and is available at https://gitlab.com/Gustafsson-lab/lassim. As a method, LASSIM works in two steps, where it first infers a non-linear ODE system of the pre-specified core gene expression. Second, LASSIM in parallel optimizes the parameters that model the regulation of peripheral genes by core system genes. We showed the usefulness of this method by applying LASSIM to infer a large-scale non-linear model of naïve Th2 cell differentiation, made possible by integrating Th2 specific bindings, time-series together with six public and six novel siRNA-mediated knock-down experiments. ChIP-seq showed significant overlap for all tested transcription factors. Next, we performed novel time-series measurements of total T-cells during differentiation towards Th2 and verified that our LASSIM model could monitor those data significantly better than comparable models that used the same Th2 bindings. In summary, the LASSIM toolbox opens the door to a new type of model-based data analysis that combines the strengths of reliable mechanistic models with truly systems-level data. We demonstrate the power of this approach by inferring a mechanistically motivated, genome-wide model of the Th2 transcription regulatory system, which plays an important role in several immune related diseases.",
                "authors": [
                    {
                        "name": "Magnusson R."
                    },
                    {
                        "name": "Mariotti G.P."
                    },
                    {
                        "name": "Kopsen M."
                    },
                    {
                        "name": "Lovfors W."
                    },
                    {
                        "name": "Gawel D.R."
                    },
                    {
                        "name": "Jornsten R."
                    },
                    {
                        "name": "Linde J."
                    },
                    {
                        "name": "Nordling T."
                    },
                    {
                        "name": "Nyman E."
                    },
                    {
                        "name": "Schulze S."
                    },
                    {
                        "name": "Nestor C.E."
                    },
                    {
                        "name": "Zhang H."
                    },
                    {
                        "name": "Cedersund G."
                    },
                    {
                        "name": "Benson M."
                    },
                    {
                        "name": "Tjarnberg A."
                    },
                    {
                        "name": "Gustafsson M."
                    }
                ],
                "citationCount": 2,
                "date": "2017-06-01T00:00:00Z",
                "journal": "PLoS Computational Biology",
                "title": "LASSIM—A network inference toolbox for genome-wide mechanistic modeling"
            },
            "pmcid": "PMC5501685",
            "pmid": "28640810"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Pharmacogenomics",
            "uri": "http://edamontology.org/topic_0208"
        },
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        }
    ],
    "validated": 1
}