{
    "accessibility": "Open access",
    "additionDate": "2022-03-28T19:58:55.963299Z",
    "biotoolsCURIE": "biotools:scpm-net",
    "biotoolsID": "scpm-net",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Jieneng Chen"
        },
        {
            "name": "Tao Song"
        },
        {
            "name": "Xiangde Luo"
        },
        {
            "name": "Yechong Huang"
        }
    ],
    "description": "An anchor-free 3D lung nodule detection network using sphere representation and center points matching.",
    "editPermission": {
        "type": "private"
    },
    "homepage": "https://github.com/HiLab-git/SCPM-Net",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-03-28T19:58:55.965837Z",
    "license": "MIT",
    "name": "SCPM-Net",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1016/J.MEDIA.2021.102287",
            "metadata": {
                "abstract": "© 2021Automatic and accurate lung nodule detection from 3D Computed Tomography (CT) scans plays a vital role in efficient lung cancer screening. Despite the state-of-the-art performance obtained by recent anchor-based detectors using Convolutional Neural Networks (CNNs) for this task, they require predetermined anchor parameters such as the size, number, and aspect ratio of anchors, and have limited robustness when dealing with lung nodules with a massive variety of sizes. To overcome these problems, we propose a 3D sphere representation-based center-points matching detection network (SCPM-Net) that is anchor-free and automatically predicts the position, radius, and offset of nodules without manual design of nodule/anchor parameters. The SCPM-Net consists of two novel components: sphere representation and center points matching. First, to match the nodule annotation in clinical practice, we replace the commonly used bounding box with our proposed bounding sphere to represent nodules with the centroid, radius, and local offset in 3D space. A compatible sphere-based intersection over-union loss function is introduced to train the lung nodule detection network stably and efficiently. Second, we empower the network anchor-free by designing a positive center-points selection and matching (CPM) process, which naturally discards pre-determined anchor boxes. An online hard example mining and re-focal loss subsequently enable the CPM process to be more robust, resulting in more accurate point assignment and mitigation of class imbalance. In addition, to better capture spatial information and 3D context for the detection, we propose to fuse multi-level spatial coordinate maps with the feature extractor and combine them with 3D squeeze-and-excitation attention modules. Experimental results on the LUNA16 dataset showed that our proposed SCPM-Net framework achieves superior performance compared with existing anchor-based and anchor-free methods for lung nodule detection with the average sensitivity at 7 predefined FPs/scan of 89.2%. Moreover, our sphere representation is verified to achieve higher detection accuracy than the traditional bounding box representation of lung nodules. Code is available at: https://github.com/HiLab-git/SCPM-Net.",
                "authors": [
                    {
                        "name": "Chen J."
                    },
                    {
                        "name": "Chen Y."
                    },
                    {
                        "name": "Li K."
                    },
                    {
                        "name": "Luo X."
                    },
                    {
                        "name": "Metaxas D.N."
                    },
                    {
                        "name": "Song T."
                    },
                    {
                        "name": "Wang G."
                    },
                    {
                        "name": "Zhang S."
                    }
                ],
                "date": "2022-01-01T00:00:00Z",
                "journal": "Medical Image Analysis",
                "title": "SCPM-Net: An anchor-free 3D lung nodule detection network using sphere representation and center points matching"
            },
            "pmid": "34731775"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Tomography",
            "uri": "http://edamontology.org/topic_3452"
        }
    ]
}
