{
    "additionDate": "2017-08-03T19:00:57Z",
    "biotoolsCURIE": "biotools:switchdna",
    "biotoolsID": "switchdna",
    "credit": [
        {
            "email": "weigman@gmail.com",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "A software to identify regions of Copy Number Aberrations based on intensity data generated from copy number platforms. This method performs identification of transition points followed by significance testing of defined segments.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://genome.unc.edu/pubsup/SWITCHdna/SWITCH_manual.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Copy number estimation",
                    "uri": "http://edamontology.org/operation_3233"
                }
            ]
        }
    ],
    "homepage": "https://genome.unc.edu/pubsup/SWITCHdna/",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-11T19:28:48Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/switchdna-supwald-identification-dna-copy.html"
        }
    ],
    "name": "SWITCHdna",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Breast cancer is a heterogeneous disease with known expression-defined tumor subtypes. DNA copy number studies have suggested that tumors within gene expression subtypes share similar DNA Copy number aberrations (CNA) and that CNA can be used to further subdivide expression classes. To gain further insights into the etiologies of the intrinsic subtypes, we classified tumors according to gene expression subtype and next identified subtype-associated CNA using a novel method called SWITCHdna, using a training set of 180 tumors and a validation set of 359 tumors. Fisher's exact tests, Chi-square approximations, and Wilcoxon rank-sum tests were performed to evaluate differences in CNA by subtype. To assess the functional significance of loss of a specific chromosomal region, individual genes were knocked down by shRNA and drug sensitivity, and DNA repair foci assays performed. Most tumor subtypes exhibited specific CNA. The Basal-like subtype was the most distinct with common losses of the regions containing RB1, BRCA1, INPP4B, and the greatest overall genomic instability. One Basal-like subtype-associated CNA was loss of 5q11-35, which contains at least three genes important for BRCA1-dependent DNA repair (RAD17, RAD50, and RAP80); these genes were predominantly lost as a pair, or all three simultaneously. Loss of two or three of these genes was associated with significantly increased genomic instability and poor patient survival. RNAi knockdown of RAD17, or RAD17/RAD50, in immortalized human mammary epithelial cell lines caused increased sensitivity to a PARP inhibitor and carboplatin, and inhibited BRCA1 foci formation in response to DNA damage. These data suggest a possible genetic cause for genomic instability in Basal-like breast cancers and a biological rationale for the use of DNA repair inhibitor related therapeutics in this breast cancer subtype. © 2012 Springer Science+Business Media, LLC.",
                "authors": [
                    {
                        "name": "Weigman V.J."
                    },
                    {
                        "name": "Chao H.-H."
                    },
                    {
                        "name": "Shabalin A.A."
                    },
                    {
                        "name": "He X."
                    },
                    {
                        "name": "Parker J.S."
                    },
                    {
                        "name": "Nordgard S.H."
                    },
                    {
                        "name": "Grushko T."
                    },
                    {
                        "name": "Huo D."
                    },
                    {
                        "name": "Nwachukwu C."
                    },
                    {
                        "name": "Nobel A."
                    },
                    {
                        "name": "Kristensen V.N."
                    },
                    {
                        "name": "Borresen-Dale A.-L."
                    },
                    {
                        "name": "Olopade O.I."
                    },
                    {
                        "name": "Perou C.M."
                    }
                ],
                "citationCount": 72,
                "date": "2012-06-01T00:00:00Z",
                "journal": "Breast Cancer Research and Treatment",
                "title": "Basal-like Breast cancer DNA copy number losses identify genes involved in genomic instability, response to therapy, and patient survival"
            },
            "pmid": "22048815"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Nucleic acid sites, features and motifs",
            "uri": "http://edamontology.org/topic_3511"
        }
    ],
    "validated": 1
}