{
    "accessibility": "Open access",
    "additionDate": "2023-02-13T17:16:40.012580Z",
    "biotoolsCURIE": "biotools:srgs",
    "biotoolsID": "srgs",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "jtguan@xmu.edu.cn",
            "name": "Jinting Guan",
            "orcidid": "https://orcid.org/0000-0001-9433-5677",
            "typeEntity": "Person"
        },
        {
            "name": "Guoli Ji"
        },
        {
            "name": "Yan Zhuang"
        },
        {
            "name": "Yang Wang"
        },
        {
            "name": "Yongjie Wang"
        }
    ],
    "description": "Sparse partial least squares-based recursive gene selection for gene regulatory network inference.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene regulatory network analysis",
                    "uri": "http://edamontology.org/operation_1781"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                },
                {
                    "term": "Weighted correlation network analysis",
                    "uri": "http://edamontology.org/operation_3766"
                }
            ]
        }
    ],
    "homepage": "https://github.com/JGuan-lab/SRGS",
    "language": [
        "R"
    ],
    "lastUpdate": "2024-11-24T15:02:28.470161Z",
    "license": "Not licensed",
    "name": "SRGS",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1186/s12864-022-09020-7",
            "metadata": {
                "abstract": "Background: The identification of gene regulatory networks (GRNs) facilitates the understanding of the underlying molecular mechanism of various biological processes and complex diseases. With the availability of single-cell RNA sequencing data, it is essential to infer GRNs from single-cell expression. Although some GRN methods originally developed for bulk expression data can be applicable to single-cell data and several single-cell specific GRN algorithms were developed, recent benchmarking studies have emphasized the need of developing more accurate and robust GRN modeling methods that are compatible for single-cell expression data. Results: We present SRGS, SPLS (sparse partial least squares)-based recursive gene selection, to infer GRNs from bulk or single-cell expression data. SRGS recursively selects and scores the genes which may have regulations on the considered target gene based on SPLS. When dealing with gene expression data with dropouts, we randomly scramble samples, set some values in the expression matrix to zeroes, and generate multiple copies of data through multiple iterations to make SRGS more robust. We test SRGS on different kinds of expression data, including simulated bulk data, simulated single-cell data without and with dropouts, and experimental single-cell data, and also compared with the existing GRN methods, including the ones originally developed for bulk data, the ones developed specifically for single-cell data, and even the ones recommended by recent benchmarking studies. Conclusions: It has been shown that SRGS is competitive with the existing GRN methods and effective in the gene regulatory network inference from bulk or single-cell gene expression data. SRGS is available at: https://github.com/JGuan-lab/SRGS.",
                "authors": [
                    {
                        "name": "Guan J."
                    },
                    {
                        "name": "Ji G."
                    },
                    {
                        "name": "Wang Y."
                    },
                    {
                        "name": "Wang Y."
                    },
                    {
                        "name": "Zhuang Y."
                    }
                ],
                "date": "2022-12-01T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "SRGS: sparse partial least squares-based recursive gene selection for gene regulatory network inference"
            },
            "pmcid": "PMC9710113",
            "pmid": "36451086"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Exome sequencing",
            "uri": "http://edamontology.org/topic_3676"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ]
}
