{
    "additionDate": "2020-01-09T17:36:59Z",
    "biotoolsCURIE": "biotools:MHCquant",
    "biotoolsID": "MHCquant",
    "confidence_flag": "tool",
    "description": "Automated and Reproducible Data Analysis for Immunopeptidomics.\n\nMHCquant: Identify and quantify peptides from mass spectrometry raw data.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Label-free quantification",
                    "uri": "http://edamontology.org/operation_3634"
                },
                {
                    "term": "Tag-based peptide identification",
                    "uri": "http://edamontology.org/operation_3643"
                },
                {
                    "term": "Target-Decoy",
                    "uri": "http://edamontology.org/operation_3649"
                }
            ]
        }
    ],
    "homepage": "https://www.openms.de/mhcquant/",
    "lastUpdate": "2020-12-28T10:16:28Z",
    "name": "MHCquant",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1021/ACS.JPROTEOME.9B00313",
            "metadata": {
                "abstract": "© 2019 American Chemical Society.Personalized multipeptide vaccines are currently being discussed intensively for tumor immunotherapy. In order to identify epitopes - short, immunogenic peptides - suitable for eliciting a tumor-specific immune response, human leukocyte antigen-presented peptides are isolated by immunoaffinity purification from cancer tissue samples and analyzed by liquid chromatography-coupled tandem mass spectrometry (LC-MS/MS). Here, we present MHCquant, a fully automated, portable computational pipeline able to process LC-MS/MS data automatically and generate annotated, false discovery rate-controlled lists of (neo-)epitopes with associated relative quantification information. We could show that MHCquant achieves higher sensitivity than established methods. While obtaining the highest number of unique peptides, the rate of predicted MHC binders remains still comparable to other tools. Reprocessing of the data from a previously published study resulted in the identification of several neoepitopes not detected by previously applied methods. MHCquant integrates tailor-made pipeline components with existing open-source software into a coherent processing workflow. Container-based virtualization permits execution of this workflow without complex software installation, execution on cluster/cloud infrastructures, and full reproducibility of the results. Integration with the data analysis workbench KNIME enables easy mining of large-scale immunopeptidomics data sets. MHCquant is available as open-source software along with accompanying documentation on our website at https://www.openms.de/mhcquant/.",
                "authors": [
                    {
                        "name": "Bichmann L."
                    },
                    {
                        "name": "Nelde A."
                    },
                    {
                        "name": "Ghosh M."
                    },
                    {
                        "name": "Heumos L."
                    },
                    {
                        "name": "Mohr C."
                    },
                    {
                        "name": "Peltzer A."
                    },
                    {
                        "name": "Kuchenbecker L."
                    },
                    {
                        "name": "Sachsenberg T."
                    },
                    {
                        "name": "Walz J.S."
                    },
                    {
                        "name": "Stevanovic S."
                    },
                    {
                        "name": "Rammensee H.-G."
                    },
                    {
                        "name": "Kohlbacher O."
                    }
                ],
                "citationCount": 7,
                "date": "2019-11-01T00:00:00Z",
                "journal": "Journal of Proteome Research",
                "title": "MHCquant: Automated and Reproducible Data Analysis for Immunopeptidomics"
            },
            "pmid": "31589052"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Immunoproteins and antigens",
            "uri": "http://edamontology.org/topic_2830"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ],
    "validated": 1
}