{
    "additionDate": "2018-10-02T12:17:46Z",
    "biotoolsCURIE": "biotools:fanten",
    "biotoolsID": "fanten",
    "cost": "Free of charge",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://about.west-life.eu/network/west-life/documentation/wenmr/fanten"
        }
    ],
    "description": "FANTEN (Finding Anisotropy TENsor) is a new user-friendly web tool for the determination of the anisotropy tensors related to PCSs (pseudo-contact shifts) and RDCs (residual dipolar couplings).",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein modelling",
                    "uri": "http://edamontology.org/operation_0477"
                }
            ]
        }
    ],
    "homepage": "http://fanten-enmr.cerm.unifi.it:8080/",
    "lastUpdate": "2024-11-25T14:27:17.643067Z",
    "maturity": "Mature",
    "name": "FANTEN",
    "owner": "Instruct",
    "publication": [
        {
            "doi": "10.1007/s10858-014-9877-4",
            "metadata": {
                "abstract": "Pseudocontact shifts (PCSs) and residual dipolar couplings (RDCs) arising from the presence of paramagnetic metal ions in proteins as well as RDCs due to partial orientation induced by external orienting media are nowadays routinely measured as a part of the NMR characterization of biologically relevant systems. PCSs and RDCs are becoming more and more popular as restraints (1) to determine and/or refine protein structures in solution, (2) to monitor the extent of conformational heterogeneity in systems composed of rigid domains which can reorient with respect to one another, and (3) to obtain structural information in protein-protein complexes. The use of both PCSs and RDCs proceeds through the determination of the anisotropy tensors which are at the origin of these NMR observables. A new user-friendly web tool, called FANTEN (Finding ANisotropy TENsors), has been developed for the determination of the anisotropy tensors related to PCSs and RDCs and has been made freely available through the WeNMR (http://fanten-enmr.cerm.unifi.it:8080) gateway. The program has many new features not available in other existing programs, among which the possibility of a joint analysis of several sets of PCS and RDC data and the possibility to perform rigid body minimizations.",
                "authors": [
                    {
                        "name": "Carlon A."
                    },
                    {
                        "name": "Luchinat C."
                    },
                    {
                        "name": "Parigi G."
                    },
                    {
                        "name": "Ravera E."
                    },
                    {
                        "name": "Rinaldelli M."
                    }
                ],
                "citationCount": 40,
                "date": "2015-01-01T00:00:00Z",
                "journal": "Journal of Biomolecular NMR",
                "title": "FANTEN: A new web-based interface for the analysis of magnetic anisotropy-induced NMR data"
            },
            "pmid": "25416616"
        }
    ],
    "toolType": [
        "Web service"
    ],
    "topic": [
        {
            "term": "NMR",
            "uri": "http://edamontology.org/topic_0593"
        }
    ],
    "validated": 1
}
