{
    "additionDate": "2022-08-19T19:03:04.834694Z",
    "biotoolsCURIE": "biotools:demo2",
    "biotoolsID": "demo2",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "zhng@umich.edu",
            "name": "Guijun Zhang",
            "orcidid": "https://orcid.org/0000-0002-7815-5884",
            "typeEntity": "Person"
        },
        {
            "name": "Yang Zhang",
            "orcidid": "https://orcid.org/0000-0002-2739-1916",
            "typeEntity": "Person"
        }
    ],
    "description": "DEMO (Domain Enhanced MOdeling, version 2) is an significantly improved version for automated assembly of full-length structural models of multi-domain proteins by integrating analogous template alignments with deep-learning predicted inter-domain spatial restraints.",
    "documentation": [
        {
            "type": [
                "Training material"
            ],
            "url": "https://zhanggroup.org/DEMO/example/"
        }
    ],
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Fold recognition",
                    "uri": "http://edamontology.org/operation_0303"
                },
                {
                    "term": "Protein structure prediction",
                    "uri": "http://edamontology.org/operation_0474"
                },
                {
                    "term": "Structure alignment",
                    "uri": "http://edamontology.org/operation_0295"
                }
            ]
        }
    ],
    "homepage": "https://zhanggroup.org/DEMO/",
    "lastUpdate": "2022-08-19T19:03:04.837240Z",
    "license": "Not licensed",
    "name": "DEMO2",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1093/NAR/GKAC340",
            "metadata": {
                "abstract": "© 2022 The Author(s). Published by Oxford University Press on behalf of Nucleic Acids Research.Most proteins in nature contain multiple folding units (or domains). The revolutionary success of AlphaFold2 in single-domain structure prediction showed potential to extend deep-learning techniques for multi-domain structure modeling. This work presents a significantly improved method, DEMO2, which integrates analogous template structural alignments with deep-learning techniques for high-accuracy domain structure assembly. Starting from individual domain models, inter-domain spatial restraints are first predicted with deep residual convolutional networks, where full-length structure models are assembled using L-BFGS simulations under the guidance of a hybrid energy function combining deep-learning restraints and analogous multi-domain template alignments searched from the PDB. The output of DEMO2 contains deep-learning inter-domain restraints, top-ranked multi-domain structure templates, and up to five full-length structure models. DEMO2 was tested on a large-scale benchmark and the blind CASP14 experiment, where DEMO2 was shown to significantly outperform its predecessor and the state-of-the-art protein structure prediction methods. By integrating with new deep-learning techniques, DEMO2 should help fill the rapidly increasing gap between the improved ability of tertiary structure determination and the high demand for the high-quality multi-domain protein structures. The DEMO2 server is available at https://zhanggroup.org/DEMO/.",
                "authors": [
                    {
                        "name": "Li Y."
                    },
                    {
                        "name": "Peng C."
                    },
                    {
                        "name": "Zhang G."
                    },
                    {
                        "name": "Zhang Y."
                    },
                    {
                        "name": "Zheng W."
                    },
                    {
                        "name": "Zhou X."
                    }
                ],
                "date": "2022-07-05T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "DEMO2: Assemble multi-domain protein structures by coupling analogous template alignments with deep-learning inter-domain restraint prediction"
            },
            "pmcid": "PMC9252800",
            "pmid": "35536281"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Protein folds and structural domains",
            "uri": "http://edamontology.org/topic_0736"
        },
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        },
        {
            "term": "Structure prediction",
            "uri": "http://edamontology.org/topic_0082"
        }
    ]
}
