{
    "additionDate": "2021-01-18T09:52:56Z",
    "biotoolsCURIE": "biotools:codonadjust",
    "biotoolsID": "codonadjust",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "kameda-tomoshi@aist.go.jp",
            "name": "Tomoshi Kameda",
            "typeEntity": "Person"
        }
    ],
    "description": "CodonAdjust is a free software to optimize a codon nucleotide composition mimicking a certain amino acids profile (AA profile). CodonAdjust formulates the optimization of a codon nucleotide composition as a non-convex optimization problem which minimizes the squared error between the desired and the calculated AA profiles. We provide CodonAdjust with four different options, which have various customization in practical scenarios such as selecting or avoiding specific codons.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Codon usage bias calculation",
                    "uri": "http://edamontology.org/operation_2962"
                },
                {
                    "term": "Codon usage table generation",
                    "uri": "http://edamontology.org/operation_0284"
                },
                {
                    "term": "Editing",
                    "uri": "http://edamontology.org/operation_3096"
                }
            ]
        }
    ],
    "homepage": "https://github.com/tiffany-nguyen/CodonAdjust",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-02-14T16:30:05Z",
    "license": "GPL-3.0",
    "name": "CodonAdjust",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/PROTEIN/GZAA013",
            "metadata": {
                "abstract": "© The Author(s) 2020. Published by Oxford University Press. All rights reserved. For Permissions, please e-mail: journals.permissions@oup.com.In protein engineering, generation of mutagenesis libraries is a key step to study the functions of mutants. To generate mutants with a desired composition of amino acids (AAs), a codon consisting of a mixture of nucleotides is widely applied. Several computational methods have been proposed to calculate a codon nucleotide composition for generating a given amino acid profile based on mathematical optimization. However, these previous methods need to manually tune weights of amino acids in objective functions, which are time-consuming and, more importantly, lack publicly available software implementations. Here, we develop CodonAdjust, a software to adjust a codon nucleotide composition for mimicking a given amino acid profile. We propose different options of CodonAdjust, which provide various customizations in practical scenarios such as setting a guaranteeing threshold for the frequencies of amino acids without any manual tasks. We demonstrate the capability of CodonAdjust in the experiments on the complementarity-determining regions (CDRs) of antibodies and T-cell receptors (TCRs) as well as millions of amino acid profiles from Pfam. These results suggest that CodonAdjust is a productive software for codon design and may accelerate library generation. CodonAdjust is freely available at https://github.com/tiffany-nguyen/CodonAdjust. Paper edited by Dr. Jeffery Saven, Board Member for PEDS.",
                "authors": [
                    {
                        "name": "Kameda T."
                    },
                    {
                        "name": "Nguyen T.D."
                    },
                    {
                        "name": "Saito Y."
                    }
                ],
                "date": "2019-12-31T00:00:00Z",
                "journal": "Protein engineering, design & selection : PEDS",
                "title": "CodonAdjust: a software for in silico design of a mutagenesis library with specific amino acid profiles"
            },
            "pmid": "32705123"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Immunoproteins and antigens",
            "uri": "http://edamontology.org/topic_2830"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
