{
    "additionDate": "2020-01-09T17:38:45Z",
    "biotoolsCURIE": "biotools:Cassiopeia",
    "biotoolsID": "Cassiopeia",
    "confidence_flag": "tool",
    "description": "Inference of Single-Cell Phylogenies from Lineage Tracing Data.\n\nA Package for Cas9-Enabled Single Cell Lineage Tracing Tree Reconstruction.\n\nThis is a software suite for proecessing data from single cell lineage tracing experiments. This suite comes equipped with three main modules:.\n\nPhylogeny Reconstruction: a collection of tools for constructing phylogenies. We support 5 algorithms currently: a greedy algorithm based on multi-state compatibility, an exact Steiner-Tree solver, Cassiopeia (the combination of these two), Neighbor-Joining, and Camin-Sokal Maximum Parsimony.\n\nTarget Site Sequencing Pipeline: a pipeline for extracing lineage information from raw fastqs produced from a lineage tracing experiment",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Ancestral reconstruction",
                    "uri": "http://edamontology.org/operation_3745"
                },
                {
                    "term": "Phylogenetic tree editing",
                    "uri": "http://edamontology.org/operation_0326"
                },
                {
                    "term": "Phylogenetic tree reconstruction",
                    "uri": "http://edamontology.org/operation_3478"
                }
            ]
        }
    ],
    "homepage": "http://www.github.com/YosefLab/Cassiopeia",
    "language": [
        "Perl",
        "Python"
    ],
    "lastUpdate": "2020-12-10T13:37:20Z",
    "license": "MIT",
    "name": "Cassiopeia",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1101/800078"
        },
        {
            "doi": "10.1186/s13059-020-02000-8",
            "metadata": {
                "abstract": "© 2020 The Author(s).The pairing of CRISPR/Cas9-based gene editing with massively parallel single-cell readouts now enables large-scale lineage tracing. However, the rapid growth in complexity of data from these assays has outpaced our ability to accurately infer phylogenetic relationships. First, we introduce Cassiopeia-a suite of scalable maximum parsimony approaches for tree reconstruction. Second, we provide a simulation framework for evaluating algorithms and exploring lineage tracer design principles. Finally, we generate the most complex experimental lineage tracing dataset to date, 34,557 human cells continuously traced over 15 generations, and use it for benchmarking phylogenetic inference approaches. We show that Cassiopeia outperforms traditional methods by several metrics and under a wide variety of parameter regimes, and provide insight into the principles for the design of improved Cas9-enabled recorders. Together, these should broadly enable large-scale mammalian lineage tracing efforts. Cassiopeia and its benchmarking resources are publicly available at www.github.com/YosefLab/Cassiopeia.",
                "authors": [
                    {
                        "name": "Chan M.M."
                    },
                    {
                        "name": "Hussmann J.A."
                    },
                    {
                        "name": "Jones M.G."
                    },
                    {
                        "name": "Khodaverdian A."
                    },
                    {
                        "name": "Quinn J.J."
                    },
                    {
                        "name": "Wang R."
                    },
                    {
                        "name": "Weissman J.S."
                    },
                    {
                        "name": "Xu C."
                    },
                    {
                        "name": "Yosef N."
                    }
                ],
                "citationCount": 9,
                "date": "2020-04-14T00:00:00Z",
                "journal": "Genome Biology",
                "title": "Inference of single-cell phylogenies from lineage tracing data using Cassiopeia"
            },
            "pmcid": "PMC7155257",
            "pmid": "32290857"
        }
    ],
    "topic": [
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Phylogeny",
            "uri": "http://edamontology.org/topic_0084"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ],
    "validated": 1
}
