{
    "additionDate": "2017-02-10T14:15:23Z",
    "biotoolsCURIE": "biotools:tact",
    "biotoolsID": "tact",
    "description": "Automated tool for conducting functional annotation of transcripts that integrates sequence similarity searches and functional motif predictions. It was originally developed as an automatic annotation pipeline for the Human Full-length cDNA Annotation Invitational (H-Inv) project.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene prediction",
                    "uri": "http://edamontology.org/operation_2454"
                },
                {
                    "term": "Protein fold recognition",
                    "uri": "http://edamontology.org/operation_0303"
                },
                {
                    "term": "Protein modelling (mutation)",
                    "uri": "http://edamontology.org/operation_0331"
                },
                {
                    "term": "Sequence motif analysis",
                    "uri": "http://edamontology.org/operation_2404"
                },
                {
                    "term": "Sequence similarity search",
                    "uri": "http://edamontology.org/operation_0346"
                }
            ]
        }
    ],
    "homepage": "http://jbirc.jbic.or.jp/tact/",
    "homepage_status": 1,
    "lastUpdate": "2018-12-10T12:58:40Z",
    "name": "TACT",
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "H-Invitational Database (H-InvDB; http://www.h-invitational.jp/) is a human transcriptome database, containing integrative annotation of 41,118 full-length cDNA clones originated from 21,037 loci. H-InvDB is a product of the H-Invitational project, an international collaboration to systematically and functionally validate human genes by analysis of a unique set of high quality full-length cDNA clones using automatic annotation and human curation under unified criteria. Here, 19,574 proteins encoded by these cDNAs were classified into 11,709 function-known and 7865 function-unknown hypothetical proteins by similarity with protein databases and motif prediction (InterProScan). The proportion of \"hypothetical proteins\" in H-InvDB was as high as 40.4%. In this study, we thus conducted data-mining in H-InvDB with the aim of assigning advanced functional annotations to those hypothetical proteins. First, by data-mining in the H-InvDB version of GTOP, we identified 337 SCOP domains within 7865 H-Inv hypothetical proteins. Second, by data-mining of predicted subcellular localization by SOSUI and TMHMM in H-InvDB, we found 1032 transmembrane proteins within H-Inv hypothetical proteins. These results clearly demonstrate that structural prediction is effective for functional annotation of proteins with unknown functions. All the data in H-InvDB are shown in two main views, the cDNA view and the Locus view, and five auxiliary databases with web-based viewers; DiseaseInfo Viewer, H-ANGEL, Clustering Viewer, G-integra and TOPO Viewer; the data also are provided as flat files and XML files. The data consists of descriptions of their gene structures, novel alternative splicing isoforms, functional RNAs, functional domains, subcellular localizations, metabolic pathways, predictions of protein 3D structure, mapping of SNPs and microsatellite repeat motifs in relation with orphan diseases, gene expression profiling, and comparisons with mouse full-length cDNAs in the context of molecular evolution. This unique integrative platform for conducting in silico data-mining represents a substantial contribution to resources required for the exploration of human biology and pathology. © 2005 Elsevier B.V. All rights reserved.",
                "authors": [
                    {
                        "name": "Barrero R."
                    },
                    {
                        "name": "Fujii Y."
                    },
                    {
                        "name": "Fukuchi S."
                    },
                    {
                        "name": "Gojobori T."
                    },
                    {
                        "name": "Imanishi T."
                    },
                    {
                        "name": "Itoh T."
                    },
                    {
                        "name": "Koyanagi K.O."
                    },
                    {
                        "name": "Miyazaki S."
                    },
                    {
                        "name": "Nomura N."
                    },
                    {
                        "name": "Sugano S."
                    },
                    {
                        "name": "Takeda J.-I."
                    },
                    {
                        "name": "Tamura T."
                    },
                    {
                        "name": "Tanino M."
                    },
                    {
                        "name": "Yamaguchi-Kabata Y."
                    },
                    {
                        "name": "Yamasaki C."
                    }
                ],
                "citationCount": 15,
                "date": "2005-12-30T00:00:00Z",
                "journal": "Gene",
                "title": "Investigation of protein functions through data-mining on integrated human transcriptome database, H-Invitational database (H-InvDB)"
            },
            "pmid": "16185827"
        },
        {
            "metadata": {
                "abstract": "The human genome sequence defines our inherent biological potential; the realization of the biology encoded therein requires knowledge of the function of each gene. Currently, our knowledge in this area is still limited. Several lines of investigation have been used to elucidate the structure and function of the genes in the human genome. Even so, gene prediction remains a difficult task, as the varieties of transcripts of a gene may vary to a great extent. We thus performed an exhaustive integrative characterization of 41,118 full-length cDNAs that capture the gene transcripts as complete functional cassettes, providing an unequivocal report of structural and functional diversity at the gene level. Our international collaboration has validated 21,037 human gene candidates by analysis of high-quality full-length cDNA clones through curation using unified criteria. This led to the identification of 5,155 new gene candidates. It also manifested the most reliable way to control the quality of the cDNA clones. We have developed a human gene database, called the H-Invitational Database (H-InvDB; http://www.h-invitational.jp/). It provides the following: integrative annotation of human genes, description of gene structures, details of novel alternative splicing isoforms, non-protein-coding RNAs, functional domains, subcellular localizations, metabolic pathways, predictions of protein three-dimensional structure, mapping of known single nucleotide polymorphisms (SNPs), identification of polymorphic microsatellite repeats within human genes, and comparative results with mouse full-length cDNAs. The H-InvDB analysis has shown that up to 4% of the human genome sequence (National Center for Biotechnology Information build 34 assembly) may contain misassembled or missing regions. We found that 6.5% of the human gene candidates (1,377 loci) did not have a good protein-coding open reading frame, of which 296 loci are strong candidates for non-protein-coding RNA genes. In addition, among 72,027 uniquely mapped SNPs and insertions/deletions localized within human genes, 13,215 nonsynonymous SNPs, 315 nonsense SNPs, and 452 indels occurred in coding regions. Together with 25 polymorphic microsatellite repeats present in coding regions, they may alter protein structure, causing phenotypic effects or resulting in disease. The H-InvDB platform represents a substantial contribution to resources needed for the exploration of human biology and pathology.",
                "authors": [
                    {
                        "name": "Amid C."
                    },
                    {
                        "name": "Apweiler R."
                    },
                    {
                        "name": "Ashurst J."
                    },
                    {
                        "name": "Auffray C."
                    },
                    {
                        "name": "Barrero R.A."
                    },
                    {
                        "name": "Bellgard M."
                    },
                    {
                        "name": "Bono H."
                    },
                    {
                        "name": "Bromberg S.K."
                    },
                    {
                        "name": "Brookes A.J."
                    },
                    {
                        "name": "Bruford E."
                    },
                    {
                        "name": "Carninci P."
                    },
                    {
                        "name": "Chakraborty R."
                    },
                    {
                        "name": "Chelala C."
                    },
                    {
                        "name": "Chen Z."
                    },
                    {
                        "name": "Couillault C."
                    },
                    {
                        "name": "Debily M.-A."
                    },
                    {
                        "name": "Devignes M.-D."
                    },
                    {
                        "name": "Dubchak I."
                    },
                    {
                        "name": "Endo T."
                    },
                    {
                        "name": "Estreicher A."
                    },
                    {
                        "name": "Eveno E."
                    },
                    {
                        "name": "Eyras E."
                    },
                    {
                        "name": "Fujii Y."
                    },
                    {
                        "name": "Fukami-Kobayashi K."
                    },
                    {
                        "name": "Fukuchi S."
                    },
                    {
                        "name": "Go M."
                    },
                    {
                        "name": "Gojobori T."
                    },
                    {
                        "name": "Gopinath G.R."
                    },
                    {
                        "name": "Gough C."
                    },
                    {
                        "name": "Graudens E."
                    },
                    {
                        "name": "Hahn Y."
                    },
                    {
                        "name": "Han M."
                    },
                    {
                        "name": "Han Z.-G."
                    },
                    {
                        "name": "Hanada K."
                    },
                    {
                        "name": "Hanaoka H."
                    },
                    {
                        "name": "Harada E."
                    },
                    {
                        "name": "Hashimoto K."
                    },
                    {
                        "name": "Hayashizaki Y."
                    },
                    {
                        "name": "Hide W."
                    },
                    {
                        "name": "Hilton P."
                    },
                    {
                        "name": "Hinz U."
                    },
                    {
                        "name": "Hirai M."
                    },
                    {
                        "name": "Hirakawa M."
                    },
                    {
                        "name": "Hishiki T."
                    },
                    {
                        "name": "Homma K."
                    },
                    {
                        "name": "Hopkinson I."
                    },
                    {
                        "name": "Hyang-Yoo S."
                    },
                    {
                        "name": "Ikeo K."
                    },
                    {
                        "name": "Imanishi T."
                    },
                    {
                        "name": "Imbeaud S."
                    },
                    {
                        "name": "Inoko H."
                    },
                    {
                        "name": "Isogai T."
                    },
                    {
                        "name": "Itoh T."
                    },
                    {
                        "name": "Jia L."
                    },
                    {
                        "name": "Jin L."
                    },
                    {
                        "name": "Kanapin A."
                    },
                    {
                        "name": "Kanehisa M."
                    },
                    {
                        "name": "Kaneko Y."
                    },
                    {
                        "name": "Karavidopoulou Y."
                    },
                    {
                        "name": "Kasprzyk A."
                    },
                    {
                        "name": "Kasukawa T."
                    },
                    {
                        "name": "Kelso J."
                    },
                    {
                        "name": "Kersey P."
                    },
                    {
                        "name": "Kikuno R."
                    },
                    {
                        "name": "Kim S."
                    },
                    {
                        "name": "Kimura K."
                    },
                    {
                        "name": "Korn B."
                    },
                    {
                        "name": "Koyanagi K.O."
                    },
                    {
                        "name": "Kuryshev V."
                    },
                    {
                        "name": "Lenhard B."
                    },
                    {
                        "name": "Makalowska I."
                    },
                    {
                        "name": "Makalowski W."
                    },
                    {
                        "name": "Makino T."
                    },
                    {
                        "name": "Mano S."
                    },
                    {
                        "name": "Mariage-Samson R."
                    },
                    {
                        "name": "Mashima J."
                    },
                    {
                        "name": "Matsuda H."
                    },
                    {
                        "name": "Mewes H.-W."
                    },
                    {
                        "name": "Minoshima S."
                    },
                    {
                        "name": "Miyazaki S."
                    },
                    {
                        "name": "Mulder N."
                    },
                    {
                        "name": "Nagai K."
                    },
                    {
                        "name": "Nagasaki H."
                    },
                    {
                        "name": "Nagata N."
                    },
                    {
                        "name": "Nakai K."
                    },
                    {
                        "name": "Nakao M."
                    },
                    {
                        "name": "Nigam R."
                    },
                    {
                        "name": "Nishikawa K."
                    },
                    {
                        "name": "Nishikawa T."
                    },
                    {
                        "name": "Nomura N."
                    },
                    {
                        "name": "O'Donovan C."
                    },
                    {
                        "name": "Ogasawara O."
                    },
                    {
                        "name": "Ohara O."
                    },
                    {
                        "name": "Ohtsubo M."
                    },
                    {
                        "name": "Oishi M."
                    },
                    {
                        "name": "Okada N."
                    },
                    {
                        "name": "Okazaki Y."
                    },
                    {
                        "name": "Okido T."
                    },
                    {
                        "name": "Okubo K."
                    },
                    {
                        "name": "Oota S."
                    },
                    {
                        "name": "Ota M."
                    },
                    {
                        "name": "Ota T."
                    },
                    {
                        "name": "Otsuki T."
                    },
                    {
                        "name": "Piatier-Tonneau D."
                    },
                    {
                        "name": "Poustka A."
                    },
                    {
                        "name": "Quackenbush J."
                    },
                    {
                        "name": "Ren S.-X."
                    },
                    {
                        "name": "Saitou N."
                    },
                    {
                        "name": "Sakai H."
                    },
                    {
                        "name": "Sakai K."
                    },
                    {
                        "name": "Sakaki Y."
                    },
                    {
                        "name": "Sakamoto S."
                    },
                    {
                        "name": "Sakate R."
                    },
                    {
                        "name": "Schupp I."
                    },
                    {
                        "name": "Servant F."
                    },
                    {
                        "name": "Sherry S."
                    },
                    {
                        "name": "Shiba R."
                    },
                    {
                        "name": "Shimizu N."
                    },
                    {
                        "name": "Shimoyama M."
                    },
                    {
                        "name": "Simpson A.J."
                    },
                    {
                        "name": "Soares B."
                    },
                    {
                        "name": "Steward C."
                    },
                    {
                        "name": "Stodolsky M."
                    },
                    {
                        "name": "Strausberg R.L."
                    },
                    {
                        "name": "Sugano S."
                    },
                    {
                        "name": "Sugawara H."
                    },
                    {
                        "name": "Suwa M."
                    },
                    {
                        "name": "Suzuki M."
                    },
                    {
                        "name": "Suzuki Y."
                    },
                    {
                        "name": "Suzuki Y."
                    },
                    {
                        "name": "Takagi T."
                    },
                    {
                        "name": "Takahashi A."
                    },
                    {
                        "name": "Takeda J.-I."
                    },
                    {
                        "name": "Tamiya G."
                    },
                    {
                        "name": "Tamura T."
                    },
                    {
                        "name": "Tanaka H."
                    },
                    {
                        "name": "Tanaka S."
                    },
                    {
                        "name": "Tanino M."
                    },
                    {
                        "name": "Tateno Y."
                    },
                    {
                        "name": "Taylor T."
                    },
                    {
                        "name": "Terwilliger J.D."
                    },
                    {
                        "name": "Thierry-Mieg D."
                    },
                    {
                        "name": "Thierry-Mieg J."
                    },
                    {
                        "name": "Thomas M.A."
                    },
                    {
                        "name": "Tonellato P."
                    },
                    {
                        "name": "Unneberg P."
                    },
                    {
                        "name": "Veeramachaneni V."
                    },
                    {
                        "name": "Wagner L."
                    },
                    {
                        "name": "Watanabe S."
                    },
                    {
                        "name": "Wiemann S."
                    },
                    {
                        "name": "Wilming L."
                    },
                    {
                        "name": "Yamaguchi-Kabata Y."
                    },
                    {
                        "name": "Yamasaki C."
                    },
                    {
                        "name": "Yasuda N."
                    },
                    {
                        "name": "Yasuda T."
                    },
                    {
                        "name": "Yura K."
                    },
                    {
                        "name": "de Fatima Bonaldo M."
                    },
                    {
                        "name": "de Souza S.J."
                    }
                ],
                "citationCount": 264,
                "date": "2004-01-01T00:00:00Z",
                "journal": "PLoS Biology",
                "title": "Integrative annotation of 21,037 human genes validated by full-length cDNA clones"
            },
            "pmid": "15103394"
        },
        {
            "metadata": {
                "abstract": "Transcriptome Auto-annotation Conducting Tool (TACT) is a newly developed web-based automated tool for conducting functional annotation of transcripts by the integration of sequence similarity searches and functional motif predictions. We developed the TACT system by integrating two kinds of similarity searches, FASTY and BLASTX, against protein sequence databases, UniProtKB (Swiss-Prot/TrEMBL) and RefSeq, and a unified motif prediction program, InterProScan, into the ORF-prediction pipeline originally designed for the 'H-Invitational' human transcriptome annotation project. This system successively applies these constituent programs to an mRNA sequence in order to predict the most plausible ORF and the function of the protein encoded. In this study, we applied the TACT system to 19 574 non-redundant human transcripts registered in H-InvDB and evaluated its predictive power by the degree of agreement with human-curated functional annotation in H-InvDB. As a result, the TACT system could assign functional description to 12 559 transcripts (64.2%), the remainder being hypothetical proteins. Furthermore, the overall agreement of functional annotation with H-InvDB, including those transcripts annotated as hypothetical proteins, was 83.9% (16 432/19 574). These results show that the TACT system is useful for functional annotation and that the prediction of ORFs and protein functions is highly accurate and close to the results of human curation. TACT is freely available at http://www.jbirc.aist.go.jp/tact/. © The Author 2006. Published by Oxford University Press. All rights reserved.",
                "authors": [
                    {
                        "name": "Gojobori T."
                    },
                    {
                        "name": "Imamizu Y."
                    },
                    {
                        "name": "Imanishi T."
                    },
                    {
                        "name": "Itoh T."
                    },
                    {
                        "name": "Kawashima H."
                    },
                    {
                        "name": "Ogawa M."
                    },
                    {
                        "name": "Tanino M."
                    },
                    {
                        "name": "Todokoro F."
                    },
                    {
                        "name": "Yamasaki C."
                    }
                ],
                "citationCount": 5,
                "date": "2006-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "TACT: Transcriptome Auto-annotation Conducting Tool of H-InvDB"
            },
            "pmid": "16845023"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Humans",
            "uri": "http://edamontology.org/topic_2815"
        }
    ],
    "validated": 1
}
