{
    "name": "PolyMarker", 
    "description": "An automated bioinformatics pipeline for SNP assay development which increases the probability of generating homoeologue-specific assays for polyploid wheat. PolyMarker generates a multiple alignment between the target SNP sequence and the IWGSC chromosome survey sequences (IWGSC, 2014 ) for each of the three wheat genomes. It then generates a mask with informative positions which are highlighted with respect to the target genome.", 
    "homepage": "http://polymarker.tgac.ac.uk/", 
    "biotoolsID": "polymarker", 
    "biotoolsCURIE": "biotools:polymarker", 
    "version": [], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_2419", 
                    "term": "Primer and probe design"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Command-line tool", 
        "Web service"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_2885", 
            "term": "DNA polymorphism"
        }, 
        {
            "uri": "http://edamontology.org/topic_0632", 
            "term": "Probes and primers"
        }
    ], 
    "operatingSystem": [
        "Linux", 
        "Windows", 
        "Mac"
    ], 
    "language": [
        "Ruby"
    ], 
    "license": "Unlicensed", 
    "collectionID": [
        "Animal and Crop Genomics"
    ], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [
        {
            "url": "https://github.com/homonecloco/bioruby-polyploid-tools", 
            "type": "Repository", 
            "note": null
        }, 
        {
            "url": "https://github.com/homonecloco/bioruby-polyploid-tools/issues", 
            "type": "Issue tracker", 
            "note": null
        }
    ], 
    "download": [], 
    "documentation": [
        {
            "url": "http://polymarker.tgac.ac.uk/Markdown?md=About", 
            "type": "General", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": "10.1111/pbi.12281", 
            "pmid": null, 
            "pmcid": null, 
            "type": "Primary", 
            "version": null, 
            "metadata": {
                "title": "RNA-Seq bulked segregant analysis enables the identification of high-resolution genetic markers for breeding in hexaploid wheat", 
                "abstract": "© 2015 Society for Experimental Biology, Association of Applied Biologists and John Wiley & Sons Ltd.The identification of genetic markers linked to genes of agronomic importance is a major aim of crop research and breeding programmes. Here, we identify markers for Yr15, a major disease resistance gene for wheat yellow rust, using a segregating F<inf>2</inf> population. After phenotyping, we implemented RNA sequencing (RNA-Seq) of bulked pools to identify single-nucleotide polymorphisms (SNP) associated with Yr15. Over 27 000 genes with SNPs were identified between the parents, and then classified based on the results from the sequenced bulks. We calculated the bulk frequency ratio (BFR) of SNPs between resistant and susceptible bulks, selecting those showing sixfold enrichment/depletion in the corresponding bulks (BFR > 6). Using additional filtering criteria, we reduced the number of genes with a putative SNP to 175. The 35 SNPs with the highest BFR values were converted into genome-specific KASP assays using an automated bioinformatics pipeline (PolyMarker) which circumvents the limitations associated with the polyploid wheat genome. Twenty-eight assays were polymorphic of which 22 (63%) mapped in the same linkage group as Yr15. Using these markers, we mapped Yr15 to a 0.77-cM interval. The three most closely linked SNPs were tested across varieties and breeding lines representing UK elite germplasm. Two flanking markers were diagnostic in over 99% of lines tested, thus providing a reliable haplotype for marker-assisted selection in these breeding programmes. Our results demonstrate that the proposed methodology can be applied in polyploid F<inf>2</inf> populations to generate high-resolution genetic maps across target intervals.", 
                "date": "2015-01-01T00:00:00Z", 
                "citationCount": 69, 
                "authors": [
                    {
                        "name": "Ramirez-Gonzalez R.H."
                    }, 
                    {
                        "name": "Segovia V."
                    }, 
                    {
                        "name": "Bird N."
                    }, 
                    {
                        "name": "Fenwick P."
                    }, 
                    {
                        "name": "Holdgate S."
                    }, 
                    {
                        "name": "Berry S."
                    }, 
                    {
                        "name": "Jack P."
                    }, 
                    {
                        "name": "Caccamo M."
                    }, 
                    {
                        "name": "Uauy C."
                    }
                ], 
                "journal": "Plant Biotechnology Journal"
            }
        }, 
        {
            "doi": "10.1093/bioinformatics/btv069", 
            "pmid": null, 
            "pmcid": null, 
            "type": "Primary", 
            "version": null, 
            "metadata": {
                "title": "PolyMarker: A fast polyploid primer design pipeline", 
                "abstract": "© The Author 2015. Published by Oxford University Press. Summary: The design of genetic markers is of particular relevance in crop breeding programs. Despite many economically important crops being polyploid organisms, the current primer design tools are tailored for diploid species. Bread wheat, for instance, is a hexaploid comprising of three related genomes and the performance of genetic markers is diminished if the primers are not genome specific. PolyMarker is a pipeline that generates SNP markers by selecting candidate primers for a specified genome using local alignments and standard primer design tools to test the viability of the primers. A command line tool and a web interface are available to the community.", 
                "date": "2015-06-15T00:00:00Z", 
                "citationCount": 38, 
                "authors": [
                    {
                        "name": "Ramirez-Gonzalez R.H."
                    }, 
                    {
                        "name": "Uauy C."
                    }, 
                    {
                        "name": "Caccamo M."
                    }
                ], 
                "journal": "Bioinformatics"
            }
        }
    ], 
    "credit": [
        {
            "name": null, 
            "email": "Ricardo.Ramirez-Gonzalez@tgac.ac.uk", 
            "url": null, 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "admin", 
    "additionDate": "2017-08-20T17:17:07Z", 
    "lastUpdate": "2019-09-04T08:38:25Z", 
    "editPermission": {
        "type": "group", 
        "authors": [
            "animalandcropgenomics"
        ]
    }, 
    "validated": 1, 
    "homepage_status": 0, 
    "elixir_badge": 0
}