{
    "additionDate": "2018-09-03T04:13:39Z",
    "biotoolsCURIE": "biotools:fastproject",
    "biotoolsID": "fastproject",
    "credit": [
        {
            "email": "David.DeTomaso@berkeley.edu",
            "name": "David De Tomaso",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "FastProject is a software tool which analyzes a gene expression matrix and produces a dynamic output report in which two-dimensional projections of the data can be explored.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/YosefLab/FastProject/wiki"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Formatting",
                    "uri": "http://edamontology.org/operation_0335"
                }
            ]
        }
    ],
    "homepage": "https://github.com/YosefLab/FastProject",
    "language": [
        "JavaScript",
        "Python"
    ],
    "lastUpdate": "2018-12-10T12:59:01Z",
    "license": "Other",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/YosefLab/FastProject/issues"
        }
    ],
    "name": "FastProject",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "daniel_stefan",
    "publication": [
        {
            "doi": "10.1186/s12859-016-1176-5",
            "metadata": {
                "abstract": "© 2016 The Author(s).Background: A key challenge in the emerging field of single-cell RNA-Seq is to characterize phenotypic diversity between cells and visualize this information in an informative manner. A common technique when dealing with high-dimensional data is to project the data to 2 or 3 dimensions for visualization. However, there are a variety of methods to achieve this result and once projected, it can be difficult to ascribe biological significance to the observed features. Additionally, when analyzing single-cell data, the relationship between cells can be obscured by technical confounders such as variable gene capture rates. Results: To aid in the analysis and interpretation of single-cell RNA-Seq data, we have developed FastProject, a software tool which analyzes a gene expression matrix and produces a dynamic output report in which two-dimensional projections of the data can be explored. Annotated gene sets (referred to as gene 'signatures') are incorporated so that features in the projections can be understood in relation to the biological processes they might represent. FastProject provides a novel method of scoring each cell against a gene signature so as to minimize the effect of missed transcripts as well as a method to rank signature-projection pairings so that meaningful associations can be quickly identified. Additionally, FastProject is written with a modular architecture and designed to serve as a platform for incorporating and comparing new projection methods and gene selection algorithms. Conclusions: Here we present FastProject, a software package for two-dimensional visualization of single cell data, which utilizes a plethora of projection methods and provides a way to systematically investigate the biological relevance of these low dimensional representations by incorporating domain knowledge.",
                "authors": [
                    {
                        "name": "DeTomaso D."
                    },
                    {
                        "name": "Yosef N."
                    }
                ],
                "citationCount": 24,
                "date": "2016-08-23T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "FastProject: A tool for low-dimensional analysis of single-cell RNA-Seq data"
            },
            "pmcid": "PMC4995760",
            "pmid": "27553427",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "RNA-seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ],
    "validated": 1
}