{
    "accessibility": "Open access",
    "additionDate": "2024-02-05T15:13:54.890944Z",
    "biotoolsCURIE": "biotools:estimater",
    "biotoolsID": "estimater",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "scirejeremie@gmail.com",
            "name": "Jérémie Scire",
            "orcidid": "https://orcid.org/0000-0003-0059-645X",
            "typeEntity": "Person"
        },
        {
            "email": "tanja.stadler@bsse.ethz.ch",
            "name": "Tanja Stadler",
            "typeEntity": "Person"
        }
    ],
    "description": "R package to estimate and monitor the effective reproductive number.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Deisotoping",
                    "uri": "http://edamontology.org/operation_3629"
                },
                {
                    "term": "Information extraction",
                    "uri": "http://edamontology.org/operation_3907"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Validation",
                    "uri": "http://edamontology.org/operation_2428"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://covid-19-re.github.io/estimateR/",
    "language": [
        "R"
    ],
    "lastUpdate": "2024-02-05T15:13:54.893528Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/covid-19-Re/estimateR"
        },
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/jscire/estimateR_paper_code"
        }
    ],
    "name": "estimateR",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12859-023-05428-4",
            "metadata": {
                "abstract": "Background: Accurate estimation of the effective reproductive number (Re) of epidemic outbreaks is of central relevance to public health policy and decision making. We present estimateR, an R package for the estimation of the reproductive number through time from delayed observations of infection events. Such delayed observations include confirmed cases, hospitalizations or deaths. The package implements the methodology of Huisman et al. but modularizes the Re estimation procedure to allow easy implementation of new alternatives to the currently available methods. Users can tailor their analyses according to their particular use case by choosing among implemented options. Results: The estimateR R package allows users to estimate the effective reproductive number of an epidemic outbreak based on observed cases, hospitalization, death or any other type of event documenting past infections, in a fast and timely fashion. We validated the implementation with a simulation study: estimateR yielded estimates comparable to alternative publicly available methods while being around two orders of magnitude faster. We then applied estimateR to empirical case-confirmation incidence data for COVID-19 in nine countries and for dengue fever in Brazil; in parallel, estimateR is already being applied (i) to SARS-CoV-2 measurements in wastewater data and (ii) to study influenza transmission based on wastewater and clinical data in other studies. In summary, this R package provides a fast and flexible implementation to estimate the effective reproductive number for various diseases and datasets. Conclusions: The estimateR R package is a modular and extendable tool designed for outbreak surveillance and retrospective outbreak investigation. It extends the method developed for COVID-19 by Huisman et al. and makes it available for a variety of pathogens, outbreak scenarios, and observation types. Estimates obtained with estimateR can be interpreted directly or used to inform more complex epidemic models (e.g. for forecasting) on the value of Re .",
                "authors": [
                    {
                        "name": "Angst D.C."
                    },
                    {
                        "name": "Bonhoeffer S."
                    },
                    {
                        "name": "Grosu A."
                    },
                    {
                        "name": "Huisman J.S."
                    },
                    {
                        "name": "Li J."
                    },
                    {
                        "name": "Lison A."
                    },
                    {
                        "name": "Maathuis M.H."
                    },
                    {
                        "name": "Scire J."
                    },
                    {
                        "name": "Stadler T."
                    }
                ],
                "date": "2023-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "estimateR: an R package to estimate and monitor the effective reproductive number"
            },
            "pmcid": "PMC10416499",
            "pmid": "37568078"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Infectious disease",
            "uri": "http://edamontology.org/topic_3324"
        },
        {
            "term": "Public health and epidemiology",
            "uri": "http://edamontology.org/topic_3305"
        },
        {
            "term": "Reproductive health",
            "uri": "http://edamontology.org/topic_3420"
        }
    ]
}
