{
    "additionDate": "2018-05-04T17:32:44Z",
    "biotoolsCURIE": "biotools:dosopt",
    "biotoolsID": "dosopt",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "ttasa@ut.ee",
            "name": "Tõnis Tasa",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "An application for personalized vancomycin dose adjustment for neonates.",
    "documentation": [
        {
            "type": "General",
            "url": "http://www.biit.cs.ut.ee/DosOpt"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Experimental measurement",
                        "uri": "http://edamontology.org/data_3108"
                    },
                    "format": [
                        {
                            "term": "Textual format",
                            "uri": "http://edamontology.org/format_2330"
                        }
                    ]
                }
            ],
            "operation": [
                {
                    "term": "Protein property calculation",
                    "uri": "http://edamontology.org/operation_0250"
                },
                {
                    "term": "Statistical calculation",
                    "uri": "http://edamontology.org/operation_2238"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Report",
                        "uri": "http://edamontology.org/data_2048"
                    },
                    "format": [
                        {
                            "term": "PDF",
                            "uri": "http://edamontology.org/format_3508"
                        }
                    ]
                }
            ]
        }
    ],
    "homepage": "http://www.biit.cs.ut.ee/DosOpt",
    "language": [
        "R"
    ],
    "lastUpdate": "2020-01-19T17:48:06Z",
    "license": "Freeware",
    "name": "DosOpt",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "doi": "10.1097/FTD.0000000000000456",
            "metadata": {
                "abstract": "© 2017 Wolters Kluwer Health, Inc. All rights reserved. Background: Our main aim has been to design a framework to improve vancomycin dosing in neonates. This required the development and verification of a computerized dose adjustment application, DosOpt, to guide the selection. Methods: Model fitting in DosOpt uses Bayesian methods for deriving individual pharmacokinetic (PK) estimates from population priors and patient therapeutic drug monitoring measurements. These are used to simulate concentration-time curves and target-constrained dose optimization. DosOpt was verified by assessing bias and precision through several error metrics and normalized prediction distribution errors on samples simulated from the Anderson et al PK model. The performance of DosOpt was also evaluated using retrospective clinical data. Achieved probabilities of target concentration attainment were benchmarked against corresponding attainments in our clinical retrospective data set. Results: Simulations showed no systemic forecast biases. Normalized prediction distribution error values of the base model were distributed by standardized Gaussian (P = 0.1), showing good model suitability. A retrospective test data set included 149 treatment episodes with 1-10 vancomycin concentration measurements per patient (median 2). Individual concentrations in PK estimation improved probability of target attainment and decreased the variance of the estimation. Including 3 individual concentrations in the kinetics estimation increased the probability of Ctrough attainment within 10-15 mg/L from 16% obtained with no individual data (95% confidence interval, 11%-24%) to 43% (21%-47%). Conclusions: DosOpt uses individual concentration data to estimate kinetics and find optimal doses that increase the probability of achieving desired trough concentrations. Its performance started to exceed target levels attained in retrospective clinical data sets with the inclusion of a single individual input concentration. This tool is freely available at http://www.biit.cs.ut.ee/DosOpt.",
                "authors": [
                    {
                        "name": "Tasa T."
                    },
                    {
                        "name": "Metsvaht T."
                    },
                    {
                        "name": "Kalamees R."
                    },
                    {
                        "name": "Vilo J."
                    },
                    {
                        "name": "Lutsar I."
                    }
                ],
                "citationCount": 2,
                "date": "2017-01-01T00:00:00Z",
                "journal": "Therapeutic Drug Monitoring",
                "title": "DosOpt: A tool for personalized Bayesian dose adjustment of vancomycin in neonates"
            }
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Personalised medicine",
            "uri": "http://edamontology.org/topic_3577"
        },
        {
            "term": "Drug metabolism",
            "uri": "http://edamontology.org/topic_3375"
        },
        {
            "term": "Medical informatics",
            "uri": "http://edamontology.org/topic_3063"
        }
    ],
    "validated": 1
}