{"credit":[{"typeEntity":"Person","typeRoles":["Primary contact"],"url":"https://sourceforge.net/projects/microanalyzer/support?source=navbar"}],"function":[{"operation":[{"term":"Read pre-processing","uri":"http://edamontology.org/operation_3219"}]},{"operation":[{"term":"Genotyping","uri":"http://edamontology.org/operation_3196"}]},{"operation":[{"term":"Gene expression profiling","uri":"http://edamontology.org/operation_0314"}]}],"labels":{"language":["Java"],"operatingSystem":["Windows","Mac"],"toolType":["Desktop application"],"topic":[{"term":"Microarray experiment","uri":"http://edamontology.org/topic_3518"},{"term":"DNA polymorphism","uri":"http://edamontology.org/topic_2885"},{"term":"Gene expression","uri":"http://edamontology.org/topic_0203"}]},"publication":[{"abstract":"A current trend in genomics is the investigation of the cell mechanism using different technologies, in order to explain the relationship among genes, molecular processes and diseases. For instance, the combined use of gene-expression arrays and genomic arrays has been demonstrated as an effective instrument in clinical practice. Consequently, in a single experiment different kind of microarrays may be used, resulting in the production of different types of binary data (images and textual raw data). The analysis of microarray data requires an initial preprocessing phase, that makes raw data suitable for use on existing analysis platforms, such as the TIGR M4 (TM4) Suite. An additional challenge to be faced by emerging data analysis platforms is the ability to treat in a combined way those different microarray formats coupled with clinical data. In fact, resulting integrated data may include both numerical and symbolic data (e.g. gene expression and SNPs regarding molecular data), as well as temporal data (e.g. the response to a drug, time to progression and survival rate), regarding clinical data.Raw data preprocessing is a crucial step in analysis but is often performed in a manual and error prone way using different software tools. Thus novel, platform independent, and possibly open source tools enabling the semi-automatic preprocessing and annotation of different microarray data are needed.The paper presents Micro-Analyzer (Microarray Analyzer), a cross-platform tool for the automatic normalization, summarization and annotation of Affymetrix gene expression and SNP binary data. It represents the evolution of the μ-CS tool, extending the preprocessing to SNP arrays that were not allowed in μ-CS. The Micro-Analyzer is provided as a Java standalone tool and enables users to read, preprocess and analyse binary microarray data (gene expression and SNPs) by invoking TM4 platform. It avoids: (i) the manual invocation of external tools (e.g. the Affymetrix Power Tools), (ii) the manual loading of preprocessing libraries, and (iii) the management of intermediate files, such as results and metadata.Micro-Analyzer users can directly manage Affymetrix binary data without worrying about locating and invoking the proper preprocessing tools and chip-specific libraries. Moreover, users of the Micro-Analyzer tool can load the preprocessed data directly into the well-known TM4 platform, extending in such a way also the TM4 capabilities. Consequently, Micro Analyzer offers the following advantages: (i) it reduces possible errors in the preprocessing and further analysis phases, e.g. due to the incorrect choice of parameters or due to the use of old libraries, (ii) it enables the combined and centralized pre-processing of different arrays, (iii) it may enhance the quality of further analysis by storing the workflow, i.e. information about the preprocessing steps, and (iv) finally Micro-Analzyer is freely available as a standalone application at the project web site http://sourceforge.net/projects/microanalyzer/. © 2013 Elsevier Ireland Ltd.","authors":["Guzzi P.H.","Cannataro M."],"cit_count":5,"doi":"10.1016/j.cmpb.2013.04.006","journal":"Computer Methods and Programs in Biomedicine","pmid":"23731720","title":"Micro-analyzer: Automatic preprocessing of Affymetrix microarray data","year":"2013-08-01"}],"summary":{"biotoolsCURIE":"biotools:microanalyzer","biotoolsID":"microanalyzer","description":"Automatic normalization, summarization and annotation of Affymetrix gene expression and SNP binary data by invoking TM4 platform.","homepage":"https://sourceforge.net/projects/microanalyzer/","name":"microAnalyzer"}}