{
    "additionDate": "2021-03-19T08:31:36Z",
    "biotoolsCURIE": "biotools:piims",
    "biotoolsID": "piims",
    "confidence_flag": "tool",
    "description": "A Web Server for Mutation Hotspot Scanning at the Protein-Protein Interface.\n\nThe PIIMS Server (Protein Interface In silico Mutation Scanning) was developed successfully to predict hot spots from interface of protein-protein complex by calculating the binding free energy changes upon alanine mutation scanning. Additional, the mutation scanning strategy is introduced for understanding the impacts of hot spot mutations.\n\nMost biological processes involve multiple proteins interacting with each other. The protein-protein interactions (PPIs) are the basis for almost all biological processes. Hot spots are residues comprising only a small fraction of interfaces yet accounting for the majority of the binding energy. These residues are critical in understanding the principles of PPI.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Molecular dynamics",
                    "uri": "http://edamontology.org/operation_2476"
                },
                {
                    "term": "Protein interaction prediction",
                    "uri": "http://edamontology.org/operation_2492"
                }
            ]
        }
    ],
    "homepage": "http://chemyang.ccnu.edu.cn/ccb/server/PIIMS/index.php",
    "lastUpdate": "2021-03-28T10:38:14Z",
    "name": "PIIMS",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1021/ACS.JCIM.0C00966",
            "metadata": {
                "abstract": "© 2021 American Chemical Society.Protein-protein interactions (PPIs) play vital roles in regulating biological processes, such as cellular and signaling pathways. Hotspots are certain residues located at protein-protein interfaces that contribute more in protein-protein binding than other residues. Research on the mutational effects of hotspots is important for understanding basic aspects of protein association. Hence, various computational tools have been developed to explore the impact of mutation hotspots, which will allow a better understanding of the forces that drive PPIs. However, tools that may provide comprehensive substitutions at hotspots are still rare. Hence, there is a strong need for a new free web server to explore mutational effects of hotspots. Herein we introduce a web server named PIIMS that integrates molecular dynamics simulation and one-step free energy perturbation. It contains two main computational functions: (1) computational alanine scanning analysis to identify hotspots and (2) full mutation scanning analysis to evaluate the effects of hotspot mutations. We rigidly validated its ability to predict binding free energy changes by using large and diverse datasets including 1,341 mutations from 50 PPIs with the correlation coefficient R = 0.75. The difference from the existing tools is that PIIMS can perform further evaluation of hotspot residues with regard to their different mutations. The PIIMS web server (accessible at http://chemyang.ccnu.edu.cn/ccb/server/PIIMS/index.php) is free and open to all users without login requirements.",
                "authors": [
                    {
                        "name": "Hao G.-F."
                    },
                    {
                        "name": "Mei L.-C."
                    },
                    {
                        "name": "Wang F."
                    },
                    {
                        "name": "Wu F.-X."
                    },
                    {
                        "name": "Yang G.-F."
                    },
                    {
                        "name": "Yang J.-F."
                    }
                ],
                "citationCount": 3,
                "date": "2021-01-25T00:00:00Z",
                "journal": "Journal of Chemical Information and Modeling",
                "title": "PIIMS Server: A Web Server for Mutation Hotspot Scanning at the Protein-Protein Interface"
            },
            "pmid": "33400510"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Molecular dynamics",
            "uri": "http://edamontology.org/topic_0176"
        },
        {
            "term": "Protein folding, stability and design",
            "uri": "http://edamontology.org/topic_0130"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
