{"collectionID": [], "accessibility": [], "topic": [{"term": "Proteins", "uri": "http://edamontology.org/topic_0078"}, {"term": "Structure prediction", "uri": "http://edamontology.org/topic_0082"}, {"term": "Sequence analysis", "uri": "http://edamontology.org/topic_0080"}], "owner": "mbs_import", "cost": null, "relation": [], "download": [], "validated": 1, "publication": [{"doi": null, "note": null, "version": null, "pmid": "19055744", "type": null, "pmcid": null, "metadata": {"title": "SELECTpro: Effective protein model selection using a structure-based energy function resistant to BLUNDERs", "abstract": "Background. Protein tertiary structure prediction is a fundamental problem in computational biology and identifying the most native-like model from a set of predicted models is a key sub-problem. Consensus methods work well when the redundant models in the set are the most native-like, but fail when the most native-like model is unique. In contrast, structure-based methods score models independently and can be applied to model sets of any size and redundancy level. Additionally, structure-based methods have a variety of important applications including analogous fold recognition, refinement of sequence-structure alignments, and de novo prediction. The purpose of this work was to develop a structure-based model selection method based on predicted structural features that could be applied successfully to any set of models. Results. Here we introduce SELECTpro, a novel structure-based model selection method derived from an energy function comprising physical, statistical, and predicted structural terms. Novel and unique energy terms include predicted secondary structure, predicted solvent accessibility, predicted contact map, -strand pairing, and side-chain hydrogen bonding. SELECTpro participated in the new model quality assessment (QA) category in CASP7, submitting predictions for all 95 targets and achieved top results. The average difference in GDT-TS between models ranked first by SELECTpro and the most native-like model was 5.07. This GDT-TS difference was less than 1% of the GDT-TS of the most native-like model for 18 targets, and less than 10% for 66 targets. SELECTpro also ranked the single most native-like first for 15 targets, in the top five for 39 targets, and in the top ten for 53 targets, more often than any other method. Because the ranking metric is skewed by model redundancy and ignores poor models with a better ranking than the most native-like model, the BLUNDER metric is introduced to overcome these limitations. SELECTpro is also evaluated on a recent benchmark set of 16 small proteins with large decoy sets of 12500 to 20000 models for each protein, where it outperforms the benchmarked method (I-TASSER). Conclusion. SELECTpro is an effective model selection method that scores models independently and is appropriate for use on any model set. SELECTpro is available for download as a stand alone application at: http://www.igb.uci.edu/ ∼baldig/selectpro.html. SELECTpro is also available as a public server at the same site.", "citationCount": 22, "authors": [{"name": "Randall A."}, {"name": "Baldi P."}], "date": "2008-12-01T00:00:00Z", "journal": "BMC Structural Biology"}}], "homepage_status": 0, "credit": [{"typeRole": ["Primary contact"], "name": null, "url": "http://www.igb.uci.edu/", "gridid": null, "note": null, "orcidid": null, "typeEntity": "Person", "email": "arandall@ics.uci.edu"}], "biotoolsCURIE": "biotools:selectpro", "elixirPlatform": [], "elixirNode": [], "version": [], "elixir_badge": 0, "homepage": "http://www.igb.uci.edu/~baldig/selectpro.html", "function": [{"note": null, "input": [], "operation": [{"term": "Protein modelling", "uri": "http://edamontology.org/operation_0477"}], "cmd": null, "output": []}], "lastUpdate": "2018-12-10T12:58:51Z", "otherID": [], "description": "A novel structure-based model selection method derived from an energy function comprising physical, statistical, and predicted structural terms. Novel and unique energy terms include predicted secondary structure, predicted solvent accessibility, predicted contact map, beta-strand pairing, and side-chain hydrogen bonding.", "toolType": ["Web application"], "editPermission": {"type": "private", "authors": []}, "language": ["C++", "Perl"], "link": [{"url": "http://www.mybiosoftware.com/selectpro-1-0-protein-model-scoringselection-side-chain-prediction.html", "note": null, "type": "Software catalogue"}], "biotoolsID": "selectpro", "additionDate": "2017-08-03T18:59:23Z", "name": "SELECTpro", "license": null, "documentation": [{"url": "http://www.igb.uci.edu/~baldig/selectpro_help.html", "note": null, "type": "General"}], "maturity": null, "confidence_flag": null, "operatingSystem": ["Linux", "Windows", "Mac"]}