{
    "additionDate": "2017-08-03T18:57:02Z",
    "biotoolsCURIE": "biotools:qprot",
    "biotoolsID": "qprot",
    "collectionID": [
        "Proteomics"
    ],
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.nesvilab.org/"
        }
    ],
    "description": "QPROT is a software for differential protein expression using spectral count and intensity data. It also accounts for independent samples and paired samples.",
    "documentation": [
        {
            "note": "Vignette inside each version",
            "type": [
                "General"
            ],
            "url": "https://sourceforge.net/projects/qprot/files/qprot_v1.3.5.zip/"
        }
    ],
    "editPermission": {
        "authors": [
            "proteomics.bio.tools"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Differential protein expression analysis",
                    "uri": "http://edamontology.org/operation_3741"
                }
            ]
        }
    ],
    "homepage": "http://sourceforge.net/projects/qprot/",
    "language": [
        "C"
    ],
    "lastUpdate": "2019-03-26T08:36:37Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/qprot-differential-protein-expression-using-spectral-count-and-intensity-data.html"
        }
    ],
    "name": "QPROT",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "© 2015 Elsevier B.V.We introduce QPROT, a statistical framework and computational tool for differential protein expression analysis using protein intensity data. QPROT is an extension of the QSPEC suite, originally developed for spectral count data, adapted for the analysis using continuously measured protein-level intensity data. QPROT offers a new intensity normalization procedure and model-based differential expression analysis, both of which account for missing data. Determination of differential expression of each protein is based on the standardized Z-statistic based on the posterior distribution of the log fold change parameter, guided by the false discovery rate estimated by a well-known Empirical Bayes method. We evaluated the classification performance of QPROT using the quantification calibration data from the clinical proteomic technology assessment for cancer (CPTAC) study and a recently published Escherichia coli benchmark dataset, with evaluation of FDR accuracy in the latter. Biological significance: QPROT is a statistical framework with computational software tool for comparative quantitative proteomics analysis. It features various extensions of QSPEC method originally built for spectral count data analysis, including probabilistic treatment of missing values in protein intensity data. With the increasing popularity of label-free quantitative proteomics data, the proposed method and accompanying software suite will be immediately useful for many proteomics laboratories.This article is part of a Special Issue entitled: Computational Proteomics.",
                "authors": [
                    {
                        "name": "Choi H."
                    },
                    {
                        "name": "Fermin D."
                    },
                    {
                        "name": "Kim S."
                    },
                    {
                        "name": "Nesvizhskii A.I."
                    },
                    {
                        "name": "Tsou C.-C."
                    }
                ],
                "citationCount": 27,
                "date": "2015-05-02T00:00:00Z",
                "journal": "Journal of Proteomics",
                "title": "QPROT: Statistical method for testing differential expression using protein-level intensity data in label-free quantitative proteomics"
            },
            "pmid": "26254008"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Protein expression",
            "uri": "http://edamontology.org/topic_0108"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Sample collections",
            "uri": "http://edamontology.org/topic_3277"
        }
    ],
    "validated": 1
}
