{
    "additionDate": "2021-01-18T11:21:12Z",
    "biotoolsCURIE": "biotools:cubap",
    "biotoolsID": "cubap",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "kauwe@byu.edu",
            "name": "John S K Kauwe",
            "orcidid": "https://orcid.org/0000-0001-8641-2468",
            "typeEntity": "Person"
        }
    ],
    "description": "CUBAP (Codon Usage Biases Across Populations) is an interactive web portal for analyzing codon usage biases across populations. Although synonymous codon usage does not change the protein primary structure, codon choice significantly impacts translational and transcriptional efficiency, gene expression, the secondary structure of both mRNA and proteins, and has been implicated in various diseases.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://cubap.readthedocs.io/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Codon usage bias calculation",
                    "uri": "http://edamontology.org/operation_2962"
                },
                {
                    "term": "Codon usage table generation",
                    "uri": "http://edamontology.org/operation_0284"
                },
                {
                    "term": "Codon usage table comparison",
                    "uri": "http://edamontology.org/operation_0285"
                },
                {
                    "term": "Codon usage fraction calculation",
                    "uri": "http://edamontology.org/operation_2964"
                },
                {
                    "term": "Formatting",
                    "uri": "http://edamontology.org/operation_0335"
                }
            ]
        }
    ],
    "homepage": "https://cubap.byu.edu",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-02-18T18:18:42Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/kauwelab/cubap"
        }
    ],
    "name": "CUBAP",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/NAR/GKAA863",
            "metadata": {
                "abstract": "© 2020 The Author(s). Published by Oxford University Press on behalf of Nucleic Acids Research.Synonymous codon usage significantly impacts translational and transcriptional efficiency, gene expression, the secondary structure of both mRNA and proteins, and has been implicated in various diseases. However, population-specific differences in codon usage biases remain largely unexplored. Here, we present a web server, https://cubap.byu.edu, to facilitate analyses of codon usage biases across populations (CUBAP). Using the 1000 Genomes Project, we calculated and visually depict population-specific differences in codon frequencies, codon aversion, identical codon pairing, co-tRNA codon pairing, ramp sequences, and nucleotide composition in 17,634 genes. We found that codon pairing significantly differs between populations in 35.8% of genes, allowing us to successfully predict the place of origin for African and East Asian individuals with 98.8% and 100% accuracy, respectively. We also used CUBAP to identify a significant bias toward decreased CTG pairing in the immunity related GTPase M (IRGM) gene in East Asian and African populations, which may contribute to the decreased association of rs10065172 with Crohn's disease in those populations. CUBAP facilitates in-depth gene-specific and codon-specific visualization that will aid in analyzing candidate genes identified in genome-wide association studies, identifying functional implications of synonymous variants, predicting population-specific impacts of synonymous variants and categorizing genetic biases unique to certain populations.",
                "authors": [
                    {
                        "name": "Hodgman M.W."
                    },
                    {
                        "name": "Miller J.B."
                    },
                    {
                        "name": "Meurs T.E."
                    },
                    {
                        "name": "Kauwe J.S.K."
                    }
                ],
                "date": "2020-11-04T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "CUBAP: An interactive web portal for analyzing codon usage biases across populations"
            },
            "pmcid": "PMC7641757",
            "pmid": "33045750"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Protein expression",
            "uri": "http://edamontology.org/topic_0108"
        },
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Phylogenomics",
            "uri": "http://edamontology.org/topic_0194"
        }
    ]
}