{
    "additionDate": "2019-11-14T18:13:22Z",
    "biotoolsCURIE": "biotools:awfisher",
    "biotoolsID": "awfisher",
    "confidence_flag": "tool",
    "description": "P-value evaluation, variability index and biomarker categorization for adaptively weighted Fisher's meta-analysis method in omics applications | fast computing for adaptively weighted fisher's method | Github repository for adaptively weighted fisher's method (AW-Fisher)",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Caleb-Huo/AWFisher",
    "language": [
        "C++",
        "R"
    ],
    "lastUpdate": "2024-11-24T20:57:05.305625Z",
    "name": "AWFisher",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btz589",
            "metadata": {
                "abstract": "Motivation: Meta-analysis methods have been widely used to combine results from multiple clinical or genomic studies to increase statistical powers and ensure robust and accurate conclusions. The adaptively weighted Fisher's method (AW-Fisher), initially developed for omics applications but applicable for general meta-analysis, is an effective approach to combine P-values from K independent studies and to provide better biological interpretability by characterizing which studies contribute to the meta-analysis. Currently, AW-Fisher suffers from the lack of fast P-value computation and variability estimate of AW weights. When the number of studies K is large, the 3K - 1 possible differential expression pattern categories generated by AW-Fisher can become intractable. In this paper, we develop an importance sampling scheme with spline interpolation to increase the accuracy and speed of the P-value calculation. We also apply bootstrapping to construct a variability index for the AW-Fisher weight estimator and a co-membership matrix to categorize (cluster) differentially expressed genes based on their meta-patterns for intuitive biological investigations. Results: The superior performance of the proposed methods is shown in simulations as well as two real omics meta-analysis applications to demonstrate its insightful biological findings.",
                "authors": [
                    {
                        "name": "Huo Z."
                    },
                    {
                        "name": "Park Y."
                    },
                    {
                        "name": "Tang S."
                    },
                    {
                        "name": "Tseng G."
                    }
                ],
                "citationCount": 22,
                "date": "2020-01-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "P-value evaluation, variability index and biomarker categorization for adaptively weighted Fisher's meta-analysis method in omics applications"
            },
            "pmcid": "PMC7867999",
            "pmid": "31359040"
        }
    ],
    "topic": [
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ],
    "validated": 1
}
