{
    "accessibility": "Open access",
    "additionDate": "2022-03-29T10:30:37.606862Z",
    "biotoolsCURIE": "biotools:sarc-graph",
    "biotoolsID": "sarc-graph",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "elejeune@bu.edu",
            "name": "Emma Lejeune",
            "orcidid": "https://orcid.org/0000-0001-8099-3468",
            "typeEntity": "Person"
        },
        {
            "name": "Bill Zhao",
            "orcidid": "https://orcid.org/0000-0002-9303-4327"
        },
        {
            "name": "Christopher S. Chen",
            "orcidid": "https://orcid.org/0000-0003-2445-8449"
        },
        {
            "name": "Kehan Zhang",
            "orcidid": "https://orcid.org/0000-0002-7979-3001"
        }
    ],
    "description": "Automated segmentation, tracking, and analysis of sarcomeres in hiPSC-derived cardiomyocytes.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://github.com/elejeune11/Sarc-Graph",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-03-29T10:30:37.610307Z",
    "license": "MIT",
    "name": "Sarc-Graph",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PCBI.1009443",
            "metadata": {
                "abstract": "Copyright: © 2021 Zhao et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.A better fundamental understanding of human induced pluripotent stem cell-derived cardiomyocytes (hiPSC-CMs) has the potential to advance applications ranging from drug discovery to cardiac repair. Automated quantitative analysis of beating hiPSC-CMs is an important and fast developing component of the hiPSC-CM research pipeline. Here we introduce “Sarc-Graph,” a computational framework to segment, track, and analyze sarcomeres in fluorescently tagged hiPSC-CMs. Our framework includes functions to segment z-discs and sarcomeres, track z-discs and sarcomeres in beating cells, and perform automated spatiotemporal analysis and data visualization. In addition to reporting good performance for sarcomere segmentation and tracking with little to no parameter tuning and a short runtime, we introduce two novel analysis approaches. First, we construct spatial graphs where z-discs correspond to nodes and sarcomeres correspond to edges. This makes measuring the network distance between each sarcomere (i.e., the number of connecting sarcomeres separating each sarcomere pair) straightforward. Second, we treat tracked and segmented components as fiducial markers and use them to compute the approximate deformation gradient of the entire tracked population. This represents a new quantitative descriptor of hiPSC-CM function. We showcase and validate our approach with both synthetic and experimental movies of beating hiPSC-CMs. By publishing Sarc-Graph, we aim to make automated quantitative analysis of hiPSC-CM behavior more accessible to the broader research community.",
                "authors": [
                    {
                        "name": "Chen C.S."
                    },
                    {
                        "name": "Lejeune E."
                    },
                    {
                        "name": "Zhang K."
                    },
                    {
                        "name": "Zhao B."
                    }
                ],
                "citationCount": 1,
                "date": "2021-10-01T00:00:00Z",
                "journal": "PLoS Computational Biology",
                "title": "Sarc-Graph: Automated segmentation, tracking, and analysis of sarcomeres in hiPSCderived cardiomyocytes"
            },
            "pmcid": "PMC8523047",
            "pmid": "34613960"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Data visualisation",
            "uri": "http://edamontology.org/topic_0092"
        },
        {
            "term": "Drug discovery",
            "uri": "http://edamontology.org/topic_3336"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        }
    ]
}
