{
    "additionDate": "2017-08-03T18:52:32Z",
    "biotoolsCURIE": "biotools:nrwrh",
    "biotoolsID": "nrwrh",
    "credit": [
        {
            "email": "xingchen@amss.ac.cn",
            "name": "Xing Chen",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.aporc.org/"
        }
    ],
    "description": "Predict the potential target proteins of the given drug. It is proposed based on the assumption that similar drugs often target similar target proteins and the framework of Random Walk with Restart (RWR).",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://doc.aporc.org/wiki/NRWRH"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Prediction and recognition",
                    "uri": "http://edamontology.org/operation_2423"
                }
            ]
        }
    ],
    "homepage": "http://doc.aporc.org/wiki/NRWRH",
    "homepage_status": 1,
    "lastUpdate": "2018-12-11T19:02:56Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/nrwrh-network-based-random-walk-restart-heterogeneous-network.html"
        }
    ],
    "name": "NRWRH",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Predicting potential drug-target interactions from heterogeneous biological data is critical not only for better understanding of the various interactions and biological processes, but also for the development of novel drugs and the improvement of human medicines. In this paper, the method of Network-based Random Walk with Restart on the Heterogeneous network (NRWRH) is developed to predict potential drug-target interactions on a large scale under the hypothesis that similar drugs often target similar target proteins and the framework of Random Walk. Compared with traditional supervised or semi-supervised methods, NRWRH makes full use of the tool of the network for data integration to predict drug-target associations. It integrates three different networks (protein-protein similarity network, drug-drug similarity network, and known drug-target interaction networks) into a heterogeneous network by known drug-target interactions and implements the random walk on this heterogeneous network. When applied to four classes of important drug-target interactions including enzymes, ion channels, GPCRs and nuclear receptors, NRWRH significantly improves previous methods in terms of cross-validation and potential drug-target interaction prediction. Excellent performance enables us to suggest a number of new potential drug-target interactions for drug development. © 2012 The Royal Society of Chemistry.",
                "authors": [
                    {
                        "name": "Chen X."
                    },
                    {
                        "name": "Liu M.-X."
                    },
                    {
                        "name": "Yan G.-Y."
                    }
                ],
                "citationCount": 303,
                "date": "2012-07-01T00:00:00Z",
                "journal": "Molecular BioSystems",
                "title": "Drug-target interaction prediction by random walk on the heterogeneous network"
            },
            "pmid": "22538619"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Drug discovery",
            "uri": "http://edamontology.org/topic_3336"
        },
        {
            "term": "Protein targeting and localisation",
            "uri": "http://edamontology.org/topic_0140"
        }
    ],
    "validated": 1
}