{
    "additionDate": "2021-01-18T07:44:03Z",
    "biotoolsCURIE": "biotools:e-pix",
    "biotoolsID": "e-pix",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "christopher.hampf@uni-greifswald.de",
            "name": "Christopher Hampf",
            "orcidid": "https://orcid.org/0000-0002-4557-4783",
            "typeEntity": "Person"
        }
    ],
    "description": "E-PIX® is a record linkage tool for managing multi-million patients in research projects at a large university hospital in Germany. The Record Linkage and ID Management solution E-PIX (Enterprise Identifier Cross Referencing) applies the propabilistic Fellegi-Sunter-algorithm and the Levenshtein distance to avoid duplicate participant entries. The independent software module facilitates participant management and multisite-aggregation of medical research data.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Information extraction",
                    "uri": "http://edamontology.org/operation_3907"
                },
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                }
            ]
        }
    ],
    "homepage": "https://github.com/mosaic-hgw/E-PIX",
    "language": [
        "Java"
    ],
    "lastUpdate": "2021-03-05T14:28:51Z",
    "license": "AGPL-3.0",
    "link": [
        {
            "note": "Docker repository",
            "type": [
                "Repository"
            ],
            "url": "https://github.com/mosaic-hgw/E-PIX/tree/master/docker/standard"
        }
    ],
    "name": "E-PIX",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1186/S12967-020-02257-4",
            "metadata": {
                "abstract": "© 2020 The Author(s).Background: The identity management is a central component in medical research. Patients are recruited from various sites, which requires an error tolerant record linkage method, to ensure that patients are registered only once. In large research projects or institutions, the identity management has to deal with several thousands or millions of patients. In environments with large numbers of patients the register process could lead to high runtimes caused by record linkage. The Central Biomaterial Bank of the Charité (ZeBanC) searched for an identity management solution, which can handle millions of patients in large research projects with an acceptable performance. The goal of this paper was to simulate the registration of several million patients using the E-PIX service at Charité - Universitätsmedizin Berlin. The E-PIX service was evaluated in terms of needed runtimes, memory requirements, and processor utilization. A total of at least 20 million patients had to be registered. The runtimes to register patients into databases with various sizes should be examined, and the maximum number of patients, which the E-PIX service could handle, should be determined. Methods: Tools were set up or developed to measure the needed runtimes, the memory used and the processor usage to register patients into various sizes of databases. To generate runtimes close to reality, modified patient data based on transposed real patient data were used for the simulation. The transposed patient data were sent to E-PIX to measure the runtimes of the registration process. This measurement was repeated for various database sizes. Results: E-PIX is suitable to manage multi-million patients within a dataset. With the given hardware, it was possible to register a total of more than 30 million patients. It was possible to register more than 16 thousand patients per day into this database. Conclusions: The E-PIX tool fulfills the requirements of the Charité to be used for large research projects. The use of E-PIX is intended for the research context in the Charité.",
                "authors": [
                    {
                        "name": "Hampf C."
                    },
                    {
                        "name": "Geidel L."
                    },
                    {
                        "name": "Zerbe N."
                    },
                    {
                        "name": "Bialke M."
                    },
                    {
                        "name": "Stahl D."
                    },
                    {
                        "name": "Blumentritt A."
                    },
                    {
                        "name": "Bahls T."
                    },
                    {
                        "name": "Hufnagl P."
                    },
                    {
                        "name": "Hoffmann W."
                    }
                ],
                "date": "2020-02-17T00:00:00Z",
                "journal": "Journal of Translational Medicine",
                "title": "Assessment of scalability and performance of the record linkage tool E-PIX® in managing multi-million patients in research projects at a large university hospital in Germany"
            },
            "pmcid": "PMC7027209",
            "pmid": "32066455"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Public health and epidemiology",
            "uri": "http://edamontology.org/topic_3305"
        },
        {
            "term": "Data security",
            "uri": "http://edamontology.org/topic_3263"
        },
        {
            "term": "Database management",
            "uri": "http://edamontology.org/topic_3489"
        },
        {
            "term": "Biomaterials",
            "uri": "http://edamontology.org/topic_3368"
        }
    ]
}