{
    "additionDate": "2019-11-14T20:13:08Z",
    "biotoolsCURIE": "biotools:Zika",
    "biotoolsID": "Zika",
    "confidence_flag": "very low",
    "credit": [
        {
            "email": "l.gardner@jhu.edu",
            "name": "Lauren M. Gardner",
            "orcidid": "https://orcid.org/0000-0003-1083-3850",
            "typeEntity": "Person"
        }
    ],
    "description": "> VERY_LOW CONFIDENCE! | > CORRECT NAME OF TOOL COULD ALSO BE 'Zika Americas', 'Americas' | A dynamic neural network model for predicting risk of Zika in real time | Zika Epidemiology - Case Numbers | Digitized Zika cases and incidence rates by epidemiological week from PAHO | Most epidemiological investigations of Zika virus during the current epidemic in the Americas requires temporal human case data. The only place to gather this information is is from the Pan American Health Organization (PAHO), an arm of the World Health Organization. They present Zika virus case numbers in two ways: spreadsheets of cumulative case counts and bar graphs of weekly reported cases. The data from the cumulative case spreadsheets are easy to download and can be readily adapted for research purposes",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                }
            ]
        }
    ],
    "homepage": "http://github.com/andersen-lab/Zika-cases-PAHO",
    "language": [
        "Python"
    ],
    "lastUpdate": "2019-11-14T20:13:08Z",
    "name": "Zika",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12916-019-1389-3",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: In 2015, the Zika virus spread from Brazil throughout the Americas, posing an unprecedented challenge to the public health community. During the epidemic, international public health officials lacked reliable predictions of the outbreak's expected geographic scale and prevalence of cases, and were therefore unable to plan and allocate surveillance resources in a timely and effective manner. Methods: In this work, we present a dynamic neural network model to predict the geographic spread of outbreaks in real time. The modeling framework is flexible in three main dimensions (i) selection of the chosen risk indicator, i.e., case counts or incidence rate; (ii) risk classification scheme, which defines the high-risk group based on a relative or absolute threshold; and (iii) prediction forecast window (1 up to 12 weeks). The proposed model can be applied dynamically throughout the course of an outbreak to identify the regions expected to be at greatest risk in the future. Results: The model is applied to the recent Zika epidemic in the Americas at a weekly temporal resolution and country spatial resolution, using epidemiological data, passenger air travel volumes, and vector habitat suitability, socioeconomic, and population data for all affected countries and territories in the Americas. The model performance is quantitatively evaluated based on the predictive accuracy of the model. We show that the model can accurately predict the geographic expansion of Zika in the Americas with the overall average accuracy remaining above 85% even for prediction windows of up to 12 weeks. Conclusions: Sensitivity analysis illustrated the model performance to be robust across a range of features. Critically, the model performed consistently well at various stages throughout the course of the outbreak, indicating its potential value at any time during an epidemic. The predictive capability was superior for shorter forecast windows and geographically isolated locations that are predominantly connected via air travel. The highly flexible nature of the proposed modeling framework enables policy makers to develop and plan vector control programs and case surveillance strategies which can be tailored to a range of objectives and resource constraints.",
                "authors": [
                    {
                        "name": "Akhtar M."
                    },
                    {
                        "name": "Kraemer M.U.G."
                    },
                    {
                        "name": "Gardner L.M."
                    }
                ],
                "citationCount": 5,
                "date": "2019-09-02T00:00:00Z",
                "journal": "BMC Medicine",
                "title": "A dynamic neural network model for predicting risk of Zika in real time"
            },
            "pmcid": "PMC6717993",
            "pmid": "31474220"
        }
    ],
    "topic": [
        {
            "term": "Public health and epidemiology",
            "uri": "http://edamontology.org/topic_3305"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ]
}