{
    "additionDate": "2020-01-14T20:00:55Z",
    "biotoolsCURIE": "biotools:gtools",
    "biotoolsID": "gtools",
    "confidence_flag": "tool",
    "description": "Performing QTL and eQTL Analyses with the R-Package GenomicTools.\n\nThis Package is the continuation of the genomic analysis tools part of the GeneticTools package.\n\nWebsite accompanying the R-package 'GenomicTools'.\n\nToday the versions 0.2.8 for GenomicTools and 0.1.4 for GenomicTools.fileHandler have been released with a couple of bugfixes and a list of new features.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Gene expression QTL analysis",
                    "uri": "http://edamontology.org/operation_3232"
                }
            ]
        }
    ],
    "homepage": "http://genomictools.danielfischer.name",
    "language": [
        "R",
        "C++"
    ],
    "lastUpdate": "2020-12-03T08:38:06.609998Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/fischuu/GenomicTools"
        }
    ],
    "name": "GTools",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1007/978-1-0716-0026-9_2",
            "metadata": {
                "abstract": "© Springer Science+Business Media, LLC, part of Springer Nature 2020.We present the R-package GenomicTools that can be used to perform QTL and eQTL analyses in a user-friendly way. First, the theoretical backgrounds of both implemented methods are explained. These are (a) the linear model approach that is commonly used in the standard QTL/eQTL testing as well as (b) a non-parametrical directional testing method implemented in GenomicTools. The directional test overcomes some of the drawbacks of the standard way and is robust against outliers in the data. The main focus, however, is on a detailed explanation, how the R-package is used in practice. Starting from the installation of the package, followed by the data import and also the required steps to perform the analyses, all necessary steps are explained in detail with examples. Also, the commands to create publication-ready figures are presented. The last chapter concludes and discusses general topics related to the analysis of QTL and eQTL data in particular and genomic data in general.",
                "authors": [
                    {
                        "name": "Fischer D."
                    }
                ],
                "date": "2020-01-01T00:00:00Z",
                "journal": "Methods in Molecular Biology",
                "title": "Performing QTL and eQTL analyses with the R-package genomictools"
            },
            "pmid": "31849005"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ]
}