{"credit":[{"email":"jdqiu@ncu.edu.cn","typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://bioinfo.ncu.edu.cn/"}],"documentation":[{"type":"GENERAL","url":"http://bioinfo.ncu.edu.cn/SubPhosHelp.aspx"}],"function":[{"operation":[{"term":"Protein sequence analysis","uri":"http://edamontology.org/operation_2479"},{"term":"Protein feature detection","uri":"http://edamontology.org/operation_3092"}]}],"labels":{"operatingSystem":["Linux","Windows","Mac"],"toolType":["Web application"],"topic":[{"term":"Sequence analysis","uri":"http://edamontology.org/topic_0080"},{"term":"Proteins","uri":"http://edamontology.org/topic_0078"},{"term":"Protein sites, features and motifs","uri":"http://edamontology.org/topic_3510"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/subphospred-prediction-of-phosphosrylation-sites.html"}],"publication":[{"abstract":"© The Author 2014. Published by Oxford University Press. All rights reserved. Motivation: Protein phosphorylation is the most common posttranslational modification (PTM) regulating major cellular processes through highly dynamic and complex signaling pathways. Largescale comparative phosphoproteomic studies have frequently been done on whole cells or organs by conventional bottom-up mass spectrometry approaches, i.e at the phosphopeptide level. Using this approach, there is no way to know from where the phosphopeptide signal originated. Also, as a consequence of the scale of these studies, important information on the localization of phosphorylation sites in subcellular compartments (SCs) is not surveyed. Results: Here, we present a first account of the emerging field of subcellular phosphoproteomics where a support vector machine (SVM) approach was combined with a novel algorithm of discrete wavelet transform (DWT) to facilitate the identification of compartment-specific phosphorylation sites and to unravel the intricate regulation of protein phosphorylation. Our data reveal that the subcellular phosphorylation distribution is compartment type dependent and that the phosphorylation displays site-specific sequence motifs that diverge between SCs.","authors":["Chen X.","Shi S.-P.","Suo S.-B.","Xu H.-D.","Qiu J.-D."],"cit_count":10,"journal":"Bioinformatics","pmid":"25236462","title":"Proteomic analysis and prediction of human phosphorylation sites in subcellular level reveal subcellular specificity","year":"2015-01-15"}],"summary":{"biotoolsCURIE":"biotools:subphospred","biotoolsID":"subphospred","description":"Web server that could predict phosphosrylation sites in different subcellular compartments (SCs) of homo sapiens, which combines a novel discrete wavelet transform (DWT) strategy with support vector machine (SVM) approach to identify phosphorylation sites for different SCs in human.","homepage":"http://bioinfo.ncu.edu.cn/SubPhosPred.aspx","name":"SubPhosPred"}}