
{
    "credit": [
        {
            "email": "khan.suleiman@gmail.com",
            "name": "Suleiman Ali Khan",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        },
        {
            "email": "eemeli.leppaaho@aalto.fi",
            "name": "Eemeli Leppäaho",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://research.cs.aalto.fi/pml/software/GFAsparse/"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Prediction and recognition",
                    "uri": "http://edamontology.org/operation_2423"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "R"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Library"
        ],
        "topic": [
            {
                "term": "Machine learning",
                "uri": "http://edamontology.org/topic_3474"
            },
            {
                "term": "Drug discovery",
                "uri": "http://edamontology.org/topic_3336"
            },
            {
                "term": "Oncology",
                "uri": "http://edamontology.org/topic_2640"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/gfasparse-0-1-elementwise-sparse-group-factor-analysis.html"
        }
    ],
    "publication": [
        {
            "abstract": "Motivation: Analysis of relationships of drug structure to biological response is key to understanding off-target and unexpected drug effects, and for developing hypotheses on how to tailor drug therapies. New methods are required for integrated analyses of a large number of chemical features of drugs against the corresponding genome-wide responses of multiple cell models. Results: In this article, we present the first comprehensive multi-set analysis on how the chemical structure of drugs impacts on genomewide gene expression across several cancer cell lines [Connectivity Map (CMap) database]. The task is formulated as searching for drug response components across multiple cancers to reveal shared effects of drugs and the chemical features that may be responsible. The components can be computed with an extension of a recent approach called Group Factor Analysis. We identify 11 components that link the structural descriptors of drugs with specific gene expression responses observed in the three cell lines and identify structural groups that may be responsible for the responses. Our method quantitatively outperforms the limited earlier methods on CMap and identifies both the previously reported associations and several interesting novel findings, by taking into account multiple cell lines and advanced 3D structural descriptors. The novel observations include: previously unknown similarities in the effects induced by 15-delta prostaglandin J2 and HSP90 inhibitors, which are linked to the 3D descriptors of the drugs; and the induction by simvastatin of leukemia-specific response, resembling the effects of corticosteroids.. © The Author(s) 2014.",
            "authors": [
                "Khan S.A.",
                "Virtanen S.",
                "Kallioniemi O.P.",
                "Wennerberg K.",
                "Poso A.",
                "Kaski S."
            ],
            "cit_count": 16,
            "journal": "Bioinformatics",
            "pmid": "25161239",
            "title": "Identification of structural features in chemicals associated with cancer drug response: A systematic data-driven analysis",
            "year": "2014-09-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:gfasparse",
        "biotoolsID": "gfasparse",
        "description": "Bayesian Group Factor Analysis with element wise prior inducing sparsity.",
        "homepage": "http://research.ics.aalto.fi/mi/software/GFAsparse/",
        "name": "GFAsparse"
    }
}