{
    "accessibility": "Open access",
    "additionDate": "2022-10-13T06:28:01.941423Z",
    "biotoolsCURIE": "biotools:genelink_scRNAseq",
    "biotoolsID": "genelink_scRNAseq",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Guangyi Chen"
        },
        {
            "name": "Zhi-Ping Liu"
        }
    ],
    "description": "A supervised GRN inference framework, GENELink, to predict potential interactions from scRNA-seq data and gene linkage topology.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene expression profiling",
                    "uri": "http://edamontology.org/operation_0314"
                },
                {
                    "term": "Gene prediction",
                    "uri": "http://edamontology.org/operation_2454"
                },
                {
                    "term": "Gene regulatory network prediction",
                    "uri": "http://edamontology.org/operation_2437"
                }
            ]
        }
    ],
    "homepage": "https://github.com/zpliulab/GENELink",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T15:27:05.891490Z",
    "license": "MIT",
    "name": "GENELink",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btac559",
            "metadata": {
                "abstract": "Motivation: Single-cell RNA sequencing (scRNA-seq) data provides unprecedented opportunities to reconstruct gene regulatory networks (GRNs) at fine-grained resolution. Numerous unsupervised or self-supervised models have been proposed to infer GRN from bulk RNA-seq data, but few of them are appropriate for scRNA-seq data under the circumstance of low signal-to-noise ratio and dropout. Fortunately, the surging of TF-DNA binding data (e.g. ChIP-seq) makes supervised GRN inference possible. We regard supervised GRN inference as a graph-based link prediction problem that expects to learn gene low-dimensional vectorized representations to predict potential regulatory interactions. Results: In this paper, we present GENELink to infer latent interactions between transcription factors (TFs) and target genes in GRN using graph attention network. GENELink projects the single-cell gene expression with observed TF-gene pairs to a low-dimensional space. Then, the specific gene representations are learned to serve for downstream similarity measurement or causal inference of pairwise genes by optimizing the embedding space. Compared to eight existing GRN reconstruction methods, GENELink achieves comparable or better performance on seven scRNA-seq datasets with four types of ground-truth networks. We further apply GENELink on scRNA-seq of human breast cancer metastasis and reveal regulatory heterogeneity of Notch and Wnt signalling pathways between primary tumour and lung metastasis. Moreover, the ontology enrichment results of unique lung metastasis GRN indicate that mitochondrial oxidative phosphorylation (OXPHOS) is functionally important during the seeding step of the cancer metastatic cascade, which is validated by pharmacological assays.",
                "authors": [
                    {
                        "name": "Chen G."
                    },
                    {
                        "name": "Liu Z.-P."
                    }
                ],
                "citationCount": 26,
                "date": "2022-10-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Graph attention network for link prediction of gene regulations from single-cell RNA-sequencing data"
            },
            "pmid": "35961023"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "ChIP-seq",
            "uri": "http://edamontology.org/topic_3169"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ],
    "validated": 1
}
