{
    "additionDate": "2019-11-14T18:37:06Z",
    "biotoolsCURIE": "biotools:EURO-HEALTHY",
    "biotoolsID": "EURO-HEALTHY",
    "confidence_flag": "low",
    "credit": [
        {
            "email": "claudiampcosta@uc.pt",
            "name": "Claudia Costa",
            "orcidid": "https://orcid.org/0000-0002-7422-6139",
            "typeEntity": "Person"
        }
    ],
    "description": "> LOW CONFIDENCE! | > CORRECT NAME OF TOOL COULD ALSO BE 'indicators' | Evaluation of data availability on population health indicators at the regional level across the European Union | Welcome to the eurohealthydata portal! | This portal aggregates the data collected within the scope of the Project EURO-HEALTHY – Shaping EUROpean policies to promote HEALTH equitY, coordinated by the Centre of Studies for Geography and Spatial Planning (CEGOT) at the University of Coimbra and funded by the European Union’s Horizon 2020 research and innovation programme under grant agreement number 643398. Access to this portal is protected and subject to authorization",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                }
            ]
        }
    ],
    "homepage": "http://www.eurohealthydata.uc.pt",
    "lastUpdate": "2019-11-14T18:37:06Z",
    "name": "EURO-HEALTHY",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12963-019-0188-6",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: The ability to measure regional health inequalities across Europe and to build adequate population health indices depends significantly on the availability of reliable and comparable data at the regional level. Within the scope of the EU-funded project EURO-HEALTHY, a Population Health Index (PHI) was built. This model aggregates 39 indicators considered relevant by experts and stakeholders to evaluate and monitor population health on the regional level within the European Union (269 regions). The aim of this research was to assess the data availability for those indicators. As a subsequent aim, an adequate protocol to overcome issues arising from missing data will be presented, as well as key messages for both national and European statistical authorities meant to improve data collection on population health. Methods: The methodology for the study includes three consecutive phases: (i) assessing the data availability for the respective indicators at the regional level for the last year available (ii) applying a protocol for missing data and completing the database and (iii) developing a scoring system ranging from 0 (no data available; worst) to 1 (all data available; best) to evaluate the availability of data by indicator and EU region. Results: Although the missing data on the set of the PHI indicators was significant, the mean availability score for the EURO-HEALTHY PHI indicators is 0.8 and the regional availability score is 0.7, which reveal the strength of the indicators as well as the data completeness protocol for missing data. Conclusions: This study provides a comprehensive data availability assessment for population health indicators from multiple areas of concern, at the EU regional level. The results highlight that the data completeness protocol and availability scores are suitable tools to apply on any indicator's data source mapping. It also raises awareness to the urgent need for sub-national data in several domains and for closing the data gaps between and within countries. This will require policies clearly focused on improving equity between regions and a coordinated effort from the producers of data (the EU28 national statistics offices and EUROSTAT) and the stakeholders who design policies at EU, regional and local level.",
                "authors": [
                    {
                        "name": "Costa C."
                    },
                    {
                        "name": "Freitas A."
                    },
                    {
                        "name": "Stefanik I."
                    },
                    {
                        "name": "Krafft T."
                    },
                    {
                        "name": "Pilot E."
                    },
                    {
                        "name": "Morrison J."
                    },
                    {
                        "name": "Santana P."
                    }
                ],
                "citationCount": 5,
                "date": "2019-01-01T00:00:00Z",
                "journal": "Population Health Metrics",
                "title": "Evaluation of data availability on population health indicators at the regional level across the European Union"
            },
            "pmcid": "PMC6686464",
            "pmid": "31391120"
        }
    ],
    "topic": [
        {
            "term": "Public health and epidemiology",
            "uri": "http://edamontology.org/topic_3305"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "Medicines research and development",
            "uri": "http://edamontology.org/topic_3376"
        }
    ]
}