
{
    "credit": [
        {
            "email": "help@o-miner.org",
            "name": "Support",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://o-miner.org/guide_2.0.html"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Over-representation analysis",
                    "uri": "http://edamontology.org/operation_3501"
                },
                {
                    "term": "Gene expression profiling",
                    "uri": "http://edamontology.org/operation_0314"
                },
                {
                    "term": "Text mining",
                    "uri": "http://edamontology.org/operation_0306"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Transcriptomics",
                "uri": "http://edamontology.org/topic_3308"
            },
            {
                "term": "Omics",
                "uri": "http://edamontology.org/topic_3391"
            },
            {
                "term": "Bioinformatics",
                "uri": "http://edamontology.org/topic_0091"
            },
            {
                "term": "Molecular interactions, pathways and networks",
                "uri": "http://edamontology.org/topic_0602"
            },
            {
                "term": "Data architecture, analysis and design",
                "uri": "http://edamontology.org/topic_3365"
            }
        ]
    },
    "publication": [
        {
            "abstract": "High-throughput profiling has generated massive amounts of data across basic, clinical and translational research fields. However, open source comprehensive web tools for analysing data obtained from different platforms and technologies are still lacking. To fill this gap and the unmet computational needs of ongoing research projects, we developed O-miner, a rapid, comprehensive, efficient web tool that covers all the steps required for the analysis of both transcriptomic and genomic data starting from raw image files through in-depth bioinformatics analysis and annotation to biological knowledge extraction. O-miner was developed from a biologist end-user perspective. Hence, it is as simple to use as possible within the confines of the complexity of the data being analysed. It provides a strong analytical suite able to overlay and harness large, complicated, raw and heterogeneous sets of profiles with biological/clinical data. Biologists can use O-miner to analyse and integrate different types of data and annotations to build knowledge of relevant altered mechanisms and pathways in order to identify and prioritize novel targets for further biological validation. Here we describe the analytical workflows currently available using O-miner and present examples of use. O-miner is freely available at www.o-miner.org. © 2012 The Author(s).",
            "authors": [
                "Cutts R.J.",
                "Dayem Ullah A.Z.",
                "Sangaralingam A.",
                "Gadaleta E.",
                "Lemoine N.R.",
                "Chelala C."
            ],
            "cit_count": 7,
            "journal": "Nucleic Acids Research",
            "pmid": "22600742",
            "title": "O-miner: An integrative platform for automated analysis and mining of-omics data",
            "year": "2012-07-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:o-miner",
        "biotoolsID": "o-miner",
        "description": "Webserver that automates the analysis and annotation of complex -omics data. Specifically deals with genomics and transcriptomics data.",
        "homepage": "http://www.o-miner.org",
        "name": "O-miner"
    }
}