{
    "additionDate": "2017-12-18T00:09:44Z",
    "biotoolsCURIE": "biotools:nrprof",
    "biotoolsID": "nrprof",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://jjwanglab.org:8080/hkubioinfo/"
        }
    ],
    "description": "It is a novel automated protein functional assignment method based on the neural response algorithm, which simulates the neuronal behavior of the visual cortex in the human brain. The main idea of this algorithm is to define a distance metric that corresponds to the similarity of the subsequences and reflects how the human brain can distinguish between different sequences.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://jjwanglab.org:8080/hkubioinfo/NRProF/NRProF.jsp#usage"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Query",
                    "uri": "http://edamontology.org/operation_0224"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Protein function prediction",
                    "uri": "http://edamontology.org/operation_1777"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Comparison",
                    "uri": "http://edamontology.org/operation_2424"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Protein sequence analysis",
                    "uri": "http://edamontology.org/operation_2479"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Prediction",
                    "uri": "http://edamontology.org/operation_2423"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Validation",
                    "uri": "http://edamontology.org/operation_2428"
                }
            ]
        }
    ],
    "homepage": "http://jjwanglab.org:8080/hkubioinfo/NRProF/NRProF.jsp",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-10T12:58:59Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/nrprof-protein-function-prediction-based-neural-response-algorithm.html"
        }
    ],
    "name": "NRProF",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1186/1752-0509-6-S1-S19",
            "metadata": {
                "abstract": "Background: Large amounts of data are being generated by high-throughput genome sequencing methods. But the rate of the experimental functional characterization falls far behind. To fill the gap between the number of sequences and their annotations, fast and accurate automated annotation methods are required. Many methods, such as GOblet, GOFigure, and Gotcha, are designed based on the BLAST search. Unfortunately, the sequence coverage of these methods is low as they cannot detect the remote homologues. Adding to this, the lack of annotation specificity advocates the need to improve automated protein function prediction.Results: We designed a novel automated protein functional assignment method based on the neural response algorithm, which simulates the neuronal behavior of the visual cortex in the human brain. Firstly, we predict the most similar target protein for a given query protein and thereby assign its GO term to the query sequence. When assessed on test set, our method ranked the actual leaf GO term among the top 5 probable GO terms with accuracy of 86.93%.Conclusions: The proposed algorithm is the first instance of neural response algorithm being used in the biological domain. The use of HMM profiles along with the secondary structure information to define the neural response gives our method an edge over other available methods on annotation accuracy. Results of the 5-fold cross validation and the comparison with PFP and FFPred servers indicate the prominent performance by our method. The program, the dataset, and help files are available at http://www.jjwanglab.org/NRProF/. © 2012 Yalamanchili et al.; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Yalamanchili H.K."
                    },
                    {
                        "name": "Xiao Q.-W."
                    },
                    {
                        "name": "Wang J."
                    }
                ],
                "citationCount": 4,
                "date": "2012-07-16T00:00:00Z",
                "journal": "BMC Systems Biology",
                "title": "A novel neural response algorithm for protein function prediction"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Sequences",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "Protein function prediction",
            "uri": "http://edamontology.org/topic_1775"
        }
    ],
    "validated": 1
}