{
    "additionDate": "2021-01-18T10:13:05Z",
    "biotoolsCURIE": "biotools:pirnapred",
    "biotoolsID": "pirnapred",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "mongaisha4@gmail.com",
            "name": "Isha Monga",
            "typeEntity": "Person"
        },
        {
            "email": "indranil@iisermohali.ac.in",
            "name": "Indranil Banerjee",
            "typeEntity": "Person"
        }
    ],
    "description": "Computational Identification of piRNAs Using Features Based on RNA Sequence, Structure, Thermodynamic and Physicochemical Properties.\n\npiRNAPred is an algorithm for the computational identification of piRNAs using features based on RNA sequence, structure, thermodynamic and physicochemical properties.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Feature selection",
                    "uri": "http://edamontology.org/operation_3936"
                },
                {
                    "term": "RNA secondary structure prediction",
                    "uri": "http://edamontology.org/operation_0278"
                },
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                }
            ]
        }
    ],
    "homepage": "https://github.com/IshaMonga/piRNAPred",
    "language": [
        "Perl"
    ],
    "lastUpdate": "2021-01-23T16:55:15Z",
    "name": "piRNAPred",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.2174/1389202920666191129112705",
            "metadata": {
                "abstract": "© 2019 Bentham Science Publishers.Rationale: PIWI-interacting RNAs (piRNAs) are a recently-discovered class of small noncoding RNAs (ncRNAs) with a length of 21-35 nucleotides. They play a role in gene expression regulation, transposon silencing, and viral infection inhibition. Once considered as “dark matter” of ncRNAs, piRNAs emerged as important players in multiple cellular functions in different organisms. However, our knowledge of piRNAs is still very limited as many piRNAs have not been yet identified due to lack of robust computational predictive tools. Methods: To identify novel piRNAs, we developed piRNAPred, an integrated framework for piRNA prediction employing hybrid features like k-mer nucleotide composition, secondary structure, thermodynamic and physicochemical properties. A non-redundant dataset (D3349 or D1684p+1665n) comprising 1684 experimentally verified piRNAs and 1665 non-piRNA sequences was obtained from piRBase and NONCODE, respectively. These sequences were subjected to the computation of various se-quence-structure based features in binary format and trained using different machine learning techniques, of which support vector machine (SVM) performed the best. Results: During the ten-fold cross-validation approach (10-CV), piRNAPred achieved an overall accuracy of 98.60% with Mathews correlation coefficient (MCC) of 0.97 and receiver operating characteristic (ROC) of 0.99. Furthermore, we achieved a dimensionality reduction of feature space using an attribute selected classifier. Conclusion: We obtained the highest performance in accurately predicting piRNAs as compared to the current state-of-the-art piRNA predictors. In conclusion, piRNAPred would be helpful to expand the piRNA repertoire, and provide new insights on piRNA functions.",
                "authors": [
                    {
                        "name": "Monga I."
                    },
                    {
                        "name": "Banerjee I."
                    }
                ],
                "citationCount": 1,
                "date": "2019-01-01T00:00:00Z",
                "journal": "Current Genomics",
                "title": "Computational identification of piRNAs using features based on RNA sequence, structure, thermodynamic and physicochemical properties"
            },
            "pmcid": "PMC7327968",
            "pmid": "32655289"
        }
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Nucleic acid structure analysis",
            "uri": "http://edamontology.org/topic_0097"
        },
        {
            "term": "Mobile genetic elements",
            "uri": "http://edamontology.org/topic_0798"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        }
    ],
    "validated": 1
}