{
    "additionDate": "2016-04-27T13:44:13Z",
    "biotoolsCURIE": "biotools:rvd",
    "biotoolsID": "rvd",
    "credit": [
        {
            "name": "rki.de",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        },
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://dna.brc.riken.jp/rvd/info.html"
        }
    ],
    "description": "Database of DNA clones, recombinant retroviruses and recombinant adenoviruses.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://dnaconda.riken.jp/rvd/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                }
            ]
        }
    ],
    "homepage": "http://dna.brc.riken.jp/rvd/",
    "homepage_status": 1,
    "lastUpdate": "2018-12-10T12:58:52Z",
    "name": "Recombinant Virus Database (RVD)",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "dabrowskiw@rki.de",
    "publication": [
        {
            "doi": "10.1002/jgm.786",
            "metadata": {
                "abstract": "Background: Viral vectors are required as gene-delivery systems for gene therapy and basic research. Recombinant adenoviruses (rAds) expressing genes of interest are being developed as research tools and many studies in vitro and in vivo have already been performed with such rAds. Methods: Shuttle vectors for rAds were constructed with full-length cDNAs and rAds were generated in HEK293 cells by the COSTPC method. The rAds and shuttle vectors were developed by the Japanese research community and deposited in the RIKEN DNA Bank (RDB; http://www.brc.riken.jp/lab/dna/en/) for distribution to the scientific community. The Recombinant Virus Database (RVD; http://www.brc.riken.jp/lab/dna/rvd/) was established at the RIKEN BioResource Center (BRC) in Japan as the source of information about and distribution of the various resources. Results: The RIKEN BRC is releasing more than 300 recombinant viruses (RVs) and 500 shuttle vectors, as well as all related information, which is included in a newly established database, the RVD. The RVD consists of (i) information about the RVs, the inserted cDNAs and the shuttle vectors; (ii) data about sequence-tagged sites (STSs) that are markers of viral DNAs; and (iii) experimental protocols for the use of RVs. Conclusions: The new database and available resources should be very useful to scientists who are studying human gene therapy and performing related basic research. It is a web-interfaced flat-file database that can be accessed through the internet. Moreover, all of the resources deposited in the RDB, which is a public facility in Japan, are available to researchers around the world. Copyright © 2005 John Wiley & Sons, Ltd.",
                "authors": [
                    {
                        "name": "Hamada H."
                    },
                    {
                        "name": "Hirose M."
                    },
                    {
                        "name": "Inabe K."
                    },
                    {
                        "name": "Inamoto S."
                    },
                    {
                        "name": "Kimura M."
                    },
                    {
                        "name": "Kujime Y."
                    },
                    {
                        "name": "Liu B."
                    },
                    {
                        "name": "Murata T."
                    },
                    {
                        "name": "Nagamura Y."
                    },
                    {
                        "name": "Nakade K."
                    },
                    {
                        "name": "Nakata H."
                    },
                    {
                        "name": "Obata Y."
                    },
                    {
                        "name": "Pan J."
                    },
                    {
                        "name": "Saito I."
                    },
                    {
                        "name": "Suzuki E."
                    },
                    {
                        "name": "Terashima M."
                    },
                    {
                        "name": "Ugai H."
                    },
                    {
                        "name": "Ugawa Y."
                    },
                    {
                        "name": "Yamasaki T."
                    },
                    {
                        "name": "Yokoyama K.K."
                    }
                ],
                "citationCount": 5,
                "date": "2005-09-01T00:00:00Z",
                "journal": "Journal of Gene Medicine",
                "title": "A database of recombinant viruses and recombinant viral vectors available from the RIKEN DNA bank"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Virology",
            "uri": "http://edamontology.org/topic_0781"
        }
    ],
    "validated": 1
}
