
{
    "credit": [
        {
            "email": "muth@rki.de",
            "name": "Thilo Muth",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "https://github.com/compomics/meta-proteome-analyzer"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence analysis",
                    "uri": "http://edamontology.org/operation_2403"
                }
            ]
        }
    ],
    "labels": {
        "collectionID": [
            "Proteomics"
        ],
        "language": [
            "Java",
            "Python"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Proteomics",
                "uri": "http://edamontology.org/topic_0121"
            },
            {
                "term": "Genomics",
                "uri": "http://edamontology.org/topic_0622"
            },
            {
                "term": "Sequence analysis",
                "uri": "http://edamontology.org/topic_0080"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© 2017 American Chemical Society. Metaproteomics, the mass spectrometry-based analysis of proteins from multispecies samples faces severe challenges concerning data analysis and results interpretation. To overcome these shortcomings, we here introduce the MetaProteomeAnalyzer (MPA) Portable software. In contrast to the original server-based MPA application, this newly developed tool no longer requires computational expertise for installation and is now independent of any relational database system. In addition, MPA Portable now supports state-of-the-art database search engines and a convenient command line interface for high-performance data processing tasks. While search engine results can easily be combined to increase the protein identification yield, an additional two-step workflow is implemented to provide sufficient analysis resolution for further postprocessing steps, such as protein grouping as well as taxonomic and functional annotation. Our new application has been developed with a focus on intuitive usability, adherence to data standards, and adaptation to Web-based workflow platforms. The open source software package can be found at https://github.com/compomics/meta-proteome-analyzer.",
            "authors": [
                "Muth T.",
                "Kohrs F.",
                "Heyer R.",
                "Benndorf D.",
                "Rapp E.",
                "Reichl U.",
                "Martens L.",
                "Renard B.Y."
            ],
            "cit_count": 1,
            "doi": "10.1021/acs.analchem.7b03544",
            "journal": "Analytical Chemistry",
            "title": "MPA Portable: A Stand-Alone Software Package for Analyzing Metaproteome Samples on the Go",
            "year": "2018-01-02"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:mpa_portable",
        "biotoolsID": "mpa_portable",
        "description": "MetaProteomeAnalyzer (MPA) software for analyzing and visualizing MS-based metaproteomics data.",
        "homepage": "https://github.com/compomics/meta-proteome-analyzer",
        "name": "MPA Portable"
    }
}