{
    "additionDate": "2021-01-18T09:08:56Z",
    "biotoolsCURIE": "biotools:fluxer",
    "biotoolsID": "fluxer",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "lobo@umbc.edu",
            "name": "Daniel Lobo",
            "orcidid": "https://orcid.org/0000-0003-4666-6118",
            "typeEntity": "Person"
        }
    ],
    "description": "Fluxer is a web application for the computation and interactive visualization of flux graphs from genome-scale metabolic models. Flux Balance Analysis is used to calculate the flux of the metabolic network, which can then be visualized with spanning trees, k-shortest paths, and complete graphs",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Metabolic network modelling",
                    "uri": "http://edamontology.org/operation_3660"
                },
                {
                    "term": "Network visualisation",
                    "uri": "http://edamontology.org/operation_3925"
                },
                {
                    "term": "Metabolic pathway prediction",
                    "uri": "http://edamontology.org/operation_3929"
                },
                {
                    "term": "Dendrogram visualisation",
                    "uri": "http://edamontology.org/operation_2938"
                },
                {
                    "term": "Natural product identification",
                    "uri": "http://edamontology.org/operation_3803"
                }
            ]
        }
    ],
    "homepage": "https://fluxer.umbc.edu",
    "lastUpdate": "2021-03-11T10:21:31Z",
    "name": "Fluxer",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/NAR/GKAA409",
            "metadata": {
                "abstract": "© 2020 Oxford University Press. All rights reserved.Next-generation sequencing has paved the way for the reconstruction of genome-scale metabolic networks as a powerful tool for understanding metabolic circuits in any organism. However, the visualization and extraction of knowledge from these large networks comprising thousands of reactions and metabolites is a current challenge in need of userfriendly tools. Here we present Fluxer (https://fluxer. umbc.edu), a free and open-access novel web application for the computation and visualization of genome-scalemetabolic flux networks. Any genomescale model based on the Systems Biology Markup Language can be uploaded to the tool, which automatically performs Flux Balance Analysis and computes different flux graphs for visualization and analysis. The major metabolic pathways for biomass growth or for biosynthesis of any metabolite can be interactively knocked-out, analyzed and visualized as a spanning tree, dendrogram or complete graph using different layouts. In addition, Fluxer can compute and visualize the k-shortest metabolic paths between any two metabolites or reactions to identify the main metabolic routes between two compounds of interest. The web application includes >80 wholegenome metabolic reconstructions of diverse organisms from bacteria to human, readily available for exploration. Fluxer enables the efficient analysis and visualization of genome-scale metabolic models toward the discovery of key metabolic pathways.",
                "authors": [
                    {
                        "name": "Hari A."
                    },
                    {
                        "name": "Lobo D."
                    }
                ],
                "citationCount": 4,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "Fluxer: A web application to compute, analyze and visualize genome-scale metabolic flux networks"
            },
            "pmcid": "PMC7319574",
            "pmid": "32442279"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        },
        {
            "term": "Endocrinology and metabolism",
            "uri": "http://edamontology.org/topic_3407"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Fluxomics",
            "uri": "http://edamontology.org/topic_3955"
        }
    ]
}