{
    "additionDate": "2018-05-21T19:53:54Z",
    "biotoolsCURIE": "biotools:hydpred",
    "biotoolsID": "hydpred",
    "credit": [
        {
            "email": "lishuyan@lzu.edu.cn",
            "name": "Shuyan Li",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Novel method for the identification of protein hydroxylation sites that reveals new insights into human inherited disease.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://lishuyan.lzu.edu.cn/hydpred/Document.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein feature detection",
                    "uri": "http://edamontology.org/operation_3092"
                }
            ]
        }
    ],
    "homepage": "http://lishuyan.lzu.edu.cn/hydpred/",
    "lastUpdate": "2018-12-10T12:58:58Z",
    "name": "HydPred",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1039/C5MB00681C",
            "metadata": {
                "abstract": "© The Royal Society of Chemistry 2016.The disruption of protein hydroxylation is highly associated with several serious diseases and consequently the identification of protein hydroxylation sites has attracted significant attention recently. Here, we report the development of an improved method, called HydPred, to identify protein hydroxylation sites (hydroxyproline and hydroxylysine) based on the synthetic minority over-sampling technique (SMOTE), the random forest (RF) algorithm and four blocks of newly composed features that are derived from the protein primary sequence. The HydPred method achieved the best prediction performance reported until now with Matthew's correlation coefficient values of 0.770 and 0.857 for hydroxyproline and hydroxylysine, respectively, according to jack-knife cross-validation. This represents an improvement of 8% for hydroxyproline and 19% for hydroxylysine compared to the best results of available predictors. The prediction performance of HydPred for the external validation of hydroxyproline and hydroxylysine was also improved compared with other published methods. We subsequently applied HydPred to study the association of disruption of hydroxylation sites with human inherited disease. The analyses suggested that the loss of hydroxylation sites is more likely to cause disease instead of the gain of hydroxylation sites and 52 different human inherited diseases were found to be highly associated with the loss of hydroxylation sites. Therefore, HydPred represents a new strategy to discover the molecular basis of pathogenesis associated with abnormal hydroxylation. HydPred is now available online as a user-friendly web server at http://lishuyan.lzu.edu.cn/hydpred/.",
                "authors": [
                    {
                        "name": "Li S."
                    },
                    {
                        "name": "Lu J."
                    },
                    {
                        "name": "Li J."
                    },
                    {
                        "name": "Chen X."
                    },
                    {
                        "name": "Yao X."
                    },
                    {
                        "name": "Xi L."
                    }
                ],
                "citationCount": 5,
                "date": "2016-01-01T00:00:00Z",
                "journal": "Molecular BioSystems",
                "title": "HydPred: A novel method for the identification of protein hydroxylation sites that reveals new insights into human inherited disease"
            },
            "pmid": "26661679"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Protein sites, features and motifs",
            "uri": "http://edamontology.org/topic_3510"
        },
        {
            "term": "Human genetics",
            "uri": "http://edamontology.org/topic_3574"
        }
    ],
    "validated": 1
}