{
    "additionDate": "2017-05-16T13:43:35Z",
    "biotoolsCURIE": "biotools:treejuxtaposer",
    "biotoolsID": "treejuxtaposer",
    "credit": [
        {
            "name": "Bug report",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://sourceforge.net/p/olduvai/bugs/"
        },
        {
            "name": "Mailing list",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://sourceforge.net/p/olduvai/mailman/"
        }
    ],
    "description": "TreeJuxtaposer is a free software tool that allows a visual comparison of two trees in Newick format (phylogenies, taxonomies, gene trees, etc.). It can work with trees having up to 500,000 nodes, and automatically calculates and marks the differences.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://olduvai.sourceforge.net/tj/documentation.shtml"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Phylogenetic tree comparison",
                    "uri": "http://edamontology.org/operation_0325"
                }
            ]
        }
    ],
    "homepage": "http://olduvai.sourceforge.net/",
    "language": [
        "Java"
    ],
    "lastUpdate": "2018-12-10T12:58:56Z",
    "name": "TreeJuxtaposer",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "doi": "10.1145/882262.882291",
            "metadata": {
                "abstract": "Structural comparison of large trees is a difficult task that is only partially supported by current visualization techniques, which are mainly designed for browsing. We present TreeJuxtaposer, a system designed to support the comparison task for large trees of several hundred thousand nodes. We introduce the idea of \"guaranteed visibility\", where highlighted areas are treated as landmarks that must remain visually apparent at all times. We propose a new methodology for detailed structural comparison between two trees and provide a new nearly-linear algorithm for computing the best corresponding node from one tree to another. In addition, we present a new rectilinear Focus+Context technique for navigation that is well suited to the dynamic linking of side-by-side views while guaranteeing landmark visibility and constant frame rates. These three contributions result in a system delivering a fluid exploration experience that scales both in the size of the dataset and the number of pixels in the display. We have based the design decisions for our system on the needs of a target audience of biologists who must understand the structural details of many phylogenetic, or evolutionary, trees. Our tool is also useful in many other application domains where tree comparison is needed, ranging from network management to call graph optimization to genealogy. © 2003 ACM.",
                "authors": [
                    {
                        "name": "Guimbretiere F."
                    },
                    {
                        "name": "Munzner T."
                    },
                    {
                        "name": "Tasiran S."
                    },
                    {
                        "name": "Zhang L."
                    },
                    {
                        "name": "Zhou Y."
                    }
                ],
                "citationCount": 126,
                "date": "2003-07-01T00:00:00Z",
                "journal": "ACM Transactions on Graphics",
                "title": "TreeJuxtaposer: Tree comparison using Focus+Context with guaranteed visibility"
            }
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Phylogeny",
            "uri": "http://edamontology.org/topic_0084"
        },
        {
            "term": "Taxonomy",
            "uri": "http://edamontology.org/topic_0637"
        }
    ],
    "validated": 1
}
