
{
    "credit": [
        {
            "email": "mako@nmr.mpibpc.mpg.de",
            "name": "Martin Kollmar",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://waggawagga.motorprotein.de/request/contact"
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://waggawagga.motorprotein.de/request/doc"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Protein sequence analysis",
                    "uri": "http://edamontology.org/operation_2479"
                },
                {
                    "term": "Protein structure prediction",
                    "uri": "http://edamontology.org/operation_0474"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Ruby"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Command-line tool",
            "Web application"
        ],
        "topic": [
            {
                "term": "Sequence analysis",
                "uri": "http://edamontology.org/topic_0080"
            },
            {
                "term": "Protein sites, features and motifs",
                "uri": "http://edamontology.org/topic_3510"
            },
            {
                "term": "Protein structure analysis",
                "uri": "http://edamontology.org/topic_2814"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://www.mybiosoftware.com/waggawagga-coiled-coil-and-single-alpha-helix-prediction-for-protein-sequences.html"
        }
    ],
    "publication": [
        {
            "abstract": "© The Author 2014. Published by Oxford University Press. All rights reserved. Waggawagga is a web-based tool for the comparative visualization of coiled-coil predictions and the detection of stable single a-helices (SAH domains). Overview schemes show the predicted coiled-coil regions found in the query sequence and provide sliders, which can be used to select segments for detailed helical wheel and helical net views. A window-based score has been developed to predict SAH domains. Export to several bitmap and vector graphics formats is supported.",
            "authors": [
                "Simm D.",
                "Hatje K.",
                "Kollmar M."
            ],
            "cit_count": 7,
            "journal": "Bioinformatics",
            "pmid": "25338722",
            "title": "Waggawagga: Comparative visualization of coiled-coil predictions and detection of stable single α-helices (SAH domains)",
            "type": "Primary",
            "year": "2015-03-01"
        },
        {
            "abstract": "© 2018 Simm, Kollmar. This is an open ccess article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and eproduction in any medium, provided the original author and source are credited. Stable single-Alpha helices (SAH-domains) function as rigid connectors and constant force springs between structural domains, and can provide contact surfaces for protein-protein and protein-RNA interactions. SAH-domains mainly consist of charged amino acids and are monomeric and stable in polar solutions, characteristics which distinguish them from coiledcoil domains and intrinsically disordered regions. Although the number of reported SAHdomains is steadily increasing, genome-wide analyses of SAH-domains in eukaryotic genomes are still missing. Here, we present Waggawagga-CLI, a command-line tool for predicting and analysing SAH-domains in protein sequence datasets. Using Waggawagga-CLI we predicted SAH-domains in 24 datasets from eukaryotes across the tree of life. SAHdomains were predicted in 0.5 to 3.5% of the protein-coding content per species. SAHdomains are particularly present in longer proteins supporting their function as structural building block in multi-domain proteins. In human, SAH-domains are mainly used as alternative building blocks not being present in all transcripts of a gene. Gene ontology analysis showed that yeast proteins with SAH-domains are particular enriched in macromolecular complex subunit organization, cellular component biogenesis and RNA metabolic processes, and that they have a strong nuclear and ribonucleoprotein complex localization and function in ribosome and nucleic acid binding. Human proteins with SAH-domains have roles in all types of RNA processing and cytoskeleton organization, and are predicted to function in RNA binding, protein binding involved in cell and cell-cell adhesion, and cytoskeletal protein binding. Waggawagga-CLI allows the user to adjust the stabilizing and destabilizing contribution of amino acid interactions in i,i+3 and i,i+4 spacings, and provides extensive flexibility for user-designed analyses.",
            "authors": [
                "Simm D.",
                "Kollmar M."
            ],
            "cit_count": 1,
            "doi": "10.1371/journal.pone.0191924",
            "journal": "PLoS ONE",
            "title": "Waggawagga-CLI: A command-line tool for predicting stable single α-helices (SAHdomains), and the SAH-domain distribution across eukaryotes",
            "type": "Primary",
            "year": "2018-02-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:waggawagga",
        "biotoolsID": "waggawagga",
        "description": "Web-based and command-line tool for the comparative visualization of coiled-coil predictions and the detection of stable single a-helices (SAH domains).",
        "homepage": "http://waggawagga.motorprotein.de/",
        "name": "Waggawagga"
    }
}