{
    "additionDate": "2019-12-18T08:05:57Z",
    "biotoolsCURIE": "biotools:IMGT_JunctionAnalysis",
    "biotoolsID": "IMGT_JunctionAnalysis",
    "cost": "Free of charge (with restrictions)",
    "credit": [
        {
            "email": "veronique.giudicelli@igh.cnrs.fr",
            "name": "Véronique Giudicelli",
            "typeEntity": "Person"
        },
        {
            "email": "patrice.duroux@igh.cnrs.fr",
            "name": "Patrice Duroux",
            "typeEntity": "Person"
        },
        {
            "email": "marie-paule.lefranc@igh.cnrs.fr",
            "name": "Marie-Paule Lefranc",
            "typeEntity": "Person"
        },
        {
            "email": "sofia.kossida@igh.cnrs.fr",
            "name": "Sofia Kossida",
            "typeEntity": "Person"
        }
    ],
    "description": "IMGT/JunctionAnalysis is the IMGT® tool for the analysis of the nucleotide sequences of the V-J and V-D-J junctions of the variable domains of the immunoglobulins (IG) or antibodies and T cell receptors (TR).\nAnalysis is based on the IMGT-ONTOLOGY concepts.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://www.imgt.org/IMGT_jcta/user_guide"
        }
    ],
    "editPermission": {
        "authors": [
            "skossida",
            "pduroux",
            "Joumana",
            "geraldine.folch",
            "vgiudicelli"
        ],
        "type": "group"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Nucleic acid sequence",
                        "uri": "http://edamontology.org/data_2977"
                    },
                    "format": [
                        {
                            "term": "FASTA-like (text)",
                            "uri": "http://edamontology.org/format_2200"
                        }
                    ]
                }
            ],
            "operation": [
                {
                    "term": "Sequence alignment analysis (conservation)",
                    "uri": "http://edamontology.org/operation_0448"
                },
                {
                    "term": "Nucleic acid sequence analysis",
                    "uri": "http://edamontology.org/operation_2478"
                },
                {
                    "term": "Sequence alignment",
                    "uri": "http://edamontology.org/operation_0292"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Sequence alignment",
                        "uri": "http://edamontology.org/data_0863"
                    },
                    "format": [
                        {
                            "term": "HTML",
                            "uri": "http://edamontology.org/format_2331"
                        }
                    ]
                },
                {
                    "data": {
                        "term": "Sequence alignment report",
                        "uri": "http://edamontology.org/data_0867"
                    },
                    "format": [
                        {
                            "term": "HTML",
                            "uri": "http://edamontology.org/format_2331"
                        }
                    ]
                }
            ]
        }
    ],
    "homepage": "http://www.imgt.org/IMGT_jcta",
    "language": [
        "Java"
    ],
    "lastUpdate": "2020-01-25T00:05:08Z",
    "maturity": "Mature",
    "name": "IMGT JunctionAnalysis",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "vgiudicelli",
    "publication": [
        {
            "metadata": {
                "abstract": "Motivation: To create the enormous diversity of 1012 immunoglobulins (IG) and T cell receptors (TR) per individual, very complex mechanisms occur at the DNA level: the combinatorial diversity results from the junction of the variable (V), diversity (D) and joining (J) genes; the N-diversity represents the addition at random of nucleotides not encoded in the genome; and somatic hypermutations occur in IG rearranged sequences. The accurate annotation of the junction between V, D, J genes in rearranged IG and TR sequences represents therefore a huge challenge by its uniqueness and complexity. We developed IMGT/JunctionAnalysis to analyse automatically in detail the IG and TR junctions, according to the IMGT Scientific chart rules, based on the IMGT-ONTOLOGY concepts. Results: IMGT/JunctionAnalysis is the first tool forthe detailed analysis of the IG and TR complex V-J and V-D-J JUNCTION(s). It delimits, at the nucleotide level, the genes resulting from the combinatorial diversity. It identifies accurately the D genes in the junctions of IG heavy (IGH), TR beta (TRB) and delta (TRD) chains. It delimits the palindromic P-REGION(s) and the N-REGION(s) resulting from the N-diversity. It evaluates the number of somatic hypermutations for each gene, within the JUNCTION. IMGT/JunctionAnalysis is capable of analysing, in a single run, an unlimited number of junctions from the same species (currently human or mouse) and from the same locus. Availability: IMGT/JunctionAnalysis is available from the IMGT Home page at http://imgt.cines.fr. © Oxford University Press 2004; all rights reserved.",
                "authors": [
                    {
                        "name": "Monod M.Y."
                    },
                    {
                        "name": "Giudicelli V."
                    },
                    {
                        "name": "Chaume D."
                    },
                    {
                        "name": "Lefranc M.-P."
                    }
                ],
                "citationCount": 217,
                "date": "2004-12-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "IMGT/JunctionAnalysis: The first tool for the analysis of the immunoglobulin and T cell receptor complex V-J and V-D-J JUNCTIONs"
            },
            "pmid": "15262823"
        },
        {
            "pmid": "21632777"
        },
        {
            "metadata": {
                "abstract": "© The Author(s) 2014. Published by Oxford University Press on behalf of Nucleic Acids Research.IMGT, the international ImMunoGeneTics information system (http://www.imgt.org) is the global reference in immunogenetics and immunoinformatics. By its creation in 1989 by Marie-Paule Lefranc (Université de Montpellier and CNRS), IMGT marked the advent of immunoinformatics, which emerged at the interface between immunogenetics and bioinformatics. IMGT is specialized in the immunoglobulins (IG) or antibodies, T cell receptors (TR), major histocompatibility (MH) and proteins of the IgSF and MhSF superfamilies. IMGT is built on the IMGTONTOLOGY axioms and concepts, which bridged the gap between genes, sequences and 3D structures. The concepts include the IMGTR standardized keywords (identification), IMGTR standardized labels (description), IMGTR standardized nomenclature (classification), IMGT unique numbering and IMGT Colliers de Perles (numerotation). IMGTR comprises 7 databases, 17 online tools and 15 000 pages of web resources, and provides a high-quality and integrated system for analysis of the genomic and expressed IG and TR repertoire of the adaptive immune responses, including NGS high-throughput data. Tools and databases are used in basic, veterinary and medical research, in clinical applications (mutation analysis in leukemia and lymphoma) and in antibody engineering and humanization. The IMGT/mAb-DB interface was developed for therapeutic antibodies and fusion proteins for immunological applications (FPIA). IMGTR is freely available at http://www.imgt.org.",
                "authors": [
                    {
                        "name": "Lefranc M.-P."
                    },
                    {
                        "name": "Giudicelli V."
                    },
                    {
                        "name": "Duroux P."
                    },
                    {
                        "name": "Jabado-Michaloud J."
                    },
                    {
                        "name": "Folch G."
                    },
                    {
                        "name": "Aouinti S."
                    },
                    {
                        "name": "Carillon E."
                    },
                    {
                        "name": "Duvergey H."
                    },
                    {
                        "name": "Houles A."
                    },
                    {
                        "name": "Paysan-Lafosse T."
                    },
                    {
                        "name": "Hadi-Saljoqi S."
                    },
                    {
                        "name": "Sasorith S."
                    },
                    {
                        "name": "Lefranc G."
                    },
                    {
                        "name": "Kossida S."
                    }
                ],
                "citationCount": 149,
                "date": "2015-01-28T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "IMGT R, the international ImMunoGeneTics information system R 25 years on"
            },
            "pmid": "25378316"
        }
    ],
    "relation": [
        {
            "biotoolsID": "imgt",
            "type": "includedIn"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Immunoinformatics",
            "uri": "http://edamontology.org/topic_3948"
        },
        {
            "term": "Immunogenetics",
            "uri": "http://edamontology.org/topic_3930"
        }
    ]
}