{
    "additionDate": "2021-11-29T10:57:35.287428Z",
    "biotoolsCURIE": "biotools:rob-men",
    "biotoolsID": "rob-men",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "virginia.chiocchia@ispm.unibe.ch",
            "name": "Virginia Chiocchia",
            "orcidid": "https://orcid.org/0000-0002-6196-3308",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Tool to assess risk of bias due to missing evidence in network meta-analysis (ROB-MEN).",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                }
            ]
        }
    ],
    "homepage": "https://cinema.ispm.unibe.ch/rob-men/",
    "lastUpdate": "2024-11-24T20:15:33.182465Z",
    "name": "ROB-MEN",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1186/s12916-021-02166-3",
            "metadata": {
                "abstract": "Background: Selective outcome reporting and publication bias threaten the validity of systematic reviews and meta-analyses and can affect clinical decision-making. A rigorous method to evaluate the impact of this bias on the results of network meta-analyses of interventions is lacking. We present a tool to assess the Risk Of Bias due to Missing Evidence in Network meta-analysis (ROB-MEN). Methods: ROB-MEN first evaluates the risk of bias due to missing evidence for each of the possible pairwise comparison that can be made between the interventions in the network. This step considers possible bias due to the presence of studies with unavailable results (within-study assessment of bias) and the potential for unpublished studies (across-study assessment of bias). The second step combines the judgements about the risk of bias due to missing evidence in pairwise comparisons with (i) the contribution of direct comparisons to the network meta-analysis estimates, (ii) possible small-study effects evaluated by network meta-regression, and (iii) any bias from unobserved comparisons. Then, a level of “low risk”, “some concerns”, or “high risk” for the bias due to missing evidence is assigned to each estimate, which is our tool’s final output. Results: We describe the methodology of ROB-MEN step-by-step using an illustrative example from a published NMA of non-diagnostic modalities for the detection of coronary artery disease in patients with low risk acute coronary syndrome. We also report a full application of the tool on a larger and more complex published network of 18 drugs from head-to-head studies for the acute treatment of adults with major depressive disorder. Conclusions: ROB-MEN is the first tool for evaluating the risk of bias due to missing evidence in network meta-analysis and applies to networks of all sizes and geometry. The use of ROB-MEN is facilitated by an R Shiny web application that produces the Pairwise Comparisons and ROB-MEN Table and is incorporated in the reporting bias domain of the CINeMA framework and software.",
                "authors": [
                    {
                        "name": "Chiocchia V."
                    },
                    {
                        "name": "Cipriani A."
                    },
                    {
                        "name": "Egger M."
                    },
                    {
                        "name": "Furukawa T.A."
                    },
                    {
                        "name": "Higgins J.P.T."
                    },
                    {
                        "name": "Nikolakopoulou A."
                    },
                    {
                        "name": "Page M.J."
                    },
                    {
                        "name": "Papakonstantinou T."
                    },
                    {
                        "name": "Salanti G."
                    },
                    {
                        "name": "Siontis G.C.M."
                    }
                ],
                "citationCount": 43,
                "date": "2021-12-01T00:00:00Z",
                "journal": "BMC Medicine",
                "title": "ROB-MEN: a tool to assess risk of bias due to missing evidence in network meta-analysis"
            },
            "pmcid": "PMC8609747",
            "pmid": "34809639",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Public health and epidemiology",
            "uri": "http://edamontology.org/topic_3305"
        },
        {
            "term": "Safety sciences",
            "uri": "http://edamontology.org/topic_3377"
        }
    ]
}
