{
    "accessibility": "Open access",
    "additionDate": "2019-05-31T12:10:47Z",
    "biotoolsCURIE": "biotools:Plastid_Genome_Annotator",
    "biotoolsID": "Plastid_Genome_Annotator",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "quxiaojian@sdnu.edu.cn",
            "name": "Xiao-Jian Qu",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Software package for rapid, accurate, and flexible batch annotation of plastomes.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                }
            ]
        }
    ],
    "homepage": "https://github.com/quxiaojian/PGA",
    "language": [
        "Perl"
    ],
    "lastUpdate": "2020-06-16T10:55:22Z",
    "license": "GPL-3.0",
    "maturity": "Mature",
    "name": "Plastid Genome Annotator",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "Ruta",
    "publication": [
        {
            "doi": "10.1186/s13007-019-0435-7",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Plastome (plastid genome) sequences provide valuable information for understanding the phylogenetic relationships and evolutionary history of plants. Although the rapid development of high-throughput sequencing technology has led to an explosion of plastome sequences, annotation remains a significant bottleneck for plastomes. User-friendly batch annotation of multiple plastomes is an urgent need. Results: We introduce Plastid Genome Annotator (PGA), a standalone command line tool that can perform rapid, accurate, and flexible batch annotation of newly generated target plastomes based on well-annotated reference plastomes. In contrast to current existing tools, PGA uses reference plastomes as the query and unannotated target plastomes as the subject to locate genes, which we refer to as the reverse query-subject BLAST search approach. PGA accurately identifies gene and intron boundaries as well as intron loss. The program outputs GenBank-formatted files as well as a log file to assist users in verifying annotations. Comparisons against other available plastome annotation tools demonstrated the high annotation accuracy of PGA, with little or no post-annotation verification necessary. Likewise, we demonstrated the flexibility of reference plastomes within PGA by annotating the plastome of Rosa roxburghii using that of Amborella trichopoda as a reference. The program, user manual and example data sets are freely available at https://github.com/quxiaojian/PGA. Conclusions: PGA facilitates rapid, accurate, and flexible batch annotation of plastomes across plants. For projects in which multiple plastomes are generated, the time savings for high-quality plastome annotation are especially significant.",
                "authors": [
                    {
                        "name": "Qu X.-J."
                    },
                    {
                        "name": "Moore M.J."
                    },
                    {
                        "name": "Li D.-Z."
                    },
                    {
                        "name": "Yi T.-S."
                    }
                ],
                "citationCount": 236,
                "date": "2019-05-21T00:00:00Z",
                "journal": "Plant Methods",
                "title": "PGA: A software package for rapid, accurate, and flexible batch annotation of plastomes"
            },
            "pmcid": "PMC6528300",
            "pmid": "31139240",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        }
    ]
}