{
    "additionDate": "2021-01-18T11:11:39Z",
    "biotoolsCURIE": "biotools:silencerdb",
    "biotoolsID": "silencerdb",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "ruijiang@tsinghua.edu.cn",
            "name": "Rui Jiang",
            "typeEntity": "Person"
        }
    ],
    "description": "a comprehensive database of silencers.\n\nA deep convolutional neural network for the accurate prediction of silencers.\n\nSilencers, which were first identified around 30 years ago as sequence-specific elements that induce negative effect on the transcription of particular genes, have started to receive growing attention. To facilitate the studies of silencers and their potential roles in transcriptional control during normal development and disease, we developed this comprehensive database of silencers, SilencerDB.\n\nFor accurate classification of silencers, we propose a CNN-based model named DeepSilencer.\n\n$ pip install tensorflow-gpu==1.15.2 #pip install tensorflow==1.15.2.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Transcriptional regulatory element prediction",
                    "uri": "http://edamontology.org/operation_0438"
                },
                {
                    "term": "Validation",
                    "uri": "http://edamontology.org/operation_2428"
                },
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                }
            ]
        }
    ],
    "homepage": "http://health.tsinghua.edu.cn/silencerdb/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-02-18T17:35:32Z",
    "license": "Apache-2.0",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "http://bioinfo.au.tsinghua.edu.cn/silencerdb/"
        },
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/xy-chen16/DeepSilencer"
        }
    ],
    "name": "SilencerDB",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1093/NAR/GKAA839",
            "metadata": {
                "abstract": "© 2021 The Author(s) 2020. Published by Oxford University Press on behalf of Nucleic Acids Research.Gene regulatory elements, including promoters, enhancers, silencers, etc., control transcriptional programs in a spatiotemporal manner. Though these elements are known to be able to induce either positive or negative transcriptional control, the community has been mostly studying enhancers which amplify transcription initiation, with less emphasis given to silencers which repress gene expression. To facilitate the study of silencers and the investigation of their potential roles in transcriptional control, we developed SilencerDB (http://health.tsinghua.edu.cn/silencerdb/), a comprehensive database of silencers by manually curating silencers from 2300 published articles. The current version, SilencerDB 1.0, contains (1) 33 060 validated silencers from experimental methods, and (ii) 5 045 547 predicted silencers from state-of-the-art machine learning methods. The functionality of SilencerDB includes (a) standardized categorization of silencers in a tree-structured class hierarchy based on species, organ, tissue and cell line and (b) comprehensive annotations of silencers with the nearest gene and potential regulatory genes. SilencerDB, to the best of our knowledge, is the first comprehensive database at this scale dedicated to silencers, with reliable annotations and user-friendly interactive database features. We believe this database has the potential to enable advanced understanding of silencers in regulatory mechanisms and to empower researchers to devise diverse applications of silencers in disease development.",
                "authors": [
                    {
                        "name": "Zeng W."
                    },
                    {
                        "name": "Chen S."
                    },
                    {
                        "name": "Cui X."
                    },
                    {
                        "name": "Chen X."
                    },
                    {
                        "name": "Gao Z."
                    },
                    {
                        "name": "Jiang R."
                    }
                ],
                "citationCount": 2,
                "date": "2021-01-08T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "SilencerDB: A comprehensive database of silencers"
            },
            "pmid": "33045745"
        }
    ],
    "topic": [
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Gene regulation",
            "uri": "http://edamontology.org/topic_0204"
        },
        {
            "term": "Epigenomics",
            "uri": "http://edamontology.org/topic_3173"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        }
    ]
}