
{
    "credit": [
        {
            "email": "ppdock@tau.ac.il",
            "name": "PharmaGist Administrator",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://bioinfo3d.cs.tau.ac.il/pharma/help.html"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Data handling",
                    "uri": "http://edamontology.org/operation_2409"
                },
                {
                    "term": "Protein-ligand docking",
                    "uri": "http://edamontology.org/operation_0482"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Medicinal chemistry",
                "uri": "http://edamontology.org/topic_0209"
            },
            {
                "term": "Small molecules",
                "uri": "http://edamontology.org/topic_0154"
            },
            {
                "term": "Molecular interactions, pathways and networks",
                "uri": "http://edamontology.org/topic_0602"
            },
            {
                "term": "Protein folding, stability and design",
                "uri": "http://edamontology.org/topic_0130"
            },
            {
                "term": "Structure prediction",
                "uri": "http://edamontology.org/topic_0082"
            }
        ]
    },
    "publication": [
        {
            "abstract": "Predicting molecular interactions is a major goal in rational drug design. Pharmacophore, which is the spatial arrangement of features that is essential for a molecule to interact with a specific target receptor, is an important model for achieving this goal. We present a freely available web server, named PharmaGist, for pharmacophore detection. The employed method is ligand based. Namely, it does not require the structure of the target receptor. Instead, the input is a set of structures of drug-like molecules that are known to bind to the receptor. The output consists of candidate pharmacophores that are computed by multiple flexible alignment of the input ligands. The method handles the flexibility of the input ligands explicitly and in deterministic manner within the alignment process. PharmaGist is also highly efficient, where a typical run with up to 32 drug-like molecules takes seconds to a few minutes on a stardard PC. Another important characteristic is the capability of detecting pharmacophores shared by different subsets of input molecules. This capability is a key advantage when the ligands belong to different binding modes or when the input contains outliers. The webserver has a user-friendly interface available at http://bioinfo3d.cs.tau.ac.il/PharmaGist.",
            "authors": [
                "Schneidman-Duhovny D.",
                "Dror O.",
                "Inbar Y.",
                "Nussinov R.",
                "Wolfson H.J."
            ],
            "cit_count": 86,
            "journal": "Nucleic acids research",
            "pmid": "18424800",
            "title": "PharmaGist: a webserver for ligand-based pharmacophore detection.",
            "year": "2008-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:pharmagist",
        "biotoolsID": "pharmagist",
        "description": "PharmaGist is a web server for detecting pharmacophores or the spatial arrangement of features that enables a molecule to interact with a specific target receptor. Users input a set of structures of molecules that bind with the receptor for outputs of candidate pharmacophores that can be used in rational drug design.",
        "homepage": "http://bioinfo3d.cs.tau.ac.il/PharmaGist",
        "name": "PharmaGist"
    }
}