{
    "additionDate": "2021-01-18T12:30:19Z",
    "biotoolsCURIE": "biotools:bigmpi4py",
    "biotoolsID": "bigmpi4py",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "dalcinl@gmail.com",
            "name": "Lisandro Dalcin",
            "typeEntity": "Person",
            "typeRole": [
                "Developer"
            ]
        }
    ],
    "description": "BigMPI4py is a Python module that wraps mpi4py, supporting object sizes beyond this boundary. BigMPI4py automatically determines the optimal object distribution strategy, and uses vectorized methods, achieving higher parallelization efficiency. BigMPI4py facilitates the implementation of Python for Big Data applications in multicore workstations and High Performance Computer systems. We use BigMPI4py to speed-up the search for germ line specific de novo DNA methylated unmethylated motifs from the 59 whole genome bisulfite sequencing DNA methylation samples from 27 human tissues of the ENCODE project.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://mpi4py.readthedocs.io/en/stable/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "homepage": "https://gitlab.com/alexmascension/bigmpi4py",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-02-03T19:43:53Z",
    "license": "GPL-3.0",
    "name": "BigMPI4py",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1109/TCBB.2020.3043979",
            "metadata": {
                "abstract": "IEEEParallelization in Python integrates Message Passing Interface via the mpi4py module. Since mpi4py does not support parallelization of objects greater than <formula><tex>${2^{31}}$</tex></formula> bytes, we developed BigMPI4py, a Python module that wraps mpi4py, supporting object sizes beyond this boundary. BigMPI4py automatically determines the optimal object distribution strategy, and uses vectorized methods, achieving higher parallelization efficiency. BigMPI4py facilitates the implementation of Python for Big Data applications in multicore workstations and High Performance Computer systems. We use BigMPI4py to speed-up the search for germ line specific de novo DNA methylated/unmethylated motifs from the 59 whole genome bisulfite sequencing DNA methylation samples from 27 human tissues of the ENCODE project. We developed a parallel implementation of the Kruskall-Wallis test to find CpGs with differential methylation across germ layers. The parallel evaluation of the significance of 55 million CpG achieved a 22x speedup with 25 cores allowing us an efficient identification of a set of hypermethylated genes in ectoderm and mesoderm-related tissues, and another set in endoderm-related tissues and finally, the discovery of germ layer specific DNA demethylation motifs. Our results point out that DNA methylation signal provide a higher degree of information for the demethylated state than for the methylated state.",
                "authors": [
                    {
                        "name": "Arauzo-Bravo M.J."
                    },
                    {
                        "name": "Ascension A.M."
                    }
                ],
                "citationCount": 1,
                "date": "2020-01-01T00:00:00Z",
                "journal": "IEEE/ACM Transactions on Computational Biology and Bioinformatics",
                "title": "BigMPI4py: Python module for parallelization of Big Data objects discloses germ layer specific DNA demethylation motifs"
            },
            "pmid": "33301409"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        },
        {
            "term": "Methylated DNA immunoprecipitation",
            "uri": "http://edamontology.org/topic_3674"
        },
        {
            "term": "Sequence sites, features and motifs",
            "uri": "http://edamontology.org/topic_0160"
        }
    ]
}
