{
    "additionDate": "2021-10-10T14:49:47.448637Z",
    "biotoolsCURIE": "biotools:mircorrnet",
    "biotoolsID": "mircorrnet",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "malik.yousef@gmail.com",
            "name": "Malik Yousef",
            "orcidid": "https://orcid.org/0000-0001-8780-6303",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "miRcorrNet is a machine learning-based integration of miRNA and mRNA expression profiles, combined with feature grouping and ranking. This tool allows you to make an integrated mRNA - miRNA profiles analysis. Via using this document you can easily execute the steps and you can obtain the results. Using this document you can easily repeat the experiments. miRcorrNet uses 2 different data sheets with same control-case column. It means you should have same samples in one column which should be both in mRNA and miRNA data sheet. In this study we used KNIME analytics platform. Therefore, the data is stored in \".table\" extension files.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene expression profiling",
                    "uri": "http://edamontology.org/operation_0314"
                },
                {
                    "term": "miRNA expression analysis",
                    "uri": "http://edamontology.org/operation_3792"
                },
                {
                    "term": "miRNA target prediction",
                    "uri": "http://edamontology.org/operation_0463"
                }
            ]
        }
    ],
    "homepage": "https://github.com/malikyousef/miRcorrNet",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-10-10T14:49:47.451100Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/malikyousef/miRcorrNet/issues"
        }
    ],
    "name": "miRcorrNet",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.7717/PEERJ.11458",
            "metadata": {
                "abstract": "© 2021 Orozco-Arias et al.A better understanding of disease development and progression mechanisms at the molecular level is critical both for the diagnosis of a disease and for the development of therapeutic approaches. The advancements in high throughput technologies allowed to generate mRNA and microRNA (miRNA) expression profiles; and the integrative analysis of these profiles allowed to uncover the functional effects of RNA expression in complex diseases, such as cancer. Several researches attempt to integrate miRNA and mRNA expression profiles using statistical methods such as Pearson correlation, and then combine it with enrichment analysis. In this study, we developed a novel tool called miRcorrNet, which performs machine learning-based integration to analyze miRNA and mRNA gene expression profiles. miRcorrNet groups mRNAs based on their correlation to miRNA expression levels and hence it generates groups of target genes associated with each miRNA. Then, these groups are subject to a rank function for classification. We have evaluated our tool using miRNA and mRNA expression profiling data downloaded from The Cancer Genome Atlas (TCGA), and performed comparative evaluation with existing tools. In our experiments we show that miRcorrNet performs as good as other tools in terms of accuracy (reaching more than 95% AUC value). Additionally, miRcorrNet includes ranking steps to separate two classes, namely case and control, which is not available in other tools. We have also evaluated the performance of miRcorrNet using a completely independent dataset. Moreover, we conducted a comprehensive literature search to explore the biological functions of the identified miRNAs. We have validated our significantly identified miRNA groups against known databases, which yielded about 90% accuracy. Our results suggest that miRcorrNet is able to accurately prioritize pan-cancer regulating high-confidence miRNAs. miRcorrNet tool and all other supplementary files are available at https://github.com/ malikyousef/miRcorrNet.",
                "authors": [
                    {
                        "name": "Bakir-Gungor B."
                    },
                    {
                        "name": "Eischen C.M."
                    },
                    {
                        "name": "Goy G."
                    },
                    {
                        "name": "Jabeer A."
                    },
                    {
                        "name": "Mitra R."
                    },
                    {
                        "name": "Yousef M."
                    }
                ],
                "citationCount": 1,
                "date": "2021-05-01T00:00:00Z",
                "journal": "PeerJ",
                "title": "Mircorrnet: Machine learning-based integration of mirna and mrna expression profiles, combined with feature grouping and ranking"
            },
            "pmcid": "PMC8140596",
            "pmid": "34055490",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ]
}
