{
    "additionDate": "2021-01-18T07:01:23Z",
    "biotoolsCURIE": "biotools:normgam",
    "biotoolsID": "normgam",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "zheng.wang@miami.edu",
            "name": "Zheng Wang",
            "typeEntity": "Person"
        }
    ],
    "description": "An R package to remove systematic biases in genome architecture mapping data.\n\nnormGAM is an R package for normalizing genome architecture mapping (GAM) data. It implements five normalization methods, including normalized linkage disequilibrium (NLD), vanilla coverage (VC), sequential component normalization (SCN), iterative correction and eigenvector decomposition (ICE), and Knight-Ruiz 2-norm (KR2). The normalization procedure can remove known and unknown systematic biases, the known biases including window detection frequency, fragment length, mappability, and GC content.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "http://dna.cs.miami.edu/normGAM/",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-03-08T14:20:03Z",
    "name": "normGAM",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1186/S12864-019-6331-8",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: The genome architecture mapping (GAM) technique can capture genome-wide chromatin interactions. However, besides the known systematic biases in the raw GAM data, we have found a new type of systematic bias. It is necessary to develop and evaluate effective normalization methods to remove all systematic biases in the raw GAM data. Results: We have detected a new type of systematic bias, the fragment length bias, in the genome architecture mapping (GAM) data, which is significantly different from the bias of window detection frequency previously mentioned in the paper introducing the GAM method but is similar to the bias of distances between restriction sites existing in raw Hi-C data. We have found that the normalization method (a normalized variant of the linkage disequilibrium) used in the GAM paper is not able to effectively eliminate the new fragment length bias at 1 Mb resolution (slightly better at 30 kb resolution). We have developed an R package named normGAM for eliminating the new fragment length bias together with the other three biases existing in raw GAM data, which are the biases related to window detection frequency, mappability, and GC content. Five normalization methods have been implemented and included in the R package including Knight-Ruiz 2-norm (KR2, newly designed by us), normalized linkage disequilibrium (NLD), vanilla coverage (VC), sequential component normalization (SCN), and iterative correction and eigenvector decomposition (ICE). Conclusions: Based on our evaluations, the five normalization methods can eliminate the four biases existing in raw GAM data, with VC and KR2 performing better than the others. We have observed that the KR2-normalized GAM data have a higher correlation with the KR-normalized Hi-C data on the same cell samples indicating that the KR-related methods are better than the others for keeping the consistency between the GAM and Hi-C experiments. Compared with the raw GAM data, the normalized GAM data are more consistent with the normalized distances from the fluorescence in situ hybridization (FISH) experiments. The source code of normGAM can be freely downloaded from http://dna.cs.miami.edu/normGAM/.",
                "authors": [
                    {
                        "name": "Liu T."
                    },
                    {
                        "name": "Wang Z."
                    }
                ],
                "citationCount": 2,
                "date": "2019-12-30T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "NormGAM: An R package to remove systematic biases in genome architecture mapping data"
            },
            "pmcid": "PMC6936146",
            "pmid": "31888469"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Data architecture, analysis and design",
            "uri": "http://edamontology.org/topic_3365"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        }
    ]
}
