{
    "additionDate": "2021-06-14T12:40:54Z",
    "biotoolsCURIE": "biotools:covid-19-signsym",
    "biotoolsID": "covid-19-signsym",
    "collectionID": [
        "COVID-19"
    ],
    "confidence_flag": "tool",
    "credit": [
        {
            "name": "Masoud Rouhizadeh",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "name": "Yaoyun Zhang",
            "orcidid": "https://orcid.org/0000-0001-9220-3101",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "COVID-19 SignSyma is a tool foor fast adaptation of a general clinical NLP tool to identify and normalize COVID-19 signs and symptoms to OMOP common data model.",
    "editPermission": {
        "authors": [
            "Kigaard"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Text mining",
                    "uri": "http://edamontology.org/operation_0306"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://clamp.uth.edu/covid/nlp.php",
    "lastUpdate": "2021-08-23T17:52:27Z",
    "name": "COVID-19 SignSym",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/JAMIA/OCAB015",
            "metadata": {
                "abstract": "© 2021 The Author(s). Published by Oxford University Press on behalf of the American Medical Informatics Association. All rights reserved.The COVID-19 pandemic swept across the world rapidly, infecting millions of people. An efficient tool that can accurately recognize important clinical concepts of COVID-19 from free text in electronic health records (EHRs) will be valuable to accelerate COVID-19 clinical research. To this end, this study aims at adapting the existing CLAMP natural language processing tool to quickly build COVID-19 SignSym, which can extract COVID-19 signs/symptoms and their 8 attributes (body location, severity, temporal expression, subject, condition, uncertainty, negation, and course) from clinical text. The extracted information is also mapped to standard concepts in the Observational Medical Outcomes Partnership common data model. A hybrid approach of combining deep learning-based models, curated lexicons, and pattern-based rules was applied to quickly build the COVID-19 SignSym from CLAMP, with optimized performance. Our extensive evaluation using 3 external sites with clinical notes of COVID-19 patients, as well as the online medical dialogues of COVID-19, shows COVID-19 SignSym can achieve high performance across data sources. The workflow used for this study can be generalized to other use cases, where existing clinical natural language processing tools need to be customized for specific information needs within a short time. COVID-19 SignSym is freely accessible to the research community as a downloadable package (https://clamp.uth.edu/covid/nlp.php) and has been used by 16 healthcare organizations to support clinical research of COVID-19.",
                "authors": [
                    {
                        "name": "Wang J."
                    },
                    {
                        "name": "Abu-El-Rub N."
                    },
                    {
                        "name": "Gray J."
                    },
                    {
                        "name": "Pham H.A."
                    },
                    {
                        "name": "Zhou Y."
                    },
                    {
                        "name": "Manion F.J."
                    },
                    {
                        "name": "Liu M."
                    },
                    {
                        "name": "Song X."
                    },
                    {
                        "name": "Xu H."
                    },
                    {
                        "name": "Rouhizadeh M."
                    },
                    {
                        "name": "Zhang Y."
                    }
                ],
                "citationCount": 1,
                "date": "2021-06-01T00:00:00Z",
                "journal": "Journal of the American Medical Informatics Association",
                "title": "COVID-19 SignSym: A fast adaptation of a general clinical NLP tool to identify and normalize COVID-19 signs and symptoms to OMOP common data model"
            },
            "pmcid": "PMC7989301",
            "pmid": "33674830",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Natural language processing",
            "uri": "http://edamontology.org/topic_0218"
        },
        {
            "term": "Medical informatics",
            "uri": "http://edamontology.org/topic_3063"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Medicine",
            "uri": "http://edamontology.org/topic_3303"
        }
    ]
}