{
    "accessibility": "Open access (with restrictions)",
    "additionDate": "2022-06-13T10:06:24.280357Z",
    "biotoolsCURIE": "biotools:emma-cad",
    "biotoolsID": "emma-cad",
    "confidence_flag": "tool",
    "cost": "Free of charge (with restrictions)",
    "credit": [
        {
            "email": "yizhi.cai@manchester.ac.uk",
            "name": "Yizhi Cai"
        },
        {
            "name": "Yisha Luo"
        }
    ],
    "description": "EMMA-CAD a web-based computer-aided design tool for the rapid design of bespoke mammalian expression vectors",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence assembly",
                    "uri": "http://edamontology.org/operation_0310"
                }
            ]
        }
    ],
    "homepage": "https://emma.cailab.org",
    "lastUpdate": "2022-06-13T10:06:24.282908Z",
    "name": "EMMA-CAD",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1021/ACSSYNBIO.1C00433",
            "metadata": {
                "abstract": "© 2022 American Chemical SocietyComputational design tools are the cornerstone of synthetic biology and have underpinned its rapid development over the past two decades. As the field has matured, the scale of biological investigation has expanded dramatically, and researchers often must rely on computational tools to operate in the high-throughput investigational space. This is especially apparent in the modular design of DNA expression circuits, where complexity is accumulated rapidly. Alongside our automated pipeline for the high-throughput construction of Extensible Modular Mammalian Assembly (EMMA) expression vectors, we recognized the need for an integrated software solution for EMMA vector design. Here we present EMMA-CAD (https://emma.cailab.org), a powerful web-based computer-aided design tool for the rapid design of bespoke mammalian expression vectors. EMMA-CAD features a variety of functionalities, including a user-friendly design interface, automated connector selection underpinned by rigorous computer optimization algorithms, customization of part libraries, and personalized design spaces. Capable of translating vector assembly designs into human- and machine-readable protocols for vector construction, EMMA-CAD integrates seamlessly into our automated EMMA pipeline, hence completing an end-to-end design to production workflow.",
                "authors": [
                    {
                        "name": "Cai Y."
                    },
                    {
                        "name": "James J.S."
                    },
                    {
                        "name": "Jones S."
                    },
                    {
                        "name": "Luo Y."
                    },
                    {
                        "name": "Martella A."
                    }
                ],
                "citationCount": 1,
                "date": "2022-02-18T00:00:00Z",
                "journal": "ACS Synthetic Biology",
                "title": "EMMA-CAD: Design Automation for Synthetic Mammalian Constructs"
            },
            "pmid": "35050610"
        }
    ],
    "toolType": [
        "Web application",
        "Workflow"
    ],
    "topic": [
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Genetic engineering",
            "uri": "http://edamontology.org/topic_3912"
        },
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        },
        {
            "term": "Synthetic biology",
            "uri": "http://edamontology.org/topic_3895"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ]
}
