{
    "additionDate": "2022-10-07T11:12:10.575470Z",
    "biotoolsCURIE": "biotools:neuropipred",
    "biotoolsID": "neuropipred",
    "credit": [
        {
            "name": "Gajendra P.S. Raghava",
            "url": "https://webs.iiitd.edu.in/raghava/neuropipred/"
        }
    ],
    "description": "NeuroPIpred is an in silico method, which is developed to predict and design insect neuropeptides with better efficacy for controlling pest from infesting various crops.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://webs.iiitd.edu.in/raghava/neuropipred/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Analysis",
                    "uri": "http://edamontology.org/operation_2945"
                }
            ]
        }
    ],
    "homepage": "https://webs.iiitd.edu.in/raghava/neuropipred/",
    "lastUpdate": "2022-10-07T11:12:16.293007Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "https://webs.iiitd.edu.in/raghava/neuropipred/"
        }
    ],
    "name": "neuropipred",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "raghavagps",
    "publication": [
        {
            "doi": "10.1038/s41598-019-41538-x",
            "metadata": {
                "abstract": "© 2019, The Author(s).Insect neuropeptides and their associated receptors have been one of the potential targets for the pest control. The present study describes in silico models developed using natural and modified insect neuropeptides for predicting and designing new neuropeptides. Amino acid composition analysis revealed the preference of residues C, D, E, F, G, N, S, and Y in insect neuropeptides The positional residue preference analysis show that in natural neuropeptides residues like A, N, F, D, P, S, and I are preferred at N terminus and residues like L, R, P, F, N, and G are preferred at C terminus. Prediction models were developed using input features like amino acid and dipeptide composition, binary profiles and implementing different machine learning techniques. Dipeptide composition based SVM model performed best among all the models. In case of NeuroPIpred_DS1, model achieved an accuracy of 86.50% accuracy and 0.73 MCC on training dataset and 83.71% accuracy and 0.67 MCC on validation dataset whereas in case of NeuroPIpred_DS2, model achieved 97.47% accuracy and 0.95 MCC on training dataset and 97.93% accuracy and 0.96 MCC on validation dataset. In order to assist researchers, we created standalone and user friendly web server NeuroPIpred, available at (https://webs.iiitd.edu.in/raghava/neuropipred.).",
                "authors": [
                    {
                        "name": "Agrawal P."
                    },
                    {
                        "name": "Kumar S."
                    },
                    {
                        "name": "Raghava G.P.S."
                    },
                    {
                        "name": "Singh A."
                    },
                    {
                        "name": "Singh I.K."
                    }
                ],
                "citationCount": 14,
                "date": "2019-12-01T00:00:00Z",
                "journal": "Scientific Reports",
                "title": "NeuroPIpred: a tool to predict, design and scan insect neuropeptides"
            },
            "pmcid": "PMC6435694",
            "pmid": "30914676"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Computational biology",
            "uri": "http://edamontology.org/topic_3307"
        }
    ]
}
