{
    "additionDate": "2015-12-06T15:18:14Z",
    "biotoolsCURIE": "biotools:egmrg",
    "biotoolsID": "egmrg",
    "credit": [
        {
            "name": "bils.se",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        },
        {
            "email": "fredrik.backhed@wlab.gu.se",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Encyclopedia of microbiota regulated genes.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://microbiota.wall.gu.se/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Gene name",
                        "uri": "http://edamontology.org/data_2299"
                    }
                }
            ],
            "operation": [
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Gene expression data",
                        "uri": "http://edamontology.org/data_2603"
                    }
                }
            ]
        }
    ],
    "homepage": "http://microbiota.wall.gu.se/",
    "homepage_status": 1,
    "lastUpdate": "2018-12-10T12:58:52Z",
    "name": "EGMRG",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mikael.borg@bils.se",
    "publication": [
        {
            "doi": "10.1136/gutjnl-2011-301104",
            "metadata": {
                "abstract": "Background: The gut microbiota has profound effects on host physiology but local host-microbial interactions in the gut are only poorly characterised and are likely to vary from the sparsely colonised duodenum to the densely colonised colon. Microorganisms are recognised by pattern recognition receptors such as Toll-like receptors, which signal through the adaptor molecule MyD88. Methods: To identify host responses induced by gut microbiota along the length of the gut and whether these required MyD88, transcriptional profiles of duodenum, jejunum, ileum and colon were compared from germ-free and conventionally raised wild-type and Myd88-/- mice. The gut microbial ecology was assessed by 454-based pyrosequencing and viruses were analysed by PCR. Results: The gut microbiota modulated the expression of a large set of genes in the small intestine and fewer genes in the colon but surprisingly few microbiota-regulated genes required MyD88 signalling. However, MyD88 was essential for microbiota-induced colonic expression of the antimicrobial genes Reg3β and Reg3γin the epithelium, and Myd88 deficiency was associated with both a shift in bacterial diversity and a greater proportion of segmented filamentous bacteria in the small intestine. In addition, conventionally raised Myd88-/- mice had increased expression of antiviral genes in the colon, which correlated with norovirus infection in the colonic epithelium. Conclusion: This study provides a detailed description of tissue-specific host transcriptional responses to the normal gut microbiota along the length of the gut and demonstrates that the absence of MyD88 alters gut microbial ecology.",
                "authors": [
                    {
                        "name": "Larsson E."
                    },
                    {
                        "name": "Tremaroli V."
                    },
                    {
                        "name": "Lee Y.S."
                    },
                    {
                        "name": "Koren O."
                    },
                    {
                        "name": "Nookaew I."
                    },
                    {
                        "name": "Fricker A."
                    },
                    {
                        "name": "Nielsen J."
                    },
                    {
                        "name": "Ley R.E."
                    },
                    {
                        "name": "Backhed F."
                    }
                ],
                "citationCount": 207,
                "date": "2012-08-01T00:00:00Z",
                "journal": "Gut",
                "title": "Analysis of gut microbial regulation of host gene expression along the length of the gut and regulation of gut microbial ecology through MyD88"
            },
            "type": [
                "Other"
            ]
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        }
    ],
    "validated": 1
}