{
    "additionDate": "2019-11-14T18:10:48Z",
    "biotoolsCURIE": "biotools:LSX",
    "biotoolsID": "LSX",
    "confidence_flag": "high",
    "credit": [
        {
            "email": "juan.montoya@unige.ch",
            "name": "Juan I. Montoya-Burgos",
            "typeEntity": "Person"
        }
    ],
    "description": "automated reduction of gene-specific lineage evolutionary rate heterogeneity for multi-gene phylogeny inference | A script in R to run the LS³ and LS⁴ phylogenetic data subsampling algorithms for reducing lineage rate heterogeneity | LSX is a script in R that runs the LS³ and LS⁴ algorithms of data subsampling for multigene phylogenetic inference",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://github.com/carlosj-rr/LSx",
    "language": [
        "R",
        "Bash"
    ],
    "lastUpdate": "2019-11-14T18:10:48Z",
    "license": "GPL-3.0",
    "name": "LSX",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12859-019-3020-1",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Lineage rate heterogeneity can be a major source of bias, especially in multi-gene phylogeny inference. We had previously tackled this issue by developing LS3, a data subselection algorithm that, by removing fast-evolving sequences in a gene-specific manner, identifies subsets of sequences that evolve at a relatively homogeneous rate. However, this algorithm had two major shortcomings: (i) it was automated and published as a set of bash scripts, and hence was Linux-specific, and not user friendly, and (ii) it could result in very stringent sequence subselection when extremely slow-evolving sequences were present. Results: We address these challenges and produce a new, platform-independent program, LSX, written in R, which includes a reprogrammed version of the original LS3 algorithm and has added features to make better lineage rate calculations. In addition, we developed and included an alternative version of the algorithm, LS4, which reduces lineage rate heterogeneity by detecting sequences that evolve too fast and sequences that evolve too slow, resulting in less stringent data subselection when extremely slow-evolving sequences are present. The efficiency of LSX and of LS4 with datasets with extremely slow-evolving sequences is demonstrated with simulated data, and by the resolution of a contentious node in the catfish phylogeny that was affected by an unusually high lineage rate heterogeneity in the dataset. Conclusions: LSX is a new bioinformatic tool, with an accessible code, and with which the effect of lineage rate heterogeneity can be explored in gene sequence datasets of virtually any size. In addition, the two modalities of the sequence subsampling algorithm included, LS3 and LS4, allow the user to optimize the amount of non-phylogenetic signal removed while keeping a maximum of phylogenetic signal.",
                "authors": [
                    {
                        "name": "Rivera-Rivera C.J."
                    },
                    {
                        "name": "Montoya-Burgos J.I."
                    }
                ],
                "date": "2019-08-13T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "LSX: Automated reduction of gene-specific lineage evolutionary rate heterogeneity for multi-gene phylogeny inference"
            },
            "pmcid": "PMC6693147",
            "pmid": "31409290"
        }
    ],
    "topic": [
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        },
        {
            "term": "Phylogenomics",
            "uri": "http://edamontology.org/topic_0194"
        },
        {
            "term": "Zoology",
            "uri": "http://edamontology.org/topic_3500"
        }
    ]
}