{
    "accessibility": "Open access",
    "additionDate": "2019-06-23T12:18:15Z",
    "biotoolsCURIE": "biotools:PubTerm",
    "biotoolsID": "PubTerm",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "vtrevino@itesm.mx",
            "name": "Victor Trevino",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Web tool for organizing, annotating and curating genes, diseases, molecules and other concepts from PubMed records.",
    "documentation": [
        {
            "note": "Tutorial material",
            "type": [
                "Training material"
            ],
            "url": "http://bioinformatica.mty.itesm.mx/drupal/sites/default/files/2019-01/Pubterm%20Tutorial.pdf"
        },
        {
            "type": [
                "General"
            ],
            "url": "http://bioinformatica.mty.itesm.mx:8080/Biomatec/pubterm.html"
        }
    ],
    "download": [
        {
            "note": "Extension in Crome",
            "type": "Other",
            "url": "https://chrome.google.com/webstore/search/cors"
        },
        {
            "note": "Extension in Firefox",
            "type": "Other",
            "url": "https://addons.mozilla.org/search/?q=cors"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                }
            ]
        }
    ],
    "homepage": "http://bioinformatica.mty.itesm.mx:8080/Biomatec/pubterm.html",
    "lastUpdate": "2020-06-16T10:55:23Z",
    "maturity": "Mature",
    "name": "PubTerm",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Ruta",
    "publication": [
        {
            "doi": "10.1093/database/bay137",
            "metadata": {
                "abstract": "© The Author(s) 2019.Background and objective: Analysis, annotation and curation of biomedical scientific literature is a recurrent task in biomedical research, database curation and clinics. Commonly, the reading is centered on concepts such as genes, diseases or molecules. Database curators may also need to annotate published abstracts related to a specific topic. However, few free and intuitive tools exist to assist users in this context. Therefore, we developed PubTerm, a web tool to organize, categorize, curate and annotate a large number of PubMed abstracts related to biological entities such as genes, diseases, chemicals, species, sequence variants and other related information. Methods: A variety of interfaces were implemented to facilitate curation and annotation, including the organization of abstracts by terms, by the co-occurrence of terms or by specific phrases. Information includes statistics on the occurrence of terms. The abstracts, terms and other related information can be annotated and categorized using user-defined categories. The session information can be saved and restored, and the data can be exported to other formats. Results: The pipeline in PubTerm starts by specifying a PubMed query or list of PubMed identifiers. Then, the user can specify three lists of categories and specify what information will be highlighted in which colors. The user then utilizes the 'term view' to organize the abstracts by gene, disease, species or other information to facilitate the annotation and categorization of terms or abstracts. Other views also facilitate the exploration of abstracts and connections between terms. We have used PubTerm to quickly and efficiently curate collections of more than 400 abstracts that mention more than 350 genes to generate revised lists of susceptibility genes for diseases. An example is provided for pulmonary arterial hypertension. Conclusions: PubTerm saves time for literature revision by assisting with annotation organization and knowledge acquisition.",
                "authors": [
                    {
                        "name": "Garcia-Pelaez J."
                    },
                    {
                        "name": "Garcia-Rivas G."
                    },
                    {
                        "name": "Jerjes-Sanchez C."
                    },
                    {
                        "name": "Medina-Molina R."
                    },
                    {
                        "name": "Rodriguez D."
                    },
                    {
                        "name": "Trevino V."
                    }
                ],
                "citationCount": 10,
                "date": "2019-01-08T00:00:00Z",
                "journal": "Database",
                "title": "PubTerm: A web tool for organizing, annotating and curating genes, diseases, molecules and other concepts from PubMed records"
            },
            "pmcid": "PMC6323318",
            "pmid": "30624653",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Data submission, annotation and curation",
            "uri": "http://edamontology.org/topic_0219"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        }
    ],
    "validated": 1
}
