{
    "additionDate": "2019-11-14T18:21:13Z",
    "biotoolsCURIE": "biotools:imp-sampcon",
    "biotoolsID": "imp-sampcon",
    "confidence_flag": "tool",
    "description": "Modeling Biological Complexes Using Integrative Modeling Platform | Scripts to assess sampling convergence and exhaustiveness",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                }
            ]
        }
    ],
    "homepage": "https://github.com/salilab/IMP-sampcon",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-01-14T08:07:03Z",
    "license": "GPL-2.0",
    "name": "IMP-sampcon",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1007/978-1-4939-9608-7_15",
            "metadata": {
                "abstract": "© Springer Science+Business Media, LLC, part of Springer Nature 2019.Integrative structure modeling provides 3D models of macromolecular systems that are based on information from multiple types of experiments, physical principles, statistical inferences, and prior structural models. Here, we provide a hands-on realistic example of integrative structure modeling of the quaternary structure of the actin, tropomyosin, and gelsolin protein assembly based on electron microscopy, solution X-ray scattering, and chemical crosslinking data for the complex as well as excluded volume, sequence connectivity, and rigid atomic X-ray structures of the individual subunits. We follow the general four-stage process for integrative modeling, including gathering the input information, converting the input information into a representation of the system and a scoring function, sampling alternative model configurations guided by the scoring function, and analyzing the results. The computational aspects of this approach are implemented in our open-source Integrative Modeling Platform (IMP), a comprehensive and extensible software package for integrative modeling (https://integrativemodeling.org ). In particular, we rely on the Python Modeling Interface (PMI) module of IMP that provides facile mixing and matching of macromolecular representations, restraints based on different types of information, sampling algorithms, and analysis including validations of the input data and output models. Finally, we also outline how to deposit an integrative structure and corresponding experimental data into PDB-Dev, the nascent worldwide Protein Data Bank (wwPDB) resource for archiving and disseminating integrative structures (https://pdb-dev.wwpdb.org ). The example application provides a starting point for a user interested in using IMP for integrative modeling of other biomolecular systems.",
                "authors": [
                    {
                        "name": "Saltzberg D."
                    },
                    {
                        "name": "Greenberg C.H."
                    },
                    {
                        "name": "Viswanath S."
                    },
                    {
                        "name": "Chemmama I."
                    },
                    {
                        "name": "Webb B."
                    },
                    {
                        "name": "Pellarin R."
                    },
                    {
                        "name": "Echeverria I."
                    },
                    {
                        "name": "Sali A."
                    }
                ],
                "citationCount": 5,
                "date": "2019-01-01T00:00:00Z",
                "journal": "Methods in Molecular Biology",
                "title": "Modeling Biological Complexes Using Integrative Modeling Platform"
            },
            "pmid": "31396911"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Biomolecular simulation",
            "uri": "http://edamontology.org/topic_3892"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Biophysics",
            "uri": "http://edamontology.org/topic_3306"
        }
    ],
    "validated": 1
}