{"credit":[{"typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://wwwabi.snv.jussieu.fr/"}],"documentation":[{"type":"GENERAL","url":"http://wwwabi.snv.jussieu.fr/public/Barcod/download.html"}],"function":[{"operation":[{"term":"Multiple sequence alignment","uri":"http://edamontology.org/operation_0492"}]}],"labels":{"language":["Java"],"operatingSystem":["Linux","Windows","Mac"],"toolType":["Command-line tool"],"topic":[{"term":"Phylogeny","uri":"http://edamontology.org/topic_0084"},{"term":"Sequence analysis","uri":"http://edamontology.org/topic_0080"},{"term":"Phylogenetics","uri":"http://edamontology.org/topic_3293"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/barcod-1-0-multiple-alignment.html"}],"publication":[{"abstract":"Molecular trees based on the analysis of sequence data can be obtained through parsimony procedures. Such approaches identify evolutionary events (homologies and homoplasies and their location in the tree). Nevertheless, it is not possible generally to analyze directly the information given by the aligned sequences. Noticeably, gaps ('indel') need special coding. Standard procedures for coding gaps offer alternatives which suffer of several weaknesses. In this article a new strategy of coding the sequences is defined in view to express the potential phylogenetic information contained in complex zones with internested insertion/deletion and substitutions, contrary to what is done up to the present. This strategy applies without loss or distorsion of information to any case where gaps are present in aligned sequences. According to the hierarchy of internested states of characters (sites), this strategy introduces in the data matrix question marks, '?', which are optimized in fine in the cladogram based on all data. These '?' are not missing data, they are methodological codes, neutral to a priori phylogenetic hypotheses.","authors":["Barriel V."],"cit_count":111,"journal":"Comptes Rendus de l'Academie des Sciences - Serie III","pmid":"7882153","title":"Molecular phylogenies and how to code insertion/deletion events PHYLOGENIES MOLECULAIRES ET INSERTIONS-DELETIONS DE NUCLEOTIDES","type":"Primary","year":"1994-01-01"}],"summary":{"biotoolsCURIE":"biotools:barcod","biotoolsID":"barcod","description":"Encodes a multiple alignment according to the method developed by Véronique Barriel (C.R.Acad.Sci.III 317(7):693-701).From a an existing alignment (which will not be changed) BARCOD builds a character matrix suitable for use in phylogeny recontstruction programs. The method allows to encode each insertion/deletion event as one single event (whatever the number of nucleotides involved), while retaining any indel common to two or more taxa as a possibly shared character.","homepage":"http://wwwabi.snv.jussieu.fr/public/Barcod/","name":"BARCOD","version":["1.0"]}}