{
    "additionDate": "2022-10-04T08:44:42.771902Z",
    "biotoolsCURIE": "biotools:dl-m6a",
    "biotoolsID": "dl-m6a",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Kil To Chong"
        },
        {
            "name": "Mobeen Ur Rehman"
        }
    ],
    "description": "DL-m6A: Identification of N6-methyladenosine Sites in Mammals using deep learning based on different encoding schemes",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Feature extraction",
                    "uri": "http://edamontology.org/operation_3937"
                }
            ]
        }
    ],
    "homepage": "http://nsclbio.jbnu.ac.kr/tools/DL-m6A/",
    "lastUpdate": "2022-10-04T08:44:42.774401Z",
    "license": "Other",
    "name": "DL-m6A",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1109/TCBB.2022.3192572",
            "metadata": {
                "abstract": "IEEEN6-methyladenosine (m6A) is a common post-transcriptional alteration that plays a critical function in a variety of biological processes. Although experimental approaches for identifying m6A sites have been developed and deployed, they are currently expensive for transcriptome-wide m6A identification. Some computational strategies for identifying m6A sites have been presented as an effective complement to the experimental procedure. However, their performance still requires improvement. In this study, we have proposed a novel tool called DL-m6A for the identification of m6A sites in mammals using deep learning based on different encoding schemes. The proposed tool uses three encoding schemes which give the required contextual feature representation to the input RNA sequence. Later these contextual feature vectors individually go through several neural network layers for shallow feature extraction after which they are concatenated to a single feature vector. The concatenated feature map is then used by several other layers to extract the deep features so that the insight features of the sequence can be used for the prediction of m6A sites. The proposed tool is firstly evaluated on the tissue-specific dataset and later on a full transcript dataset. To ensure the generalizability of the tool we assessed the proposed model by training it on a full transcript dataset and test on the tissue-specific dataset. The achieved results by the proposed model have outperformed the existing tools. The results demonstrate that the proposed tool can be of great use for the biology experts and therefore a freely accessible web-server is created which can be accessed at: <uri>http://nsclbio.jbnu.ac.kr/tools/DL-m6A/</uri>.",
                "authors": [
                    {
                        "name": "Chong K.T."
                    },
                    {
                        "name": "Rehman M.U."
                    },
                    {
                        "name": "Tayara H."
                    }
                ],
                "date": "2022-01-01T00:00:00Z",
                "journal": "IEEE/ACM Transactions on Computational Biology and Bioinformatics",
                "title": "DL-M6A: Identification of N6-Methyladenosine Sites in Mammals Using Deep Learning Based on Different Encoding Schemes"
            },
            "pmid": "35857733"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ]
}
