{"credit":[{"email":"lkurgan@vcu.edu","name":"Lukasz Kurgan","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"TRAINING_MATERIAL","url":"http://biomine.cs.vcu.edu/servers/PDID/help.html"},{"type":"GENERAL","url":"http://biomine.cs.vcu.edu/servers/PDID/about.html"}],"function":[{"operation":[{"term":"Database search","uri":"http://edamontology.org/operation_2421"}]}],"labels":{"accessibility":["Open access"],"collectionID":["Proteomics"],"cost":"Free of charge","license":"Other","maturity":"Mature","operatingSystem":["Linux","Windows","Mac"],"toolType":["Web application","Database portal"],"topic":[{"term":"Human biology","uri":"http://edamontology.org/topic_2815"},{"term":"Proteomics","uri":"http://edamontology.org/topic_0121"},{"term":"Protein interactions","uri":"http://edamontology.org/topic_0128"},{"term":"Drug development","uri":"http://edamontology.org/topic_3373"}]},"publication":[{"abstract":"© 2015 The Author 2015. Published by Oxford University Press. All rights reserved. Motivation: Many drugs interact with numerous proteins besides their intended therapeutic targets and a substantial portion of these interactions is yet to be elucidated. Protein-Drug Interaction Database (PDID) addresses incompleteness of these data by providing access to putative protein-drug interactions that cover the entire structural human proteome. Results: PDID covers 9652 structures from 3746 proteins and houses 16 800 putative interactions generated from close to 1.1 million accurate, all-atom structure-based predictions for several dozens of popular drugs. The predictions were generated with three modern methods: ILbind, SMAP and eFindSite. They are accompanied by propensity scores that quantify likelihood of interactions and coordinates of the putative location of the binding drugs in the corresponding protein structures. PDID complements the current databases that focus on the curated interactions and the BioDrugScreen database that relies on docking to find putative interactions. Moreover, we also include experimentally curated interactions which are linked to their sources: DrugBank, BindingDB and Protein Data Bank. Our database can be used to facilitate studies related to polypharmacology of drugs including repurposing and explaining side effects of drugs. Availability and implementation: PDID database is freely available at http://biomine.ece.ualberta.ca/PDID/.","authors":["Wang C.","Hu G.","Wang K.","Brylinski M.","Xie L.","Kurgan L."],"cit_count":10,"doi":"10.1093/BIOINFORMATICS/BTV597","journal":"Bioinformatics","pmid":"26504143","title":"PDID: Database of molecular-level putative protein-drug interactions in the structural human proteome","type":"Primary","year":"2016-02-15"}],"summary":{"biotoolsCURIE":"biotools:pdid","biotoolsID":"pdid","description":"Database of molecular-level putative protein-drug interactions in the structural human proteome.","homepage":"http://biomine.cs.vcu.edu/servers/PDID/index.php","name":"PDID"}}