{
    "accessibility": "Open access (with restrictions)",
    "additionDate": "2021-01-18T11:20:43Z",
    "biotoolsCURIE": "biotools:normirazor",
    "biotoolsID": "normirazor",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "wojciech_fendler@dfci.harvard.edu",
            "name": "Wojciech Fendler",
            "typeEntity": "Person"
        }
    ],
    "description": "Tool applying GPU-accelerated computing for determination of internal references in microRNA transcription studies.\n\nGitLab is a single application for the entire software development lifecycle. From project planning and source code management to CI/CD, monitoring, and security.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "miRNA expression analysis",
                    "uri": "http://edamontology.org/operation_3792"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "miRNA target prediction",
                    "uri": "http://edamontology.org/operation_0463"
                }
            ]
        }
    ],
    "homepage": "http://norm.btm.umed.pl",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-03-08T14:20:51Z",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "https://git.btm.umed.pl/zbimt/normirazorAny"
        }
    ],
    "name": "NormiRazor",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1186/S12859-020-03743-8",
            "metadata": {
                "abstract": "© 2020 The Author(s).Background: Multi-gene expression assays are an attractive tool in revealing complex regulatory mechanisms in living organisms. Normalization is an indispensable step of data analysis in all those studies, since it removes unwanted, non-biological variability from data. In targeted qPCR assays it is typically performed with respect to prespecified reference genes, but the lack of robust strategy of their selection is reported in literature, especially in studies concerning circulating microRNAs (miRNA). Unfortunately, this problem impedes translation of scientific discoveries on miRNA biomarkers into widely available laboratory assays. Previous studies concluded that averaged expressions of multi-miRNA combinations are more stable references than single genes. However, due to the number of such combinations the computational load is considerable and may be hindering for objective reference selection in large datasets. Existing implementations of normalization algorithms (geNorm, NormFinder and BestKeeper) have poor performance and may require days to compute stability values for all potential reference as the evaluation is performed sequentially. Results: We designed NormiRazor - an integrative tool which implements those methods in a parallel manner on a graphics processing unit (GPU) using CUDA platform. We tested our approach on publicly available miRNA expression datasets. As a result, the times of executions on 8 datasets containing from 50 to 400 miRNAs (subsets of GSE68314) decreased 18.7 ±0.6 (mean ±SD), 104.7 ±4.2 and 76.5 ±2.2 times for geNorm, BestKeeper and NormFinder with respect to previous Python implementation. To allow for easy access to normalization pipeline for biomedical researchers we implemented NormiRazor as an online platform where a user could normalize their datasets based on the automatically selected references. It is available at norm.btm.umed.pl, together with instruction manual and exemplary datasets. Conclusions: NormiRazor allows for an easy, informed choice of reference genes for qPCR transcriptomic studies. As such it can improve comparability and repeatability of experiments and in longer perspective help translate newly discovered biomarkers into readily available assays.",
                "authors": [
                    {
                        "name": "Grabia S."
                    },
                    {
                        "name": "Smyczynska U."
                    },
                    {
                        "name": "Pagacz K."
                    },
                    {
                        "name": "Fendler W."
                    }
                ],
                "citationCount": 1,
                "date": "2020-09-29T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "NormiRazor: Tool applying GPU-accelerated computing for determination of internal references in microRNA transcription studies"
            },
            "pmcid": "PMC7523363",
            "pmid": "32993488"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "PCR experiment",
            "uri": "http://edamontology.org/topic_3519"
        },
        {
            "term": "Protein expression",
            "uri": "http://edamontology.org/topic_0108"
        }
    ]
}