{
    "additionDate": "2022-08-11T08:10:07.255703Z",
    "biotoolsCURIE": "biotools:bcurve",
    "biotoolsID": "bcurve",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "paul.jincheolpark@icloud.com",
            "name": "Jincheol Park"
        },
        {
            "email": "shili@stat.osu.edu",
            "name": "Shili Lin",
            "typeEntity": "Person"
        },
        {
            "name": "Chenggong Han"
        }
    ],
    "description": "R package that can be used to detect differentially methylated CG sites and differentially methylated regions using a Bayesian smoothing curve method.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "DMR identification",
                    "uri": "http://edamontology.org/operation_3809"
                },
                {
                    "term": "Gene methylation analysis",
                    "uri": "http://edamontology.org/operation_3207"
                },
                {
                    "term": "Whole genome methylation analysis",
                    "uri": "http://edamontology.org/operation_3206"
                }
            ]
        }
    ],
    "homepage": "https://www.asc.ohio-state.edu/statistics/statgen/SOFTWARE/BCurve/",
    "language": [
        "R"
    ],
    "lastUpdate": "2024-11-24T15:50:20.157295Z",
    "license": "Not licensed",
    "name": "BCurve",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1007/978-1-0716-1994-0_13",
            "metadata": {
                "abstract": "High-throughput assays have been developed to measure DNA methylation, among which bisulfite-based sequencing (BS-seq) and microarray technologies are the most popular for genome-wide profiling. A major goal in DNA methylation analysis is the detection of differentially methylated genomic regions under two different conditions. To accomplish this, many state-of-the-art methods have been proposed in the past few years; only a handful of these methods are capable of analyzing both types of data (BS-seq and microarray), though. On the other hand, covariates, such as sex and age, are known to be potentially influential on DNA methylation; and thus, it would be important to adjust for their effects on differential methylation analysis. In this chapter, we describe a Bayesian curve credible bands approach and the accompanying software, BCurve, for detecting differentially methylated regions for data generated from either microarray or BS-Seq. The unified theme underlying the analysis of these two different types of data is the model that accounts for correlation between DNA methylation in nearby sites, covariates, and between-sample variability. The BCurve R software package also provides tools for simulating both microarray and BS-seq data, which can be useful for facilitating comparisons of methods given the known “gold standard” in the simulated data. We provide detailed description of the main functions in BCurve and demonstrate the utility of the package for analyzing data from both platforms using simulated data from the functions provided in the package. Analyses of two real datasets, one from BS-seq and one from microarray, are also furnished to further illustrate the capability of BCurve.",
                "authors": [
                    {
                        "name": "Han C."
                    },
                    {
                        "name": "Lin S."
                    },
                    {
                        "name": "Park J."
                    }
                ],
                "date": "2022-01-01T00:00:00Z",
                "journal": "Methods in Molecular Biology",
                "title": "BCurve: Bayesian Curve Credible Bands Approach for the Detection of Differentially Methylated Regions"
            },
            "pmid": "35505215"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Methylated DNA immunoprecipitation",
            "uri": "http://edamontology.org/topic_3674"
        },
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        }
    ],
    "validated": 1
}
