
{
    "credit": [
        {
            "email": "jdqiu@ncu.edu.cn",
            "name": "Jian-Ding Qiu",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        },
        {
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://bioinfo.ncu.edu.cn/"
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://bioinfo.ncu.edu.cn/SUMOAMVR_Help.aspx"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Protein sequence analysis",
                    "uri": "http://edamontology.org/operation_2479"
                },
                {
                    "term": "Protein feature detection",
                    "uri": "http://edamontology.org/operation_3092"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Proteins",
                "uri": "http://edamontology.org/topic_0078"
            },
            {
                "term": "Sequence analysis",
                "uri": "http://edamontology.org/topic_0080"
            },
            {
                "term": "Sequence sites, features and motifs",
                "uri": "http://edamontology.org/topic_0160"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/sumoamvr-prediction-of-genetic-variability-that-influence-protein-sumoylation.html"
        }
    ],
    "publication": [
        {
            "abstract": "Protein function has been observed to rely on select essential sites instead of requiring all sites to be indispensable. Small ubiquitin-related modifier (SUMO) conjugation or sumoylation, which is a highly dynamic reversible process and its outcomes are extremely diverse, ranging from changes in localization to altered activity and, in some cases, stability of the modified, has shown to be especially valuable in cellular biology. Motivated by the significance of SUMO conjugation in biological processes, we report here on the first exploratory assessment whether sumoylation related genetic variability impacts protein functions as well as the occurrence of diseases related to SUMO. Here, we defined the SUMOAMVR as sumoylation related amino acid variations that affect sumoylation sites or enzymes involved in the process of connectivity, and categorized four types of potential SUMOAMVRs. We detected that 17.13% of amino acid variations are potential SUMOAMVRs and 4.83% of disease mutations could lead to SUMOAMVR with our system. More interestingly, the statistical analysis demonstrates that the amino acid variations that directly create new potential lysine sumoylation sites are more likely to cause diseases. It can be anticipated that our method can provide more instructive guidance to identify the mechanisms of genetic diseases.",
            "authors": [
                "Xu H.-D.",
                "Shi S.-P.",
                "Chen X.",
                "Qiu J.-D."
            ],
            "cit_count": 5,
            "journal": "Scientific Reports",
            "pmid": "26154679",
            "title": "Systematic analysis of the genetic variability that impacts sumo conjugation and their involvement in human diseases",
            "year": "2015-07-08"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:sumoamvr",
        "biotoolsID": "sumoamvr",
        "description": "Web server for prediction of sumoylation related amino acid variations that affect sumoylation sites or enzymes involved in the process of connectivity.",
        "homepage": "http://bioinfo.ncu.edu.cn/SUMOAMVR_Home.aspx",
        "name": "SUMOAMVR"
    }
}