{
    "additionDate": "2017-08-20T16:04:20Z",
    "biotoolsCURIE": "biotools:gvista",
    "biotoolsID": "gvista",
    "collectionID": [
        "Animal and Crop Genomics"
    ],
    "credit": [
        {
            "email": "avpoliakov@lbl.gov",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "A novel implementation that incorporates most features of the VISTA family—fast and accurate alignment, visualization capabilities, GUI and analytical tools within a stand-alone software package. GenomeVISTA thus provides flexibility and security for users who need to conduct whole-genome comparisons on their own computers.",
    "documentation": [
        {
            "type": "General",
            "url": "http://pipeline.lbl.gov/vgb2help.shtml"
        }
    ],
    "editPermission": {
        "authors": [
            "animalandcropgenomics"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence alignment analysis (conservation)",
                    "uri": "http://edamontology.org/operation_0448"
                },
                {
                    "term": "Sequence visualisation",
                    "uri": "http://edamontology.org/operation_0564"
                }
            ]
        }
    ],
    "homepage": "http://genome.lbl.gov/cgi-bin/GenomeVista",
    "language": [
        "C++",
        "Perl",
        "C"
    ],
    "lastUpdate": "2020-01-19T17:47:47Z",
    "license": "Not licensed",
    "name": "gVISTA",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "admin",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btu355",
            "metadata": {
                "abstract": "© 2014 The Author. With the ubiquitous generation of complete genome assemblies for a variety of species, efficient tools for whole-genome alignment along with user-friendly visualization are critically important. Our VISTA family of tools for comparative genomics, based on algorithms for pairwise and multiple alignments of genomic sequences and whole-genome assemblies, has become one of the standard techniques for comparative analysis. Most of the VISTA programs have been implemented as Web-accessible servers and are extensively used by the biomedical community. In this manuscript, we introduce GenomeVISTA: a novel implementation that incorporates most features of the VISTA family-fast and accurate alignment, visualization capabilities, GUI and analytical tools within a stand-alone software package. GenomeVISTA thus provides flexibility and security for users who need to conduct whole-genome comparisons on their own computers. Availability and implementation: Implemented in Perl, C/C++ and Java, the source code is freely available for download at the VISTA Web site: http://genome.lbl.gov/vista/.",
                "authors": [
                    {
                        "name": "Poliakov A."
                    },
                    {
                        "name": "Foong J."
                    },
                    {
                        "name": "Brudno M."
                    },
                    {
                        "name": "Dubchak I."
                    }
                ],
                "citationCount": 11,
                "date": "2014-01-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "GenomeVISTA-an integrated software package for whole-genome alignment and visualization"
            },
            "type": "Primary"
        }
    ],
    "toolType": [
        "Web service"
    ],
    "topic": [
        {
            "term": "Comparative genomics",
            "uri": "http://edamontology.org/topic_0797"
        }
    ],
    "validated": 1
}