
{
    "credit": [
        {
            "email": "Viacheslav.Fofanov@nau.edu",
            "name": "Viacheslav Y. Fofanov",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "https://github.com/FofanovLab/VaST/blob/master/readme.md"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "SNP detection",
                    "uri": "http://edamontology.org/operation_0484"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Design",
                    "uri": "http://edamontology.org/operation_2430"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Python"
        ],
        "license": "MIT",
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Command-line tool",
            "Suite"
        ],
        "topic": [
            {
                "term": "DNA polymorphism",
                "uri": "http://edamontology.org/topic_2885"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© 2018 The Author(s). Background: Targeted PCR amplicon sequencing (TAS) techniques provide a sensitive, scalable, and cost-effective way to query and identify closely related bacterial species and strains. Typically, this is accomplished by targeting housekeeping genes that provide resolution down to the family, genera, and sometimes species level. Unfortunately, this level of resolution is not sufficient in many applications where strain-level identification of bacteria is required (biodefense, forensics, clinical diagnostics, and outbreak investigations). Adding more genomic targets will increase the resolution, but the challenge is identifying the appropriate targets. VaST was developed to address this challenge by finding the minimum number of targets that, in combination, achieve maximum strain-level resolution for any strain complex. The final combination of target regions identified by the algorithm produce a unique haplotype for each strain which can be used as a fingerprint for identifying unknown samples in a TAS assay. VaST ensures that the targets have conserved primer regions so that the targets can be amplified in all of the known strains and it also favors the inclusion of targets with basal variants which makes the set more robust when identifying previously unseen strains. Results: We analyzed VaST's performance using a number of different pathogenic species that are relevant to human disease outbreaks and biodefense. The number of targets required to achieve full resolution ranged from 20 to 88% fewer sites than what would be required in the worst case and most of the resolution is achieved within the first 20 targets. We computationally and experimentally validated one of the VaST panels and found that the targets led to accurate phylogenetic placement of strains, even when the strains were not a part of the original panel design. Conclusions: VaST is an open source software that, when provided a set of variant sites, can find the minimum number of sites that will provide maximum resolution of a strain complex, and it has many different run-time options that can accommodate a wide range of applications. VaST can be an effective tool in the design of strain identification panels that, when combined with TAS technologies, offer an efficient and inexpensive strain typing protocol.",
            "authors": [
                "Furstenau T.N.",
                "Cocking J.H.",
                "Sahl J.W.",
                "Fofanov V.Y."
            ],
            "cit_count": 0,
            "doi": "10.1186/s12859-018-2225-z",
            "journal": "BMC Bioinformatics",
            "title": "Variant site strain typer (VaST): Efficient strain typing using a minimal number of variant genomic sites",
            "type": "Primary",
            "year": "2018-06-11"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:vast-variant",
        "biotoolsID": "vast-variant",
        "description": "VaST is an open source software that, when provided a set of variant sites, can find the minimum number of sites that will provide maximum resolution of a strain complex, and it has many different run-time options that can accommodate a wide range of applications.",
        "homepage": "https://github.com/FofanovLab/VaST",
        "name": "VaST"
    }
}