{
    "additionDate": "2021-01-18T11:52:31Z",
    "biotoolsCURIE": "biotools:rhizobindingsites",
    "biotoolsID": "rhizobindingsites",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "encarnac@ccg.unam.mx",
            "name": "Sergio Encarnación-Guevara",
            "typeEntity": "Person"
        }
    ],
    "description": "Database of DNA-Binding Motifs in Nitrogen-Fixing Bacteria Inferred Using a Footprint Discovery Approach.\n\nThe RhizoBindingSites database is a computer-assisted framework providing motif-gene-associated conserved sequences potentially implicated in transcriptional regulation in nine symbiotic species.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Phylogenetic footprinting",
                    "uri": "http://edamontology.org/operation_0327"
                },
                {
                    "term": "Sequence motif discovery",
                    "uri": "http://edamontology.org/operation_0238"
                },
                {
                    "term": "Sequence motif recognition",
                    "uri": "http://edamontology.org/operation_0239"
                }
            ]
        }
    ],
    "homepage": "http://rhizobindingsites.ccg.unam.mx",
    "lastUpdate": "2021-02-06T17:22:52Z",
    "name": "RhizoBindingSites",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.3389/FMICB.2020.567471",
            "metadata": {
                "abstract": "© Copyright © 2020 Taboada-Castro, Castro-Mondragón, Aguilar-Vera, Hernández-Álvarez, van Helden and Encarnación-Guevara.Basic knowledge of transcriptional regulation is needed to understand the mechanisms governing biological processes, i.e., nitrogen fixation by Rhizobiales bacteria in symbiosis with leguminous plants. The RhizoBindingSites database is a computer-assisted framework providing motif-gene-associated conserved sequences potentially implicated in transcriptional regulation in nine symbiotic species. A dyad analysis algorithm was used to deduce motifs in the upstream regulatory region of orthologous genes, and only motifs also located in the gene seed promoter with a p-value of 1e-4 were accepted. A genomic scan analysis of the upstoream sequences with these motifs was performed. These predicted binding sites were categorized according to low, medium and high homology between the matrix and the upstream regulatory sequence. On average, 62.7% of the genes had a motif, accounting for 80.44% of the genes per genome, with 19613 matrices (a matrix is a representation of a motif). The RhizoBindingSites database provides motif and gene information, motif conservation in the order Rhizobiales, matrices, motif logos, regulatory networks constructed from theoretical or experimental data, a criterion for selecting motifs and a guide for users. The RhizoBindingSites database is freely available online at rhizobindingsites.ccg.unam.mx.",
                "authors": [
                    {
                        "name": "Aguilar-Vera A."
                    },
                    {
                        "name": "Castro-Mondragon J.A."
                    },
                    {
                        "name": "Encarnacion-Guevara S."
                    },
                    {
                        "name": "Hernandez-Alvarez A.J."
                    },
                    {
                        "name": "Taboada-Castro H."
                    },
                    {
                        "name": "van Helden J."
                    }
                ],
                "date": "2020-11-05T00:00:00Z",
                "journal": "Frontiers in Microbiology",
                "title": "RhizoBindingSites, a Database of DNA-Binding Motifs in Nitrogen-Fixing Bacteria Inferred Using a Footprint Discovery Approach"
            },
            "pmcid": "PMC7674921",
            "pmid": "33250866"
        }
    ],
    "topic": [
        {
            "term": "Gene regulation",
            "uri": "http://edamontology.org/topic_0204"
        },
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ]
}
