
{
    "credit": [
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "PCR primer design",
                    "uri": "http://edamontology.org/operation_0308"
                },
                {
                    "term": "Read mapping",
                    "uri": "http://edamontology.org/operation_3198"
                },
                {
                    "term": "Sorting",
                    "uri": "http://edamontology.org/operation_3802"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "C++"
        ],
        "topic": [
            {
                "term": "Epigenomics",
                "uri": "http://edamontology.org/topic_3173"
            },
            {
                "term": "DNA packaging",
                "uri": "http://edamontology.org/topic_3176"
            },
            {
                "term": "Probes and primers",
                "uri": "http://edamontology.org/topic_0632"
            },
            {
                "term": "Cell biology",
                "uri": "http://edamontology.org/topic_2229"
            },
            {
                "term": "Sequencing",
                "uri": "http://edamontology.org/topic_3168"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© 2019, This is a U.S. government work and not under copyright protection in the U.S.; foreign copyright protection may apply.Nucleosome organization is important for chromatin compaction and accessibility. Profiling nucleosome positioning genome-wide in single cells provides critical information to understand the cell-to-cell heterogeneity of chromatin states within a cell population. This protocol describes single-cell micrococcal nuclease sequencing (scMNase-seq), a method for detecting genome-wide nucleosome positioning and chromatin accessibility simultaneously from a small number of cells or single cells. To generate scMNase-seq libraries, single cells are isolated by FACS sorting, lysed and digested by MNase. DNA is purified, end-repaired and ligated to Y-shaped adaptors. Following PCR amplification with indexing primers, the subnucleosome-sized (fragments with a length of ≤80 bp) and mononucleosome-sized (fragments with a length between 140 and 180 bp) DNA fragments are recovered and sequenced on Illumina HiSeq platforms. On average, 0.5–1 million unique mapped reads are obtained for each single cell. The mononucleosome-sized DNA fragments precisely define genome-wide nucleosome positions in single cells, while the subnucleosome-sized DNA fragments provide information on chromatin accessibility. Library preparation of scMNase-seq takes only 2 d, requires only standard molecular biology techniques and does not require sophisticated laboratory equipment. Processing of high-throughput sequencing data requires basic bioinformatics skills and uses publicly available bioinformatics software.",
            "authors": [
                "Gao W.",
                "Lai B.",
                "Ni B.",
                "Zhao K."
            ],
            "cit_count": 0,
            "doi": "10.1038/S41596-019-0243-6",
            "journal": "Nature Protocols",
            "pmid": "31836865",
            "title": "Genome-wide profiling of nucleosome position and chromatin accessibility in single cells using scMNase-seq",
            "year": "2020-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:scMNase-seq",
        "biotoolsID": "scMNase-seq",
        "description": "Genome-wide profiling of nucleosome position and chromatin accessibility in single cells using scMNase-seq.\n\nThis repository includes codes for data analysis in scMNase paper",
        "homepage": "https://github.com/binbinlai2012/scMNase",
        "name": "scMNase-seq"
    }
}