{
    "additionDate": "2022-09-28T08:09:28.202897Z",
    "biotoolsCURIE": "biotools:winnowmap",
    "biotoolsID": "winnowmap",
    "description": "Winnowmap is a long-read mapping algorithm optimized for mapping ONT and PacBio reads to repetitive reference sequences. Winnowmap development began on top of minimap2 codebase, and since then we have incorporated the following two ideas to improve mapping accuracy within repeats",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence alignment",
                    "uri": "http://edamontology.org/operation_0292"
                }
            ]
        }
    ],
    "homepage": "https://github.com/marbl/Winnowmap",
    "language": [
        "C"
    ],
    "lastUpdate": "2024-11-24T15:34:51.128326Z",
    "license": "Not licensed",
    "name": "winnowmap",
    "owner": "alexcorm",
    "publication": [
        {
            "doi": "10.1038/s41592-022-01457-8",
            "metadata": {
                "abstract": "Approximately 5–10% of the human genome remains inaccessible due to the presence of repetitive sequences such as segmental duplications and tandem repeat arrays. We show that existing long-read mappers often yield incorrect alignments and variant calls within long, near-identical repeats, as they remain vulnerable to allelic bias. In the presence of a nonreference allele within a repeat, a read sampled from that region could be mapped to an incorrect repeat copy. To address this limitation, we developed a new long-read mapping method, Winnowmap2, by using minimal confidently alignable substrings. Winnowmap2 computes each read mapping through a collection of confident subalignments. This approach is more tolerant of structural variation and more sensitive to paralog-specific variants within repeats. Our experiments highlight that Winnowmap2 successfully addresses the issue of allelic bias, enabling more accurate downstream variant calls in repetitive sequences.",
                "authors": [
                    {
                        "name": "Hansen N.F."
                    },
                    {
                        "name": "Jain C."
                    },
                    {
                        "name": "Koren S."
                    },
                    {
                        "name": "Phillippy A.M."
                    },
                    {
                        "name": "Rhie A."
                    }
                ],
                "citationCount": 79,
                "date": "2022-06-01T00:00:00Z",
                "journal": "Nature Methods",
                "title": "Long-read mapping to repetitive reference sequences using Winnowmap2"
            },
            "pmcid": "PMC10510034",
            "pmid": "35365778"
        },
        {
            "doi": "10.1093/bioinformatics/btaa435",
            "metadata": {
                "abstract": "Motivation: In this era of exponential data growth, minimizer sampling has become a standard algorithmic technique for rapid genome sequence comparison. This technique yields a sub-linear representation of sequences, enabling their comparison in reduced space and time. A key property of the minimizer technique is that if two sequences share a substring of a specified length, then they can be guaranteed to have a matching minimizer. However, because the k-mer distribution in eukaryotic genomes is highly uneven, minimizer-based tools (e.g. Minimap2, Mashmap) opt to discard the most frequently occurring minimizers from the genome to avoid excessive false positives. By doing so, the underlying guarantee is lost and accuracy is reduced in repetitive genomic regions. Results: We introduce a novel weighted-minimizer sampling algorithm. A unique feature of the proposed algorithm is that it performs minimizer sampling while considering a weight for each k-mer; i.e. the higher the weight of a kmer, the more likely it is to be selected. By down-weighting frequently occurring k-mers, we are able to meet both objectives: (i) avoid excessive false-positive matches and (ii) maintain the minimizer match guarantee. We tested our algorithm, Winnowmap, using both simulated and real long-read data and compared it to a state-of-the-art long read mapper, Minimap2. Our results demonstrate a reduction in the mapping error-rate from 0.14% to 0.06% in the recently finished human X chromosome (154.3 Mbp), and from 3.6% to 0% within the highly repetitive X centromere (3.1 Mbp). Winnowmap improves mapping accuracy within repeats and achieves these results with sparser sampling, leading to better index compression and competitive runtimes. Availability and implementation: Winnowmap is built on top of the Minimap2 codebase and is available at https://github.com/marbl/winnowmap.",
                "authors": [
                    {
                        "name": "Chu C."
                    },
                    {
                        "name": "Jain C."
                    },
                    {
                        "name": "Koren S."
                    },
                    {
                        "name": "Phillippy A.M."
                    },
                    {
                        "name": "Rhie A."
                    },
                    {
                        "name": "Walenz B.P."
                    },
                    {
                        "name": "Zhang H."
                    }
                ],
                "citationCount": 92,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Weighted minimizer sampling improves long read mapping"
            },
            "pmcid": "PMC7355284",
            "pmid": "32657365"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        }
    ],
    "version": [
        "2.03"
    ]
}
