{
    "additionDate": "2018-06-02T07:43:28Z",
    "biotoolsCURIE": "biotools:metavisitor",
    "biotoolsID": "metavisitor",
    "collectionID": [
        "Galaxy"
    ],
    "credit": [
        {
            "email": "christophe.antoniewski@upmc.fr",
            "name": "Christophe Antoniewski",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Software package that allows biologists and clinicians without specialized bioinformatics expertise to detect and assemble viral genomes from deep sequence datasets.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://artbio.github.io/Metavisitor-manual/"
        }
    ],
    "editPermission": {
        "authors": [
            "Naira"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence assembly",
                    "uri": "http://edamontology.org/operation_0310"
                },
                {
                    "term": "Sequence alignment",
                    "uri": "http://edamontology.org/operation_0292"
                }
            ]
        }
    ],
    "homepage": "https://github.com/ARTbio/metavisitor",
    "language": [
        "Shell"
    ],
    "lastUpdate": "2019-12-14T20:33:43Z",
    "name": "Metavisitor",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "migle_sur",
    "publication": [
        {
            "doi": "10.1371/journal.pone.0168397",
            "metadata": {
                "abstract": "© 2017 Carissimo et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Metavisitor is a software package that allows biologists and clinicians without specialized bioinformatics expertise to detect and assemble viral genomes from deep sequence datasets. The package is composed of a set of modular bioinformatic tools and workflows that are implemented in the Galaxy framework. Using the graphical Galaxy workflow editor, users with minimal computational skills can use existing Metavisitor workflows or adapt them to suit specific needs by adding or modifying analysis modules. Metavisitor works with DNA, RNA or small RNA sequencing data over a range of read lengths and can use a combination of de novo and guided approaches to assemble genomes from sequencing reads. We show that the software has the potential for quick diagnosis as well as discovery of viruses from a vast array of organisms. Importantly, we provide here executable Metavisitor use cases, which increase the accessibility and transparency of the software, ultimately enabling biologists or clinicians to focus on biological or medical questions.",
                "authors": [
                    {
                        "name": "Carissimo G."
                    },
                    {
                        "name": "Van Den Beek M."
                    },
                    {
                        "name": "Vernick K.D."
                    },
                    {
                        "name": "Antoniewski C."
                    }
                ],
                "citationCount": 8,
                "date": "2017-01-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "Metavisitor, a suite of galaxy tools for simple and rapid detection and discovery of viruses in deep sequence data"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool",
        "Web application"
    ],
    "topic": [
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "Virology",
            "uri": "http://edamontology.org/topic_0781"
        },
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        }
    ],
    "validated": 1
}