
{
    "credit": [
        {
            "email": "ovcharen@nih.gov",
            "name": "Ivan Ovcharenko",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://www.ncbi.nlm.nih.gov/CBBresearch/Ovcharenko/"
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "https://eshadow.dcode.org/"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence analysis",
                    "uri": "http://edamontology.org/operation_2403"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Sequence analysis",
                "uri": "http://edamontology.org/topic_0080"
            },
            {
                "term": "Phylogenetics",
                "uri": "http://edamontology.org/topic_3293"
            },
            {
                "term": "Computational biology",
                "uri": "http://edamontology.org/topic_3307"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/eshadow-phylogenetic-shadowing.html"
        }
    ],
    "publication": [
        {
            "abstract": "Primate sequence comparisons are difficult to interpret due to the high degree of sequence similarity shared between such closely related species. Recently, a novel method, phylogenetic shadowing, has been pioneered for predicting functional elements in the human genome through the analysis of multiple primate sequence alignments. We have expanded this theoretical approach to create a computational tool, eShadow, for the identification of elements under selective pressure in multiple sequence alignments of closely related genomes, such as in comparisons of human-to-primate or mouse-to-rat DNA. This tool integrates two different statistical methods and allows for the dynamic visualization of the resulting conservation profile. eShadow also includes a versatile optimization module capable of training the underlying Hidden Markov Model to differentially predict functional sequences. This module grants the tool high flexibility in the analysis of multiple sequence alignments and in comparing sequences with different divergence rates. Here, we describe the eShadow comparative tool and its potential uses for analyzing both multiple nucleotide and protein alignments to predict putative functional elements. ©2004 by Cold Spring Harbor Laboratory Press.",
            "authors": [
                "Ovcharenko I.",
                "Boffelli D.",
                "Loots G.G."
            ],
            "cit_count": 45,
            "journal": "Genome Research",
            "pmid": "15173121",
            "title": "eShadow: A tool for comparing closely related sequences",
            "year": "2004-06-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:eshadow",
        "biotoolsID": "eshadow",
        "description": "Tool for performing comparative sequence analysis of multiple closely-related nucleotide or protein sequences.",
        "homepage": "http://eshadow.dcode.org/",
        "name": "eShadow"
    }
}