
{
    "credit": [
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "labels": {
        "topic": [
            {
                "term": "Surgery",
                "uri": "http://edamontology.org/topic_3421"
            },
            {
                "term": "Oncology",
                "uri": "http://edamontology.org/topic_2640"
            },
            {
                "term": "Pathology",
                "uri": "http://edamontology.org/topic_0634"
            }
        ]
    },
    "publication": [
        {
            "abstract": "BACKGROUND: In 2016, the American Society of Colon and Rectal Surgeons published a rectal cancer surgery checklist composed of the essential elements of preoperative, intraoperative, and postoperative care for patients undergoing rectal cancer surgery. OBJECTIVE: The purpose of this study was to assess whether compliance with preoperative checklist elements was associated with improved pathologic and 30-day postoperative outcomes after rectal cancer surgery. DESIGN: This was a retrospective cohort study. SETTINGS: The study involved North American hospitals contributing to the American College of Surgeons National Surgical Quality Improvement Program. PATIENTS: Adult patients who underwent elective rectal cancer surgery from 2016 to 2017 were included. INTERVENTION: The study encompassed checklist compliance with 6 preoperative elements from the checklist. MAIN OUTCOME MEASURES: Pathologic outcomes (circumferential resection margin status, distal resection margin status, and adequate lymph node harvest ≥12), 30-day surgical morbidity, and length of stay were measured. RESULTS: In total, 2217 patients were included in the analysis. Individual compliance with the 6 available preoperative checklist items was variable, including 91.3% for pretreatment documentation of tumor location within the rectum, 86.8% for complete colonoscopy, 84.0% for appropriate preoperative stoma marking, 79.8% for appropriate use of neoadjuvant radiotherapy, 76.6% for locoregional staging, and 70.8% for distant staging. Only 836 patients (37.7%) had all 6 checklist elements complete, whereas 1381 (62.3%) did not. Compared with patients without checklist compliance, patients with checklist compliance were younger (60.0 vs 63.0 y; p < 0.001) but otherwise had similar demographic characteristics. On multivariate regression, checklist compliance was associated with lower odds of circumferential resection margin positivity (OR = 0.47 (95% CI, 0.31-0.71); p < 0.001), higher odds of an adequate lymph node harvest ≥12 (OR = 1.60 (95% CI, 1.29-2.00); p < 0.001), reduced surgical morbidity (OR = 0.78 (95% CI, 0.65-0.95); p = 0.01), and shorter length of stay (β = -0.87 (95% CI, -1.51 to -0.24); p = 0.007). The association between checklist compliance and reduced odds of circumferential resection margin positivity remained on sensitivity analysis (OR = 0.61 (95% CI, 0.42-0.88); p = 0.009) when adjusting for neoadjuvant radiation. LIMITATIONS: This study was limited by its absence of long-term oncologic data and missing variables. CONCLUSIONS: Compliance with 6 preoperative elements of the American Society of Colon and Rectal Surgeons rectal cancer surgery checklist was associated with significantly improved pathologic outcomes and reduced postoperative morbidity. See Video Abstract at http://links.lww.com/DCR/B80. EL CUMPLIMIENTO CON LOS ELEMENTOS PREOPERATORIOS DE LA LISTA DE VERIFICACIÓN DE CIRUGÍA PARA CÁNCER RECTAL DE LA SOCIEDAD AMERICANA DE CIRUJANOS DE COLON Y RECTO MEJORA LOS RESULTADOS HISTOPATOLÓGICOS Y POSTOPERATORIOS: En 2016, la Sociedad Americana de Cirujanos de Colon y Recto publicó una lista de verificación de cirugía de cáncer de recto que comprende los elementos esenciales de la atención pre, intra y postoperatoria para pacientes sometidos a cirugía de cáncer de recto.Evaluar si el cumplimiento con los elementos preoperatorios de la lista de verificación se asoció con mejores resultados histopatológicos y postoperatorios a 30 días después de la cirugía de cáncer rectal.Estudio de cohorte retrospectiva.Hospitales norteamericanos que contribuyen al Programa Nacional de Mejora de la Calidad Quirúrgica del Colegio Americano de Cirujanos.Pacientes adultos que se sometieron a cirugía electiva de cáncer rectal entre 2016 y 2017.Cumplimiento de la lista de verificación con seis elementos preoperatorios de la lista de verificación.Resultados histopatológicos (estado del margen de resección circunferencial, estado del margen de resección distal, cosecha adecuada de ganglios linfáticos ≥12), morbilidad quirúrgica a 30 días y duración de la estadía.En total, 2,217 pacientes fueron incluidos en el análisis. El cumplimiento individual de los seis ítems disponibles de la lista de verificación preoperatoria fue variable: 91.3% para la documentación previa al tratamiento de la localización del tumor dentro del recto, 86.8% para colonoscopía completa, 84.0% para el marcado preoperatorio apropiado del sitio de estoma, 79.8% para el uso apropiado de radioterapia neoadyuvante, 76.6 % para estadificación locorregional y 70.8% para estadificación distante. Solo 836 (37.7%) pacientes tenían los seis elementos de la lista de verificación completos, mientras que 1,381 (62.3%) no. En comparación con los pacientes sin cumplimiento de la lista de verificación, los pacientes con cumplimiento de la lista de verificación eran más jóvenes (60.0 vs. 63.0 años, p <0.001), pero por lo demás tenían características demográficas similares. En la regresión multivariada, el cumplimiento de la lista de verificación se asoció con menores probabilidades de positividad en el margen de resección circunferencial (OR = 0.47; IC del 95%: 0.31-0.71, p <0.001), mayores probabilidades de una cosecha adecuada de ganglios linfáticos ≥12 (OR = 1.60, IC 95% 1.29-2.00, p <0.001), menor morbilidad quirúrgica (OR = 0.78, IC 95% 0.65-0.95, p = 0.01) y menor duración de estadía (β = -0.87, IC 95% -1.51 - - 0.24, p = 0.007). La asociación entre el cumplimiento de la lista de verificación y las probabilidades reducidas de positividad del margen de resección circunferencial se mantuvo en el análisis de sensibilidad (OR = 0.61; IC del 95%: 0.42-0.88, p = 0.009) al ser ajustado con radiación neoadyuvante.Ausencia de datos oncológicos a largo plazo y variables faltantes.El cumplimiento de seis elementos preoperatorios de la lista de verificación de cirugía de cáncer rectal de la Sociedad Americana de Cirujanos de Colon y Recto se asoció con resultados histopatológicos significativamente mejores y una menor morbilidad postoperatoria. Vea el resumen en video en http://links.lww.com/DCR/B80.",
            "authors": [
                "Garfinkle R.",
                "Vasilevsky C.-A.",
                "Ghitulescu G.",
                "Morin N.",
                "Faria J.",
                "Boutros M."
            ],
            "cit_count": 0,
            "doi": "10.1097/DCR.0000000000001511",
            "journal": "Diseases of the colon and rectum",
            "pmid": "31804269",
            "title": "Compliance With Preoperative Elements of the American Society of Colon and Rectal Surgeons Rectal Cancer Surgery Checklist Improves Pathologic and Postoperative Outcomes",
            "year": "2020-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:verificacion_los_pacientes_con_cumplimiento",
        "biotoolsID": "verificacion_los_pacientes_con_cumplimiento",
        "description": "Compliance With Preoperative Elements of the American Society of Colon and Rectal Surgeons Rectal Cancer Surgery Checklist Improves Pathologic and Postoperative Outcomes.\n\nBACKGROUND:In 2016, the American Society of Colon and Rectal Surgeons published a rectal cancer surgery checklist composed of the essential elements of preoperative, intraoperative, and postoperative care for patients undergoing rectal cancer surgery. OBJECTIVE:The purpose of this study was to assess whether compliance with preoperative checklist elements was associated with improved pathologic and 30-day postoperative outcomes after rectal cancer surgery. DESIGN:This was a retrospective cohort study.\n\n||| HOMEPAGE MISSING!.\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'cumplimiento de seis elementos preoperatorios', 'lista de verificacion de cirugia', 'B80', 'la lista de verificacion'",
        "homepage": "https://www.ncbi.nlm.nih.gov/pubmed/?term=31804269",
        "name": "verificacion los pacientes con cumplimiento"
    }
}