{
    "additionDate": "2023-12-15T11:28:45.790897Z",
    "biotoolsCURIE": "biotools:gpcr-exp",
    "biotoolsID": "gpcr-exp",
    "description": "GPCR-EXP is a database that specializes in curating experimental and predicted structures of G protein-coupled receptors (GPCR). Structure-related data for experimental structures, such as resolution, publication information, and biological ligand, from the Protein Databank (PDB) are extracted and incorporated into the database. Additionally, all GPCRs from the human genome have been modelled using GPCR-I-TASSER and have been included.\n\nEasy-to-read tables have been constructed to faciliate the browsing of:\n\n1. Experimental PDB Structures\n2. Predicted GPCR Structures and Functions for Human Genome\nFurthermore, database statistics can be accessed to provide a glimpse into the current state of GPCR structural biology, while all PDB structures and data are freely available for download.",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://zhanggroup.org/GPCR-EXP/",
    "lastUpdate": "2023-12-15T11:28:45.794381Z",
    "name": "Experimentally-Solved and Predicted GPCR Structures (GPCR-EXP)",
    "owner": "laasfeld",
    "publication": [
        {
            "doi": "10.1016/j.jmb.2020.07.003",
            "metadata": {
                "abstract": "G protein-coupled receptors (GPCRs) are a large family of integral membrane proteins responsible for cellular signal transductions. Identification of therapeutic compounds to regulate physiological processes is an important first step of drug discovery. We proposed MAGELLAN, a novel hierarchical virtual-screening (VS) pipeline, which starts with low-resolution protein structure prediction and structure-based binding-site identification, followed by homologous GPCR detections through structure and orthosteric binding-site comparisons. Ligand profiles constructed from the homologous ligand–GPCR complexes are then used to thread through compound databases for VS. The pipeline was first tested in a large-scale retrospective screening experiment against 224 human Class A GPCRs, where MAGELLAN achieved a median enrichment factor (EF) of 14.38, significantly higher than that using individual ligand profiles. Next, MAGELLAN was examined on 5 and 20 GPCRs from two public VS databases (DUD-E and GPCR-Bench) and resulted in an average EF of 9.75 and 13.70, respectively, which compare favorably with other state-of-the-art docking- and ligand-based methods, including AutoDock Vina (with EF = 1.48/3.16 in DUD-E and GPCR-Bench), DOCK 6 (2.12/3.47 in DUD-E and GPCR-Bench), PoLi (2.2 in DUD-E), and FINDSITECcomb2.0 (2.90 in DUD-E). Detailed data analyses show that the major advantage of MAGELLAN is attributed to the power of ligand profiling, which integrates complementary methods for ligand–GPCR interaction recognition and thus significantly improves the coverage and sensitivity of VS models. Finally, cases studies on opioid and motilin receptors show that new connections between functionally related GPCRs can be visualized in the minimum spanning tree built on the similarities of predicted ligand-binding ensembles, suggesting a novel use of MAGELLAN for GPCR deorphanization.",
                "authors": [
                    {
                        "name": "Chan W.K.B."
                    },
                    {
                        "name": "Zhang Y."
                    }
                ],
                "citationCount": 13,
                "date": "2020-08-07T00:00:00Z",
                "journal": "Journal of Molecular Biology",
                "title": "Virtual Screening of Human Class-A GPCRs Using Ligand Profiles Built on Multiple Ligand–Receptor Interactions"
            },
            "type": [
                "Primary"
            ]
        }
    ]
}
