
{
    "credit": [
        {
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "https://github.com/jakelever/pubrunner/issues"
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://pubrunner.readthedocs.io/en/stable/"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Text mining",
                    "uri": "http://edamontology.org/operation_0306"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Python"
        ],
        "license": "MIT",
        "toolType": [
            "Command-line tool",
            "Library"
        ],
        "topic": [
            {
                "term": "Literature and language",
                "uri": "http://edamontology.org/topic_3068"
            }
        ]
    },
    "link": [
        {
            "type": "REPOSITORY",
            "url": "https://hub.docker.com/r/ncbihackathons/pubrunner/"
        }
    ],
    "publication": [
        {
            "abstract": "© 2017 Anekalla KR et al. Biomedical text mining promises to assist biologists in quickly navigating the combined knowledge in their domain. This would allow improved understanding of the complex interactions within biological systems and faster hypothesis generation. New biomedical research articles are published daily and text mining tools are only as good as the corpus from which they work. Many text mining tools are underused because their results are static and do not reflect the constantly expanding knowledge in the field. In order for biomedical text mining to become an indispensable tool used by researchers, this problem must be addressed. To this end, we present PubRunner, a framework for regularly running text mining tools on the latest publications. PubRunner is lightweight, simple to use, and can be integrated with an existing text mining tool. The workflow involves downloading the latest abstracts from PubMed, executing a user-defined tool, pushing the resulting data to a public FTP or Zenodo dataset, and publicizing the location of these results on the public PubRunner website. We illustrate the use of this tool by re-running the commonly used word2vec tool on the latest PubMed abstracts to generate up-to-date word vector representations for the biomedical domain. This shows a proof of concept that we hope will encourage text mining developers to build tools that truly will aid biologists in exploring the latest publications.",
            "authors": [
                "Busby B.",
                "Anekalla K.R.",
                "Courneya J.P.",
                "Fiorini N.",
                "Lever J.",
                "Muchow M."
            ],
            "cit_count": 0,
            "doi": "10.12688/f1000research.11389.2",
            "journal": "F1000Research",
            "title": "PubRunner: A light-weight framework for updating text mining results",
            "type": "Primary",
            "year": "2017-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:pubrunner",
        "biotoolsID": "pubrunner",
        "description": "Framework which runs on a user defined schedule allowing you to download latest PubMed abstracts, run them through your favorite text mining tool and then uploads the results to public FTP",
        "homepage": "http://www.pubrunner.org/",
        "name": "PubRunner"
    }
}