
{
    "credit": [
        {
            "email": "sergei.strelkov@kuleuven.be",
            "name": "Sergei Strelkov",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "https://github.com/biocryst/IF"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Protein secondary structure prediction (coils)",
                    "uri": "http://edamontology.org/operation_0470"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Python"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Command-line tool",
            "Web application"
        ],
        "topic": [
            {
                "term": "Proteins",
                "uri": "http://edamontology.org/topic_0078"
            },
            {
                "term": "Protein sites, features and motifs",
                "uri": "http://edamontology.org/topic_3510"
            },
            {
                "term": "Protein folding, stability and design",
                "uri": "http://edamontology.org/topic_0130"
            },
            {
                "term": "Protein structure analysis",
                "uri": "http://edamontology.org/topic_2814"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© The Author 2017. Motivation Accurate molecular structure of the protein dimer representing the elementary building block of intermediate filaments (IFs) is essential towards the understanding of the filament assembly, rationalizing their mechanical properties and explaining the effect of disease-related IF mutations. The dimer contains a â 1/4300-residue long α-helical coiled coil which cannot be assessed by either direct experimental structure determination or modelling using standard approaches. At the same time, coiled coils are well-represented in structural databases. Results Here we present CCFold, a generally applicable threading-based algorithm which produces coiled-coil models from protein sequence only. The algorithm is based on a statistical analysis of experimentally determined structures and can handle any hydrophobic repeat patterns in addition to the most common heptads. We demonstrate that CCFold outperforms general-purpose computational folding in terms of accuracy, while being faster by orders of magnitude. By combining the CCFold algorithm and Rosetta folding we generate representative dimer models for all IF protein classes. Availability and implementation The source code is freely available",
            "authors": [
                "Guzenko D.",
                "Strelkov S.V."
            ],
            "cit_count": 0,
            "doi": "10.1093/bioinformatics/btx551",
            "journal": "Bioinformatics",
            "title": "CCFold: Rapid and accurate prediction of coiled-coil structures and application to modelling intermediate filaments",
            "year": "2018-01-15"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:ccfold",
        "biotoolsID": "ccfold",
        "description": "Rapid and accurate prediction of coiled-coil structures.",
        "homepage": "https://pharm.kuleuven.be/apps/biocryst/ccfold.php",
        "name": "CCFold"
    }
}