{
    "additionDate": "2024-03-06T13:14:50.886751Z",
    "biotoolsCURIE": "biotools:c2p_net",
    "biotoolsID": "c2p_net",
    "confidence_flag": "high",
    "credit": [
        {
            "email": "peng.liu@nct-dresden.de",
            "name": "Peng Liu",
            "typeEntity": "Person"
        }
    ],
    "description": "Non-rigid point cloud registration for middle ear diagnostics with endoscopic optical coherence tomography.",
    "editPermission": {
        "type": "private"
    },
    "homepage": "https://gitlab.com/nct_tso_public/c2p-net",
    "lastUpdate": "2024-03-06T13:15:47.937574Z",
    "name": "C2P-Net",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1007/S11548-023-02960-9",
            "metadata": {
                "abstract": "Purpose : Middle ear infection is the most prevalent inflammatory disease, especially among the pediatric population. Current diagnostic methods are subjective and depend on visual cues from an otoscope, which is limited for otologists to identify pathology. To address this shortcoming, endoscopic optical coherence tomography (OCT) provides both morphological and functional in vivo measurements of the middle ear. However, due to the shadow of prior structures, interpretation of OCT images is challenging and time-consuming. To facilitate fast diagnosis and measurement, improvement in the readability of OCT data is achieved by merging morphological knowledge from ex vivo middle ear models with OCT volumetric data, so that OCT applications can be further promoted in daily clinical settings. Methods : We propose C2P-Net: a two-staged non-rigid registration pipeline for complete to partial point clouds, which are sampled from ex vivo and in vivo OCT models, respectively. To overcome the lack of labeled training data, a fast and effective generation pipeline in Blender3D is designed to simulate middle ear shapes and extract in vivo noisy and partial point clouds. Results : We evaluate the performance of C2P-Net through experiments on both synthetic and real OCT datasets. The results demonstrate that C2P-Net is generalized to unseen middle ear point clouds and capable of handling realistic noise and incompleteness in synthetic and real OCT data. Conclusions : In this work, we aim to enable diagnosis of middle ear structures with the assistance of OCT images. We propose C2P-Net: a two-staged non-rigid registration pipeline for point clouds to support the interpretation of in vivo noisy and partial OCT images for the first time. Code is available at: https://gitlab.com/nct_tso_public/c2p-net.",
                "authors": [
                    {
                        "name": "Bodenstedt S."
                    },
                    {
                        "name": "Chen Z."
                    },
                    {
                        "name": "Golde J."
                    },
                    {
                        "name": "Hu Y."
                    },
                    {
                        "name": "Koch E."
                    },
                    {
                        "name": "Li C."
                    },
                    {
                        "name": "Liu P."
                    },
                    {
                        "name": "Morgenstern J."
                    },
                    {
                        "name": "Neudert M."
                    },
                    {
                        "name": "Speidel S."
                    }
                ],
                "date": "2024-01-01T00:00:00Z",
                "journal": "International Journal of Computer Assisted Radiology and Surgery",
                "title": "Non-rigid point cloud registration for middle ear diagnostics with endoscopic optical coherence tomography"
            },
            "pmid": "37328716"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Tomography",
            "uri": "http://edamontology.org/topic_3452"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ]
}
