{
    "additionDate": "2017-04-21T12:12:10Z",
    "biotoolsCURIE": "biotools:mega",
    "biotoolsID": "mega",
    "collectionID": [
        "Animal and Crop Genomics"
    ],
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.megasoftware.net/mantis_bt/mega_feedback_form.php"
        }
    ],
    "description": "Software package for phylogenetic analysis with a graphical user interface. It allows viewing and editing of the aligned input sequence data and provides many tools for phylogenetic and statistical analysis of the alignments.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://www.megasoftware.net/docs"
        }
    ],
    "editPermission": {
        "authors": [
            "animalandcropgenomics",
            "megasoftware",
            "sergitobara"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "DNA substitution modelling",
                    "uri": "http://edamontology.org/operation_0550"
                },
                {
                    "term": "Genetic variation analysis",
                    "uri": "http://edamontology.org/operation_3197"
                },
                {
                    "term": "Phylogenetic tree generation (from molecular sequences)",
                    "uri": "http://edamontology.org/operation_0540"
                },
                {
                    "term": "Phylogenetic tree generation (maximum likelihood and Bayesian methods)",
                    "uri": "http://edamontology.org/operation_0547"
                },
                {
                    "term": "Phylogenetic tree generation (parsimony methods)",
                    "uri": "http://edamontology.org/operation_0545"
                }
            ]
        }
    ],
    "homepage": "http://www.megasoftware.net/",
    "lastUpdate": "2022-06-21T07:52:38.374706Z",
    "license": "Proprietary",
    "name": "MEGA",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "vrindathaker",
    "publication": [
        {
            "doi": "10.1093/bib/bbn017",
            "metadata": {
                "abstract": "The Molecular Evolutionary Genetics Analysis (MEGA) software is a desktop application designed for comparative analysis of homologous gene sequences either from multigene families or from different species with a special emphasis on inferring evolutionary relationships and patterns of DNA and protein evolution. In addition to the tools for statistical analysis of data, MEGA provides many convenient facilities for the assembly of sequence data sets from files or web-based repositories, and it includes tools for visual presentation of the results obtained in the form of interactive phylogenetic trees and evolutionary distance matrices. Here we discuss the motivation, design principles and priorities that have shaped the development of MEGA. We also discuss how MEGA might evolve in the future to assist researchers in their growing need to analyze large data set using new computational methods. © The Author 2008. Published by Oxford University Press.",
                "authors": [
                    {
                        "name": "Dudley J."
                    },
                    {
                        "name": "Kumar S."
                    },
                    {
                        "name": "Nei M."
                    },
                    {
                        "name": "Tamura K."
                    }
                ],
                "citationCount": 2753,
                "date": "2008-07-01T00:00:00Z",
                "journal": "Briefings in Bioinformatics",
                "title": "MEGA: A biologist-centric software for evolutionary analysis of DNA and protein sequences"
            },
            "pmcid": "PMC2562624",
            "pmid": "18417537"
        },
        {
            "doi": "10.1093/bioinformatics/bts507",
            "metadata": {
                "abstract": "There is a growing need in the research community to apply the molecular evolutionary genetics analysis (MEGA) software tool for batch processing a large number of datasets and to integrate it into analysis workflows. Therefore, we now make available the computing core of the MEGA software as a stand-alone executable (MEGA-CC), along with an analysis prototyper (MEGA-Proto). MEGA-CC provides users with access to all the computational analyses available through MEGA's graphical user interface version. This includes methods for multiple sequence alignment, substitution model selection, evolutionary distance estimation, phylogeny inference, substitution rate and pattern estimation, tests of natural selection and ancestral sequence inference. Additionally, we have upgraded the source code for phylogenetic analysis using the maximum likelihood methods for parallel execution on multiple processors and cores. Here, we describe MEGA-CC and outline the steps for using MEGA-CC in tandem with MEGA-Proto for iterative and automated data analysis. © The Author 2012. Published by Oxford University Press. All rights reserved.",
                "authors": [
                    {
                        "name": "Kumar S."
                    },
                    {
                        "name": "Peterson D."
                    },
                    {
                        "name": "Stecher G."
                    },
                    {
                        "name": "Tamura K."
                    }
                ],
                "citationCount": 209,
                "date": "2012-10-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "MEGA-CC: Computing core of molecular evolutionary genetics analysis program for automated and iterative data analysis"
            },
            "pmcid": "PMC3467750",
            "pmid": "22923298"
        },
        {
            "doi": "10.1093/molbev/msy096",
            "metadata": {
                "abstract": "© The Author(s) 2018. Published by Oxford University Press on behalf of the Society for Molecular Biology and Evolution. All rights reserved.The Molecular Evolutionary Genetics Analysis (MEGA) software implements many analytical methods and tools for phylogenomics and phylomedicine. Here, we report a transformation of MEGA to enable cross-platform use on Microsoft Windows and Linux operating systems. MEGA X does not require virtualization or emulation software and provides a uniform user experience across platforms. MEGA X has additionally been upgraded to use multiple computing cores for many molecular evolutionary analyses. MEGA X is available in two interfaces (graphical and command line) and can be downloaded from www.megasoftware.net free of charge.",
                "authors": [
                    {
                        "name": "Knyaz C."
                    },
                    {
                        "name": "Kumar S."
                    },
                    {
                        "name": "Li M."
                    },
                    {
                        "name": "Stecher G."
                    },
                    {
                        "name": "Tamura K."
                    }
                ],
                "citationCount": 13645,
                "date": "2018-06-01T00:00:00Z",
                "journal": "Molecular Biology and Evolution",
                "title": "MEGA X: Molecular evolutionary genetics analysis across computing platforms"
            },
            "pmcid": "PMC5967553",
            "pmid": "29722887"
        },
        {
            "doi": "10.1093/molbev/msz312",
            "metadata": {
                "abstract": "© 2020 The Author(s) 2020. Published by Oxford University Press on behalf of the Society for Molecular Biology and Evolution. All rights reserved.The Molecular Evolutionary Genetics Analysis (MEGA) software enables comparative analysis of molecular sequences in phylogenetics and evolutionary medicine. Here, we introduce the macOS version of the MEGA software. This new version eliminates the need for virtualization and emulation programs previously required to use MEGA on Apple computers. MEGA for macOS utilizes memory and computing resources efficiently for conducting evolutionary analyses on macOS. It has a native Cocoa graphical user interface that is programmed to provide a consistent user experience across macOS, Windows, and Linux. MEGA for macOS is available from www.megasoftware.net free of charge.",
                "authors": [
                    {
                        "name": "Kumar S."
                    },
                    {
                        "name": "Stecher G."
                    },
                    {
                        "name": "Tamura K."
                    }
                ],
                "citationCount": 509,
                "date": "2020-04-01T00:00:00Z",
                "journal": "Molecular Biology and Evolution",
                "title": "Molecular evolutionary genetics analysis (MEGA) for macOS"
            },
            "pmcid": "PMC7086165",
            "pmid": "31904846"
        },
        {
            "doi": "10.1093/molbev/msab120",
            "metadata": {
                "abstract": "© 2021 The Author(s). Published by Oxford University Press on behalf of the Society for Molecular Biology and Evolution.The Molecular Evolutionary Genetics Analysis (MEGA) software has matured to contain a large collection of methods and tools of computational molecular evolution. Here, we describe new additions that make MEGA a more comprehensive tool for building timetrees of species, pathogens, and gene families using rapid relaxed-clock methods. Methods for estimating divergence times and confidence intervals are implemented to use probability densities for calibration constraints for node-dating and sequence sampling dates for tip-dating analyses. They are supported by new options for tagging sequences with spatiotemporal sampling information, an expanded interactive Node Calibrations Editor, and an extended Tree Explorer to display timetrees. Also added is a Bayesian method for estimating neutral evolutionary probabilities of alleles in a species using multispecies sequence alignments and a machine learning method to test for the autocorrelation of evolutionary rates in phylogenies. The computer memory requirements for the maximum likelihood analysis are reduced significantly through reprogramming, and the graphical user interface has been made more responsive and interactive for very big data sets. These enhancements will improve the user experience, quality of results, and the pace of biological discovery. Natively compiled graphical user interface and command-line versions of MEGA11 are available for Microsoft Windows, Linux, and macOS from www.megasoftware.net.",
                "authors": [
                    {
                        "name": "Kumar S."
                    },
                    {
                        "name": "Stecher G."
                    },
                    {
                        "name": "Tamura K."
                    }
                ],
                "citationCount": 327,
                "date": "2021-07-01T00:00:00Z",
                "journal": "Molecular Biology and Evolution",
                "title": "MEGA11: Molecular Evolutionary Genetics Analysis Version 11"
            },
            "pmcid": "PMC8233496",
            "pmid": "33892491",
            "version": "11"
        },
        {
            "doi": "10.1093/molbev/msr121",
            "metadata": {
                "abstract": "Comparative analysis of molecular sequence data is essential for reconstructing the evolutionary histories of species and inferring the nature and extent of selective forces shaping the evolution of genes and species. Here, we announce the release of Molecular Evolutionary Genetics Analysis version 5 (MEGA5), which is a user-friendly software for mining online databases, building sequence alignments and phylogenetic trees, and using methods of evolutionary bioinformatics in basic biology, biomedicine, and evolution. The newest addition in MEGA5 is a collection of maximum likelihood (ML) analyses for inferring evolutionary trees, selecting best-fit substitution models (nucleotide or amino acid), inferring ancestral states and sequences (along with probabilities), and estimating evolutionary rates site-by-site. In computer simulation analyses, ML tree inference algorithms in MEGA5 compared favorably with other software packages in terms of computational efficiency and the accuracy of the estimates of phylogenetic trees, substitution parameters, and rate variation among sites. The MEGA user interface has now been enhanced to be activity driven to make it easier for the use of both beginners and experienced scientists. This version of MEGA is intended for the Windows platform, and it has been configured for effective use on Mac OS X and Linux desktops. It is available free of charge from http://www.megasoftware.net. © The Author 2011. Published by Oxford University Press on behalf of the Society for Molecular Biology and Evolution. All reserved.",
                "authors": [
                    {
                        "name": "Kumar S."
                    },
                    {
                        "name": "Nei M."
                    },
                    {
                        "name": "Peterson D."
                    },
                    {
                        "name": "Peterson N."
                    },
                    {
                        "name": "Stecher G."
                    },
                    {
                        "name": "Tamura K."
                    }
                ],
                "citationCount": 34149,
                "date": "2011-10-01T00:00:00Z",
                "journal": "Molecular Biology and Evolution",
                "title": "MEGA5: Molecular evolutionary genetics analysis using maximum likelihood, evolutionary distance, and maximum parsimony methods"
            },
            "pmcid": "PMC3203626",
            "pmid": "21546353",
            "version": "5"
        },
        {
            "doi": "10.1093/molbev/mst197",
            "metadata": {
                "abstract": "We announce the release of an advanced version of the Molecular Evolutionary Genetics Analysis (MEGA) software, which currently contains facilities for building sequence alignments, inferring phylogenetic histories, and conducting molecular evolutionary analysis. In version 6.0, MEGA now enables the inference of timetrees, as it implements the RelTime method for estimating divergence times for all branching points in a phylogeny. A new Timetree Wizard in MEGA6 facilitates this timetree inference by providing a graphical user interface (GUI) to specify the phylogeny and calibration constraints step-by-step. This version also contains enhanced algorithms to search for the optimal trees under evolutionary criteria and implements a more advanced memory management that can double the size of sequence data sets to which MEGA can be applied. Both GUI and command-line versions of MEGA6 can be downloaded from www.megasoftware.net free of charge. © 2013 The Author.",
                "authors": [
                    {
                        "name": "Filipski A."
                    },
                    {
                        "name": "Kumar S."
                    },
                    {
                        "name": "Peterson D."
                    },
                    {
                        "name": "Stecher G."
                    },
                    {
                        "name": "Tamura K."
                    }
                ],
                "citationCount": 32147,
                "date": "2013-12-01T00:00:00Z",
                "journal": "Molecular Biology and Evolution",
                "title": "MEGA6: Molecular evolutionary genetics analysis version 6.0"
            },
            "pmcid": "PMC3840312",
            "pmid": "24132122",
            "version": "6"
        },
        {
            "doi": "10.1093/molbev/msw054",
            "metadata": {
                "abstract": "© The Author 2016. Published by Oxford University Press on behalf of the Society for Molecular Biology and Evolution. All rights reserved.We present the latest version of the Molecular Evolutionary Genetics Analysis (MEGA) software, which contains many sophisticated methods and tools for phylogenomics and phylomedicine. In this major upgrade, MEGA has been optimized for use on 64-bit computing systems for analyzing larger datasets. Researchers can now explore and analyze tens of thousands of sequences in MEGA. The new version also provides an advanced wizard for building timetrees and includes a new functionality to automatically predict gene duplication events in gene family trees. The 64-bit MEGA is made available in two interfaces: graphical and command line. The graphical user interface (GUI) is a native Microsoft Windows application that can also be used on Mac OS X. The command line MEGA is available as native applications for Windows, Linux, and Mac OS X. They are intended for use in high-throughput and scripted analysis. Both versions are available from www.megasoftware.net free of charge.",
                "authors": [
                    {
                        "name": "Kumar S."
                    },
                    {
                        "name": "Stecher G."
                    },
                    {
                        "name": "Tamura K."
                    }
                ],
                "citationCount": 26821,
                "date": "2016-07-01T00:00:00Z",
                "journal": "Molecular Biology and Evolution",
                "title": "MEGA7: Molecular Evolutionary Genetics Analysis Version 7.0 for Bigger Datasets"
            },
            "pmcid": "PMC8210823",
            "pmid": "27004904",
            "version": "7"
        },
        {
            "doi": "10.1093/bib/5.2.150",
            "metadata": {
                "abstract": "With its theoretical basis firmly established in molecular evolutionary and population genetics, the comparative DNA and protein sequence analysis plays a central role in reconstructing the evolutionary histories of species and multigene families, estimating rates of molecular evolution, and inferring the nature and extent of selective forces shaping the evolution of genes and genomes. The scope of these investigations has now expanded greatly owing to the development of high-throughput sequencing techniques and novel statistical and computational methods. These methods require easy-to-use computer programs. One such effort has been to produce Molecular Evolutionary Genetics Analysis (MEGA) software, with its focus on facilitating the exploration and analysis of the DNA and protein sequence variation from an evolutionary perspective. Currently in its third major release, MEGA3 contains facilities for automatic and manual sequence alignment, web-based mining of databases, inference of the phylogenetic trees, estimation of evolutionary distances and testing evolutionary hypotheses. This paper provides an overview of the statistical methods, computational tools, and visual exploration modules for data input and the results obtainable in MEGA.",
                "authors": [
                    {
                        "name": "Kumar S."
                    },
                    {
                        "name": "Nei M."
                    },
                    {
                        "name": "Tamura K."
                    }
                ],
                "citationCount": 10619,
                "date": "2004-01-01T00:00:00Z",
                "journal": "Briefings in bioinformatics",
                "title": "MEGA3: Integrated software for Molecular Evolutionary Genetics Analysis and sequence alignment."
            },
            "pmid": "15260895",
            "version": "3"
        },
        {
            "doi": "10.1093/bioinformatics/10.2.189",
            "metadata": {
                "abstract": "A computer program package called MEGA has been developed for estimating evolutionary distances, reconstructing phylogenetic trees and computing basic statistical quantities from molecular data. It is written in C++ and is intended to be used on IBM and IBM-compatible personal computers. In this program, various methods for estimating evolutionary distances from nucleotide and amino acid sequence data, three different methods of phylogenetic inference (UPGMA, neighborjoining and maximum parsimony) and two statistical tests of topological differences are included. For the maximum parsimony method, new algorithms of branch-and-bound and heuristic searches are implemented. In addition, MEGA computes statistical quantities such as nucleotide and amino acid frequencies, transition/transversion biases, codon frequencies (codon usage tables), and the number of variable sites in specified segments in nucleotide and amino acid sequences. Advanced on-screen sequence data and phylogenetictree editors facilitate publication-quality outputs with a wide range of printers. Integrated and interactive designs, on-line context-sensitive helps, and a text-file editor make MEGA easy to use. © 1994 Oxford University Press.",
                "authors": [
                    {
                        "name": "Kumar S."
                    },
                    {
                        "name": "Nei M."
                    },
                    {
                        "name": "Tamura K."
                    }
                ],
                "citationCount": 886,
                "date": "1994-04-02T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "MEGA: Molecular evolutionary genetics analysis software for microcomputers"
            },
            "pmid": "8019868",
            "version": "1"
        },
        {
            "doi": "10.1093/bioinformatics/17.12.1244",
            "metadata": {
                "abstract": "We have developed a new software package, Molecular Evolutionary Genetics Analysis version 2 (MEGA2), for exploring and analyzing aligned DNA or protein sequences from an evolutionary perspective. MEGA2 vastly extends the capabilities of MEGA version 1 by: (1) facilitating analyses of large datasets; (2) enabling creation and analyses of groups of sequences; (3) enabling specification of domains and genes; (4) expanding the repertoire of statistical methods for molecular evolutionary studies; and (5) adding new modules for visual representation of input data and output results on the Microsoft Windows platform.",
                "authors": [
                    {
                        "name": "Jakobsen I.B."
                    },
                    {
                        "name": "Kumar S."
                    },
                    {
                        "name": "Nei M."
                    },
                    {
                        "name": "Tamura K."
                    }
                ],
                "citationCount": 4536,
                "date": "2002-01-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "MEGA2: Molecular evolutionary genetics analysis software"
            },
            "pmid": "11751241",
            "version": "2"
        },
        {
            "doi": "10.1093/molbev/msm092",
            "metadata": {
                "abstract": "We announce the release of the fourth version of MEGA software, which expands on the existing facilities for editing DNA sequence data from autosequencers, mining Web-databases, performing automatic and manual sequence alignment, analyzing sequence alignments to estimate evolutionary distances, inferring phylogenetic trees, and testing evolutionary hypotheses. Version 4 includes a unique facility to generate captions, written in figure legend format, in order to provide natural language descriptions of the models and methods used in the analyses. This facility aims to promote a better understanding of the underlying assumptions used in analyses, and of the results generated. Another new feature is the Maximum Composite Likelihood (MCL) method for estimating evolutionary distances between all pairs of sequences simultaneously, with and without incorporating rate variation among sites and substitution pattern heterogeneities among lineages. This MCL method also can be used to estimate transition/transversion bias and nucleotide substitution pattern without knowledge of the phylogenetic tree. This new version is a native 32-bit Windows application with multi-threading and multi-user supports, and it is also available to run in a Linux desktop environment (via the Wine compatibility layer) and on Intel-based Macintosh computers under the Parallels program. The current version of MEGA is available free of charge at http://www.megasoftware.net. © The Author 2007. Published by Oxford University Press on behalf of the Society for Molecular Biology and Evolution. All rights reserved.",
                "authors": [
                    {
                        "name": "Dudley J."
                    },
                    {
                        "name": "Kumar S."
                    },
                    {
                        "name": "Nei M."
                    },
                    {
                        "name": "Tamura K."
                    }
                ],
                "citationCount": 25341,
                "date": "2007-08-01T00:00:00Z",
                "journal": "Molecular Biology and Evolution",
                "title": "MEGA4: Molecular Evolutionary Genetics Analysis (MEGA) software version 4.0"
            },
            "pmid": "17488738",
            "version": "4"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        },
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        },
        {
            "term": "Phylogeny",
            "uri": "http://edamontology.org/topic_0084"
        },
        {
            "term": "Population genetics",
            "uri": "http://edamontology.org/topic_3056"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        }
    ],
    "validated": 1
}
