{
    "additionDate": "2017-04-21T12:12:10Z",
    "biotoolsCURIE": "biotools:mega",
    "biotoolsID": "mega",
    "collectionID": [
        "Animal and Crop Genomics"
    ],
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.megasoftware.net/mantis_bt/mega_feedback_form.php"
        }
    ],
    "description": "Software package for phylogenetic analysis with a graphical user interface. It allows viewing and editing of the aligned input sequence data and provides many tools for phylogenetic and statistical analysis of the alignments.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://www.megasoftware.net/docs"
        }
    ],
    "editPermission": {
        "authors": [
            "animalandcropgenomics"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "DNA substitution modelling",
                    "uri": "http://edamontology.org/operation_0550"
                },
                {
                    "term": "Phylogenetic tree generation (from molecular sequences)",
                    "uri": "http://edamontology.org/operation_0540"
                },
                {
                    "term": "Phylogenetic tree generation (maximum likelihood and Bayesian methods)",
                    "uri": "http://edamontology.org/operation_0547"
                },
                {
                    "term": "Phylogenetic tree generation (parsimony methods)",
                    "uri": "http://edamontology.org/operation_0545"
                },
                {
                    "term": "Genetic variation analysis",
                    "uri": "http://edamontology.org/operation_3197"
                }
            ]
        }
    ],
    "homepage": "http://www.megasoftware.net/",
    "lastUpdate": "2019-01-29T12:07:59Z",
    "license": "Proprietary",
    "name": "MEGA",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "vrindathaker",
    "publication": [
        {
            "metadata": {
                "abstract": "We have developed a new software package, Molecular Evolutionary Genetics Analysis version 2 (MEGA2), for exploring and analyzing aligned DNA or protein sequences from an evolutionary perspective. MEGA2 vastly extends the capabilities of MEGA version 1 by: (1) facilitating analyses of large datasets; (2) enabling creation and analyses of groups of sequences; (3) enabling specification of domains and genes; (4) expanding the repertoire of statistical methods for molecular evolutionary studies; and (5) adding new modules for visual representation of input data and output results on the Microsoft Windows platform.",
                "authors": [
                    {
                        "name": "Kumar S."
                    },
                    {
                        "name": "Tamura K."
                    },
                    {
                        "name": "Jakobsen I.B."
                    },
                    {
                        "name": "Nei M."
                    }
                ],
                "citationCount": 4483,
                "date": "2002-01-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "MEGA2: Molecular evolutionary genetics analysis software"
            },
            "pmid": "11751241"
        },
        {
            "metadata": {
                "abstract": "With its theoretical basis firmly established in molecular evolutionary and population genetics, the comparative DNA and protein sequence analysis plays a central role in reconstructing the evolutionary histories of species and multigene families, estimating rates of molecular evolution, and inferring the nature and extent of selective forces shaping the evolution of genes and genomes. The scope of these investigations has now expanded greatly owing to the development of high-throughput sequencing techniques and novel statistical and computational methods. These methods require easy-to-use computer programs. One such effort has been to produce Molecular Evolutionary Genetics Analysis (MEGA) software, with its focus on facilitating the exploration and analysis of the DNA and protein sequence variation from an evolutionary perspective. Currently in its third major release, MEGA3 contains facilities for automatic and manual sequence alignment, web-based mining of databases, inference of the phylogenetic trees, estimation of evolutionary distances and testing evolutionary hypotheses. This paper provides an overview of the statistical methods, computational tools, and visual exploration modules for data input and the results obtainable in MEGA.",
                "authors": [
                    {
                        "name": "Kumar S."
                    },
                    {
                        "name": "Tamura K."
                    },
                    {
                        "name": "Nei M."
                    }
                ],
                "citationCount": 10434,
                "date": "2004-01-01T00:00:00Z",
                "journal": "Briefings in bioinformatics",
                "title": "MEGA3: Integrated software for Molecular Evolutionary Genetics Analysis and sequence alignment."
            },
            "pmid": "15260895"
        },
        {
            "metadata": {
                "abstract": "A computer program package called MEGA has been developed for estimating evolutionary distances, reconstructing phylogenetic trees and computing basic statistical quantities from molecular data. It is written in C++ and is intended to be used on IBM and IBM-compatible personal computers. In this program, various methods for estimating evolutionary distances from nucleotide and amino acid sequence data, three different methods of phylogenetic inference (UPGMA, neighborjoining and maximum parsimony) and two statistical tests of topological differences are included. For the maximum parsimony method, new algorithms of branch-and-bound and heuristic searches are implemented. In addition, MEGA computes statistical quantities such as nucleotide and amino acid frequencies, transition/transversion biases, codon frequencies (codon usage tables), and the number of variable sites in specified segments in nucleotide and amino acid sequences. Advanced on-screen sequence data and phylogenetictree editors facilitate publication-quality outputs with a wide range of printers. Integrated and interactive designs, on-line context-sensitive helps, and a text-file editor make MEGA easy to use. © 1994 Oxford University Press.",
                "authors": [
                    {
                        "name": "Kumar S."
                    },
                    {
                        "name": "Tamura K."
                    },
                    {
                        "name": "Nei M."
                    }
                ],
                "citationCount": 813,
                "date": "1994-04-02T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "MEGA: Molecular evolutionary genetics analysis software for microcomputers"
            },
            "pmid": "8019868"
        },
        {
            "metadata": {
                "abstract": "We announce the release of the fourth version of MEGA software, which expands on the existing facilities for editing DNA sequence data from autosequencers, mining Web-databases, performing automatic and manual sequence alignment, analyzing sequence alignments to estimate evolutionary distances, inferring phylogenetic trees, and testing evolutionary hypotheses. Version 4 includes a unique facility to generate captions, written in figure legend format, in order to provide natural language descriptions of the models and methods used in the analyses. This facility aims to promote a better understanding of the underlying assumptions used in analyses, and of the results generated. Another new feature is the Maximum Composite Likelihood (MCL) method for estimating evolutionary distances between all pairs of sequences simultaneously, with and without incorporating rate variation among sites and substitution pattern heterogeneities among lineages. This MCL method also can be used to estimate transition/transversion bias and nucleotide substitution pattern without knowledge of the phylogenetic tree. This new version is a native 32-bit Windows application with multi-threading and multi-user supports, and it is also available to run in a Linux desktop environment (via the Wine compatibility layer) and on Intel-based Macintosh computers under the Parallels program. The current version of MEGA is available free of charge at http://www.megasoftware.net. © The Author 2007. Published by Oxford University Press on behalf of the Society for Molecular Biology and Evolution. All rights reserved.",
                "authors": [
                    {
                        "name": "Tamura K."
                    },
                    {
                        "name": "Dudley J."
                    },
                    {
                        "name": "Nei M."
                    },
                    {
                        "name": "Kumar S."
                    }
                ],
                "citationCount": 23740,
                "date": "2007-08-01T00:00:00Z",
                "journal": "Molecular Biology and Evolution",
                "title": "MEGA4: Molecular Evolutionary Genetics Analysis (MEGA) software version 4.0"
            },
            "pmid": "17488738"
        },
        {
            "metadata": {
                "abstract": "Comparative analysis of molecular sequence data is essential for reconstructing the evolutionary histories of species and inferring the nature and extent of selective forces shaping the evolution of genes and species. Here, we announce the release of Molecular Evolutionary Genetics Analysis version 5 (MEGA5), which is a user-friendly software for mining online databases, building sequence alignments and phylogenetic trees, and using methods of evolutionary bioinformatics in basic biology, biomedicine, and evolution. The newest addition in MEGA5 is a collection of maximum likelihood (ML) analyses for inferring evolutionary trees, selecting best-fit substitution models (nucleotide or amino acid), inferring ancestral states and sequences (along with probabilities), and estimating evolutionary rates site-by-site. In computer simulation analyses, ML tree inference algorithms in MEGA5 compared favorably with other software packages in terms of computational efficiency and the accuracy of the estimates of phylogenetic trees, substitution parameters, and rate variation among sites. The MEGA user interface has now been enhanced to be activity driven to make it easier for the use of both beginners and experienced scientists. This version of MEGA is intended for the Windows platform, and it has been configured for effective use on Mac OS X and Linux desktops. It is available free of charge from http://www.megasoftware.net. © The Author 2011. Published by Oxford University Press on behalf of the Society for Molecular Biology and Evolution. All reserved.",
                "authors": [
                    {
                        "name": "Tamura K."
                    },
                    {
                        "name": "Peterson D."
                    },
                    {
                        "name": "Peterson N."
                    },
                    {
                        "name": "Stecher G."
                    },
                    {
                        "name": "Nei M."
                    },
                    {
                        "name": "Kumar S."
                    }
                ],
                "citationCount": 32632,
                "date": "2011-10-01T00:00:00Z",
                "journal": "Molecular Biology and Evolution",
                "title": "MEGA5: Molecular evolutionary genetics analysis using maximum likelihood, evolutionary distance, and maximum parsimony methods"
            },
            "pmid": "21546353"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        },
        {
            "term": "Phylogeny",
            "uri": "http://edamontology.org/topic_0084"
        },
        {
            "term": "Population genetics",
            "uri": "http://edamontology.org/topic_3056"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        }
    ],
    "validated": 1
}