{
    "additionDate": "2019-11-14T19:55:59Z",
    "biotoolsCURIE": "biotools:SSNpipe",
    "biotoolsID": "SSNpipe",
    "confidence_flag": "medium",
    "credit": [
        {
            "email": "bernard.henrissat@afmb.univ-mrs.fr",
            "name": "Bernard Henrissat",
            "typeEntity": "Person"
        },
        {
            "email": "brumer@msl.ubc.ca",
            "name": "Harry Brumer",
            "orcidid": "https://orcid.org/0000-0002-0101-862X",
            "typeEntity": "Person"
        }
    ],
    "description": "> MEDIUM CONFIDENCE! | > CORRECT NAME OF TOOL COULD ALSO BE 'GH16' | A subfamily roadmap of the evolutionarily diverse glycoside hydrolase family 16 (GH16) | a GUI to Simplify the Generation of Sequence Similarity Networks | SSNpipe is a Python program, and independent all-inclusive executable binary files for most popular operating systems are freely available in release page | Please be aware that SSNpipe and all python Tkinter applications are unable to run on MacOS Mojave 10.14.6, due to an unidentified bug in the MacOS system. This issue should be patched in the soon to be released MacOS Catalina 10.15, click here for more information)",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://github.com/ahvdk/SSNpipe",
    "language": [
        "Python"
    ],
    "lastUpdate": "2019-11-14T19:55:59Z",
    "license": "GPL-3.0",
    "name": "SSNpipe",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1074/JBC.RA119.010619",
            "metadata": {
                "abstract": "© 2019 American Society for Biochemistry and Molecular Biology Inc.. All rights reserved.Glycoside hydrolase family (GH) 16 comprises a large and taxonomically diverse family of glycosidases and transglycosidases that adopt a common β-jelly-roll fold and are active on a range of terrestrial and marine polysaccharides. Presently, broadly insightful sequence-function correlations in GH16 are hindered by a lack of a systematic subfamily structure. To fill this gap, we have used a highly scalable protein sequence similarity network analysis to delineate nearly 23,000 GH16 sequences into 23 robust subfamilies, which are strongly supported by hidden Markov model and maximum likelihood molecular phylogenetic analyses. Subsequent evaluation of over 40 experimental three-dimensional structures has highlighted key tertiary structural differences, predominantly manifested in active-site loops, that dictate substrate specificity across the GH16 evolutionary landscape. As for other large GH families (i.e. GH5, GH13, and GH43), this new subfamily classification provides a roadmap for functional glycogenomics that will guide future bioinformatics and experimental structure-function analyses. The GH16 subfamily classification is publicly available in the CAZy database. The sequence similarity network workflow used here, SSNpipe, is freely available from GitHub.",
                "authors": [
                    {
                        "name": "Viborg A.H."
                    },
                    {
                        "name": "Terrapon N."
                    },
                    {
                        "name": "Lombard V."
                    },
                    {
                        "name": "Michel G."
                    },
                    {
                        "name": "Czjzek M."
                    },
                    {
                        "name": "Henrissat B."
                    },
                    {
                        "name": "Brumer H."
                    }
                ],
                "citationCount": 15,
                "date": "2019-11-01T00:00:00Z",
                "journal": "Journal of Biological Chemistry",
                "title": "A subfamily roadmap of the evolutionarily diverse glycoside hydrolase family 16 (GH16)"
            },
            "pmcid": "PMC6827312",
            "pmid": "31501245"
        }
    ],
    "topic": [
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        },
        {
            "term": "Sequence sites, features and motifs",
            "uri": "http://edamontology.org/topic_0160"
        },
        {
            "term": "Enzymes",
            "uri": "http://edamontology.org/topic_0821"
        }
    ]
}