{
    "name": "Off-Spotter", 
    "description": "Tool that when presented with a candidate gRNA and a PAM, quickly and exhaustively identifies all genomic sites that are identical or nearly-identical to the gRNA and also satisfy the PAM constraint.", 
    "homepage": "https://cm.jefferson.edu/Off-Spotter/", 
    "biotoolsID": "off-spotter", 
    "biotoolsCURIE": "biotools:off-spotter", 
    "version": [], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_3209", 
                    "term": "Genome comparison"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Web application"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_0654", 
            "term": "DNA"
        }, 
        {
            "uri": "http://edamontology.org/topic_0622", 
            "term": "Genomics"
        }, 
        {
            "uri": "http://edamontology.org/topic_3678", 
            "term": "Experimental design and studies"
        }
    ], 
    "operatingSystem": [
        "Linux", 
        "Windows", 
        "Mac"
    ], 
    "language": [
        "C++", 
        "C"
    ], 
    "license": null, 
    "collectionID": [], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [
        {
            "url": "http://www.mybiosoftware.com/off-spotter-genomic-lookalikes-for-designing-crisprcas-guide-rnas.html", 
            "type": "Registry", 
            "note": null
        }
    ], 
    "download": [], 
    "documentation": [
        {
            "url": "https://cm.jefferson.edu/downloads/off-spotter-help/", 
            "type": "General", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": null, 
            "pmid": "25630343", 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "\"Off-Spotter\": Very fast and exhaustive enumeration of genomic lookalikes for designing CRISPR/Cas guide RNAs", 
                "abstract": "© Pliatsika and Rigoutsos; licensee BioMed Central.Background: CRISPR/Cas (Clustered Regularly Interspaced Short Palindromic Repeats/CRISPR associated nucleases) is a powerful component of the prokaryotic immune system that has been adapted for targeted genetic engineering in higher organisms. A key element of CRISPR/Cas is the \"guide\" RNA (gRNA) that is ~20 nucleotides (nts) in length and designed to be complementary to the intended target site. An integral requirement of the CRISPR/Cas system is that the target site be followed by a protospacer adjacent motif (PAM). Care needs to be exercised during gRNA design to avoid unintended (\"off-target\") interactions. Results: We designed and implemented the Off-Spotter algorithm to assist with the design of optimal gRNAs. When presented with a candidate gRNA sequence and a PAM, Off-Spotter quickly and exhaustively identifies all genomic sites that satisfy the PAM constraint and are identical or nearly-identical to the provided gRNA. Off-Spotter achieves its extreme performance through purely algorithmic means and not through hardware accelerators such as graphical processing units (GPUs). Off-Spotter also allows the user to identify on-the-fly how many and which nucleotides of the gRNA comprise the \"seed\". Off-Spotter's output includes a histogram showing the number of potential off-targets as a function of the number of mismatches. The output also includes for each potential off-target the site's genomic location, a human genome browser hyperlink to the corresponding location, genomic annotation in the vicinity of the off-target, GC content, etc. Conclusion: Off-Spotter is very fast and flexible and can help in the design of optimal gRNAs by providing several PAM choices, a run-time definition of the seed and of the allowed number of mismatches, and a flexible output interface that allows sorting of the results, optional viewing/hiding of columns, etc. A key element of Off-Spotter is that it does not have a rigid definition of the seed: instead, the user can declare both the seed's location and extent on-the-fly. We expect that this flexibility in combination with Off-Spotter's speed and richly annotated output will enable experimenters to interactively and quickly explore different scenarios and gRNA possibilities. Reviewed: This article was reviewed by Dr Eugene Koonin and Dr Frank Eisenhaber.", 
                "date": "2015-01-29T00:00:00Z", 
                "citationCount": 22, 
                "authors": [
                    {
                        "name": "Pliatsika V."
                    }, 
                    {
                        "name": "Rigoutsos I."
                    }
                ], 
                "journal": "Biology Direct"
            }
        }
    ], 
    "credit": [
        {
            "name": "Isidore Rigoutsos", 
            "email": "Isidore.Rigoutsos@jefferson.edu", 
            "url": "https://cm.jefferson.edu/", 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "mbs_import", 
    "additionDate": "2017-08-03T18:53:10Z", 
    "lastUpdate": "2018-12-10T12:58:51Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 1, 
    "homepage_status": 0, 
    "elixir_badge": 0
}