{
    "additionDate": "2018-08-05T09:44:24Z",
    "biotoolsCURIE": "biotools:ufboot2",
    "biotoolsID": "ufboot2",
    "collectionID": [
        "IQ-TREE"
    ],
    "credit": [
        {
            "email": "vinhls@vnu.edu.vn",
            "name": "Le Sy Vinh",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Improving the Ultrafast Bootstrap Approximation.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://www.iqtree.org/doc/"
        }
    ],
    "editPermission": {
        "authors": [
            "sergitobara"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Phylogenetic tree analysis",
                    "uri": "http://edamontology.org/operation_0324"
                }
            ]
        }
    ],
    "homepage": "http://www.iqtree.org/",
    "lastUpdate": "2022-07-05T16:29:37.096445Z",
    "name": "UFBoot2",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "otherID": [
        {
            "type": "rrid",
            "value": "RRID:SCR_017254"
        }
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1093/molbev/mst024",
            "metadata": {
                "abstract": "Nonparametric bootstrap has been a widely used tool in phylogenetic analysis to assess the clade support of phylogenetic trees. However, with the rapidly growing amount of data, this task remains a computational bottleneck. Recently, approximation methods such as the RAxML rapid bootstrap (RBS) and the Shimodaira-Hasegawa-like approximate likelihood ratio test have been introduced to speed up the bootstrap. Here, we suggest an ultrafast bootstrap approximation approach (UFBoot) to compute the support of phylogenetic groups in maximum likelihood (ML) based trees. To achieve this, we combine the resampling estimated log-likelihood method with a simple but effective collection scheme of candidate trees. We also propose a stopping rule that assesses the convergence of branch support values to automatically determine when to stop collecting candidate trees. UFBoot achieves a median speed up of 3.1 (range: 0.66-33.3) to 10.2 (range: 1.32-41.4) compared with RAxML RBS for real DNA and amino acid alignments, respectively. Moreover, our extensive simulations show that UFBoot is robust against moderate model violations and the support values obtained appear to be relatively unbiased compared with the conservative standard bootstrap. This provides a more direct interpretation of the bootstrap support. We offer an efficient and easy-to-use software (available at http://www.cibiv.at/software/iqtree) to perform the UFBoot analysis with ML tree inference. © 2013 The Author.",
                "authors": [
                    {
                        "name": "Minh B.Q."
                    },
                    {
                        "name": "Nguyen M.A.T."
                    },
                    {
                        "name": "Von Haeseler A."
                    }
                ],
                "citationCount": 1653,
                "date": "2013-05-01T00:00:00Z",
                "journal": "Molecular Biology and Evolution",
                "title": "Ultrafast approximation for phylogenetic bootstrap"
            },
            "pmcid": "PMC3670741",
            "pmid": "23418397"
        },
        {
            "doi": "10.1093/molbev/msx281",
            "metadata": {
                "abstract": "© The Author 2017.The standard bootstrap (SBS), despite being computationally intensive, is widely used in maximum likelihood phylogenetic analyses. We recently proposed the ultrafast bootstrap approximation (UFBoot) to reduce computing time while achievingmore unbiased branch supports than SBS undermildmodel violations. UFBoot has been steadily adopted as an efficient alternative to SBS and other bootstrap approaches. Here, we present UFBoot2, which substantially accelerates UFBoot and reduces the risk of overestimating branch supports due to polytomies or severe model violations. Additionally, UFBoot2 provides suitable bootstrap resampling strategies for phylogenomic data. UFBoot2 is 778 times (median) faster than SBS and 8.4 times (median) faster than RAxML rapid bootstrap on tested data sets. UFBoot2 is implemented in the IQ-TREE software package version 1.6 and freely.",
                "authors": [
                    {
                        "name": "Chernomor O."
                    },
                    {
                        "name": "Hoang D.T."
                    },
                    {
                        "name": "Minh B.Q."
                    },
                    {
                        "name": "Vinh L.S."
                    },
                    {
                        "name": "Von Haeseler A."
                    }
                ],
                "citationCount": 2343,
                "date": "2018-02-01T00:00:00Z",
                "journal": "Molecular Biology and Evolution",
                "title": "UFBoot2: Improving the ultrafast bootstrap approximation"
            },
            "pmcid": "PMC5850222",
            "pmid": "29077904"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Evolutionary biology",
            "uri": "http://edamontology.org/topic_3299"
        },
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        }
    ],
    "validated": 1
}
