{
    "additionDate": "2017-03-27T11:53:52Z",
    "biotoolsCURIE": "biotools:ccdb",
    "biotoolsID": "ccdb",
    "credit": [
        {
            "email": "smagarwal@yahoo.com",
            "name": "Dr. Subhash M. Agarwal",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "The Cervical Cancer gene DataBase is a manually curated catalog of experimentally validated genes that are involved in the different stages of cervical carcinogenesis. Each record contains details related to gene. It provides information on microRNA altered in cervical cancer as well as search facility for querying, several browse options and an online tool for sequence similarity search.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://crdd.osdd.net/raghava/ccdb/CCDB_Help.ppt"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence similarity search",
                    "uri": "http://edamontology.org/operation_0346"
                },
                {
                    "term": "Gene-set enrichment analysis",
                    "uri": "http://edamontology.org/operation_2436"
                },
                {
                    "term": "Structural similarity search",
                    "uri": "http://edamontology.org/operation_0360"
                },
                {
                    "term": "Gene expression profiling",
                    "uri": "http://edamontology.org/operation_0314"
                },
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                }
            ]
        }
    ],
    "homepage": "http://crdd.osdd.net/raghava/ccdb",
    "lastUpdate": "2018-12-10T12:58:59Z",
    "name": "CCDB",
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "The Cervical Cancer gene DataBase (CCDB, http:// crdd.osdd.net/raghava/ ccdb) is a manually curated catalog of experimentally validated genes that are thought, or are known to be involved in the different stages of cervical carcinogenesis. In spite of the large women population that is presently affected from this malignancy still at present, no database exists that catalogs information on genes associated with cervical cancer. Therefore, we have compiled 537 genes in CCDB that are linked with cervical cancer causation processes such as methylation, gene amplification, mutation, polymorphism and change in expression level, as evident from published literature. Each record contains details related to gene like architecture (exon-intron structure), location, function, sequences (mRNA/CDS/protein), ontology, interacting partners, homology to other eukaryotic genomes, structure and links to other public databases, thus augmenting CCDB with external data. Also, manually curated literature references have been provided to support the inclusion of the gene in the database and establish its association with cervix cancer. In addition, CCDB provides information on microRNA altered in cervical cancer as well as search facility for querying, several browse options and an online tool for sequence similarity search, thereby providing researchers with easy access to the latest information on genes involved in cervix cancer. © The Author(s) 2010.",
                "authors": [
                    {
                        "name": "Agarwal S.M."
                    },
                    {
                        "name": "Raghav D."
                    },
                    {
                        "name": "Singh H."
                    },
                    {
                        "name": "Raghava G.P.S."
                    }
                ],
                "citationCount": 56,
                "date": "2011-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "CCDB: A curated database of genes involved in cervix cancer"
            },
            "pmid": "21045064"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ],
    "validated": 1
}