{
    "additionDate": "2024-05-23T23:03:38.117332Z",
    "biotoolsCURIE": "biotools:metalo",
    "biotoolsID": "metalo",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "description": "Metabolic analysis of logical models extracted from molecular interaction maps.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Mapping",
                    "uri": "http://edamontology.org/operation_2429"
                },
                {
                    "term": "Metabolic network modelling",
                    "uri": "http://edamontology.org/operation_3660"
                },
                {
                    "term": "Metabolic pathway prediction",
                    "uri": "http://edamontology.org/operation_3929"
                }
            ]
        }
    ],
    "homepage": "https://pypi.org/project/metalo/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T13:57:05.842129Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://gitlab.inria.fr/soliman/metalo"
        }
    ],
    "name": "MetaLo",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1515/jib-2023-0048",
            "metadata": {
                "abstract": "Molecular interaction maps (MIMs) are static graphical representations depicting complex biochemical networks that can be formalized using one of the Systems Biology Graphical Notation languages. Regardless of their extensive coverage of various biological processes, they are limited in terms of dynamic insights. However, MIMs can serve as templates for developing dynamic computational models. We present MetaLo, an open-source Python package that enables the coupling of Boolean models inferred from process description MIMs with generic core metabolic networks. MetaLo provides a framework to study the impact of signaling cascades, gene regulation processes, and metabolic flux distribution of central energy production pathways. MetaLo computes the Boolean model's asynchronous asymptotic behavior, through the identification of trap-spaces, and extracts metabolic constraints to contextualize the generic metabolic network. MetaLo is able to handle large-scale Boolean models and genome-scale metabolic models without requiring kinetic information or manual tuning. The framework behind MetaLo enables in depth analysis of the regulatory model, and may allow tackling a lack of omics data in poorly addressed biological fields to contextualize generic metabolic networks along with improper automatic reconstructions of cell- and/or disease-specific metabolic networks. MetaLo is available at https://pypi.org/project/metalo/ under the terms of the GNU General Public License v3.",
                "authors": [
                    {
                        "name": "Aghakhani S."
                    },
                    {
                        "name": "Niarakis A."
                    },
                    {
                        "name": "Soliman S."
                    }
                ],
                "date": "2024-03-01T00:00:00Z",
                "journal": "Journal of integrative bioinformatics",
                "title": "MetaLo: metabolic analysis of Logical models extracted from molecular interaction maps"
            },
            "pmcid": "PMC11293895",
            "pmid": "38314776"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Endocrinology and metabolism",
            "uri": "http://edamontology.org/topic_3407"
        },
        {
            "term": "Fluxomics",
            "uri": "http://edamontology.org/topic_3955"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
