{
    "additionDate": "2017-08-03T19:08:27Z",
    "biotoolsCURIE": "biotools:stabs",
    "biotoolsID": "stabs",
    "credit": [
        {
            "email": "benjamin.hofner@pei.de",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://benjaminhofner.de/"
        }
    ],
    "description": "An R package for Stability selection. Resampling procedures to assess the stability of selected variables with additional finite sample error control for high-dimensional variable selection procedures such as Lasso or boosting.",
    "documentation": [
        {
            "type": "General",
            "url": "https://cran.r-project.org/web/packages/stabs/README.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Statistical calculation",
                    "uri": "http://edamontology.org/operation_2238"
                }
            ]
        }
    ],
    "homepage": "http://cran.r-project.org/web/packages/stabs/index.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-10T12:58:51Z",
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/stabs-stability-selection-with-error-control.html"
        }
    ],
    "name": "stabs",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "© 2015 Hofner et al. Background: Modern biotechnologies often result in high-dimensional data sets with many more variables than observations (n < < p). These data sets pose new challenges to statistical analysis: Variable selection becomes one of the most important tasks in this setting. Similar challenges arise if in modern data sets from observational studies, e.g., in ecology, where flexible, non-linear models are fitted to high-dimensional data. We assess the recently proposed flexible framework for variable selection called stability selection. By the use of resampling procedures, stability selection adds a finite sample error control to high-dimensional variable selection procedures such as Lasso or boosting. We consider the combination of boosting and stability selection and present results from a detailed simulation study that provide insights into the usefulness of this combination. The interpretation of the used error bounds is elaborated and insights for practical data analysis are given. Results: Stability selection with boosting was able to detect influential predictors in high-dimensional settings while controlling the given error bound in various simulation scenarios. The dependence on various parameters such as the sample size, the number of truly influential variables or tuning parameters of the algorithm was investigated. The results were applied to investigate phenotype measurements in patients with autism spectrum disorders using a log-linear interaction model which was fitted by boosting. Stability selection identified five differentially expressed amino acid pathways. Conclusion: Stability selection is implemented in the freely available R package stabs (http://CRAN.R-project.org/package=stabs). It proved to work well in high-dimensional settings with more predictors than observations for both, linear and additive models. The original version of stability selection, which controls the per-family error rate, is quite conservative, though, this is much less the case for its improvement, complementary pairs stability selection. Nevertheless, care should be taken to appropriately specify the error bound.",
                "authors": [
                    {
                        "name": "Hofner B."
                    },
                    {
                        "name": "Boccuto L."
                    },
                    {
                        "name": "Goker M."
                    }
                ],
                "citationCount": 22,
                "date": "2015-05-06T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Controlling false discoveries in high-dimensional situations: Boosting with stability selection"
            },
            "pmid": "25943565"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        },
        {
            "term": "Ecology",
            "uri": "http://edamontology.org/topic_0610"
        }
    ],
    "validated": 1
}