{
    "additionDate": "2017-08-20T15:01:01Z",
    "biotoolsCURIE": "biotools:alphaimpute",
    "biotoolsID": "alphaimpute",
    "collectionID": [
        "Animal and Crop Genomics"
    ],
    "cost": "Free of charge (with restrictions)",
    "credit": [
        {
            "email": "john.hickey@roslin.ed.ac.uk",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.alphagenes.roslin.ed.ac.uk/forums/forum/alphaimpute/"
        }
    ],
    "description": "Impute and phase genotype data in populations with pedigree information available. The program uses segregation analysis and haplotype library imputation to impute alleles and genotypes.",
    "documentation": [
        {
            "note": "Manual link available on homepage.",
            "type": [
                "User manual"
            ],
            "url": "https://sites.google.com/site/hickeyjohn/alphaimpute"
        }
    ],
    "editPermission": {
        "authors": [
            "animalandcropgenomics"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Imputation",
                    "uri": "http://edamontology.org/operation_3557"
                }
            ]
        }
    ],
    "homepage": "https://sites.google.com/site/hickeyjohn/alphaimpute",
    "language": [
        "Fortran"
    ],
    "lastUpdate": "2020-01-19T17:47:47Z",
    "license": "Not licensed",
    "name": "AlphaImpute",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "admin",
    "publication": [
        {
            "doi": "10.1186/1297-9686-44-9",
            "metadata": {
                "abstract": "Background: Efficient, robust, and accurate genotype imputation algorithms make large-scale application of genomic selection cost effective. An algorithm that imputes alleles or allele probabilities for all animals in the pedigree and for all genotyped single nucleotide polymorphisms (SNP) provides a framework to combine all pedigree, genomic, and phenotypic information into a single-stage genomic evaluation. Methods: An algorithm was developed for imputation of genotypes in pedigreed populations that allows imputation for completely ungenotyped animals and for low-density genotyped animals, accommodates a wide variety of pedigree structures for genotyped animals, imputes unmapped SNP, and works for large datasets. The method involves simple phasing rules, long-range phasing and haplotype library imputation and segregation analysis. Results: Imputation accuracy was high and computational cost was feasible for datasets with pedigrees of up to 25 000 animals. The resulting single-stage genomic evaluation increased the accuracy of estimated genomic breeding values compared to a scenario in which phenotypes on relatives that were not genotyped were ignored. Conclusions: The developed imputation algorithm and software and the resulting single-stage genomic evaluation method provide powerful new ways to exploit imputation and to obtain more accurate genetic evaluations. © 2012 Hickey et al.; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Hickey J.M."
                    },
                    {
                        "name": "Kinghorn B.P."
                    },
                    {
                        "name": "Tier B."
                    },
                    {
                        "name": "Van Der Werf J.H."
                    },
                    {
                        "name": "Cleveland M.A."
                    }
                ],
                "citationCount": 64,
                "date": "2012-06-25T00:00:00Z",
                "journal": "Genetics Selection Evolution",
                "title": "A phasing and imputation method for pedigreed populations that results in a single-stage genomic evaluation"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Population genetics",
            "uri": "http://edamontology.org/topic_3056"
        }
    ],
    "validated": 1
}