{
    "additionDate": "2020-01-14T09:31:41Z",
    "biotoolsCURIE": "biotools:HIO",
    "biotoolsID": "HIO",
    "confidence_flag": "tool",
    "description": "A Tool for Unifying Hearing Impairment Knowledge to Enhance Collaborative Research.\n\nThe Hearing Impairment Ontology (HIO) is a collaboratively developed resource by a group of experts in different aspects of hearing impairment (HI) to provide a common controlled HI terminology and concepts. The HIO will allow researchers and clinicians alike to readily access standardised HI-related knowledge in a single location and promote collaborations and HI information sharing, including epidemiological, socio-environmental, biomedical, genetic and phenotypic information. It is worth noting, this ontology provides an illustration of the adaptability of the Sickle Cell Disease Ontology framework for use in developing a disease-specific ontology.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Ontology visualisation",
                    "uri": "http://edamontology.org/operation_3559"
                }
            ]
        }
    ],
    "homepage": "https://bioportal.bioontology.org/ontologies/HIO",
    "language": [
        "Shell"
    ],
    "lastUpdate": "2024-11-24T20:56:11.007090Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/hiodev/hi-ontology"
        }
    ],
    "name": "HIO",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.3390/genes10120960",
            "metadata": {
                "abstract": "Hearing impairment (HI) is a common sensory disorder that is defined as the partial or complete inability to detect sound in one or both ears. This diverse pathology is associated with a myriad of phenotypic expressions and can be non‐syndromic or syndromic. HI can be caused by various genetic, environmental, and/or unknown factors. Some ontologies capture some HI forms, phenotypes, and syndromes, but there is no comprehensive knowledge portal which includes aspects specific to the HI disease state. This hampers inter‐study comparability, integration, and interoperability within and across disciplines. This work describes the HI Ontology (HIO) that was developed based on the Sickle Cell Disease Ontology (SCDO) model. This is a collaboratively developed resource built around the ʹHearing Impairmentʹ concept by a group of experts in different aspects of HI and ontologies. HIO is the first comprehensive, standardized, hierarchical, and logical representation of existing HI knowledge. HIO allows researchers and clinicians alike to readily access standardized HI‐related knowledge in a single location and promotes collaborations and HI information sharing, including epidemiological, socio‐environmental, biomedical, genetic, and phenotypic information. Furthermore, this ontology illustrates the adaptability of the SCDO framework for use in developing a disease‐specific ontology.",
                "authors": [
                    {
                        "name": "Adadey S.M."
                    },
                    {
                        "name": "Haendel M."
                    },
                    {
                        "name": "Hotchkiss J."
                    },
                    {
                        "name": "Jupp S."
                    },
                    {
                        "name": "Manyisa N."
                    },
                    {
                        "name": "Mazandu G.K."
                    },
                    {
                        "name": "Mnika K."
                    },
                    {
                        "name": "Mulder N.J."
                    },
                    {
                        "name": "Nembaware V."
                    },
                    {
                        "name": "Oluwole O.G."
                    },
                    {
                        "name": "Vasilevsky N."
                    },
                    {
                        "name": "Wonkam A."
                    },
                    {
                        "name": "Wonkam E."
                    },
                    {
                        "name": "Yalcouye A."
                    }
                ],
                "citationCount": 7,
                "date": "2019-12-01T00:00:00Z",
                "journal": "Genes",
                "title": "The hearing impairment ontology: A tool for unifying hearing impairment knowledge to enhance collaborative research"
            },
            "pmcid": "PMC6947307",
            "pmid": "31766582"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Ontology and terminology",
            "uri": "http://edamontology.org/topic_0089"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Public health and epidemiology",
            "uri": "http://edamontology.org/topic_3305"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ],
    "validated": 1
}
