{
    "additionDate": "2017-01-17T15:03:50Z",
    "biotoolsCURIE": "biotools:hibag",
    "biotoolsID": "hibag",
    "collectionID": [
        "BioConductor"
    ],
    "credit": [
        {
            "email": "zhengx@u.washington.edu",
            "name": "Xiuwen Zheng",
            "orcidid": "http://orcid.org/0000-0002-1390-0708",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "It is a software package for imputing HLA types using SNP data, and relies on a training set of HLA and SNP genotypes. It can be used by researchers with published parameter estimates instead of requiring access to large training sample datasets. It combines the concepts of attribute bagging (improves the accuracy and stability of classifier ensembles using bootstrap aggregating and random variable selection), an ensemble classifier method, with haplotype inference for SNPs and HLA types.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://bioconductor.org/packages/release/bioc/html/HIBAG.html"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://bioconductor/packages/release/bioc/src/contrib/HIBAG_1.10.0.tar.gz"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Nucleic acid sequence analysis",
                    "uri": "http://edamontology.org/operation_2478"
                }
            ]
        }
    ],
    "homepage": "http://bioconductor.org/packages/release/bioc/html/HIBAG.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2019-01-09T17:04:37Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Mirror"
            ],
            "url": "http://www.biostat.washington.edu/~bsweir/HIBAG/"
        },
        {
            "type": [
                "Mirror"
            ],
            "url": "http://github.com/zhengxwen/HIBAG"
        }
    ],
    "name": "HIBAG",
    "operatingSystem": [
        "Windows",
        "Mac"
    ],
    "owner": "bioconductor_import",
    "publication": [
        {
            "doi": "10.1038/tpj.2013.18",
            "metadata": {
                "abstract": "Genotyping of classical human leukocyte antigen (HLA) alleles is an essential tool in the analysis of diseases and adverse drug reactions with associations mapping to the major histocompatibility complex (MHC). However, deriving high-resolution HLA types subsequent to whole-genome single-nucleotide polymorphism (SNP) typing or sequencing is often cost prohibitive for large samples. An alternative approach takes advantage of the extended haplotype structure within the MHC to predict HLA alleles using dense SNP genotypes, such as those available from genome-wide SNP panels. Current methods for HLA imputation are difficult to apply or may require the user to have access to large training data sets with SNP and HLA types. We propose HIBAG, HLA Imputation using attribute BAGging, that makes predictions by averaging HLA-type posterior probabilities over an ensemble of classifiers built on bootstrap samples. We assess the performance of HIBAG using our study data (n=2668 subjects of European ancestry) as a training set and HLA data from the British 1958 birth cohort study (n≈1000 subjects) as independent validation samples. Prediction accuracies for HLA-A, B, C, DRB1 and DQB1 range from 92.2% to 98.1% using a set of SNP markers common to the Illumina 1M Duo, OmniQuad, OmniExpress, 660K and 550K platforms. HIBAG performed well compared with the other two leading methods, HLA*IMP and BEAGLE. This method is implemented in a freely available HIBAG R package that includes pre-fit classifiers for European, Asian, Hispanic and African ancestries, providing a readily available imputation approach without the need to have access to large training data sets. © 2014 Macmillan Publishers Limited.",
                "authors": [
                    {
                        "name": "Zheng X."
                    },
                    {
                        "name": "Shen J."
                    },
                    {
                        "name": "Cox C."
                    },
                    {
                        "name": "Wakefield J.C."
                    },
                    {
                        "name": "Ehm M.G."
                    },
                    {
                        "name": "Nelson M.R."
                    },
                    {
                        "name": "Weir B.S."
                    }
                ],
                "citationCount": 128,
                "date": "2014-01-01T00:00:00Z",
                "journal": "Pharmacogenomics Journal",
                "title": "HIBAG - HLA genotype imputation with attribute bagging"
            },
            "pmcid": "PMC3772955",
            "pmid": "23712092",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool",
        "Library"
    ],
    "topic": [
        {
            "term": "Immunoproteins, genes and antigens",
            "uri": "http://edamontology.org/topic_2830"
        },
        {
            "term": "Immunology",
            "uri": "http://edamontology.org/topic_0804"
        },
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        }
    ],
    "validated": 1,
    "version": [
        "1.10.0"
    ]
}