{
    "accessibility": "Open access",
    "additionDate": "2023-07-26T14:34:25.798022Z",
    "biotoolsCURIE": "biotools:kojak",
    "biotoolsID": "kojak",
    "cost": "Free of charge",
    "description": "A database search algorithm for solving cross-linked peptide mass spectra.",
    "documentation": [
        {
            "type": [
                "Command-line options"
            ],
            "url": "https://kojak-ms.systemsbiology.net/param/index.html"
        },
        {
            "type": [
                "Installation instructions",
                "Quick start guide",
                "User manual"
            ],
            "url": "https://kojak-ms.systemsbiology.net/docs/index.html"
        }
    ],
    "download": [
        {
            "type": "Downloads page",
            "url": "https://kojak-ms.systemsbiology.net/download.html",
            "version": "1.0 - 2.0.0"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "elixirCommunity": [
        "Proteomics"
    ],
    "homepage": "https://kojak-ms.systemsbiology.net/",
    "language": [
        "C++"
    ],
    "lastUpdate": "2024-11-24T14:45:40.796568Z",
    "license": "Apache-2.0",
    "maturity": "Mature",
    "name": "Kojak",
    "operatingSystem": [
        "Linux",
        "Windows"
    ],
    "owner": "mhoopmann",
    "publication": [
        {
            "doi": "10.1021/acs.jproteome.2c00670",
            "metadata": {
                "abstract": "Fragmentation ion spectral analysis of chemically cross-linked proteins is an established technology in the proteomics research repertoire for determining protein interactions, spatial orientation, and structure. Here we present Kojak version 2.0, a major update to the original Kojak algorithm, which was developed to identify cross-linked peptides from fragment ion spectra using a database search approach. A substantially improved algorithm with updated scoring metrics, support for cleavable cross-linkers, and identification of cross-links between 15N-labeled homomultimers are among the newest features of Kojak 2.0 presented here. Kojak 2.0 is now integrated into the Trans-Proteomic Pipeline, enabling access to dozens of additional tools within that suite. In particular, the PeptideProphet and iProphet tools for validation of cross-links improve the sensitivity and accuracy of correct cross-link identifications at user-defined thresholds. These new features improve the versatility of the algorithm, enabling its use in a wider range of experimental designs and analysis pipelines. Kojak 2.0 remains open-source and multiplatform.",
                "authors": [
                    {
                        "name": "Agard D.A."
                    },
                    {
                        "name": "Davis T.N."
                    },
                    {
                        "name": "Hoopmann M.R."
                    },
                    {
                        "name": "Luan Q."
                    },
                    {
                        "name": "Lyon A.S."
                    },
                    {
                        "name": "MacCoss M.J."
                    },
                    {
                        "name": "Moritz R.L."
                    },
                    {
                        "name": "Nolen B.J."
                    },
                    {
                        "name": "Riffle M."
                    },
                    {
                        "name": "Shteynberg D.D."
                    },
                    {
                        "name": "Zelter A."
                    }
                ],
                "citationCount": 4,
                "date": "2023-02-03T00:00:00Z",
                "journal": "Journal of Proteome Research",
                "title": "Improved Analysis of Cross-Linking Mass Spectrometry Data with Kojak 2.0, Advanced by Integration into the Trans-Proteomic Pipeline"
            },
            "pmcid": "PMC10234491",
            "pmid": "36629399",
            "type": [
                "Primary"
            ],
            "version": "2.0.0"
        },
        {
            "doi": "10.1021/pr501321h",
            "metadata": {
                "abstract": "Protein chemical cross-linking and mass spectrometry enable the analysis of protein-protein interactions and protein topologies; however, complicated cross-linked peptide spectra require specialized algorithms to identify interacting sites. The Kojak cross-linking software application is a new, efficient approach to identify cross-linked peptides, enabling large-scale analysis of protein-protein interactions by chemical cross-linking techniques. The algorithm integrates spectral processing and scoring schemes adopted from traditional database search algorithms and can identify cross-linked peptides using many different chemical cross-linkers with or without heavy isotope labels. Kojak was used to analyze both novel and existing data sets and was compared to existing cross-linking algorithms. The algorithm provided increased cross-link identifications over existing algorithms and, equally importantly, the results in a fraction of computational time. The Kojak algorithm is open-source, cross-platform, and freely available. This software provides both existing and new cross-linking researchers alike an effective way to derive additional cross-link identifications from new or existing data sets. For new users, it provides a simple analytical resource resulting in more cross-link identifications than other methods.",
                "authors": [
                    {
                        "name": "Davis T.N."
                    },
                    {
                        "name": "Hoopmann M.R."
                    },
                    {
                        "name": "Johnson R.S."
                    },
                    {
                        "name": "Maccoss M.J."
                    },
                    {
                        "name": "Moritz R.L."
                    },
                    {
                        "name": "Riffle M."
                    },
                    {
                        "name": "Zelter A."
                    }
                ],
                "citationCount": 142,
                "date": "2015-05-01T00:00:00Z",
                "journal": "Journal of Proteome Research",
                "title": "Kojak: Efficient analysis of chemically cross-linked protein complexes"
            },
            "pmcid": "PMC4428575",
            "pmid": "25812159",
            "type": [
                "Primary"
            ],
            "version": "1.0"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        }
    ],
    "version": [
        "2.0.0"
    ]
}
