{
    "additionDate": "2017-01-17T15:01:11Z",
    "biotoolsCURIE": "biotools:rnaprobr",
    "biotoolsID": "rnaprobr",
    "collectionID": [
        "BioConductor"
    ],
    "credit": [
        {
            "email": "nikos.sidiro@gmail.com",
            "name": "Nikos Sidiropoulos",
            "orcidid": "http://orcid.org/0000-0002-1854-1193",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "This package facilitates analysis of Next Generation Sequencing data for which positional information with a single nucleotide resolution is a key. It allows for applying different types of relevant normalizations, data visualization and export in a table or UCSC compatible bedgraph file.",
    "documentation": [
        {
            "type": "User manual",
            "url": "http://bioconductor.org/packages/release/bioc/html/RNAprobR.html"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://bioconductor/packages/release/bioc/src/contrib/RNAprobR_1.6.0.tar.gz"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "RNA-Seq analysis",
                    "uri": "http://edamontology.org/operation_3680"
                }
            ]
        }
    ],
    "homepage": "http://bioconductor.org/packages/release/bioc/html/RNAprobR.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2019-01-11T01:02:29Z",
    "license": "GPL-2.0",
    "name": "RNAprobR",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "bioconductor_import",
    "publication": [
        {
            "doi": "10.1016/bs.mie.2015.01.014",
            "metadata": {
                "abstract": "© 2015 Elsevier Inc. All rights reserved. RNA structure-probing data can improve the prediction of RNA secondary and tertiary structure and allow structural changes to be identified and investigated. In recent years, massive parallel sequencing has dramatically improved the throughput of RNA structure probing experiments, but at the same time also made analysis of the data challenging for scientists without formal training in computational biology. Here, we discuss different strategies for data analysis of massive parallel sequencing-based structure-probing data. To facilitate reproducible and standardized analysis of this type of data, we have made a collection of tools, which allow raw sequencing reads to be converted to normalized probing values using different published strategies. In addition, we also provide tools for visualization of the probing data in the UCSC Genome Browser and for converting RNA coordinates to genomic coordinates and vice versa. The collection is implemented as functions in the R statistical environment and as tools in the Galaxy platform, making them easily accessible for the scientific community. We demonstrate the usefulness of the collection by applying it to the analysis of sequencing-based hydroxyl radical probing data and comparing different normalization strategies.",
                "authors": [
                    {
                        "name": "Kielpinski L.J."
                    },
                    {
                        "name": "Sidiropoulos N."
                    },
                    {
                        "name": "Vinther J."
                    }
                ],
                "citationCount": 5,
                "date": "2015-01-01T00:00:00Z",
                "journal": "Methods in Enzymology",
                "title": "Reproducible analysis of sequencing-based RNA structure probing data with user-friendly tools"
            },
            "pmid": "26068741",
            "type": "Primary"
        }
    ],
    "toolType": [
        "Command-line tool",
        "Library"
    ],
    "topic": [
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        }
    ],
    "validated": 1,
    "version": [
        "1.6.0"
    ]
}