{
    "accessibility": "Open access",
    "additionDate": "2022-05-18T08:48:28.727209Z",
    "biotoolsCURIE": "biotools:brainfd",
    "biotoolsID": "brainfd",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "alexiou@ngcef.net",
            "name": "Athanasios Alexiou",
            "typeEntity": "Person"
        },
        {
            "email": "ashraf.gm@gmail.com",
            "name": "Ghulam Md Ashraf",
            "typeEntity": "Person"
        }
    ],
    "description": "Measuring the Intracranial Brain Volume With Fractal Dimension. The validation of the BrainFD software is based on T1-weighted MRI images from the Open Access Series of Imaging Studies (OASIS)-3 brain database, where each participant has multiple MRI scan sessions.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "https://github.com/BrainLabVol/BrainFD",
    "language": [
        "Java",
        "Python"
    ],
    "lastUpdate": "2022-05-18T08:48:28.729858Z",
    "license": "Not licensed",
    "name": "BrainFD",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.3389/FNAGI.2021.765185",
            "metadata": {
                "abstract": "Copyright © 2021 Ashraf, Chatzichronis, Alexiou, Kyriakopoulos, Alghamdi, Tayeb, Alghamdi, Khan, Jalal and Atta.A few methods and tools are available for the quantitative measurement of the brain volume targeting mainly brain volume loss. However, several factors, such as the clinical conditions, the time of the day, the type of MRI machine, the brain volume artifacts, the pseudoatrophy, and the variations among the protocols, produce extreme variations leading to misdiagnosis of brain atrophy. While brain white matter loss is a characteristic lesion during neurodegeneration, the main objective of this study was to create a computational tool for high precision measuring structural brain changes using the fractal dimension (FD) definition. The validation of the BrainFD software is based on T1-weighted MRI images from the Open Access Series of Imaging Studies (OASIS)-3 brain database, where each participant has multiple MRI scan sessions. The software is based on the Python and JAVA programming languages with the main functionality of the FD calculation using the box-counting algorithm, for different subjects on the same brain regions, with high accuracy and resolution, offering the ability to compare brain data regions from different subjects and on multiple sessions, creating different imaging profiles based on the Clinical Dementia Rating (CDR) scores of the participants. Two experiments were executed. The first was a cross-sectional study where the data were separated into two CDR classes. In the second experiment, a model on multiple heterogeneous data was trained, and the FD calculation for each participant of the OASIS-3 database through multiple sessions was evaluated. The results suggest that the FD variation efficiently describes the structural complexity of the brain and the related cognitive decline. Additionally, the FD efficiently discriminates the two classes achieving 100% accuracy. It is shown that this classification outperforms the currently existing methods in terms of accuracy and the size of the dataset. Therefore, the FD calculation for identifying intracranial brain volume loss could be applied as a potential low-cost personalized imaging biomarker. Furthermore, the possibilities measuring different brain areas and subregions could give robust evidence of the slightest variations to imaging data obtained from repetitive measurements to Physicians and Radiologists.",
                "authors": [
                    {
                        "name": "Alexiou A."
                    },
                    {
                        "name": "Alghamdi B.S.A."
                    },
                    {
                        "name": "Alghamdi J.S."
                    },
                    {
                        "name": "Ashraf G.M."
                    },
                    {
                        "name": "Atta H.M."
                    },
                    {
                        "name": "Chatzichronis S."
                    },
                    {
                        "name": "Jalal M.B."
                    },
                    {
                        "name": "Khan W."
                    },
                    {
                        "name": "Kyriakopoulos N."
                    },
                    {
                        "name": "Tayeb H.O."
                    }
                ],
                "date": "2021-11-26T00:00:00Z",
                "journal": "Frontiers in Aging Neuroscience",
                "title": "BrainFD: Measuring the Intracranial Brain Volume With Fractal Dimension"
            },
            "pmcid": "PMC8662626",
            "pmid": "34899274"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        },
        {
            "term": "Mathematics",
            "uri": "http://edamontology.org/topic_3315"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        }
    ]
}
