{
    "additionDate": "2021-01-18T12:22:30Z",
    "biotoolsCURIE": "biotools:ghomr",
    "biotoolsID": "ghomr",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "indrajit@nitttrkol.ac.in",
            "name": "Indrajit Saha",
            "orcidid": "https://orcid.org/0000-0001-9513-9707",
            "typeEntity": "Person"
        },
        {
            "email": "rafal.scherer@pcz.pl",
            "name": "Rafał Scherer",
            "orcidid": "https://orcid.org/0000-0001-9592-262X",
            "typeEntity": "Person"
        }
    ],
    "description": "Multi-Receptive Lightweight Residual Modules for Hyperspectral Classification.\n\nPytorch implementation for \"GhoMR : Multi-Receptive Lightweight Residual Modules for Hyperspectral Classification \".",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Feature extraction",
                    "uri": "http://edamontology.org/operation_3937"
                }
            ]
        }
    ],
    "homepage": "https://github.com/iamarijit/GhoMR",
    "lastUpdate": "2021-01-23T09:46:14Z",
    "name": "GhoMR",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.3390/S20236823",
            "metadata": {
                "abstract": "© 2020 by the authors. Licensee MDPI, Basel, Switzerland.In recent years, hyperspectral images (HSIs) have attained considerable attention in computer vision (CV) due to their wide utility in remote sensing. Unlike images with three or lesser channels, HSIs have a large number of spectral bands. Recent works demonstrate the use of modern deep learning based CV techniques like convolutional neural networks (CNNs) for analyzing HSI. CNNs have receptive fields (RFs) fueled by learnable weights, which are trained to extract useful features from images. In this work, a novel multi-receptive CNN module called GhoMR is proposed for HSI classification. GhoMR utilizes blocks containing several RFs, extracting features in a residual fashion. Each RF extracts features which are used by other RFs to extract more complex features in a hierarchical manner. However, the higher the number of RFs, the greater the associated weights, thus heavier is the network. Most complex architectures suffer from this shortcoming. To tackle this, the recently found Ghost module is used as the basic building unit. Ghost modules address the feature redundancy in CNNs by extracting only limited features and performing cheap transformations on them, thus reducing the overall parameters in the network. To test the discriminative potential of GhoMR, a simple network called GhoMR-Net is constructed using GhoMR modules, and experiments are performed on three public HSI data sets—Indian Pines, University of Pavia, and Salinas Scene. The classification performance is measured using three metrics—overall accuracy (OA), Kappa coefficient (Kappa), and average accuracy (AA). Comparisons with ten state-of-the-art architectures are shown to demonstrate the effectiveness of the method further. Although lightweight, the proposed GhoMR-Net provides comparable or better performance than other networks. The PyTorch code for this study is made available at the iamarijit/GhoMR GitHub repository.",
                "authors": [
                    {
                        "name": "Das A."
                    },
                    {
                        "name": "Saha I."
                    },
                    {
                        "name": "Scherer R."
                    }
                ],
                "citationCount": 2,
                "date": "2020-12-01T00:00:00Z",
                "journal": "Sensors (Switzerland)",
                "title": "Ghomr: Multi-receptive lightweight residual modules for hyperspectral classification"
            },
            "pmcid": "PMC7729750",
            "pmid": "33260347"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        }
    ],
    "validated": 1
}
