{
    "additionDate": "2020-01-14T09:33:08Z",
    "biotoolsCURIE": "biotools:SSMC",
    "biotoolsID": "SSMC",
    "confidence_flag": "medium",
    "description": "Methods for developing and implementing technology-enhanced self-management interventions for pain and fatigue.\n\nThe National Institutes of Nursing Research provides funding via the P20 grant mechanism for research infrastructure and resources to develop nurse scientists with expertise in symptom self-management. The Medical University of South Carolina College of Nursing was awarded a P20 grant in 2016 to build the Symptoms Self-Management Center for technology-enhanced interventions to address pain and fatigue in individuals with chronic health conditions. Resources were derived from three key subcores: bioinformatics, mHealth and eHealth consultative services, and community engagement.\n\n||| HOMEPAGE MISSING!.\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'self-management', 'Symptoms Self-Management Center', 'Nursing', 'technology-enhanced'",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Phasing",
                    "uri": "http://edamontology.org/operation_3454"
                }
            ]
        }
    ],
    "homepage": "https://www.ncbi.nlm.nih.gov/pubmed/?term=31676300",
    "lastUpdate": "2020-01-14T09:33:08Z",
    "name": "SSMC",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1016/J.APNR.2019.151194",
            "metadata": {
                "abstract": "© 2019 Elsevier Inc.The National Institutes of Nursing Research provides funding via the P20 grant mechanism for research infrastructure and resources to develop nurse scientists with expertise in symptom self-management. The Medical University of South Carolina College of Nursing was awarded a P20 grant in 2016 to build the Symptoms Self-Management Center for technology-enhanced interventions to address pain and fatigue in individuals with chronic health conditions. Resources were derived from three key subcores: bioinformatics, mHealth and eHealth consultative services, and community engagement. This paper describes methods for deriving specific resources within each subcore, the application of subcore resources in two pilot studies, and lessons learned during the early phases of our Symptoms Self-Management Center implementation.",
                "authors": [
                    {
                        "name": "Phillips S."
                    },
                    {
                        "name": "Barroso J."
                    },
                    {
                        "name": "Acierno R."
                    },
                    {
                        "name": "Kelechi T."
                    }
                ],
                "date": "2019-12-01T00:00:00Z",
                "journal": "Applied Nursing Research",
                "title": "The Symptoms Self-Management Center (SSMC): Methods for developing and implementing technology-enhanced self-management interventions for pain and fatigue"
            },
            "pmid": "31676300"
        }
    ]
}