{
    "additionDate": "2021-01-18T09:27:05Z",
    "biotoolsCURIE": "biotools:luxus",
    "biotoolsID": "luxus",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "viivi.halla-aho@aalto.fi",
            "name": "Viivi Halla-aho",
            "orcidid": "https://orcid.org/0000-0003-0369-5701",
            "typeEntity": "Person"
        },
        {
            "email": "harri.lahdesmaki@aalto.fi",
            "name": "Harri Lähdesmäki",
            "typeEntity": "Person"
        }
    ],
    "description": "DNA methylation analysis using generalized linear mixed model with spatial correlation.\n\nLuxGLM Using Spatial correlation (LuxUS) is a tool for differential methylation analysis. The tool is based on generalized linear mixed model with spatial correlation structure. The model parameters are fitted using probabilistic programming language Stan [2]. Savage-Dickey Bayes factor estimates are used for statistical testing of a covariate of interest. LuxUS supports both continuous and binary variables. The model takes into account the experimental parameters, such as bisulfite conversion efficiency.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Methylation analysis",
                    "uri": "http://edamontology.org/operation_3204"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/hallav/LuxUS",
    "language": [
        "Python",
        "R",
        "Shell"
    ],
    "lastUpdate": "2021-02-19T08:10:51Z",
    "license": "MIT",
    "name": "LuxUS",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAA539",
            "metadata": {
                "abstract": "© The Author(s) 2020. Published by Oxford University Press.Motivation: DNA methylation is an important epigenetic modification, which has multiple functions. DNA methylation and its connections to diseases have been extensively studied in recent years. It is known that DNA methylation levels of neighboring cytosines are correlated and that differential DNA methylation typically occurs rather as regions instead of individual cytosine level. Results: We have developed a generalized linear mixed model, LuxUS, that makes use of the correlation between neighboring cytosines to facilitate analysis of differential methylation. LuxUS implements a likelihood model for bisulfite sequencing data that accounts for experimental variation in underlying biochemistry. LuxUS can model both binary and continuous covariates, and mixed model formulation enables including replicate and cytosine random effects. Spatial correlation is included to the model through a cytosine random effect correlation structure. We show with simulation experiments that using the spatial correlation, we gain more power to the statistical testing of differential DNA methylation. Results with real bisulfite sequencing dataset show that LuxUS is able to detect biologically significant differentially methylated cytosines. Availability and implementation: The tool is available at https://github.com/hallav/LuxUS.",
                "authors": [
                    {
                        "name": "Halla-Aho V."
                    },
                    {
                        "name": "Lahdesmaki H."
                    }
                ],
                "date": "2020-09-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "LuxUS: DNA methylation analysis using generalized linear mixed model with spatial correlation"
            },
            "pmcid": "PMC7750928",
            "pmid": "32484876"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Biochemistry",
            "uri": "http://edamontology.org/topic_3292"
        },
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        },
        {
            "term": "Methylated DNA immunoprecipitation",
            "uri": "http://edamontology.org/topic_3674"
        }
    ]
}
