
{
    "credit": [
        {
            "email": "hbshen@sjtu.edu.cn",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://www.csbio.sjtu.edu.cn/"
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://www.csbio.sjtu.edu.cn/bioinf/SemiBiomarker/"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Protein subcellular localisation prediction",
                    "uri": "http://edamontology.org/operation_2489"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "MATLAB"
        ],
        "operatingSystem": [
            "Windows"
        ],
        "toolType": [
            "Script"
        ],
        "topic": [
            {
                "term": "Oncology",
                "uri": "http://edamontology.org/topic_2640"
            },
            {
                "term": "Data visualisation",
                "uri": "http://edamontology.org/topic_0092"
            },
            {
                "term": "Protein targeting and localisation",
                "uri": "http://edamontology.org/topic_0140"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/semibiomarker-bioimage-based-semi-supervised-method-for-protein-subcellular-localization.html"
        }
    ],
    "publication": [
        {
            "abstract": "© The Author 2014.Motivation: There is a long-term interest in the challenging task of finding translocated and mislocated cancer biomarker proteins. Bioimages of subcellular protein distribution are new data sources which have attracted much attention in recent years because of their intuitive and detailed descriptions of protein distribution. However, automated methods in large-scale biomarker screening suffer significantly from the lack of subcellular location annotations for bioimages from cancer tissues. The transfer prediction idea of applying models trained on normal tissue proteins to predict the subcellular locations of cancerous ones is arbitrary because the protein distribution patterns may differ in normal and cancerous states. Results: We developed a new semi-supervised protocol that can use unlabeled cancer protein data in model construction by an iterative and incremental training strategy. Our approach enables us to selectively use the low-quality images in normal states to expand the training sample space and provides a general way for dealing with the small size of annotated images used together with large unannotated ones. Experiments demonstrate that the new semi-supervised protocol can result in improved accuracy and sensitivity of subcellular location difference detection.",
            "authors": [
                "Xu Y.-Y.",
                "Yang F.",
                "Zhang Y.",
                "Shen H.-B."
            ],
            "cit_count": 9,
            "journal": "Bioinformatics",
            "pmid": "25414362",
            "title": "Bioimaging-based detection of mislocalized proteins in human cancers by semi-supervised learning",
            "year": "2015-04-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:semibiomarker",
        "biotoolsID": "semibiomarker",
        "description": "New semi-supervised protocol that can use unlabeled cancer protein data in model construction by an iterative and incremental training strategy.It can result in improved accuracy and sensitivity of subcellular location difference detection.",
        "homepage": "http://www.csbio.sjtu.edu.cn/bioinf/SemiBiomarker/",
        "name": "SemiBiomarker"
    }
}