{
    "accessibility": "Open access",
    "additionDate": "2024-06-21T06:11:06.140613Z",
    "biotoolsCURIE": "biotools:ldweaver",
    "biotoolsID": "ldweaver",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "description": "LDWeaver accepts a sequence alignment (fasta) and its reference annotation (genbank or gff) as inputs and identifies linkage disequilibrium (LD) between pairs of variants (links) that is unusually high given the genomic distance between the pair. This high LD could be the result of co-selection or epistasis. Approximate statistical significance is used to rank outlier links and the output is reported in tsv format, along with several other helpful annotations and figures. Additionally, LDWeaver has functions to assist the detection of genomic regions that have potentially undergone co-selection or epistasis.",
    "documentation": [
        {
            "note": "Run instructions and examples available on GitHub. Please refer to package help for details about functions. Create a GitHub issue if you run into any issues",
            "type": [
                "General"
            ],
            "url": "https://github.com/Sudaraka88/LDWeaver"
        }
    ],
    "download": [
        {
            "note": "Install via BioConda",
            "type": "Software package",
            "url": "https://anaconda.org/bioconda/r-ldweaver",
            "version": "1.5"
        },
        {
            "note": "Source Code",
            "type": "Source code",
            "url": "https://zenodo.org/records/10467525",
            "version": "1.5"
        }
    ],
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://github.com/Sudaraka88/LDWeaver",
    "language": [
        "C",
        "C++",
        "R"
    ],
    "lastUpdate": "2024-06-21T06:11:24.689543Z",
    "license": "GPL-3.0",
    "maturity": "Emerging",
    "name": "LDWeaver",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Sudaraka",
    "publication": [
        {
            "doi": "10.1093/nargab/lqae061",
            "metadata": {
                "abstract": "Population genomics has revolutionized our ability to study bacterial evolution by enabling data-driven discovery of the genetic architecture of trait variation. Genome-wide association studies (GWAS) have more recently become accompanied by genome-wide epistasis and co-selection (GWES) analysis, which offers a phenotype-free approach to generating hypotheses about selective processes that simultaneously impact multiple loci across the genome. However, existing GWES methods only consider associations between distant pairs of loci within the genome due to the strong impact of linkage-disequilibrium (LD) over short distances. Based on the general functional organisation of genomes it is nevertheless expected that majority of co-selection and epistasis will act within relatively short genomic proximity, on co-variation occurring within genes and their promoter regions, and within operons. Here, we introduce LDWeaver, which enables an exhaustive GWES across both short- and long-range LD, to disentangle likely neutral co-variation from selection. We demonstrate the ability of LDWeaver to efficiently generate hypotheses about co-selection using large genomic surveys of multiple major human bacterial pathogen species and validate several findings using functional annotation and phenotypic measurements. Our approach will facilitate the study of bacterial evolution in the light of rapidly expanding population genomic data.",
                "authors": [
                    {
                        "name": "Arredondo-Alonso S."
                    },
                    {
                        "name": "Balding D."
                    },
                    {
                        "name": "Calland J.K."
                    },
                    {
                        "name": "Corander J."
                    },
                    {
                        "name": "Croucher N.J."
                    },
                    {
                        "name": "Gladstone R.A."
                    },
                    {
                        "name": "MacAlasdair N."
                    },
                    {
                        "name": "Mallawaarachchi S."
                    },
                    {
                        "name": "Pontinen A.K."
                    },
                    {
                        "name": "Sheppard S.K."
                    },
                    {
                        "name": "Thorpe H.A."
                    },
                    {
                        "name": "Tonkin-Hill G."
                    },
                    {
                        "name": "Top J."
                    }
                ],
                "date": "2024-06-01T00:00:00Z",
                "journal": "NAR Genomics and Bioinformatics",
                "title": "Detecting co-selection through excess linkage disequilibrium in bacterial genomes"
            },
            "pmcid": "PMC11155488",
            "pmid": "38846349",
            "type": [
                "Method"
            ],
            "version": "1.5"
        }
    ],
    "toolType": [
        "Bioinformatics portal",
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Computational biology",
            "uri": "http://edamontology.org/topic_3307"
        },
        {
            "term": "Epistasis",
            "uri": "http://edamontology.org/topic_3974"
        },
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        },
        {
            "term": "Microbiology",
            "uri": "http://edamontology.org/topic_3301"
        },
        {
            "term": "Molecular evolution",
            "uri": "http://edamontology.org/topic_3945"
        }
    ],
    "version": [
        "1.5"
    ]
}
