{"credit":[{"email":"passetti@inca.gov.br","name":"F. Passetti","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"url":"https://github.com/BioNica/Segtor/tree/master/docs"}],"function":[{"operation":[{"term":"SNP annotation","uri":"http://edamontology.org/operation_3661"}]}],"labels":{"language":["Perl","C"],"operatingSystem":["Linux","Mac"],"toolType":["Command-line tool"],"topic":[{"term":"DNA polymorphism","uri":"http://edamontology.org/topic_2885"}]},"publication":[{"abstract":"Various research projects often involve determining the relative position of genomic coordinates, intervals, single nucleotide variations (SNVs), insertions, deletions and translocations with respect to genes and their potential impact on protein translation. Due to the tremendous increase in throughput brought by the use of next-generation sequencing, investigators are routinely faced with the need to annotate very large datasets. We present Segtor, a tool to annotate large sets of genomic coordinates, intervals, SNVs, indels and translocations. Our tool uses segment trees built using the start and end coordinates of the genomic features the user wishes to use instead of storing them in a database management system. The software also produces annotation statistics to allow users to visualize how many coordinates were found within various portions of genes. Our system currently can be made to work with any species available on the UCSC Genome Browser. Segtor is a suitable tool for groups, especially those with limited access to programmers or with interest to analyze large amounts of individual genomes, who wish to determine the relative position of very large sets of mapped reads and subsequently annotate observed mutations between the reads and the reference. Segtor (http://lbbc.inca.gov.br/segtor/) is an open-source tool that can be freely downloaded for non-profit use. We also provide a web interface for testing purposes. © 2011 Renaud et al.","authors":["Renaud G.","Neves P.","Folador E.L.","Ferreira C.G.","Passetti F."],"cit_count":5,"journal":"PLoS ONE","pmid":"22069465","title":"Segtor: Rapid annotation of genomic coordinates and single nucleotide variations using segment trees","year":"2011-11-01"}],"summary":{"biotoolsCURIE":"biotools:segtor","biotoolsID":"segtor","description":"A software tool to annotate large sets of genomic coordinates, intervals, SNVs, indels and translocations with respect to known genes.","homepage":"https://github.com/BioNica/Segtor","name":"Segtor"}}