{
    "additionDate": "2018-06-30T17:11:17Z",
    "biotoolsCURIE": "biotools:hiite",
    "biotoolsID": "hiite",
    "credit": [
        {
            "name": "Contact form",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://p512.usc.edu/request/contacts/"
        }
    ],
    "description": "HIV-1 incidence and infection time estimator, which processes envelope gene sequences using hierarchical clustering algorithms and informs the stage of infection, along with time since infection for incident cases.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://p512.usc.edu/request/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Virulence prediction",
                    "uri": "http://edamontology.org/operation_3461"
                }
            ]
        }
    ],
    "homepage": "http://p512.usc.edu/request/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-25T14:44:44.470819Z",
    "name": "HIITE",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/bty073",
            "metadata": {
                "abstract": "Motivation Around 2.1 million new HIV-1 infections were reported in 2015, alerting that the HIV-1 epidemic remains a significant global health challenge. Precise incidence assessment strengthens epidemic monitoring efforts and guides strategy optimization for prevention programs. Estimating the onset time of HIV-1 infection can facilitate optimal clinical management and identify key populations largely responsible for epidemic spread and thereby infer HIV-1 transmission chains. Our goal is to develop a genomic assay estimating the incidence and infection time in a single cross-sectional survey setting. Results We created a web-based platform, HIV-1 incidence and infection time estimator (HIITE), which processes envelope gene sequences using hierarchical clustering algorithms and informs the stage of infection, along with time since infection for incident cases. HIITE's performance was evaluated using 585 incident and 305 chronic specimens' envelope gene sequences collected from global cohorts including HIV-1 vaccine trial participants. HIITE precisely identified chronically infected individuals as being chronic with an error less than 1% and correctly classified 94% of recently infected individuals as being incident. Using a mixed-effect model, an incident specimen's time since infection was estimated from its single lineage diversity, showing 14% prediction error for time since infection. HIITE is the first algorithm to inform two key metrics from a single time point sequence sample. HIITE has the capacity for assessing not only population-level epidemic spread but also individual-level transmission events from a single survey, advancing HIV prevention and intervention programs. Availability and implementation Web-based HIITE and source code of HIITE are available at http://www.hayounlee.org/software.html. Supplementary informationSupplementary dataare available at Bioinformatics online.",
                "authors": [
                    {
                        "name": "Kapoor S."
                    },
                    {
                        "name": "Lee H.Y."
                    },
                    {
                        "name": "Love T.M.T."
                    },
                    {
                        "name": "Park S.Y."
                    }
                ],
                "citationCount": 5,
                "date": "2018-06-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "HIITE: HIV-1 incidence and infection time estimator"
            },
            "pmcid": "PMC6390194",
            "pmid": "29438560"
        }
    ],
    "toolType": [
        "Script",
        "Web application"
    ],
    "topic": [
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Infectious disease",
            "uri": "http://edamontology.org/topic_3324"
        },
        {
            "term": "Virology",
            "uri": "http://edamontology.org/topic_0781"
        }
    ],
    "validated": 1
}
