{
    "additionDate": "2017-01-17T15:05:52Z",
    "biotoolsCURIE": "biotools:ippd",
    "biotoolsID": "ippd",
    "collectionID": [
        "BioConductor",
        "Proteomics"
    ],
    "credit": [
        {
            "email": "ms@cs.uni-saarland.de",
            "name": "Martin Slawski",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "The package provides functionality to extract isotopic peak patterns from raw mass spectra. This is done by fitting a large set of template basis functions to the raw spectrum using either nonnegative least squares or least absolute deviation fittting. The package offers a flexible function which tries to estimate model parameters in a way tailored to the peak shapes in the data. The package also provides functionality to process LCMS runs.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://bioconductor.org/packages/release/bioc/html/IPPD.html"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://bioconductor/packages/release/bioc/src/contrib/IPPD_1.22.0.tar.gz"
        }
    ],
    "editPermission": {
        "authors": [
            "proteomics.bio.tools"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Peak calling",
                    "uri": "http://edamontology.org/operation_3222"
                }
            ]
        }
    ],
    "homepage": "http://bioconductor.org/packages/release/bioc/html/IPPD.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2024-11-25T14:14:53.981805Z",
    "license": "GPL-2.0",
    "name": "IPPD",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "bioconductor_import",
    "publication": [
        {
            "doi": "10.1186/1471-2105-13-291",
            "metadata": {
                "abstract": "Background: The robust identification of isotope patterns originating from peptides being analyzed through mass spectrometry (MS) is often significantly hampered by noise artifacts and the interference of overlapping patterns arising e.g. from post-translational modifications. As the classification of the recorded data points into either 'noise' or 'signal' lies at the very root of essentially every proteomic application, the quality of the automated processing of mass spectra can significantly influence the way the data might be interpreted within a given biological context.Results: We propose non-negative least squares/non-negative least absolute deviation regression to fit a raw spectrum by templates imitating isotope patterns. In a carefully designed validation scheme, we show that the method exhibits excellent performance in pattern picking. It is demonstrated that the method is able to disentangle complicated overlaps of patterns.Conclusions: We find that regularization is not necessary to prevent overfitting and that thresholding is an effective and user-friendly way to perform feature selection. The proposed method avoids problems inherent in regularization-based approaches, comes with a set of well-interpretable parameters whose default configuration is shown to generalize well without the need for fine-tuning, and is applicable to spectra of different platforms. The R package IPPD implements the method and is available from the Bioconductor platform (http://bioconductor.fhcrc.org/help/bioc-views/devel/bioc/html/IPPD.html). © 2012 Slawski et al; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Gregorius B."
                    },
                    {
                        "name": "Hein M."
                    },
                    {
                        "name": "Hildebrandt A."
                    },
                    {
                        "name": "Hussong R."
                    },
                    {
                        "name": "Jakoby T."
                    },
                    {
                        "name": "Slawski M."
                    },
                    {
                        "name": "Tholey A."
                    }
                ],
                "citationCount": 15,
                "date": "2012-11-08T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Isotope pattern deconvolution for peptide mass spectrometry by non-negative least squares/least absolute deviation template matching"
            },
            "pmcid": "PMC3608065",
            "pmid": "23137144",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool",
        "Library"
    ],
    "topic": [
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ],
    "validated": 1,
    "version": [
        "1.22.0"
    ]
}
