{
    "name": "pLoc_bal-mEuk", 
    "description": "Predict Subcellular Localization of Eukaryotic Proteins by General PseAAC and Quasi-balancing Training Dataset.", 
    "homepage": "http://www.jci-bioinfo.cn/pLoc_bal-mEuk/", 
    "biotoolsID": "pLoc_bal-mEuk", 
    "biotoolsCURIE": "biotools:pLoc_bal-mEuk", 
    "version": [], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_3431", 
                    "term": "Deposition"
                }, 
                {
                    "uri": "http://edamontology.org/operation_2489", 
                    "term": "Subcellular localisation prediction"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Web application"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_3399", 
            "term": "Geriatric medicine"
        }, 
        {
            "uri": "http://edamontology.org/topic_3068", 
            "term": "Literature and language"
        }, 
        {
            "uri": "http://edamontology.org/topic_3474", 
            "term": "Machine learning"
        }
    ], 
    "operatingSystem": [
        "Linux", 
        "Windows", 
        "Mac"
    ], 
    "language": [], 
    "license": "Unlicense", 
    "collectionID": [], 
    "maturity": "Mature", 
    "cost": "Free of charge", 
    "accessibility": [
        "Open access"
    ], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [], 
    "download": [], 
    "documentation": [
        {
            "url": "http://www.jci-bioinfo.cn/pLoc_bal-mEuk/iLocAnimal_readme.html", 
            "type": "General", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": "10.2174/1573406415666181218102517", 
            "pmid": "30569871", 
            "pmcid": null, 
            "type": "Primary", 
            "version": null, 
            "metadata": {
                "title": "pLoc_bal-mEuk: Predict subcellular localization of eukaryotic proteins by general pseaac and quasi-balancing training dataset", 
                "abstract": "© 2019 Bentham Science Publishers.Objective: Information of protein subcellular localization is crucially important for both basic research and drug development. With the explosive growth of protein sequences discovered in the post-genomic age, it is highly demanded to develop powerful bioinformatics tools for timely and effectively identifying their subcellular localization purely based on the sequence information alone. Recently, a predictor called “pLoc-mEuk” was developed for identifying the subcellular localization of eukaryotic proteins. Its performance is overwhelmingly better than that of the other predictors for the same purpose, particularly in dealing with multi-label systems where many proteins, called “multiplex proteins”, may simultaneously occur in two or more subcellular locations. Although it is indeed a very powerful predictor, more efforts are definitely needed to further improve it. This is because pLoc-mEuk was trained by an extremely skewed dataset where some subset was about 200 times the size of the other subsets. Accordingly, it cannot avoid the biased consequence caused by such an uneven training dataset. Methods: To alleviate such bias, we have developed a new predictor called pLoc_bal-mEuk by quasi-balancing the training dataset. Cross-validation tests on exactly the same experimentconfirmed dataset have indicated that the proposed new predictor is remarkably superior to pLocmEuk, the existing state-of-the-art predictor in identifying the subcellular localization of eukaryotic proteins. It has not escaped our notice that the quasi-balancing treatment can also be used to deal with many other biological systems. Results: To maximize the convenience for most experimental scientists, a user-friendly web-server for the new predictor has been established at http://www.jci-bioinfo.cn/pLoc_bal-mEuk/. Conclusion: It is anticipated that the pLoc_bal-Euk predictor holds very high potential to become a useful high throughput tool in identifying the subcellular localization of eukaryotic proteins, particularly for finding multi-target drugs that is currently a very hot trend trend in drug development.", 
                "date": "2019-01-01T00:00:00Z", 
                "citationCount": 4, 
                "authors": [
                    {
                        "name": "Chou K.-C."
                    }, 
                    {
                        "name": "Cheng X."
                    }, 
                    {
                        "name": "Xiao X."
                    }
                ], 
                "journal": "Medicinal Chemistry"
            }
        }
    ], 
    "credit": [
        {
            "name": "Xuan Xiao", 
            "email": "jdzxiaoxuan@163.com", 
            "url": null, 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "Ruta", 
    "additionDate": "2019-08-11T13:37:26Z", 
    "lastUpdate": "2019-08-11T13:37:26Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 0, 
    "homepage_status": 0, 
    "elixir_badge": 0
}