{
    "additionDate": "2021-01-18T09:36:07Z",
    "biotoolsCURIE": "biotools:seedgerm",
    "biotoolsID": "seedgerm",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "ji.zhou@njau.edu.cn",
            "name": "Rene Benjamins",
            "typeEntity": "Person"
        },
        {
            "email": "steven.penfield@jic.ac.uk",
            "name": "Steven Penfield",
            "typeEntity": "Person"
        },
        {
            "email": "rene.benjamins@syngenta.com",
            "name": "Ji Zhou",
            "typeEntity": "Person"
        }
    ],
    "description": "a cost-effective phenotyping platform for automated seed imaging and machine-learning based phenotypic analysis of crop seed germination.\n\nSeedGerm: automated seed phenotyping. Contribute to Crop-Phenomics-Group/SeedGerm development by creating an account on GitHub.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "SNP detection",
                    "uri": "http://edamontology.org/operation_0484"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Crop-Phenomics-Group/SeedGerm/releases",
    "lastUpdate": "2021-02-13T17:33:53Z",
    "name": "SeedGerm",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1111/NPH.16736",
            "metadata": {
                "abstract": "© 2020 The Authors. New Phytologist © 2020 New Phytologist TrustEfficient seed germination and establishment are important traits for field and glasshouse crops. Large-scale germination experiments are laborious and prone to observer errors, leading to the necessity for automated methods. We experimented with five crop species, including tomato, pepper, Brassica, barley, and maize, and concluded an approach for large-scale germination scoring. Here, we present the SeedGerm system, which combines cost-effective hardware and open-source software for seed germination experiments, automated seed imaging, and machine-learning based phenotypic analysis. The software can process multiple image series simultaneously and produce reliable analysis of germination- and establishment-related traits, in both comma-separated values (CSV) and processed images (PNG) formats. In this article, we describe the hardware and software design in detail. We also demonstrate that SeedGerm could match specialists’ scoring of radicle emergence. Germination curves were produced based on seed-level germination timing and rates rather than a fitted curve. In particular, by scoring germination across a diverse panel of Brassica napus varieties, SeedGerm implicates a gene important in abscisic acid (ABA) signalling in seeds. We compared SeedGerm with existing methods and concluded that it could have wide utilities in large-scale seed phenotyping and testing, for both research and routine seed technology applications.",
                "authors": [
                    {
                        "name": "Colmer J."
                    },
                    {
                        "name": "O'Neill C.M."
                    },
                    {
                        "name": "Wells R."
                    },
                    {
                        "name": "Bostrom A."
                    },
                    {
                        "name": "Reynolds D."
                    },
                    {
                        "name": "Websdale D."
                    },
                    {
                        "name": "Shiralagi G."
                    },
                    {
                        "name": "Lu W."
                    },
                    {
                        "name": "Lou Q."
                    },
                    {
                        "name": "Le Cornu T."
                    },
                    {
                        "name": "Ball J."
                    },
                    {
                        "name": "Renema J."
                    },
                    {
                        "name": "Flores Andaluz G."
                    },
                    {
                        "name": "Benjamins R."
                    },
                    {
                        "name": "Penfield S."
                    },
                    {
                        "name": "Zhou J."
                    }
                ],
                "citationCount": 12,
                "date": "2020-10-01T00:00:00Z",
                "journal": "New Phytologist",
                "title": "SeedGerm: a cost-effective phenotyping platform for automated seed imaging and machine-learning based phenotypic analysis of crop seed germination"
            },
            "pmid": "32533857"
        }
    ],
    "topic": [
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Agricultural science",
            "uri": "http://edamontology.org/topic_3810"
        }
    ]
}