{
    "additionDate": "2020-01-14T08:54:37Z",
    "biotoolsCURIE": "biotools:RNAm5CPred",
    "biotoolsID": "RNAm5CPred",
    "confidence_flag": "high",
    "credit": [
        {
            "email": "beihuang@163.com",
            "name": "Bei Huang",
            "typeEntity": "Person"
        },
        {
            "email": "xiongyi@sjtu.edu.cn",
            "name": "Yi Xiong",
            "typeEntity": "Person"
        },
        {
            "email": "xlzhu_mdl@hotmail.com",
            "name": "Xiaolei Zhu",
            "typeEntity": "Person"
        }
    ],
    "description": "Prediction of RNA 5-Methylcytosine Sites Based on Three Different Kinds of Nucleotide Composition.\n\nRNAm5CPred: A webserver for RNA 5-methylcytosine sites prediction.\n\nA webserver for RNA 5-methylcytosine sites prediction. RNAm5CPred was developed by using support vector machine based on three different kinds of nucleotide composition features including KNF (K-nucleotide frequencies), KSNPF (K-spaced nucleotide pair frequencies) and pseDNC (pseudo dinucleotide composition). The input for the server is the RNA sequence. More details can be found in the tutorial",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                },
                {
                    "term": "EST assembly",
                    "uri": "http://edamontology.org/operation_0526"
                }
            ]
        }
    ],
    "homepage": "http://zhulab.ahu.edu.cn/RNAm5CPred/",
    "lastUpdate": "2020-01-14T08:54:37Z",
    "name": "RNAm5CPred",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1016/J.OMTN.2019.10.008",
            "metadata": {
                "abstract": "© 2019 The Authors5-methylcytosine (m5C) is one of the most common and abundant post-transcriptional modifications (PTCMs) in RNA. Recent studies showed that m5C plays important roles in many biological functions such as RNA metabolism and cell fate decision. Because most experimental methods that determine m5C sites across the transcriptome are time-consuming and expensive, it is urgent to develop accurate computational methods to identify m5C sites effectively. A benchmark dataset is important for developing and evaluating computational methods. In this work, we constructed four different datasets according to the data redundancy and imbalance. Based on these datasets, we generated three different kinds of features, i.e., KNFs (K-nucleotide frequencies), KSNPFs (K-spaced nucleotide pair frequencies), and pseDNC (pseudo-dinucleotide composition), and then used a support vector machine (SVM) to build our models. Based on the imbalanced and nonredundant dataset, Met935, we extensively studied the three kinds of features and determined an optimal combination of the features. Based on the feature combination, we built models on the three different datasets and compared them with state-of-the-art models. According to the predictive results of the stringent jackknife test, the models based on the three features, 4NF, 1SNPF, and pseDNC, are superior or comparable to other methods. To determine the best model between the models based on the imbalanced dataset Met935 and the balanced dataset Met240, we further evaluated the two models on an independent test set Test1157. Our results demonstrate that the model based on the balanced dataset Met240 achieved the highest recall (68.79%) and the highest Matthews correlation coefficient (MCC) (0.154). In addition, the model is also superior to other state-of-the-art methods according to the integrated parameter MCC on the independent test set. Thus, we selected the model based on Met240 as our final model, which was named RNAm5CPred. In addition, a web server for RNAm5CPred (http://zhulab.ahu.edu.cn/RNAm5CPred/) has been provided to facilitate experimental research.",
                "authors": [
                    {
                        "name": "Fang T."
                    },
                    {
                        "name": "Zhang Z."
                    },
                    {
                        "name": "Sun R."
                    },
                    {
                        "name": "Zhu L."
                    },
                    {
                        "name": "He J."
                    },
                    {
                        "name": "Huang B."
                    },
                    {
                        "name": "Xiong Y."
                    },
                    {
                        "name": "Zhu X."
                    }
                ],
                "citationCount": 12,
                "date": "2019-12-06T00:00:00Z",
                "journal": "Molecular Therapy - Nucleic Acids",
                "title": "RNAm5CPred: Prediction of RNA 5-Methylcytosine Sites Based on Three Different Kinds of Nucleotide Composition"
            },
            "pmcid": "PMC6859278",
            "pmid": "31726390"
        }
    ],
    "topic": [
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ]
}