{
    "additionDate": "2021-01-18T09:56:50Z",
    "biotoolsCURIE": "biotools:idrug",
    "biotoolsID": "idrug",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "jingli@cwru.edu",
            "name": "Jing Li",
            "orcidid": "https://orcid.org/0000-0003-1160-6959",
            "typeEntity": "Person"
        }
    ],
    "description": "Integration of drug repositioning and drug-target prediction via cross-network embedding.\n\niDrug is a computational pipeline to jointly predict novel drug-disease and drug-target interactions based on a heterogeneous network. iDrug adpots cross-network embedding to learn lower dimensional feature spaces for drugs, targets, and diseases in the heterogeneous network. A paper describing the approach is currently under review. A link to the paper will be added once it is published.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Fold recognition",
                    "uri": "http://edamontology.org/operation_0303"
                },
                {
                    "term": "Virtual screening",
                    "uri": "http://edamontology.org/operation_3938"
                },
                {
                    "term": "Relation extraction",
                    "uri": "http://edamontology.org/operation_3625"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Case-esaC/iDrug",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2021-02-03T07:30:50Z",
    "name": "iDrug",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PCBI.1008040",
            "metadata": {
                "abstract": "© 2020 Chen et al.Computational drug repositioning and drug-target prediction have become essential tasks in the early stage of drug discovery. In previous studies, these two tasks have often been considered separately. However, the entities studied in these two tasks (i.e., drugs, targets, and diseases) are inherently related. On one hand, drugs interact with targets in cells to modulate target activities, which in turn alter biological pathways to promote healthy functions and to treat diseases. On the other hand, both drug repositioning and drug-target prediction involve the same drug feature space, which naturally connects these two problems and the two domains (diseases and targets). By using the wisdom of the crowds, it is possible to transfer knowledge from one of the domains to the other. The existence of relationships among drug-target-disease motivates us to jointly consider drug repositioning and drug-target prediction in drug discovery. In this paper, we present a novel approach called iDrug, which seamlessly integrates drug repositioning and drug-target prediction into one coherent model via cross-network embedding. In particular, we provide a principled way to transfer knowledge from these two domains and to enhance prediction performance for both tasks. Using real-world datasets, we demonstrate that iDrug achieves superior performance on both learning tasks compared to several state-of-the-art approaches. Copyright:",
                "authors": [
                    {
                        "name": "Chen H."
                    },
                    {
                        "name": "Cheng F."
                    },
                    {
                        "name": "Li J."
                    }
                ],
                "citationCount": 4,
                "date": "2020-07-01T00:00:00Z",
                "journal": "PLoS Computational Biology",
                "title": "IDrug: Integration of drug repositioning and drug-target prediction via cross-network embedding"
            },
            "pmcid": "PMC7384678",
            "pmid": "32667925"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Drug discovery",
            "uri": "http://edamontology.org/topic_3336"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        }
    ]
}