
{
    "credit": [
        {
            "name": "Jean Monlong",
            "typeEntity": "Person",
            "typeRoles": [
                "Developer"
            ]
        },
        {
            "name": "R.Guigo Group: Computational Biology of RNA processing @ CRG, Barcelona.",
            "typeEntity": "Institute",
            "typeRoles": [
                "Provider"
            ]
        },
        {
            "name": "crg.eu",
            "typeEntity": "Institute",
            "typeRoles": [
                "Provider"
            ]
        },
        {
            "email": "diego.garrido@crg.eu",
            "name": "Diego Garrido",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "https://github.com/jmonlong/sQTLseekeR"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "https://github.com/jmonlong/sQTLseekeR"
        },
        {
            "type": "Binaries",
            "url": "https://github.com/jmonlong/sQTLseekeR"
        }
    ],
    "function": [
        {
            "note": "sQTLseekeR is a R package to detect splicing QTLs (sQTLs), which are variants associated with change in the splicing pattern of a gene. Here, splicing patterns are modeled by the relative expression of the transcripts of a gene.\n\nFor more information about the method and performance see article : Monlong, J. et al. Identification of genetic variants associated with alternative splicing using sQTLseekeR. Nat. Commun. 5:4698 doi: 10.1038/ncomms5698 (2014).",
            "operation": [
                {
                    "term": "Sequence analysis",
                    "uri": "http://edamontology.org/operation_2403"
                }
            ]
        }
    ],
    "labels": {
        "cost": "Free of charge",
        "language": [
            "R"
        ],
        "operatingSystem": [
            "Linux"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Computational biology",
                "uri": "http://edamontology.org/topic_3307"
            }
        ]
    },
    "link": [
        {
            "type": "REPOSITORY",
            "url": "https://github.com/jmonlong/sQTLseekeR"
        }
    ],
    "publication": [
        {
            "abstract": "Identification of genetic variants affecting splicing in RNA sequencing population studies is still in its infancy. Splicing phenotype is more complex than gene expression and ought to be treated as a multivariate phenotype to be recapitulated completely. Here we represent the splicing pattern of a gene as the distribution of the relative abundances of a geneâ(tm) s alternative transcript isoforms. We develop a statistical framework that uses a distance-based approach to compute the variability of splicing ratios across observations, and a non-parametric analogue to multivariate analysis of variance. We implement this approach in the R package sQTLseekeR and use it to analyze RNA-Seq data from the Geuvadis project in 465 individuals. We identify hundreds of single nucleotide polymorphisms (SNPs) as splicing QTLs (sQTLs), including some falling in genome-wide association study SNPs. By developing the appropriate metrics, we show that sQTLseekeR compares favorably with existing methods that rely on univariate approaches, predicting variants that behave as expected from mutations affecting splicing. © 2014 Macmillan Publishers Limited.",
            "authors": [
                "Monlong J.",
                "Calvo M.",
                "Ferreira P.G.",
                "Guigo R."
            ],
            "cit_count": 45,
            "doi": "10.1038/ncomms5698",
            "journal": "Nature Communications",
            "title": "Identification of genetic variants associated with alternative splicing using sQTLseekeR",
            "type": "Primary",
            "year": "2014-08-20"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:sqtlseeker",
        "biotoolsID": "sqtlseeker",
        "description": "R package to detect splicing QTLs (sQTLs), which are variants associated with change in the splicing pattern of a gene. Here, splicing patterns are modeled by the relative expression of the transcripts of a gene.",
        "homepage": "https://github.com/guigolab/sQTLseekeR",
        "name": "sQTLseekeR",
        "version": [
            "2.0"
        ]
    }
}