{
    "additionDate": "2022-10-30T10:54:43.605345Z",
    "biotoolsCURIE": "biotools:crosslink-net",
    "biotoolsID": "crosslink-net",
    "confidence_flag": "tool",
    "credit": [
        {
            "name": "Qian Yu"
        },
        {
            "name": "Yinghuan Shi"
        }
    ],
    "description": "A medical image segmentation framework with a double-branch encoder and a typical decoder",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Qianyu1226/Crosslink-Net",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T15:25:04.049949Z",
    "license": "Not licensed",
    "name": "Crosslink-Net",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1109/tip.2022.3203223",
            "metadata": {
                "abstract": "Accurate image segmentation plays a crucial role in medical image analysis, yet it faces great challenges caused by various shapes, diverse sizes, and blurry boundaries. To address these difficulties, square kernel-based encoder-decoder architectures have been proposed and widely used, but their performance remains unsatisfactory. To further address these challenges, we present a novel double-branch encoder architecture. Our architecture is inspired by two observations. (1) Since the discrimination of the features learned via square convolutional kernels needs to be further improved, we propose utilizing nonsquare vertical and horizontal convolutional kernels in a double-branch encoder so that the features learned by both branches can be expected to complement each other. (2) Considering that spatial attention can help models to better focus on the target region in a large-sized image, we develop an attention loss to further emphasize the segmentation of small-sized targets. With the above two schemes, we develop a novel double-branch encoder-based segmentation framework for medical image segmentation, namely, Crosslink-Net, and validate its effectiveness on five datasets with experiments. The code is released at https://github.com/Qianyu1226/Crosslink-Net.",
                "authors": [
                    {
                        "name": "Gao Y."
                    },
                    {
                        "name": "Qi L."
                    },
                    {
                        "name": "Shi Y."
                    },
                    {
                        "name": "Wang W."
                    },
                    {
                        "name": "Yu Q."
                    }
                ],
                "citationCount": 14,
                "date": "2022-01-01T00:00:00Z",
                "journal": "IEEE Transactions on Image Processing",
                "title": "Crosslink-Net: Double-Branch Encoder Network via Fusing Vertical and Horizontal Convolutions for Medical Image Segmentation"
            },
            "pmid": "36074869"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        }
    ],
    "validated": 1
}
