{
    "additionDate": "2021-03-19T08:47:29Z",
    "biotoolsCURIE": "biotools:dnnrmst",
    "biotoolsID": "dnnrmst",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "zhaolili@umich.edu",
            "name": "Lili Zhao",
            "typeEntity": "Person"
        }
    ],
    "description": "Deep Neural Networks For Predicting Restricted Mean Survival Times.\n\nA deep neural network model to predict restricted mean survival time.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                }
            ]
        }
    ],
    "homepage": "http://github.com/lilizhaoUM/DnnRMST",
    "lastUpdate": "2021-04-02T16:57:06Z",
    "name": "DnnRMST",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAA1082",
            "metadata": {
                "abstract": "© The Author(s) 2021. Published by Oxford University Press. All rights reserved. For permissions, please e-mail: journals.permissions@oup.comRestricted mean survival time (RMST) is a useful summary measurement of the time-to-event data, and it has attracted great attention for its straightforward clinical interpretation. In this article, I propose a deep neural network model that directly relates the RMST to its baseline covariates for simultaneous prediction of RSMT at multiple times. Each subject's survival time is transformed into a series of jackknife pseudo observations and then used as quantitative response variables in a deep neural network model. By using the pseudo values, a complex survival analysis is reduced to a standard regression problem, which greatly simplifies the neural network construction. By jointly modeling RMST at multiple times, the neural network model gains prediction accuracy by information sharing across times. The proposed network model was evaluated by extensive simulation studies and was further illustrated on three real datasets. In real data analyses, I also used methods to open the blackbox by identifying subject-specific predictors and their importance in contributing to the risk prediction.",
                "authors": [
                    {
                        "name": "Zhao L."
                    }
                ],
                "date": "2020-12-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Deep neural networks for predicting restricted mean survival times"
            },
            "pmid": "33399818"
        }
    ],
    "toolType": [
        "Command-line tool",
        "Library"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        }
    ]
}