
{
    "credit": [
        {
            "email": "matthias.zytnicki@inra.fr",
            "name": "Matthias Zytnicki",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "https://urgi.versailles.inra.fr/download/s-mart/doc.pdf"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence visualisation",
                    "uri": "http://edamontology.org/operation_0564"
                }
            ]
        }
    ],
    "labels": {
        "collectionID": [
            "S-MART"
        ],
        "language": [
            "Java",
            "Python"
        ],
        "maturity": "Mature",
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Suite"
        ],
        "topic": [
            {
                "term": "RNA-seq",
                "uri": "http://edamontology.org/topic_3170"
            },
            {
                "term": "ChIP-seq",
                "uri": "http://edamontology.org/topic_3169"
            },
            {
                "term": "Data visualisation",
                "uri": "http://edamontology.org/topic_0092"
            }
        ]
    },
    "publication": [
        {
            "abstract": "High-throughput sequencing is now routinely performed in many experiments. But the analysis of the millions of sequences generated, is often beyond the expertise of the wet labs who have no personnel specializing in bioinformatics. Whereas several tools are now available to map high-throughput sequencing data on a genome, few of these can extract biological knowledge from the mapped reads. We have developed a toolbox called S-MART, which handles mapped RNA-Seq data. S-MART is an intuitive and lightweight tool which performs many of the tasks usually required for the analysis of mapped RNA-Seq reads. S-MART does not require any computer science background and thus can be used by all of the biologist community through a graphical interface. S-MART can run on any personal computer, yielding results within an hour even for Gb of data for most queries. S-MART may perform the entire analysis of the mapped reads, without any need for other ad hoc scripts. With this tool, biologists can easily perform most of the analyses on their computer for their RNA-Seq data, from the mapped data to the discovery of important loci. © 2011 Zytnicki, Quesneville.",
            "authors": [
                "Zytnicki M.",
                "Quesneville H."
            ],
            "cit_count": 22,
            "journal": "PLoS ONE",
            "pmid": "21998740",
            "title": "S-MART, A software toolbox to aid RNA-seq data analysis",
            "year": "2011-10-06"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:s-mart",
        "biotoolsID": "s-mart",
        "description": "This tool manages your RNA-Seq and ChIP-seq data.",
        "homepage": "http://urgi.versailles.inra.fr/Tools/S-MART",
        "name": "S-MART"
    }
}