{
    "additionDate": "2017-08-03T19:03:28Z",
    "biotoolsCURIE": "biotools:treesample",
    "biotoolsID": "treesample",
    "credit": [
        {
            "email": "klaas.hartmann@utas.edu.au",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.tb.ethz.ch/people/tstadler"
        }
    ],
    "description": "A program for simulating phylogenetic trees with a fixed number of species.",
    "documentation": [
        {
            "type": "General",
            "url": "https://code.google.com/archive/p/treesample/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Phylogenetic tree analysis",
                    "uri": "http://edamontology.org/operation_0324"
                },
                {
                    "term": "Modelling and simulation",
                    "uri": "http://edamontology.org/operation_2426"
                }
            ]
        }
    ],
    "homepage": "https://code.google.com/p/treesample/",
    "language": [
        "Perl"
    ],
    "lastUpdate": "2018-12-10T12:58:49Z",
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/treesample-1-0-algorithms-sampling-evolutionary-models-speciation.html"
        }
    ],
    "name": "TreeSample",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "A wide range of evolutionary models for species-level (and higher) diversification have been developed. These models can be used to test evolutionary hypotheses and provide comparisons with phylogenetic trees constructed from real data. To carry out these tests and comparisons, it is often necessary to sample, or simulate, trees from the evolutionary models. Sampling trees from these models is more complicated than it may appear at first glance, necessitating careful consideration and mathematical rigor. Seemingly straightforward sampling methods may produce trees that have systematically biased shapes or branch lengths. This is particularly problematic as there is no simple method for determining whether the sampled trees are appropriate. In this paper, we show why a commonly used simple sampling approach (SSA)-simulating trees forward in time until n species are first reached-should only be applied to the simplest pure birth model, the Yule model. We provide an alternative general sampling approach (GSA) that can be applied to most other models. Furthermore, we introduce the constant-rate birth-death model sampling approach, which samples trees very efficiently from a widely used class of models. We explore the bias produced by SSA and identify situations in which this bias is particularly pronounced. We show that using SSA can lead to erroneous conclusions: When using the inappropriate SSA, the variance of a gradually evolving trait does not correlate with the age of the tree; when the correct GSA is used, the trait variance correlates with tree age. The algorithms presented here are available in the Perl Bio:Phylo package, as a stand-alone program TreeSample, and in the R TreeSim package. © The Author(s) 2010.",
                "authors": [
                    {
                        "name": "Hartmann K."
                    },
                    {
                        "name": "Wong D."
                    },
                    {
                        "name": "Stadler T."
                    }
                ],
                "citationCount": 40,
                "date": "2010-06-25T00:00:00Z",
                "journal": "Systematic Biology",
                "title": "Sampling trees from evolutionary models"
            },
            "pmid": "20547782"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        },
        {
            "term": "Evolutionary biology",
            "uri": "http://edamontology.org/topic_3299"
        },
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        }
    ],
    "validated": 1
}