{
    "accessibility": "Open access",
    "additionDate": "2022-10-05T17:47:03.299199Z",
    "biotoolsCURIE": "biotools:aquadesign",
    "biotoolsID": "aquadesign",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "thomas.lecocq@univ-lorraine.fr",
            "name": "Thomas Lecocq",
            "orcidid": "https://orcid.org/0000-0002-4947-0332",
            "typeEntity": "Person"
        }
    ],
    "description": "A tool to assist aquaculture production design based on abiotic requirements of animal species.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Principal component analysis",
                    "uri": "http://edamontology.org/operation_3960"
                }
            ]
        }
    ],
    "homepage": "https://github.com/GregoireButruille/AquaDesign",
    "language": [
        "R"
    ],
    "lastUpdate": "2022-10-05T17:47:03.301998Z",
    "license": "Not licensed",
    "name": "AquaDesign",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PONE.0272508",
            "metadata": {
                "abstract": "© 2022 Butruille et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Farming new species and promoting polyculture can enhance aquaculture sustainability. This implies to define the rearing conditions that meet the ecological requirements of a target species and/or to assess if different species can live in the same farming environment. However, there is a large number of rearing conditions and/or taxon combinations that can be considered. In order to minimise cumbersome and expensive empirical trials to explore all possibilities, we introduce a tool, AquaDesign. It is based on a R-script and package which help to determine farming conditions that are most likely suitable for species through in silico assessment. We estimate farming conditions potentially suitable for an aquatic organism by considering the species niche. We define the species n-dimensional niche hypervolume using a correlative approach in which the species niche is estimated by relating distribution data to environmental conditions. Required input datasets are mined from several public databases. The assistant tool allows users to highlight (i) abiotic conditions that are most likely suitable for species and (ii) combinations of species potentially able to live in the same abiotic environment. Moreover, it offers the possibility to assess if a particular set of abiotic conditions or a given farming location is potentially suitable for the monoculture or the polyculture of species of interest. Our tool provides useful pieces of information to develop freshwater aquacultures. Using the large amount of biogeographic and abiotic information available in public databases allows us to propose a pragmatic and operational tool even for species for which abiotic requirements are poorly or not available in literature such as currently nonproduced species. Overall, we argue that the assistant tool can act as a stepping stone to promote new aquatic productions which are required to enhance aquaculture sustainability.",
                "authors": [
                    {
                        "name": "Amoussou N."
                    },
                    {
                        "name": "Butruille G."
                    },
                    {
                        "name": "Chauchard S."
                    },
                    {
                        "name": "Lecocq T."
                    },
                    {
                        "name": "Pasquet A."
                    },
                    {
                        "name": "Rosenstein A."
                    },
                    {
                        "name": "Thomas M."
                    },
                    {
                        "name": "Toomey L."
                    }
                ],
                "date": "2022-08-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "AquaDesign: A tool to assist aquaculture production design based on abiotic requirements of animal species"
            },
            "pmcid": "PMC9342733",
            "pmid": "35913974"
        }
    ],
    "toolType": [
        "Library",
        "Script"
    ],
    "topic": [
        {
            "term": "Agricultural science",
            "uri": "http://edamontology.org/topic_3810"
        },
        {
            "term": "Ecology",
            "uri": "http://edamontology.org/topic_0610"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "Zoology",
            "uri": "http://edamontology.org/topic_3500"
        }
    ],
    "validated": 1
}
