{
    "additionDate": "2021-01-18T07:01:16Z",
    "biotoolsCURIE": "biotools:messar",
    "biotoolsID": "messar",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "kris.laukens@uantwerpen.be",
            "name": "Kris Laukens",
            "orcidid": "https://orcid.org/0000-0002-8217-2564",
            "typeEntity": "Person"
        }
    ],
    "description": "Automated recommendation of metabolite substructures from tandem mass spectra.\n\nMESSAR 0.1 (MEtabolite SubStructure Auto-Recommender).",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Natural product identification",
                    "uri": "http://edamontology.org/operation_3803"
                },
                {
                    "term": "Spectral library search",
                    "uri": "http://edamontology.org/operation_3801"
                },
                {
                    "term": "Spectrum calculation",
                    "uri": "http://edamontology.org/operation_3860"
                }
            ]
        }
    ],
    "homepage": "http://messar.biodatamining.be",
    "lastUpdate": "2021-02-20T18:07:19Z",
    "name": "MESSAR",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PONE.0226770",
            "metadata": {
                "abstract": "© 2020 Liu et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Despite the increasing importance of non-targeted metabolomics to answer various life science questions, extracting biochemically relevant information from metabolomics spectral data is still an incompletely solved problem. Most computational tools to identify tandem mass spectra focus on a limited set of molecules of interest. However, such tools are typically constrained by the availability of reference spectra or molecular databases, limiting their applicability of generating structural hypotheses for unknown metabolites. In contrast, recent advances in the field illustrate the possibility to expose the underlying biochemistry without relying on metabolite identification, in particular via substructure prediction. We describe an automated method for substructure recommendation motivated by association rule mining. Our framework captures potential relationships between spectral features and substructures learned from public spectral libraries. These associations are used to recommend substructures for any unknown mass spectrum. Our method does not require any predefined metabolite candidates, and therefore it can be used for the hypothesis generation or partial identification of unknown unknowns. The method is called MESSAR (MEtabolite SubStructure Auto-Recommender) and is implemented in a free online web service available at messar.biodatamining.be.",
                "authors": [
                    {
                        "name": "Bittremieux W."
                    },
                    {
                        "name": "Laukens K."
                    },
                    {
                        "name": "Liu Y."
                    },
                    {
                        "name": "Meysman P."
                    },
                    {
                        "name": "Mrzic A."
                    },
                    {
                        "name": "Romijn E.P."
                    },
                    {
                        "name": "Valkenborg D."
                    },
                    {
                        "name": "de Vijlder T."
                    }
                ],
                "citationCount": 4,
                "date": "2020-01-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "Messar: Automated recommendation of metabolite substructures from tandem mass spectra"
            },
            "pmcid": "PMC6964822",
            "pmid": "31945070"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Biochemistry",
            "uri": "http://edamontology.org/topic_3292"
        },
        {
            "term": "Drug metabolism",
            "uri": "http://edamontology.org/topic_3375"
        },
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
