{
    "additionDate": "2021-01-20T11:00:04Z",
    "biotoolsCURIE": "biotools:gene",
    "biotoolsID": "gene",
    "collectionID": [
        "Rare Disease"
    ],
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "sbougarn@sidra.org",
            "name": "Salim Bougarn",
            "orcidid": "https://orcid.org/0000-0003-1132-6615",
            "typeEntity": "Person"
        }
    ],
    "description": "A curated transcriptome dataset collection to investigate inborn errors of immunity.\n\nPrimary immunodeficiencies (PIDs) are a heterogeneous group of inherited disorders, frequently caused by loss-of-function and less commonly by gain-of-function mutations, which can result in susceptibility to a broad or a very narrow range of infections but also in inflammatory, allergic or malignant diseases. Owing to the wide range in clinical manifestations and variability in penetrance and expressivity, there is an urgent need to better understand the underlying molecular, cellular and immunological phenotypes in PID patients in order to improve clinical diagnosis and management. Here we have compiled a manually curated collection of public transcriptome datasets mainly obtained from human whole blood, peripheral blood mononuclear cells (PBMCs) or fibroblasts of patients with PIDs and of control subjects for subsequent meta-analysis, query and interpretation",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                },
                {
                    "term": "Differential gene expression analysis",
                    "uri": "http://edamontology.org/operation_3223"
                }
            ]
        }
    ],
    "homepage": "http://pid.gxbsidra.org/dm3/geneBrowser/list",
    "lastUpdate": "2021-05-17T06:39:06.903911Z",
    "name": "Gene",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.12688/F1000RESEARCH.18048.2",
            "metadata": {
                "abstract": "© 2019 Bougarn S et al.Primary immunodeficiencies (PIDs) are a heterogeneous group of inherited disorders, frequently caused by loss-of-function and less commonly by gain-of-function mutations, which can result in susceptibility to a broad or a very narrow range of infections but also in inflammatory, allergic or malignant diseases. Owing to the wide range in clinical manifestations and variability in penetrance and expressivity, there is an urgent need to better understand the underlying molecular, cellular and immunological phenotypes in PID patients in order to improve clinical diagnosis and management. Here we have compiled a manually curated collection of public transcriptome datasets mainly obtained from human whole blood, peripheral blood mononuclear cells (PBMCs) or fibroblasts of patients with PIDs and of control subjects for subsequent meta-analysis, query and interpretation. A total of eighteen (18) datasets derived from studies of PID patients were identified and retrieved from the NCBI Gene Expression Omnibus (GEO) database and loaded in GXB, a custom web application designed for interactive query and visualization of integrated large-scale data. The dataset collection includes samples from well characterized PID patients that were stimulated ex vivo under a variety of conditions to assess the molecular consequences of the underlying, naturally occurring gene defects on a genome-wide scale. Multiple sample groupings and rank lists were generated to facilitate comparisons of the transcriptional responses between different PID patients and control subjects. The GXB tool enables browsing of a single transcript across studies, thereby providing new perspectives on the role of a given molecule across biological systems and PID patients. This dataset collection is available at http://pid.gxbsidra.org/dm3/geneBrowser/list.",
                "authors": [
                    {
                        "name": "Bougarn S."
                    },
                    {
                        "name": "Boughorbel S."
                    },
                    {
                        "name": "Chaussabel D."
                    },
                    {
                        "name": "Marr N."
                    }
                ],
                "date": "2019-01-01T00:00:00Z",
                "journal": "F1000Research",
                "title": "A curated transcriptome dataset collection to investigate inborn errors of immunity"
            },
            "pmcid": "PMC6749933",
            "pmid": "31559014"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        },
        {
            "term": "Allergy, clinical immunology and immunotherapeutics",
            "uri": "http://edamontology.org/topic_3400"
        },
        {
            "term": "Immunology",
            "uri": "http://edamontology.org/topic_0804"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        },
        {
            "term": "Rare diseases",
            "uri": "http://edamontology.org/topic_3325"
        }
    ]
}