
{
    "credit": [
        {
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://www2.imperial.ac.uk/~gmontana/"
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://wwwf.imperial.ac.uk/~gmontana/software/psrrr/docs.zip"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Pathway or network prediction",
                    "uri": "http://edamontology.org/operation_3439"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Python"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Genotype and phenotype",
                "uri": "http://edamontology.org/topic_0625"
            },
            {
                "term": "Molecular interactions, pathways and networks",
                "uri": "http://edamontology.org/topic_0602"
            },
            {
                "term": "Nucleic acids",
                "uri": "http://edamontology.org/topic_0077"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://www.mybiosoftware.com/psrrr-pathways-sparse-reduced-rank-regression.html"
        }
    ],
    "publication": [
        {
            "abstract": "We present a new method for the detection of gene pathways associated with a multivariate quantitative trait, and use it to identify causal pathways associated with an imaging endophenotype characteristic of longitudinal structural change in the brains of patients with Alzheimer's disease (AD). Our method, known as pathways sparse reduced-rank regression (PsRRR), uses group lasso penalised regression to jointly model the effects of genome-wide single nucleotide polymorphisms (SNPs), grouped into functional pathways using prior knowledge of gene-gene interactions. Pathways are ranked in order of importance using a resampling strategy that exploits finite sample variability. Our application study uses whole genome scans and MR images from 99 probable AD patients and 164 healthy elderly controls in the Alzheimer's Disease Neuroimaging Initiative (ADNI) database. 66,182 SNPs are mapped to 185 gene pathways from the KEGG pathway database. Voxel-wise imaging signatures characteristic of AD are obtained by analysing 3D patterns of structural change at 6, 12 and 24. months relative to baseline. High-ranking, AD endophenotype-associated pathways in our study include those describing insulin signalling, vascular smooth muscle contraction and focal adhesion. All of these have been previously implicated in AD biology. In a secondary analysis, we investigate SNPs and genes that may be driving pathway selection. High ranking genes include a number previously linked in gene expression studies to ?-amyloid plaque formation in the AD brain (PIK3. R3,. PIK3. CG,. PRKCAand. PRKCB), and to AD related changes in hippocampal gene expression (ADCY2, ACTN1, ACACA, and GNAI1). Other high ranking previously validated AD endophenotype-related genes include CR1, TOMM40 and APOE. © 2012 Elsevier Inc.",
            "authors": [
                "Silver M.",
                "Janousova E.",
                "Hua X.",
                "Thompson P.M.",
                "Montana G."
            ],
            "cit_count": 41,
            "journal": "NeuroImage",
            "pmid": "22982105",
            "title": "Identification of gene pathways implicated in Alzheimer's disease using longitudinal imaging phenotypes with sparse regression",
            "year": "2012-11-15"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:psrrr",
        "biotoolsID": "psrrr",
        "description": "Method for detecting gene pathways associated with a multivariate quantitative trait or phenotype.",
        "homepage": "http://www2.imperial.ac.uk/~gmontana/psrrr.htm",
        "name": "PsRRR"
    }
}