
{
    "credit": [
        {
            "email": "schaft@cmbi.ru.nl",
            "name": "G.Schaftenaar",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://www.cmbi.ru.nl/~schaft"
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://www.cmbi.ru.nl/molden/molden.html"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Data handling",
                    "uri": "http://edamontology.org/operation_2409"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Molecular modelling",
                "uri": "http://edamontology.org/topic_2275"
            },
            {
                "term": "Structure analysis",
                "uri": "http://edamontology.org/topic_0081"
            },
            {
                "term": "Small molecules",
                "uri": "http://edamontology.org/topic_0154"
            },
            {
                "term": "Computational chemistry",
                "uri": "http://edamontology.org/topic_3332"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/molden-5-0-package-displaying-molecular-density.html"
        }
    ],
    "publication": [
        {
            "abstract": "Molden is a software package for pre- and postprocessing of computational chemistry program data. Interfacing to the ab initio programs Gamess-US/UK and Gaussian and to the semi-empirical package MOPAC is provided. The emphasis is on computation and visualization of electronic and molecular properties but, e.g., reaction pathways can be simulated as well. Some molecular properties of interest are processed directly from the output of the computational chemistry programs, others are calculated in MOLDEN before display. The package features different options to display MOLecular electronic DENsity, each focusing on a different structural aspect: molecular orbitals, electron density, molecular minus atomic density and the Laplacian of the electron density. To display difference density, either the spherically averaged atomic density or the oriented ground state atomic density can be used for a number of standard basis sets. The quantum mechanical electrostatic potential or a distributed multipole expansion derived electrostatic potential can be calculated and atomic charges can be fitted to these potentials calculated on Connolly surface(s). Reaction pathways and molecular vibrations can be visualized. Input structures can be generated with a Z-matrix editor. A variety of graphics languages is supported: XWindows, postscript, VRML and Povray format.",
            "authors": [
                "Schaftenaar G.",
                "Noordik J.H."
            ],
            "cit_count": 2511,
            "journal": "Journal of Computer-Aided Molecular Design",
            "pmid": "10721501",
            "title": "Molden: A pre- and post-processing program for molecular and electronic structures",
            "year": "2000-03-06"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:molden",
        "biotoolsID": "molden",
        "description": "Package for displaying Molecular Density from the Ab Initio packages GAMESS-UK , GAMESS-US and GAUSSIAN and the Semi-Empirical packages Mopac/Ampac, it also supports a number of other programs via the Molden Format.",
        "homepage": "http://www.cmbi.ru.nl/molden/molden.html",
        "name": "MOLDEN"
    }
}