{
    "accessibility": "Open access",
    "additionDate": "2023-01-18T22:59:27.936164Z",
    "biotoolsCURIE": "biotools:dcifer",
    "biotoolsID": "dcifer",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Boris Gerlovin"
        },
        {
            "name": "Bryan Greenhouse"
        },
        {
            "name": "Isabel Rodríguez-Barraquer"
        },
        {
            "name": "Inna Gerlovina",
            "orcidid": "http://orcid.org/0000-0002-7772-7473"
        }
    ],
    "description": "an IBD-based method to calculate genetic distance between polyclonal infections.",
    "documentation": [
        {
            "type": [
                "Other"
            ],
            "url": "https://cran.r-project.org/web/packages/dcifer/vignettes/vignetteDcifer.pdf"
        },
        {
            "type": [
                "User manual"
            ],
            "url": "https://cran.r-project.org/web/packages/dcifer/dcifer.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Phasing",
                    "uri": "http://edamontology.org/operation_3454"
                }
            ]
        }
    ],
    "homepage": "https://eppicenter.github.io/dcifer/",
    "language": [
        "R"
    ],
    "lastUpdate": "2024-11-24T15:11:38.489780Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://cran.r-project.org/web/packages/dcifer/index.html"
        },
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/EPPIcenter/dcifer"
        }
    ],
    "name": "Dcifer",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1093/genetics/iyac126",
            "metadata": {
                "abstract": "An essential step toward reconstructing pathogen transmission and answering epidemiologically relevant questions from genomic data is obtaining pairwise genetic distance between infections. For recombining organisms such as malaria parasites, relatedness measures quantifying recent shared ancestry would provide a meaningful distance, suggesting methods based on identity by descent (IBD). While the concept of relatedness and consequently an IBD approach is fairly straightforward for individual parasites, the distance between polyclonal infections, which are prevalent in malaria, presents specific challenges, and awaits a general solution that could be applied to infections of any clonality and accommodate multiallelic (e.g. microsatellite or microhaplotype) and biallelic [single nucleotide polymorphism (SNP)] data. Filling this methodological gap, we present Dcifer (Distance for complex infections: fast estimation of relatedness), a method for calculating genetic distance between polyclonal infections, which is designed for unphased data, explicitly accounts for population allele frequencies and complexity of infection, and provides reliable inference. Dcifer's IBD-based framework allows us to define model parameters that represent interhost relatedness and to propose corresponding estimators with attractive statistical properties. By using combinatorics to account for unobserved phased haplotypes, Dcifer is able to quickly process large datasets and estimate pairwise relatedness along with measures of uncertainty. We show that Dcifer delivers accurate and interpretable results and detects related infections with statistical power that is 2-4 times greater than that of approaches based on identity by state. Applications to real data indicate that relatedness structure aligns with geographic locations. Dcifer is implemented in a comprehensive publicly available software package.",
                "authors": [
                    {
                        "name": "Gerlovin B."
                    },
                    {
                        "name": "Gerlovina I."
                    },
                    {
                        "name": "Greenhouse B."
                    },
                    {
                        "name": "Rodriguez-Barraquer I."
                    }
                ],
                "citationCount": 13,
                "date": "2022-10-01T00:00:00Z",
                "journal": "Genetics",
                "title": "Dcifer: an IBD-based method to calculate genetic distance between polyclonal infections"
            },
            "pmcid": "PMC9526043",
            "pmid": "36000888"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Public health and epidemiology",
            "uri": "http://edamontology.org/topic_3305"
        },
        {
            "term": "Structure analysis",
            "uri": "http://edamontology.org/topic_0081"
        }
    ],
    "validated": 1
}
