{
    "additionDate": "2021-01-18T10:03:55Z",
    "biotoolsCURIE": "biotools:simuscop",
    "biotoolsID": "simuscop",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "zhyu@nxu.edu.cn",
            "name": "Zhenhua Yu",
            "orcidid": "https://orcid.org/0000-0001-6526-6991",
            "typeEntity": "Person"
        },
        {
            "email": "zyuanwei@ustc.edu.cn",
            "name": "Yuanwei Zhang",
            "typeEntity": "Person"
        }
    ],
    "description": "reliably simulate Illumina sequencing data based on position and context dependent profiles.\n\na novel tool to reliably Simulate Illumina Sequencing data based on position and Context dependent Profiles. More details about the software can be found from here.\n\na novel next-generation sequencing simulator using position and genomic contexts based error profiles.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://github.com/qasimyu/simuscop/blob/master/docs/SimuSCoP_User_Guide.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Base-calling",
                    "uri": "http://edamontology.org/operation_3185"
                },
                {
                    "term": "Modelling and simulation",
                    "uri": "http://edamontology.org/operation_2426"
                },
                {
                    "term": "Read pre-processing",
                    "uri": "http://edamontology.org/operation_3219"
                },
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                }
            ]
        }
    ],
    "homepage": "https://github.com/qasimyu/simuscop",
    "language": [
        "C++"
    ],
    "lastUpdate": "2021-02-18T17:56:30Z",
    "license": "GPL-3.0",
    "name": "SimuSCoP",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1186/S12859-020-03665-5",
            "metadata": {
                "abstract": "© 2020 The Author(s).Background: A number of simulators have been developed for emulating next-generation sequencing data by incorporating known errors such as base substitutions and indels. However, their practicality may be degraded by functional and runtime limitations. Particularly, the positional and genomic contextual information is not effectively utilized for reliably characterizing base substitution patterns, as well as the positional and contextual difference of Phred quality scores is not fully investigated. Thus, a more effective and efficient bioinformatics tool is sorely required. Results: Here, we introduce a novel tool, SimuSCoP, to reliably emulate complex DNA sequencing data. The base substitution patterns and the statistical behavior of quality scores in Illumina sequencing data are fully explored and integrated into the simulation model for reliably emulating datasets for different applications. In addition, an integrated and easy-to-use pipeline is employed in SimuSCoP to facilitate end-to-end simulation of complex samples, and high runtime efficiency is achieved by implementing the tool to run in multithreading with low memory consumption. These features enable SimuSCoP to gets substantial improvements in reliability, functionality, practicality and runtime efficiency. The tool is comprehensively evaluated in multiple aspects including consistency of profiles, simulation of genomic variations and complex tumor samples, and the results demonstrate the advantages of SimuSCoP over existing tools. Conclusions: SimuSCoP, a new bioinformatics tool is developed to learn informative profiles from real sequencing data and reliably mimic complex data by introducing various genomic variations. We believe that the presented work will catalyse new development of downstream bioinformatics methods for analyzing sequencing data.",
                "authors": [
                    {
                        "name": "Ban R."
                    },
                    {
                        "name": "Du F."
                    },
                    {
                        "name": "Yu Z."
                    },
                    {
                        "name": "Zhang Y."
                    }
                ],
                "citationCount": 1,
                "date": "2020-07-23T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "SimuSCoP: Reliably simulate Illumina sequencing data based on position and context dependent profiles"
            },
            "pmcid": "PMC7379788",
            "pmid": "32703148"
        }
    ],
    "topic": [
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Sequence sites, features and motifs",
            "uri": "http://edamontology.org/topic_0160"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ]
}
