{
    "additionDate": "2017-12-18T00:09:08Z",
    "biotoolsCURIE": "biotools:mwt",
    "biotoolsID": "mwt",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.med.unibs.it/~calza/"
        }
    ],
    "description": "MWT computes FDR based on a moderated version of the Welch test. It’s particularly suited for small samples comparisons exprecially with unequal variances",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Microarray data analysis",
                    "uri": "http://edamontology.org/operation_2495"
                }
            ]
        }
    ],
    "homepage": "http://fafner.meb.ki.se/personal/yudpaw/?page_id=13",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-10T12:58:57Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/mwt-0-2-6-moderated-welch-test.html"
        }
    ],
    "name": "MWT",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btn100",
            "metadata": {
                "abstract": "Motivation: In searching for differentially expressed (DE) genes in microarray data, we often observe a fraction of the genes to have unequal variability between groups. This is not an issue in large samples, where a valid test exists that uses individual variances separately. The problem arises in the small-sample setting, where the approximately valid Welch test lacks sensitivity, while the more sensitive moderated t-test assumes equal variance. Methods: We introduce a moderated Welch test (MWT) that allows unequal variance between groups. It is based on (i) weighting of pooled and unpooled standard errors and (ii) improved estimation of the gene-level variance that exploits the information from across the genes. Results: When a non-trivial proportion of genes has unequal variability, false discovery rate (FDR) estimates based on the standard t and moderated t-tests are often too optimistic, while the standard Welch test has low sensitivity. The MWT is shown to (i) perform better than the standard t, the standard Welch and the moderated t-tests when the variances are unequal between groups and (ii) perform similarly to the moderated t, and better than the standard t and Welch tests when the group variances are equal. These results mean that MWT is more reliable than other existing tests over wider range of data conditions. © The Author 2008. Published by Oxford University Press. All rights reserved.",
                "authors": [
                    {
                        "name": "Demissie M."
                    },
                    {
                        "name": "Mascialino B."
                    },
                    {
                        "name": "Calza S."
                    },
                    {
                        "name": "Pawitan Y."
                    }
                ],
                "citationCount": 19,
                "date": "2008-05-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Unequal group variances in microarray data analyses"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "samples",
            "uri": "http://edamontology.org/topic_3277"
        }
    ],
    "validated": 1,
    "version": [
        "0.2.7"
    ]
}