
{
    "credit": [
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                }
            ]
        }
    ],
    "labels": {
        "topic": [
            {
                "term": "Mathematics",
                "uri": "http://edamontology.org/topic_3315"
            },
            {
                "term": "Machine learning",
                "uri": "http://edamontology.org/topic_3474"
            },
            {
                "term": "Neurobiology",
                "uri": "http://edamontology.org/topic_3304"
            }
        ]
    },
    "publication": [
        {
            "abstract": "OBJECTIVE: The paper aims to present a method that enables the application of independent component analysis (ICA) to a low-channel EEG recording. The idea behind the method (called moving average ICA or MAICA) is to extend the original low-sensor matrix of signals by applying a set of zero-phase moving average filters to each of the recorded signals. APPROACH: The paper discusses the theoretical background of the MAICA algorithm and verifies its usefulness under three exemplary settings: (i) a pure mathematic system composed of ten source sinusoids; (ii) real EEG data recorded from 64 channels; (iii) real EEG data recorded from five subjects during 200 trials with motor imagery brain-computer interface. MAIN RESULTS: The first system shows that MAICA is able to decompose two mixed signals (composed of ten source sinusoids) into ten components with an extremely high correlation between the source patterns and identified components (99%-100%). The second system shows that when used over five channels, MAICA is able to recognize more artefact components than those recognized by classic ICA used over 64 channels. Finally, the third system demonstrates that MAICA is capable of working in an online mode without significant delays; the additional time needed to run MAICA for one trial was less than 6ms in the survey reported in the paper. SIGNIFICANCE: The method presented in the paper should have a significant impact on all areas of medical signal processing where a large number of known and/or unknown patterns have to be retrieved in real time from complex signals recorded from a small number of external/internal body sensors.",
            "authors": [
                "Rejer I.",
                "Gorski P."
            ],
            "cit_count": 0,
            "doi": "10.1088/1741-2552/AB36DB",
            "journal": "Journal of neural engineering",
            "pmid": "31362282",
            "title": "MAICA: an ICA-based method for source separation in a low-channel EEG recording",
            "year": "2019-09-11"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:MAICA",
        "biotoolsID": "MAICA",
        "description": "> MEDIUM CONFIDENCE! | > HOMEPAGE MISSING! | an ICA-based method for source separation in a low-channel EEG recording | OBJECTIVE:The paper aims to present a method that enables the application of independent component analysis (ICA) to a low-channel EEG recording. The idea behind the method (called moving average ICA or MAICA) is to extend the original low-sensor matrix of signals by applying a set of zero-phase moving average filters to each of the recorded signals. APPROACH:The paper discusses the theoretical background of the MAICA algorithm and verifies its usefulness under three exemplary settings: (i) a pure mathematic system composed of ten source sinusoids; (ii) real EEG data recorded from 64 channels; (iii) real EEG data recorded from five subjects during 200 trials with motor imagery brain-computer interface",
        "homepage": "https://www.ncbi.nlm.nih.gov/pubmed/?term=31362282",
        "name": "MAICA"
    }
}