{
    "additionDate": "2017-02-10T11:34:08Z",
    "biotoolsCURIE": "biotools:movies",
    "biotoolsID": "movies",
    "description": "MoViES (Molecular Vibrations Evaluation Server) allows the computation of the vibrational and thermal fluctuations dynamics for the chemical bonds of biomolecules.  The server takes as input a structure file in PDB format and returns results by email.  Analysis of vibrational motions and thermal fluctuational dynamics can give insights into the functional properties of both proteins and nucleic acids.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Nucleic acid property calculation",
                    "uri": "http://edamontology.org/operation_0262"
                },
                {
                    "term": "Nucleic acid structure analysis",
                    "uri": "http://edamontology.org/operation_2481"
                },
                {
                    "term": "Nucleic acid thermodynamic property calculation",
                    "uri": "http://edamontology.org/operation_0455"
                },
                {
                    "term": "Protein flexibility and motion analysis",
                    "uri": "http://edamontology.org/operation_0244"
                }
            ]
        }
    ],
    "homepage": "http://ang.cz3.nus.edu.sg/cgi-bin/prog/norm.pl",
    "homepage_status": 1,
    "lastUpdate": "2018-12-10T12:58:44Z",
    "name": "MoViES",
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "Analysis of vibrational motions and thermal fluctuational dynamics is a widely used approach for studying structural, dynamic and functional properties of proteins and nucleic acids. Development of a freely accessible web server for computation of vibrational and thermal fluctuational dynamics of biomolecules is thus useful for facilitating the relevant studies. We have developed a computer program for computing vibrational normal modes and thermal fluctuational properties of proteins and nucleic acids and applied it in several studies. In our program, vibrational normal modes are computed by using modified AMBER molecular mechanics force fields, and thermal fluctuational properties are computed by means of a self-consistent harmonic approximation method. A web version of our program, MoViES (Molecular Vibrations Evaluation Server), was set up to facilitate the use of our program to study vibrational dynamics of proteins and nucleic acids. This software was tested on selected proteins, which show that the computed normal modes and thermal fluctuational bond disruption probabilities are consistent with experimental findings and other normal mode computations. MoVIES can be accessed, at http://ang.cz3.nus.edu.sg/cgi-bin/prog/norm.pl. © Oxford University Press 2004; all rights reserved.",
                "authors": [
                    {
                        "name": "Cao Z.W."
                    },
                    {
                        "name": "Chen Y.Z."
                    },
                    {
                        "name": "Han L.Y."
                    },
                    {
                        "name": "Lin H.H."
                    },
                    {
                        "name": "Xie B."
                    },
                    {
                        "name": "Xue Y."
                    },
                    {
                        "name": "Zheng C.J."
                    },
                    {
                        "name": "Zhou H."
                    }
                ],
                "citationCount": 13,
                "date": "2004-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "MoViES: Molecular vibrations evaluation server for analysis of fluctuational dynamics of proteins and nucleic acids"
            },
            "pmid": "15215475"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Molecular dynamics",
            "uri": "http://edamontology.org/topic_0176"
        },
        {
            "term": "Nucleic acid structure analysis",
            "uri": "http://edamontology.org/topic_0097"
        },
        {
            "term": "Nucleic acids",
            "uri": "http://edamontology.org/topic_0077"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Structure analysis",
            "uri": "http://edamontology.org/topic_0081"
        }
    ],
    "validated": 1
}
