{
    "additionDate": "2019-11-14T19:47:42Z",
    "biotoolsCURIE": "biotools:diurnal-tools",
    "biotoolsID": "diurnal-tools",
    "confidence_flag": "tool",
    "description": "A platform dedicated to the visualization and analysis of diurnal plant co-expression and co-function networks.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Expression correlation analysis",
                    "uri": "http://edamontology.org/operation_3463"
                },
                {
                    "term": "Expression profile clustering",
                    "uri": "http://edamontology.org/operation_0313"
                },
                {
                    "term": "Weighted correlation network analysis",
                    "uri": "http://edamontology.org/operation_3766"
                }
            ]
        }
    ],
    "homepage": "http://Diurnal.plant.tools",
    "lastUpdate": "2021-01-11T13:08:36Z",
    "name": "Diurnal plant tools",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/PCP/PCZ176",
            "metadata": {
                "abstract": "© The Author(s) 2019.Almost all organisms coordinate some aspects of their biology through the diurnal cycle. Photosynthetic organisms, and plants especially, have established complex programs that coordinate physiological, metabolic and developmental processes with the changing light. The diurnal regulation of the underlying transcriptional processes is observed when groups of functionally related genes (gene modules) are expressed at a specific time of the day. However, studying the diurnal regulation of these gene modules in the plant kingdom was hampered by the large amount of data required for the analyses. To meet this need, we used gene expression data from 17 diurnal studies spanning the whole Archaeplastida kingdom (Plantae kingdom in the broad sense) to make an online diurnal database. We have equipped the database with tools that allow user-friendly cross-species comparisons of gene expression profiles, entire co-expression networks, co-expressed clusters (involved in specific biological processes), time-specific gene expression and others. We exemplify how these tools can be used by studying three important biological questions: (i) the evolution of cell division, (ii) the diurnal control of gene modules in algae and (iii) the conservation of diurnally controlled modules across species. The database is freely available at http://diurnal.plant.tools.",
                "authors": [
                    {
                        "name": "Ferrari C."
                    },
                    {
                        "name": "Mutwil M."
                    },
                    {
                        "name": "Ng J.W.X."
                    },
                    {
                        "name": "Tan Q.W."
                    }
                ],
                "citationCount": 3,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Plant and Cell Physiology",
                "title": "Diurnal.plant.tools: Comparative transcriptomic and co-expression analyses of diurnal gene expression of the archaeplastida kingdom"
            },
            "pmid": "31501868"
        }
    ],
    "toolType": [
        "Bioinformatics portal"
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        }
    ],
    "validated": 1
}
