{
    "accessibility": "Open access",
    "additionDate": "2024-06-19T07:38:54.412594Z",
    "biotoolsCURIE": "biotools:bayeskat",
    "biotoolsID": "bayeskat",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "cuiy@msu.edu",
            "name": "Yuehua Cui",
            "typeEntity": "Person"
        },
        {
            "email": "wangj164@msu.edu",
            "name": "Jianrong Wang",
            "typeEntity": "Person"
        }
    ],
    "description": "BayesKAT methodology to detect the presence of any genetic association between a trait and a group of preassigned genetic features. BayesKAT can implement a kernel-based association test that automatically selects the optimum kernel using the Bayesian approach and returns an interpretable result by incorporating prior knowledge based on biological experiments or known biological mechanisms.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Collapsing methods",
                    "uri": "http://edamontology.org/operation_3791"
                },
                {
                    "term": "DNA testing",
                    "uri": "http://edamontology.org/operation_3920"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Pathway analysis",
                    "uri": "http://edamontology.org/operation_3928"
                }
            ]
        }
    ],
    "homepage": "https://github.com/wangjr03/BayesKAT",
    "language": [
        "R"
    ],
    "lastUpdate": "2024-06-19T07:38:54.414932Z",
    "name": "BayesKAT",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/bib/bbae182",
            "metadata": {
                "abstract": "Genome-wide Association Studies (GWAS) methods have identified individual single-nucleotide polymorphisms (SNPs) significantly associated with specific phenotypes. Nonetheless, many complex diseases are polygenic and are controlled by multiple genetic variants that are usually non-linearly dependent. These genetic variants are marginally less effective and remain undetected in GWAS analysis. Kernel-based tests (KBT), which evaluate the joint effect of a group of genetic variants, are therefore critical for complex disease analysis. However, choosing different kernel functions in KBT can significantly influence the type I error control and power, and selecting the optimal kernel remains a statistically challenging task. A few existing methods suffer from inflated type 1 errors, limited scalability, inferior power or issues of ambiguous conclusions. Here, we present a new Bayesian framework, BayesKAT (https://github.com/wangjr03/BayesKAT), which overcomes these kernel specification issues by selecting the optimal composite kernel adaptively from the data while testing genetic associations simultaneously. Furthermore, BayesKAT implements a scalable computational strategy to boost its applicability, especially for high-dimensional cases where other methods become less effective. Based on a series of performance comparisons using both simulated and real large-scale genetics data, BayesKAT outperforms the available methods in detecting complex group-level associations and controlling type I errors simultaneously. Applied on a variety of groups of functionally related genetic variants based on biological pathways, co-expression gene modules and protein complexes, BayesKAT deciphers the complex genetic basis and provides mechanistic insights into human diseases.",
                "authors": [
                    {
                        "name": "Cui Y."
                    },
                    {
                        "name": "Das Adhikari S."
                    },
                    {
                        "name": "Wang J."
                    }
                ],
                "date": "2024-05-01T00:00:00Z",
                "journal": "Briefings in Bioinformatics",
                "title": "BayesKAT: bayesian optimal kernel-based test for genetic association studies reveals joint genetic effects in complex diseases"
            },
            "pmcid": "PMC11036342",
            "pmid": "38653490"
        }
    ],
    "toolType": [
        "Workflow"
    ],
    "topic": [
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "GWAS study",
            "uri": "http://edamontology.org/topic_3517"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ]
}
