{
    "additionDate": "2019-11-14T18:26:11Z",
    "biotoolsCURIE": "biotools:DockThor",
    "biotoolsID": "DockThor",
    "confidence_flag": "tool",
    "description": "Web Services for Molecular Docking Simulations | A Free Web Server for Protein-ligand Docking | Add missing hydrogen atoms, complete side chains, change protonation states. Simple and easy!",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein-protein docking",
                    "uri": "http://edamontology.org/operation_3899"
                },
                {
                    "term": "Protein geometry calculation",
                    "uri": "http://edamontology.org/operation_0249"
                },
                {
                    "term": "Protein-ligand docking",
                    "uri": "http://edamontology.org/operation_0482"
                }
            ]
        }
    ],
    "homepage": "https://dockthor.lncc.br/v2/",
    "lastUpdate": "2020-12-22T10:10:16Z",
    "name": "DockThor",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1016/j.ins.2014.08.002",
            "metadata": {
                "abstract": "© 2014 Elsevier Inc. All rights reserved.Currently, docking methods are very important tools in structure-based drug design (SBDD). However, despite the great advances in the docking area over the last decades, most methods cannot be used to dock highly flexible ligands successfully. It is even harder when the ligand is cross-docked into different ligand-bound receptor structures. In this work, a new multi-solution genetic algorithm method, named Dynamic Modified Restricted Tournament Selection (DMRTS), was developed for the effective docking of highly flexible ligands. The DMRTS method uses an insertion criterion based on similarity and a dynamic tournament size to preserve good, distinct solutions in the genetic algorithm population. The proposed method was implemented in three different versions of a steady-state genetic algorithm and evaluated for the redocking and cross-docking of five HIV-1 protease ligands, with 12-20 rotatable bonds. The DMRTS method was also tested on a more diverse set of 34 protein-ligand complexes covering 18 different protein families. A performance comparison with three of the currently most used docking programs was also done. The proposed method was evaluated for 25 benchmark functions of the CEC2005 test suite. The results indicated that the DMRTS method can adequately sample the conformational search space, producing a diverse set of high quality solutions. Moreover, it might be a powerful tool for docking studies in SBDD practice, increasing the success rate in finding correct ligand conformations and efficiently exploring distinct and valuable ligand binding modes.",
                "authors": [
                    {
                        "name": "De Magalhaes C.S."
                    },
                    {
                        "name": "Almeida D.M."
                    },
                    {
                        "name": "Barbosa H.J.C."
                    },
                    {
                        "name": "Dardenne L.E."
                    }
                ],
                "citationCount": 72,
                "date": "2014-01-01T00:00:00Z",
                "journal": "Information Sciences",
                "title": "A dynamic niching genetic algorithm strategy for docking highly flexible ligands"
            }
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Molecular modelling",
            "uri": "http://edamontology.org/topic_2275"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ],
    "validated": 1
}