{
    "additionDate": "2021-01-18T09:21:48Z",
    "biotoolsCURIE": "biotools:dti-mlcd",
    "biotoolsID": "dti-mlcd",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "dqwei@sjtu.edu.cn",
            "name": "Dong-Qing Wei",
            "typeEntity": "Person"
        }
    ],
    "description": "DTI-MLCD is a tool for predicting drug-target interactions using multi-label learning with community detection method. It can  be used for identifying drug-target interactions (DTIs) is an important step for drug discovery and drug repositioning.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Feature extraction",
                    "uri": "http://edamontology.org/operation_3937"
                },
                {
                    "term": "Protein fragment weight comparison",
                    "uri": "http://edamontology.org/operation_2929"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/a96123155/DTI-MLCD",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-03-03T20:34:58Z",
    "name": "DTI-MLCD",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1101/2020.05.11.087734"
        },
        {
            "doi": "10.1093/bib/bbaa205",
            "metadata": {
                "abstract": "© The Author(s) 2020. Published by Oxford University Press. All rights reserved. For Permissions, please email: journals.permissions@oup.com.Identifying drug-target interactions (DTIs) is an important step for drug discovery and drug repositioning. To reduce the experimental cost, a large number of computational approaches have been proposed for this task. The machine learning-based models, especially binary classification models, have been developed to predict whether a drug-target pair interacts or not. However, there is still much room for improvement in the performance of current methods. Multi-label learning can overcome some difficulties caused by single-label learning in order to improve the predictive performance. The key challenge faced by multi-label learning is the exponential-sized output space, and considering label correlations can help to overcome this challenge. In this paper, we facilitate multi-label classification by introducing community detection methods for DTI prediction, named DTI-MLCD. Moreover, we updated the gold standard data set by adding 15,000 more positive DTI samples in comparison to the data set, which has widely been used by most of previously published DTI prediction methods since 2008. The proposed DTI-MLCD is applied to both data sets, demonstrating its superiority over other machine learning methods and several existing methods. The data sets and source code of this study are freely available at https://github.com/a96123155/DTI-MLCD.",
                "authors": [
                    {
                        "name": "Chen T."
                    },
                    {
                        "name": "Chu Y."
                    },
                    {
                        "name": "Jiang M."
                    },
                    {
                        "name": "Salahub D.R."
                    },
                    {
                        "name": "Shan X."
                    },
                    {
                        "name": "Wang Q."
                    },
                    {
                        "name": "Wang Y."
                    },
                    {
                        "name": "Wei D.-Q."
                    },
                    {
                        "name": "Xiong Y."
                    }
                ],
                "citationCount": 4,
                "date": "2021-05-20T00:00:00Z",
                "journal": "Briefings in bioinformatics",
                "title": "DTI-MLCD: predicting drug-target interactions using multi-label learning with community detection method"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Drug discovery",
            "uri": "http://edamontology.org/topic_3336"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
