{
    "additionDate": "2019-11-14T18:08:46Z",
    "biotoolsCURIE": "biotools:RMKL",
    "biotoolsID": "RMKL",
    "confidence_flag": "high",
    "credit": [
        {
            "email": "xuefeng.wang@moffitt.org",
            "name": "Xuefeng Wang",
            "orcidid": "https://orcid.org/0000-0001-5775-408X",
            "typeEntity": "Person"
        }
    ],
    "description": "Multiple-kernel learning for genomic data mining and prediction | Multiple Kernel Learning for Classification or Regression Problems | Provides R and C++ function that enable the user to conduct multiple kernel learning (MKL) and cross validation for support vector machine (SVM) models. Cross validation can be used to identify kernel shapes and hyperparameter combinations that can be used as candidate kernels for MKL. There are three implementations provided in this package, namely SimpleMKL Alain Rakotomamonjy et. al (2008), Simple and Efficient MKL Xu et. al (2010), and Dual augmented Lagrangian MKL Suzuki and Tomioka (2011) <doi:10.1007/s10994-011-5252-9>. These methods identify the convex combination of candidate kernels to construct an optimal hyperplane",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "miRNA target prediction",
                    "uri": "http://edamontology.org/operation_0463"
                },
                {
                    "term": "Text mining",
                    "uri": "http://edamontology.org/operation_0306"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "https://CRAN.R-project.org/package=RMKL",
    "language": [
        "R"
    ],
    "lastUpdate": "2019-11-14T18:08:46Z",
    "license": "GPL-3.0",
    "name": "RMKL",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12859-019-2992-1",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Advances in medical technology have allowed for customized prognosis, diagnosis, and treatment regimens that utilize multiple heterogeneous data sources. Multiple kernel learning (MKL) is well suited for the integration of multiple high throughput data sources. MKL remains to be under-utilized by genomic researchers partly due to the lack of unified guidelines for its use, and benchmark genomic datasets. Results: We provide three implementations of MKL in R. These methods are applied to simulated data to illustrate that MKL can select appropriate models. We also apply MKL to combine clinical information with miRNA gene expression data of ovarian cancer study into a single analysis. Lastly, we show that MKL can identify gene sets that are known to play a role in the prognostic prediction of 15 cancer types using gene expression data from The Cancer Genome Atlas, as well as, identify new gene sets for the future research. Conclusion: Multiple kernel learning coupled with modern optimization techniques provides a promising learning tool for building predictive models based on multi-source genomic data. MKL also provides an automated scheme for kernel prioritization and parameter tuning. The methods used in the paper are implemented as an R package called RMKL package, which is freely available for download through CRAN at https://CRAN.R-project.org/package=RMKL.",
                "authors": [
                    {
                        "name": "Wilson C.M."
                    },
                    {
                        "name": "Li K."
                    },
                    {
                        "name": "Yu X."
                    },
                    {
                        "name": "Kuan P.-F."
                    },
                    {
                        "name": "Wang X."
                    }
                ],
                "citationCount": 6,
                "date": "2019-08-15T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Multiple-kernel learning for genomic data mining and prediction"
            },
            "pmcid": "PMC6694479",
            "pmid": "31416413"
        }
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        }
    ]
}