{
    "additionDate": "2021-01-18T10:03:37Z",
    "biotoolsCURIE": "biotools:vetscan-imagyst",
    "biotoolsID": "vetscan-imagyst",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "ruth.hallsedlak@zoetis.com",
            "name": "Ruth Hall Sedlak",
            "typeEntity": "Person"
        }
    ],
    "description": "an in-clinic canine and feline fecal parasite detection system integrated with a deep learning algorithm.\n\nFecal examination is an important component of routine companion animal wellness exams. Sensitivity and specificity of fecal examinations, however, are influenced by sample preparation methodologies and the level of training and experience of personnel who read fecal slides. The VETSCAN IMAGYST system consists of three components: a sample preparation device, a commercially available scanner, and an analysis software. The VETSCAN IMAGYST automated scanner and cloud-based, deep learning algorithm, locates, classifies, and identifies parasite eggs found on fecal microscopic slides",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                }
            ]
        }
    ],
    "homepage": "https://www.vetscanimagyst.com/",
    "lastUpdate": "2021-03-12T16:21:49Z",
    "name": "VETSCAN IMAGYST",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1186/S13071-020-04215-X",
            "metadata": {
                "abstract": "© 2020 The Author(s).Background: Fecal examination is an important component of routine companion animal wellness exams. Sensitivity and specificity of fecal examinations, however, are influenced by sample preparation methodologies and the level of training and experience of personnel who read fecal slides. The VETSCAN IMAGYST system consists of three components: a sample preparation device, a commercially available scanner, and an analysis software. The VETSCAN IMAGYST automated scanner and cloud-based, deep learning algorithm, locates, classifies, and identifies parasite eggs found on fecal microscopic slides. The main study objectives were (i) to qualitatively evaluate the capabilities of the VETSCAN IMAGYST screening system and (ii) to assess and compare the performance of the VETSCAN IMAGYST fecal preparation methods to conventional fecal flotation techniques. Methods: To assess the capabilities of VETSCAN IMAGYST screening components, fecal slides were prepared by the VETSCAN IMAGYST centrifugal and passive flotation techniques with 100 pre-screened fecal samples collected from dogs and cats and examined by both the algorithm and parasitologists. To determine the diagnostic sensitivity and specificity of the VETSCAN IMAGYST sample preparation techniques, fecal flotation slides were prepared by four different techniques (VETSCAN IMAGYST centrifugal and passive flotations, conventional centrifugal flotation, and passive flotation using OVASSAY® Plus) and examined by parasitologists. Additionally, required sample preparation and scanning times were estimated on a subset of samples to evaluate VETSCAN IMAGYST ease-of-use. Results: The algorithm performance of the VETSCAN IMAGYST closely matched that of the parasitologists, with Pearson s correlation coefficient (r) ranging from 0.83-0.99 across four taxa of parasites, Ancylostoma, Toxocara, Trichuris and Taeniidae. Both VETSCAN IMAGYST centrifugal and passive flotation methods correlated well with conventional preparation methods on all targeted parasites (diagnostic sensitivity of 75.8-100%, specificity of 91.8-100%, qualitative agreement between methods of 93.8-94.5%). Sample preparation, slide scan and image analysis were completed within 10-14 min by VETSCAN IMAGYST centrifugal and passive flotations, respectively. Conclusions: The VETSCAN IMAGYST scanning system with the VETSCAN IMAGYST sample preparation methods demonstrated a qualitative match in comparison to the results of parasitologists' examinations with conventional fecal flotation techniques. The VETSCAN IMAGYST is an easy-to-use, next generation qualitative and possibly quantitative diagnostic platform that brings expert clinical results into the hands of veterinary clinics.[Figure not available: see fulltext.]",
                "authors": [
                    {
                        "name": "Cree T."
                    },
                    {
                        "name": "Derosa A."
                    },
                    {
                        "name": "Goldstein R."
                    },
                    {
                        "name": "Hall Sedlak R."
                    },
                    {
                        "name": "Larson B.S."
                    },
                    {
                        "name": "Loenser M."
                    },
                    {
                        "name": "Nagamori Y."
                    },
                    {
                        "name": "Pullins A."
                    },
                    {
                        "name": "Smith R.B."
                    }
                ],
                "citationCount": 6,
                "date": "2020-07-11T00:00:00Z",
                "journal": "Parasites and Vectors",
                "title": "Evaluation of the VETSCAN IMAGYST: An in-clinic canine and feline fecal parasite detection system integrated with a deep learning algorithm"
            },
            "pmcid": "PMC7353785",
            "pmid": "32653042"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Parasitology",
            "uri": "http://edamontology.org/topic_3302"
        }
    ]
}
