{
    "additionDate": "2019-11-14T19:39:51Z",
    "biotoolsCURIE": "biotools:RetSynth",
    "biotoolsID": "RetSynth",
    "confidence_flag": "high",
    "credit": [
        {
            "email": "cmhudso@sandia.gov",
            "name": "Corey M. Hudson",
            "orcidid": "https://orcid.org/0000-0003-4796-538X",
            "typeEntity": "Person"
        }
    ],
    "description": "determining all optimal and sub-optimal synthetic pathways that facilitate synthesis of target compounds in chassis organisms | The overaching goal of RetSynth is to streamline the arduous and complex step of selecting enzyme/reactions pairs to produce a target compound for bioengineering microbial organisms",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Pathway or network prediction",
                    "uri": "http://edamontology.org/operation_3439"
                },
                {
                    "term": "Metabolic network modelling",
                    "uri": "http://edamontology.org/operation_3660"
                },
                {
                    "term": "Pathway or network visualisation",
                    "uri": "http://edamontology.org/operation_3083"
                }
            ]
        }
    ],
    "homepage": "https://github.com/sandialabs/RetSynth",
    "language": [
        "Python"
    ],
    "lastUpdate": "2019-11-14T19:39:51Z",
    "license": "BSD-2-Clause",
    "name": "RetSynth",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12859-019-3025-9",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: The efficient biological production of industrially and economically important compounds is a challenging problem. Brute-force determination of the optimal pathways to efficient production of a target chemical in a chassis organism is computationally intractable. Many current methods provide a single solution to this problem, but fail to provide all optimal pathways, optional sub-optimal solutions or hybrid biological/non-biological solutions. Results: Here we present RetSynth, software with a novel algorithm for determining all optimal biological pathways given a starting biological chassis and target chemical. By dynamically selecting constraints, the number of potential pathways scales by the number of fully independent pathways and not by the number of overall reactions or size of the metabolic network. This feature allows all optimal pathways to be determined for a large number of chemicals and for a large corpus of potential chassis organisms. Additionally, this software contains other features including the ability to collect data from metabolic repositories, perform flux balance analysis, and to view optimal pathways identified by our algorithm using a built-in visualization module. This software also identifies sub-optimal pathways and allows incorporation of non-biological chemical reactions, which may be performed after metabolic production of precursor molecules. Conclusions: The novel algorithm designed for RetSynth streamlines an arduous and complex process in metabolic engineering. Our stand-alone software allows the identification of candidate optimal and additional sub-optimal pathways, and provides the user with necessary ranking criteria such as target yield to decide which route to select for target production. Furthermore, the ability to incorporate non-biological reactions into the final steps allows determination of pathways to production for targets that cannot be solely produced biologically. With this comprehensive suite of features RetSynth exceeds any open-source software or webservice currently available for identifying optimal pathways for target production.",
                "authors": [
                    {
                        "name": "Whitmore L.S."
                    },
                    {
                        "name": "Nguyen B."
                    },
                    {
                        "name": "Pinar A."
                    },
                    {
                        "name": "George A."
                    },
                    {
                        "name": "Hudson C.M."
                    }
                ],
                "date": "2019-09-09T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "RetSynth: Determining all optimal and sub-optimal synthetic pathways that facilitate synthesis of target compounds in chassis organisms"
            },
            "pmcid": "PMC6734243",
            "pmid": "31500573"
        }
    ],
    "topic": [
        {
            "term": "Endocrinology and metabolism",
            "uri": "http://edamontology.org/topic_3407"
        },
        {
            "term": "Bioengineering",
            "uri": "http://edamontology.org/topic_3398"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ]
}