{
    "accessibility": "Open access",
    "additionDate": "2019-08-09T13:04:41Z",
    "biotoolsCURIE": "biotools:ReSimNet",
    "biotoolsID": "ReSimNet",
    "cost": "Free of charge",
    "description": "Drug response similarity prediction using Siamese neural networks.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/dmis-lab/ReSimNet/blob/master/README.md"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                }
            ]
        }
    ],
    "homepage": "https://github.com/dmis-lab/ReSimNet",
    "language": [
        "Shell",
        "Python"
    ],
    "lastUpdate": "2020-06-16T10:55:26Z",
    "license": "Apache-2.0",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/dmis-lab/ReSimNet/issues"
        }
    ],
    "maturity": "Mature",
    "name": "ReSimNet",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "hans",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ411",
            "metadata": {
                "abstract": "© 2019 The Author(s) 2019. Published by Oxford University Press. All rights reserved.Motivation: Traditional drug discovery approaches identify a target for a disease and find a compound that binds to the target. In this approach, structures of compounds are considered as the most important features because it is assumed that similar structures will bind to the same target. Therefore, structural analogs of the drugs that bind to the target are selected as drug candidates. However, even though compounds are not structural analogs, they may achieve the desired response. A new drug discovery method based on drug response, which can complement the structure-based methods, is needed. Results: We implemented Siamese neural networks called ReSimNet that take as input two chemical compounds and predicts the CMap score of the two compounds, which we use to measure the transcriptional response similarity of the two compounds. ReSimNet learns the embedding vector of a chemical compound in a transcriptional response space. ReSimNet is trained to minimize the difference between the cosine similarity of the embedding vectors of the two compounds and the CMap score of the two compounds. ReSimNet can find pairs of compounds that are similar in response even though they may have dissimilar structures. In our quantitative evaluation, ReSimNet outperformed the baseline machine learning models. The ReSimNet ensemble model achieves a Pearson correlation of 0.518 and a precision@1% of 0.989. In addition, in the qualitative analysis, we tested ReSimNet on the ZINC15 database and showed that ReSimNet successfully identifies chemical compounds that are relevant to a prototype drug whose mechanism of action is known.",
                "authors": [
                    {
                        "name": "Jeon M."
                    },
                    {
                        "name": "Park D."
                    },
                    {
                        "name": "Lee J."
                    },
                    {
                        "name": "Jeon H."
                    },
                    {
                        "name": "Ko M."
                    },
                    {
                        "name": "Kim S."
                    },
                    {
                        "name": "Choi Y."
                    },
                    {
                        "name": "Tan A.-C."
                    },
                    {
                        "name": "Kang J."
                    }
                ],
                "citationCount": 10,
                "date": "2019-12-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "ReSimNet: Drug response similarity prediction using Siamese neural networks"
            },
            "pmid": "31116384",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Drug discovery",
            "uri": "http://edamontology.org/topic_3336"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ],
    "validated": 1
}