{
    "additionDate": "2017-05-16T12:28:23Z",
    "biotoolsCURIE": "biotools:clip",
    "biotoolsID": "clip",
    "credit": [
        {
            "email": "mohamed.uduman@yale.edu",
            "name": "Mohamed Uduman",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "CLIP web server detects selection in immunoglobulin sequences. Web server features include V(D)J germline segment identification with IMGT-alignment, batch submission of sequences and integration of test statistics.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Polymorphism detection",
                    "uri": "http://edamontology.org/operation_3202"
                },
                {
                    "term": "Sequence feature detection",
                    "uri": "http://edamontology.org/operation_0253"
                },
                {
                    "term": "Protein feature detection",
                    "uri": "http://edamontology.org/operation_3092"
                },
                {
                    "term": "Statistical calculation",
                    "uri": "http://edamontology.org/operation_2238"
                }
            ]
        }
    ],
    "homepage": "http://clip.med.yale.edu/selection",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-10T12:58:56Z",
    "name": "CLIP",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "doi": "10.1093/nar/gks457",
            "metadata": {
                "abstract": "High-throughput immunoglobulin sequencing promises new insights into the somatic hypermutation and antigen-driven selection processes that underlie B-cell affinity maturation and adaptive immunity. The ability to estimate positive and negative selection from these sequence data has broad applications not only for understanding the immune response to pathogens, but is also critical to determining the role of somatic hypermutation in autoimmunity and B-cell cancers. Here, we develop a statistical framework for Bayesian estimation of Antigen-driven SELectIoN (BASELINe) based on the analysis of somatic mutation patterns. Our approach represents a fundamental advance over previous methods by shifting the problem from one of simply detecting selection to one of quantifying selection. Along with providing a more intuitive means to assess and visualize selection, our approach allows, for the first time, comparative analysis between groups of sequences derived from different germline V(D)J segments. Application of this approach to next-generation sequencing data demonstrates different selection pressures for memory cells of different isotypes. This framework can easily be adapted to analyze other types of DNA mutation patterns resulting from a mutator that displays hotcold-spots, substitution preference or other intrinsic biases. © 2012 The Author(s).",
                "authors": [
                    {
                        "name": "Yaari G."
                    },
                    {
                        "name": "Uduman M."
                    },
                    {
                        "name": "Kleinstein S.H."
                    }
                ],
                "citationCount": 117,
                "date": "2012-09-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "Quantifying selection in high-throughput Immunoglobulin sequencing data sets"
            },
            "pmcid": "PMC3458526",
            "pmid": "22641856"
        },
        {
            "doi": "10.1093/nar/gkr413",
            "metadata": {
                "abstract": "The ability to detect selection by analyzing mutation patterns in experimentally derived immunoglobulin (Ig) sequences is a critical part of many studies. Such techniques are useful not only for understanding the response to pathogens, but also to determine the role of antigen-driven selection in autoimmunity, B cell cancers and the diversification of pre-immune repertoires in certain species. Despite its importance, quantifying selection in experimentally derived sequences is fraught with difficulties. The necessary parameters for statistical tests (such as the expected frequency of replacement mutations in the absence of selection) are non-trivial to calculate, and results are not easily interpretable when analyzing more than a handful of sequences. We have developed a web server that implements our previously proposed Focused binomial test for detecting selection. Several features are integrated into the web site in order to facilitate analysis, including V(D)J germline segment identification with IMGT alignment, batch submission of sequences and integration of additional test statistics proposed by other groups. We also implement a Z-score-based statistic that increases the power of detecting selection while maintaining specificity, and further allows for the combined analysis of sequences from different germlines. The tool is freely available at http://clip.med.yale.edu/selection. © 2011 The Author(s).",
                "authors": [
                    {
                        "name": "Uduman M."
                    },
                    {
                        "name": "Yaari G."
                    },
                    {
                        "name": "Hershberg U."
                    },
                    {
                        "name": "Stern J.A."
                    },
                    {
                        "name": "Shlomchik M.J."
                    },
                    {
                        "name": "Kleinstein S.H."
                    }
                ],
                "citationCount": 65,
                "date": "2011-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "Detecting selection in immunoglobulin sequences"
            },
            "pmcid": "PMC3125793",
            "pmid": "21665923"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "RNA immunoprecipitation",
            "uri": "http://edamontology.org/topic_3794"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Experimental design and studies",
            "uri": "http://edamontology.org/topic_3678"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        }
    ],
    "validated": 1
}