{
    "additionDate": "2017-05-02T10:01:22Z",
    "biotoolsCURIE": "biotools:rslpred",
    "biotoolsID": "rslpred",
    "credit": [
        {
            "email": "raghava@imtech.ernet.in",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.imtech.res.in/raghava/rslpred/team_middle.html"
        }
    ],
    "description": "An effort for genome-scale subcellular prediction of encoded rice proteins.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://crdd.osdd.net/raghava//rslpred/"
        },
        {
            "type": [
                "General"
            ],
            "url": "http://crdd.osdd.net/raghava//rslpred/help_middle.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein sequence analysis",
                    "uri": "http://edamontology.org/operation_2479"
                }
            ]
        }
    ],
    "homepage": "http://www.imtech.res.in/raghava/rslpred/",
    "lastUpdate": "2018-12-10T12:58:44Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/rslpred-predicting-subcellular-localization-of-rice-proteins.html"
        }
    ],
    "name": "RSLpred",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "The attainment of complete map-based sequence for rice (Oryza sativa) is clearly a major milestone for the research community. Identifying the localization of encoded proteins is the key to understanding their functional characteristics and facilitating their purification. Our proposed method, RSLpred, is an effort in this direction for genome-scale subcellular prediction of encoded rice proteins. First, the support vector machine (SVM)-based modules have been developed using traditional amino acid-, dipeptide- and four parts-amino acid composition and achieved an overall accuracy of 81.43, 80.88 and 81.10%, respectively. Secondly, a similarity search-based module has been developed using position-specific iterated-basic local alignment search tool and achieved 68.35% accuracy. Another module developed using evolutionary information of a protein sequence extracted from position-specific scoring matrix achieved an accuracy of 87.10%. In this study, a large number of modules have been developed using vaRíous encoding schemes like higher-order dipeptide composition, N- and C-terminal, splitted amino acid composition and the hybrid information. In order to benchmark RSLpred, it was tested on an independent set ofrice proteins where it outperformed widely used prediction methods such as TargetP, Wolf-PSORT, PA-SUB, Plant-Ploc and ESLpred. To assist the plant research community, an online web tool 'RSLpred' has been developed for subcellular prediction of query rice proteins, which is freely accessible at http://www.imtech.res.in/raghava/rslpred.© 2009 WILEY-VCH Verlag GmbH & Co. KGaA, Weinheim.",
                "authors": [
                    {
                        "name": "Kaundal R."
                    },
                    {
                        "name": "Raghava G.P.S."
                    }
                ],
                "citationCount": 29,
                "date": "2009-05-01T00:00:00Z",
                "journal": "Proteomics",
                "title": "RSLpred: An integrative system for predicting subcellular localization of rice proteins combining compositional and evolutionary information"
            },
            "pmid": "19402042"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        }
    ],
    "validated": 1
}