{
    "additionDate": "2021-03-19T09:05:58Z",
    "biotoolsCURIE": "biotools:nglyalign",
    "biotoolsID": "nglyalign",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "elma.akand@unsw.edu.au",
            "name": "Elma H. Akand",
            "orcidid": "https://orcid.org/0000-0002-1710-3693",
            "typeEntity": "Person"
        }
    ],
    "description": "An automated library building tool to align highly divergent HIV envelope sequences.\n\nVerify that version 9.8 (R2020a) of the MATLAB Runtime is installed.\n\nNGlyAlignApp_v1.exe -MCRInstaller.exe Note: if end users are unable to download the MATLAB Runtime using the instructions in the previous section, include it when building your component by clicking the \"Runtime included in package\" link in the Deployment Tool. -This readme file.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Global structure alignment",
                    "uri": "http://edamontology.org/operation_0510"
                },
                {
                    "term": "Phylogenetic inference",
                    "uri": "http://edamontology.org/operation_0323"
                },
                {
                    "term": "Sequence alignment",
                    "uri": "http://edamontology.org/operation_0292"
                },
                {
                    "term": "Sequence alignment editing",
                    "uri": "http://edamontology.org/operation_3081"
                },
                {
                    "term": "Sequence motif discovery",
                    "uri": "http://edamontology.org/operation_0238"
                }
            ]
        }
    ],
    "homepage": "https://github.com/UNSW-Mathematical-Biology/NGlyAlign_v1.0",
    "lastUpdate": "2021-04-11T11:49:29Z",
    "license": "GPL-3.0",
    "name": "NGlyAlign",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1186/S12859-020-03901-Y",
            "metadata": {
                "abstract": "© 2020, The Author(s).Background: The high variability in envelope regions of some viruses such as HIV allow the virus to establish infection and to escape subsequent immune surveillance. This variability, as well as increasing incorporation of N-linked glycosylation sites, is fundamental to this evasion. It also creates difficulties for multiple sequence alignment methods (MSA) that provide the first step in their analysis. Existing MSA tools often fail to properly align highly variable HIV envelope sequences requiring extensive manual editing that is impractical with even a moderate number of these variable sequences. Results: We developed an automated library building tool NGlyAlign, that organizes similar N-linked glycosylation sites as block constraints and statistically conserved global sites as single site constraints to automatically enforce partial columns in consistency-based MSA methods such as Dialign. This combined method accurately aligns variable HIV-1 envelope sequences. We tested the method on two datasets: a set of 156 founder and chronic gp160 HIV-1 subtype B sequences as well as a set of reference sequences of gp120 in the highly variable region 1. On measures such as entropy scores, sum of pair scores, column score, and similarity heat maps, NGlyAlign+Dialign proved superior against methods such as T-Coffee, ClustalOmega, ClustalW, Praline, HIValign and Muscle. The method is scalable to large sequence sets producing accurate alignments without requiring manual editing. As well as this application to HIV, our method can be used for other highly variable glycoproteins such as hepatitis C virus envelope. Conclusions: NGlyAlign is an automated tool for mapping and building glycosylation motif libraries to accurately align highly variable regions in HIV sequences. It can provide the basis for many studies reliant on single robust alignments. NGlyAlign has been developed as an open-source tool and is freely available at https://github.com/UNSW-Mathematical-Biology/NGlyAlign_v1.0.",
                "authors": [
                    {
                        "name": "Akand E.H."
                    },
                    {
                        "name": "Murray J.M."
                    }
                ],
                "date": "2021-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "NGlyAlign: an automated library building tool to align highly divergent HIV envelope sequences"
            },
            "pmcid": "PMC7869453",
            "pmid": "33557755"
        }
    ],
    "toolType": [
        "Desktop application",
        "Library"
    ],
    "topic": [
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "Sequence sites, features and motifs",
            "uri": "http://edamontology.org/topic_0160"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ]
}
