{
    "additionDate": "2021-01-18T11:47:25Z",
    "biotoolsCURIE": "biotools:m5upred",
    "biotoolsID": "m5upred",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "bowen.song@liverpool.ac.uk",
            "name": "Bowen Song",
            "typeEntity": "Person"
        }
    ],
    "description": "A Web Server for the Prediction of RNA 5-Methyluridine Sites from Sequences.\n\nAs one of the widely occurring RNA modifications, 5-methyluridine (m5U) has recently been shown to play critical roles in various biological functions and disease pathogenesis, such as, under stress response and during breast cancer development.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "PTM site prediction",
                    "uri": "http://edamontology.org/operation_0417"
                },
                {
                    "term": "trans-regulatory element prediction",
                    "uri": "http://edamontology.org/operation_0443"
                }
            ]
        }
    ],
    "homepage": "https://www.xjtlu.edu.cn/biologicalsciences/m5u",
    "lastUpdate": "2021-02-19T08:20:18Z",
    "name": "m5UPred",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1016/J.OMTN.2020.09.031",
            "metadata": {
                "abstract": "© 2020 The AuthorsJie Jiang et al. present m5UPred, the first web server for identification of m5U sites from the primary sequences of RNA by advanced computational method in this study. It can help to accurately predict the m5U sites from RNA sequences, which will assist researchers to understand the RNA methylation mechanism and its biological functions. © 2020 The AuthorsAs one of the widely occurring RNA modifications, 5-methyluridine (m5U) has recently been shown to play critical roles in various biological functions and disease pathogenesis, such as under stress response and during breast cancer development. Precise identification of m5U sites on RNA is vital for the understanding of the regulatory mechanisms of RNA life. We present here m5UPred, the first web server for in silico identification of m5U sites from the primary sequences of RNA. Built upon the support vector machine (SVM) algorithm and the biochemical encoding scheme, m5UPred achieved reasonable prediction performance with the area under the receiver operating characteristic curve (AUC) greater than 0.954 by 5-fold cross-validation and independent testing datasets. To critically test and validate the performance of our newly proposed predictor, the experimentally validated m5U sites were further separated by high-throughput sequencing techniques (miCLIP-Seq and FICC-Seq) and cell types (HEK293 and HAP1). When tested on cross-technique and cross-cell-type validation using independent datasets, m5UPred achieved an average AUC of 0.922 and 0.926 under mature mRNA mode, respectively, showing reasonable accuracy and reliability. The m5UPred web server is freely accessible now and it should make a useful tool for the researchers who are interested in m5U RNA modification.",
                "authors": [
                    {
                        "name": "Jiang J."
                    },
                    {
                        "name": "Song B."
                    },
                    {
                        "name": "Tang Y."
                    },
                    {
                        "name": "Chen K."
                    },
                    {
                        "name": "Wei Z."
                    },
                    {
                        "name": "Meng J."
                    }
                ],
                "citationCount": 7,
                "date": "2020-12-04T00:00:00Z",
                "journal": "Molecular Therapy - Nucleic Acids",
                "title": "m5UPred: A Web Server for the Prediction of RNA 5-Methyluridine Sites from Sequences"
            },
            "pmcid": "PMC7595847",
            "pmid": "33230471"
        }
    ],
    "toolType": [
        "Web service"
    ],
    "topic": [
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "RNA splicing",
            "uri": "http://edamontology.org/topic_3320"
        },
        {
            "term": "RNA immunoprecipitation",
            "uri": "http://edamontology.org/topic_3794"
        },
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        }
    ]
}