{
    "accessibility": [],
    "additionDate": "2018-06-29T08:58:35Z",
    "biotoolsCURIE": "biotools:terminus",
    "biotoolsID": "terminus",
    "collectionID": [],
    "confidence_flag": null,
    "cost": null,
    "credit": [
        {
            "email": null,
            "gridid": null,
            "name": "SIB Swiss Institute of Bioinformatics",
            "note": null,
            "orcidid": null,
            "typeEntity": null,
            "typeRole": [],
            "url": null
        },
        {
            "email": "jean-luc.falcone@unige.ch",
            "gridid": null,
            "name": null,
            "note": null,
            "orcidid": null,
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": null
        }
    ],
    "description": "N-Terminal Acetylation and initial methionine predictor based on patterns discovery and decision trees. The proposed algorithm builds a decision tree, by coupling the C4.5 algorithm with genetic algorithms, producing high-performance white box classifiers. Our method was tested on the initiator methionine cleavage (IMC) and Nα-terminal acetylation (N-Ac), two of the most common PTMs.",
    "documentation": [],
    "download": [],
    "editPermission": {
        "authors": [],
        "type": "private"
    },
    "elixirNode": [],
    "elixirPlatform": [],
    "elixir_badge": 0,
    "function": [
        {
            "cmd": null,
            "input": [],
            "note": null,
            "operation": [
                {
                    "term": "Post-translation modification site prediction",
                    "uri": "http://edamontology.org/operation_0417"
                }
            ],
            "output": []
        }
    ],
    "homepage": "http://terminus.unige.ch/",
    "homepage_status": 0,
    "language": [],
    "lastUpdate": "2018-12-10T12:58:59Z",
    "license": null,
    "link": [],
    "maturity": null,
    "name": "Terminus",
    "operatingSystem": [],
    "otherID": [],
    "owner": "SIB",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btu165",
            "metadata": {
                "abstract": "Motivation: Post-translational modifications (PTMs) are important steps in the maturation of proteins. Several models exist to predict specific PTMs, from manually detected patterns to machine learning methods. On one hand, the manual detection of patterns does not provide the most efficient classifiers and requires an important workload, and on the other hand, models built by machine learning methods are hard to interpret and do not increase biological knowledge. Therefore, we developed a novel method based on patterns discovery and decision trees to predict PTMs. The proposed algorithm builds a decision tree, by coupling the C4.5 algorithm with genetic algorithms, producing high-performance white box classifiers. Our method was tested on the initiator methionine cleavage (IMC) and Nα-terminal acetylation (N-Ac), two of the most common PTMs. Results: The resulting classifiers perform well when compared with existing models. On a set of eukaryotic proteins, they display a cross-validated Matthews correlation coefficient of 0.83 (IMC) and 0.65 (N-Ac). When used to predict potential substrates of N-terminal acetyltransferaseB and N-terminal acetyltransferaseC, our classifiers display better performance than the state of the art. Moreover, we present an analysis of the model predicting IMC for Homo sapiens proteins and demonstrate that we are able to extract experimentally known facts without prior knowledge. Those results validate the fact that our method produces white box models. © 2014 The Author 2014.",
                "authors": [
                    {
                        "name": "Charpilloz C."
                    },
                    {
                        "name": "Veuthey A.-L."
                    },
                    {
                        "name": "Chopard B."
                    },
                    {
                        "name": "Falcone J.-L."
                    }
                ],
                "citationCount": 5,
                "date": "2014-07-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Motifs tree: A new method for predicting post-translational modifications"
            },
            "note": null,
            "pmcid": null,
            "pmid": null,
            "type": null,
            "version": null
        }
    ],
    "relation": [],
    "toolType": [
        "Web API",
        "Web application"
    ],
    "topic": [
        {
            "term": "Protein sites, features and motifs",
            "uri": "http://edamontology.org/topic_3510"
        }
    ],
    "validated": 1,
    "version": []
}