{
    "additionDate": "2020-01-14T19:34:14Z",
    "biotoolsCURIE": "biotools:CNVScope",
    "biotoolsID": "CNVScope",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "pmeltzer@nih.gov",
            "name": "Paul S Meltzer",
            "typeEntity": "Person"
        }
    ],
    "description": "Visually Exploring Copy Number Aberrations in Cancer Genomes.\n\nCNVScope interchromosomal heatmaps.\n\nA Versatile Toolkit for Copy Number Variation Relationship Data Analysis and Visualization.\n\nProvides the ability to create interaction maps, discover CNV map domains (edges), gene annotate interactions, and create interactive visualizations of these CNV interaction maps.\n\nCNVScope is a visualization toolkit for seeing copy number data in a relationship fashion, both utilizing tools that find regions of interest (much like domains in Hi-C terminology), visualize the relationships in vibrant color (blue for negative association, red for positive), and integrates several different relevant types of data (RNASeq, sample information, Cancer Gene Census data, and structural variants)",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                },
                {
                    "term": "Mapping",
                    "uri": "http://edamontology.org/operation_2429"
                }
            ]
        }
    ],
    "homepage": "http://cnvscope.nci.nih.gov/",
    "language": [
        "R"
    ],
    "lastUpdate": "2020-12-16T16:06:50Z",
    "license": "BSD-3-Clause",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://cran.r-project.org/web/packages/CNVScope/index.html"
        },
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/jamesdalg/CNVScope/"
        }
    ],
    "name": "CNVScope",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1177/1176935119890290",
            "metadata": {
                "abstract": "© The Author(s) 2019.Motivation: DNA copy number (CN) data are a fast-growing source of information used in basic and translational cancer research. Most CN segmentation data are presented without regard to the relationship between chromosomal regions. We offer both a toolkit to help scientists without programming experience visually explore the CN interactome and a package that constructs CN interactomes from publicly available data sets. Results: The CNVScope visualization, based on a publicly available neuroblastoma CN data set, clearly displays a distinct CN interaction in the region of the MYCN, a canonical frequent amplicon target in this cancer. Exploration of the data rapidly identified cis and trans events, including a strong anticorrelation between 11q loss and17q gain with the region of 11q loss bounded by the cell cycle regulator CCND1. Availability: The shiny application is readily available for use at http://cnvscope.nci.nih.gov/, and the package can be downloaded from CRAN (https://cran.r-project.org/package=CNVScope), where help pages and vignettes are located. A newer version is available on the GitHub site (https://github.com/jamesdalg/CNVScope/), which features an animated tutorial. The CNVScope package can be locally installed using instructions on the GitHub site for Windows and Macintosh systems. This CN analysis package also runs on a linux high-performance computing cluster, with options for multinode and multiprocessor analysis of CN variant data. The shiny application can be started using a single command (which will automatically install the public data package).",
                "authors": [
                    {
                        "name": "Dalgleish J.L.T."
                    },
                    {
                        "name": "Wang Y."
                    },
                    {
                        "name": "Zhu J."
                    },
                    {
                        "name": "Meltzer P.S."
                    }
                ],
                "citationCount": 1,
                "date": "2019-01-01T00:00:00Z",
                "journal": "Cancer Informatics",
                "title": "CNVScope: Visually Exploring Copy Number Aberrations in Cancer Genomes"
            },
            "pmcid": "PMC6887803",
            "pmid": "31832011"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        }
    ],
    "validated": 1
}