{
    "additionDate": "2019-11-14T18:23:32Z",
    "biotoolsCURIE": "biotools:RF_Purify",
    "biotoolsID": "RF_Purify",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "p.johann@kitz-heidelberg.de",
            "name": "Pascal David Johann",
            "typeEntity": "Person"
        }
    ],
    "description": "a novel tool for comprehensive analysis of tumor-purity in methylation array data based on random forest regression | RF model and functions to estimate tumor purity using methylation data | Install minfi and RF_purify package from GitHub | R-package to predict ABSOLUTE and ESTIMATE tumor purity using a Random Forest regression model trained on TCGA Illumina 450k DNA-methylation array data. Purity prediction functions can be applied to 450k and 850k array data preprocessed with the Bioconductor package minfi",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "CpG island and isochore detection",
                    "uri": "http://edamontology.org/operation_0430"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                },
                {
                    "term": "Copy number estimation",
                    "uri": "http://edamontology.org/operation_3233"
                }
            ]
        }
    ],
    "homepage": "https://github.com/mwsill/RFpurify",
    "language": [
        "R"
    ],
    "lastUpdate": "2020-12-13T15:11:43Z",
    "name": "RF_Purify",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12859-019-3014-Z",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: With the advent of array-based techniques to measure methylation levels in primary tumor samples, systematic investigations of methylomes have widely been performed on a large number of tumor entities. Most of these approaches are not based on measuring individual cell methylation but rather the bulk tumor sample DNA, which contains a mixture of tumor cells, infiltrating immune cells and other stromal components. This raises questions about the purity of a certain tumor sample, given the varying degrees of stromal infiltration in different entities. Previous methods to infer tumor purity require or are based on the use of matching control samples which are rarely available. Here we present a novel, reference free method to quantify tumor purity, based on two Random Forest classifiers, which were trained on ABSOLUTE as well as ESTIMATE purity values from TCGA tumor samples. We subsequently apply this method to a previously published, large dataset of brain tumors, proving that these models perform well in datasets that have not been characterized with respect to tumor purity. Results: Using two gold standard methods to infer purity - the ABSOLUTE score based on whole genome sequencing data and the ESTIMATE score based on gene expression data- we have optimized Random Forest classifiers to predict tumor purity in entities that were contained in the TCGA project. We validated these classifiers using an independent test data set and cross-compared it to other methods which have been applied to the TCGA datasets (such as ESTIMATE and LUMP). Using Illumina methylation array data of brain tumor entities (as published in Capper et al. (Nature 555:469-474,2018)) we applied this model to estimate tumor purity and find that subgroups of brain tumors display substantial differences in tumor purity. Conclusions: Random forest- based tumor purity prediction is a well suited tool to extrapolate gold standard measures of purity to novel methylation array datasets. In contrast to other available methylation based tumor purity estimation methods, our classifiers do not need a priori knowledge about the tumor entity or matching control tissue to predict tumor purity.",
                "authors": [
                    {
                        "name": "Johann P.D."
                    },
                    {
                        "name": "Jager N."
                    },
                    {
                        "name": "Pfister S.M."
                    },
                    {
                        "name": "Sill M."
                    }
                ],
                "citationCount": 10,
                "date": "2019-08-16T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "RF-Purify: A novel tool for comprehensive analysis of tumor-purity in methylation array data based on random forest regression"
            },
            "pmcid": "PMC6697926",
            "pmid": "31419933"
        }
    ],
    "topic": [
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        },
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        }
    ],
    "validated": 1
}