{"credit":[{"email":"antonio@iim.csic.es","name":"Antonio A Alonso","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"https://github.com/selansi/Selansi/blob/master/DOCUMENTATION/SELANSI_manual.pdf"}],"function":[{"operation":[{"term":"Network simulation","uri":"http://edamontology.org/operation_3562"}]}],"labels":{"language":["MATLAB"],"operatingSystem":["Linux","Windows","Mac"],"toolType":["Library"],"topic":[{"term":"Molecular interactions, pathways and networks","uri":"http://edamontology.org/topic_0602"},{"term":"Gene regulation","uri":"http://edamontology.org/topic_0204"},{"term":"Simulation experiment","uri":"http://edamontology.org/topic_3524"}]},"publication":[{"abstract":"© The Author 2017. Published by Oxford University Press. Motivation Gene regulation is inherently stochastic. In many applications concerning Systems and Synthetic Biology such as the reverse engineering and the de novo design of genetic circuits, stochastic effects (yet potentially crucial) are often neglected due to the high computational cost of stochastic simulations. With advances in these fields there is an increasing need of tools providing accurate approximations of the stochastic dynamics of gene regulatory networks (GRNs) with reduced computational effort. Results This work presents SELANSI (SEmi-LAgrangian SImulation of GRNs), a software toolbox for the simulation of stochastic multidimensional gene regulatory networks. SELANSI exploits intrinsic structural properties of gene regulatory networks to accurately approximate the corresponding Chemical Master Equation with a partial integral differential equation that is solved by a semi-lagrangian method with high efficiency. Networks under consideration might involve multiple genes with self and cross regulations, in which genes can be regulated by different transcription factors. Moreover, the validity of the method is not restricted to a particular type of kinetics. The tool offers total flexibility regarding network topology, kinetics and parameterization, as well as simulation options.","authors":["Pajaro M.","Otero-Muras I.","Vazquez C.","Alonso A.A."],"cit_count":3,"doi":"10.1093/bioinformatics/btx645","journal":"Bioinformatics","title":"SELANSI: A toolbox for simulation of stochastic gene regulatory networks","year":"2018-03-01"}],"summary":{"biotoolsCURIE":"biotools:selansi","biotoolsID":"selansi","description":"Simulation of stochastic multidimensional Gene Regulatory Networks (GRNs).","homepage":"https://sites.google.com/view/selansi","name":"SELANSI"}}