
{
    "credit": [
        {
            "email": "cychen@mars.csie.ntu.edu.tw",
            "name": "Chien-Yu Chen",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Protein secondary structure prediction (coils)",
                    "uri": "http://edamontology.org/operation_0470"
                },
                {
                    "term": "Protein secondary structure prediction",
                    "uri": "http://edamontology.org/operation_0267"
                },
                {
                    "term": "Protein feature detection",
                    "uri": "http://edamontology.org/operation_3092"
                },
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Perl",
            "C"
        ],
        "operatingSystem": [
            "Linux"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Protein disordered structure",
                "uri": "http://edamontology.org/topic_3538"
            },
            {
                "term": "Proteins",
                "uri": "http://edamontology.org/topic_0078"
            },
            {
                "term": "Sequence composition, complexity and repeats",
                "uri": "http://edamontology.org/topic_0157"
            },
            {
                "term": "Protein sites, features and motifs",
                "uri": "http://edamontology.org/topic_3510"
            },
            {
                "term": "Reproductive health",
                "uri": "http://edamontology.org/topic_3420"
            }
        ]
    },
    "publication": [
        {
            "abstract": "This article presents a web server iPDA, which aims at identifying the disordered regions of a query protein. Automatic prediction of disordered regions from protein sequences is an important problem in the study of structural biology. The proposed classifier DisPSSMP2 is different from several existing disorder predictors by its employment of position-specific scoring matrices with respect to physicochemical properties (PSSMP), where the physicochemical properties adopted here especially take the disorder propensity of amino acids into account. The web server iPDA integrates DisPSSMP2 with several other sequence predictors in order to investigate the functional role of the detected disordered region. The predicted information includes sequence conservation, secondary structure, sequence complexity and hydrophobic clusters. According to the proportion of the secondary structure elements predicted, iPDA dynamically adjusts the cutting threshold of determining protein disorder. Furthermore, a pattern mining package for detecting sequence conservation is embedded in iPDA for discovering potential binding regions of the query protein, which is really helpful to uncovering the relationship between protein function and its primary sequence. The web service is available at http://biominer. bime.ntu.edu.tw/ipda and mirrored at http://biominer.cse.yzu.edu.tw/ipda. © 2007 The Author(s).",
            "authors": [
                "Su C.-T.",
                "Chen C.-Y.",
                "Hsu C.-M."
            ],
            "cit_count": 35,
            "journal": "Nucleic Acids Research",
            "pmid": "17553839",
            "title": "IPDA: Integrated protein disorder analyzer",
            "year": "2007-07-01"
        },
        {
            "abstract": "Background: More and more disordered regions have been discovered in protein sequences, and many of them are found to be functionally significant. Previous studies reveal that disordered regions of a protein can be predicted by its primary structure, the amino acid sequence. One observation that has been widely accepted is that ordered regions usually have compositional bias toward hydrophobic amino acids, and disordered regions are toward charged amino acids. Recent studies further show that employing evolutionary information such as position specific scoring matrices (PSSMs) improves the prediction accuracy of protein disorder. As more and more machine learning techniques have been introduced to protein disorder detection, extracting more useful features with biological insights attracts more attention. Results: Thi s paper first studies the effect of a condensed position specific scoring matrix with respect to physicochemical properties (PSSMP) on the prediction accuracy, where the PSSMP is derived by merging several amino acid columns of a PSSM belonging to a certain property into a single column. Next, we decompose each conventional physicochemical property of amino acids into two disjoint groups which have a propensity for order and disorder respectively, and show by experiments that some of the new properties perform better than their parent properties in predicting protein disorder. In order to get an effective and compact feature set on this problem, we propose a hybrid feature selection method that inherits the efficiency of uni-variant analysis and the effectiveness of the stepwise feature selection that explores combinations of multiple features. The experimental results show that the selected feature set improves the performance of a classifier built with Radial Basis Function Networks (RBFN) in comparison with the feature set constructed with PSSMs or PSSMPs that adopt simply the conventional physicochemical properties. Conclusion: Distinguishing disordered regions from ordered regions in protein sequences facilitates the exploration of protein structures and functions. Results based on independent testing data reveal that the proposed predicting model DisPSSMP performs the best among several of the existing packages doing similar tasks, without either under-predicting or over-predicting the disordered regions. Furthermore, the selected properties are demonstrated to be useful in finding discriminating patterns for order/disorder classification. © 2006 Su et al; licensee BioMed Central Ltd.",
            "authors": [
                "Su C.-T.",
                "Chen C.-Y.",
                "Ou Y.-Y."
            ],
            "cit_count": 77,
            "journal": "BMC Bioinformatics",
            "pmid": "16796745",
            "title": "Protein disorder prediction by condensed PSSM considering propensity for order or disorder",
            "year": "2006-06-23"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:ipda",
        "biotoolsID": "ipda",
        "description": "iPDA (Integrated Protein Disorder Analyzer) predicts disordered regions of a query protein sequence.",
        "homepage": "http://biominer.bime.ntu.edu.tw/ipda/",
        "name": "iPDA"
    }
}