{
    "accessibility": "Open access",
    "additionDate": "2022-08-17T20:25:23.905146Z",
    "biotoolsCURIE": "biotools:sgd-net",
    "biotoolsID": "sgd-net",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "kfchen@cgmh.org.tw",
            "name": "Kuan-Fu Chen",
            "typeEntity": "Person"
        },
        {
            "name": "Hung-Yu Wei"
        },
        {
            "name": "Yao-Liang Chen"
        },
        {
            "name": "Yi-Chia Wei"
        }
    ],
    "description": "Semantic segmentation guided detector for segmentation, classification, and lesion mapping of acute ischemic stroke in MRI images.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Backbone modelling",
                    "uri": "http://edamontology.org/operation_0479"
                },
                {
                    "term": "Editing",
                    "uri": "http://edamontology.org/operation_3096"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                }
            ]
        }
    ],
    "homepage": "https://github.com/IlikeBB/SGD-Net",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-08-17T20:25:23.909185Z",
    "license": "Not licensed",
    "name": "SGD-Net",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1016/J.NICL.2022.103044",
            "metadata": {
                "abstract": "© 2022 The Author(s)Background and purpose: MRI images timely and accurately reflect ischemic injuries to the brain tissues and, therefore, can support clinical decision-making of acute ischemic stroke (AIS). To maximize the information provided by the MRI images, we leverage deep learning models to segment, classify, and map lesion distributions of AIS. Methods: We evaluated brain MRI images of AIS patients from 2017 to 2020 at a tertiary teaching hospital and developed the Semantic Segmentation Guided Detector Network (SGD-Net), composed of the first U-shaped model for segmentation in diffusion-weighted imaging (DWI) and the second model for binary classification of lesion size (lacune vs. non-lacune) and circulatory territory of lesion location (anterior vs. posterior circulation). Next, we modified the two-stage deep learning model into SGD-Net Plus by automatically segmenting AIS lesions in DWI images and registering the lesion in T1-weighted images and the brain atlases. Results: The final enrollment (216 patients with 4606 slices) was divided into 80% for model development and 20% for testing. S1 model segmented AIS lesions in DWI images accurately with a pixel accuracy > 99% (Dice 0.806–0.828 and IoU 0.675–707). In comprehensive evaluation of classification performance, the two-stage SGD-Net outperformed the traditional one-stage models in classifying AIS lesion size (accuracy 0.867–0.956 vs. 0.511–0.867, AUROC 0.962–0.992 vs. 0.528–0.937, AUPRC 0.964–0.994 vs. 0.549–0.938) and location (accuracy 0.860–0.930 vs. 0.326–0.721, AUROC 0.936–0.988 vs. 0.493–0.833, AUPRC 0.883–0.978 vs. 0.365–0.695). The precise lesion segmentation at the first stage of the deep learning model was the basis for further application. After that, the modified two-stage model SGD-Net Plus accurately reported the volume, region percentage, and lesion percentage of each region on the selected brain atlas. Its reports provided clear descriptions and quantifications of the AIS-related brain injuries on white matter tracts, Brodmann areas, and cytoarchitectonic areas. Conclusion: Domain knowledge-oriented design of artificial intelligence applications can deepen our understanding of patients’ conditions and strengthen the use of MRI for patient care. SGD-Net precisely segments AIS lesions on DWI and accurately classifies the lesions. In addition, SGD-Net Plus maps the AIS lesions and quantifies their occupancy in each brain region. They are practical tools to meet the clinical needs and enrich educational resources of neuroimage.",
                "authors": [
                    {
                        "name": "Chen K.-F."
                    },
                    {
                        "name": "Chen Y.-L."
                    },
                    {
                        "name": "Cheng C.-T."
                    },
                    {
                        "name": "Hsu C.-C."
                    },
                    {
                        "name": "Hsu C.-C.H."
                    },
                    {
                        "name": "Huang W.-Y."
                    },
                    {
                        "name": "Jian C.-Y."
                    },
                    {
                        "name": "Lin C.-P."
                    },
                    {
                        "name": "Wei H.-Y."
                    },
                    {
                        "name": "Wei Y.-C."
                    }
                ],
                "date": "2022-01-01T00:00:00Z",
                "journal": "NeuroImage: Clinical",
                "title": "Semantic segmentation guided detector for segmentation, classification, and lesion mapping of acute ischemic stroke in MRI images"
            },
            "pmcid": "PMC9123273",
            "pmid": "35597030"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        }
    ]
}
