{"credit":[{"email":"ste.depo@gmail.com","name":"Stefano de Pretis","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"url":"http://bioconductor.org/packages/release/bioc/html/INSPEcT.html"}],"download":[{"type":"Source code","url":"http://bioconductor/packages/release/bioc/src/contrib/INSPEcT_1.4.0.tar.gz"}],"function":[{"operation":[{"term":"Nucleic acid sequence analysis","uri":"http://edamontology.org/operation_2478"}]}],"labels":{"collectionID":["BioConductor"],"language":["R"],"license":"GPL-2.0","operatingSystem":["Linux","Windows","Mac"],"toolType":["Command-line tool","Library"],"topic":[{"term":"RNA","uri":"http://edamontology.org/topic_0099"},{"term":"Nucleic acid sites, features and motifs","uri":"http://edamontology.org/topic_3511"}]},"publication":[{"abstract":"© The Author 2015. Published by Oxford University Press. Motivation: Cellular mRNA levels originate from the combined action of multiple regulatory processes, which can be recapitulated by the rates of pre-mRNA synthesis, pre-mRNA processing and mRNA degradation. Recent experimental and computational advances set the basis to study these intertwined levels of regulation. Nevertheless, software for the comprehensive quantification of RNA dynamics is still lacking. Results: INSPEcT is an R package for the integrative analysis of RNA- and 4sU-seq data to study the dynamics of transcriptional regulation. INSPEcT provides gene-level quantification of these rates, and a modeling framework to identify which of these regulatory processes are most likely to explain the observed mRNA and pre-mRNA concentrations. Software performance is tested on a synthetic dataset, instrumental to guide the choice of the modeling parameters and the experimental design.","authors":["De Pretis S.","Kress T.","Morelli M.J.","Melloni G.E.M.","Riva L.","Amati B.","Pelizzola M."],"cit_count":17,"doi":"10.1093/bioinformatics/btv288","journal":"Bioinformatics","pmid":"25957348","title":"INSPEcT: A computational tool to infer mRNA synthesis, processing and degradation dynamics from RNA- and 4sU-seq time course experiments","type":"Primary","year":"2015-02-06"}],"summary":{"biotoolsCURIE":"biotools:inspect","biotoolsID":"inspect","description":"INference of Synthesis, Processing and dEgradation rates in Course-Time experiments analyses 4sU-seq and RNA-seq time-course data in order to evaluate synthesis, processing and degradation rates and asses via modeling the rates that determines changes in mature mRNA levels.","homepage":"http://bioconductor.org/packages/release/bioc/html/INSPEcT.html","name":"INSPEcT","version":["1.4.0"]}}