{
    "additionDate": "2017-02-10T11:34:29Z",
    "biotoolsCURIE": "biotools:sfold",
    "biotoolsID": "sfold",
    "credit": [
        {
            "name": "Contact form",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://sfold.wadsworth.org/cgi-bin/contact.pl"
        }
    ],
    "description": "Server with three tools for the rational design of small interfering RNAs (Sirna), antisense oligonucleotides (Soligo), and trans-cleaving ribozymes (Sribo). A fourth tool, Srna, returns output including general folding features.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://sfold.wadsworth.org/cgi-bin/index.pl"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Structured RNA prediction and optimisation",
                    "uri": "http://edamontology.org/operation_0483"
                }
            ]
        }
    ],
    "homepage": "http://sfold.wadsworth.org",
    "language": [
        "Fortran"
    ],
    "lastUpdate": "2018-12-10T12:58:52Z",
    "name": "Sfold",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "Single-stranded regions in RNA secondary structure are important for RNA-RNA and RNA-protein interactions. We present a probability profile approach for the prediction of these regions based on a statistical algorithm for sampling RNA secondary structures. For the prediction of phylogenetically-determined single-stranded regions in secondary structures of representative RNA sequences, the probability profile offers substantial improvement over the minimum free energy structure. In designing antisense oligonucleotides, a practical problem is how to select a secondary structure for the target mRNA from the optimal structure(s) and many suboptimal structures with similar free energies. By summarizing the information from a statistical sample of probable secondary structures in a single plot, the probability profile not only presents a solution to this dilemma, but also reveals 'well-determined' single-stranded regions through the assignment of probabilities as measures of confidence in predictions. In antisense application to the rabbit β-globin mRNA, a significant correlation between hybridization potential predicted by the probability profile and the degree of inhibition of in vitro translation suggests that the probability profile approach is valuable for the identification of effective antisense target sites. Coupling computational design with DNA-RNA array technique provides a rational, efficient framework for antisense oligonucleotide screening. This framework has the potential for high-throughput applications to functional genomics and drug target validation.",
                "authors": [
                    {
                        "name": "Ding Y."
                    },
                    {
                        "name": "Lawrence C.E."
                    }
                ],
                "citationCount": 125,
                "date": "2001-03-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "Statistical prediction of single-stranded regions in RNA secondary structure and application to predicting effective antisense target sites and beyond"
            },
            "pmid": "11222752"
        },
        {
            "metadata": {
                "abstract": "An RNA molecule, particularly a long-chain mRNA, may exist as a population of structures. Furthermore, multiple structures have been demonstrated to play important functional roles. Thus, a representation of the ensemble of probable structures is of interest. We present a statistical algorithm to sample rigorously and exactly from the Boltzmann ensemble of secondary structures. The forward step of the algorithm computes the equilibrium partition functions of RNA secondary structures with recent thermodynamic parameters. Using conditional probabilities computed with the partition functions in a recursive sampling process, the backward step of the algorithm quickly generates a statistically representative sample of structures. With cubic run time for the forward step, quadratic run time in the worst case for the sampling step, and quadratic storage, the algorithm is efficient for broad applicability. We demonstrate that, by classifying sampled structures, the algorithm enables a statistical delineation and representation of the Boltzmann ensemble. Applications of the algorithm show that alternative biological structures are revealed through sampling. Statistical sampling provides a means to estimate the probability of any structural motif, with or without constraints. For example, the algorithm enables probability profiling of single-stranded regions in RNA secondary structure. Probability profiling for specific loop types is also illustrated. By overlaying probability profiles, a mutual accessibility plot can be displayed for predicting RNA:RNA interactions. Boltzmann probability-weighted density of states and free energy distributions of sampled structures can be readily computed. We show that a sample of moderate size from the ensemble of an enormous number of possible structures is sufficient to guarantee statistical reproducibility in the estimates of typical sampling statistics. Our applications suggest that the sampling algorithm may be well suited to prediction of mRNA structure and target accessibility. The algorithm is applicable to the rational design of small interfering RNAs (siRNAs), antisense oligonucleotides, and trans-cleaving ribozymes in gene knock-down studies.",
                "authors": [
                    {
                        "name": "Ding Y."
                    },
                    {
                        "name": "Lawrence C.E."
                    }
                ],
                "citationCount": 364,
                "date": "2003-12-15T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "A statistical sampling algorithm for RNA secondary structure prediction"
            },
            "pmid": "14654704"
        },
        {
            "metadata": {
                "abstract": "The Sfold web server provides user-friendly access to Sfold, a recently developed nucleic acid folding software package, via the World Wide Web (WWW). The software is based on a new statistical sampling paradigm for the prediction of RNA secondary structure. One of the main objectives of this software is to offer computational tools for the rational design of RNA-targeting nucleic acids, which include small interfering RNAs (siRNAs), antisense oligonucleotides and trans-cleaving ribozymes for gene knock-down studies. The methodology for siRNA design is based on a combination of RNA target accessibility prediction, siRNA duplex thermodynamic properties and empirical design rules. Our approach to target accessibility evaluation is an original extension of the underlying RNA folding algorithm to account for the likely existence of a population of structures for the target mRNA. In addition to the application modules Sirna, Soligo and Sribo for siRNAs, antisense oligos and ribozymes, respectively, the module Srna offers comprehensive features for statistical representation of sampled structures. Detailed output in both graphical and text formats is available for all modules. The Sfold server is available at http://sfold.wadsworth.org and http://www.bioinfo.rpi.edu/applications/sfold. © Oxford University Press 2004; all rights reserved.",
                "authors": [
                    {
                        "name": "Ding Y."
                    },
                    {
                        "name": "Chan C.Y."
                    },
                    {
                        "name": "Lawrence C.E."
                    }
                ],
                "citationCount": 349,
                "date": "2004-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "Sfold web server for statistical folding and rational design of nucleic acids"
            },
            "pmid": "15215366"
        },
        {
            "metadata": {
                "abstract": "A Bayesian approach for predicting RNA secondary structure that addresses the following three open issues is described: (1) the need for a representation of the full ensemble of probable structures; (2) the need to specify a fixed set of energy parameters; (3) the desire to make statistical inferences on all variables in the problem. It has recently been shown that Bayesian inference can be employed to relax or eliminate the need to specify the parameters of bioinformatics recursive algorithms and to give a statistical representation of the full ensemble of probable solutions with the incorporation of uncertainty in parameter values. In this paper, we make an initial exploration of these potential advantages of the Bayesian approach. We present a Bayesian algorithm that is based on stacking energy rules but relaxes the need to specify the parameters. The algorithm returns the exact posterior distribution of the number of destabilizing loops, stacking energy matrices, and secondary structures. The algorithm generates statistically representative structures from the full ensemble of probable secondary structures in exact proportion to the posterior probabilities. Once the forward recursions for the algorithm are completed, the backward recursive sampling executes in O(n) time, providing a very efficient approach for generating representative structures. We demonstrate the utility of the Bayesian approach with several tRNA sequences. The potential of the approach for predicting RNA secondary structures and presenting alternative structures is illustrated with applications to the Escherichia coli tRNAAla sequence and the Xenopus laevis oocyte 5S rRNA sequence. © 1999 Elsevier Science Ltd. All rights reserved.",
                "authors": [
                    {
                        "name": "Ding Y."
                    },
                    {
                        "name": "Lawrence C.E."
                    }
                ],
                "citationCount": 45,
                "date": "1999-06-15T00:00:00Z",
                "journal": "Computers and Chemistry",
                "title": "A Bayesian statistical algorithm for RNA secondary structure prediction"
            },
            "pmid": "10404626"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        },
        {
            "term": "Protein folding, stability and design",
            "uri": "http://edamontology.org/topic_0130"
        }
    ],
    "validated": 1
}