{
    "additionDate": "2021-01-18T11:33:12Z",
    "biotoolsCURIE": "biotools:perturbnet",
    "biotoolsID": "perturbnet",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "sssykim@cs.cmu.edu",
            "name": "Seyoung Kim",
            "orcidid": "https://orcid.org/0000-0003-2939-1036",
            "typeEntity": "Person"
        }
    ],
    "description": "Learning gene networks underlying clinical phenotypes using SNP perturbation.\n\nSoftware for Learning Gene Networks Underlying Clinical Phenotypes Using SNP Perturbations.\n\nRun the following command to install the software.\n\nDepending on the MacOSX version and default compiler, the location of some of the library #include statements in Mega-sCGGM and also those in Eigen for Fast-sCGGM need to change. Just always using the llvm/clang compiler installed via homebrew puts the libraries in the same place. For this, you will first need to install Homebrew, and then use it to install llvm:.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "SNP detection",
                    "uri": "http://edamontology.org/operation_0484"
                },
                {
                    "term": "Gene regulatory network analysis",
                    "uri": "http://edamontology.org/operation_1781"
                },
                {
                    "term": "Gene regulatory network prediction",
                    "uri": "http://edamontology.org/operation_2437"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                }
            ]
        }
    ],
    "homepage": "https://github.com/SeyoungKimLab/PerturbNet",
    "language": [
        "C++",
        "Fortran"
    ],
    "lastUpdate": "2021-01-23T08:58:54Z",
    "license": "GPL-3.0",
    "name": "PerturbNet",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PCBI.1007940",
            "metadata": {
                "abstract": "Copyright: © 2020 McCarter et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Availability of genome sequence, molecular, and clinical phenotype data for large patient cohorts generated by recent technological advances provides an opportunity to dissect the genetic architecture of complex diseases at system level. However, previous analyses of such data have largely focused on the co-localization of SNPs associated with clinical and expression traits, each identified from genome-wide association studies and expression quantitative trait locus mapping. Thus, their description of the molecular mechanisms behind the SNPs influencing clinical phenotypes was limited to the single gene linked to the co-localized SNP. Here we introduce PerturbNet, a statistical framework for learning gene networks that modulate the influence of genetic variants on phenotypes, using genetic variants as naturally occurring perturbation of a biological system. PerturbNet uses a probabilistic graphical model to directly model the cascade of perturbation from genetic variants to the gene network to the phenotype network along with the networks at each layer of the biological system. PerturbNet learns the entire model by solving a single optimization problem with an efficient algorithm that can analyze human genome-wide data within a few hours. PerturbNet inference procedures extract a detailed description of how the gene network modulates the genetic effects on phenotypes. Using simulated and asthma data, we demonstrate that PerturbNet improves statistical power for detecting disease-linked SNPs and identifies gene networks and network modules mediating the SNP effects on traits, providing deeper insights into the underlying molecular mechanisms.",
                "authors": [
                    {
                        "name": "McCarter C."
                    },
                    {
                        "name": "Howrylak J."
                    },
                    {
                        "name": "Kim S."
                    }
                ],
                "date": "2020-10-23T00:00:00Z",
                "journal": "PLoS Computational Biology",
                "title": "Learning gene networks underlying clinical phenotypes using SNP perturbation"
            },
            "pmcid": "PMC7584257",
            "pmid": "33095769"
        }
    ],
    "topic": [
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "GWAS study",
            "uri": "http://edamontology.org/topic_3517"
        }
    ],
    "validated": 1
}