{
    "additionDate": "2021-01-18T10:49:25Z",
    "biotoolsCURIE": "biotools:nedd",
    "biotoolsID": "nedd",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "limin@csu.edu.cn",
            "name": "Min Li",
            "typeEntity": "Person"
        }
    ],
    "description": "A network embedding based method for predicting drug-disease associations.\n\nNEDD is an novel computational method, which utilizes heterogeneous information based on the idea of meta path to identify potential novel indications for a given drug.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                },
                {
                    "term": "Dimensionality reduction",
                    "uri": "http://edamontology.org/operation_3935"
                }
            ]
        }
    ],
    "homepage": "http://bioinformatics.csu.edu.cn/resources/softs/DrugRepositioning/n_Web/NEDD.html",
    "lastUpdate": "2021-03-08T13:12:25Z",
    "name": "NEDD",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1186/S12859-020-03682-4",
            "metadata": {
                "abstract": "© 2020 The Author(s).Background: Drug discovery is known for the large amount of money and time it consumes and the high risk it takes. Drug repositioning has, therefore, become a popular approach to save time and cost by finding novel indications for approved drugs. In order to distinguish these novel indications accurately in a great many of latent associations between drugs and diseases, it is necessary to exploit abundant heterogeneous information about drugs and diseases. Results: In this article, we propose a meta-path-based computational method called NEDD to predict novel associations between drugs and diseases using heterogeneous information. First, we construct a heterogeneous network as an undirected graph by integrating drug-drug similarity, disease-disease similarity, and known drug-disease associations. NEDD uses meta paths of different lengths to explicitly capture the indirect relationships, or high order proximity, within drugs and diseases, by which the low dimensional representation vectors of drugs and diseases are obtained. NEDD then uses a random forest classifier to predict novel associations between drugs and diseases. Conclusions: The experiments on a gold standard dataset which contains 1933 validated drug-disease associations show that NEDD produces superior prediction results compared with the state-of-the-art approaches.",
                "authors": [
                    {
                        "name": "Zhou R."
                    },
                    {
                        "name": "Lu Z."
                    },
                    {
                        "name": "Luo H."
                    },
                    {
                        "name": "Xiang J."
                    },
                    {
                        "name": "Zeng M."
                    },
                    {
                        "name": "Li M."
                    }
                ],
                "citationCount": 1,
                "date": "2020-09-17T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "NEDD: A network embedding based method for predicting drug-disease associations"
            },
            "pmcid": "PMC7495830",
            "pmid": "32938396"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Drug discovery",
            "uri": "http://edamontology.org/topic_3336"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Pharmacogenomics",
            "uri": "http://edamontology.org/topic_0208"
        },
        {
            "term": "Personalised medicine",
            "uri": "http://edamontology.org/topic_3577"
        },
        {
            "term": "Preclinical and clinical studies",
            "uri": "http://edamontology.org/topic_3379"
        }
    ]
}