{
    "accessibility": "Open access",
    "additionDate": "2024-06-18T21:20:30.729684Z",
    "biotoolsCURIE": "biotools:zoish",
    "biotoolsID": "zoish",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "atorkama@scripps.edu",
            "name": "Ali Torkamani",
            "typeEntity": "Person"
        },
        {
            "name": "Hossein Javedani Sadaei",
            "typeEntity": "Person"
        }
    ],
    "description": "Novel feature selection approach leveraging shapley additive values for machine learning applications in healthcare.\n\nzoish download stats and details.\n\nzoish package details and statistics.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Feature selection",
                    "uri": "http://edamontology.org/operation_3936"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://pypi.org/project/zoish/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-06-18T21:20:30.732092Z",
    "name": "Zoish",
    "owner": "Pub2Tools",
    "publication": [
        {
            "metadata": {
                "abstract": "In the intricate landscape of healthcare analytics, effective feature selection is a prerequisite for generating robust predictive models, especially given the common challenges of sample sizes and potential biases. Zoish uniquely addresses these issues by employing Shapley additive values - an idea rooted in cooperative game theory - to enable both transparent and automated feature selection. Unlike existing tools, Zoish is versatile, designed to seamlessly integrate with an array of machine learning libraries including scikit-learn, XGBoost, CatBoost, and imbalanced-learn. The distinct advantage of Zoish lies in its dual algorithmic approach for calculating Shapley values, allowing it to efficiently manage both large and small datasets. This adaptability renders it exceptionally suitable for a wide spectrum of healthcare-related tasks. The tool also places a strong emphasis on interpretability, providing comprehensive visualizations for analyzed features. Its customizable settings offer users fine-grained control over feature selection, thus optimizing for specific predictive objectives. This manuscript elucidates the mathematical framework underpinning Zoish and how it uniquely combines local and global feature selection into a single, streamlined process. To validate Zoishs efficiency and adaptability, we present case studies in breast cancer prediction and Montreal Cognitive Assessment (MoCA) prediction in Parkinsons disease, along with evaluations on 300 synthetic datasets. These applications underscore Zoishs unparalleled performance in diverse healthcare contexts and against its counterparts.",
                "authors": [
                    {
                        "name": "Loguercio S."
                    },
                    {
                        "name": "Prilutsky D."
                    },
                    {
                        "name": "Sadaei H.J."
                    },
                    {
                        "name": "Shafiei Neyestanak M."
                    },
                    {
                        "name": "Torkamani A."
                    }
                ],
                "citationCount": 1,
                "date": "2024-01-01T00:00:00Z",
                "journal": "Pacific Symposium on Biocomputing",
                "title": "Zoish: A novel feature selection approach leveraging shapley additive values for machine learning applications in healthcare"
            },
            "pmcid": "PMC10764073",
            "pmid": "38160271"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ]
}
