{
    "additionDate": "2015-12-01T15:21:42Z",
    "biotoolsCURIE": "biotools:dbnp",
    "biotoolsID": "dbnp",
    "collectionID": [
        "NMC",
        "ELIXIR-NL"
    ],
    "credit": [
        {
            "name": "ELIXIR-NL",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        },
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.dbnp.org/phenotype-foundation/"
        }
    ],
    "description": "An open source application suite to store biological studies. The central module (GSCF) stores the study design, which links out to modules that contain the measurements of specific measurement platforms.",
    "documentation": [
        {
            "type": "General",
            "url": "http://www.dbnp.org/source-code/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "note": "The tool allows users to make a design of an intervention study in e.g. nutrition research, and to fill in templates with measurements during the execution of the study following standard operating procedures. \nThe software allows coupling to specific data processing protocols suitable for different measured data (e.g. metabolomics analysis pipelines)",
            "operation": [
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                }
            ]
        }
    ],
    "homepage": "http://dbnp.org/",
    "language": [
        "SQL"
    ],
    "lastUpdate": "2018-12-10T12:58:52Z",
    "name": "Nutritional Phenotype Database (dbnp)",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "ELIXIR-NL",
    "publication": [
        {
            "doi": "10.1007/s12263-010-0167-9",
            "metadata": {
                "abstract": "The challenge of modern nutrition and health research is to identify food-based strategies promoting life-long optimal health and well-being. This research is complex because it exploits a multitude of bioactive compounds acting on an extensive network of interacting processes. Whereas nutrition research can profit enormously from the revolution in 'omics' technologies, it has discipline-specific requirements for analytical and bioinformatic procedures. In addition to measurements of the parameters of interest (measures of health), extensive description of the subjects of study and foods or diets consumed is central for describing the nutritional phenotype. We propose and pursue an infrastructural activity of constructing the \"Nutritional Phenotype database\" (dbNP). When fully developed, dbNP will be a research and collaboration tool and a publicly available data and knowledge repository. Creation and implementation of the dbNP will maximize benefits to the research community by enabling integration and interrogation of data from multiple studies, from different research groups, different countries and different-omics levels. The dbNP is designed to facilitate storage of biologically relevant, pre-processed-omics data, as well as study descriptive and study participant phenotype data. It is also important to enable the combination of this information at different levels (e.g. to facilitate linkage of data describing participant phenotype, genotype and food intake with information on study design and-omics measurements, and to combine all of this with existing knowledge). The biological information stored in the database (i.e. genetics, transcriptomics, proteomics, biomarkers, metabolomics, functional assays, food intake and food composition) is tailored to nutrition research and embedded in an environment of standard procedures and protocols, annotations, modular data-basing, networking and integrated bioinformatics. The dbNP is an evolving enterprise, which is only sustainable if it is accepted and adopted by the wider nutrition and health research community as an open source, pre-competitive and publicly available resource where many partners both can contribute and profit from its developments. We introduce the Nutrigenomics Organisation (NuGO, http://www.nugo.org ) as a membership association responsible for establishing and curating the dbNP. Within NuGO, all efforts related to dbNP (i.e. usage, coordination, integration, facilitation and maintenance) will be directed towards a sustainable and federated infrastructure. © 2010 The Author(s).",
                "authors": [
                    {
                        "name": "Van Ommen B."
                    },
                    {
                        "name": "Bouwman J."
                    },
                    {
                        "name": "Dragsted L.O."
                    },
                    {
                        "name": "Drevon C.A."
                    },
                    {
                        "name": "Elliott R."
                    },
                    {
                        "name": "De Groot P."
                    },
                    {
                        "name": "Kaput J."
                    },
                    {
                        "name": "Mathers J.C."
                    },
                    {
                        "name": "Muller M."
                    },
                    {
                        "name": "Pepping F."
                    },
                    {
                        "name": "Saito J."
                    },
                    {
                        "name": "Scalbert A."
                    },
                    {
                        "name": "Radonjic M."
                    },
                    {
                        "name": "Rocca-Serra P."
                    },
                    {
                        "name": "Travis A."
                    },
                    {
                        "name": "Wopereis S."
                    },
                    {
                        "name": "Evelo C.T."
                    }
                ],
                "citationCount": 54,
                "date": "2010-09-01T00:00:00Z",
                "journal": "Genes and Nutrition",
                "title": "Challenges of molecular nutrition research 6: The nutritional phenotype database to store, share and evaluate nutritional systems biology studies"
            },
            "type": "Primary"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Nutritional science",
            "uri": "http://edamontology.org/topic_3390"
        },
        {
            "term": "Data management",
            "uri": "http://edamontology.org/topic_3071"
        }
    ],
    "validated": 1,
    "version": [
        "1"
    ]
}