
{
    "credit": [
        {
            "email": "cuilan.gao@stjude.org",
            "name": "Cuilan lani Gao",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "url": "http://bioconductor.org/packages/release/bioc/html/AGDEX.html"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://bioconductor/packages/release/bioc/src/contrib/AGDEX_1.22.0.tar.gz"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Gene expression comparison",
                    "uri": "http://edamontology.org/operation_0315"
                }
            ]
        }
    ],
    "labels": {
        "collectionID": [
            "BioConductor"
        ],
        "language": [
            "R"
        ],
        "license": "GPL-2.0",
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Command-line tool",
            "Library"
        ],
        "topic": [
            {
                "term": "Genomics",
                "uri": "http://edamontology.org/topic_0622"
            },
            {
                "term": "Gene expression",
                "uri": "http://edamontology.org/topic_0203"
            }
        ]
    },
    "publication": [
        {
            "abstract": "Motivation: Animal models play a pivotal role in translation biomedical research. The scientific value of an animal model depends on how accurately it mimics the human disease. In principle, microarrays collect the necessary data to evaluate the transcriptomic fidelity of an animal model in terms of the similarity of expression with the human disease. However, statistical methods for this purpose are lacking.Results: We develop the agreement of differential expression (AGDEX) procedure to measure and determine the statistical significance of the similarity of the results of two experiments that measure differential expression across two groups. AGDEX defines a metric of agreement and determines statistical significance by permutation of each experiment's group labels. Additionally, AGDEX performs a comprehensive permutation-based analysis of differential expression for each experiment, including gene-set analyses and meta-analytic integration of results across studies. As an example, we show how AGDEX was recently used to evaluate the similarity of the transcriptome of a novel model of the brain tumor ependymoma in mice to that of a subtype of the human disease. This result, combined with other observations, helped us to infer the cell of origin of this devastating human cancer. © The Author 2011. Published by Oxford University Press. All rights reserved.",
            "authors": [
                "Pounds S.",
                "Gao C.L.",
                "Johnson R.A.",
                "Wright K.D.",
                "Poppleton H.",
                "Finkelstein D.",
                "Leary S.E.S.",
                "Gilbertson R.J."
            ],
            "cit_count": 9,
            "doi": "10.1093/bioinformatics/btr362",
            "journal": "Bioinformatics",
            "title": "A procedure to statistically evaluate agreement of differential expression for cross-species genomics",
            "type": "Primary",
            "year": "2011-08-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:agdex",
        "biotoolsID": "agdex",
        "description": "A tool to evaluate agreement of differential expression for cross-species genomics.",
        "homepage": "http://bioconductor.org/packages/release/bioc/html/AGDEX.html",
        "name": "AGDEX",
        "version": [
            "1.22.0"
        ]
    }
}