{
    "accessibility": "Open access",
    "additionDate": "2023-11-30T16:55:01.453426Z",
    "biotoolsCURIE": "biotools:aslncr",
    "biotoolsID": "aslncr",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "meherprabin@yahoo.com",
            "name": "Prabina Kumar Meher",
            "typeEntity": "Person"
        }
    ],
    "description": "Novel computational tool for prediction of abiotic stress-responsive long non-coding RNAs in plants.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Prediction and recognition",
                    "uri": "http://edamontology.org/operation_2423"
                }
            ]
        }
    ],
    "homepage": "https://iasri-sg.icar.gov.in/aslncr/",
    "language": [
        "PHP",
        "R"
    ],
    "lastUpdate": "2024-11-24T14:30:11.646556Z",
    "name": "ASLncR",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1007/s10142-023-01040-0",
            "metadata": {
                "abstract": "Abiotic stresses are detrimental to plant growth and development and have a major negative impact on crop yields. A growing body of evidence indicates that a large number of long non-coding RNAs (lncRNAs) are key to many abiotic stress responses. Thus, identifying abiotic stress-responsive lncRNAs is essential in crop breeding programs in order to develop crop cultivars resistant to abiotic stresses. In this study, we have developed the first machine learning-based computational model for predicting abiotic stress-responsive lncRNAs. The lncRNA sequences which were responsive and non-responsive to abiotic stresses served as the two classes of the dataset for binary classification using the machine learning algorithms. The training dataset was created using 263 stress-responsive and 263 non-stress-responsive sequences, whereas the independent test set consists of 101 sequences from both classes. As the machine learning model can adopt only the numeric data, the Kmer features ranging from sizes 1 to 6 were utilized to represent lncRNAs in numeric form. To select important features, four different feature selection strategies were utilized. Among the seven learning algorithms, the support vector machine (SVM) achieved the highest cross-validation accuracy with the selected feature sets. The observed 5-fold cross-validation accuracy, AU-ROC, and AU-PRC were found to be 68.84, 72.78, and 75.86%, respectively. Furthermore, the robustness of the developed model (SVM with the selected feature) was evaluated using an independent test dataset, where the overall accuracy, AU-ROC, and AU-PRC were found to be 76.23, 87.71, and 88.49%, respectively. The developed computational approach was also implemented in an online prediction tool ASLncR accessible at https://iasri-sg.icar.gov.in/aslncr/. The proposed computational model and the developed prediction tool are believed to supplement the existing effort for the identification of abiotic stress-responsive lncRNAs in plants.",
                "authors": [
                    {
                        "name": "Gupta A."
                    },
                    {
                        "name": "Meher P.K."
                    },
                    {
                        "name": "Naha S."
                    },
                    {
                        "name": "Pradhan U.K."
                    },
                    {
                        "name": "Rao A.R."
                    }
                ],
                "citationCount": 6,
                "date": "2023-06-01T00:00:00Z",
                "journal": "Functional and Integrative Genomics",
                "title": "ASLncR: a novel computational tool for prediction of abiotic stress-responsive long non-coding RNAs in plants"
            },
            "pmid": "37000299"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Agricultural science",
            "uri": "http://edamontology.org/topic_3810"
        },
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Physiology",
            "uri": "http://edamontology.org/topic_3300"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        }
    ]
}
