{
    "additionDate": "2021-09-20T10:32:59.215454Z",
    "biotoolsCURIE": "biotools:gpdbn",
    "biotoolsID": "gpdbn",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "aoli@ustc.edu.cn",
            "name": "Ao Li",
            "typeEntity": "Person"
        },
        {
            "email": "mhwang@ustc.edu.cn",
            "name": "Minghui Wang",
            "typeEntity": "Person"
        }
    ],
    "description": "GPDBN is a deep bilinear network integrating both genomic data and pathological images for breast cancer prognosis prediction.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene expression profiling",
                    "uri": "http://edamontology.org/operation_0314"
                },
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                },
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                }
            ]
        }
    ],
    "homepage": "https://github.com/isfj/GPDBN",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T20:19:11.572667Z",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/isfj/GPDBN/issues"
        }
    ],
    "name": "GPDBN",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btab185",
            "metadata": {
                "abstract": "Motivation: Breast cancer is a very heterogeneous disease and there is an urgent need to design computational methods that can accurately predict the prognosis of breast cancer for appropriate therapeutic regime. Recently, deep learning-based methods have achieved great success in prognosis prediction, but many of them directly combine features from different modalities that may ignore the complex inter-modality relations. In addition, existing deep learning-based methods do not take intra-modality relations into consideration that are also beneficial to prognosis prediction. Therefore, it is of great importance to develop a deep learning-based method that can take advantage of the complementary information between intra-modality and inter-modality by integrating data from different modalities for more accurate prognosis prediction of breast cancer. Results: We present a novel unified framework named genomic and pathological deep bilinear network (GPDBN) for prognosis prediction of breast cancer by effectively integrating both genomic data and pathological images. In GPDBN, an inter-modality bilinear feature encoding module is proposed to model complex inter-modality relations for fully exploiting intrinsic relationship of the features across different modalities. Meanwhile, intra-modality relations that are also beneficial to prognosis prediction, are captured by two intra-modality bilinear feature encoding modules. Moreover, to take advantage of the complementary information between inter-modality and intra-modality relations, GPDBN further combines the inter- and intra-modality bilinear features by using a multi-layer deep neural network for final prognosis prediction. Comprehensive experiment results demonstrate that the proposed GPDBN significantly improves the performance of breast cancer prognosis prediction and compares favorably with existing methods.",
                "authors": [
                    {
                        "name": "Li A."
                    },
                    {
                        "name": "Li R."
                    },
                    {
                        "name": "Wang M."
                    },
                    {
                        "name": "Wang Z."
                    }
                ],
                "citationCount": 54,
                "date": "2021-09-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "GPDBN: deep bilinear network integrating both genomic data and pathological images for breast cancer prognosis prediction"
            },
            "pmcid": "PMC8479662",
            "pmid": "33734318"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        }
    ]
}
