{
    "additionDate": "2021-06-14T13:29:32Z",
    "biotoolsCURIE": "biotools:csupb",
    "biotoolsID": "csupb",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "linkui@bnu.edu.cn",
            "name": "Kui Lin",
            "orcidid": "https://orcid.org/0000-0002-5993-1972",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "cSupB is a tri-tuple coordinate system derived for fast and accurate analysis of the colored de Bruijn graph-based pangenomes. VARI-cSupB is an application of the succinct colored de Bruijn graph constructed by VARI-merge. It overcomes the complexity of graphs and organize a set of species- or population-specific haplotype sequences of interest. Based on this model, a tri-tuple coordinate system that combines an offset value, topological structure and sample information. Additionally, VARI-cSupB provides a novel method that utilizes complete topological information and efficiently detects variants for highly similar samples, which can be validated by simulated datasets. Moreover, VARI-cSupB can adapt to a complex cycle structure.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "De-novo assembly",
                    "uri": "http://edamontology.org/operation_0524"
                },
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                },
                {
                    "term": "Genome assembly",
                    "uri": "http://edamontology.org/operation_0525"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                }
            ]
        }
    ],
    "homepage": "https://github.com/eggleader/cSupB",
    "language": [
        "C++",
        "C"
    ],
    "lastUpdate": "2021-08-23T19:35:26Z",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/eggleader/cSupB/issues"
        }
    ],
    "name": "cSupB",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1186/S12859-021-04149-W",
            "metadata": {
                "abstract": "© 2021, The Author(s).Background: With the rapid development of accurate sequencing and assembly technologies, an increasing number of high-quality chromosome-level and haplotype-resolved assemblies of genomic sequences have been derived, from which there will be great opportunities for computational pangenomics. Although genome graphs are among the most useful models for pangenome representation, their structural complexity makes it difficult to present genome information intuitively, such as the linear reference genome. Thus, efficiently and accurately analyzing the genome graph spatial structure and coordinating the information remains a substantial challenge. Results: We developed a new method, a colored superbubble (cSupB), that can overcome the complexity of graphs and organize a set of species- or population-specific haplotype sequences of interest. Based on this model, we propose a tri-tuple coordinate system that combines an offset value, topological structure and sample information. Additionally, cSupB provides a novel method that utilizes complete topological information and efficiently detects small indels (< 50 bp) for highly similar samples, which can be validated by simulated datasets. Moreover, we demonstrated that cSupB can adapt to the complex cycle structure. Conclusions: Although the solution is made suitable for increasingly complex genome graphs by relaxing the constraint, the directed acyclic graph, the motif cSupB and the cSupB method can be extended to any colored directed acyclic graph. We anticipate that our method will facilitate the analysis of individual haplotype variants and population genomic diversity. We have developed a C + + program for implementing our method that is available at https://github.com/eggleader/cSupB.",
                "authors": [
                    {
                        "name": "Guo J."
                    },
                    {
                        "name": "Pang E."
                    },
                    {
                        "name": "Song H."
                    },
                    {
                        "name": "Lin K."
                    }
                ],
                "date": "2021-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "A tri-tuple coordinate system derived for fast and accurate analysis of the colored de Bruijn graph-based pangenomes"
            },
            "pmcid": "PMC8161984",
            "pmid": "34044757",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        }
    ]
}