{
    "additionDate": "2017-08-03T19:07:30Z",
    "biotoolsCURIE": "biotools:newdna-prot",
    "biotoolsID": "newdna-prot",
    "credit": [
        {
            "email": "jlspzw139@sina.com",
            "name": "Wei Zheng",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://sourceforge.net/projects/newdnaprot/"
        }
    ],
    "description": "Predicts the DNA-binding proteins when input a protein sequence (Fasta format)",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://sourceforge.net/projects/newdnaprot/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein-nucleic acid binding prediction",
                    "uri": "http://edamontology.org/operation_0420"
                }
            ]
        }
    ],
    "homepage": "http://sourceforge.net/projects/newdnaprot/",
    "language": [
        "Shell"
    ],
    "lastUpdate": "2018-12-10T12:58:51Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/newdna-prot-201409-dna-binding-protein-predict-software.html"
        }
    ],
    "name": "newDNA-Prot",
    "operatingSystem": [
        "Windows"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "© 2014 Elsevier Ltd. All rights reserved.Identification of DNA-binding proteins is essential in studying cellular activities as the DNA-binding proteins play a pivotal role in gene regulation. In this study, we propose newDNA-Prot, a DNA-binding protein predictor that employs support vector machine classifier and a comprehensive feature representation. The sequence representation are categorized into 6 groups: primary sequence based, evolutionary profile based, predicted secondary structure based, predicted relative solvent accessibility based, physicochemical property based and biological function based features. The mRMR, wrapper and two-stage feature selection methods are employed for removing irrelevant features and reducing redundant features. Experiments demonstrate that the two-stage method performs better than the mRMR and wrapper methods. We also perform a statistical analysis on the selected features and results show that more than 95% of the selected features are statistically significant and they cover all 6 feature groups. The newDNA-Prot method is compared with several state of the art algorithms, including iDNA-Prot, DNAbinder and DNA-Prot. The results demonstrate that newDNA-Prot method outperforms the iDNA-Prot, DNAbinder and DNA-Prot methods. More specific, newDNA-Prot improves the runner-up method, DNA-Prot for around 10% on several evaluation measures. The proposed newDNA-Prot method is available at http://sourceforge.net/projects/newdnaprot/",
                "authors": [
                    {
                        "name": "Zhang Y."
                    },
                    {
                        "name": "Xu J."
                    },
                    {
                        "name": "Zheng W."
                    },
                    {
                        "name": "Zhang C."
                    },
                    {
                        "name": "Qiu X."
                    },
                    {
                        "name": "Chen K."
                    },
                    {
                        "name": "Ruan J."
                    }
                ],
                "citationCount": 13,
                "date": "2014-01-01T00:00:00Z",
                "journal": "Computational Biology and Chemistry",
                "title": "NewDNA-Prot: Prediction of DNA-binding proteins by employing support vector machine and a comprehensive sequence representation"
            },
            "pmid": "25240115"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        },
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        }
    ],
    "validated": 1
}