{
    "additionDate": "2019-11-14T19:34:04Z",
    "biotoolsCURIE": "biotools:ColocAI",
    "biotoolsID": "ColocAI",
    "confidence_flag": "tool",
    "description": "artificial intelligence approach to quantify co-localization between mass spectrometry images | Methods for measuring co-localization of ion images | Measuring co-localization of ion images | This repository is devoted to a project on measuring co-localization of mass spectrometry images. The project is carried out by the Alexandrov team at EMBL Heidelberg. We created a webapp for ranking pairs of ion images, engaged external experts to rank images from their public data from METASPACE, consolidated the results into a gold standard set of ranked pairs of ion images, and, finally, developed and evaluated various measures of co-localization | Katja Ovchinnikova: pixel-based co-localization method development, gold standard preparation",
    "download": [
        {
            "type": "Source code",
            "url": "https://github.com/metaspace2020/coloc/tree/master/measures"
        }
    ],
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                }
            ]
        }
    ],
    "homepage": "https://github.com/metaspace2020/coloc",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-03-18T21:24:22Z",
    "license": "Apache-2.0",
    "name": "ColocML",
    "otherID": [
        {
            "value": "biotools:colocml"
        }
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1101/758425"
        },
        {
            "doi": "10.1093/BIOINFORMATICS/BTAA085",
            "metadata": {
                "abstract": "© 2020 The Author(s). Published by Oxford University Press. All rights reserved.Motivation: Imaging mass spectrometry (imaging MS) is a prominent technique for capturing distributions of molecules in tissue sections. Various computational methods for imaging MS rely on quantifying spatial correlations between ion images, referred to as co-localization. However, no comprehensive evaluation of co-localization measures has ever been performed; this leads to arbitrary choices and hinders method development. Results: We present ColocML, a machine learning approach addressing this gap. With the help of 42 imaging MS experts from nine laboratories, we created a gold standard of 2210 pairs of ion images ranked by their co-localization. We evaluated existing co-localization measures and developed novel measures using term frequency-inverse document frequency and deep neural networks. The semi-supervised deep learning Pi model and the cosine score applied after median thresholding performed the best (Spearman 0.797 and 0.794 with expert rankings, respectively). We illustrate these measures by inferring co-localization properties of 10 273 molecules from 3685 public METASPACE datasets.",
                "authors": [
                    {
                        "name": "Ovchinnikova K."
                    },
                    {
                        "name": "Stuart L."
                    },
                    {
                        "name": "Rakhlin A."
                    },
                    {
                        "name": "Nikolenko S."
                    },
                    {
                        "name": "Alexandrov T."
                    }
                ],
                "citationCount": 5,
                "date": "2020-05-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "ColocML: Machine learning quantifies co-localization between mass spectrometry images"
            },
            "pmcid": "PMC7214035",
            "pmid": "32049317",
            "type": [
                "Primary"
            ]
        }
    ],
    "topic": [
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        }
    ],
    "validated": 1
}