{
    "additionDate": "2017-08-03T19:06:46Z",
    "biotoolsCURIE": "biotools:mfasd",
    "biotoolsID": "mfasd",
    "credit": [
        {
            "email": "liangzhi@ustc.edu.cn",
            "name": "Zhi Liang",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://staff.ustc.edu.cn/~liangzhi/"
        }
    ],
    "description": "This tool could discriminate different types of metal-binding sites effectively based on 3D structure data and is useful for accurate metal-binding site prediction.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://staff.ustc.edu.cn/~liangzhi/mfasd/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein binding site prediction",
                    "uri": "http://edamontology.org/operation_2575"
                }
            ]
        }
    ],
    "homepage": "http://staff.ustc.edu.cn/~liangzhi/mfasd/",
    "lastUpdate": "2018-12-10T12:58:45Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/mfasd-discriminating-different-types-of-metal-binding-sites.html"
        }
    ],
    "name": "mFASD",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "© The Author 2015. Published by Oxford University Press.Motivation: A large number of proteins contain metal ions that are essential for their stability and biological activity. Identifying and characterizing metal-binding sites through computational methods is necessary when experimental clues are lacking. Almost all published computational methods are designed to distinguish metal-binding sites from non-metal-binding sites. However, discrimination between different types of metal-binding sites is also needed to make more accurate predictions. Results: In this work, we proposed a novel algorithm called mFASD, which could discriminate different types of metal-binding sites effectively based on 3D structure data and is useful for accurate metal-binding site prediction. mFASD captures the characteristics of a metal-binding site by investigating the local chemical environment of a set of functional atoms that are considered to be in contact with the bound metal. Then a distance measure defined on functional atom sets enables the comparison between different metal-binding sites. The algorithm could discriminate most types of metal-binding sites from each other with high sensitivity and accuracy. We showed that cascading our method with existing ones could achieve a substantial improvement of the accuracy for metal-binding site prediction.",
                "authors": [
                    {
                        "name": "He W."
                    },
                    {
                        "name": "Liang Z."
                    },
                    {
                        "name": "Niu L."
                    },
                    {
                        "name": "Teng M."
                    }
                ],
                "citationCount": 24,
                "date": "2015-06-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "mFASD: A structure-based algorithm for discriminating different types of metal-binding sites"
            },
            "pmid": "25649619"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Protein binding sites",
            "uri": "http://edamontology.org/topic_3534"
        },
        {
            "term": "Protein structure analysis",
            "uri": "http://edamontology.org/topic_2814"
        },
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        }
    ],
    "validated": 1
}
