{
    "additionDate": "2017-12-18T00:10:53Z",
    "biotoolsCURIE": "biotools:pepmapper",
    "biotoolsID": "pepmapper",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://informatics.nenu.edu.cn/PepMapper/support.jsp"
        }
    ],
    "description": "PepMapper is a web-based mapping tool developed for the purpose of epitope prediction using a collection of affinity selected peptides (mimotopes) derived from phage display experiments.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Mapping",
                    "uri": "http://edamontology.org/operation_2429"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Prediction",
                    "uri": "http://edamontology.org/operation_2423"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Protein sequence analysis",
                    "uri": "http://edamontology.org/operation_2479"
                }
            ]
        }
    ],
    "homepage": "http://informatics.nenu.edu.cn/PepMapper/",
    "homepage_status": 1,
    "language": [
        "C++"
    ],
    "lastUpdate": "2018-12-10T12:58:58Z",
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/pepmapper-server-epitope-prediction-phage-display-technique.html"
        }
    ],
    "name": "PepMapper",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1371/journal.pone.0037869",
            "metadata": {
                "abstract": "Epitope mapping from affinity-selected peptides has become popular in epitope prediction, and correspondingly many Web-based tools have been developed in recent years. However, the performance of these tools varies in different circumstances. To address this problem, we employed an ensemble approach to incorporate two popular Web tools, MimoPro and Pep-3D-Search, together for taking advantages offered by both methods so as to give users more options for their specific purposes of epitope-peptide mapping. The combined operation of Union finds as many associated peptides as possible from both methods, which increases sensitivity in finding potential epitopic regions on a given antigen surface. The combined operation of Intersection achieves to some extent the mutual verification by the two methods and hence increases the likelihood of locating the genuine epitopic region on a given antigen in relation to the interacting peptides. The Consistency between Intersection and Union is an indirect sufficient condition to assess the likelihood of successful peptide-epitope mapping. On average from 27 tests, the combined operations of PepMapper outperformed either MimoPro or Pep-3D-Search alone. Therefore, PepMapper is another multipurpose mapping tool for epitope prediction from affinity-selected peptides. The Web server can be freely accessed at at: http://informatics.nenu.edu.cn/PepMapper/. © 2012 Chen et al.",
                "authors": [
                    {
                        "name": "Chen W."
                    },
                    {
                        "name": "Guo W.W."
                    },
                    {
                        "name": "Huang Y."
                    },
                    {
                        "name": "Ma Z."
                    }
                ],
                "citationCount": 7,
                "date": "2012-05-25T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "Pepmapper: A collaborative web tool for mapping epitopes from affinity-selected peptides"
            },
            "type": "Primary"
        },
        {
            "doi": "10.1186/1471-2105-12-199",
            "metadata": {
                "abstract": "Background: A B-cell epitope is a group of residues on the surface of an antigen which stimulates humoral responses. Locating these epitopes on antigens is important for the purpose of effective vaccine design. In recent years, mapping affinity-selected peptides screened from a random phage display library to the native epitope has become popular in epitope prediction. These peptides, also known as mimotopes, share the similar structure and function with the corresponding native epitopes. Great effort has been made in using this similarity between such mimotopes and native epitopes in prediction, which has resulted in better outcomes than statistics-based methods can. However, it cannot maintain a high degree of satisfaction in various circumstances.Results: In this study, we propose a new method that maps a group of mimotopes back to a source antigen so as to locate the interacting epitope on the antigen. The core of this method is a searching algorithm that is incorporated with both dynamic programming (DP) and branch and bound (BB) optimization and operated on a series of overlapping patches on the surface of a protein. These patches are then transformed to a number of graphs using an adaptable distance threshold (ADT) regulated by an appropriate compactness factor (CF), a novel parameter proposed in this study. Compared with both Pep-3D-Search and PepSurf, two leading graph-based search tools, on average from the results of 18 test cases, MimoPro, the Web-based implementation of our proposed method, performed better in sensitivity, precision, and Matthews correlation coefficient (MCC) than both did in epitope prediction. In addition, MimoPro is significantly faster than both Pep-3D-Search and PepSurf in processing.Conclusions: Our search algorithm designed for processing well constructed graphs using an ADT regulated by CF is more sensitive and significantly faster than other graph-based approaches in epitope prediction. MimoPro is a viable alternative to both PepSurf and Pep-3D-Search for epitope prediction in the same kind, and freely accessible through the MimoPro server located at http://informatics.nenu.edu.cn/MimoPro. © 2011 Chen et al; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Chen W.H."
                    },
                    {
                        "name": "Sun P.P."
                    },
                    {
                        "name": "Lu Y."
                    },
                    {
                        "name": "Guo W.W."
                    },
                    {
                        "name": "Huang Y.X."
                    },
                    {
                        "name": "Ma Z.Q."
                    }
                ],
                "citationCount": 22,
                "date": "2011-05-25T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "MimoPro: A more efficient Web-based tool for epitope prediction using phage display libraries"
            }
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Peptides",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Phage display",
            "uri": "http://edamontology.org/topic_3557"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        }
    ],
    "validated": 1
}