{
    "additionDate": "2021-01-18T11:24:01Z",
    "biotoolsCURIE": "biotools:otsun",
    "biotoolsID": "otsun",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "ramon.pujol@uib.es",
            "name": "Ramon Pujol-Nadal",
            "orcidid": "https://orcid.org/0000-0003-0523-6904",
            "typeEntity": "Person"
        }
    ],
    "description": "Python package for the optical analysis of solar-thermal collectors and photovoltaic cells with arbitrary geometry.\n\nOTSun is a python package that uses the Monte Carlo Forward Ray Tracing for the optical analysis of Solar Thermal Collectors and Solar Cells.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://otsun.readthedocs.io"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein extinction coefficient calculation",
                    "uri": "http://edamontology.org/operation_0399"
                },
                {
                    "term": "Pathway analysis",
                    "uri": "http://edamontology.org/operation_3928"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "http://otsun.uib.es",
    "language": [
        "Python",
        "Shell"
    ],
    "lastUpdate": "2021-03-15T14:24:02Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/bielcardona/OTSun"
        },
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/bielcardona/OTSunSuppMat"
        }
    ],
    "name": "OTSun",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PONE.0240735",
            "metadata": {
                "abstract": "Copyright: © 2020 Cardona, Pujol-Nadal. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Ray tracing software systems are commonly used to analyze the optics of solar energy devices, since they allow to predict the energy gains of devices in real conditions, and also to compare them with other systems constantly emerging in the market. However, the available open-source packages apply excessive simplifications to the model of light-matter interaction, making that the optical behaviour of the systems can not be properly characterized, which in turn implies disagreements between physical experiments and computer simulations. We present here the open source python package OTSun, which applies the Fresnel equations in their most general form, without further simplifications, and is suitable for the simulation of both solar-thermal and photovoltaic systems. The geometrical objects used in this package are created using the parametric 3D modeler FreeCAD, which is also a free and open source program and allows for the construction of arbitrary geometries that can be analyzed with OTSun. These, and other software capabilities, make OTSun extremely flexible and accurate for the optical analysis of solar devices with arbitrary geometry. Additionally, OTSun has a companion webtool, OTSunWebApp, that allows for the usage of certain features of the package without the need to install anything locally. We also show here two numerical experiments that we performed in order to validate the model and implementation: The analysis of the optical efficiency of a Linear Fresnel Reflector (with moving objects), and of a second surface mirror (with variable wavelengths). In each case, the numerical computations had deviations of less than 0.25% from reference models (either computed with another program or with exact formulas).",
                "authors": [
                    {
                        "name": "Cardona G."
                    },
                    {
                        "name": "Pujol-Nadal R."
                    }
                ],
                "citationCount": 1,
                "date": "2020-10-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "OTSun, a python package for the optical analysis of solar-thermal collectors and photovoltaic cells with arbitrary geometry"
            },
            "pmcid": "PMC7556463",
            "pmid": "33052977"
        }
    ],
    "toolType": [
        "Web application",
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Physics",
            "uri": "http://edamontology.org/topic_3318"
        },
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Software engineering",
            "uri": "http://edamontology.org/topic_3372"
        }
    ]
}