{
    "additionDate": "2017-02-10T14:15:09Z",
    "biotoolsCURIE": "biotools:pheps",
    "biotoolsID": "pheps",
    "description": "This tool performs global and local pH-dependent electrostatic analysis of protein structures. The user can supply a PDB ID or upload a coordinate file.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein structure assignment",
                    "uri": "http://edamontology.org/operation_0320"
                },
                {
                    "term": "Protein structural motif recognition",
                    "uri": "http://edamontology.org/operation_0245"
                },
                {
                    "term": "Protein structure analysis",
                    "uri": "http://edamontology.org/operation_2406"
                },
                {
                    "term": "Protein secondary structure analysis",
                    "uri": "http://edamontology.org/operation_2416"
                },
                {
                    "term": "Protein pH-dependent property calculation",
                    "uri": "http://edamontology.org/operation_0400"
                }
            ]
        }
    ],
    "homepage": "http://pheps.orgchm.bas.bg/home.html",
    "homepage_status": 1,
    "lastUpdate": "2018-12-10T12:58:40Z",
    "name": "PHEPS",
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "PHEPS (pH-dependent Protein Electrostatics Server) is a web service for fast prediction and experiment planning support, as well as for correlation and analysis of experimentally obtained results, reflecting charge-dependent phenomena in globular proteins. Its implementation is based on long-term experience (PHEI package) and the need to explain measured physicochemical characteristics the level of protein atomic structure. The approach is semi-empirical and based on a mean field scheme for description and evaluation of global and local pH-dependent electrostatic properties: protein proton binding; ionic sites proton population; free energy electrostatic term; ionic groups proton affinities (pKa,i) and their Coulomb interaction with whole charge multipole; electrostatic potential of whole molecule at fixed pH and pH-dependent local electrostatic potentials at user-defined set of points. The speed of calculation is based on fast determination of distance-dependent pair charge-charge interactions as empirical three exponential function that covers charge-charge, charge-dipole and dipole-dipole contributions. After atomic coordinates input, all standard parameters are used as defaults to facilitate non-experienced users. Special attention was given to interactive addition of non-polypeptide charges, extra ionizable groups with intrinsic pKas or fixed ions. The output information is given as plain-text, readable by 'RasMol', 'Origin' and the like. The PHEPS server is accessible at http://pheps.orgchm. bas.bg/home.html. © The Author 2006. Published by Oxford University Press. All rights reserved.",
                "authors": [
                    {
                        "name": "Kantardjiev A.A."
                    },
                    {
                        "name": "Atanasov B.P."
                    }
                ],
                "citationCount": 17,
                "date": "2006-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "PHEPS: Web-based pH-dependent Protein Electrostatics Server"
            },
            "pmid": "16845042"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Protein structural motifs and surfaces",
            "uri": "http://edamontology.org/topic_0166"
        },
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        },
        {
            "term": "Protein structure analysis",
            "uri": "http://edamontology.org/topic_2814"
        },
        {
            "term": "Protein folds and structural domains",
            "uri": "http://edamontology.org/topic_0736"
        },
        {
            "term": "Structure prediction",
            "uri": "http://edamontology.org/topic_0082"
        }
    ],
    "validated": 1
}