{
    "additionDate": "2017-01-25T15:28:18Z",
    "biotoolsCURIE": "biotools:syntview",
    "biotoolsID": "syntview",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "plechat@pasteur.fr",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Comparative and interactive viewer for microbial genomes, designed to run as either a web-based tool (Flash technology) or a desktop application (AIR environment). The basis of the program is a generic genome browser with sub-maps holding information about genomic objects. The software is characterized by the presentation of syntenic organisations of microbial genomes and the visualization of polymorphism data along these genomes; these features are accessible to the user in an integrated way.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://hub18.hosting.pasteur.fr/SynTView/documentation/"
        }
    ],
    "editPermission": {
        "authors": [
            "hmenager",
            "khillion"
        ],
        "type": "group"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Annotation track",
                        "uri": "http://edamontology.org/data_3002"
                    },
                    "format": [
                        {
                            "term": "TSV",
                            "uri": "http://edamontology.org/format_3475"
                        }
                    ]
                },
                {
                    "data": {
                        "term": "Phylogenetic tree",
                        "uri": "http://edamontology.org/data_0872"
                    },
                    "format": [
                        {
                            "term": "newick",
                            "uri": "http://edamontology.org/format_1910"
                        }
                    ]
                },
                {
                    "data": {
                        "term": "Sequence variations",
                        "uri": "http://edamontology.org/data_3498"
                    },
                    "format": [
                        {
                            "term": "TSV",
                            "uri": "http://edamontology.org/format_3475"
                        }
                    ]
                }
            ],
            "operation": [
                {
                    "term": "Genetic variation analysis",
                    "uri": "http://edamontology.org/operation_3197"
                },
                {
                    "term": "Genome visualisation",
                    "uri": "http://edamontology.org/operation_3208"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Plot",
                        "uri": "http://edamontology.org/data_2884"
                    },
                    "format": [
                        {
                            "term": "PNG",
                            "uri": "http://edamontology.org/format_3603"
                        }
                    ]
                }
            ]
        }
    ],
    "homepage": "http://genopole.pasteur.fr/SynTView/",
    "language": [
        "ActionScript"
    ],
    "lastUpdate": "2021-05-19T14:52:04Z",
    "license": "LGPL-3.0",
    "maturity": "Mature",
    "name": "SynTView",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "otherID": [
        {
            "type": "rrid",
            "value": "RRID:SCR_011939"
        }
    ],
    "owner": "plechat",
    "publication": [
        {
            "doi": "10.1186/1471-2105-14-277",
            "metadata": {
                "abstract": "Background: Dynamic visualisation interfaces are required to explore the multiple microbial genome data now available, especially those obtained by high-throughput sequencing - a.k.a. \" Next-Generation Sequencing\" (NGS) - technologies; they would also be useful for \" standard\" annotated genomes whose chromosome organizations may be compared. Although various software systems are available, few offer an optimal combination of feature-rich capabilities, non-static user interfaces and multi-genome data handling.Results: We developed SynTView, a comparative and interactive viewer for microbial genomes, designed to run as either a web-based tool (Flash technology) or a desktop application (AIR environment). The basis of the program is a generic genome browser with sub-maps holding information about genomic objects (annotations). The software is characterised by the presentation of syntenic organisations of microbial genomes and the visualisation of polymorphism data (typically Single Nucleotide Polymorphisms - SNPs) along these genomes; these features are accessible to the user in an integrated way. A variety of specialised views are available and are all dynamically inter-connected (including linear and circular multi-genome representations, dot plots, phylogenetic profiles, SNP density maps, and more). SynTView is not linked to any particular database, allowing the user to plug his own data into the system seamlessly, and use external web services for added functionalities. SynTView has now been used in several genome sequencing projects to help biologists make sense out of huge data sets.Conclusions: The most important assets of SynTView are: (i) the interactivity due to the Flash technology; (ii) the capabilities for dynamic interaction between many specialised views; and (iii) the flexibility allowing various user data sets to be integrated. It can thus be used to investigate massive amounts of information efficiently at the chromosome level. This innovative approach to data exploration could not be achieved with most existing genome browsers, which are more static and/or do not offer multiple views of multiple genomes. Documentation, tutorials and demonstration sites are available at the URL: http://genopole.pasteur.fr/SynTView. © 2013 Lechat et al.; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Lechat P."
                    },
                    {
                        "name": "Moszer I."
                    },
                    {
                        "name": "Souche E."
                    }
                ],
                "citationCount": 20,
                "date": "2013-09-22T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "SynTView - an interactive multi-view genome browser for next-generation comparative microorganism genomics"
            },
            "pmcid": "PMC3849071",
            "pmid": "24053737",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Desktop application",
        "Web application"
    ],
    "topic": [
        {
            "term": "Comparative genomics",
            "uri": "http://edamontology.org/topic_0797"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ],
    "validated": 1,
    "version": [
        "1"
    ]
}
