
{
    "credit": [
        {
            "email": "deane@stats.ox.ac.uk",
            "name": "Charlotte Deane",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://opig.stats.ox.ac.uk/"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Formatting",
                    "uri": "http://edamontology.org/operation_0335"
                }
            ]
        },
        {
            "note": "Function of GROMACS, program that generates the output that this tool reads",
            "operation": [
                {
                    "term": "Molecular dynamics",
                    "uri": "http://edamontology.org/operation_2476"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "MATLAB"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Computational chemistry",
                "uri": "http://edamontology.org/topic_3332"
            },
            {
                "term": "Molecular dynamics",
                "uri": "http://edamontology.org/topic_0176"
            },
            {
                "term": "Data management",
                "uri": "http://edamontology.org/topic_3071"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/gro2mat-a-package-to-efficiently-read-gromacs-output-in-matlab.html"
        }
    ],
    "publication": [
        {
            "abstract": "Molecular dynamics (MD) simulations are a state-of-the-art computational method used to investigate molecular interactions at atomic scale. Interaction processes out of experimental reach can be monitored using MD software, such as Gromacs. Here, we present the gro2mat package that allows fast and easy access to Gromacs output files from Matlab. Gro2mat enables direct parsing of the most common Gromacs output formats including the binary xtc-format. No openly available Matlab parser currently exists for this format. The xtc reader is orders of magnitudes faster than other available pdb/ascii workarounds. Gro2mat is especially useful for scientists with an interest in quick prototyping of new mathematical and statistical approaches for Gromacs trajectory analyses. © 2014 Wiley Periodicals, Inc. Molecular Dynamics simulations are computational methods used to investigate molecular interactions at atomic scale. Interaction processes out of experimental reach can be monitored using Molecular Dynamics software such as Gromacs. In this article, the gro2mat package is presented. It allows fast and easy access to Gromacs output files from Matlab. This package is especially useful for scientists with an interest in quick prototyping of new mathematical and statistical approaches for Gromacs trajectory analyses. Copyright © 2014 Wiley Periodicals, Inc.",
            "authors": [
                "Dien H.",
                "Deane C.M.",
                "Knapp B."
            ],
            "cit_count": 12,
            "journal": "Journal of Computational Chemistry",
            "pmid": "24920464",
            "title": "Gro2mat: A package to efficiently read gromacs output in MATLAB",
            "year": "2014-07-30"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:gro2mat",
        "biotoolsID": "gro2mat",
        "description": "Package that allows fast and easy access to Gromacs output files from Matlab.",
        "homepage": "http://www.stats.ox.ac.uk/research/proteins/resources",
        "name": "Gro2mat"
    }
}