{
    "accessibility": "Open access",
    "additionDate": "2019-05-25T20:41:52Z",
    "biotoolsCURIE": "biotools:optiSel",
    "biotoolsID": "optiSel",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "r.wellmann@uni-hohenheim.de",
            "name": "Robin Wellmann",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Framework for the optimization of breeding programs via optimum contribution selection and mate allocation.",
    "download": [
        {
            "type": "Source code",
            "url": "https://github.com/cran/optiSel"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Haplotype mapping",
                    "uri": "http://edamontology.org/operation_0487"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                }
            ]
        }
    ],
    "homepage": "https://cran.r-project.org/package=optiSel",
    "language": [
        "R"
    ],
    "lastUpdate": "2020-06-16T10:55:22Z",
    "license": "GPL-2.0",
    "maturity": "Mature",
    "name": "optiSel",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "Ruta",
    "publication": [
        {
            "doi": "10.1186/s12859-018-2450-5",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Selecting animals for breeding in the optimum way plays an essential role for the management of genetic resources and in selective breeding of livestock species. It requires to compute the optimum genetic contribution of each selection candidate to the next generation. Current software packages for optimum contribution selection (OCS) are not able to handle the main conflicting objectives of animal breeding programs simultaneously, which includes to increase genetic gain, to increase or to maintain genetic diversity, to recover the original genetic background of endangered breeds with historic introgression, and to maintain or increase genetic diversity at native alleles. Results: The free R package optiSel offers functions for estimating the above mentioned parameters from pedigree and marker data, and for solving OCS problems. One parameter can be optimized, whereas the remaining ones can be constrained. The results reveal the optimum numbers of offspring of all selection candidates, and can subsequently be used for mate allocation. Different solvers can be used. Solver slsqp was superior when the genetic diversity at native alleles was to be maximized, whereas solvers cccp and cccp2 were superior for all other OCS problems. Conclusion: Optimum contribution selection applied to local breeds requires special attention due to the conflicting objectives of their breeding programs. The free R package optiSel is an easy-to-use software taking these conflicting objectives into account.",
                "authors": [
                    {
                        "name": "Wellmann R."
                    }
                ],
                "citationCount": 14,
                "date": "2019-01-14T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Optimum contribution selection for animal breeding and conservation: The R package optiSel"
            },
            "pmcid": "PMC6332575",
            "pmid": "30642239",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Population genetics",
            "uri": "http://edamontology.org/topic_3056"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        }
    ],
    "validated": 1,
    "version": [
        "2.0.2"
    ]
}