{
    "accessibility": "Open access",
    "additionDate": "2021-12-01T18:16:34.091416Z",
    "biotoolsCURIE": "biotools:mries",
    "biotoolsID": "mries",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "lwang@psych.ac.cn",
            "name": "Liang Wang",
            "typeEntity": "Person"
        },
        {
            "name": "Haixiang Wang"
        },
        {
            "name": "Kaijia Sun"
        },
        {
            "name": "Wenjing Zhou"
        },
        {
            "name": "Yunxian Bai"
        }
    ],
    "description": "A Matlab Toolbox for Mapping the Responses to Intracranial Electrical Stimulation.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://github.com/SunKaijia0065/MRIES/blob/main/MRIES_tutorial.md"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Mapping",
                    "uri": "http://edamontology.org/operation_2429"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://github.com/SunKaijia0065/MRIES",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2021-12-01T18:18:08.971855Z",
    "license": "MIT",
    "name": "MRIES",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.3389/FNINS.2021.652841",
            "metadata": {
                "abstract": "© Copyright © 2021 Sun, Wang, Bai, Zhou and Wang.Propose: Directed cortical responses to intracranial electrical stimulation are a good standard for mapping inter-regional direct connectivity. Cortico-cortical evoked potential (CCEP), elicited by single pulse electrical stimulation (SPES), has been widely used to map the normal and abnormal brain effective network. However, automated processing of CCEP datasets and visualization of connectivity results remain challenging for researchers and clinicians. In this study, we develop a Matlab toolbox named MRIES (Mapping the Responses to Intracranial Electrical Stimulation) to automatically process CCEP data and visualize the connectivity results. Method: The MRIES integrates the processing pipeline of the CCEP datasets and various methods for connectivity calculation based on low- and high-frequency signals with stimulation artifacts removed. The connectivity matrices are saved in different folders for visualization. Different visualization patterns (connectivity matrix, circle map, surface map, and volume map) are also integrated to the graphical user interface (GUI), which makes it easy to intuitively display and compare different connectivity measurements. Furthermore, one sample CCEP data set collected from eight epilepsy patients is used to validate the MRIES toolbox. Result: We show the GUI and visualization functions of MRIES using one example CCEP data that has been described in a complete tutorial. We applied this toolbox to the sample CCEP data set to investigate the direct connectivity between the medial temporal lobe and the insular cortex. We find bidirectional connectivity between MTL and insular that are consistent with the findings of previous studies. Conclusion: MRIES has a friendly GUI and integrates the full processing pipeline of CCEP data and various visualization methods. The MRIES toolbox, tutorial, and example data can be freely downloaded. As an open-source package, MRIES is expected to improve the reproducibility of CCEP findings and facilitate clinical translation.",
                "authors": [
                    {
                        "name": "Bai Y."
                    },
                    {
                        "name": "Sun K."
                    },
                    {
                        "name": "Wang H."
                    },
                    {
                        "name": "Wang L."
                    },
                    {
                        "name": "Zhou W."
                    }
                ],
                "date": "2021-06-14T00:00:00Z",
                "journal": "Frontiers in Neuroscience",
                "title": "MRIES: A Matlab Toolbox for Mapping the Responses to Intracranial Electrical Stimulation"
            },
            "pmcid": "PMC8236813",
            "pmid": "34194294"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        }
    ]
}
