{
    "additionDate": "2015-01-22T11:35:47Z",
    "biotoolsCURIE": "biotools:pscanchip",
    "biotoolsID": "pscanchip",
    "collectionID": [
        "MoD Tools"
    ],
    "credit": [
        {
            "name": "ELIXIR-ITA-MILANO",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        },
        {
            "email": "giulio.pavesi@unimi.it",
            "name": "Giulio Pavesi",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "federico.zambelli@unimi.it",
            "name": "Federico Zambelli",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Web server that, starting from a collection of genomic regions derived from a ChIP-Seq experiment, scans them using motif descriptors like JASPAR or TRANSFAC position-specific frequency matrices, or descriptors uploaded by users, and it evaluates both motif enrichment and positional bias within the regions according to different measures and criteria.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://159.149.160.88/pscan_chip_dev/help.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Sequence coordinates",
                        "uri": "http://edamontology.org/data_2012"
                    },
                    "format": [
                        {
                            "term": "BED",
                            "uri": "http://edamontology.org/format_3003"
                        }
                    ]
                }
            ],
            "operation": [
                {
                    "term": "Sequence motif discovery",
                    "uri": "http://edamontology.org/operation_0238"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Transcription factor name",
                        "uri": "http://edamontology.org/data_2755"
                    },
                    "format": [
                        {
                            "term": "Textual format",
                            "uri": "http://edamontology.org/format_2330"
                        }
                    ]
                }
            ]
        }
    ],
    "homepage": "http://www.beaconlab.it/pscan_chip_dev",
    "language": [
        "PHP",
        "C++"
    ],
    "lastUpdate": "2018-12-10T12:58:55Z",
    "license": "GPL-3.0",
    "maturity": "Mature",
    "name": "PscanChIP",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "ELIXIR-ITA-MILANO",
    "publication": [
        {
            "doi": "10.1093/nar/gkt448",
            "metadata": {
                "abstract": "Chromatin immunoprecipitation followed by sequencing with next-generation technologies (ChIP-Seq) has become the de facto standard for building genome-wide maps of regions bound by a given transcription factor (TF). The regions identified, however, have to be further analyzed to determine the actual DNA-binding sites for the TF, as well as sites for other TFs belonging to the same TF complex or in general co-operating or interacting with it in transcription regulation. PscanChIP is a web server that, starting from a collection of genomic regions derived from a ChIP-Seq experiment, scans them using motif descriptors like JASPAR or TRANSFAC position-specific frequency matrices, or descriptors uploaded by users, and it evaluates both motif enrichment and positional bias within the regions according to different measures and criteria. PscanChIP can successfully identify not only the actual binding sites for the TF investigated by a ChIP-Seq experiment but also secondary motifs corresponding to other TFs that tend to bind the same regions, and, if present, precise positional correlations among their respective sites. The web interface is free for use, and there is no login requirement. It is available at http://www.beaconlab.it/pscan_chip_dev.",
                "authors": [
                    {
                        "name": "Zambelli F."
                    },
                    {
                        "name": "Pesole G."
                    },
                    {
                        "name": "Pavesi G."
                    }
                ],
                "citationCount": 53,
                "date": "2013-01-01T00:00:00Z",
                "journal": "Nucleic acids research",
                "title": "PscanChIP: Finding over-represented transcription factor-binding site motifs and their correlations in sequences from ChIP-Seq experiments."
            },
            "type": [
                "Primary"
            ]
        },
        {
            "doi": "10.1002/0471250953.bi0211s47",
            "metadata": {
                "abstract": "© 2014 by John Wiley and Sons, Inc.One of the greatest challenges facing modern molecular biology is understanding the complex mechanisms regulating gene expression. A fundamental step in this process requires the characterization of sequence motifs involved in the regulation of gene expression at transcriptional and post-transcriptional levels. In particular, transcription is modulated by the interaction of transcription factors (TFs) with their corresponding binding sites. Weeder, Pscan, and PscanChIP are software tools freely available for noncommercial users as a stand-alone orWeb-based applications for the automatic discovery of conserved motifs in a set of DNA sequences likely to be bound by the same TFs. Input for the tools can be promoter sequences from co-expressed or co-regulated genes (for whichWeeder and Pscan are suitable), or regions identified through genome wide ChIPseq or similar experiments (Weeder and PscanChIP). The motifs are either found by a de novo approach (Weeder) or by using descriptors of the binding specificity of TFs (Pscan and PscanChIP). Curr. Protoc. Bioinform. 47:2.11.1-2.11.31.",
                "authors": [
                    {
                        "name": "Zambelli F."
                    },
                    {
                        "name": "Pesole G."
                    },
                    {
                        "name": "Pavesi G."
                    }
                ],
                "citationCount": 8,
                "date": "2014-01-01T00:00:00Z",
                "journal": "Current Protocols in Bioinformatics",
                "title": "Using Weeder, Pscan, and PscanChIP for the discovery of enriched transcription factor binding Site motifs in nucleotide Sequences"
            },
            "type": [
                "Other"
            ]
        }
    ],
    "toolType": [
        "Command-line tool",
        "Web application"
    ],
    "topic": [
        {
            "term": "Sequence sites, features and motifs",
            "uri": "http://edamontology.org/topic_0160"
        }
    ],
    "validated": 1,
    "version": [
        "1.3"
    ]
}