{
    "additionDate": "2021-01-18T09:55:23Z",
    "biotoolsCURIE": "biotools:ukin",
    "biotoolsID": "ukin",
    "confidence_flag": "tool",
    "description": "uKIN Combines New and Prior Information with Guided Network Propagation to Accurately Identify Disease Genes.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Singh-Lab/uKIN",
    "language": [
        "Ruby"
    ],
    "lastUpdate": "2021-03-06T15:18:01Z",
    "name": "uKIN",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1016/J.CELS.2020.05.008",
            "metadata": {
                "abstract": "© 2020 The AuthorsProtein interaction networks provide a powerful framework for identifying genes causal for complex genetic diseases. Here, we introduce a general framework, uKIN, that uses prior knowledge of disease-associated genes to guide, within known protein-protein interaction networks, random walks that are initiated from newly identified candidate genes. In large-scale testing across 24 cancer types, we demonstrate that our network propagation approach for integrating both prior and new information not only better identifies cancer driver genes than using either source of information alone but also readily outperforms other state-of-the-art network-based approaches. We also apply our approach to genome-wide association data to identify genes functionally relevant for several complex diseases. Overall, our work suggests that guided network propagation approaches that utilize both prior and new data are a powerful means to identify disease genes. uKIN is freely available for download at: https://github.com/Singh-Lab/uKIN. We develop a guided network propagation approach to identify disease genes that combines prior knowledge of disease-associated genes with newly identified candidate genes. We demonstrate the effectiveness of our approach by applying it to somatic mutations observed across tumors to discover genes causal for cancer, as well as to genome-wide association data to discover genes causal for complex diseases.",
                "authors": [
                    {
                        "name": "Chazelle B."
                    },
                    {
                        "name": "Hristov B.H."
                    },
                    {
                        "name": "Singh M."
                    }
                ],
                "date": "2020-06-24T00:00:00Z",
                "journal": "Cell Systems",
                "title": "uKIN Combines New and Prior Information with Guided Network Propagation to Accurately Identify Disease Genes"
            },
            "pmid": "32684276"
        }
    ],
    "topic": [
        {
            "term": "Exome sequencing",
            "uri": "http://edamontology.org/topic_3676"
        },
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        }
    ]
}
