{
    "additionDate": "2019-11-14T19:59:25Z",
    "biotoolsCURIE": "biotools:GSE33335",
    "biotoolsID": "GSE33335",
    "confidence_flag": "medium",
    "description": "> MEDIUM CONFIDENCE! | > NAME (GSE33335) SIMILAR TO (PUB. DIFFERENT) bio.tools/gse (GSE) | > CORRECT NAME OF TOOL COULD ALSO BE 'GSE54129', 'GPNMB', 'gastric', 'DEGs' | Transcriptome analysis reveals GPNMB as a potential therapeutic target for gastric cancer | Expression data from gastric tissues: Cancer Samples vs. Matched Adjacent Noncancerous Samples | To elucidate gene expression associated with copy number changes, we performed a genome-wide copy number and expression microarray analysis of 25 pairs of gastric tissues | db=gds:term=gse33335:query=1:qty=2:blobid=NCID_1_2569115_130.14.22.76_9001_1573757527_1385458599_0MetA0_S_MegaStore_F_1:ismultiple=true:min_list=5:max_list=20:def_tree=20:def_list=:def_view=:url=/Taxonomy/backend/subset.cgi?:trace_url=/stat?",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene-set enrichment analysis",
                    "uri": "http://edamontology.org/operation_2436"
                },
                {
                    "term": "Transcriptome assembly",
                    "uri": "http://edamontology.org/operation_3258"
                },
                {
                    "term": "Expression profile pathway mapping",
                    "uri": "http://edamontology.org/operation_0533"
                }
            ]
        }
    ],
    "homepage": "https://www.ncbi.nlm.nih.gov/gds/?term=gse33335",
    "language": [
        "R"
    ],
    "lastUpdate": "2019-11-14T19:59:25Z",
    "name": "GSE33335",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1002/JCP.29177",
            "metadata": {
                "abstract": "© 2019 Wiley Periodicals, Inc.Gastric cancer has the fifth highest incidence of disease and is the third leading cause of cancer-associated mortality in the world. The etiology of gastric cancer is complex and needs to be fully elucidated. Thus, it is necessary to explore potential pathogenic genes and pathways that contribute to gastric cancer. Gene expression profiles of the GSE33335 and GSE54129 datasets were downloaded from the Gene Expression Omnibus database. The differentially expressed genes (DEGs) were compared and identified using R software. The DEGs were then subjected to gene set enrichment analysis and Gene Ontology and Kyoto Encyclopedia of Genes and Genomes pathway enrichment analyses. Survival analyses based on The Cancer Genome Atlas database were used to further screen the essential DEGs. A knockdown assay was performed to determine the function of the candidate gene in gastric cancer. Finally, the association between the candidate gene and immune-related genes was investigated. We found that GPNMB serves as an essential gene, with a high expression level, and predicts a worse outcome of gastric cancer. Knockdown of GPNMB inhibited gastric cancer cell proliferation and migration. In addition, GPNMB may augment the immunosuppressive ability of gastric cancer by recruiting immunosuppressive cells and promoting immune cell exhaustion through PI3K/AKT/CCL4 signaling axis. Collectively, these data suggest that GPNMB acts as an important positive mediator of tumor progression in gastric cancer, and GPNMB could exert multimodality modulation of gastric cancer-mediated immune suppression.",
                "authors": [
                    {
                        "name": "Ren F."
                    },
                    {
                        "name": "Zhao Q."
                    },
                    {
                        "name": "Liu B."
                    },
                    {
                        "name": "Sun X."
                    },
                    {
                        "name": "Tang Y."
                    },
                    {
                        "name": "Huang H."
                    },
                    {
                        "name": "Mei L."
                    },
                    {
                        "name": "Yu Y."
                    },
                    {
                        "name": "Mo H."
                    },
                    {
                        "name": "Dong H."
                    },
                    {
                        "name": "Zheng P."
                    },
                    {
                        "name": "Mi Y."
                    }
                ],
                "date": "2019-01-01T00:00:00Z",
                "journal": "Journal of Cellular Physiology",
                "title": "Transcriptome analysis reveals GPNMB as a potential therapeutic target for gastric cancer"
            },
            "pmid": "31498430"
        }
    ],
    "topic": [
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        }
    ]
}