
{
    "credit": [
        {
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://publichealth.yale.edu/people/hongyu_zhao-1.profile"
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://genocanyon.med.yale.edu/GenoWAP"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Nucleic acid feature detection",
                    "uri": "http://edamontology.org/operation_0415"
                },
                {
                    "term": "Pathway or network analysis",
                    "uri": "http://edamontology.org/operation_2497"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Python"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Desktop application"
        ],
        "topic": [
            {
                "term": "Statistics and probability",
                "uri": "http://edamontology.org/topic_2269"
            },
            {
                "term": "Pathology",
                "uri": "http://edamontology.org/topic_0634"
            },
            {
                "term": "Genetics",
                "uri": "http://edamontology.org/topic_3053"
            },
            {
                "term": "GWAS study",
                "uri": "http://edamontology.org/topic_3517"
            },
            {
                "term": "Sequence analysis",
                "uri": "http://edamontology.org/topic_0080"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/genowap-genome-wide-association-prioritizer.html"
        }
    ],
    "publication": [
        {
            "abstract": "© 2015 The Author 2015. Published by Oxford University Press. All rights reserved. Motivation: Genome-wide association study (GWAS) has been a great success in the past decade. However, significant challenges still remain in both identifying new risk loci and interpreting results. Bonferroni-corrected significance level is known to be conservative, leading to insufficient statistical power when the effect size is moderate at risk locus. Complex structure of linkage disequilibrium also makes it challenging to separate causal variants from nonfunctional ones in large haplotype blocks. Under such circumstances, a computational approach that may increase signal replication rate and identify potential functional sites among correlated markers is urgently needed. Results: We describe GenoWAP, a GWAS signal prioritization method that integrates genomic functional annotation and GWAS test statistics. The effectiveness of GenoWAP is demonstrated through its applications to Crohn's disease and schizophrenia using the largest studies available, where highly ranked loci show substantially stronger signals in the whole dataset after prioritization based on a subset of samples. At the single nucleotide polymorphism (SNP) level, top ranked SNPs after prioritization have both higher replication rates and consistently stronger enrichment of eQTLs. Within each risk locus, GenoWAP may be able to distinguish functional sites from groups of correlated SNPs. Availability and implementation: GenoWAP is freely available on the web at http://genocanyon.med.yale.edu/GenoWAP Supplementary information: Supplementary data are available at Bioinformatics online.",
            "authors": [
                "Lu Q.",
                "Yao X.",
                "Hu Y.",
                "Zhao H."
            ],
            "cit_count": 16,
            "journal": "Bioinformatics",
            "pmid": "26504140",
            "title": "GenoWAP: GWAS signal prioritization through integrated analysis of genomic functional annotation",
            "year": "2015-09-15"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:genowap",
        "biotoolsID": "genowap",
        "description": "Post-GWAS prioritization method that integrates genomic functional annotation and GWAS test statistics. After prioritization, real disease-associated loci become easier to be identified.",
        "homepage": "http://genocanyon.med.yale.edu/GenoWAP",
        "name": "GenoWAP"
    }
}