{
    "additionDate": "2021-01-18T09:26:27Z",
    "biotoolsCURIE": "biotools:rnaprobe",
    "biotoolsID": "rnaprobe",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "twirecki@genesilico.pl",
            "name": "Tomasz K Wirecki",
            "orcidid": "https://orcid.org/0000-0001-6539-3640",
            "typeEntity": "Person"
        },
        {
            "name": "Janusz M Bujnicki",
            "orcidid": "https://orcid.org/0000-0002-6633-165X",
            "typeEntity": "Person"
        }
    ],
    "description": "a web server for normalization and analysis of RNA structure probing data.\n\nRNAProbe - a web server for normalization and analysis of RNA structure probing data. You can take a (quick) NAP, while we analyze your data :).\n\nSecondary structure prediction based on chemical probing.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Dimethyl",
                    "uri": "http://edamontology.org/operation_3642"
                },
                {
                    "term": "RNA secondary structure prediction",
                    "uri": "http://edamontology.org/operation_0278"
                },
                {
                    "term": "RNA structure prediction",
                    "uri": "http://edamontology.org/operation_2441"
                },
                {
                    "term": "Structure visualisation",
                    "uri": "http://edamontology.org/operation_0570"
                }
            ]
        }
    ],
    "homepage": "https://rnaprobe.genesilico.pl",
    "lastUpdate": "2021-02-07T12:44:17Z",
    "name": "RNAProbe",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1093/NAR/GKAA396",
            "metadata": {
                "abstract": "© The Author(s) 2020. Published by Oxford University Press on behalf of Nucleic Acids Research.RNA molecules play key roles in all living cells. Knowledge of the structural characteristics of RNA molecules allows for a better understanding of the mechanisms of their action. RNA chemical probing allows us to study the susceptibility of nucleotides to chemical modification, and the information obtained can be used to guide secondary structure prediction. These experimental results can be analyzed using various computational tools, which, however, requires additional, tedious steps (e.g., further normalization of the reactivities and visualization of the results), for which there are no fully automated methods. Here, we introduce RNAProbe, a web server that facilitates normalization, analysis, and visualization of the low-pass SHAPE, DMS and CMCT probing results with the modification sites detected by capillary electrophoresis. RNAProbe automatically analyzes chemical probing output data and turns tedious manual work into a one-minute assignment. RNAProbe performs normalization based on a well-established protocol, utilizes recognized secondary structure prediction methods, and generates high-quality images with structure representations and reactivity heatmaps. It summarizes the results in the form of a spreadsheet, which can be used for comparative analyses between experiments. Results of predictions with normalized reactivities are also collected in text files, providing interoperability with bioinformatics workflows. RNAProbe is available at https://rnaprobe.genesilico.pl.",
                "authors": [
                    {
                        "name": "Bernat A."
                    },
                    {
                        "name": "Boniecki M.J."
                    },
                    {
                        "name": "Bujnicki J.M."
                    },
                    {
                        "name": "Merdas K."
                    },
                    {
                        "name": "Stefaniak F."
                    },
                    {
                        "name": "Wirecki T.K."
                    }
                ],
                "citationCount": 2,
                "date": "2021-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "RNAProbe: A web server for normalization and analysis of RNA structure probing data"
            },
            "pmcid": "PMC7319577",
            "pmid": "32504492"
        }
    ],
    "topic": [
        {
            "term": "Nucleic acid structure analysis",
            "uri": "http://edamontology.org/topic_0097"
        },
        {
            "term": "Probes and primers",
            "uri": "http://edamontology.org/topic_0632"
        },
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        },
        {
            "term": "Structure prediction",
            "uri": "http://edamontology.org/topic_0082"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ]
}
