{"credit":[{"email":"nje5@georgetown.edu","name":"Nathan J. Edwards","typeEntity":"Person","typeRoles":["Primary contact"]}],"function":[{"operation":[{"term":"Peptide identification","uri":"http://edamontology.org/operation_3631"}]}],"labels":{"collectionID":["Proteomics"],"toolType":["Web application"],"topic":[{"term":"Proteomics","uri":"http://edamontology.org/topic_0121"}]},"publication":[{"abstract":"The PepArML meta-search peptide identification platform for tandem mass spectra provides a unified search interface to seven search engines; a robust cluster, grid, and cloud computing scheduler for large-scale searches; and an unsupervised, model-free, machinelearning-based result combiner, which selects the best peptide identification for each spectrum, estimates false-discovery rates, and outputs pepXML format identifications. The meta-search platform supports Mascot; Tandem with native, k-score and s-score scoring; OMSSA; MyriMatch; and InsPecT with MS-GF spectral probability scores- reformatting spectral data and constructing search configurations for each search engine on the fly. The combiner selects the best peptide identification for each spectrum based on search engine results and features that model enzymatic digestion, retention time, precursor isotope clusters, mass accuracy, and proteotypic peptide properties, requiring no prior knowledge of feature utility or weighting. The PepArML meta-search peptide identification platform often identifies two to three times more spectra than individual search engines at 10% FDR. © 2013 by John Wiley & Sons, Inc.","authors":["Edwards N.J."],"cit_count":10,"doi":"10.1002/0471250953.bi1323s44","journal":"Current Protocols in Bioinformatics","title":"PepArML: A meta-search peptide identification platform for tandem mass spectra","year":"2013-01-01"}],"summary":{"biotoolsCURIE":"biotools:peparml","biotoolsID":"peparml","description":"Meta-Search peptide identification platform for tandem mass spectra","homepage":"https://edwardslab.bmcb.georgetown.edu/pymsio/","name":"PepArML"}}