{
    "additionDate": "2019-11-14T19:33:24Z",
    "biotoolsCURIE": "biotools:DeepLigand",
    "biotoolsID": "DeepLigand",
    "confidence_flag": "high",
    "credit": [
        {
            "email": "gifford@mit.edu",
            "name": "David K Gifford",
            "typeEntity": "Person"
        }
    ],
    "description": "accurate prediction of MHC class I ligands using peptide embedding | The 5-fold cross-validation split used in the paper can be downloaded from here. The DeepLigand model provided in this repository is trained on all the five folds combined",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Peptide immunogenicity prediction",
                    "uri": "http://edamontology.org/operation_0252"
                }
            ]
        }
    ],
    "homepage": "https://github.com/gifford-lab/DeepLigand",
    "language": [
        "Python"
    ],
    "lastUpdate": "2019-11-14T19:33:24Z",
    "license": "MIT",
    "name": "DeepLigand",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ330",
            "metadata": {
                "abstract": "© 2019 The Author(s) 2019. Published by Oxford University Press.Motivation: The computational modeling of peptide display by class I major histocompatibility complexes (MHCs) is essential for peptide-based therapeutics design. Existing computational methods for peptide-display focus on modeling the peptide-MHC-binding affinity. However, such models are not able to characterize the sequence features for the other cellular processes in the peptide display pathway that determines MHC ligand selection. Results: We introduce a semi-supervised model, DeepLigand that outperforms the state-of-the-art models in MHC Class I ligand prediction. DeepLigand combines a peptide language model and peptide binding affinity prediction to score MHC class I peptide presentation. The peptide language model characterizes sequence features that correspond to secondary factors in MHC ligand selection other than binding affinity. The peptide embedding is learned by pre-training on natural ligands, and can discriminate between ligands and non-ligands in the absence of binding affinity prediction. Although conventional affinity-based models fail to classify peptides with moderate affinities, DeepLigand discriminates ligands from non-ligands with consistently high accuracy.",
                "authors": [
                    {
                        "name": "Zeng H."
                    },
                    {
                        "name": "Gifford D.K."
                    }
                ],
                "citationCount": 2,
                "date": "2019-07-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "DeepLigand: Accurate prediction of MHC class i ligands using peptide embedding"
            },
            "pmcid": "PMC6612839",
            "pmid": "31510651"
        }
    ],
    "topic": [
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Immunoproteins, genes and antigens",
            "uri": "http://edamontology.org/topic_2830"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        }
    ]
}