{
    "accessibility": "Open access",
    "additionDate": "2022-05-17T15:18:33.463056Z",
    "biotoolsCURIE": "biotools:scope_database",
    "biotoolsID": "scope_database",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Changhua Yu",
            "orcidid": "https://orcid.org/0000-0003-4799-4535"
        },
        {
            "name": "Lindsey Guan",
            "orcidid": "https://orcid.org/0000-0001-8934-0762"
        },
        {
            "name": "Naomi K Fox",
            "orcidid": "https://orcid.org/0000-0003-2828-858X"
        },
        {
            "name": "Shiangyi Lin",
            "orcidid": "https://orcid.org/0000-0002-0033-193X"
        },
        {
            "name": "John-Marc Chandonia",
            "orcidid": "https://orcid.org/0000-0002-5153-9079",
            "typeEntity": "Person"
        },
        {
            "name": "Steven E Brenner",
            "orcidid": "https://orcid.org/0000-0001-7559-6185",
            "typeEntity": "Person"
        }
    ],
    "description": "Extended database to facilitate variant interpretation and machine learning.",
    "editPermission": {
        "authors": [
            "sergitobara"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Structure classification",
                    "uri": "http://edamontology.org/operation_2996"
                },
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                },
                {
                    "term": "Variant classification",
                    "uri": "http://edamontology.org/operation_3225"
                }
            ]
        }
    ],
    "homepage": "https://scop.berkeley.edu",
    "lastUpdate": "2022-06-23T14:44:35.162722Z",
    "name": "SCOPe",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1093/NAR/GKAB1054",
            "metadata": {
                "abstract": "© 2022 The Author(s). Published by Oxford University Press on behalf of Nucleic Acids Research.The Structural Classification of Proteins-extended (SCOPe, https://scop.berkeley.edu) knowledgebase aims to provide an accurate, detailed, and comprehensive description of the structural and evolutionary relationships amongst the majority of proteins of known structure, along with resources for analyzing the protein structures and their sequences. Structures from the PDB are divided into domains and classified using a combination of manual curation and highly precise automated methods. In the current release of SCOPe, 2.08, we have developed search and display tools for analysis of genetic variants we mapped to structures classified in SCOPe. In order to improve the utility of SCOPe to automated methods such as deep learning classifiers that rely on multiple alignment of sequences of homologous proteins, we have introduced new machine-parseable annotations that indicate aberrant structures as well as domains that are distinguished by a smaller repeat unit. We also classified structures from 74 of the largest Pfam families not previously classified in SCOPe, and we improved our algorithm to remove N-and C-terminal cloning, expression and purification sequences from SCOPe domains. SCOPe 2.08-stable classifies 106 976 PDB entries (about 60% of PDB entries).",
                "authors": [
                    {
                        "name": "Brenner S.E."
                    },
                    {
                        "name": "Chandonia J.-M."
                    },
                    {
                        "name": "Fox N.K."
                    },
                    {
                        "name": "Guan L."
                    },
                    {
                        "name": "Lin S."
                    },
                    {
                        "name": "Yu C."
                    }
                ],
                "date": "2022-01-07T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "SCOPe: Improvements to the structural classification of proteins-extended database to facilitate variant interpretation and machine learning"
            },
            "pmcid": "PMC8728185",
            "pmid": "34850923"
        },
        {
            "doi": "10.1093/nar/gkt1240",
            "metadata": {
                "abstract": "Structural Classification of Proteins - extended (SCOPe, http://scop.berkeley.edu) is a database of protein structural relationships that extends the SCOP database. SCOP is a manually curated ordering of domains from the majority of proteins of known structure in a hierarchy according to structural and evolutionary relationships. Development of the SCOP 1.x series concluded with SCOP 1.75. The ASTRAL compendium provides several databases and tools to aid in the analysis of the protein structures classified in SCOP, particularly through the use of their sequences. SCOPe extends version 1.75 of the SCOP database, using automated curation methods to classify many structures released since SCOP 1.75. We have rigorously benchmarked our automated methods to ensure that they are as accurate as manual curation, though there are many proteins to which our methods cannot be applied. SCOPe is also partially manually curated to correct some errors in SCOP. SCOPe aims to be backward compatible with SCOP, providing the same parseable files and a history of changes between all stable SCOP and SCOPe releases. SCOPe also incorporates and updates the ASTRAL database. The latest release of SCOPe, 2.03, contains 59 514 Protein Data Bank (PDB) entries, increasing the number of structures classified in SCOP by 55% and including more than 65% of the protein structures in the PDB. © 2013 The Author(s). Published by Oxford University Press.",
                "authors": [
                    {
                        "name": "Brenner S.E."
                    },
                    {
                        "name": "Chandonia J.-M."
                    },
                    {
                        "name": "Fox N.K."
                    }
                ],
                "citationCount": 429,
                "date": "2014-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "SCOPe: Structural Classification of Proteins - Extended, integrating SCOP and ASTRAL data and classification of new structures"
            },
            "pmcid": "PMC3965108",
            "pmid": "24304899"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Gene and protein families",
            "uri": "http://edamontology.org/topic_0623"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Protein folds and structural domains",
            "uri": "http://edamontology.org/topic_0736"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ],
    "validated": 1
}
