{
    "additionDate": "2022-09-30T14:43:31.706199Z",
    "biotoolsCURIE": "biotools:compositeview",
    "biotoolsID": "compositeview",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "cassie.mitchell@bme.gatech.edu",
            "name": "Cassie S. Mitchell",
            "typeEntity": "Person"
        }
    ],
    "description": "This software is designed to visualize data, specifically combined scores data, utilizing graph theory and network analysis concepts.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                },
                {
                    "term": "Network visualisation",
                    "uri": "http://edamontology.org/operation_3925"
                },
                {
                    "term": "Parsing",
                    "uri": "http://edamontology.org/operation_1812"
                },
                {
                    "term": "Scaffolding",
                    "uri": "http://edamontology.org/operation_3216"
                }
            ]
        }
    ],
    "homepage": "https://github.com/pathology-dynamics/composite_view",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-09-30T14:43:31.708620Z",
    "license": "Not licensed",
    "name": "CompositeView",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.3390/BDCC6020066",
            "metadata": {
                "abstract": "© 2022 by the authors. Licensee MDPI, Basel, Switzerland.Large networks are quintessential to bioinformatics, knowledge graphs, social network analysis, and graph-based learning. CompositeView is a Python-based open-source application that improves interactive complex network visualization and extraction of actionable insight. CompositeView utilizes specifically formatted input data to calculate composite scores and display them using the Cytoscape component of Dash. Composite scores are defined representations of smaller sets of conceptually similar data that, when combined, generate a single score to reduce information overload. Visualized interactive results are user-refined via filtering elements such as node value and edge weight sliders and graph manipulation options (e.g., node color and layout spread). The primary difference between CompositeView and other network visualization tools is its ability to auto-calculate and auto-update composite scores as the user interactively filters or aggregates data. CompositeView was developed to visualize network relevance rankings, but it performs well with non-network data. Three disparate CompositeView use cases are shown: relevance rankings from SemNet 2.0, an open-source knowledge graph relationship ranking software for biomedical literaturebased discovery; Human Development Index (HDI) data; and the Framingham cardiovascular study. CompositeView was stress tested to construct reference benchmarks that define breadth and size of data effectively visualized. Finally, CompositeView is compared to Excel, Tableau, Cytoscape, neo4j, NodeXL, and Gephi.",
                "authors": [
                    {
                        "name": "Allegri S.A."
                    },
                    {
                        "name": "McCoy K."
                    },
                    {
                        "name": "Mitchell C.S."
                    }
                ],
                "date": "2022-06-01T00:00:00Z",
                "journal": "Big Data and Cognitive Computing",
                "title": "CompositeView: A Network-Based Visualization Tool"
            },
            "pmcid": "PMC9281616",
            "pmid": "35847767"
        }
    ],
    "toolType": [
        "Command-line tool",
        "Script"
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Mathematics",
            "uri": "http://edamontology.org/topic_3315"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ],
    "validated": 1
}
