{
    "accessibility": "Open access (with restrictions)",
    "additionDate": "2020-01-14T09:32:01Z",
    "biotoolsCURIE": "biotools:APHIRM_toolkit",
    "biotoolsID": "APHIRM_toolkit",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "j.oakman@latrobe.edu.au",
            "name": "Jodi Oakman",
            "orcidid": "https://orcid.org/0000-0002-0484-8442",
            "typeEntity": "Person"
        }
    ],
    "description": "The APHIRM Toolkit is a set of OHS risk management procedures that target both physical and psychosocial hazards. A participative hazard identification and risk management toolkit for improving the risk management of musculoskeletal disorders.",
    "editPermission": {
        "type": "public"
    },
    "homepage": "http://www.aphirm.org.au",
    "lastUpdate": "2021-01-14T15:52:53Z",
    "name": "APHIRM toolkit",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12891-019-2828-1",
            "metadata": {
                "abstract": "Musculoskeletal disorders (MSDs) continue as one of the largest occupational health and safety problems worldwide. One reason for this situation is that current workplace risk management practices fail to meet some important evidence-based requirements for effective reduction of MSD risk. In particular: they largely fail to address risk arising from psychosocial hazards; do not allow sufficient participation by workers; and often fail to control risk at its sources.To address these deficiencies, A Participative Hazard Identification and Risk Management (APHIRM) toolkit has been formulated in accordance with both a framework developed by the World Health Organisation and implementation science principles. It comprises a set of online tools that include automated data analysis and reporting modules, and procedures to guide users through the five stages of the conventional risk management cycle. Importantly, it assesses both hazard and risk levels for groups of people doing a particular job, focusing on the job overall rather than only on tasks deemed to be hazardous. Its intended users are workplace managers and consultants responsible for occupational health and safety, with active participation from workers also. Resultant risk control interventions are customized to address the main physical and psychosocial hazards identified for the target job, and repetitions of the risk management cycle enables ongoing evaluation of outcomes in terms of both hazard and risk levels.",
                "authors": [
                    {
                        "name": "Macdonald W."
                    },
                    {
                        "name": "Oakman J."
                    }
                ],
                "citationCount": 2,
                "date": "2019-10-30T00:00:00Z",
                "journal": "BMC musculoskeletal disorders",
                "title": "The APHIRM toolkit: an evidence-based system for workplace MSD risk management"
            },
            "pmcid": "PMC6822468",
            "pmid": "31666054"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Database management",
            "uri": "http://edamontology.org/topic_3489"
        },
        {
            "term": "Musculoskeletal medicine",
            "uri": "http://edamontology.org/topic_3416"
        },
        {
            "term": "Physics",
            "uri": "http://edamontology.org/topic_3318"
        }
    ],
    "validated": 1
}
