{
    "additionDate": "2021-01-18T10:23:33Z",
    "biotoolsCURIE": "biotools:circlgb",
    "biotoolsID": "circlgb",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "ywchen@stu.edu.cn",
            "name": "Yaowen Chen",
            "typeEntity": "Person"
        },
        {
            "name": "Xianhua Dai",
            "typeEntity": "Person"
        }
    ],
    "description": "circLGB is a machine learning-based framework to discriminate circRNA from other lncRNAs. circLGB integrates commonly used sequence-derived features and three new features containing adenosine to inosine (A-to-I) deamination, A-to-I density and the internal ribosome entry site.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "miRNA target prediction",
                    "uri": "http://edamontology.org/operation_0463"
                },
                {
                    "term": "Sequence feature detection",
                    "uri": "http://edamontology.org/operation_0253"
                },
                {
                    "term": "miRNA expression analysis",
                    "uri": "http://edamontology.org/operation_3792"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Peppags/circLGB-circMRT",
    "language": [
        "Mathematica",
        "Python"
    ],
    "lastUpdate": "2021-02-11T18:56:49Z",
    "name": "circLGB",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.3389/FGENE.2020.00655",
            "metadata": {
                "abstract": "© Copyright © 2020 Zhang, Deng, Liu, Ye, Dai, Chen and Dai.Circular RNA (circRNA) is a closed long non-coding RNA (lncRNA) formed by covalently closed loops through back-splicing. Emerging evidence indicates that circRNA can influence cellular physiology through various molecular mechanisms. Thus, accurate circRNA identification and prediction of its regulatory information are critical for understanding its biogenesis. Although several computational tools based on machine learning have been proposed for circRNA identification, the prediction accuracy remains to be improved. Here, first we present circLGB, a machine learning-based framework to discriminate circRNA from other lncRNAs. circLGB integrates commonly used sequence-derived features and three new features containing adenosine to inosine (A-to-I) deamination, A-to-I density and the internal ribosome entry site. circLGB categorizes circRNAs by utilizing a LightGBM classifier with feature selection. Second, we introduce circMRT, an ensemble machine learning framework to systematically predict the regulatory information for circRNA, including their interactions with microRNA, the RNA binding protein, and transcriptional regulation. Feature sets including sequence-based features, graph features, genome context, and regulatory information features were modeled in circMRT. Experiments on public and our constructed datasets show that the proposed algorithms outperform the available state-of-the-art methods. circLGB is available at http://www.circlgb.com. Source codes are available at https://github.com/Peppags/circLGB-circMRT.",
                "authors": [
                    {
                        "name": "Zhang G."
                    },
                    {
                        "name": "Deng Y."
                    },
                    {
                        "name": "Liu Q."
                    },
                    {
                        "name": "Ye B."
                    },
                    {
                        "name": "Dai Z."
                    },
                    {
                        "name": "Chen Y."
                    },
                    {
                        "name": "Dai X."
                    }
                ],
                "date": "2020-07-21T00:00:00Z",
                "journal": "Frontiers in Genetics",
                "title": "Identifying Circular RNA and Predicting Its Regulatory Interactions by Machine Learning"
            },
            "pmcid": "PMC7396586",
            "pmid": "32849764"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ]
}