{
    "additionDate": "2019-11-14T18:27:34Z",
    "biotoolsCURIE": "biotools:MDRCupid",
    "biotoolsID": "MDRCupid",
    "confidence_flag": "medium",
    "description": "> MEDIUM CONFIDENCE! | > HOMEPAGE MISSING! | A Configurable Metadata Matching Toolbox | Metadata matching is an important step towards integrating heterogeneous healthcare data and facilitating secondary use. MDRCupid supports this step by providing a configurable metadata matching toolbox incorporating lexical and statistical matching approaches. The matching configuration can be adapted to different purposes by manually selecting algorithms and their weights or by using the optimization module with corresponding training data. The toolbox can be accessed as a web service via programming or user interface. For every selected metadata element, the metadata elements with the highest similarity scores are presented to the user and can be manually confirmed via the user interface, while the programming interface uses a similarity threshold to select corresponding elements. An HL7 FHIR ConceptMap is used to save the matches",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                }
            ]
        }
    ],
    "homepage": "https://www.ncbi.nlm.nih.gov/pubmed/?term=31437891",
    "lastUpdate": "2019-11-14T18:27:34Z",
    "name": "MDRCupid",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.3233/SHTI190189",
            "metadata": {
                "abstract": "© 2019 International Medical Informatics Association (IMIA) and IOS Press. This article is published online with Open Access by IOS Press and distributed under the terms of the Creative Commons Attribution Non-Commercial License 4.0 (CC BY-NC 4.0).Metadata matching is an important step towards integrating heterogeneous healthcare data and facilitating secondary use. MDRCupid supports this step by providing a configurable metadata matching toolbox incorporating lexical and statistical matching approaches. The matching configuration can be adapted to different purposes by manually selecting algorithms and their weights or by using the optimization module with corresponding training data. The toolbox can be accessed as a web service via programming or user interface. For every selected metadata element, the metadata elements with the highest similarity scores are presented to the user and can be manually confirmed via the user interface, while the programming interface uses a similarity threshold to select corresponding elements. An HL7 FHIR ConceptMap is used to save the matches. Manually confirmed matches may be used as new training data for the optimizer to improve the matching parameters further.",
                "authors": [
                    {
                        "name": "Deppenwiese N."
                    },
                    {
                        "name": "Duhm-Harbeck P."
                    },
                    {
                        "name": "Ingenerf J."
                    },
                    {
                        "name": "Ulrich H."
                    }
                ],
                "date": "2019-08-21T00:00:00Z",
                "journal": "Studies in Health Technology and Informatics",
                "title": "MDrcupid: A configurable metadata matching toolbox"
            },
            "pmid": "31437891"
        }
    ]
}