{
    "additionDate": "2019-11-14T18:04:31Z",
    "biotoolsCURIE": "biotools:CATT",
    "biotoolsID": "CATT",
    "confidence_flag": "tool",
    "description": "An ultrasensitive T-cell receptor detection method for TCR-Seq and RNA-Seq data | An ultra-sensitive and precise tool for characterizing T cell CDR3 sequences in TCR-seq and RNA-seq data | HomePage: http://bioinfo.life.hust.edu.cn/CATT | An ultra-sensitive and accurate tool for characterizing T cell receptor sequence in bulk and single cell TCR-Seq and RNA-Seq data. The tool can be found in: | CATT(CharActerzing TCR repertoires) is a tool for detecting CDR3 sequences from any TCR containing raw sequencing data (including TCR-seq, RNA-seq, scRNA-seq and any TCR contained sequencing data)",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence trimming",
                    "uri": "http://edamontology.org/operation_3192"
                }
            ]
        }
    ],
    "homepage": "http://bioinfo.life.hust.edu.cn/CATT",
    "language": [
        "Julia"
    ],
    "lastUpdate": "2020-12-10T13:51:37Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/GuoBioinfoLab/CATT"
        }
    ],
    "name": "CATT",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1101/740340"
        },
        {
            "doi": "10.1093/bioinformatics/btaa432",
            "metadata": {
                "abstract": "© The Author(s) 2020. Published by Oxford University Press. All rights reserved. For permissions, please e-mail: journals.permissions@oup.comMotivation: T-cell receptors (TCRs) function to recognize antigens and play vital roles in T-cell immunology. Surveying TCR repertoires by characterizing complementarity-determining region 3 (CDR3) is a key issue. Due to the high diversity of CDR3 and technological limitation, accurate characterization of CDR3 repertoires remains a great challenge. Results: We propose a computational method named CATT for ultra-sensitive and precise TCR CDR3 sequences detection. CATT can be applied on TCR sequencing, RNA-Seq and single-cell TCR(RNA)-Seq data to characterize CDR3 repertoires. CATT integrated de Bruijn graph-based micro-assembly algorithm, data-driven error correction model and Bayesian inference algorithm, to self-adaptively and ultra-sensitively characterize CDR3 repertoires with high performance. Benchmark results of datasets from in silico and experimental data demonstrated that CATT showed superior recall and precision compared with existing tools, especially for data with short read length and small size and single-cell sequencing data. Thus, CATT will be a useful tool for TCR analysis in researches of cancer and immunology. Availability and implementation: http://bioinfo.life.hust.edu.cn/CATT or https://github.com/GuoBioinfoLab/CATT.",
                "authors": [
                    {
                        "name": "Chen S.-Y."
                    },
                    {
                        "name": "Guo A.-Y."
                    },
                    {
                        "name": "Liu C.-J."
                    },
                    {
                        "name": "Zhang Q."
                    }
                ],
                "citationCount": 3,
                "date": "2020-08-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "An ultra-sensitive T-cell receptor detection method for TCR-Seq and RNA-Seq data"
            },
            "pmid": "32399561"
        }
    ],
    "topic": [
        {
            "term": "Immunoproteins and antigens",
            "uri": "http://edamontology.org/topic_2830"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ],
    "validated": 1
}
