{
    "additionDate": "2024-01-22T12:12:33.076145Z",
    "biotoolsCURIE": "biotools:isonform",
    "biotoolsID": "isonform",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "ksahlin@math.su.se",
            "name": "Kristoffer Sahlin",
            "orcidid": "https://orcid.org/0000-0001-7378-2320",
            "typeEntity": "Person"
        }
    ],
    "description": "Reference-free transcriptome reconstruction from Oxford Nanopore data.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Alternative splicing prediction",
                    "uri": "http://edamontology.org/operation_0264"
                },
                {
                    "term": "Read mapping",
                    "uri": "http://edamontology.org/operation_3198"
                },
                {
                    "term": "Splice site prediction",
                    "uri": "http://edamontology.org/operation_0433"
                }
            ]
        }
    ],
    "homepage": "https://github.com/aljpetri/isONform",
    "language": [
        "Python",
        "Shell"
    ],
    "lastUpdate": "2024-01-22T12:12:33.078696Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/aljpetri/isONform_analysis"
        }
    ],
    "name": "isONform",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAD264",
            "metadata": {
                "abstract": "Motivation: With advances in long-read transcriptome sequencing, we can now fully sequence transcripts, which greatly improves our ability to study transcription processes. A popular long-read transcriptome sequencing technique is Oxford Nanopore Technologies (ONT), which through its cost-effective sequencing and high throughput, has the potential to characterize the transcriptome in a cell. However, due to transcript variability and sequencing errors, long cDNA reads need substantial bioinformatic processing to produce a set of isoform predictions from the reads. Several genome and annotation-based methods exist to produce transcript predictions. However, such methods require high-quality genomes and annotations and are limited by the accuracy of long-read splice aligners. In addition, gene families with high heterogeneity may not be well represented by a reference genome and would benefit from reference-free analysis. Reference-free methods to predict transcripts from ONT, such as RATTLE, exist, but their sensitivity is not comparable to reference-based approaches. Results: We present isONform, a high-sensitivity algorithm to construct isoforms from ONT cDNA sequencing data. The algorithm is based on iterative bubble popping on gene graphs built from fuzzy seeds from the reads. Using simulated, synthetic, and biological ONT cDNA data, we show that isONform has substantially higher sensitivity than RATTLE albeit with some loss in precision. On biological data, we show that isONform's predictions have substantially higher consistency with the annotation-based method StringTie2 compared with RATTLE. We believe isONform can be used both for isoform construction for organisms without well-annotated genomes and as an orthogonal method to verify predictions of reference-based methods. Availability and implementation: https://github.com/aljpetri/isONform.",
                "authors": [
                    {
                        "name": "Petri A.J."
                    },
                    {
                        "name": "Sahlin K."
                    }
                ],
                "citationCount": 1,
                "date": "2023-06-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "isONform: reference-free transcriptome reconstruction from Oxford Nanopore data"
            },
            "pmcid": "PMC10311309",
            "pmid": "37387174",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ]
}
