{
    "accessibility": "Open access",
    "additionDate": "2019-06-21T07:56:02Z",
    "biotoolsCURIE": "biotools:MIGRATE",
    "biotoolsID": "MIGRATE",
    "cost": "Free of charge",
    "credit": [
        {
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://peterbeerli.com/migrate-html5/contact.html"
        }
    ],
    "description": "Estimates effective population sizes,past migration rates between n population assuming a migration matrix model with asymmetric migration rates and different subpopulation sizes, and population divergences or admixture.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://peterbeerli.com/migrate-html5/about.html"
        },
        {
            "note": "Tutorial material",
            "type": [
                "Training material"
            ],
            "url": "https://peterbeerli.com/migrate-html5/tutorials.html"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "https://peterbeerli.com/migrate-html5/download_version3/",
            "version": "3.x"
        },
        {
            "type": "Source code",
            "url": "https://peterbeerli.com/migrate-html5/download_version4/",
            "version": "4.x"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Haplotype mapping",
                    "uri": "http://edamontology.org/operation_0487"
                },
                {
                    "term": "Phylogenetic tree generation (maximum likelihood and Bayesian methods)",
                    "uri": "http://edamontology.org/operation_0547"
                },
                {
                    "term": "Cell migration analysis",
                    "uri": "http://edamontology.org/operation_3446"
                }
            ]
        }
    ],
    "homepage": "https://peterbeerli.com/migrate-html5/index.html",
    "language": [
        "Perl"
    ],
    "lastUpdate": "2020-06-16T10:55:23Z",
    "license": "MIT",
    "maturity": "Mature",
    "name": "MIGRATE",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "Ruta",
    "publication": [
        {
            "doi": "10.1534/genetics.109.112532",
            "metadata": {
                "abstract": "For many biological investigations, groups of individuals are genetically sampled from several geographic locations. These sampling locations often do not reflect the genetic population structure. We describe a framework using marginal likelihoods to compare and order structured population models, such as testing whether the sampling locations belong to the same randomly mating population or comparing unidirectional and multidirectional gene flow models. In the context of inferences employing Markov chain Monte Carlo methods, the accuracy of the marginal likelihoods depends heavily on the approximation method used to calculate the marginal likelihood. Two methods, modified thermodynamic integration and a stabilized harmonic mean estimator, are compared. With finite Markov chain Monte Carlo run lengths, the harmonic mean estimator may not be consistent. Thermodynamic integration, in contrast, delivers considerably better estimates of the marginal likelihood. The choice of prior distributions does not influence the order and choice of the better models when the marginal likelihood is estimated using thermodynamic integration, whereas with the harmonic mean estimator the influence of the prior is pronounced and the order of the models changes. The approximation of marginal likelihood using thermodynamic integration in MIGRATE allows the evaluation of complex population genetic models, not only of whether sampling locations belong to a single panmictic population, but also of competing complex structured population models. Copyright © 2010 by the Genetics Society of America.",
                "authors": [
                    {
                        "name": "Beerli P."
                    },
                    {
                        "name": "Palczewski M."
                    }
                ],
                "citationCount": 409,
                "date": "2010-05-01T00:00:00Z",
                "journal": "Genetics",
                "title": "Unified framework to evaluate panmixia and migration direction among multiple sampling locations"
            },
            "type": [
                "Primary"
            ]
        },
        {
            "doi": "10.1073/pnas.1810239116",
            "metadata": {
                "abstract": "© 2019 National Academy of Sciences. All Rights Reserved.An approach to the coalescent, the fractional coalescent (f - coalescent), is introduced. The derivation is based on the discretetime Cannings population model in which the variance of the number of offspring depends on the parameter α. This additional parameter α affects the variability of the patterns of the waiting times; values of α<1 lead to an increase of short time intervals, but occasionally allow for very long time intervals. When α = 1, the f-coalescent and the Kingman's n-coalescent are equivalent. The distribution of the time to the most recent common ancestor and the probability that n genes descend from m ancestral genes in a time interval of length T for the f-coalescent are derived. The f-coalescent has been implemented in the population genetic model inference software MIGRATE. Simulation studies suggest that it is possible to accurately estimate α values from data that were generated with known α values and that the f-coalescent can detect potential environmental heterogeneity within a population. Bayes factor comparisons of simulated data with α<1 and real data (H1N1 influenza and malaria parasites) showed an improved model fit of the f-coalescent over the n-coalescent. The development of the f-coalescent and its inclusion into the inference program MIGRATE facilitates testing for deviations from the n-coalescent.",
                "authors": [
                    {
                        "name": "Mashayekhi S."
                    },
                    {
                        "name": "Beerli P."
                    }
                ],
                "date": "2019-01-01T00:00:00Z",
                "journal": "Proceedings of the National Academy of Sciences of the United States of America",
                "title": "Fractional coalescent"
            },
            "pmcid": "PMC6442577",
            "pmid": "30867282",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Population genetics",
            "uri": "http://edamontology.org/topic_3056"
        },
        {
            "term": "Nucleic acid structure analysis",
            "uri": "http://edamontology.org/topic_0097"
        },
        {
            "term": "Zoology",
            "uri": "http://edamontology.org/topic_3500"
        }
    ],
    "validated": 1
}