{
    "additionDate": "2021-03-19T09:19:33Z",
    "biotoolsCURIE": "biotools:cnnathubi",
    "biotoolsID": "cnnathubi",
    "confidence_flag": "tool",
    "credit": [
        {
            "name": "Xiaofeng Wang",
            "orcidid": "https://orcid.org/0000-0002-4904-427X",
            "typeEntity": "Person"
        },
        {
            "name": "Renxiang Yan",
            "typeEntity": "Person"
        }
    ],
    "description": "CNNAthUbi is a tool for ubiquitination site prediction for Arabidopsis Thaliana using convolutional neural networks (CNNs).",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "PTM site prediction",
                    "uri": "http://edamontology.org/operation_0417"
                }
            ]
        }
    ],
    "homepage": "http://github.com/nongdaxiaofeng/CNNAthUbi",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-04-26T08:27:41.913250Z",
    "name": "CNNAthUbi",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1007/S11103-020-01112-W",
            "metadata": {
                "abstract": "© 2021, The Author(s), under exclusive licence to Springer Nature B.V. part of Springer Nature.Key message: We developed two CNNs for predicting ubiquitination sites in Arabidopsis thaliana, demonstrated their competitive performance, analyzed amino acid physicochemical properties and the CNN structures, and predicted ubiquitination sites in Arabidopsis. Abstract: As an important posttranslational protein modification, ubiquitination plays critical roles in plant physiology, including plant growth and development, biotic and abiotic stress, metabolism, and so on. A lot of ubiquitination site prediction models have been developed for human, mouse and yeast. However, there are few models to predict ubiquitination sites for the plant Arabidopsis thaliana. Based on this context, we proposed two convolutional neural network (CNN) based models for predicting ubiquitination sites in A. thaliana. The two models reach AUC (area under the ROC curve) values of 0.924 and 0.913 respectively in five-fold cross-validation, and 0.921 and 0.914 respectively in independent test, which outperform other models and demonstrate the competitive edge of them. We in-depth analyze the amino acid physicochemical properties in the neighboring sequence regions of the ubiquitination sites, and study the influence of the CNN structure to the prediction performance. Potential ubiquitination sites in the global Arbidopsis proteome are predicted using the two CNN models. To facilitate the community, the source code, training and test dataset, predicted ubiquitination sites in the Arbidopsis proteome are available at GitHub (http://github.com/nongdaxiaofeng/CNNAthUbi) for interest users.",
                "authors": [
                    {
                        "name": "Wang X."
                    },
                    {
                        "name": "Yan R."
                    },
                    {
                        "name": "Chen Y.-Z."
                    },
                    {
                        "name": "Wang Y."
                    }
                ],
                "date": "2021-04-01T00:00:00Z",
                "journal": "Plant Molecular Biology",
                "title": "Computational identification of ubiquitination sites in Arabidopsis thaliana using convolutional neural networks"
            },
            "pmid": "33527202"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        }
    ]
}