{
    "accessibility": "Open access",
    "additionDate": "2022-08-21T14:44:11.523109Z",
    "biotoolsCURIE": "biotools:opensim",
    "biotoolsID": "opensim",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "gc@umass.edu",
            "name": "Graham E. Caldwell"
        },
        {
            "email": "jbanks3@bidmc.harvard.edu",
            "name": "Jacob J. Banks"
        },
        {
            "email": "umberger@umich.edu",
            "name": "Brian R. Umberger"
        }
    ],
    "description": "A model for estimating lower back kinetics in gait.",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://simtk.org/projects/emg_opt_tool",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2024-11-24T15:47:46.862052Z",
    "license": "MIT",
    "name": "OpenSim",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1016/j.medengphy.2022.103790",
            "metadata": {
                "abstract": "Participant-specific musculoskeletal models are needed to accurately estimate lower back internal kinetic demands and injury risk. In this study we developed the framework for incorporating an electromyography optimization (EMGopt) approach within OpenSim (https://simtk.org/projects/emg_opt_tool) and evaluated lower back demands estimated from the model during gait. Kinematic, external kinetic, and EMG data were recorded from six participants as they performed walking and carrying tasks on a treadmill. For evaluation, predicted lumbar vertebral joint forces were compared to those from a generic static optimization approach (SOpt) and to previous studies. Further, model-estimated muscle activations were compared to recorded EMG, and model sensitivity to day-to-day EMG variability was evaluated. Results showed the vertebral joint forces from the model were qualitatively similar in pattern and magnitude to literature reports. Compared to SOpt, the EMGopt approach predicted larger joint loads (p<.01) with muscle activations better matching individual participant EMG patterns. L5/S1 vertebral joint forces from EMGopt were sensitive to the expected variability of recorded EMG, but the magnitude of these differences (±4%) did not impact between-task comparisons. Despite limitations inherent to such models, the proposed musculoskeletal model and EMGopt approach appears well-suited for evaluating internal lower back demands during gait tasks.",
                "authors": [
                    {
                        "name": "Banks J.J."
                    },
                    {
                        "name": "Caldwell G.E."
                    },
                    {
                        "name": "Umberger B.R."
                    }
                ],
                "citationCount": 16,
                "date": "2022-05-01T00:00:00Z",
                "journal": "Medical Engineering and Physics",
                "title": "EMG optimization in OpenSim: A model for estimating lower back kinetics in gait"
            },
            "pmid": "35500997"
        }
    ],
    "toolType": [
        "Workbench"
    ],
    "topic": [
        {
            "term": "Human biology",
            "uri": "http://edamontology.org/topic_2815"
        },
        {
            "term": "Literature and language",
            "uri": "http://edamontology.org/topic_3068"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        }
    ],
    "validated": 1
}
