{
    "accessibility": "Open access",
    "additionDate": "2022-10-27T10:39:34.694911Z",
    "biotoolsCURIE": "biotools:bdetools",
    "biotoolsID": "bdetools",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "o.e.akman@exeter.ac.uk",
            "name": "Ozgur E Akman",
            "typeEntity": "Person"
        },
        {
            "name": "Benjamin J Wareham"
        },
        {
            "name": "Kevin Doherty"
        }
    ],
    "description": "A MATLAB Package for Boolean Delay Equation Modeling.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Gene regulatory network analysis",
                    "uri": "http://edamontology.org/operation_1781"
                },
                {
                    "term": "Modelling and simulation",
                    "uri": "http://edamontology.org/operation_2426"
                }
            ]
        }
    ],
    "homepage": "https://github.com/oeakman/BDEtools",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2024-11-24T15:26:00.510618Z",
    "license": "MIT",
    "name": "BDEtools",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1089/cmb.2021.0658",
            "metadata": {
                "abstract": "Boolean Delay Equations (BDEs) can simulate surprisingly complex behavior, despite their relative simplicity. In addition to steady-state dynamics, BDEs can also generate periodic and quasiperiodic oscillations, m:n frequency locking, and even chaos. Further, the enumerability of Boolean update functions and their compact parametrization means that BDEs can be leveraged to generate low-level descriptions of biological networks, from which more detailed formulations (e.g., differential equation models) can be constructed. However, although several studies have demonstrated the utility of BDE modeling in computational biology, a current barrier to the wider adoption of the BDE approach is the absence of freely available simulation software. In this work, we present BDEtools - an open-source MATLAB package for numerically solving BDE models. After giving a brief introduction to BDE modeling, we describe the package's solver algorithms, together with several utility functions that can be used to provide solver inputs and to process solver outputs. We also demonstrate the functionality of BDEtools by illustrating its application to an established model of a gene regulatory network that controls circadian rhythms. BDEtools makes it straightforward for researchers to quickly build reliable BDE models of biological networks. We hope that its ease of use and free availability will encourage more researchers to explore BDE formulations of their systems of interest. Through the continued use of BDEs by the computational biology community, we will, no doubt, discover their potential applicability to a broader class of biological networks.",
                "authors": [
                    {
                        "name": "Akman O.E."
                    },
                    {
                        "name": "Doherty K."
                    },
                    {
                        "name": "Wareham B.J."
                    }
                ],
                "date": "2023-01-01T00:00:00Z",
                "journal": "Journal of Computational Biology",
                "title": "BDEtools: A MATLAB Package for Boolean Delay Equation Modeling"
            },
            "pmid": "36099206"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Biology",
            "uri": "http://edamontology.org/topic_3070"
        },
        {
            "term": "Computer science",
            "uri": "http://edamontology.org/topic_3316"
        },
        {
            "term": "Mathematics",
            "uri": "http://edamontology.org/topic_3315"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ],
    "validated": 1
}
