{
    "accessibility": "Open access",
    "additionDate": "2022-07-29T22:05:06.254446Z",
    "biotoolsCURIE": "biotools:fod-net",
    "biotoolsID": "fod-net",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "chenyu.wang@sydney.edu.au",
            "name": "Chenyu Wang",
            "orcidid": "https://orcid.org/0000-0001-7135-7662"
        },
        {
            "name": "Fernando Calamante",
            "orcidid": "https://orcid.org/0000-0002-7550-3142"
        },
        {
            "name": "He Wang",
            "orcidid": "https://orcid.org/0000-0002-2053-9439"
        },
        {
            "name": "Jinglei Lv",
            "orcidid": "https://orcid.org/0000-0002-4906-2646"
        }
    ],
    "description": "A deep learning method for fiber orientation distribution angular super resolution.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Validation",
                    "uri": "http://edamontology.org/operation_2428"
                }
            ]
        }
    ],
    "homepage": "https://github.com/ruizengalways/FOD-Net",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-07-29T22:05:06.257705Z",
    "license": "CC-BY-NC-SA-4.0",
    "name": "FOD-Net",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1016/J.MEDIA.2022.102431",
            "metadata": {
                "abstract": "© 2022 Elsevier B.V.Mapping the human connectome using fiber-tracking permits the study of brain connectivity and yields new insights into neuroscience. However, reliable connectome reconstruction using diffusion magnetic resonance imaging (dMRI) data acquired by widely available clinical protocols remains challenging, thus limiting the connectome/tractography clinical applications. Here we develop fiber orientation distribution (FOD) network (FOD-Net), a deep-learning-based framework for FOD angular super-resolution. Our method enhances the angular resolution of FOD images computed from common clinical-quality dMRI data, to obtain FODs with quality comparable to those produced from advanced research scanners. Super-resolved FOD images enable superior tractography and structural connectome reconstruction from clinical protocols. The method was trained and tested with high-quality data from the Human Connectome Project (HCP) and further validated with a local clinical 3.0T scanner as well as with another public available multicenter-multiscanner dataset. Using this method, we improve the angular resolution of FOD images acquired with typical single-shell low-angular-resolution dMRI data (e.g., 32 directions, b=1000 s/mm2) to approximate the quality of FODs derived from time-consuming, multi-shell high-angular-resolution dMRI research protocols. We also demonstrate tractography improvement, removing spurious connections and bridging missing connections. We further demonstrate that connectomes reconstructed by super-resolved FODs achieve comparable results to those obtained with more advanced dMRI acquisition protocols, on both HCP and clinical 3.0T data. Advances in deep-learning approaches used in FOD-Net facilitate the generation of high quality tractography/connectome analysis from existing clinical MRI environments. Our code is freely available at https://github.com/ruizengalways/FOD-Net.",
                "authors": [
                    {
                        "name": "Barnett M."
                    },
                    {
                        "name": "Calamante F."
                    },
                    {
                        "name": "Lv J."
                    },
                    {
                        "name": "Wang C."
                    },
                    {
                        "name": "Wang H."
                    },
                    {
                        "name": "Zeng R."
                    },
                    {
                        "name": "Zhou L."
                    }
                ],
                "date": "2022-07-01T00:00:00Z",
                "journal": "Medical Image Analysis",
                "title": "FOD-Net: A deep learning method for fiber orientation distribution angular super resolution"
            },
            "pmid": "35397471"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        },
        {
            "term": "Neurobiology",
            "uri": "http://edamontology.org/topic_3304"
        }
    ],
    "validated": 1
}
