{
    "additionDate": "2018-07-28T10:24:34Z",
    "biotoolsCURIE": "biotools:strscan",
    "biotoolsID": "strscan",
    "credit": [
        {
            "email": "hatang@indiana.edu",
            "name": "Haixu Tang",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Targeted profiling of short tandem repeats in whole-genome sequencing data.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Repeat sequence detection",
                    "uri": "http://edamontology.org/operation_0379"
                }
            ]
        }
    ],
    "homepage": "http://darwin.informatics.indiana.edu/str/",
    "lastUpdate": "2018-12-10T12:59:00Z",
    "name": "STRScan",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "migle_sur",
    "publication": [
        {
            "doi": "10.1186/s12859-017-1800-z",
            "metadata": {
                "abstract": "© 2017 The Author(s).Background: Short tandem repeats (STRs) are found in many prokaryotic and eukaryotic genomes, and are commonly used as genetic markers, in particular for identity and parental testing in DNA forensics. The unstable expansion of some STRs was associated with various genetic disorders (e.g., the Huntington disease), and thus was used in genetic testing for screening individuals at high risk. Traditional STR analyses were based on the PCR amplification of STR loci followed by gel electrophoresis. With the availability of massive whole genome sequencing data, it becomes practical to mine STR profiles in silico from genome sequences. Software tools such as lobSTR and STR-FM have been developed to address these demands, which are, however, built upon whole genome reads mapping tools, and thus may not be sensitive enough. Results: In this paper, we present a standalone software tool STRScan that uses a greedy algorithm for targeted STR profiling in next-generation sequencing (NGS) data. STRScan was tested on the whole genome sequencing data from Venter genome sequencing and 1000 Genomes Project. The results showed that STRScan can profile 20% more STRs in the target set that are missed by lobSTR. Conclusion: STRScan is particularly useful for the NGS-based targeted STR profiling, e.g., in genetic and human identity testing. STRScan is available as open-source software at http://darwin.informatics.indiana.edu/str/.",
                "authors": [
                    {
                        "name": "Nzabarushimana E."
                    },
                    {
                        "name": "Tang H."
                    }
                ],
                "citationCount": 8,
                "date": "2017-10-03T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "STRScan: Targeted profiling of short tandem repeats in whole-genome sequencing data"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "Whole genome sequencing",
            "uri": "http://edamontology.org/topic_3673"
        }
    ],
    "validated": 1
}
