{
    "additionDate": "2017-08-03T18:44:34Z",
    "biotoolsCURIE": "biotools:gpcr-ca",
    "biotoolsID": "gpcr-ca",
    "collectionID": [
        "Proteomics"
    ],
    "credit": [
        {
            "email": "jdzxiaoxuan@163.com",
            "name": "Xuan Xiao",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.jci-bioinfo.cn/"
        }
    ],
    "description": "2-layer predictor: the 1st layer prediction engine is for identifying a query protein sequence as GPCR on non-GPCR; if it is a GPCR protein, the process will be automatically continued with the 2nd-layer prediction engine to further identify its type among the following six main functional classes: (1) rhodopsin-like, (2) secretin-like, (3) metabotrophic/glutamate/pheromone, (4) fungal pheromone, (5) cAMP receptor, and (6) Frizzled/Smoothemed family",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://www.jci-bioinfo.cn/GPCR/gpcrca_readme.jsp"
        }
    ],
    "editPermission": {
        "authors": [
            "proteomics.bio.tools"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Prediction and recognition",
                    "uri": "http://edamontology.org/operation_2423"
                }
            ]
        }
    ],
    "homepage": "http://www.jci-bioinfo.cn/GPCR-CA",
    "lastUpdate": "2024-11-25T14:15:21.577523Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/gpcr-ca-predicting-gpcr-classification.html"
        }
    ],
    "name": "GPCR-CA",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1002/jcc.21163",
            "metadata": {
                "abstract": "Given an uncharacterized protein sequence, how can we identify whether it is a G-protein-coupled receptor (GPCR) or not? If it is, which functional family class does it belong to? It is important to address these questions because GPCRs are among the most frequent targets of therapeutic drugs and the information thus obtained is very useful for \"comparative and evolutionary pharmacology,\" a technique often used for drug development. Here, we present a web-server predictor called \"GPCR-CA,\" where \"CA\" stands for \"Cellular Automaton\" (Wolfram, S. Nature 1984, 311, 419), meaning that the CA images have been utilized to reveal the pattern features hidden in piles of long and complicated protein sequences. Meanwhile, the gray-level co-occurrence matrix factors extracted from the CA images are used to represent the samples of proteins through their pseudo amino acid composition (Chou, K.C. Proteins 2001, 43, 246). GPCR-CA is a two-layer predictor: the first layer prediction engine is for identifying a query protein as GPCR on non-GPCR; if it is a GPCR protein, the process will be automatically continued with the second-layer prediction engine to further identify its type among the following six functional classes: (a) rhodopsin-like, (b) secretin-like, (c) metabotrophic/glutamate/pheromone; (d) fungal pheromone, (e) cAMP receptor, and (f) frizzled/smoothened family. The overall success rates by the predictor for the first and second layers are over 91% and 83%, respectively, that were obtained through rigorous jackknife cross-validation tests on a new-constructed stringent benchmark dataset in which none of proteins has ≥40% pairwise sequence identity to any other in a same subset. GPCR-CA is freely accessible at http://218.65.61.89:8080/bioinfo/GPCR-CA, by which one can get the desired two-layer results for a query protein sequence within about 20 seconds. © 2008 Wiley Periodicals, Inc.",
                "authors": [
                    {
                        "name": "Chou K.-C."
                    },
                    {
                        "name": "Wang P."
                    },
                    {
                        "name": "Xiao X."
                    }
                ],
                "citationCount": 198,
                "date": "2009-07-15T00:00:00Z",
                "journal": "Journal of Computational Chemistry",
                "title": "GPCR-CA: A cellular automaton image approach for predicting G-protein-coupled receptor functional classes"
            },
            "pmid": "19037861"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Structure prediction",
            "uri": "http://edamontology.org/topic_0082"
        }
    ],
    "validated": 1
}
