{
    "name": "misFinder", 
    "description": "Tool that aims to identify the assembly errors with high accuracy in an unbiased way and correct these errors at their mis-assembled positions to improve the assembly accuracy for downstream analysis.", 
    "homepage": "https://github.com/hitbio/misFinder", 
    "biotoolsID": "misFinder", 
    "biotoolsCURIE": "biotools:misFinder", 
    "version": [], 
    "otherID": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_0310", 
                    "term": "Sequence assembly"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }, 
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_2945", 
                    "term": "Analysis"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Command-line tool"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_0196", 
            "term": "Sequence assembly"
        }, 
        {
            "uri": "http://edamontology.org/topic_3572", 
            "term": "Data quality management"
        }, 
        {
            "uri": "http://edamontology.org/topic_0080", 
            "term": "Sequence analysis"
        }
    ], 
    "operatingSystem": [
        "Linux"
    ], 
    "language": [
        "C"
    ], 
    "license": null, 
    "collectionID": [], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [
        {
            "url": "http://www.mybiosoftware.com/misfinder-identify-mis-assemblies-in-an-unbiased-manner-using-reference-and-paired-end-reads.html", 
            "type": "Registry", 
            "note": null
        }
    ], 
    "download": [], 
    "documentation": [
        {
            "url": "https://github.com/hitbio/misFinder/blob/master/README", 
            "type": "General", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": null, 
            "pmid": "26573684", 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "misFinder: Identify mis-assemblies in an unbiased manner using reference and paired-end reads", 
                "abstract": "© 2015 Zhu et al. Background: Because of the short read length of high throughput sequencing data, assembly errors are introduced in genome assembly, which may have adverse impact to the downstream data analysis. Several tools have been developed to eliminate these errors by either 1) comparing the assembled sequences with some similar reference genome, or 2) analyzing paired-end reads aligned to the assembled sequences and determining inconsistent features alone mis-assembled sequences. However, the former approach cannot distinguish real structural variations between the target genome and the reference genome while the latter approach could have many false positive detections (correctly assembled sequence being considered as mis-assembled sequence). Results: We present misFinder, a tool that aims to identify the assembly errors with high accuracy in an unbiased way and correct these errors at their mis-assembled positions to improve the assembly accuracy for downstream analysis. It combines the information of reference (or close related reference) genome and aligned paired-end reads to the assembled sequence. Assembly errors and correct assemblies corresponding to structural variations can be detected by comparing the genome reference and assembled sequence. Different types of assembly errors can then be distinguished from the mis-assembled sequence by analyzing the aligned paired-end reads using multiple features derived from coverage and consistence of insert distance to obtain high confident error calls. Conclusions: We tested the performance of misFinder on both simulated and real paired-end reads data, and misFinder gave accurate error calls with only very few miscalls. And, we further compared misFinder with QUAST and REAPR. misFinder outperformed QUAST and REAPR by 1) identified more true positive mis-assemblies with very few false positives and false negatives, and 2) distinguished the correct assemblies corresponding to structural variations from mis-assembled sequence. misFinder can be freely downloaded from https://github.com/hitbio/misFinder.", 
                "date": "2015-11-16T00:00:00Z", 
                "citationCount": 4, 
                "authors": [
                    {
                        "name": "Zhu X."
                    }, 
                    {
                        "name": "Leung H.C.M."
                    }, 
                    {
                        "name": "Wang R."
                    }, 
                    {
                        "name": "Chin F.Y.L."
                    }, 
                    {
                        "name": "Yiu S.M."
                    }, 
                    {
                        "name": "Quan G."
                    }, 
                    {
                        "name": "Li Y."
                    }, 
                    {
                        "name": "Zhang R."
                    }, 
                    {
                        "name": "Jiang Q."
                    }, 
                    {
                        "name": "Liu B."
                    }, 
                    {
                        "name": "Dong Y."
                    }, 
                    {
                        "name": "Zhou G."
                    }, 
                    {
                        "name": "Wang Y."
                    }
                ], 
                "journal": "BMC Bioinformatics"
            }
        }
    ], 
    "credit": [
        {
            "name": null, 
            "email": "zhuxiao.hit@gmail.com", 
            "url": "https://github.com/hitbio/misFinder", 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "mbs_import", 
    "additionDate": "2017-08-03T19:07:14Z", 
    "lastUpdate": "2018-12-10T12:58:51Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 0, 
    "homepage_status": 0
}