{
    "additionDate": "2016-03-03T13:44:49Z",
    "biotoolsCURIE": "biotools:argot2",
    "biotoolsID": "argot2",
    "credit": [
        {
            "name": "ELIXIR-ITA-PADOVA",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        },
        {
            "email": "stefano.toppo@unipd.it",
            "name": "Stefano Toppo",
            "orcidid": "http://orcid.org/0000-0002-0246-3119",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.medcomp.medicina.unipd.it/stefano"
        }
    ],
    "description": "Annotation Retrieval of Gene Ontology Terms",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://www.medcomp.medicina.unipd.it/Argot2/help/index.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "note": "Argot2 is able to quickly process thousands of sequences for functional inference. The tool exploits a combined approach based on the clustering process of GO terms dependent on their semantic similarities and a weighting scheme which assesses retrieved hits sharing a  certain degree of biological features with the sequence to annotate.  These hits may be obtained by different methods as BLAST, HMMER and so on. In the present web server users are allowed to interact with Argot2 in different ways according to specific needs and expertise. Argot 2 ranked 2nd in CAFA challenge 2010",
            "operation": [
                {
                    "term": "Protein function prediction",
                    "uri": "http://edamontology.org/operation_1777"
                }
            ]
        }
    ],
    "homepage": "http://www.medcomp.medicina.unipd.it/Argot2/",
    "language": [
        "Java",
        "SQL"
    ],
    "lastUpdate": "2018-12-29T13:51:09Z",
    "license": "Other",
    "name": "Argot2",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "ELIXIR-ITA-PADOVA",
    "publication": [
        {
            "doi": "10.1371/journal.pone.0004619",
            "metadata": {
                "abstract": "Background: Large-scale sequencing projects have now become routine lab practice and this has led to the development of a new generation of tools involving function prediction methods, bringing the latter back to the fore. The advent of Gene Ontology, with its structured vocabulary and paradigm, has provided computational biologists with an appropriate means for this task. Methodology: We present here a novel method called ARGOT (Annotation Retrieval of Gene Ontology Terms) that is able to process quickly thousands of sequences for functional inference. The tool exploits for the first time an integrated approach which combines clustering of GO terms, based on their semantic similarities, with a weighting scheme which assesses retrieved hits sharing a certain number of biological features with the sequence to be annotated. These hits may be obtained by different methods and in this work we have based ARGOT processing on BLAST results. Conclusions: The extensive benchmark involved 10,000 protein sequences, the complete S. cerevisiae genome and a small subset of proteins for purposes of comparison with other available tools. The algorithm was proven to outperform existing methods and to be suitable for function prediction of single proteins due to its high degree of sensitivity, specificity and coverage. © 2009 Fontana et al.",
                "authors": [
                    {
                        "name": "Fontana P."
                    },
                    {
                        "name": "Cestaro A."
                    },
                    {
                        "name": "Velasco R."
                    },
                    {
                        "name": "Formentin E."
                    },
                    {
                        "name": "Toppo S."
                    }
                ],
                "citationCount": 30,
                "date": "2009-12-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "Rapid Annotation of Anonymous Sequences from Genome Projects Using Semantic Similarities and a Weighting Scheme in Gene Ontology"
            },
            "pmcid": "PMC2645684",
            "pmid": "19247487",
            "type": [
                "Primary"
            ]
        },
        {
            "metadata": {
                "abstract": "Background: Predicting protein function has become increasingly demanding in the era of next generation sequencing technology. The task to assign a curator-reviewed function to every single sequence is impracticable. Bioinformatics tools, easy to use and able to provide automatic and reliable annotations at a genomic scale, are necessary and urgent. In this scenario, the Gene Ontology has provided the means to standardize the annotation classification with a structured vocabulary which can be easily exploited by computational methods.Results: Argot2 is a web-based function prediction tool able to annotate nucleic or protein sequences from small datasets up to entire genomes. It accepts as input a list of sequences in FASTA format, which are processed using BLAST and HMMER searches vs UniProKB and Pfam databases respectively; these sequences are then annotated with GO terms retrieved from the UniProtKB-GOA database and the terms are weighted using the e-values from BLAST and HMMER. The weighted GO terms are processed according to both their semantic similarity relations described by the Gene Ontology and their associated score. The algorithm is based on the original idea developed in a previous tool called Argot. The entire engine has been completely rewritten to improve both accuracy and computational efficiency, thus allowing for the annotation of complete genomes.Conclusions: The revised algorithm has been already employed and successfully tested during in-house genome projects of grape and apple, and has proven to have a high precision and recall in all our benchmark conditions. It has also been successfully compared with Blast2GO, one of the methods most commonly employed for sequence annotation. The server is freely accessible at http://www.medcomp.medicina.unipd.it/Argot2. © 2012 Falda et al.; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Falda M."
                    },
                    {
                        "name": "Toppo S."
                    },
                    {
                        "name": "Pescarolo A."
                    },
                    {
                        "name": "Lavezzo E."
                    },
                    {
                        "name": "Di Camillo B."
                    },
                    {
                        "name": "Facchinetti A."
                    },
                    {
                        "name": "Cilia E."
                    },
                    {
                        "name": "Velasco R."
                    },
                    {
                        "name": "Fontana P."
                    }
                ],
                "citationCount": 86,
                "date": "2012-03-28T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Argot2: A large scale function prediction tool relying on semantic similarity of weighted Gene Ontology terms"
            },
            "pmid": "22536960",
            "type": [
                "Other"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        }
    ],
    "validated": 1,
    "version": [
        "2.0"
    ]
}