{
    "additionDate": "2017-12-18T00:05:23Z",
    "biotoolsCURIE": "biotools:coval",
    "biotoolsID": "coval",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://sourceforge.net/projects/coval105/"
        }
    ],
    "description": "Coval is designed to minimize the incidence of spurious alignment of short reads, by filtering mismatched reads that remained in alignments after local realignment and error correction of mismatched reads, thereby increasing the calling accuracy of currently available tools for SNP and indel identification.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Filtering",
                    "uri": "http://edamontology.org/operation_3695"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Short read alignment",
                    "uri": "http://edamontology.org/operation_3198"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Read alignment",
                    "uri": "http://edamontology.org/operation_3198"
                }
            ]
        }
    ],
    "homepage": "http://sourceforge.net/projects/coval105/",
    "language": [
        "Perl"
    ],
    "lastUpdate": "2019-01-17T22:42:12Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/coval-1-4-1-improving-the-quality-of-short-read-alignment-data.html"
        }
    ],
    "name": "Coval",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1371/journal.pone.0075402",
            "metadata": {
                "abstract": "Accurate identification of DNA polymorphisms using next-generation sequencing technology is challenging because of a high rate of sequencing error and incorrect mapping of reads to reference genomes. Currently available short read aligners and DNA variant callers suffer from these problems. We developed the Coval software to improve the quality of short read alignments. Coval is designed to minimize the incidence of spurious alignment of short reads, by filtering mismatched reads that remained in alignments after local realignment and error correction of mismatched reads. The error correction is executed based on the base quality and allele frequency at the non-reference positions for an individual or pooled sample. We demonstrated the utility of Coval by applying it to simulated genomes and experimentally obtained short-read data of rice, nematode, and mouse. Moreover, we found an unexpectedly large number of incorrectly mapped reads in 'targeted' alignments, where the whole genome sequencing reads had been aligned to a local genomic segment, and showed that Coval effectively eliminated such spurious alignments. We conclude that Coval significantly improves the quality of short-read sequence alignments, thereby increasing the calling accuracy of currently available tools for SNP and indel identification. Coval is available at http://sourceforge.net/projects/coval105/. © 2013 Kosugi et al.",
                "authors": [
                    {
                        "name": "Kosugi S."
                    },
                    {
                        "name": "Natsume S."
                    },
                    {
                        "name": "Yoshida K."
                    },
                    {
                        "name": "MacLean D."
                    },
                    {
                        "name": "Cano L."
                    },
                    {
                        "name": "Kamoun S."
                    },
                    {
                        "name": "Terauchi R."
                    }
                ],
                "citationCount": 32,
                "date": "2013-10-08T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "Coval: Improving Alignment Quality and Variant Calling Accuracy for Next-Generation Sequencing Data"
            },
            "pmcid": "PMC3792961",
            "pmid": "24116042",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "SNP",
            "uri": "http://edamontology.org/topic_2885"
        }
    ],
    "validated": 1,
    "version": [
        "1.5"
    ]
}