
{
    "credit": [
        {
            "email": "joel.bader@jhu.edu",
            "name": "Joel S. Bader",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "https://baderzone.org/members/"
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "https://bitbucket.org/baderlab/gwis/src/f9b2b5fb59bc30078c51f0730b474199cf650f71/README.txt?at=master&fileviewer=file-view-default"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Statistical modelling",
                    "uri": "http://edamontology.org/operation_3664"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "C"
        ],
        "operatingSystem": [
            "Linux"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Genetics",
                "uri": "http://edamontology.org/topic_3053"
            },
            {
                "term": "Statistics and probability",
                "uri": "http://edamontology.org/topic_2269"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://www.mybiosoftware.com/gwis-1-1-gene-based-test-association.html"
        }
    ],
    "publication": [
        {
            "abstract": "Genome-wide association studies (GWAS) are now used routinely to identify SNPs associated with complex human phenotypes. In several cases, multiple variants within a gene contribute independently to disease risk. Here we introduce a novel Gene-Wide Significance (GWiS) test that uses greedy Bayesian model selection to identify the independent effects within a gene, which are combined to generate a stronger statistical signal. Permutation tests provide p-values that correct for the number of independent tests genome-wide and within each genetic locus. When applied to a dataset comprising 2.5 million SNPs in up to 8,000 individuals measured for various electrocardiography (ECG) parameters, this method identifies more validated associations than conventional GWAS approaches. The method also provides, for the first time, systematic assessments of the number of independent effects within a gene and the fraction of disease-associated genes housing multiple independent effects, observed at 35%-50% of loci in our study. This method can be generalized to other study designs, retains power for low-frequency alleles, and provides gene-based p-values that are directly compatible for pathway-based meta-analysis. © 2011 Bader et al.",
            "authors": [
                "Huang H.",
                "Chanda P.",
                "Alonso A.",
                "Bader J.S.",
                "Arking D.E."
            ],
            "cit_count": 52,
            "journal": "PLoS Genetics",
            "pmid": "21829371",
            "title": "Gene-Based tests of association",
            "year": "2011-07-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:gwis",
        "biotoolsID": "gwis",
        "description": "Use greedy Bayesian model selection to identify the independent effects within a gene, which are combined to generate a stronger statistical signal.",
        "homepage": "https://bitbucket.org/baderlab/gwis",
        "name": "GWiS"
    }
}