{
    "additionDate": "2017-08-03T18:56:37Z",
    "biotoolsCURIE": "biotools:protevol",
    "biotoolsID": "protevol",
    "credit": [
        {
            "email": "ub@cbm.uam.es",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://ub.cbm.uam.es/index.php?lang=en"
        }
    ],
    "description": "This program computes the mean-field site-specific amino acid distributions that have minimal differences with respect to the background distribution and that constraint the average stability of the native state of the protein against both unfolding and misfolding. The program also simulates protein evolution subject to the constraint of selection on the folding stability of the native state of the protein against both unfolding and misfolding.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://ub.cbm.uam.es/software/Prot_Evol.php"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein structure analysis",
                    "uri": "http://edamontology.org/operation_2406"
                }
            ]
        }
    ],
    "homepage": "http://ub.cbm.uam.es/software/Prot_Evol.php",
    "lastUpdate": "2018-12-10T12:58:43Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/protevol-maximum-likelihood-phylogenetic-inference-with-selection-on-protein-folding-stability.html"
        }
    ],
    "name": "ProtEvol",
    "operatingSystem": [
        "Windows"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "© The Author 2015. Published by Oxford University Press on behalf of the Society for Molecular Biology and Evolution. All rights reserved.Despite intense work, incorporating constraints on protein native structures into the mathematical models of molecular evolution remains difficult, because most models and programs assume that protein sites evolve independently, whereas protein stability is maintained by interactions between sites. Here, we address this problem by developing a new meanfield substitution model that generates independent site-specific amino acid distributions with constraints on the stability of the native state against both unfolding and misfolding. The model depends on a background distribution of amino acids and one selection parameter that we fix maximizing the likelihood of the observed protein sequence. The analytic solution of the model shows that the main determinant of the site-specific distributions is the number of native contacts of the site and that themost variable sites are those with an intermediate number of native contacts. The meanfield models obtained, taking into account misfolded conformations, yield larger likelihood than models that only consider the native state, because their average hydrophobicity is more realistic, and they produce on the average stable sequences for most proteins. We evaluated the mean-field model with respect to empirical substitution models on 12 test data sets of different protein families. In all cases, the observed site-specific sequence profiles presented smaller Kullback-Leibler divergence from the mean-field distributions than from the empirical substitution model. Next, we obtained substitution rates combining the mean-field frequencies with an empirical substitution model. The resulting mean-field substitutionmodel assigns larger likelihood than the empiricalmodel to all studied families when we consider sequences with identity larger than 0.35, plausibly a condition that enforces conservation of the native structure across the family. We found that the mean-field model performs better than other structurally constrained models with similar or higher complexity. With respect to the much more complex model recently developed by Bordner and Mittelmann, which takes into account pairwise terms in the amino acid distributions and also optimizes the exchangeability matrix, our model performed worse for data with small sequence divergence but better for data with larger sequence divergence. The mean-field model has been implemented into the computer program Prot-Evol that is freely available at http://ub. cbm.uam.es/software/Prot-Evol.php.",
                "authors": [
                    {
                        "name": "Arenas M."
                    },
                    {
                        "name": "Sanchez-Cobos A."
                    },
                    {
                        "name": "Bastolla U."
                    }
                ],
                "citationCount": 24,
                "date": "2015-08-01T00:00:00Z",
                "journal": "Molecular Biology and Evolution",
                "title": "Maximum-likelihood phylogenetic inference with selection on protein folding stability"
            },
            "pmid": "25837579"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        },
        {
            "term": "Protein folding, stability and design",
            "uri": "http://edamontology.org/topic_0130"
        },
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        }
    ],
    "validated": 1
}