{
    "additionDate": "2017-12-18T00:13:04Z",
    "biotoolsCURIE": "biotools:sequgio",
    "biotoolsID": "sequgio",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://github.com/Senbee"
        }
    ],
    "description": "Algorithm to estimate isoforms expression from RNA-seq data based on a model that doesn’t assume uniform distribution of count within transcripts.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://fafner.meb.ki.se/biostatwiki/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Processing",
                    "uri": "http://edamontology.org/operation_2409"
                }
            ]
        }
    ],
    "homepage": "http://fafner.meb.ki.se/personal/yudpaw/?page_id=13",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-10T12:58:58Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/sequgio-0-99-0-pre-processing-of-rnaseq-data.html"
        }
    ],
    "name": "Sequgio",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btt704",
            "metadata": {
                "abstract": "Motivation: RNA-sequencing technologies provide a powerful tool for expression analysis at gene and isoform level, but accurate estimation of isoform abundance is still a challenge. Standard assumption of uniform read intensity would yield biased estimates when the read intensity is in fact non-uniform. The problem is that, without strong assumptions, the read intensity pattern is not identifiable from data observed in a single sample.Results: We develop a joint statistical model that accounts for non-uniform isoform-specific read distribution and gene isoform expression estimation. The main challenge is in dealing with the large number of isoform-specific read distributions, which potentially are as many as the number of splice variants in the genome. A statistical regularization via a smoothing penalty is imposed to control the estimation. Also, for identifiability reasons, the method uses information across samples from the same region. We develop a fast and robust computational procedure based on the iterated-weighted least-squares algorithm, and apply it to simulated data and two real RNA-Seq datasets with reverse transcription-polymerase chain reaction validation. Empirical tests show that our model performs better than existing methods in terms of increasing precision in isoform-level estimation.Availability and implementation: We have implemented our method in an R package called Sequgio as a pipeline for fast processing of RNA-Seq data.Contact: Supplementary information: Supplementary data are available at Bioinformatics online. © 2013 The Author.",
                "authors": [
                    {
                        "name": "Suo C."
                    },
                    {
                        "name": "Calza S."
                    },
                    {
                        "name": "Salim A."
                    },
                    {
                        "name": "Pawitan Y."
                    }
                ],
                "citationCount": 11,
                "date": "2014-02-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Joint estimation of isoform expression and isoform-specific read distribution using multisample RNA-Seq data"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "RNA-seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        },
        {
            "term": "RNA-seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ],
    "validated": 1,
    "version": [
        "0.99.0"
    ]
}