
{
    "credit": [
        {
            "email": "danare@mail.huji.ac.il",
            "name": "Dana Reichmann",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "https://github.com/odedrim/kfits/"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Filtering",
                    "uri": "http://edamontology.org/operation_3695"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Python"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Command-line tool",
            "Web application"
        ],
        "topic": [
            {
                "term": "Enzymes",
                "uri": "http://edamontology.org/topic_0821"
            },
            {
                "term": "Biochemistry",
                "uri": "http://edamontology.org/topic_3292"
            },
            {
                "term": "Biophysics",
                "uri": "http://edamontology.org/topic_3306"
            },
            {
                "term": "Drug metabolism",
                "uri": "http://edamontology.org/topic_3375"
            },
            {
                "term": "Proteins",
                "uri": "http://edamontology.org/topic_0078"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© 2017 The Author. Motivation: Kinetic measurements have played an important role in elucidating biochemical and biophysical phenomena for over a century. While many tools for analysing kinetic measurements exist, most require low noise levels in the data, leaving outlier measurements to be cleaned manually. This is particularly true for protein misfolding and aggregation processes, which are extremely noisy and hence difficult to model. Understanding these processes is paramount, as they are associated with diverse physiological processes and disorders, most notably neurodegenerative diseases. Therefore, a better tool for analysing and cleaning protein aggregation traces is required. Results: Here we introduce Kfits, an intuitive graphical tool for detecting and removing noise caused by outliers in protein aggregation kinetics data. Following its workflow allows the user to quickly and easily clean large quantities of data and receive kinetic parameters for assessment of the results. With minor adjustments, the software can be applied to any type of kinetic measurements, not restricted to protein aggregation.",
            "authors": [
                "Rimon O.",
                "Reichmann D."
            ],
            "cit_count": 1,
            "doi": "10.1093/bioinformatics/btx577",
            "journal": "Bioinformatics",
            "title": "Kfits: A software framework for fitting and cleaning outliers in kinetic measurements",
            "year": "2018-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:kfits",
        "biotoolsID": "kfits",
        "description": "Framework for fitting and cleaning outliers in kinetic measurements.",
        "homepage": "http://kfits.reichmannlab.com/fitter/",
        "name": "Kfits"
    }
}