{
    "additionDate": "2018-05-24T11:26:21Z",
    "biotoolsCURIE": "biotools:vacsol",
    "biotoolsID": "vacsol",
    "collectionID": [
        "Proteomics"
    ],
    "credit": [
        {
            "email": "razi_sadiqpk@hotmail.com",
            "name": "Muhammad Rizwan",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Automate the high throughput in silico vaccine candidate prediction process for the identification of putative vaccine candidates against the proteome of bacterial pathogens.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://sourceforge.net/projects/vacsol/files/Installation%20and%20User%20Guide.pdf/download"
        }
    ],
    "editPermission": {
        "authors": [
            "proteomics.bio.tools"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Virulence prediction",
                    "uri": "http://edamontology.org/operation_3461"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Epitope mapping",
                    "uri": "http://edamontology.org/operation_0416"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "DNA vaccine design",
                    "uri": "http://edamontology.org/operation_0560"
                }
            ]
        }
    ],
    "homepage": "https://sourceforge.net/projects/vacsol/",
    "language": [
        "Java"
    ],
    "lastUpdate": "2019-03-26T08:42:09Z",
    "name": "VacSol",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "aotamendi.1",
    "publication": [
        {
            "doi": "10.1186/s12859-017-1540-0",
            "metadata": {
                "abstract": "© 2017 The Author(s).Background: With advances in reverse vaccinology approaches, a progressive improvement has been observed in the prediction of putative vaccine candidates. Reverse vaccinology has changed the way of discovery and provides a mean to propose target identification in reduced time and labour. In this regard, high throughput genomic sequencing technologies and supporting bioinformatics tools have greatly facilitated the prompt analysis of pathogens, where various predicted candidates have been found effective against certain infections and diseases. A pipeline, VacSol, is designed here based on a similar approach to predict putative vaccine candidates both rapidly and efficiently. Results: VacSol, a new pipeline introduced here, is a highly scalable, multi-mode, and configurable software designed to automate the high throughput in silico vaccine candidate prediction process for the identification of putative vaccine candidates against the proteome of bacterial pathogens. Vaccine candidates are screened using integrated, well-known and robust algorithms/tools for proteome analysis, and the results from the VacSol software are presented in five different formats by taking proteome sequence as input in FASTA file format. The utility of VacSol is tested and compared with published data and using the Helicobacter pylori 26695 reference strain as a benchmark. Conclusion: VacSol rapidly and efficiently screens the whole bacterial pathogen proteome to identify a few predicted putative vaccine candidate proteins. This pipeline has the potential to save computational costs and time by efficiently reducing false positive candidate hits. VacSol results do not depend on any universal set of rules and may vary based on the provided input. It is freely available to download from: https://sourceforge.net/projects/vacsol/.",
                "authors": [
                    {
                        "name": "Rizwan M."
                    },
                    {
                        "name": "Naz A."
                    },
                    {
                        "name": "Ahmad J."
                    },
                    {
                        "name": "Naz K."
                    },
                    {
                        "name": "Obaid A."
                    },
                    {
                        "name": "Parveen T."
                    },
                    {
                        "name": "Ahsan M."
                    },
                    {
                        "name": "Ali A."
                    }
                ],
                "citationCount": 21,
                "date": "2017-02-13T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "VacSol: A high throughput in silico pipeline to predict potential therapeutic targets in prokaryotic pathogens using subtractive reverse vaccinology"
            },
            "pmcid": "PMC5307925",
            "pmid": "28193166"
        }
    ],
    "toolType": [
        "Workflow",
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ],
    "validated": 1
}