
{
    "credit": [
    ],
    "labels": {
        "topic": [
            {
                "term": "Medicinal chemistry",
                "uri": "http://edamontology.org/topic_0209"
            },
            {
                "term": "Toxicology",
                "uri": "http://edamontology.org/topic_2840"
            },
            {
                "term": "Cheminformatics",
                "uri": "http://edamontology.org/topic_2258"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© 2019 American Chemical Society.Quantitative structure-activity relationship (QSAR) modeling is a well-known in silico technique with extensive applications in several major fields such as drug design, predictive toxicology, materials science, food science, etc. Handling small-sized datasets due to the lack of experimental data for specialized end points is a crucial task for the QSAR researcher. In the present study, we propose an integrated workflow/scheme capable of dealing with small dataset modeling that integrates dataset curation, \"exhaustive\" double cross-validation and a set of optimal model selection techniques including consensus predictions. We have developed two software tools, namely, Small Dataset Curator, version 1.0.0, and Small Dataset Modeler, version 1.0.0, to effortlessly execute the proposed workflow. These tools are freely available for download from https://dtclab.webs.com/software-tools. We have performed case studies employing seven diverse datasets to demonstrate the performance of the proposed scheme (including data curation) for small dataset QSAR modeling. The case studies also confirm the usability and stability of the developed software tools.",
            "authors": [
                "Ambure P.",
                "Gajewicz-Skretna A.",
                "Cordeiro M.N.D.S.",
                "Roy K."
            ],
            "cit_count": 0,
            "doi": "10.1021/ACS.JCIM.9B00476",
            "journal": "Journal of Chemical Information and Modeling",
            "pmid": "31525295",
            "title": "New workflow for QSAR model development from small data sets: Small dataset curator and small dataset modeler. Integration of data curation, exhaustive double cross-validation, and a set of optimal model selection techniques",
            "year": "2019-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:software_tools",
        "biotoolsID": "software_tools",
        "description": "> LOW CONFIDENCE! | Small Dataset Curator and Small Dataset Modeler. Integration of Data Curation, Exhaustive Double Cross-Validation, and a Set of Optimal Model Selection Techniques | DTC lab - Software Tools - DTC lab is working in the field of molecular modelling mainly using different QSAR methodologies in various diverse area such as drug designing, toxicity, anti-oxidant studies etc",
        "homepage": "https://dtclab.webs.com/software-tools",
        "name": "software tools"
    }
}