{
    "accessibility": "Open access",
    "additionDate": "2022-10-09T20:37:52.324145Z",
    "biotoolsCURIE": "biotools:pmgs",
    "biotoolsID": "pmgs",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Aslı Boyraz"
        },
        {
            "name": "Aybar Can Acar"
        },
        {
            "name": "Juan José Egozcue"
        },
        {
            "name": "Vera Pawlowsky-Glahn"
        }
    ],
    "description": "Compositional alternative to phylogenetic grouping of microbiome data.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                },
                {
                    "term": "Dimensionality reduction",
                    "uri": "http://edamontology.org/operation_3935"
                },
                {
                    "term": "Phylogenetic inference",
                    "uri": "http://edamontology.org/operation_0323"
                }
            ]
        }
    ],
    "homepage": "https://github.com/asliboyraz/PMGs",
    "language": [
        "R"
    ],
    "lastUpdate": "2024-11-24T15:27:51.850212Z",
    "license": "Not licensed",
    "name": "PMGs",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1093/bib/bbac328",
            "metadata": {
                "abstract": "Statistical and machine learning techniques based on relative abundances have been used to predict health conditions and to identify microbial biomarkers. However, high dimensionality, sparsity and the compositional nature of microbiome data represent statistical challenges. On the other hand, the taxon grouping allows summarizing microbiome abundance with a coarser resolution in a lower dimension, but it presents new challenges when correlating taxa with a disease. In this work, we present a novel approach that groups Operational Taxonomical Units (OTUs) based only on relative abundances as an alternative to taxon grouping. The proposed procedure acknowledges the compositional data making use of principal balances. The identified groups are called Principal Microbial Groups (PMGs). The procedure reduces the need for user-defined aggregation of OTUs and offers the possibility of working with coarse group of OTUs, which are not present in a phylogenetic tree. PMGs can be used for two different goals: (1) as a dimensionality reduction method for compositional data, (2) as an aggregation procedure that provides an alternative to taxon grouping for construction of microbial balances afterward used for disease prediction. We illustrate the procedure with a cirrhosis study data. PMGs provide a coherent data analysis for the search of biomarkers in human microbiota. The source code and demo data for PMGs are available at: https://github.com/asliboyraz/PMGs.",
                "authors": [
                    {
                        "name": "Acar A.C."
                    },
                    {
                        "name": "Boyraz A."
                    },
                    {
                        "name": "Egozcue J.J."
                    },
                    {
                        "name": "Pawlowsky-Glahn V."
                    }
                ],
                "citationCount": 1,
                "date": "2022-09-01T00:00:00Z",
                "journal": "Briefings in Bioinformatics",
                "title": "Principal microbial groups: Compositional alternative to phylogenetic grouping of microbiome data"
            },
            "pmid": "36007229"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Microbial ecology",
            "uri": "http://edamontology.org/topic_3697"
        },
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        }
    ],
    "validated": 1
}
