{
    "additionDate": "2019-11-14T18:16:32Z",
    "biotoolsCURIE": "biotools:ChemAGG",
    "biotoolsID": "ChemAGG",
    "confidence_flag": "tool",
    "description": "Structural Analysis and Identification of Colloidal Aggregators in Drug Discovery | Aggregator Prediction-Webserver-ADMElab | Aggregation is one of the main reasons of false positives in HTS. To build a reliable prediction model, we collected a large dataset of aggregators and drugs to build several models based on the combination of different descriptors and algorithm, ChemAGG is a free webserver that could be used to easily filter out aggregators from potential lead molecules!",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Scaffolding",
                    "uri": "http://edamontology.org/operation_3216"
                },
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                }
            ]
        }
    ],
    "homepage": "http://admet.scbdd.com/ChemAGG/index",
    "lastUpdate": "2020-12-10T16:32:07Z",
    "name": "ChemAGG",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1021/ACS.JCIM.9B00541",
            "metadata": {
                "abstract": "Copyright © 2019 American Chemical Society.Aggregation has been posing a great challenge in drug discovery. Current computational approaches aiming to filter out aggregated molecules based on their similarity to known aggregators, such as Aggregator Advisor, have low prediction accuracy, and therefore development of reliable in silico models to detect aggregators is highly desirable. In this study, we built a data set consisting of 12 119 aggregators and 24 172 drugs or drug candidates and then developed a group of classification models based on the combination of two ensemble learning approaches and five types of molecular representations. The best model yielded an accuracy of 0.950 and an area under the curve (AUC) value of 0.987 for the training set, and an accuracy of 0.937 and an AUC of 0.976 for the test set. The best model also gave reliable predictions to the external validation set with 5681 aggregators since 80% of molecules were predicted to be aggregators with a prediction probability higher than 0.9. More importantly, we explored the relationship between colloidal aggregation and molecular features, and generalized a set of simple rules to detect aggregators. Molecular features, such as log D, the number of hydroxyl groups, the number of aromatic carbons attached to a hydrogen atom, and the number of sulfur atoms in aromatic heterocycles, would be helpful to distinguish aggregators from nonaggregators. A comparison with numerous existing druglikeness and aggregation filtering rules and models used in virtual screening verified the high reliability of the model and rules proposed in this study. We also used the model to screen several curated chemical databases, and almost 20% of molecules in the evaluated databases were predicted as aggregators, highlighting the potential high risk of aggregation in screening. Finally, we developed an online Web server of ChemAGG (http://admet.scbdd.com/ChemAGG/index), which offers a freely available tool to detect aggregators.",
                "authors": [
                    {
                        "name": "Yang Z.-Y."
                    },
                    {
                        "name": "Yang Z.-J."
                    },
                    {
                        "name": "Dong J."
                    },
                    {
                        "name": "Wang L.-L."
                    },
                    {
                        "name": "Zhang L.-X."
                    },
                    {
                        "name": "Ding J.-J."
                    },
                    {
                        "name": "Ding X.-Q."
                    },
                    {
                        "name": "Lu A.-P."
                    },
                    {
                        "name": "Hou T.-J."
                    },
                    {
                        "name": "Cao D.-S."
                    }
                ],
                "citationCount": 6,
                "date": "2019-09-23T00:00:00Z",
                "journal": "Journal of Chemical Information and Modeling",
                "title": "Structural Analysis and Identification of Colloidal Aggregators in Drug Discovery"
            },
            "pmid": "31430151"
        }
    ],
    "topic": [
        {
            "term": "Drug discovery",
            "uri": "http://edamontology.org/topic_3336"
        },
        {
            "term": "Drug development",
            "uri": "http://edamontology.org/topic_3373"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ],
    "validated": 1
}