{
    "additionDate": "2022-11-03T07:49:22.245580Z",
    "biotoolsCURIE": "biotools:fam",
    "biotoolsID": "fam",
    "collectionID": [
        "COVID-19"
    ],
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "joyjchan@gmail.com",
            "name": "Jingjing Chen",
            "orcidid": "https://orcid.org/0000-0003-1737-3420",
            "typeEntity": "Person"
        },
        {
            "email": "lufangfang@shiep.edu.cn",
            "name": "Fangfang Lu",
            "typeEntity": "Person"
        }
    ],
    "description": "A focal attention module (FAM) for lesion segmentation of COVID-19 CT images. It contains a channel attention module and a spatial attention module.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                }
            ]
        }
    ],
    "homepage": "https://github.com/RobotvisionLab/FAM.git",
    "language": [
        "C++",
        "Python"
    ],
    "lastUpdate": "2022-11-03T07:49:22.247982Z",
    "license": "Not licensed",
    "name": "FAM",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1007/S11554-022-01249-5",
            "metadata": {
                "abstract": "© 2022, The Author(s), under exclusive licence to Springer-Verlag GmbH Germany, part of Springer Nature.The novel coronavirus pneumonia (COVID-19) is the world’s most serious public health crisis, posing a serious threat to public health. In clinical practice, automatic segmentation of the lesion from computed tomography (CT) images using deep learning methods provides an promising tool for identifying and diagnosing COVID-19. To improve the accuracy of image segmentation, an attention mechanism is adopted to highlight important features. However, existing attention methods are of weak performance or negative impact to the accuracy of convolutional neural networks (CNNs) due to various reasons (e.g. low contrast of the boundary between the lesion and the surrounding, the image noise). To address this issue, we propose a novel focal attention module (FAM) for lesion segmentation of CT images. FAM contains a channel attention module and a spatial attention module. In the spatial attention module, it first generates rough spatial attention, a shape prior of the lesion region obtained from the CT image using median filtering and distance transformation. The rough spatial attention is then input into two 7 × 7 convolution layers for correction, achieving refined spatial attention on the lesion region. FAM is individually integrated with six state-of-the-art segmentation networks (e.g. UNet, DeepLabV3+, etc.), and then we validated these six combinations on the public dataset including COVID-19 CT images. The results show that FAM improve the Dice Similarity Coefficient (DSC) of CNNs by 2%, and reduced the number of false negatives (FN) and false positives (FP) up to 17.6%, which are significantly higher than that using other attention modules such as CBAM and SENet. Furthermore, FAM significantly improve the convergence speed of the model training and achieve better real-time performance. The codes are available at GitHub (https://github.com/RobotvisionLab/FAM.git).",
                "authors": [
                    {
                        "name": "Chen H."
                    },
                    {
                        "name": "Chen J."
                    },
                    {
                        "name": "Gu W."
                    },
                    {
                        "name": "Guo L."
                    },
                    {
                        "name": "Jin B."
                    },
                    {
                        "name": "Lu F."
                    },
                    {
                        "name": "Luo Q."
                    },
                    {
                        "name": "Wu X."
                    },
                    {
                        "name": "Zhang Z."
                    }
                ],
                "date": "2022-12-01T00:00:00Z",
                "journal": "Journal of Real-Time Image Processing",
                "title": "FAM: focal attention module for lesion segmentation of COVID-19 CT images"
            },
            "pmcid": "PMC9441194",
            "pmid": "36091622"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        },
        {
            "term": "Public health and epidemiology",
            "uri": "http://edamontology.org/topic_3305"
        },
        {
            "term": "Tomography",
            "uri": "http://edamontology.org/topic_3452"
        }
    ],
    "validated": 1
}
