{
    "additionDate": "2017-01-13T13:15:44Z",
    "biotoolsCURIE": "biotools:olego",
    "biotoolsID": "olego",
    "credit": [
        {
            "email": "cz2294@columbia.edu",
            "name": "Chaolin Zhang",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "name": "Jie Wu",
            "orcidid": "http://orcid.org/0000-0002-0989-8115"
        }
    ],
    "description": "Designed for de novo spliced mapping of mRNA-seq reads. It adopts a seeding and extension scheme, and does not rely on a separate external. It achieves high sensitivity of junction detection by using very small seeds, efficiently mapped using Burrows-Wheeler transform (BWT) and FM-index. This also makes it particularly sensitive for discovering small exons. It is implemented in C++ with full support of multiple threading, to allow fast processing of large-scale data.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://zhanglab.c2b2.columbia.edu/index.php/OLego_Documentation"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Read mapping",
                    "uri": "http://edamontology.org/operation_3198"
                },
                {
                    "term": "Sequence alignment",
                    "uri": "http://edamontology.org/operation_0292"
                }
            ]
        }
    ],
    "homepage": "http://zhanglab.c2b2.columbia.edu/index.php/OLego",
    "language": [
        "C++"
    ],
    "lastUpdate": "2019-01-09T16:48:25Z",
    "license": "GPL-3.0",
    "maturity": "Mature",
    "name": "OLego",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "seqwiki_import",
    "publication": [
        {
            "doi": "10.1093/nar/gkt216",
            "metadata": {
                "abstract": "A crucial step in analyzing mRNA-Seq data is to accurately and efficiently map hundreds of millions of reads to the reference genome and exon junctions. Here we present OLego, an algorithm specifically designed for de novo mapping of spliced mRNASeq reads. OLego adopts a multiple-seed-andextend scheme, and does not rely on a separate external aligner. It achieves high sensitivity of junction detection by strategic searches with small seeds (∼14 nt for mammalian genomes). To improve accuracy and resolve ambiguous mapping at junctions, OLego uses a built-in statistical model to score exon junctions by splice-site strength and intron size. Burrows Wheeler transform is used in multiple steps of the algorithm to efficiently map seeds, locate junctions and identify small exons. OLego is implemented in C++ with fully multithreaded execution, and allows fast processing of large-scale data. We systematically evaluated the performance of OLego in comparison with published tools using both simulated and real data. OLego demonstrated better sensitivity, higher or comparable accuracy and substantially improved speed. OLego also identified hundreds of novel micro-exons (<30 nt) in the mouse transcriptome, many of which are phylogenetically conserved and can be validated experimentally in vivo. OLego is freely available at http://zhanglab.c2b2.columbia. edu/index.php/OLego. © The Author(s) 2013. Published by Oxford University Press.",
                "authors": [
                    {
                        "name": "Wu J."
                    },
                    {
                        "name": "Anczukow O."
                    },
                    {
                        "name": "Krainer A.R."
                    },
                    {
                        "name": "Zhang M.Q."
                    },
                    {
                        "name": "Zhang C."
                    }
                ],
                "citationCount": 67,
                "date": "2013-05-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "OLego: Fast and sensitive mapping of spliced mRNA-Seq reads using small seeds"
            },
            "pmcid": "PMC3664805",
            "pmid": "23571760",
            "type": [
                "Primary"
            ]
        },
        {
            "doi": "10.1038/nmeth.4106",
            "metadata": {
                "abstract": "© 2017 Nature America, inc., part of springer Nature. All rights reserved.Alignment is the first step in most RNA-seq analysis pipelines, and the accuracy of downstream analyses depends heavily on it. Unlike most steps in the pipeline, alignment is particularly amenable to benchmarking with simulated data. We performed a comprehensive benchmarking of 14 common splice-aware aligners for base, read, and exon junction-level accuracy and compared default with optimized parameters. We found that performance varied by genome complexity, and accuracy and popularity were poorly correlated. The most widely cited tool underperforms for most metrics, particularly when using default settings.",
                "authors": [
                    {
                        "name": "Baruzzo G."
                    },
                    {
                        "name": "Hayer K.E."
                    },
                    {
                        "name": "Kim E.J."
                    },
                    {
                        "name": "DI Camillo B."
                    },
                    {
                        "name": "Fitzgerald G.A."
                    },
                    {
                        "name": "Grant G.R."
                    }
                ],
                "citationCount": 81,
                "date": "2017-02-01T00:00:00Z",
                "journal": "Nature Methods",
                "title": "Simulation-based comprehensive benchmarking of RNA-seq aligners"
            },
            "pmcid": "PMC5792058",
            "pmid": "27941783",
            "type": [
                "Benchmarking study"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "RNA-seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ],
    "validated": 1
}