{
    "accessibility": [],
    "additionDate": "2018-08-20T14:15:50Z",
    "biotoolsCURIE": "biotools:steps",
    "biotoolsID": "steps",
    "collectionID": [],
    "confidence_flag": null,
    "cost": null,
    "credit": [
        {
            "email": "steps.dev@gmail.com",
            "gridid": null,
            "name": "Support",
            "note": null,
            "orcidid": null,
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": null
        }
    ],
    "description": "Package for exact stochastic simulation of reaction-diffusion systems in arbitrarily complex 3D geometries.",
    "documentation": [
        {
            "note": null,
            "type": "General",
            "url": "http://steps.sourceforge.net/STEPS/documentation.php"
        }
    ],
    "download": [],
    "editPermission": {
        "authors": [],
        "type": "private"
    },
    "elixirNode": [],
    "elixirPlatform": [],
    "elixir_badge": 0,
    "function": [
        {
            "cmd": null,
            "input": [],
            "note": null,
            "operation": [
                {
                    "term": "Metabolic network modelling",
                    "uri": "http://edamontology.org/operation_3660"
                }
            ],
            "output": []
        }
    ],
    "homepage": "http://steps.sourceforge.net/STEPS/default.php",
    "homepage_status": 0,
    "language": [
        "C++",
        "Python"
    ],
    "lastUpdate": "2018-12-10T12:59:01Z",
    "license": "GPL-3.0",
    "link": [],
    "maturity": null,
    "name": "STEPS",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "otherID": [],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1186/1752-0509-6-36",
            "metadata": {
                "abstract": "Background: Models of cellular molecular systems are built from components such as biochemical reactions (including interactions between ligands and membrane-bound proteins), conformational changes and active and passive transport. A discrete, stochastic description of the kinetics is often essential to capture the behavior of the system accurately. Where spatial effects play a prominent role the complex morphology of cells may have to be represented, along with aspects such as chemical localization and diffusion. This high level of detail makes efficiency a particularly important consideration for software that is designed to simulate such systems.Results: We describe STEPS, a stochastic reaction-diffusion simulator developed with an emphasis on simulating biochemical signaling pathways accurately and efficiently. STEPS supports all the above-mentioned features, and well-validated support for SBML allows many existing biochemical models to be imported reliably. Complex boundaries can be represented accurately in externally generated 3D tetrahedral meshes imported by STEPS. The powerful Python interface facilitates model construction and simulation control. STEPS implements the composition and rejection method, a variation of the Gillespie SSA, supporting diffusion between tetrahedral elements within an efficient search and update engine. Additional support for well-mixed conditions and for deterministic model solution is implemented. Solver accuracy is confirmed with an original and extensive validation set consisting of isolated reaction, diffusion and reaction-diffusion systems. Accuracy imposes upper and lower limits on tetrahedron sizes, which are described in detail. By comparing to Smoldyn, we show how the voxel-based approach in STEPS is often faster than particle-based methods, with increasing advantage in larger systems, and by comparing to MesoRD we show the efficiency of the STEPS implementation.Conclusion: STEPS simulates models of cellular reaction-diffusion systems with complex boundaries with high accuracy and high performance in C/C++, controlled by a powerful and user-friendly Python interface. STEPS is free for use and is available at http://steps.sourceforge.net/. © 2012 Hepburn et al.; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Hepburn I."
                    },
                    {
                        "name": "Chen W."
                    },
                    {
                        "name": "Wils S."
                    },
                    {
                        "name": "De Schutter E."
                    }
                ],
                "citationCount": 59,
                "date": "2012-05-10T00:00:00Z",
                "journal": "BMC Systems Biology",
                "title": "STEPS: Efficient simulation of stochastic reaction-diffusion models in realistic morphologies"
            },
            "note": null,
            "pmcid": null,
            "pmid": null,
            "type": null,
            "version": null
        }
    ],
    "relation": [],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Systems biology",
            "uri": "http://edamontology.org/topic_2259"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Simulation experiment",
            "uri": "http://edamontology.org/topic_3524"
        }
    ],
    "validated": 1,
    "version": []
}