{
    "additionDate": "2021-01-18T09:03:04Z",
    "biotoolsCURIE": "biotools:traps-vari",
    "biotoolsID": "traps-vari",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "vijaykumar.ulaganathan@med.uni-goettingen.de",
            "name": "Vijay Kumar Ulaganathan",
            "orcidid": "https://orcid.org/0000-0002-4717-6228",
            "typeEntity": "Person"
        }
    ],
    "description": "Identifying genetic variants altering phosphotyrosine based signalling motifs.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                },
                {
                    "term": "Transmembrane protein visualisation",
                    "uri": "http://edamontology.org/operation_2241"
                }
            ]
        }
    ],
    "homepage": "https://www.traps-vari.org/",
    "lastUpdate": "2021-03-03T10:53:04Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://gitlab.com/VJ-Ulaganathan/TraPS-VarI"
        }
    ],
    "name": "TraPS-VarI",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1038/S41598-020-65146-2",
            "metadata": {
                "abstract": "© 2020, The Author(s).Patient stratification and individualized therapeutic strategies rely on the established knowledge of genotype-specific molecular and cellular alterations of biological and therapeutic significance. Whilst almost all approved drugs have been developed based on the Reference Sequence protein database (RefSeq), the latest genome sequencing studies establish the substantial prevalence of non-synonymous genetic mutations in the general population, including stop-insertion and frame shift mutations within the coding regions of membrane proteins. While the availability of individual genotypes are becoming increasingly common, the biological and clinical interpretations of mutations among individual genomes is largely lagging behind. Lately, transmembrane proteins of haematopoietic (myeloid and lymphoid) derived immune cells have attracted much attention as important targets for cancer immunotherapies. As such, the signalling properties of haematological transmembrane receptors rely on the membrane-proximal phosphotyrosine based sequence motifs (TBSMs) such as ITAM (immunoreceptor tyrosine-based activation motif), ITIM (immunoreceptor tyrosine-based inhibition motif) and signal transducer and activator of transcription 3 (STAT3)-recruiting YxxQ motifs. However, mutations that alter the coding regions of transmembrane proteins, resulting in either insertion or deletion of crucial signal modulating TBSMs, remains unknown. To conveniently identify individual cell line-specific or patient-specific membrane protein altering mutations, we present the Transmembrane Protein Sequence Variant Identifier (TraPS-VarI). TraPS-VarI is an annotation tool for accurate mapping of the effect of an individual’s mutation in the transmembrane protein sequence, and to identify the prevalence of TBSMs. TraPS-VarI is a biologist and clinician-friendly algorithm with a web interface and an associated database browser (https://www.traps-vari.org/).",
                "authors": [
                    {
                        "name": "Ulaganathan V.K."
                    }
                ],
                "date": "2020-12-01T00:00:00Z",
                "journal": "Scientific Reports",
                "title": "TraPS-VarI: Identifying genetic variants altering phosphotyrosine based signalling motifs"
            },
            "pmcid": "PMC7242328",
            "pmid": "32439998"
        }
    ],
    "topic": [
        {
            "term": "Membrane and lipoproteins",
            "uri": "http://edamontology.org/topic_0820"
        },
        {
            "term": "Sequence sites, features and motifs",
            "uri": "http://edamontology.org/topic_0160"
        },
        {
            "term": "Protein variants",
            "uri": "http://edamontology.org/topic_3120"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        }
    ]
}