{
    "additionDate": "2022-04-28T14:41:45.281801Z",
    "biotoolsCURIE": "biotools:odefy",
    "biotoolsID": "odefy",
    "description": "MATLAB- and Octave-compatible toolbox for the automated transformation of Boolean models into systems of ordinary differential equations. Models can be created from sets of Boolean equations or graph representations of Boolean networks.",
    "download": [
        {
            "type": "Software package",
            "url": "https://github.com/krumsieklab/Odefy"
        }
    ],
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://www.helmholtz-munich.de/icb/software/odefy/index.html",
    "lastUpdate": "2022-04-28T14:41:45.284624Z",
    "name": "Odefy",
    "owner": "tntiniak",
    "publication": [
        {
            "doi": "10.1186/1471-2105-11-233",
            "metadata": {
                "abstract": "Background: Phenomenological information about regulatory interactions is frequently available and can be readily converted to Boolean models. Fully quantitative models, on the other hand, provide detailed insights into the precise dynamics of the underlying system. In order to connect discrete and continuous modeling approaches, methods for the conversion of Boolean systems into systems of ordinary differential equations have been developed recently. As biological interaction networks have steadily grown in size and complexity, a fully automated framework for the conversion process is desirable.Results: We present Odefy, a MATLAB- and Octave-compatible toolbox for the automated transformation of Boolean models into systems of ordinary differential equations. Models can be created from sets of Boolean equations or graph representations of Boolean networks. Alternatively, the user can import Boolean models from the CellNetAnalyzer toolbox, GINSim and the PBN toolbox. The Boolean models are transformed to systems of ordinary differential equations by multivariate polynomial interpolation and optional application of sigmoidal Hill functions. Our toolbox contains basic simulation and visualization functionalities for both, the Boolean as well as the continuous models. For further analyses, models can be exported to SQUAD, GNA, MATLAB script files, the SB toolbox, SBML and R script files. Odefy contains a user-friendly graphical user interface for convenient access to the simulation and exporting functionalities. We illustrate the validity of our transformation approach as well as the usage and benefit of the Odefy toolbox for two biological systems: a mutual inhibitory switch known from stem cell differentiation and a regulatory network giving rise to a specific spatial expression pattern at the mid-hindbrain boundary.Conclusions: Odefy provides an easy-to-use toolbox for the automatic conversion of Boolean models to systems of ordinary differential equations. It can be efficiently connected to a variety of input and output formats for further analysis and investigations. The toolbox is open-source and can be downloaded at http://cmb.helmholtz-muenchen.de/odefy. © 2010 Krumsiek et al; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Krumsiek J."
                    },
                    {
                        "name": "Polsterl S."
                    },
                    {
                        "name": "Theis F.J."
                    },
                    {
                        "name": "Wittmann D.M."
                    }
                ],
                "citationCount": 85,
                "date": "2010-05-07T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Odefy - From discrete to continuous models"
            }
        },
        {
            "doi": "10.1186/1752-0509-3-98",
            "metadata": {
                "abstract": "Background: The understanding of regulatory and signaling networks has long been a core objective in Systems Biology. Knowledge about these networks is mainly of qualitative nature, which allows the construction of Boolean models, where the state of a component is either 'off' or 'on'. While often able to capture the essential behavior of a network, these models can never reproduce detailed time courses of concentration levels. Results: Nowadays however, experiments yield more and more quantitative data. An obvious question therefore is how qualitative models can be used to explain and predict the outcome of these experiments. Conclusion: In this contribution we present a canonical way of transforming Boolean into continuous models, where the use of multivariate polynomial interpolation allows transformation of logic operations into a system of ordinary differential equations (ODE). The method is standardized and can readily be applied to large networks. Other, more limited approaches to this task are briefly reviewed and compared. Moreover, we discuss and generalize existing theoretical results on the relation between Boolean and continuous models. As a test case a logical model is transformed into an extensive continuous ODE model describing the activation of T-cells. We discuss how parameters for this model can be determined such that quantitative experimental results are explained and predicted, including time-courses for multiple ligand concentrations and binding affinities of different ligands. This shows that from the continuous model we may obtain biological insights not evident from the discrete one. The presented approach will facilitate the interaction between modeling and experiments. Moreover, it provides a straightforward way to apply quantitative analysis methods to qualitatively described systems. © 2009 Wittmann et al; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Klamt S."
                    },
                    {
                        "name": "Krumsiek J."
                    },
                    {
                        "name": "Lauffenburger D.A."
                    },
                    {
                        "name": "Saez-Rodriguez J."
                    },
                    {
                        "name": "Theis F.J."
                    },
                    {
                        "name": "Wittmann D.M."
                    }
                ],
                "citationCount": 154,
                "date": "2009-09-28T00:00:00Z",
                "journal": "BMC Systems Biology",
                "title": "Transforming Boolean models to continuous models: Methodology and application to T-cell receptor signaling"
            }
        }
    ]
}
