{
    "additionDate": "2021-03-19T09:18:13Z",
    "biotoolsCURIE": "biotools:dpcnv",
    "biotoolsID": "dpcnv",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "xiguoyuan@mail.xidian.edu.cn",
            "name": "Xiguo Yuan",
            "typeEntity": "Person"
        }
    ],
    "description": "dpCNV is a density peak-based method to detect copy number variations from next-generation sequencing data.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Copy number variation detection",
                    "uri": "http://edamontology.org/operation_3961"
                }
            ]
        }
    ],
    "homepage": "https://github.com/BDanalysis/dpCNV/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-04-10T10:12:05Z",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/BDanalysis/dpCNV/issues"
        }
    ],
    "name": "dpCNV",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.3389/FGENE.2020.632311",
            "metadata": {
                "abstract": "© Copyright © 2021 Xie, Tian and Yuan.Copy number variation (CNV) is a common type of structural variations in human genome and confers biological meanings to human complex diseases. Detection of CNVs is an important step for a systematic analysis of CNVs in medical research of complex diseases. The recent development of next-generation sequencing (NGS) platforms provides unprecedented opportunities for the detection of CNVs at a base-level resolution. However, due to the intrinsic characteristics behind NGS data, accurate detection of CNVs is still a challenging task. In this article, we propose a new density peak-based method, called dpCNV, for the detection of CNVs from NGS data. The algorithm of dpCNV is designed based on density peak clustering algorithm. It extracts two features, i.e., local density and minimum distance, from sequencing read depth (RD) profile and generates a two-dimensional data. Based on the generated data, a two-dimensional null distribution is constructed to test the significance of each genome bin and then the significant genome bins are declared as CNVs. We test the performance of the dpCNV method on a number of simulated datasets and make comparison with several existing methods. The experimental results demonstrate that our proposed method outperforms others in terms of sensitivity and F1-score. We further apply it to a set of real sequencing samples and the results demonstrate the validity of dpCNV. Therefore, we expect that dpCNV can be used as a supplementary to existing methods and may become a routine tool in the field of genome mutation analysis.",
                "authors": [
                    {
                        "name": "Tian Y."
                    },
                    {
                        "name": "Xie K."
                    },
                    {
                        "name": "Yuan X."
                    }
                ],
                "date": "2021-01-13T00:00:00Z",
                "journal": "Frontiers in Genetics",
                "title": "A Density Peak-Based Method to Detect Copy Number Variations From Next-Generation Sequencing Data"
            },
            "pmcid": "PMC7838601",
            "pmid": "33519925"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Copy number variation",
            "uri": "http://edamontology.org/topic_3958"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ]
}
