{
    "additionDate": "2021-03-19T09:17:08Z",
    "biotoolsCURIE": "biotools:ikernint",
    "biotoolsID": "ikernint",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "eramongurrea@gmail.com",
            "name": "Elies Ramon",
            "typeEntity": "Person"
        }
    ],
    "description": "A Kernel Framework for Integrating Supervised and Unsupervised Analyses in Spatio-Temporal Metagenomic Datasets.\n\nkernInt uses the kernel framework to unify supervised and unsupervised microbiome analyses, while paying special attention to spatial and temporal integration. If you find our package useful, please cite:.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Principal component visualisation",
                    "uri": "http://edamontology.org/operation_2939"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "https://github.com/elies-ramon/kernInt",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-03-31T18:28:26Z",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "https://elies-ramon.github.io/kernInt/"
        }
    ],
    "name": "ikernInt",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.3389/FMICB.2021.609048",
            "metadata": {
                "abstract": "© Copyright © 2021 Ramon, Belanche-Muñoz, Molist, Quintanilla, Perez-Enciso and Ramayo-Caldas.The advent of next-generation sequencing technologies allowed relative quantification of microbiome communities and their spatial and temporal variation. In recent years, supervised learning (i.e., prediction of a phenotype of interest) from taxonomic abundances has become increasingly common in the microbiome field. However, a gap exists between supervised and classical unsupervised analyses, based on computing ecological dissimilarities for visualization or clustering. Despite this, both approaches face common challenges, like the compositional nature of next-generation sequencing data or the integration of the spatial and temporal dimensions. Here we propose a kernel framework to place on a common ground the unsupervised and supervised microbiome analyses, including the retrieval of microbial signatures (taxa importances). We define two compositional kernels (Aitchison-RBF and compositional linear) and discuss how to transform non-compositional beta-dissimilarity measures into kernels. Spatial data is integrated with multiple kernel learning, while longitudinal data is evaluated by specific kernels. We illustrate our framework through a single point soil dataset, a human dataset with a spatial component, and a previously unpublished longitudinal dataset concerning pig production. The proposed framework and the case studies are freely available in the kernInt package at https://github.com/elies-ramon/kernInt.",
                "authors": [
                    {
                        "name": "Belanche-Munoz L."
                    },
                    {
                        "name": "Molist F."
                    },
                    {
                        "name": "Perez-Enciso M."
                    },
                    {
                        "name": "Quintanilla R."
                    },
                    {
                        "name": "Ramayo-Caldas Y."
                    },
                    {
                        "name": "Ramon E."
                    }
                ],
                "date": "2021-01-28T00:00:00Z",
                "journal": "Frontiers in Microbiology",
                "title": "kernInt: A Kernel Framework for Integrating Supervised and Unsupervised Analyses in Spatio-Temporal Metagenomic Datasets"
            },
            "pmcid": "PMC7876079",
            "pmid": "33584612"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "Microbial ecology",
            "uri": "http://edamontology.org/topic_3697"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ]
}
