{
    "additionDate": "2021-01-18T10:52:22Z",
    "biotoolsCURIE": "biotools:tessa",
    "biotoolsID": "tessa",
    "confidence_flag": "tool",
    "description": "A Novel MATLAB Program for Automated Tessitura Analysis.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Formatting",
                    "uri": "http://edamontology.org/operation_0335"
                },
                {
                    "term": "Parsing",
                    "uri": "http://edamontology.org/operation_1812"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Allerseelen/Tessa",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2021-02-27T08:58:12Z",
    "license": "GPL-3.0",
    "name": "Tessa",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1016/J.JVOICE.2020.07.039",
            "metadata": {
                "abstract": "© 2020 The Voice FoundationObjective: Tessitura—the habitual pitch range of a musical piece or role—is widely accepted as a significant factor in determining whether a singer should perform a given piece or role. However, attempts to quantify tessitura have historically relied on laborious hand calculations. The current study introduces a novel MATLAB program (“Tessa”) that automates tessitura analysis of digital sheet music in the MusicXML format. This program will allow voice teachers and singing voice specialists to assess the appropriateness of musical pieces or roles for their students and clients. Methods: Tessa converts sheet music in the open-source MusicXML (MXL or XML) format to a MATLAB-compatible structure array (MAT). Once converted, the program extracts pitch, duration, and lyric information from the structure file, then saves relevant arrays to the user's computer. Finally, Tessa performs analyses on the piece's tessitura data, including histogram, box plot, and descriptive statistical analyses. Variables such as tempo, score part number, and the piece's title are automatically saved in order to facilitate repeated analyses. Results: A sample analysis of Franz Schubert's song cycle Winterreise, D.911 is presented, with specific reference to the songs “3. Gefrorne Tränen” and “4. Erstarrung” as examples of pieces with markedly different tessituras—and, consequently, markedly different levels of vocal demand. Discussion: Tessa is hosted on a GitHub repository (https://github.com/Allerseelen/Tessa) and is intended for open-source use and modification under the GNU General Public License v3.0. Voice teachers, singing voice specialists, and musicians may compare Tessa's analyses with voice range profiles or other assessment tools in order to evaluate repertoire and plan pacing strategies for extended performances.",
                "authors": [
                    {
                        "name": "Apfelbach C.S."
                    }
                ],
                "date": "2020-01-01T00:00:00Z",
                "journal": "Journal of Voice",
                "title": "Tessa: A Novel MATLAB Program for Automated Tessitura Analysis"
            },
            "pmid": "32873432"
        }
    ]
}
