{
    "additionDate": "2021-10-10T15:01:35.486383Z",
    "biotoolsCURIE": "biotools:mirev",
    "biotoolsID": "mirev",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "alex.hildebrandt@tum.de",
            "name": "Alex Hildebrandt",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "miREV is an online database and tool to uncover potential reference RNAs and biomarkers in small-RNA sequencing data sets from Extracellular Vesicles enriched samples. miREV was developed as an easy to use online tool with a graphical user interface. Main goal is to uncover potential reference RNAs from EV studies in relation to different experimental conditions. Because suitable reference RNAs, for instance to validate findings from NGS experiments or to perform meaningful expression analyses by RT-qPCR, can vary from study to study because the RNA fingerprint strongly depends on the kind of experimental methods used. miREV also serves as a database. Interested parties can download the raw read counts and the associated metadata for further analyzes.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Validation",
                    "uri": "http://edamontology.org/operation_2428"
                }
            ]
        }
    ],
    "homepage": "https://www.physio.wzw.tum.de/mirev/",
    "lastUpdate": "2021-10-10T15:01:35.488796Z",
    "name": "miREV",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1016/J.JMB.2021.167070",
            "metadata": {
                "abstract": "© 2021Extracellular vesicles (EVs) are nano-sized, membrane-enclosed vesicles released by cells for intercellular communication. EVs are involved in pathological processes and miRNAs in EVs have gained interest as easily accessible biomolecules in liquid biopsies for diagnostic purposes. To validate potential miRNA biomarker, transcriptome analyses must be carried out to detect suitable reference miRNAs. miREV is a database with over 400 miRNA sequencing data sets and helps the researcher to find suitable reference miRNAs for their individual experimental setup. The researcher can put together a specific sample set in miREV, which is similar to his own experimental concept in order to find the most suitable references. This allows to run validation experiments without having to carry out a complex and costly transcriptome analysis priorly. Additional read count tables of each generated sample set are downloadable for further analysis. miREV is freely available at https://www.physio.wzw.tum.de/mirev/.",
                "authors": [
                    {
                        "name": "Hildebrandt A."
                    },
                    {
                        "name": "Kirchner B."
                    },
                    {
                        "name": "Nolte-'t Hoen E.N.M."
                    },
                    {
                        "name": "Pfaffl M.W."
                    }
                ],
                "date": "2021-07-23T00:00:00Z",
                "journal": "Journal of Molecular Biology",
                "title": "miREV: An Online Database and Tool to Uncover Potential Reference RNAs and Biomarkers in Small-RNA Sequencing Data Sets from Extracellular Vesicles Enriched Samples"
            },
            "pmid": "34052284",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "PCR experiment",
            "uri": "http://edamontology.org/topic_3519"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        }
    ]
}