{
    "additionDate": "2020-01-14T09:51:35Z",
    "biotoolsCURIE": "biotools:mpss",
    "biotoolsID": "mpss",
    "confidence_flag": "tool",
    "description": "RNA and Genomic Informatics Resources for Plants.\n\nAbout Next-Gen Sequence Databases.\n\nThe databases and the web pages (with customized web interfaces) were devloped to handle and display 'next-gen' sequencing data for several organisms and related varieties (mainly plants).\n\nThe database and the web pages that you see were produced by the Meyers lab at the Donald Danforth Plant Science Center.\n\nif you use data from this page.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Phasing",
                    "uri": "http://edamontology.org/operation_3454"
                },
                {
                    "term": "Sequence tag mapping",
                    "uri": "http://edamontology.org/operation_0527"
                },
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                },
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                }
            ]
        }
    ],
    "homepage": "https://mpss.danforthcenter.org",
    "lastUpdate": "2020-12-29T10:27:02Z",
    "name": "mpss",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1104/PP.19.00957",
            "metadata": {
                "abstract": "© 2020 American Society of Plant Biologists.We developed public web sites and resources for data access, display, and analysis of plant small RNAs. These web sites are interconnected with related data types. The current generation of these informatics tools was developed for Illumina data, evolving over more than 15 years of improvements. Our online databases have customized web interfaces to uniquely handle and display RNA-derived data from diverse plant species, ranging from Arabidopsis (Arabidopsis thaliana) to wheat (Triticum spp.), including many crop and model species. The web interface displays the abundance and genomic context of data for small RNAs, parallel analysis of RNA ends/degradome reads, RNA sequencing, and even chromatin immunoprecipitation sequencing data; it also provides information about potentially novel transcripts (antisense transcripts, alternative splice isoforms, and regulatory intergenic transcripts). Numerous options are included for downloading data as tables or via web services. Interpretation of these data is facilitated by the inclusion of extensive repeat or transposon data in our genome viewer. We have developed graphical and analytical tools, including a new viewer and a query page for the analysis of phased small RNAs; these are particularly useful for understanding the complex small RNA pathways of plants. These public databases are accessible at https://mpss.danforthcenter.org.",
                "authors": [
                    {
                        "name": "Nakano M."
                    },
                    {
                        "name": "McCormick K."
                    },
                    {
                        "name": "Demirci C."
                    },
                    {
                        "name": "Demirci F."
                    },
                    {
                        "name": "Gurazada S.G.R."
                    },
                    {
                        "name": "Ramachandruni D."
                    },
                    {
                        "name": "Dusia A."
                    },
                    {
                        "name": "Rothhaupt J.A."
                    },
                    {
                        "name": "Meyers B.C."
                    }
                ],
                "citationCount": 2,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Plant Physiology",
                "title": "Next-generation sequence databases: RNA and genomic informatics resources for plants"
            },
            "pmid": "31690707"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        },
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Informatics",
            "uri": "http://edamontology.org/topic_0605"
        }
    ],
    "validated": 1
}