{
    "additionDate": "2020-01-14T20:08:33Z",
    "biotoolsCURIE": "biotools:VDING",
    "biotoolsID": "VDING",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "lijiada@sklmg.edu.cn",
            "name": "Jia-Da Li",
            "typeEntity": "Person"
        },
        {
            "name": "ChangYun Fang",
            "orcidid": "https://orcid.org/0000-0002-4850-2515",
            "typeEntity": "Person"
        }
    ],
    "description": "Use of three points to determine the accuracy of guided implantation.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://github.com/coolleafly/VDING",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-01-16T17:51:24Z",
    "license": "GPL-3.0",
    "name": "VDING",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PONE.0225823",
            "metadata": {
                "abstract": "© 2019 Liang et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Aim ’This study aims to establish an open-source algorithm using Python to analyze the accuracy of guided implantation, which simplifies interstudy comparisons. Methods Given ≥3 landmark pairs, this Tri-Point (TriP) method can register images. With ≥4 landmark pairs, TriP can calculate system errors for image registration. We selected 8 indicators from the literature. Considering development errors in new bone on cone beam computed tomography (CBCT), we added the indicators of apical rectified deviation (ARD) and coronal rectified deviation (CRD), providing accurate references but neglecting depth deviations. Our program can calculate and output these indicators. To evaluate the TriP method’s feasibility, an implantation group assisted by a Visual Direction-INdicating Guide (VDING) was analyzed. Accuracy was measured with the traditional and proposed TriP methods. Factors affecting the system error of the method were then analyzed. Results Comparisons with paired-sample t-tests showed that our TriP method was similar to the traditional method in evaluating implantation accuracy, with no significant difference (P>0.05). The average system error was 0.30±0.10 mm when the TriP method evaluated the VDING template. The results showed that increasing the provided landmarks from 4 to 5 pairs decreased the between-group differences significantly (P<0.05). With ≥6 pairs of landmarks, the system error tended to be stable, and the groups showed no statistically significant differences (P>0.05). Large distances between landmarks are helpful in reducing system error, as demonstrated with a geometric method. Conclusions This study established an open-source algorithm to analyze the accuracy of guided implantation with system errors reported.",
                "authors": [
                    {
                        "name": "Fang C."
                    },
                    {
                        "name": "Huan J."
                    },
                    {
                        "name": "Li J.-D."
                    },
                    {
                        "name": "Liang Y."
                    },
                    {
                        "name": "Wang H."
                    },
                    {
                        "name": "Yuan S."
                    },
                    {
                        "name": "Zhang Yi.Yi."
                    }
                ],
                "date": "2019-12-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "Use of three points to determine the accuracy of guided implantation"
            },
            "pmcid": "PMC6890217",
            "pmid": "31794595"
        }
    ],
    "topic": [
        {
            "term": "Literature and language",
            "uri": "http://edamontology.org/topic_3068"
        },
        {
            "term": "Tomography",
            "uri": "http://edamontology.org/topic_3452"
        }
    ],
    "validated": 1
}
