{
    "additionDate": "2018-07-14T10:16:38Z",
    "biotoolsCURIE": "biotools:multidcox",
    "biotoolsID": "multidcox",
    "credit": [
        {
            "email": "e0146315@u.nus.edu",
            "name": "Herty Liany",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Space and time efficient procedure to identify differentially co-expressed gene sets and successfully identify influence of individual factors on differential co-expression.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/lianyh/MultiDCoX/blob/master/README.md"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                }
            ]
        }
    ],
    "homepage": "https://github.com/lianyh/MultiDCoX",
    "language": [
        "R"
    ],
    "lastUpdate": "2024-11-25T14:33:10.617286Z",
    "name": "MultiDCoX",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "migle_sur",
    "publication": [
        {
            "doi": "10.1186/s12859-017-1963-7",
            "metadata": {
                "abstract": "Background: Differential co-expression (DCX) signifies change in degree of co-expression of a set of genes among different biological conditions. It has been used to identify differential co-expression networks or interactomes. Many algorithms have been developed for single-factor differential co-expression analysis and applied in a variety of studies. However, in many studies, the samples are characterized by multiple factors such as genetic markers, clinical variables and treatments. No algorithm or methodology is available for multi-factor analysis of differential co-expression. Results: We developed a novel formulation and a computationally efficient greedy search algorithm called MultiDCoX to perform multi-factor differential co-expression analysis. Simulated data analysis demonstrates that the algorithm can effectively elicit differentially co-expressed (DCX) gene sets and quantify the influence of each factor on co-expression. MultiDCoX analysis of a breast cancer dataset identified interesting biologically meaningful differentially co-expressed (DCX) gene sets along with genetic and clinical factors that influenced the respective differential co-expression. Conclusions: MultiDCoX is a space and time efficient procedure to identify differentially co-expressed gene sets and successfully identify influence of individual factors on differential co-expression.",
                "authors": [
                    {
                        "name": "Karuturi R.K.M."
                    },
                    {
                        "name": "Liany H."
                    },
                    {
                        "name": "Rajapakse J.C."
                    }
                ],
                "citationCount": 4,
                "date": "2017-12-28T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "MultiDCoX: Multi-factor analysis of differential co-expression"
            },
            "pmcid": "PMC5751780",
            "pmid": "29297310",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        }
    ],
    "validated": 1
}
