{"credit":[{"email":"lmrodriguezr@gmail.com","name":"Luis M. Rodriguez-R","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"https://manual.microbial-genomes.org/part-iii-interfaces/miga-web"},{"type":"GENERAL","url":"https://manual.microbial-genomes.org"}],"download":[{"type":"API specification","url":"https://github.com/bio-miga/miga.git"},{"type":"Command-line specification","url":"https://github.com/bio-miga/miga.git"}],"function":[{"operation":[{"term":"Taxonomic classification","uri":"http://edamontology.org/operation_3460"}]},{"operation":[{"term":"Sequence trimming","uri":"http://edamontology.org/operation_3192"}]}],"labels":{"language":["Ruby"],"license":"Artistic-2.0","toolType":["Web application"],"topic":[{"term":"Microbiology","uri":"http://edamontology.org/topic_3301"},{"term":"Taxonomy","uri":"http://edamontology.org/topic_0637"},{"term":"Mapping","uri":"http://edamontology.org/topic_0102"}]},"link":[{"type":"REPOSITORY","url":"https://github.com/bio-miga/miga-web"}],"publication":[{"abstract":"© The Author(s) 2018. Published by Oxford University Press on behalf of Nucleic Acids Research. The small subunit ribosomal RNA gene (16S rRNA) has been successfully used to catalogue and study the diversity of prokaryotic species and communities but it offers limited resolution at the species and finer levels, and cannot represent the whole-genome diversity and fluidity. To overcome these limitations, we introduced the Microbial Genomes Atlas (MiGA), a webserver that allows the classification of an unknown query genomic sequence, complete or partial, against all taxonomically classified taxa with available genome sequences, as well as comparisons to other related genomes including uncultivated ones, based on the genome-aggregate Average Nucleotide and Amino Acid Identity (ANI/AAI) concepts. MiGA integrates best practices in sequence quality trimming and assembly and allows input to be raw reads or assemblies from isolate genomes, single-cell sequences, and metagenome-assembled genomes (MAGs). Further, MiGA can take as input hundreds of closely related genomes of the same or closely related species (a so-called €Clade Project') to assess their gene content diversity and evolutionary relationships, and calculate important clade properties such as the pangenome and core gene sets. Therefore, MiGA is expected to facilitate a range of genome-based taxonomic and diversity studies, and quality assessment across environmental and clinical settings. MiGA is available at http://microbial-genomes.org/.","authors":["Rodriguez-R L.M.","Gunturu S.","Harvey W.T.","Rossello-Mora R.","Tiedje J.M.","Cole J.R.","Konstantinidis K.T."],"cit_count":13,"doi":"10.1093/nar/gky467","journal":"Nucleic Acids Research","title":"The Microbial Genomes Atlas (MiGA) webserver: Taxonomic and gene diversity analysis of Archaea and Bacteria at the whole genome level","year":"2018-07-02"}],"summary":{"biotoolsCURIE":"biotools:miga-taxa","biotoolsID":"miga-taxa","description":"Classification of an unknown query genomic sequence, complete or partial, against all taxonomically classified taxa with available genome sequences, as well as comparisons to other related genomes including uncultivated ones, based on the genome-aggregate Average Nucleotide and Amino Acid Identity (ANI/AAI) concepts.","homepage":"http://microbial-genomes.org/","name":"MiGA"}}