{
    "additionDate": "2018-08-28T13:43:41Z",
    "biotoolsCURIE": "biotools:metmatch",
    "biotoolsID": "metmatch",
    "credit": [
        {
            "email": "rainer.schuhmacher@boku.ac.at",
            "name": "Rainer Schuhmacher",
            "orcidid": "http://orcid.org/0000-0002-7520-4943",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "MetMatch is a software tool for the semi-automated comparison of different LC-HRMS chromatograms of untargeted metabolomics experiments. It provides methods to correct the raw-LC-HRMS data for m/z and retention time shifts relative to one or several preprocessed reference chromatograms.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://metabolomics-ifa.boku.ac.at/MetMatch/software/Documentation_1.0.0.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Formatting",
                    "uri": "http://edamontology.org/operation_0335"
                }
            ]
        }
    ],
    "homepage": "https://metabolomics-ifa.boku.ac.at/MetMatch/index.html#",
    "language": [
        "Java"
    ],
    "lastUpdate": "2019-01-13T17:59:50Z",
    "license": "GPL-2.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/S-T-K/MetMatch"
        },
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/S-T-K/MetMatch/issues"
        }
    ],
    "name": "MetMatch",
    "operatingSystem": [
        "Windows"
    ],
    "owner": "daniel_stefan",
    "publication": [
        {
            "doi": "10.3390/metabo6040039",
            "metadata": {
                "abstract": "© 2016 by the authors; licensee MDPI, Basel, Switzerland.Due to its unsurpassed sensitivity and selectivity, LC-HRMS is one of the major analytical techniques in metabolomics research. However, limited stability of experimental and instrument parameters may cause shifts and drifts of retention time and mass accuracy or the formation of different ion species, thus complicating conclusive interpretation of the raw data, especially when generated in different analytical batches. Here, a novel software tool for the semi-automated alignment of different measurement sequences is presented. The tool is implemented in the Java programming language, it features an intuitive user interface and its main goal is to facilitate the comparison of data obtained from different metabolomics experiments. Based on a feature list (i.e., processed LC-HRMS chromatograms with mass-to-charge ratio (m/z) values and retention times) that serves as a reference, the tool recognizes both m/z and retention time shifts of single or multiple analytical datafiles/batches of interest. MetMatch is also designed to account for differently formed ion species of detected metabolites. Corresponding ions and metabolites are matched and chromatographic peak areas, m/z values and retention times are combined into a single data matrix. The convenient user interface allows for easy manipulation of processing results and graphical illustration of the raw data as well as the automatically matched ions and metabolites. The software tool is exemplified with LC-HRMS data from untargeted metabolomics experiments investigating phenylalanine-derived metabolites in wheat and T-2 toxin/HT-2 toxin detoxification products in barley.",
                "authors": [
                    {
                        "name": "Koch S."
                    },
                    {
                        "name": "Bueschl C."
                    },
                    {
                        "name": "Doppler M."
                    },
                    {
                        "name": "Simader A."
                    },
                    {
                        "name": "Meng-Reiterer J."
                    },
                    {
                        "name": "Lemmens M."
                    },
                    {
                        "name": "Schuhmacher R."
                    }
                ],
                "citationCount": 3,
                "date": "2016-12-01T00:00:00Z",
                "journal": "Metabolites",
                "title": "MetMatch: A semi-automated software tool for the comparison and alignment of LC-HRMS data from different metabolomics experiments"
            },
            "pmcid": "PMC5192445",
            "pmid": "27827849",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        }
    ],
    "validated": 1
}