
{
    "credit": [
        {
            "email": "gromiha@iitm.ac.in",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "https://www.iitm.ac.in/bioinfo/GAP/"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Protein structure prediction",
                    "uri": "http://edamontology.org/operation_0474"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Protein sequence analysis",
                    "uri": "http://edamontology.org/operation_2479"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Protein structure analysis",
                "uri": "http://edamontology.org/topic_2814"
            },
            {
                "term": "Proteins",
                "uri": "http://edamontology.org/topic_0078"
            },
            {
                "term": "Sequence analysis",
                "uri": "http://edamontology.org/topic_0080"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://www.mybiosoftware.com/gap-distinguishing-between-amyloid-fibril-forming-and-amorphous-ß-aggregating-aggregation-prone-regions.html"
        }
    ],
    "publication": [
        {
            "abstract": "Motivation: Distinguishing between amyloid fibril-forming and amorphous β-aggregating aggregation-prone regions (APRs) in proteins and peptides is crucial for designing novel biomaterials and improved aggregation inhibitors for biotechnological and therapeutic purposes. Results: Adjacent and alternate position residue pairs in hexapeptides show distinct preferences for occurrence in amyloid fibrils and amorphous β-aggregates. These observations were converted into energy potentials that were, in turn, machine learned. The resulting tool, called Generalized Aggregation Proneness (GAP), could successfully distinguish between amyloid fibril-forming and amorphous β-aggregating hexapeptides with almost 100 percent accuracies in validation tests performed using non-redundant datasets. Conclusion: Accuracies of the predictions made by GAP are significantly improved compared with other methods capable of predicting either general β-aggregation or amyloid fibril-forming APRs. This work demonstrates that amino acid side chains play important roles in determining the morphological fate of β-mediated aggregates formed by short peptides. © 2014 The Author 2014.",
            "authors": [
                "Thangakani A.M.",
                "Kumar S.",
                "Nagarajan R.",
                "Velmurugan D.",
                "Gromiha M.M."
            ],
            "cit_count": 21,
            "journal": "Bioinformatics",
            "pmid": "24681906",
            "title": "GAP: Towards almost 100 percent prediction for β-strand-mediated aggregating peptides with distinct morphologies",
            "year": "2014-07-15"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:gap",
        "biotoolsID": "gap",
        "description": "Distinguish between amyloid fibril-forming and amorphous ß-aggregating hexapeptides with almost 100 percent accuracies in validation tests performed using non-redundant datasets.",
        "homepage": "http://www.iitm.ac.in/bioinfo/GAP/",
        "name": "GAP"
    }
}