{
    "additionDate": "2019-11-14T19:40:27Z",
    "biotoolsCURIE": "biotools:MOOMIN",
    "biotoolsID": "MOOMIN",
    "confidence_flag": "tool",
    "description": "Mathematical explOration of 'Omics data on a MetabolIc Network | MOOMIN is a tool for analysing differential expression data | MOOMIN (Mathematical explOration of Omics data on a MetabolIc Network) is a tool for analysing differential expression data. It takes as its input a metabolic network and the results of a DE analysis: a posterior probability of differential expression and a (logarithm of a) fold change for a list of genes. It then forms a hypothesis of a metabolic shift, determining for each reaction its status as \"increased flux\", \"decreased flux\", or \"no change\". These are expressed as colours: red for an increase, blue for a decrease, and grey for no change. See the paper for full details: https://doi.org/10.1093/bioinformatics/btz584",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Differential gene expression analysis",
                    "uri": "http://edamontology.org/operation_3223"
                },
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                },
                {
                    "term": "Metabolic network modelling",
                    "uri": "http://edamontology.org/operation_3660"
                }
            ]
        }
    ],
    "homepage": "http://github.com/htpusa/moomin",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2020-12-29T10:09:40Z",
    "license": "MIT",
    "name": "MOOMIN",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ584",
            "metadata": {
                "abstract": "© 2019 The Author(s) 2019. Published by Oxford University Press.Motivation: Analysis of differential expression of genes is often performed to understand how the metabolic activity of an organism is impacted by a perturbation. However, because the system of metabolic regulation is complex and all changes are not directly reflected in the expression levels, interpreting these data can be difficult. Results: In this work, we present a new algorithm and computational tool that uses a genome-scale metabolic reconstruction to infer metabolic changes from differential expression data. Using the framework of constraint-based analysis, our method produces a qualitative hypothesis of a change in metabolic activity. In other words, each reaction of the network is inferred to have increased, decreased, or remained unchanged in flux. In contrast to similar previous approaches, our method does not require a biological objective function and does not assign on/off activity states to genes. An implementation is provided and it is available online. We apply the method to three published datasets to show that it successfully accomplishes its two main goals: confirming or rejecting metabolic changes suggested by differentially expressed genes based on how well they fit in as parts of a coordinated metabolic change, as well as inferring changes in reactions whose genes did not undergo differential expression.",
                "authors": [
                    {
                        "name": "Andrade R."
                    },
                    {
                        "name": "Ferrarini M.G."
                    },
                    {
                        "name": "Marchetti-Spaccamela A."
                    },
                    {
                        "name": "Mary A."
                    },
                    {
                        "name": "Pusa T."
                    },
                    {
                        "name": "Sagot M.-F."
                    },
                    {
                        "name": "Stougie L."
                    }
                ],
                "citationCount": 5,
                "date": "2020-01-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "MOOMIN - Mathematical explOration of 'Omics data on a MetabolIc Network"
            },
            "pmid": "31504164"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Endocrinology and metabolism",
            "uri": "http://edamontology.org/topic_3407"
        },
        {
            "term": "Mathematics",
            "uri": "http://edamontology.org/topic_3315"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ],
    "validated": 1
}
