{
    "additionDate": "2021-01-18T11:15:54Z",
    "biotoolsCURIE": "biotools:lncexpdb",
    "biotoolsID": "lncexpdb",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "zhangzhang@big.ac.cn",
            "name": "Zhang Zhang",
            "typeEntity": "Person"
        },
        {
            "email": "malina@big.ac.cn",
            "name": "Lina Ma",
            "typeEntity": "Person"
        }
    ],
    "description": "An expression database of human long non-coding RNAs.\n\nExpression Database of Human Long non-coding RNAs.\n\nLncExpDB is a comprehensive database for lncRNA expression. It covers expression profiles of lncRNA genes across various biological contexts, predicts potential functional lncRNAs and their interacting partners, and thus provides essential guidance on experimental design.",
    "download": [
        {
            "type": "Downloads page",
            "url": "https://bigd.big.ac.cn/lncexpdb/downloads"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                },
                {
                    "term": "Gene prediction",
                    "uri": "http://edamontology.org/operation_2454"
                }
            ]
        }
    ],
    "homepage": "https://bigd.big.ac.cn/lncexpdb",
    "lastUpdate": "2021-02-17T07:16:55Z",
    "name": "LncExpDB",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1093/NAR/GKAA850",
            "metadata": {
                "abstract": "© The Author(s) 2020. Published by Oxford University Press on behalf of Nucleic Acids Research.Expression profiles of long non-coding RNAs (lncRNAs) across diverse biological conditions provide significant insights into their biological functions, interacting targets as well as transcriptional reliability. However, there lacks a comprehensive resource that systematically characterizes the expression landscape of human lncRNAs by integrating their expression profiles across a wide range of biological conditions. Here, we present LncExpDB (https://bigd.big.ac.cn/lncexpdb), an expression database of human lncRNAs that is devoted to providing comprehensive expression profiles of lncRNA genes, exploring their expression features and capacities, identifying featured genes with potentially important functions, and building interactions with protein-coding genes across various biological contexts/conditions. Based on comprehensive integration and stringent curation, LncExpDB currently houses expression profiles of 101 293 high-quality human lncRNA genes derived from 1977 samples of 337 biological conditions across nine biological contexts. Consequently, LncExpDB estimates lncRNA genes' expression reliability and capacities, identifies 25 191 featured genes, and further obtains 28 443 865 lncRNA-mRNA interactions. Moreover, user-friendly web interfaces enable interactive visualization of expression profiles across various conditions and easy exploration of featured lncRNAs and their interacting partners in specific contexts. Collectively, LncExpDB features comprehensive integration and curation of lncRNA expression profiles and thus will serve as a fundamental resource for functional studies on human lncRNAs.",
                "authors": [
                    {
                        "name": "Li Z."
                    },
                    {
                        "name": "Liu L."
                    },
                    {
                        "name": "Jiang S."
                    },
                    {
                        "name": "Li Q."
                    },
                    {
                        "name": "Feng C."
                    },
                    {
                        "name": "Du Q."
                    },
                    {
                        "name": "Zou D."
                    },
                    {
                        "name": "Xiao J."
                    },
                    {
                        "name": "Zhang Z."
                    },
                    {
                        "name": "Ma L."
                    }
                ],
                "citationCount": 4,
                "date": "2021-01-08T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "LncExpDB: An expression database of human long non-coding RNAs"
            },
            "pmid": "33045751"
        }
    ],
    "toolType": [
        "Database portal",
        "Web service"
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "RNA immunoprecipitation",
            "uri": "http://edamontology.org/topic_3794"
        }
    ]
}