{
    "additionDate": "2021-01-18T07:05:32Z",
    "biotoolsCURIE": "biotools:deepeca",
    "biotoolsID": "deepeca",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "k-tomii@aist.go.jp",
            "name": "Kentaro Tomii",
            "orcidid": "https://orcid.org/0000-0002-4567-4768",
            "typeEntity": "Person"
        }
    ],
    "description": "DeepECA is an end-to-end learning framework for protein contact prediction from a multiple sequence alignment. It can be used for predicting protein contact residues and secondary structures from its amino acid sequence by using Deep Neural Network.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein secondary structure prediction",
                    "uri": "http://edamontology.org/operation_0267"
                },
                {
                    "term": "Residue contact prediction",
                    "uri": "http://edamontology.org/operation_0272"
                },
                {
                    "term": "Protein structure prediction",
                    "uri": "http://edamontology.org/operation_0474"
                },
                {
                    "term": "Sequence alignment",
                    "uri": "http://edamontology.org/operation_0292"
                },
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                }
            ]
        }
    ],
    "homepage": "https://github.com/tomiilab/DeepECA",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-02-24T16:03:18Z",
    "name": "DeepECA",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1186/S12859-019-3190-X",
            "metadata": {
                "abstract": "© 2020 The Author(s).Background: Recently developed methods of protein contact prediction, a crucially important step for protein structure prediction, depend heavily on deep neural networks (DNNs) and multiple sequence alignments (MSAs) of target proteins. Protein sequences are accumulating to an increasing degree such that abundant sequences to construct an MSA of a target protein are readily obtainable. Nevertheless, many cases present different ends of the number of sequences that can be included in an MSA used for contact prediction. The abundant sequences might degrade prediction results, but opportunities remain for a limited number of sequences to construct an MSA. To resolve these persistent issues, we strove to develop a novel framework using DNNs in an end-to-end manner for contact prediction. Results: We developed neural network models to improve precision of both deep and shallow MSAs. Results show that higher prediction accuracy was achieved by assigning weights to sequences in a deep MSA. Moreover, for shallow MSAs, adding a few sequential features was useful to increase the prediction accuracy of long-range contacts in our model. Based on these models, we expanded our model to a multi-task model to achieve higher accuracy by incorporating predictions of secondary structures and solvent-accessible surface areas. Moreover, we demonstrated that ensemble averaging of our models can raise accuracy. Using past CASP target protein domains, we tested our models and demonstrated that our final model is superior to or equivalent to existing meta-predictors. Conclusions: The end-to-end learning framework we built can use information derived from either deep or shallow MSAs for contact prediction. Recently, an increasing number of protein sequences have become accessible, including metagenomic sequences, which might degrade contact prediction results. Under such circumstances, our model can provide a means to reduce noise automatically. According to results of tertiary structure prediction based on contacts and secondary structures predicted by our model, more accurate three-dimensional models of a target protein are obtainable than those from existing ECA methods, starting from its MSA. DeepECA is available from https://github.com/tomiilab/DeepECA.",
                "authors": [
                    {
                        "name": "Fukuda H."
                    },
                    {
                        "name": "Tomii K."
                    }
                ],
                "citationCount": 11,
                "date": "2020-01-09T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "DeepECA: An end-to-end learning framework for protein contact prediction from a multiple sequence alignment"
            },
            "pmcid": "PMC6953294",
            "pmid": "31918654"
        }
    ],
    "toolType": [
        "Command-line tool",
        "Workflow"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Protein secondary structure",
            "uri": "http://edamontology.org/topic_3542"
        },
        {
            "term": "Structure prediction",
            "uri": "http://edamontology.org/topic_0082"
        },
        {
            "term": "Protein folds and structural domains",
            "uri": "http://edamontology.org/topic_0736"
        },
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        }
    ]
}