{
    "additionDate": "2020-01-14T09:06:25Z",
    "biotoolsCURIE": "biotools:C-JAMP",
    "biotoolsID": "C-JAMP",
    "confidence_flag": "tool",
    "description": "Powerful rare variant association testing in a copula-based joint analysis of multiple phenotypes.\n\nCopula-Based Joint Analysis of Multiple Phenotypes.\n\nWe provide a computationally efficient and robust implementation of the recently proposed C-JAMP (Copula-based Joint Analysis of Multiple Phenotypes) method (Konigorski et al., 2019, submitted)",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Collapsing methods",
                    "uri": "http://edamontology.org/operation_3791"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "https://cran.r-project.org/web/packages/CJAMP/index.html",
    "language": [
        "R",
        "C"
    ],
    "lastUpdate": "2020-12-09T16:26:05Z",
    "license": "GPL-2.0",
    "name": "C-JAMP",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1002/GEPI.22265",
            "metadata": {
                "abstract": "© 2019 The Authors. Genetic Epidemiology published by Wiley Periodicals, Inc.In genetic association studies of rare variants, the low power of association tests is one of the main challenges. In this study, we propose a new single-marker association test called C-JAMP (Copula-based Joint Analysis of Multiple Phenotypes), which is based on a joint model of multiple phenotypes given genetic markers and other covariates. We evaluated its performance and compared its empirical type I error and power with existing univariate and multivariate single-marker and multi-marker rare-variant tests in extensive simulation studies. C-JAMP yielded unbiased genetic effect estimates and valid type I errors with an adjusted test statistic. When strongly dependent traits were jointly analyzed, C-JAMP had the highest power in all scenarios except when a high percentage of variants were causal with moderate/small effect sizes. When traits with weak or moderate dependence were analyzed, whether C-JAMP or competing approaches had higher power depended on the effect size. When C-JAMP was applied with a misspecified copula function, it still achieved high power in some of the scenarios considered. In a real-data application, we analyzed sequencing data using C-JAMP and performed the first genome-wide association studies of high-molecular-weight and medium-molecular-weight adiponectin plasma concentrations. C-JAMP identified 20 rare variants with p-values smaller than 10−5, while all other tests resulted in the identification of fewer variants with higher p-values. In summary, the results indicate that C-JAMP is a powerful, flexible, and robust method for association studies, and we identified novel candidate markers for adiponectin. C-JAMP is implemented as an R package and freely available from https://cran.r-project.org/package=CJAMP.",
                "authors": [
                    {
                        "name": "Konigorski S."
                    },
                    {
                        "name": "Yilmaz Y.E."
                    },
                    {
                        "name": "Janke J."
                    },
                    {
                        "name": "Bergmann M.M."
                    },
                    {
                        "name": "Boeing H."
                    },
                    {
                        "name": "Pischon T."
                    }
                ],
                "citationCount": 1,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Genetic Epidemiology",
                "title": "Powerful rare variant association testing in a copula-based joint analysis of multiple phenotypes"
            },
            "pmid": "31732979"
        }
    ],
    "topic": [
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "GWAS study",
            "uri": "http://edamontology.org/topic_3517"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ],
    "validated": 1
}