{
    "additionDate": "2017-12-18T00:11:49Z",
    "biotoolsCURIE": "biotools:rnaseqbrowser",
    "biotoolsID": "rnaseqbrowser",
    "credit": [
        {
            "email": "gregor.tevz@qut.edu.au",
            "name": "Gregor Tevz",
            "orcidid": "http://orcid.org/0000-0002-4927-5123",
            "typeEntity": "Person",
            "typeRole": [
                "Contributor"
            ]
        },
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://www.mdc-berlin.de/1151037/en/research/research_teams/systems_biology_of_gene_regulatory_elements"
        }
    ],
    "description": "Visualization tool that incorporates and extends the functionality of the UCSC genome browser.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://www.australianprostatecentre.org/SoftwareAttachments/manual_deepview_V1.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genome visualisation",
                    "uri": "http://edamontology.org/operation_3208"
                }
            ]
        }
    ],
    "homepage": "http://www.australianprostatecentre.org/research/software/rnaseqbrowser",
    "language": [
        "Java"
    ],
    "lastUpdate": "2019-01-11T00:24:54Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/rnaseqbrowser-20150110-a-genome-browser-for-strand-specific-rnaseq-reads.html"
        }
    ],
    "name": "RNASeqBrowser",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1186/s12864-015-1346-2",
            "metadata": {
                "abstract": "© 2015 An et al.Background: Strand specific RNAseq data is now more common in RNAseq projects. Visualizing RNAseq data has become an important matter in Analysis of sequencing data. The most widely used visualization tool is the UCSC genome browser that introduced the custom track concept that enabled researchers to simultaneously visualize gene expression at a particular locus from multiple experiments. Our objective of the software tool is to provide friendly interface for visualization of RNAseq datasets. Results: This paper introduces a visualization tool (RNASeqBrowser) that incorporates and extends the functionality of the UCSC genome browser. For example, RNASeqBrowser simultaneously displays read coverage, SNPs, InDels and raw read tracks with other BED and wiggle tracks all being dynamically built from the BAM file. Paired reads are also connected in the browser to enable easier identification of novel exon/intron borders and chimaeric transcripts. Strand specific RNAseq data is also supported by RNASeqBrowser that displays reads above (positive strand transcript) or below (negative strand transcripts) a central line. Finally, RNASeqBrowser was designed for ease of use for users with few bioinformatic skills, and incorporates the features of many genome browsers into one platform. Conclusions: The features of RNASeqBrowser: (1) RNASeqBrowser integrates UCSC genome browser and NGS visualization tools such as IGV. It extends the functionality of the UCSC genome browser by adding several new types of tracks to show NGS data such as individual raw reads, SNPs and InDels. (2) RNASeqBrowser can dynamically generate RNA secondary structure. It is useful for identifying non-coding RNA such as miRNA. (3) Overlaying NGS wiggle data is helpful in displaying differential expression and is simple to implement in RNASeqBrowser. (4) NGS data accumulates a lot of raw reads. Thus, RNASeqBrowser collapses exact duplicate reads to reduce visualization space. Normal PC's can show many windows of NGS individual raw reads without much delay. (5) Multiple popup windows of individual raw reads provide users with more viewing space. This avoids existing approaches (such as IGV) which squeeze all raw reads into one window. This will be helpful for visualizing multiple datasets simultaneously. RNASeqBrowser and its manual are freely available at http://www.australianprostatecentre.org/research/software/rnaseqbrowseror http://sourceforge.net/projects/rnaseqbrowser/.",
                "authors": [
                    {
                        "name": "An J."
                    },
                    {
                        "name": "Lai J."
                    },
                    {
                        "name": "Lehman M.L."
                    },
                    {
                        "name": "Nelson C.C."
                    },
                    {
                        "name": "Sajjanhar A."
                    },
                    {
                        "name": "Tevz G."
                    },
                    {
                        "name": "Wang C."
                    },
                    {
                        "name": "Wood D.L.A."
                    }
                ],
                "citationCount": 5,
                "date": "2015-12-12T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "RNASeqBrowser: A genome browser for simultaneous visualization of raw strand specific RNAseq reads and UCSC genome browser custom tracks"
            },
            "pmcid": "PMC4355470",
            "pmid": "25766521",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        }
    ],
    "validated": 1,
    "version": [
        "V2"
    ]
}
