{
    "accessibility": "Open access (with restrictions)",
    "additionDate": "2021-06-14T12:32:21Z",
    "biotoolsCURIE": "biotools:covid-deeppredictor",
    "biotoolsID": "covid-deeppredictor",
    "collectionID": [
        "COVID-19"
    ],
    "confidence_flag": "tool",
    "cost": "Free of charge (with restrictions)",
    "credit": [
        {
            "email": "indrajit@nitttrkol.ac.in",
            "name": "Indrajit Saha",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "COVID-DeepPredictor is a recurrent neural network to predict SARS-CoV-2 and other pathogenic viruses.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Virulence prediction",
                    "uri": "http://edamontology.org/operation_3461"
                },
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                },
                {
                    "term": "Metal-binding site prediction",
                    "uri": "http://edamontology.org/operation_3898"
                }
            ]
        }
    ],
    "homepage": "http://www.nitttrkol.ac.in/indrajit/projects/COVID-DeepPredictor/",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2021-08-23T17:51:11.932667Z",
    "name": "COVID-DeepPredictor",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.3389/FGENE.2021.569120",
            "metadata": {
                "abstract": "© Copyright © 2021 Saha, Ghosh, Maity, Seal and Plewczynski.The COVID-19 disease for Novel coronavirus (SARS-CoV-2) has turned out to be a global pandemic. The high transmission rate of this pathogenic virus demands an early prediction and proper identification for the subsequent treatment. However, polymorphic nature of this virus allows it to adapt and sustain in different kinds of environment which makes it difficult to predict. On the other hand, there are other pathogens like SARS-CoV-1, MERS-CoV, Ebola, Dengue, and Influenza as well, so that a predictor is highly required to distinguish them with the use of their genomic information. To mitigate this problem, in this work COVID-DeepPredictor is proposed on the framework of deep learning to identify an unknown sequence of these pathogens. COVID-DeepPredictor uses Long Short Term Memory as Recurrent Neural Network for the underlying prediction with an alignment-free technique. In this regard, k-mer technique is applied to create Bag-of-Descriptors (BoDs) in order to generate Bag-of-Unique-Descriptors (BoUDs) as vocabulary and subsequently embedded representation is prepared for the given virus sequences. This predictor is not only validated for the dataset using (Formula presented.) -fold cross-validation but also for unseen test datasets of SARS-CoV-2 sequences and sequences from other viruses as well. To verify the efficacy of COVID-DeepPredictor, it has been compared with other state-of-the-art prediction techniques based on Linear Discriminant Analysis, Random Forests, and Gradient Boosting Method. COVID-DeepPredictor achieves 100% prediction accuracy on validation dataset while on test datasets, the accuracy ranges from 99.51 to 99.94%. It shows superior results over other prediction techniques as well. In addition to this, accuracy and runtime of COVID-DeepPredictor are considered simultaneously to determine the value of k in k-mer, a comparative study among k values in k-mer, Bag-of-Descriptors (BoDs), and Bag-of-Unique-Descriptors (BoUDs) and a comparison between COVID-DeepPredictor and Nucleotide BLAST have also been performed. The code, training, and test datasets used for COVID-DeepPredictor are available at http://www.nitttrkol.ac.in/indrajit/projects/COVID-DeepPredictor/.",
                "authors": [
                    {
                        "name": "Saha I."
                    },
                    {
                        "name": "Ghosh N."
                    },
                    {
                        "name": "Maity D."
                    },
                    {
                        "name": "Seal A."
                    },
                    {
                        "name": "Plewczynski D."
                    }
                ],
                "date": "2021-02-11T00:00:00Z",
                "journal": "Frontiers in Genetics",
                "title": "COVID-DeepPredictor: Recurrent Neural Network to Predict SARS-CoV-2 and Other Pathogenic Viruses"
            },
            "pmcid": "PMC7906283",
            "pmid": "33643375",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ]
}