{
    "additionDate": "2017-02-14T09:34:26Z",
    "biotoolsCURIE": "biotools:phemto",
    "biotoolsID": "phemto",
    "description": "Web server for evaluating protein electrostatic characteristics relative to their molecular interactions. Input is the atomic coordinate file in PDB format, output is electric/dipole moments and interactive visualization as well as the full electrostatic characteristics.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Formatting",
                    "uri": "http://edamontology.org/operation_0335"
                },
                {
                    "term": "Protein dipole moment calculation",
                    "uri": "http://edamontology.org/operation_0386"
                },
                {
                    "term": "Protein pH-dependent property calculation",
                    "uri": "http://edamontology.org/operation_0400"
                }
            ]
        }
    ],
    "homepage": "http://phemto.orgchm.bas.bg/",
    "homepage_status": 1,
    "lastUpdate": "2018-12-10T12:58:40Z",
    "name": "PHEMTO",
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "PHEMTO (protein pH-dependent electric moment tools) is released in response to the high demand in protein science community for evaluation of electrostatic characteristics in relations to molecular recognition. PHEMTO will serve protein scientists with new advanced features for analysis of protein molecular interactions: Electric/dipole moments, their pH-dependence and in silico charge mutagenesis effects on these properties as well as alternative algorithms for electric/dipole moment computation-Singular value decomposition of electrostatic potential (EP) to account for reaction field. The implementation is based on long-term experience-PHEI mean field electrostatics and PHEPS server for evaluation of global and local pH-dependent properties. However, PHEMTO is not just an update of our PHEPS server. Besides standard electrostatics, we offer new, advanced and useful features for analysis of protein molecular interactions. In addition our algorithms are very fast. Special emphasis is given to the interface-intuitive and user-friendly. The input is comprised of the atomic coordinate file in Protein Data Bank format. The advanced user is provided with a special input section for addition of non-polypeptide charges. The output covers actually full electrostatic characteristics but special emphasis is given to electric/dipole moments and their interactive visualization. PHEMTO server can be accessed at http://phemto.orgchm.bas.bg/.",
                "authors": [
                    {
                        "name": "Atanasov B.P."
                    },
                    {
                        "name": "Kantardjiev A.A."
                    }
                ],
                "citationCount": 18,
                "date": "2009-08-04T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "PHEMTO: Protein pH-dependent electric moment tools"
            },
            "pmid": "19420068"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        }
    ],
    "validated": 1
}
