{
    "additionDate": "2021-05-27T09:19:45Z",
    "biotoolsCURIE": "biotools:tigmint",
    "biotoolsID": "tigmint",
    "credit": [
        {
            "email": "rwarren@bcgsc.ca",
            "name": "BC Cancer Canada's Michael Smith Genome Sciences Centre",
            "typeEntity": "Division",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://www.bcgsc.ca/"
        }
    ],
    "description": "Tigmint is a tool for correcting misassemblies in genome assembly drafts using linked or long sequencing reads",
    "download": [
        {
            "type": "Container file",
            "url": "https://hub.docker.com/r/bcgsc/tigmint"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Scaffolding",
                    "uri": "http://edamontology.org/operation_3216"
                },
                {
                    "term": "Genome assembly",
                    "uri": "http://edamontology.org/operation_0525"
                },
                {
                    "term": "Sequence trimming",
                    "uri": "http://edamontology.org/operation_3192"
                },
                {
                    "term": "Mapping assembly",
                    "uri": "http://edamontology.org/operation_0523"
                },
                {
                    "term": "Read mapping",
                    "uri": "http://edamontology.org/operation_3198"
                }
            ]
        }
    ],
    "homepage": "https://github.com/bcgsc/tigmint",
    "language": [
        "C++"
    ],
    "lastUpdate": "2021-08-04T11:35:35Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/bcgsc/tigmint/issues"
        },
        {
            "type": [
                "Repository"
            ],
            "url": "https://pypi.org/project/tigmint/"
        }
    ],
    "name": "Tigmint",
    "operatingSystem": [
        "Mac",
        "Linux"
    ],
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1186/s12859-018-2425-6",
            "metadata": {
                "abstract": "© 2018 The Author(s).Background: Genome sequencing yields the sequence of many short snippets of DNA (reads) from a genome. Genome assembly attempts to reconstruct the original genome from which these reads were derived. This task is difficult due to gaps and errors in the sequencing data, repetitive sequence in the underlying genome, and heterozygosity. As a result, assembly errors are common. In the absence of a reference genome, these misassemblies may be identified by comparing the sequencing data to the assembly and looking for discrepancies between the two. Once identified, these misassemblies may be corrected, improving the quality of the assembled sequence. Although tools exist to identify and correct misassemblies using Illumina paired-end and mate-pair sequencing, no such tool yet exists that makes use of the long distance information of the large molecules provided by linked reads, such as those offered by the 10x Genomics Chromium platform. We have developed the tool Tigmint to address this gap. Results: To demonstrate the effectiveness of Tigmint, we applied it to assemblies of a human genome using short reads assembled with ABySS 2.0 and other assemblers. Tigmint reduced the number of misassemblies identified by QUAST in the ABySS assembly by 216 (27%). While scaffolding with ARCS alone more than doubled the scaffold NGA50 of the assembly from 3 to 8 Mbp, the combination of Tigmint and ARCS improved the scaffold NGA50 of the assembly over five-fold to 16.4 Mbp. This notable improvement in contiguity highlights the utility of assembly correction in refining assemblies. We demonstrate the utility of Tigmint in correcting the assemblies of multiple tools, as well as in using Chromium reads to correct and scaffold assemblies of long single-molecule sequencing. Conclusions: Scaffolding an assembly that has been corrected with Tigmint yields a final assembly that is both more correct and substantially more contiguous than an assembly that has not been corrected. Using single-molecule sequencing in combination with linked reads enables a genome sequence assembly that achieves both a high sequence contiguity as well as high scaffold contiguity, a feat not currently achievable with either technology alone.",
                "authors": [
                    {
                        "name": "Jackman S.D."
                    },
                    {
                        "name": "Coombe L."
                    },
                    {
                        "name": "Chu J."
                    },
                    {
                        "name": "Warren R.L."
                    },
                    {
                        "name": "Vandervalk B.P."
                    },
                    {
                        "name": "Yeo S."
                    },
                    {
                        "name": "Xue Z."
                    },
                    {
                        "name": "Mohamadi H."
                    },
                    {
                        "name": "Bohlmann J."
                    },
                    {
                        "name": "Jones S.J.M."
                    },
                    {
                        "name": "Birol I."
                    }
                ],
                "citationCount": 17,
                "date": "2018-10-26T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Tigmint: Correcting assembly errors using linked reads from large molecules"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        },
        {
            "term": "Structural variation",
            "uri": "http://edamontology.org/topic_3175"
        }
    ]
}