
{
    "credit": [
        {
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://health.bsd.uchicago.edu/yji/index.html"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Phasing",
                    "uri": "http://edamontology.org/operation_3454"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Base calling",
                    "uri": "http://edamontology.org/operation_3185"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "R"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "DNA",
                "uri": "http://edamontology.org/topic_0654"
            },
            {
                "term": "Sequencing",
                "uri": "http://edamontology.org/topic_3168"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/bm-bc-1-0-bayesian-method-of-base-calling-for-solexa-sequence-data.html"
        }
    ],
    "publication": [
        {
            "abstract": "Base calling is a critical step in the Solexa next-generation sequencing procedure. It compares the position-specific intensity measurements that reflect the signal strength of four possible bases (A, C, G, T) at each genomic position, and outputs estimates of the true sequences for short reads of DNA or RNA. We present a Bayesian method of base calling, BM-BC, for Solexa-GA sequencing data. The Bayesian method builds on a hierarchical model that accounts for three sources of noise in the data, which are known to affect the accuracy of the base calls: fading, phasing, and cross-talk between channels. We show that the new method improves the precision of base calling compared with currently leading methods. Furthermore, the proposed method provides a probability score that measures the confidence of each base call. This probability score can be used to estimate the false discovery rate of the base calling or to rank the precision of the estimated DNA sequences, which in turn can be useful for downstream analysis such as sequence alignment.",
            "authors": [
                "Ji Y.",
                "Mitra R.",
                "Quintana F.",
                "Jara A.",
                "Mueller P.",
                "Liu P.",
                "Lu Y.",
                "Liang S."
            ],
            "cit_count": 1,
            "doi": "10.1186/1471-2105-13-S13-S6",
            "journal": "BMC bioinformatics",
            "title": "BM-BC: a Bayesian method of base calling for Solexa sequence data.",
            "type": "Primary",
            "year": "2012-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:bm-bc",
        "biotoolsID": "bm-bc",
        "description": "BM-BC is a Bayesian method of base calling for Solexa-GA sequencing data. The Bayesian method builds on a hierarchical model that accounts for three sources of noise in the data, which are known to affect the accuracy of the base calls: fading, phasing, and cross-talk between channels.",
        "homepage": "http://health.bsd.uchicago.edu/yji/soft.html",
        "name": "BM-BC",
        "version": [
            "1.0"
        ]
    }
}