{
    "accessibility": "Open access",
    "additionDate": "2022-08-31T06:26:09.396249Z",
    "biotoolsCURIE": "biotools:abcstats",
    "biotoolsID": "abcstats",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Huaxu Yu",
            "orcidid": "https://orcid.org/0000-0002-2755-8325"
        },
        {
            "name": "Tao Huan",
            "orcidid": "https://orcid.org/0000-0001-6295-2435"
        }
    ],
    "description": "ABCstats is an R package for metabolomics data transformation. Adaptive Box-Cox (ABC) transformation improves the data normality for statistical analysis.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/HuanLab/ABCstats",
    "language": [
        "R"
    ],
    "lastUpdate": "2022-08-31T06:26:09.398631Z",
    "license": "MIT",
    "name": "ABCstats",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1021/ACS.ANALCHEM.2C00503",
            "metadata": {
                "abstract": "© 2022 American Chemical Society.Metabolomic data normality is vital for many statistical analyses to identify significantly different metabolic features. However, despite the thousands of metabolomic publications every year, the study of metabolomic data distribution is rare. Using large-scale metabolomic data sets, we performed a comprehensive study of metabolomic data distributions. We showcased that metabolic features have diverse data distribution types, and the majority of them cannot be normalized correctly using conventional data transformation algorithms, including log and square root transformations. To understand the various non-normal data distributions, we proposed fitting metabolomic data into nine beta distributions, each representing a unique data distribution. The results of three large-scale data sets consistently show that two low normality types are very common. Next, we created the adaptive Box-Cox (ABC) transformation, a novel feature-specific data transformation approach for improving data normality. By tuning a power parameter based on a normality test result, ABC transformation was made to work for various data distribution types, and it showed great performance in normalizing skewed metabolomic data. Tested on a series of simulated data in Monte Carlo simulations, ABC transformation outperformed conventional data transformation approaches for both positively and negatively skewed data distributions. ABC transformation was further demonstrated in a real metabolomic study composed of three pairwise comparisons. Additional 84, 44, and 57 significant metabolites were newly confirmed after ABC transformation, corresponding to respective increases of 70.6, 13.4, and 22.9% in significant metabolites compared to the conventional metabolomic workflow. Some of these newly discovered metabolites showed promising biological meanings. ABC transformation was implemented in the R package ABCstats and is freely available on GitHub (https://github.com/HuanLab/ABCstats).",
                "authors": [
                    {
                        "name": "Huan T."
                    },
                    {
                        "name": "Sang P."
                    },
                    {
                        "name": "Yu H."
                    }
                ],
                "date": "2022-06-14T00:00:00Z",
                "journal": "Analytical Chemistry",
                "title": "Adaptive Box-Cox Transformation: A Highly Flexible Feature-Specific Data Transformation to Improve Metabolomic Data Normality for Better Statistical Analysis"
            },
            "pmid": "35657711"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Endocrinology and metabolism",
            "uri": "http://edamontology.org/topic_3407"
        },
        {
            "term": "Mathematics",
            "uri": "http://edamontology.org/topic_3315"
        },
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ],
    "validated": 1
}
