{
    "additionDate": "2020-01-14T19:53:01Z",
    "biotoolsCURIE": "biotools:SGL-SVM",
    "biotoolsID": "SGL-SVM",
    "confidence_flag": "high",
    "description": "A novel method for tumor classification via support vector machine with sparse group Lasso.\n\nAt present, with the in-depth study of gene expression data, the significant role of tumor classification in clinical medicine has become more apparent. In particular, the sparse characteristics of gene expression data within and between groups. Therefore, this paper focuses on the study of tumor classification based on the sparsity characteristics of genes. On this basis, we propose a new method of tumor classification-Sparse Group Lasso (least absolute shrinkage and selection operator) and Support Vector Machine (SGL-SVM). Firstly, the primary selection of feature genes is performed on the normalized tumor datasets using the Kruskal-Wallis rank sum test. Secondly, using a sparse group Lasso for further selection, and finally, the support vector machine serves as a classifier for classification. We validate proposed method on microarray and NGS datasets respectively",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/QUST-AIBBDRC/SGL-SVM/",
    "language": [
        "R"
    ],
    "lastUpdate": "2020-01-14T19:53:01Z",
    "name": "SGL-SVM",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1016/J.JTBI.2019.110098",
            "metadata": {
                "abstract": "© 2019At present, with the in-depth study of gene expression data, the significant role of tumor classification in clinical medicine has become more apparent. In particular, the sparse characteristics of gene expression data within and between groups. Therefore, this paper focuses on the study of tumor classification based on the sparsity characteristics of genes. On this basis, we propose a new method of tumor classification—Sparse Group Lasso (least absolute shrinkage and selection operator) and Support Vector Machine (SGL-SVM). Firstly, the primary selection of feature genes is performed on the normalized tumor datasets using the Kruskal–Wallis rank sum test. Secondly, using a sparse group Lasso for further selection, and finally, the support vector machine serves as a classifier for classification. We validate proposed method on microarray and NGS datasets respectively. Formerly, on three two-class and five multi-class microarray datasets it is tested by 10-fold cross-validation and compared with other three classifiers. SGL-SVM is then applied on BRCA and GBM datasets and tested by 5-fold cross-validation. Satisfactory accuracy is obtained by above experiments and compared with other proposed methods. The experimental results show that the proposed method achieves a higher classification accuracy and selects fewer feature genes, which can be widely applied in classification for high-dimensional and small-sample tumor datasets. The source code and all datasets are available at https://github.com/QUST-AIBBDRC/SGL-SVM/.",
                "authors": [
                    {
                        "name": "Huo Y."
                    },
                    {
                        "name": "Xin L."
                    },
                    {
                        "name": "Kang C."
                    },
                    {
                        "name": "Wang M."
                    },
                    {
                        "name": "Ma Q."
                    },
                    {
                        "name": "Yu B."
                    }
                ],
                "date": "2020-02-07T00:00:00Z",
                "journal": "Journal of Theoretical Biology",
                "title": "SGL-SVM: A novel method for tumor classification via support vector machine with sparse group Lasso"
            },
            "pmid": "31786183"
        }
    ],
    "topic": [
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        },
        {
            "term": "Medicine",
            "uri": "http://edamontology.org/topic_3303"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        }
    ]
}