{
    "accessibility": "Open access",
    "additionDate": "2022-08-01T11:51:50.576845Z",
    "biotoolsCURIE": "biotools:edese",
    "biotoolsID": "edese",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "limiaoxin@mail.sysu.edu.cn",
            "name": "Miaoxin Li",
            "orcidid": "https://orcid.org/0000-0002-4733-0109",
            "typeEntity": "Person"
        },
        {
            "name": "Xiangyi Li"
        }
    ],
    "description": "A conditional gene-based association framework integrating isoform-level eQTL data reveals new susceptibility genes for schizophrenia",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene expression QTL analysis",
                    "uri": "http://edamontology.org/operation_3232"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                }
            ]
        }
    ],
    "homepage": "https://github.com/pmglab/eDESE",
    "language": [
        "Java",
        "R"
    ],
    "lastUpdate": "2024-11-24T15:51:10.418543Z",
    "license": "MIT",
    "name": "eDESE",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.7554/elife.70779",
            "metadata": {
                "abstract": "Linkage disequilibrium and disease-associated variants in the non-coding regions make it difficult to distinguish the truly associated genes from the redundantly associated genes for complex diseases. In this study, we proposed a new conditional gene-based framework called eDESE that leveraged an improved effective chi-squared statistic to control the type I error rates and remove the redundant associations. eDESE initially performed the association analysis by mapping variants to genes according to their physical distance. We further demonstrated that the isoform-level eQTLs could be more powerful than the gene-level eQTLs in the association analysis using a simulation study. Then the eQTL-guided strategies, that is, mapping variants to genes according to their gene/isoform-level variant-gene cis-eQTLs associations, were also integrated with eDESE. We then applied eDESE to predict the potential susceptibility genes of schizophrenia and found that the potential susceptibility genes were enriched with many neuronal or synaptic signaling-related terms in the Gene Ontology knowledgebase and antipsychotics-gene interaction terms in the drug-gene interaction database (DGIdb). More importantly, seven potential susceptibility genes identified by eDESE were the target genes of multiple antipsychotics in DrugBank. Comparing the potential susceptibility genes identified by eDESE and other benchmark approaches (i.e., MAGMA and S-PrediXcan) implied that strategy based on the isoform-level eQTLs could be an important supplement for the other two strategies (physical distance and gene-level eQTLs). We have implemented eDESE in our integrative platform KGGSEE (http://pmglab.top/kggsee/#/) and hope that eDESE can facilitate the prediction of candidate susceptibility genes and isoforms for complex diseases in a multi-tissue context.",
                "authors": [
                    {
                        "name": "Jiang L."
                    },
                    {
                        "name": "Jun Li M."
                    },
                    {
                        "name": "Li M."
                    },
                    {
                        "name": "Li X."
                    },
                    {
                        "name": "Xue C."
                    }
                ],
                "citationCount": 5,
                "date": "2022-04-01T00:00:00Z",
                "journal": "eLife",
                "title": "A conditional gene-based association framework integrating isoform-level eQTL data reveals new susceptibility genes for schizophrenia"
            },
            "pmcid": "PMC9005191",
            "pmid": "35412455"
        }
    ],
    "toolType": [
        "Workbench"
    ],
    "topic": [
        {
            "term": "GWAS study",
            "uri": "http://edamontology.org/topic_3517"
        },
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Systems biology",
            "uri": "http://edamontology.org/topic_2259"
        }
    ],
    "validated": 1
}
