{
    "additionDate": "2019-11-14T18:15:15Z",
    "biotoolsCURIE": "biotools:tCNNS",
    "biotoolsID": "tCNNS",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "pfliu@cse.cuhk.edu.hk",
            "name": "Pengfei Liu",
            "orcidid": "https://orcid.org/0000-0003-1510-0621",
            "typeEntity": "Person"
        }
    ],
    "description": "Improving prediction of phenotypic drug response on cancer cell lines using deep convolutional network | twin CNN channels on drugs and cancer cell lines",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Lowpassfilter/tCNNS-Project",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-12-27T14:53:35Z",
    "name": "tCNNS",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12859-019-2910-6",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Understanding the phenotypic drug response on cancer cell lines plays a vital role in anti-cancer drug discovery and re-purposing. The Genomics of Drug Sensitivity in Cancer (GDSC) database provides open data for researchers in phenotypic screening to build and test their models. Previously, most research in these areas starts from the molecular fingerprints or physiochemical features of drugs, instead of their structures. Results: In this paper, a model called twin Convolutional Neural Network for drugs in SMILES format (tCNNS) is introduced for phenotypic screening. tCNNS uses a convolutional network to extract features for drugs from their simplified molecular input line entry specification (SMILES) format and uses another convolutional network to extract features for cancer cell lines from the genetic feature vectors respectively. After that, a fully connected network is used to predict the interaction between the drugs and the cancer cell lines. When the training set and the testing set are divided based on the interaction pairs between drugs and cell lines, tCNNS achieves 0.826, 0.831 for the mean and top quartile of the coefficient of determinant (R 2) respectively and 0.909, 0.912 for the mean and top quartile of the Pearson correlation (R p ) respectively, which are significantly better than those of the previous works (Ammad-Ud-Din et al., J Chem Inf Model 54:2347-9, 2014), (Haider et al., PLoS ONE 10:0144490, 2015), (Menden et al., PLoS ONE 8:61318, 2013). However, when the training set and the testing set are divided exclusively based on drugs or cell lines, the performance of tCNNS decreases significantly and R p and R 2 drop to barely above 0. Conclusions: Our approach is able to predict the drug effects on cancer cell lines with high accuracy, and its performance remains stable with less but high-quality data, and with fewer features for the cancer cell lines. tCNNS can also solve the problem of outliers in other feature space. Besides achieving high scores in these statistical metrics, tCNNS also provides some insights into the phenotypic screening. However, the performance of tCNNS drops in the blind test.",
                "authors": [
                    {
                        "name": "Liu P."
                    },
                    {
                        "name": "Li H."
                    },
                    {
                        "name": "Li S."
                    },
                    {
                        "name": "Leung K.-S."
                    }
                ],
                "citationCount": 19,
                "date": "2019-07-29T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Improving prediction of phenotypic drug response on cancer cell lines using deep convolutional network"
            },
            "pmcid": "PMC6664725",
            "pmid": "31357929"
        }
    ],
    "topic": [
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Drug discovery",
            "uri": "http://edamontology.org/topic_3336"
        }
    ],
    "validated": 1
}