
{
    "credit": [
        {
            "email": "jcoombs@cns.umass.edu",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://bcrc.bio.umass.edu/pedigreesoftware/node/9"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Nucleic acid sequence analysis",
                    "uri": "http://edamontology.org/operation_2478"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Windows"
        ],
        "toolType": [
            "Desktop application"
        ],
        "topic": [
            {
                "term": "Genetics",
                "uri": "http://edamontology.org/topic_3053"
            },
            {
                "term": "Population genetics",
                "uri": "http://edamontology.org/topic_3056"
            },
            {
                "term": "Genetic variation",
                "uri": "http://edamontology.org/topic_0199"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://www.mybiosoftware.com/1-03-estimating-effective-size-ne-populations-overlapping-generations.html"
        }
    ],
    "publication": [
        {
            "abstract": "GONe is a user-friendly, Windows-based program for estimating effective size (N e) in populations with overlapping generations. It uses the Jorde-Ryman modification to the temporal method to account for age structure in populations. This method requires estimates of age-specific survival and birth rate and allele frequencies measured in two or more consecutive cohorts. Allele frequencies are acquired by reading in genotypic data from files formatted for either GENEPOP or TEMPOFS. For each interval between consecutive cohorts, N e is estimated at each locus and over all loci. Furthermore, N e estimates are output for three different genetic drift estimators (F s, F c and F k). Confidence intervals are derived from a chi-square distribution with degrees of freedom equal to the number of independent alleles. GONe has been validated over a wide range of N e values, and for scenarios where survival and birth rates differ between sexes, sex ratios are unequal and reproductive variances differ. GONe is freely available for download at. © 2011 Blackwell Publishing Ltd.",
            "authors": [
                "Coombs J.A.",
                "Letcher B.H.",
                "Nislow K.H."
            ],
            "cit_count": 13,
            "journal": "Molecular Ecology Resources",
            "pmid": "21827640",
            "title": "GONe: Software for estimating effective population size in species with generational overlap",
            "year": "2012-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:gone",
        "biotoolsID": "gone",
        "description": "User-friendly, Windows-based program for estimating effective size (Ne) in populations with overlapping generations. It uses the Jorde-Ryman modification to the temporal method to account for age-structure in populations.",
        "homepage": "http://bcrc.bio.umass.edu/pedigreesoftware/node/9",
        "name": "GONe"
    }
}