{
    "additionDate": "2017-01-17T14:58:53Z",
    "biotoolsCURIE": "biotools:genphen",
    "biotoolsID": "genphen",
    "collectionID": [
        "BioConductor"
    ],
    "credit": [
        {
            "email": "simo.kitanovski@uni-due.de",
            "name": "Simo Kitanovski",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "This tool conducts genetic association studies by using statistical learning techniques such as random forests and support vector machines, as well as Bayesian inference with hierarchical models. It alleviates the multiple hypothesis problems and the need for P value corrections, which often lead to massive numbers of false negatives.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://bioconductor.org/packages/release/bioc/html/genphen.html"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://bioconductor/packages/release/bioc/src/contrib/genphen_1.2.0.tar.gz"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                }
            ]
        }
    ],
    "homepage": "http://bioconductor.org/packages/release/bioc/html/genphen.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-10T12:58:54Z",
    "license": "GPL-2.0",
    "name": "genphen",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "bioconductor_import",
    "publication": [
        {
            "doi": "10.1016/j.eja.2004.11.005",
            "metadata": {
                "abstract": "A recurring challenge in agronomic research is how to interpret large data sets that combine information on genotypes, phenotypes and environments. High-resolution color graphics offer the possibility of presenting such data as pseudo-maps or arrays, where x- and y-coordinates represent genotypes and environments, and the z-values represent phenotypic data using dots or other symbols and an appropriate color scheme to indicate the range of values. This paper describes use of such \"GenPhEn arrays\" with data from three studies: a survey of leaf thickness in common bean (Phaseolus vulgaris L.) lines, a multi-location trial of wheat (Triticum aestivum L.) lines and a simulation analysis for response of common bean to increased air temperature. By standardizing the phenotypic values, the genotypic and environmental effects can be easily viewed and better comprehended, especially when presented in multi-trait arrays. The arrays allow presenting large amounts of data (i.e., 5000 data points or more) in a compact and readily interpretable fashion. Appending symbols to indicate levels of significance of specific effects or to characterize genotypes or environments can further assist interpretation and hypothesis generation. It is expected that GenPhEn arrays can be used by plant breeders, agronomists and others to rapidly examine large sets of data for patterns that merit further study using more quantitative approaches.",
                "authors": [
                    {
                        "name": "Hoogenboom G."
                    },
                    {
                        "name": "White J.W."
                    }
                ],
                "citationCount": 1,
                "date": "2005-09-01T00:00:00Z",
                "journal": "European Journal of Agronomy",
                "title": "Integrated viewing and analysis of phenotypic, genotypic and environmental data with \"GenPhEn arrays\""
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool",
        "Library"
    ],
    "topic": [
        {
            "term": "GWAS study",
            "uri": "http://edamontology.org/topic_3517"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        }
    ],
    "validated": 1,
    "version": [
        "1.2.0"
    ]
}
