{
    "additionDate": "2024-06-19T07:31:10.776359Z",
    "biotoolsCURIE": "biotools:rarpkb",
    "biotoolsID": "rarpkb",
    "confidence_flag": "high",
    "credit": [
        {
            "email": "bairong.shen@scu.edu.cn",
            "name": "Bairong Shen"
        }
    ],
    "description": "A knowledge-guide decision support platform for personalized robot-assisted surgery in prostate cancer.",
    "editPermission": {
        "type": "public"
    },
    "homepage": "http://rarpkb.bioinf.org.cn",
    "language": [
        "JavaScript",
        "SQL"
    ],
    "lastUpdate": "2024-11-24T13:52:14.343381Z",
    "name": "RARPKB",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1097/js9.0000000000001290",
            "metadata": {
                "abstract": "BACKGROUND: Robot-assisted radical prostatectomy (RARP) has emerged as a pivotal surgical intervention for the treatment of prostate cancer (PCa). However, the complexity of clinical cases, heterogeneity of PCa, and limitations in physician expertise pose challenges to rational decision-making in RARP. To address these challenges, the authors aimed to organize the knowledge of previously complex cohorts and establish an online platform named the RARP knowledge base (RARPKB) to provide reference evidence for personalized treatment plans. MATERIALS AND METHODS: PubMed searches over the past two decades were conducted to identify publications describing RARP. The authors collected, classified, and structured surgical details, patient information, surgical data, and various statistical results from the literature. A knowledge-guided decision-support tool was established using MySQL, DataTable, ECharts, and JavaScript. ChatGPT-4 and two assessment scales were used to validate and compare the platform. RESULTS: The platform comprised 583 studies, 1589 cohorts, 1 911 968 patients, and 11 986 records, resulting in 54 834 data entries. The knowledge-guided decision support tool provide personalized surgical plan recommendations and potential complications on the basis of patients' baseline and surgical information. Compared with ChatGPT-4, RARPKB outperformed in authenticity (100% vs. 73%), matching (100% vs. 53%), personalized recommendations (100% vs. 20%), matching of patients (100% vs. 0%), and personalized recommendations for complications (100% vs. 20%). Postuse, the average System Usability Scale score was 88.88±15.03, and the Net Promoter Score of RARPKB was 85. The knowledge base is available at: http://rarpkb.bioinf.org.cn . CONCLUSIONS: The authors introduced the pioneering RARPKB, the first knowledge base for robot-assisted surgery, with an emphasis on PCa. RARPKB can assist in personalized and complex surgical planning for PCa to improve its efficacy. RARPKB provides a reference for the future applications of artificial intelligence in clinical practice.",
                "authors": [
                    {
                        "name": "Feng W."
                    },
                    {
                        "name": "Li J."
                    },
                    {
                        "name": "Qin Y."
                    },
                    {
                        "name": "Qin Y."
                    },
                    {
                        "name": "Ren S."
                    },
                    {
                        "name": "Shen B."
                    },
                    {
                        "name": "Shen Z."
                    },
                    {
                        "name": "Tang T."
                    },
                    {
                        "name": "Wang D."
                    },
                    {
                        "name": "Wei Q."
                    },
                    {
                        "name": "Wu E."
                    },
                    {
                        "name": "Wu R."
                    },
                    {
                        "name": "Yang L."
                    },
                    {
                        "name": "Zhan C."
                    },
                    {
                        "name": "Zhang K."
                    },
                    {
                        "name": "Zhao J."
                    },
                    {
                        "name": "Zong H."
                    }
                ],
                "citationCount": 4,
                "date": "2024-06-01T00:00:00Z",
                "journal": "International journal of surgery (London, England)",
                "title": "RARPKB: a knowledge-guide decision support platform for personalized robot-assisted surgery in prostate cancer"
            },
            "pmid": "38498357"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Surgery",
            "uri": "http://edamontology.org/topic_3421"
        }
    ]
}
