{
    "accessibility": "Open access",
    "additionDate": "2019-05-17T08:53:57Z",
    "biotoolsCURIE": "biotools:BayesPI-BAR2",
    "biotoolsID": "BayesPI-BAR2",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "batmanov.kn@gmail.com",
            "name": "Kirill Batmanov",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "junbai.wang@rr-research.no",
            "name": "Junbai Wang",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Python Package for Predicting Functional Non-coding Mutations in Cancer Patient Cohorts.",
    "download": [
        {
            "type": "Software package",
            "url": "http://folk.uio.no/junbaiw/BayesPI-BAR2/bayespi_bar2_package.tgz"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Polymorphism detection",
                    "uri": "http://edamontology.org/operation_3202"
                },
                {
                    "term": "Protein modelling",
                    "uri": "http://edamontology.org/operation_0477"
                }
            ]
        }
    ],
    "homepage": "http://folk.uio.no/junbaiw/BayesPI-BAR2/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-06-16T10:55:21Z",
    "maturity": "Mature",
    "name": "BayesPI-BAR2",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "Ruta",
    "publication": [
        {
            "doi": "10.3389/fgene.2019.00282",
            "metadata": {
                "abstract": "© 2007 - 2019 Frontiers Media S.A. All Rights Reserved.Most of somatic mutations in cancer occur outside of gene coding regions. These mutations may disrupt the gene regulation by affecting protein-DNA interaction. A study of these disruptions is important in understanding tumorigenesis. However, current computational tools process DNA sequence variants individually, when predicting the effect on protein-DNA binding. Thus, it is a daunting task to identify functional regulatory disturbances among thousands of mutations in a patient. Previously, we have reported and validated a pipeline for identifying functional non-coding somatic mutations in cancer patient cohorts, by integrating diverse information such as gene expression, spatial distribution of the mutations, and a biophysical model for estimating protein binding affinity. Here, we present a new user-friendly Python package BayesPI-BAR2 based on the proposed pipeline for integrative whole-genome sequence analysis. This may be the first prediction package that considers information from both multiple mutations and multiple patients. It is evaluated in follicular lymphoma and skin cancer patients, by focusing on sequence variants in gene promoter regions. BayesPI-BAR2 is a useful tool for predicting functional non-coding mutations in whole genome sequencing data: it allows identification of novel transcription factors (TFs) whose binding is altered by non-coding mutations in cancer. BayesPI-BAR2 program can analyze multiple datasets of genome-wide mutations at once and generate concise, easily interpretable reports for potentially affected gene regulatory sites.",
                "authors": [
                    {
                        "name": "Batmanov K."
                    },
                    {
                        "name": "Delabie J."
                    },
                    {
                        "name": "Wang J."
                    }
                ],
                "citationCount": 1,
                "date": "2019-01-01T00:00:00Z",
                "journal": "Frontiers in Genetics",
                "title": "BayesPI-BAR2: A new python package for predicting functional non-coding mutations in cancer patient cohorts"
            },
            "pmcid": "PMC6454009",
            "pmid": "31001324",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ],
    "validated": 1
}
