{
    "additionDate": "2017-03-30T21:27:43Z",
    "biotoolsCURIE": "biotools:cipro_2.5",
    "biotoolsID": "cipro_2.5",
    "collectionID": [
        "Proteomics"
    ],
    "credit": [
        {
            "email": "endo@ibio.jp",
            "name": "T. Endo",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "The Ciona intestinalis protein database is an integrated protein database for the tunicate species C. intestinalis. The database collects published data as well as unique information from unpublished experimental data at various developmental stages, curated annotation data and various bioinformatic data. Homologs in humans and major model organisms are included. Annotations are open to evaluation by users through the CIPRO website.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://cipro.ibio.jp/current/#Help|FAQ"
        }
    ],
    "editPermission": {
        "authors": [
            "proteomics.bio.tools"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein modelling",
                    "uri": "http://edamontology.org/operation_0477"
                },
                {
                    "term": "Gene expression clustering",
                    "uri": "http://edamontology.org/operation_0313"
                },
                {
                    "term": "Gene expression profiling",
                    "uri": "http://edamontology.org/operation_0314"
                },
                {
                    "term": "Protein feature detection",
                    "uri": "http://edamontology.org/operation_3092"
                }
            ]
        }
    ],
    "homepage": "http://cipro.ibio.jp/2.5",
    "language": [
        "Java",
        "Perl"
    ],
    "lastUpdate": "2019-03-26T08:13:16Z",
    "name": "CIPRO 2.5",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "The Ciona intestinalis protein database (CIPRO) is an integrated protein database for the tunicate species C. intestinalis. The database is unique in two respects: first, because of its phylogenetic position, Ciona is suitable model for understanding vertebrate evolution; and second, the database includesoriginal large-scale transcriptomic and proteomic data. Ciona intestinalis has also been a favorite ofdevelopmental biologists. Therefore, large amounts of data exist on its development and morphology, along with a recent genome sequence and geneexpression data. The CIPRO database is aimed at collecting those published data as well as providing unique information from unpublished experimental data, such as 3D expression profiling, 2D-PAGE and mass spectrometry-based large-scale analysesat various developmental stages, curated annotation data and various bioinformatic data, to facilitate research in diverse areas, including developmental, comparative and evolutionary biology. For medical and evolutionary research, homologs in humans and major model organisms are intentionally included. The current database is based on a recently developed KH model containing 36 034 unique sequences, but for higher usability it covers 89 683 all known and predicted proteins from all gene models for this species. Of these sequences, more than 10 000 proteins have been manually annotated. Furthermore, to establish a communitysupported protein database, these annotations are open to evaluation by users through the CIPRO website. CIPRO 2.5 is freely accessible at http:// cipro.ibio.jp/2.5. © The Author(s) 2010.",
                "authors": [
                    {
                        "name": "Endo T."
                    },
                    {
                        "name": "Ueno K."
                    },
                    {
                        "name": "Yonezawa K."
                    },
                    {
                        "name": "Mineta K."
                    },
                    {
                        "name": "Hotta K."
                    },
                    {
                        "name": "Satou Y."
                    },
                    {
                        "name": "Yamada L."
                    },
                    {
                        "name": "Ogasawara M."
                    },
                    {
                        "name": "Takahashi H."
                    },
                    {
                        "name": "Nakajima A."
                    },
                    {
                        "name": "Nakachi M."
                    },
                    {
                        "name": "Nomura M."
                    },
                    {
                        "name": "Yaguchi J."
                    },
                    {
                        "name": "Sasakura Y."
                    },
                    {
                        "name": "Yamasaki C."
                    },
                    {
                        "name": "Sera M."
                    },
                    {
                        "name": "Yoshizawa A.C."
                    },
                    {
                        "name": "Imanishi T."
                    },
                    {
                        "name": "Taniguchi H."
                    },
                    {
                        "name": "Inaba K."
                    }
                ],
                "citationCount": 23,
                "date": "2011-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "CIPRO 2.5: Ciona intestinalis protein database, a unique integrated repository of large-scale omics data, bioinformatic analyses and curated annotation, with user rating and reviewing functionality"
            },
            "pmid": "21071393"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        }
    ]
}