{
    "additionDate": "2022-09-06T12:13:32.208309Z",
    "biotoolsCURIE": "biotools:cgnet",
    "biotoolsID": "cgnet",
    "confidence_flag": "tool",
    "credit": [
        {
            "name": "Jianhua Mo"
        },
        {
            "name": "Xiaojun Yu"
        }
    ],
    "description": "A novel end-to-end three-stage channel and position attention (CPA) module integrated graph reasoning convolutional neural network (CGNet) for retinal OCTA vessel segmentation.",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://github.com/GE-123-cpu/CGnet-for-vessel-segmentation",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-09-06T12:13:32.211378Z",
    "license": "Not licensed",
    "name": "CGNet",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1002/JBIO.202200067",
            "metadata": {
                "abstract": "© 2022 Wiley-VCH GmbH.Automatic optical coherence tomography angiography (OCTA) vessel segmentation is of great significance to retinal disease diagnoses. Due to the complex vascular structure, however, various existing factors make the segmentation task challenging. This paper reports a novel end-to-end three-stage channel and position attention (CPA) module integrated graph reasoning convolutional neural network (CGNet) for retinal OCTA vessel segmentation. Specifically, in the coarse stage, both CPA and graph reasoning network (GRN) modules are integrated in between a U-shaped neural network encoder and decoder to acquire vessel confidence maps. After being directed into a fine stage, such confidence maps are concatenated with the original image and the generated fine image map as a 3-channel image to refine retinal micro-vasculatures. Finally, both the fine and refined images are fused at the refining stage as the segmentation results. Experiments with different public datasets are conducted to verify the efficacy of the proposed CGNet. Results show that by employing the end-to-end training scheme and the integrated CPA and GRN modules, CGNet achieves 94.29% and 85.62% in area under the ROC curve (AUC) for the two different datasets, outperforming the state-of-the-art existing methods with both improved operability and reduced complexity in different cases. Code is available at https://github.com/GE-123-cpu/CGnet-for-vessel-segmentation.",
                "authors": [
                    {
                        "name": "Aziz M.Z."
                    },
                    {
                        "name": "Ge C."
                    },
                    {
                        "name": "Li M."
                    },
                    {
                        "name": "Liu L."
                    },
                    {
                        "name": "Mo J."
                    },
                    {
                        "name": "Shum P.P."
                    },
                    {
                        "name": "Yu X."
                    }
                ],
                "date": "2022-01-01T00:00:00Z",
                "journal": "Journal of Biophotonics",
                "title": "CGNet-assisted Automatic Vessel Segmentation for Optical Coherence Tomography Angiography"
            },
            "pmid": "35704010"
        }
    ],
    "toolType": [
        "Workbench"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Tomography",
            "uri": "http://edamontology.org/topic_3452"
        }
    ]
}
