{
    "additionDate": "2017-03-25T12:40:42Z",
    "biotoolsCURIE": "biotools:spot",
    "biotoolsID": "spot",
    "credit": [
        {
            "email": "SPOT-request@isi.edu",
            "name": "SPOT Support",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://spot.cgsmd.isi.edu/submit.php"
        }
    ],
    "description": "A web‐based program that prioritizes the results of a genetic association study using genomic annotation data.Given a collection that are to receive higher priority when selecting SNPs for further study after an initial genetic association study, SPOT offers a systematic way of doing this while taking into a account a variety range of additional biological information.",
    "documentation": [
        {
            "type": "General",
            "url": "https://spot.cgsmd.isi.edu/doc/user_guide.pdf"
        }
    ],
    "editPermission": {
        "authors": [
            "DRCAT"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "SNP detection",
                    "uri": "http://edamontology.org/operation_0484"
                }
            ]
        }
    ],
    "homepage": "http://spot.cgsmd.isi.edu",
    "homepage_status": 1,
    "language": [
        "Perl"
    ],
    "lastUpdate": "2019-11-21T08:13:15Z",
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/spot-biological-prioritization-after-a-snp-association-study.html"
        }
    ],
    "name": "SPOT",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "SPOT (http://spot.cgsmd.isi.edu), the SNP prioritization online tool, is a web site for integrating biological databases into the prioritization of single nucleotide polymorphisms (SNPs) for further study after a genome-wide association study (GWAS). Typically, the next step after a GWAS is to genotype the top signals in an independent replication sample. Investigators will often incorporate information from biological databases so that biologically relevant SNPs, such as those in genes related to the phenotype or with potentially non-neutral effects on gene expression such as a splice sites, are given higher priority. We recently introduced the genomic information network (GIN) method for systematically implementing this kind of strategy. The SPOT web site allows users to upload a list of SNPs and GWAS P-values and returns a prioritized list of SNPs using the GIN method. Users can specify candidate genes or genomic regions with custom levels of prioritization. The results can be downloaded or viewed in the browser where users can interactively explore the details of each SNP, including graphical representations of the GIN method. For investigators interested in incorporating biological databases into a post-GWAS SNP selection strategy, the SPOT web tool is an easily implemented and flexible solution. © The Author(s) 2010. Published by Oxford University Press.",
                "authors": [
                    {
                        "name": "Saccone S.F."
                    },
                    {
                        "name": "Bolze R."
                    },
                    {
                        "name": "Thomas P."
                    },
                    {
                        "name": "Quan J."
                    },
                    {
                        "name": "Mehta G."
                    },
                    {
                        "name": "Deelman E."
                    },
                    {
                        "name": "Tischfield J.A."
                    },
                    {
                        "name": "Rice J.P."
                    }
                ],
                "citationCount": 42,
                "date": "2010-06-05T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "SPOT: A web-based tool for using biological databases to prioritize SNPs after a genome-wide association study"
            },
            "pmid": "20529875"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        },
        {
            "term": "GWAS study",
            "uri": "http://edamontology.org/topic_3517"
        }
    ],
    "validated": 1
}