{
    "accessibility": "Open access",
    "additionDate": "2021-11-28T12:40:52.162215Z",
    "biotoolsCURIE": "biotools:faang_data_portal",
    "biotoolsID": "faang_data_portal",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "peter@ebi.ac.uk",
            "name": "Peter W. Harrison",
            "typeEntity": "Person"
        }
    ],
    "description": "Global, Open-Access, \"FAIR\", and Richly Validated Genotype to Phenotype Data for High-Quality Functional Annotation of Animal Genomes.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Validation",
                    "uri": "http://edamontology.org/operation_2428"
                }
            ]
        }
    ],
    "homepage": "https://data.faang.org",
    "lastUpdate": "2021-11-28T12:40:52.165376Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/FAANG"
        }
    ],
    "name": "FAANG Data Portal",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.3389/FGENE.2021.639238",
            "metadata": {
                "abstract": "© Copyright © 2021 Harrison, Sokolov, Nayak, Fan, Zerbino, Cochrane and Flicek.The Functional Annotation of ANimal Genomes (FAANG) project is a worldwide coordinated action creating high-quality functional annotation of farmed and companion animal genomes. The generation of a rich genome-to-phenome resource and supporting informatic infrastructure advances the scope of comparative genomics and furthers the understanding of functional elements. The project also provides terrestrial and aquatic animal agriculture community powerful resources for supporting improvements to farmed animal production, disease resistance, and genetic diversity. The FAANG Data Portal (https://data.faang.org) ensures Findable, Accessible, Interoperable and Reusable (FAIR) open access to the wealth of sample, sequencing, and analysis data produced by an ever-growing number of FAANG consortia. It is developed and maintained by the FAANG Data Coordination Centre (DCC) at the European Molecular Biology Laboratory's European Bioinformatics Institute (EMBL-EBI). FAANG projects produce a standardised set of multi-omic assays with resulting data placed into a range of specialised open data archives. To ensure this data is easily findable and accessible by the community, the portal automatically identifies and collates all submitted FAANG data into a single easily searchable resource. The Data Portal supports direct download from the multiple underlying archives to enable seamless access to all FAANG data from within the portal itself. The portal provides a range of predefined filters, powerful predictive search, and a catalogue of sampling and analysis protocols and automatically identifies publications associated with any dataset. To ensure all FAANG data submissions are high-quality, the portal includes powerful contextual metadata validation and data submissions brokering to the underlying EMBL-EBI archives. The portal will incorporate extensive new technical infrastructure to effectively deliver and standardise FAANG's shift to single-cellomics, cell atlases, pangenomes, and novel phenotypic prediction models. The Data Portal plays a key role for FAANG by supporting high-quality functional annotation of animal genomes, through open FAIR sharing of data, complete with standardised rich metadata. Future Data Portal features developed by the DCC will support new technological developments for continued improvement for FAANG projects.",
                "authors": [
                    {
                        "name": "Cochrane G."
                    },
                    {
                        "name": "Fan J."
                    },
                    {
                        "name": "Flicek P."
                    },
                    {
                        "name": "Harrison P.W."
                    },
                    {
                        "name": "Nayak A."
                    },
                    {
                        "name": "Sokolov A."
                    },
                    {
                        "name": "Zerbino D."
                    }
                ],
                "date": "2021-06-17T00:00:00Z",
                "journal": "Frontiers in Genetics",
                "title": "The FAANG Data Portal: Global, Open-Access, “FAIR”, and Richly Validated Genotype to Phenotype Data for High-Quality Functional Annotation of Animal Genomes"
            },
            "pmcid": "PMC8248360",
            "pmid": "34220930"
        }
    ],
    "toolType": [
        "Bioinformatics portal"
    ],
    "topic": [
        {
            "term": "Agricultural science",
            "uri": "http://edamontology.org/topic_3810"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Informatics",
            "uri": "http://edamontology.org/topic_0605"
        },
        {
            "term": "Sample collections",
            "uri": "http://edamontology.org/topic_3277"
        },
        {
            "term": "Zoology",
            "uri": "http://edamontology.org/topic_3500"
        }
    ]
}
