{
    "additionDate": "2021-11-29T11:52:56.354385Z",
    "biotoolsCURIE": "biotools:sancdb",
    "biotoolsID": "sancdb",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "O.tastanbishop@ru.ac.za",
            "name": "Özlem Tastan Bishop",
            "orcidid": "https://orcid.org/0000-0001-6861-7849",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "South African Natural Compounds Database (SANCDB) is the sole and a fully referenced database of natural chemical compounds of South African biodiversity.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Scaffolding",
                    "uri": "http://edamontology.org/operation_3216"
                },
                {
                    "term": "Virtual screening",
                    "uri": "http://edamontology.org/operation_3938"
                }
            ]
        }
    ],
    "homepage": "https://sancdb.rubi.ru.ac.za/",
    "lastUpdate": "2021-11-29T11:52:56.357060Z",
    "name": "SANCDB",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1186/S13321-021-00514-2",
            "metadata": {
                "abstract": "© 2021, The Author(s).Background: South African Natural Compounds Database (SANCDB; https://sancdb.rubi.ru.ac.za/) is the sole and a fully referenced database of natural chemical compounds of South African biodiversity. It is freely available, and since its inception in 2015, the database has become an important resource to several studies. Its content has been: used as training data for machine learning models; incorporated to larger databases; and utilized in drug discovery studies for hit identifications. Description: Here, we report the updated version of SANCDB. The new version includes 412 additional compounds that have been reported since 2015, giving a total of 1012 compounds in the database. Further, although natural products (NPs) are an important source of unique scaffolds, they have a major drawback due to their complex structure resulting in low synthetic feasibility in the laboratory. With this in mind, SANCDB is, now, updated to provide direct links to commercially available analogs from two major chemical databases namely Mcule and MolPort. To our knowledge, this feature is not available in other NP databases. Additionally, for easier access to information by users, the database and website interface were updated. The compounds are now downloadable in many different chemical formats. Conclusions: The drug discovery process relies heavily on NPs due to their unique chemical organization. This has inspired the establishment of numerous NP chemical databases. With the emergence of newer chemoinformatic technologies, existing chemical databases require constant updates to facilitate information accessibility and integration by users. Besides increasing the NPs compound content, the updated SANCDB allows users to access the individual compounds (if available) or their analogs from commercial databases seamlessly. Graphic abstract: [Figure not available: see fulltext.]",
                "authors": [
                    {
                        "name": "Diallo B.N."
                    },
                    {
                        "name": "Glenister M."
                    },
                    {
                        "name": "Lobb K."
                    },
                    {
                        "name": "Musyoka T.M."
                    },
                    {
                        "name": "Tastan Bishop O."
                    }
                ],
                "citationCount": 1,
                "date": "2021-12-01T00:00:00Z",
                "journal": "Journal of Cheminformatics",
                "title": "SANCDB: an update on South African natural compounds and their readily available analogs"
            },
            "pmcid": "PMC8097257",
            "pmid": "33952332",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Biodiversity",
            "uri": "http://edamontology.org/topic_3050"
        },
        {
            "term": "Cheminformatics",
            "uri": "http://edamontology.org/topic_2258"
        },
        {
            "term": "Drug discovery",
            "uri": "http://edamontology.org/topic_3336"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
