{
    "name": "BETASEQ", 
    "description": "Powerful method to control Type-I error inflation in partially sequenced data for rare variant association testing. It is typically used to combine sequence and genotype data for the two stage design, in which individuals sequenced in stage one for variant detection are solely or predominantly cases then in stage two the discovered variants are genotyped in the remaining individuals. It can work with any existing rare variant association methods that use genotypes or imputed genotypes as input.", 
    "homepage": "https://yunliweb.its.unc.edu/betaseq/", 
    "biotoolsID": "betaseq", 
    "biotoolsCURIE": "biotools:betaseq", 
    "version": [], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_3197", 
                    "term": "Genetic variation analysis"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Library"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_0199", 
            "term": "Genetic variation"
        }
    ], 
    "operatingSystem": [
        "Linux", 
        "Windows", 
        "Mac"
    ], 
    "language": [
        "R"
    ], 
    "license": "Unlicensed", 
    "collectionID": [
        "Animal and Crop Genomics"
    ], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [], 
    "download": [], 
    "documentation": [
        {
            "url": "http://www.unc.edu/~yunmli/betaseq/tutorial.php", 
            "type": "General", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btt719", 
            "pmid": null, 
            "pmcid": null, 
            "type": "Primary", 
            "version": null, 
            "metadata": {
                "title": "BETASEQ: A powerful novel method to control type-I error inflation in partially sequenced data for rare variant association testing", 
                "abstract": "Summary: Despite its great capability to detect rare variant associations, next-generation sequencing is still prohibitively expensive when applied to large samples. In case-control studies, it is thus appealing to sequence only a subset of cases to discover variants and genotype the identified variants in controls and the remaining cases under the reasonable assumption that causal variants are usually enriched among cases. However, this approach leads to inflated type-I error if analyzed naively for rare variant association. Several methods have been proposed in recent literature to control type-I error at the cost of either excluding some sequenced cases or correcting the genotypes of discovered rare variants. All of these approaches thus suffer from certain extent of information loss and thus are underpowered. We propose a novel method (BETASEQ), which corrects inflation of type-I error by supplementing pseudo-variants while keeps the original sequence and genotype data intact. Extensive simulations and real data analysis demonstrate that, in most practical situations, BETASEQ leads to higher testing powers than existing approaches with guaranteed (controlled or conservative) type-I error.Availability and implementation: BETASEQ and associated R files, including documentation, examples, are available at http://www.unc.edu/∼yunmli/betaseqContact: or yunli@med.unc.eduSupplementary information: Supplementary data are available at Bioinformatics online. © 2013 The Author.", 
                "date": "2014-02-15T00:00:00Z", 
                "citationCount": 1, 
                "authors": [
                    {
                        "name": "Yan S."
                    }, 
                    {
                        "name": "Li Y."
                    }
                ], 
                "journal": "Bioinformatics"
            }
        }
    ], 
    "credit": [
        {
            "name": null, 
            "email": "songyan@unc.edu", 
            "url": null, 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "vzn529@binf.ku.dk", 
    "additionDate": "2017-08-20T15:16:02Z", 
    "lastUpdate": "2019-01-29T11:58:25Z", 
    "editPermission": {
        "type": "group", 
        "authors": [
            "animalandcropgenomics"
        ]
    }, 
    "validated": 1, 
    "homepage_status": 0, 
    "elixir_badge": 0
}