{"credit":[{"email":"dario.greco@staff.uta.fi","name":"Dario Greco","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"https://github.com/Greco-Lab/INfORM"}],"function":[{"operation":[{"term":"Gene expression analysis","uri":"http://edamontology.org/operation_2495"}]}],"labels":{"language":["R"],"operatingSystem":["Linux","Mac"],"toolType":["Command-line tool"],"topic":[{"term":"Genetics","uri":"http://edamontology.org/topic_3053"},{"term":"Transcriptomics","uri":"http://edamontology.org/topic_3308"},{"term":"Molecular interactions, pathways and networks","uri":"http://edamontology.org/topic_0602"}]},"publication":[{"abstract":"© The Author(s) 2018. Summary Detecting and interpreting responsive modules from gene expression data by using network-based approaches is a common but laborious task. It often requires the application of several computational methods implemented in different software packages, forcing biologists to compile complex analytical pipelines. Here we introduce INfORM (Inference of NetwOrk Response Modules), an R shiny application that enables non-expert users to detect, evaluate and select gene modules with high statistical and biological significance. INfORM is a comprehensive tool for the identification of biologically meaningful response modules from consensus gene networks inferred by using multiple algorithms. It is accessible through an intuitive graphical user interface allowing for a level of abstraction from the computational steps. Availability and implementation INfORM is freely available for academic use at https://github.com/Greco-Lab/INfORM. Supplementary informationSupplementary dataare available at Bioinformatics online.","authors":["Marwah V.S.","Kinaret P.A.S.","Serra A.","Scala G.","Lauerma A.","Fortino V.","Greco D."],"cit_count":0,"doi":"10.1093/bioinformatics/bty063","journal":"Bioinformatics","title":"INfORM: Inference of NetwOrk Response Modules","year":"2018-06-15"}],"summary":{"biotoolsCURIE":"biotools:inform","biotoolsID":"inform","description":"A novel computational method and its R and web-based implementations, to perform inference of gene network from transcriptome data and prioritization of key genes with central functional and topological role in the network.","homepage":"https://github.com/Greco-Lab/INfORM","name":"INfORM"}}