
{
    "credit": [
        {
            "email": "a0023748@nus.edu.sg",
            "name": "Wang Xu",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        },
        {
            "email": "statyy@nus.edu.sg",
            "name": "Dr. Yik Ying Teo",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://www.statgen.nus.edu.sg/~software/regionalP.html"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "SNP detection",
                    "uri": "http://edamontology.org/operation_0484"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "C++"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Desktop application"
        ],
        "topic": [
            {
                "term": "Genetics",
                "uri": "http://edamontology.org/topic_3053"
            },
            {
                "term": "DNA polymorphism",
                "uri": "http://edamontology.org/topic_2885"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://www.mybiosoftware.com/regionalp-1-0-region-based-meta-analysis-genome-wide-association-studies-genetically-diverse-populations.html"
        }
    ],
    "publication": [
        {
            "abstract": "Genome-wide association studies (GWAS) have become the preferred experimental design in exploring the genetic etiology of complex human traits and diseases. Standard SNP-based meta-analytic approaches have been utilized to integrate the results from multiple experiments. This fundamentally assumes that the patterns of linkage disequilibrium (LD) between the underlying causal variants and the directly genotyped SNPs are similar across the populations for the same SNPs to emerge with surrogate evidence of disease association. We introduce a novel strategy for assessing regional evidence of phenotypic association that explicitly incorporates the extent of LD in the region. This provides a natural framework for combining evidence from multi-ethnic studies of both dichotomous and quantitative traits that (i) accommodates different patterns of LD, (ii) integrates different genotyping platforms and (iii) allows for the presence of allelic heterogeneity between the populations. Our method can also be generalized to perform gene-based or pathway-based analyses. Applying this method on real GWAS data in type 2 diabetes (T2D) boosted the association evidence in regions well-established for T2D etiology in three diverse South-East Asian populations, as well as identified two novel gene regions and a biologically convincing pathway that are subsequently validated with data from the Wellcome Trust Case Control Consortium. © 2012 Macmillan Publishers Limited All rights reserved.",
            "authors": [
                "Wang X.",
                "Liu X.",
                "Sim X.",
                "Xu H.",
                "Khor C.-C.",
                "Ong R.T.-H.",
                "Tay W.-T.",
                "Suo C.",
                "Poh W.-T.",
                "Ng D.P.-K.",
                "Liu J.",
                "Aung T.",
                "Chia K.-S.",
                "Wong T.-Y.",
                "Tai E.-S.",
                "Teo Y.-Y."
            ],
            "cit_count": 8,
            "journal": "European Journal of Human Genetics",
            "pmid": "22126751",
            "title": "A statistical method for region-based meta-analysis of genome-wide association studies in genetically diverse populations",
            "year": "2012-04-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:regionalp",
        "biotoolsID": "regionalp",
        "description": "The software works by quantifying the degree of over-representation of associated SNPs in a pre-defined genomic region, given a specific definition of statistical significance.",
        "homepage": "http://www.statgen.nus.edu.sg/~software/regionalP.html",
        "name": "RegionalP"
    }
}