{
    "additionDate": "2021-01-18T08:09:53Z",
    "biotoolsCURIE": "biotools:supercypspred",
    "biotoolsID": "supercypspred",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "priyanka.banerjee@charite.de",
            "name": "Priyanka Banerjee",
            "orcidid": "https://orcid.org/0000-0001-8072-5594",
            "typeEntity": "Person"
        }
    ],
    "description": "web server for the prediction of cytochrome activity.\n\nSuperCYPsPred - a web server for the prediction of cytochrome activity; AG Preissner; Charité Berlin.\n\nDrug metabolism via the cytochrome P450 system has emerged as an important determinant in the occurrence of several drug interactions that can result in drug toxicities, reduced pharmacological effect, and adverse drug reactions. Recognizing whether the drugs involved act as enzyme substrates, inducers, or inhibitors can prevent clinically significant interactions from occurring. The SuperCYPsPred web server is focused on five major CYPs isoforms, including 1A2, 2C9, 2C19, 2D6 and 3A4, that are responsible for more than 90% of the metabolism of clinical drugs. Besides the predictions, the web server provides literature curated details on known cytochrome interaction network of approved drugs.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Metabolic network modelling",
                    "uri": "http://edamontology.org/operation_3660"
                },
                {
                    "term": "Metabolic pathway prediction",
                    "uri": "http://edamontology.org/operation_3929"
                },
                {
                    "term": "Virtual screening",
                    "uri": "http://edamontology.org/operation_3938"
                }
            ]
        }
    ],
    "homepage": "http://insilico-cyp.charite.de/SuperCYPsPred/",
    "lastUpdate": "2021-02-24T12:26:31Z",
    "name": "SuperCYPsPred",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1093/NAR/GKAA166",
            "metadata": {
                "abstract": "© The Author(s) 2020. Published by Oxford University Press on behalf of Nucleic Acids Research.Cytochrome P450 enzymes (CYPs)-mediated drug metabolism influences drug pharmacokinetics and results in adverse outcomes in patients through drug-drug interactions (DDIs). Absorption, distribution, metabolism, excretion and toxicity (ADMET) issues are the leading causes for the failure of a drug in the clinical trials. As details on their metabolism are known for just half of the approved drugs, a tool for reliable prediction of CYPs specificity is needed. The SuperCYPsPred web server is currently focused on five major CYPs isoenzymes, which includes CYP1A2, CYP2C19, CYP2D6, CYP2C9 and CYP3A4 that are responsible for more than 80% of the metabolism of clinical drugs. The prediction models for classification of the CYPs inhibition are based on well-established machine learning methods. The models were validated both on cross-validation and external validation sets and achieved good performance. The web server takes a 2D chemical structure as input and reports the CYP inhibition profile of the chemical for 10 models using different molecular fingerprints, along with confidence scores, similar compounds, known CYPs information of drugs-published in literature, detailed interaction profile of individual cytochromes including a DDIs table and an overall CYPs prediction radar chart (http://insilico-cyp.charite.de/SuperCYPsPred/). The web server does not require log in or registration and is free to use.",
                "authors": [
                    {
                        "name": "Banerjee P."
                    },
                    {
                        "name": "Dunkel M."
                    },
                    {
                        "name": "Kemmler E."
                    },
                    {
                        "name": "Preissner R."
                    }
                ],
                "citationCount": 5,
                "date": "2021-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "SuperCYPsPred-a web server for the prediction of cytochrome activity"
            },
            "pmcid": "PMC7319455",
            "pmid": "32182358"
        }
    ],
    "topic": [
        {
            "term": "Drug metabolism",
            "uri": "http://edamontology.org/topic_3375"
        },
        {
            "term": "Endocrinology and metabolism",
            "uri": "http://edamontology.org/topic_3407"
        },
        {
            "term": "Enzymes",
            "uri": "http://edamontology.org/topic_0821"
        },
        {
            "term": "Pharmacology",
            "uri": "http://edamontology.org/topic_0202"
        },
        {
            "term": "Preclinical and clinical studies",
            "uri": "http://edamontology.org/topic_3379"
        }
    ]
}
