{
    "accessibility": "Open access",
    "additionDate": "2022-09-19T16:16:09.385448Z",
    "biotoolsCURIE": "biotools:hocomoco",
    "biotoolsID": "hocomoco",
    "description": "HOmo sapiens transcription factor COmprehensive MOdel COllection contains transcription factor (TF) binding models (motifs) as position weight matrices for human and mouse transcription factors.",
    "download": [
        {
            "type": "Downloads page",
            "url": "https://hocomoco11.autosome.org/downloads_v11",
            "version": "11"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data handling",
                    "uri": "http://edamontology.org/operation_2409"
                }
            ]
        }
    ],
    "homepage": "https://hocomoco.autosome.org",
    "lastUpdate": "2022-09-19T16:16:09.388373Z",
    "maturity": "Mature",
    "name": "HOCOMOCO",
    "owner": "ivan.kulakovskiy",
    "publication": [
        {
            "doi": "10.1093/nar/gkx1106",
            "metadata": {
                "abstract": "© The Author(s) 2017. Published by Oxford University Press on behalf of Nucleic Acids Research.We present a major update of the HOCOMOCO collection that consists of patterns describing DNA binding specificities for human and mouse transcription factors. In this release, we profited from a nearly doubled volume of published in vivo experiments on transcription factor (TF) binding to expand the repertoire of binding models, replace low-quality models previously based on in vitro data only and cover more than a hundred TFs with previously unknown binding specificities. This was achieved by systematic motif discovery from more than five thousand ChIP-Seq experiments uniformly processed within the BioUML framework with several ChIP-Seq peak calling tools and aggregated in the GTRD database. HOCOMOCO v11 contains binding models for 453 mouse and 680 human transcription factors and includes 1302 mononucleotide and 576 dinucleotide position weight matrices, which describe primary binding preferences of each transcription factor and reliable alternative binding specificities. An interactive interface and bulk downloads are available on the web: http://hocomoco.autosome.ru and http://www.cbrc.kaust.edu.sa/hocomoco11. In this release, we complement HOCOMOCO by MoLoTool (Motif Location Toolbox, http://molotool.autosome.ru) that applies HOCOMOCO models for visualization of binding sites in short DNA sequences.",
                "authors": [
                    {
                        "name": "Bajic V.B."
                    },
                    {
                        "name": "Fedorova A.D."
                    },
                    {
                        "name": "Kolpakov F.A."
                    },
                    {
                        "name": "Kulakovskiy I.V."
                    },
                    {
                        "name": "Magana-Mora A."
                    },
                    {
                        "name": "Makeev V.J."
                    },
                    {
                        "name": "Medvedeva Y.A."
                    },
                    {
                        "name": "Papatsenko D.A."
                    },
                    {
                        "name": "Rumynskiy E.I."
                    },
                    {
                        "name": "Sharipov R.N."
                    },
                    {
                        "name": "Vorontsov I.E."
                    },
                    {
                        "name": "Yevshin I.S."
                    }
                ],
                "citationCount": 278,
                "date": "2018-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "HOCOMOCO: Towards a complete collection of transcription factor binding models for human and mouse via large-scale ChIP-Seq analysis"
            }
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "ChIP-seq",
            "uri": "http://edamontology.org/topic_3169"
        },
        {
            "term": "DNA binding sites",
            "uri": "http://edamontology.org/topic_3125"
        }
    ],
    "version": [
        "11"
    ]
}
