
{
    "credit": [
        {
            "name": "GitHub Issues",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "https://github.com/rOpenHealth/rEHR/issues"
        },
        {
            "email": "e.kontopantelis@manchester.ac.uk",
            "name": "Evangelos Kontopantelis",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "https://github.com/rOpenHealth/rEHR/blob/master/vignettes/introduction-to-rehr.pdf"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "R"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Library"
        ],
        "topic": [
            {
                "term": "Data management",
                "uri": "http://edamontology.org/topic_3071"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© 2017 Springate et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Research with structured Electronic Health Records (EHRs) is expanding as data becomes more accessible; analytic methods advance; and the scientific validity of such studies is increasingly accepted. However, data science methodology to enable the rapid searching/ extraction, cleaning and analysis of these large, often complex, datasets is less well developed. In addition, commonly used software is inadequate, resulting in bottlenecks in research workflows and in obstacles to increased transparency and reproducibility of the research. Preparing a research-ready dataset from EHRs is a complex and time consuming task requiring substantial data science skills, even for simple designs. In addition, certain aspects of the workflow are computationally intensive, for example extraction of longitudinal data and matching controls to a large cohort, which may take days or even weeks to run using standard software. The rEHR package simplifies and accelerates the process of extracting ready-for-analysis datasets from EHR databases. It has a simple import function to a database backend that greatly accelerates data access times. A set of generic query functions allow users to extract data efficiently without needing detailed knowledge of SQL queries. Longitudinal data extractions can also be made in a single command, making use of parallel processing. The package also contains functions for cutting data by time-varying covariates, matching controls to cases, unit conversion and construction of clinical code lists. There are also functions to synthesise dummy EHR. The package has been tested with one for the largest primary care EHRs, the Clinical Practice Research Datalink (CPRD), but allows for a common interface to other EHRs. This simplified and accelerated work flow for EHR data extraction results in simpler, cleaner scripts that are more easily debugged, shared and reproduced.",
            "authors": [
                "Springate D.A.",
                "Parisi R.",
                "Olier I.",
                "Reeves D.",
                "Kontopantelis E."
            ],
            "cit_count": 2,
            "doi": "10.1371/journal.pone.0171784",
            "journal": "PLoS ONE",
            "title": "rEHR: An R package for manipulating and analysing electronic health record data",
            "type": "Primary",
            "year": "2017-02-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:rehr",
        "biotoolsID": "rehr",
        "description": "Process and extract clinical information from Electronic Medical Records.",
        "homepage": "https://github.com/rOpenHealth/rEHR",
        "name": "rEHR"
    }
}