{
    "additionDate": "2017-01-17T14:51:06Z",
    "biotoolsCURIE": "biotools:specarray",
    "biotoolsID": "specarray",
    "collectionID": [
        "ms-utils",
        "Proteomics"
    ],
    "credit": [
        {
            "email": "webmaster@ms-utils.org",
            "typeEntity": "Person",
            "typeRole": [
                "Documentor"
            ],
            "url": "http://ms-utils.org"
        }
    ],
    "description": "Aligns multiple LC-MS datasets and much more.",
    "documentation": [
        {
            "type": "General",
            "url": "http://tools.proteomecenter.org/wiki/index.php?title=Software:SpecArray"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://tools.proteomecenter.org/software/SpecArray_v1.2.0.tgz"
        }
    ],
    "editPermission": {
        "authors": [
            "proteomics.bio.tools"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Chromatographic alignment",
                    "uri": "http://edamontology.org/operation_3628"
                }
            ]
        }
    ],
    "homepage": "http://tools.proteomecenter.org/SpecArray.php",
    "language": [
        "C++"
    ],
    "lastUpdate": "2019-03-26T08:39:09Z",
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://ms-utils.org"
        }
    ],
    "name": "SpecArray",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "msutils_import",
    "publication": [
        {
            "metadata": {
                "abstract": "There is an increasing interest in the quantitative proteomic measurement of the protein contents of substantially similar biological samples, e.g. for the analysis of cellular response to perturbations over time or for the discovery of protein biomarkers from clinical samples. Technical limitations of current proteomic platforms such as limited reproducibility and low throughput make this a challenging task. A new LC-MS-based platform is able to generate complex peptide patterns from the analysis of proteolyzed protein samples at high throughput and represents a promising approach for quantitative proteomics. A crucial component of the LC-MS approach is the accurate evaluation of the abundance of detected peptides over many samples and the identification of peptide features that can stratify samples with respect to their genetic, physiological, or environmental origins. We present here a new software suite, SpecArray, that generates a peptide versus sample array from a set of LC-MS data. A peptide array stores the relative abundance of thousands of peptide features in many samples and is in a format identical to that of a gene expression microarray. A peptide array can be subjected to an unsupervised clustering analysis to stratify samples or to a discriminant analysis to identify discriminatory peptide features. We applied the SpecArray to analyze two sets of LC-MS data: one was from four repeat LC-MS analyses of the same glycopeptide sample, and another was from LC-MS analysis of serum samples of five male and five female mice. We demonstrate through these two study cases that the SpecArray software suite can serve as an effective software platform in the LC-MS approach for quantitative proteomics. © 2005 by The American Society for Biochemistry and Molecular Biology, Inc.",
                "authors": [
                    {
                        "name": "Li X.-J."
                    },
                    {
                        "name": "Yi E.C."
                    },
                    {
                        "name": "Kemp C.J."
                    },
                    {
                        "name": "Zhang H."
                    },
                    {
                        "name": "Aebersold R."
                    }
                ],
                "citationCount": 154,
                "date": "2005-09-01T00:00:00Z",
                "journal": "Molecular and Cellular Proteomics",
                "title": "A software suite for the generation and comparison of peptide arrays from sets of data collected by liquid chromatography-mass spectrometry"
            },
            "pmid": "16048906"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        }
    ]
}