{
    "additionDate": "2021-01-18T10:22:02Z",
    "biotoolsCURIE": "biotools:mcmseq",
    "biotoolsID": "mcmseq",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "mooreca@njheath.org",
            "name": "Camille M. Moore",
            "typeEntity": "Person"
        }
    ],
    "description": "Bayesian hierarchical modeling of clustered and repeated measures RNA sequencing experiments.\n\nThis is the repo for the mcmseq R package, which has the wrapper functions to run the MCMSeq method described in \"MCMSeq: Bayesian hierarchical modeling of clustered and repeated measures RNA sequencing experiments\".",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "Expression correlation analysis",
                    "uri": "http://edamontology.org/operation_3463"
                },
                {
                    "term": "RNA-seq read count analysis",
                    "uri": "http://edamontology.org/operation_3563"
                }
            ]
        }
    ],
    "homepage": "https://github.com/stop-pre16/mcmseq",
    "language": [
        "C++",
        "R"
    ],
    "lastUpdate": "2021-02-20T17:33:14Z",
    "name": "MCMSeq",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1186/S12859-020-03715-Y",
            "metadata": {
                "abstract": "© 2020 The Author(s).Background: As the barriers to incorporating RNA sequencing (RNA-Seq) into biomedical studies continue to decrease, the complexity and size of RNA-Seq experiments are rapidly growing. Paired, longitudinal, and other correlated designs are becoming commonplace, and these studies offer immense potential for understanding how transcriptional changes within an individual over time differ depending on treatment or environmental conditions. While several methods have been proposed for dealing with repeated measures within RNA-Seq analyses, they are either restricted to handling only paired measurements, can only test for differences between two groups, and/or have issues with maintaining nominal false positive and false discovery rates. In this work, we propose a Bayesian hierarchical negative binomial generalized linear mixed model framework that can flexibly model RNA-Seq counts from studies with arbitrarily many repeated observations, can include covariates, and also maintains nominal false positive and false discovery rates in its posterior inference. Results: In simulation studies, we showed that our proposed method (MCMSeq) best combines high statistical power (i.e. sensitivity or recall) with maintenance of nominal false positive and false discovery rates compared the other available strategies, especially at the smaller sample sizes investigated. This behavior was then replicated in an application to real RNA-Seq data where MCMSeq was able to find previously reported genes associated with tuberculosis infection in a cohort with longitudinal measurements. Conclusions: Failing to account for repeated measurements when analyzing RNA-Seq experiments can result in significantly inflated false positive and false discovery rates. Of the methods we investigated, whether they model RNA-Seq counts directly or worked on transformed values, the Bayesian hierarchical model implemented in the mcmseq R package (available at https://github.com/stop-pre16/mcmseq) best combined sensitivity and nominal error rate control.",
                "authors": [
                    {
                        "name": "Fingerlin T."
                    },
                    {
                        "name": "Kechris K."
                    },
                    {
                        "name": "Moore C.M."
                    },
                    {
                        "name": "Saba L."
                    },
                    {
                        "name": "Vestal B.E."
                    },
                    {
                        "name": "Wynn E."
                    }
                ],
                "citationCount": 1,
                "date": "2020-08-28T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "MCMSeq: Bayesian hierarchical modeling of clustered and repeated measures RNA sequencing experiments"
            },
            "pmcid": "PMC7455910",
            "pmid": "32859148"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Mathematics",
            "uri": "http://edamontology.org/topic_3315"
        },
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        },
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ]
}
