{"credit":[{"email":"sqwu@cs.iastate.edu","name":"Shiquan Wu","typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://xungulab.com/"}],"documentation":[{"type":"GENERAL","url":"http://xungulab.com/software/mgenome/document/readme.html"}],"function":[{"operation":[{"term":"Sequence comparison","uri":"http://edamontology.org/operation_2451"}]}],"labels":{"operatingSystem":["Windows"],"toolType":["Command-line tool"],"topic":[{"term":"DNA","uri":"http://edamontology.org/topic_0654"},{"term":"Genomics","uri":"http://edamontology.org/topic_0622"},{"term":"Sequence analysis","uri":"http://edamontology.org/topic_0080"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/mgenome-1-0-finding-optimal-trees-multiple-genome-rearrangement-signed-reversals.html"}],"publication":[{"abstract":"We discuss a multiple genome rearrangement problem by signed reversals: Given a collection of genomes, we generate them in the minimum number of signed reversals. It is NP-hard and equivalent to finding an optimal Steiner tree to connect the genomes by reversal paths. We design two algorithms to find the optimal Steiner nodes of the problem: Neighbor-perturbing algorithm and branch-and-bound algorithm. The first one is a polynomial running time approximation algorithm. It searches for the optimal Steiner nodes by perturbing initial Steiner nodes nearby their neighborhoods and improving them better and better until convergence. The second one is an exact exponential running time algorithm for a median problem. It finds the optimal Steiner node by checking all candidates that satisfy the necessary conditions for optimal Steiner nodes. We implement the algorithms into two programs respectively and show by experimental examples that they are more efficient than other similar ones, such as GRAPPA, BPAnalysis, and MGR, etc.","authors":["Wu S.","Gu X."],"cit_count":4,"journal":"Pacific Symposium on Biocomputing. Pacific Symposium on Biocomputing","pmid":"12603042","title":"Algorithms for multiple genome rearrangement by signed reversals.","year":"2003-01-01"}],"summary":{"biotoolsCURIE":"biotools:mgenome","biotoolsID":"mgenome","description":"Designed to find the optimal trees for multiple genome rearrangement by signed reversals. The problem is modeled as: For a given collection of genomes represented by signed permutations on genes, find a tree to connect the given genomes by reversal paths such that the number of all signed reversals is minimized.","homepage":"http://xungulab.com/software/mgenome/mgenome.html","name":"Mgenome"}}