{
    "additionDate": "2021-01-18T12:25:06Z",
    "biotoolsCURIE": "biotools:ibiodegpred",
    "biotoolsID": "ibiodegpred",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "fpazos@cnb.csic.es",
            "name": "Florencio Pazos",
            "orcidid": "https://orcid.org/0000-0002-2646-6226",
            "typeEntity": "Person"
        },
        {
            "email": "vlorenzo@cnb.csic.es",
            "name": "Victor de Lorenzo",
            "typeEntity": "Person"
        }
    ],
    "description": "Concomitant prediction of environmental fate and toxicity of chemical compounds.\n\nWelcome to SVM Biodegradability predictor. This is a tool for predicting biodegradability and/or toxicity, based on the different definitions provided for some of the most popular compound databases. It is easy to use, just introduce a compound in SMILES format or draw its structure with the JSME editor, select the databases that you want to obtain a prediction for and press GO button.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://sysbiol.cnb.csic.es/BiodegPred/",
    "lastUpdate": "2021-02-01T09:25:59Z",
    "name": "iBiodegPred",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1093/BIOMETHODS/BPAA025",
            "metadata": {
                "abstract": "© 2020 The Author(s). Published by Oxford University Press.The environmental fate of many functional molecules that are produced on a large scale as precursors or as additives to specialty goods (plastics, fibers, construction materials, etc.), let alone those synthesized by the pharmaceutical industry, is generally unknown. Assessing their environmental fate is crucial when taking decisions on the manufacturing, handling, usage, and release of these substances, as is the evaluation of their toxicity in humans and other higher organisms. While this data are often hard to come by, the experimental data already available on the biodegradability and toxicity of many unusual compounds (including genuinely xenobiotic molecules) make it possible to develop machine learning systems to predict these features. As such, we have created a predictor of the \"risk\"associated with the use and release of any chemical. This new system merges computational methods to predict biodegradability with others that assess biological toxicity. The combined platform, named BiodegPred (https://sysbiol.cnb.csic.es/BiodegPred/), provides an informed prognosis of the chance a given molecule can eventually be catabolized in the biosphere, as well as of its eventual toxicity, all available through a simple web interface. While the platform described does not give much information about specific degradation kinetics or particular biodegradation pathways, BiodegPred has been instrumental in anticipating the probable behavior of a large number of new molecules (e.g. antiviral compounds) for which no biodegradation data previously existed.",
                "authors": [
                    {
                        "name": "Chavarria M."
                    },
                    {
                        "name": "De Lorenzo V."
                    },
                    {
                        "name": "Garcia-Martin J.A."
                    },
                    {
                        "name": "Pazos F."
                    }
                ],
                "date": "2021-01-01T00:00:00Z",
                "journal": "Biology Methods and Protocols",
                "title": "Concomitant prediction of environmental fate and toxicity of chemical compounds"
            },
            "pmcid": "PMC7750720",
            "pmid": "33376807"
        }
    ],
    "toolType": [
        "Web service"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Molecular biology",
            "uri": "http://edamontology.org/topic_3047"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Synthetic chemistry",
            "uri": "http://edamontology.org/topic_3371"
        }
    ]
}
