
{
    "credit": [
        {
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://www.saitou-naruya-laboratory.org/english/index.html"
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://kirill-kryukov.com/study/mishima/documentation.html"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Multiple alignment",
                    "uri": "http://edamontology.org/operation_0492"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Sequence alignment",
                    "uri": "http://edamontology.org/operation_0292"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "C"
        ],
        "operatingSystem": [
            "Windows"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "DNA",
                "uri": "http://edamontology.org/topic_0654"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/mishima-2-0-6-method-for-inferring-sequence-history-in-terms-of-multiple-alignment.html"
        }
    ],
    "publication": [
        {
            "abstract": "Background: Large nucleotide sequence datasets are becoming increasingly common objects of comparison. Complete bacterial genomes are reported almost everyday. This creates challenges for developing new multiple sequence alignment methods. Conventional multiple alignment methods are based on pairwise alignment and/or progressive alignment techniques. These approaches have performance problems when the number of sequences is large and when dealing with genome scale sequences.Results: We present a new method of multiple sequence alignment, called MISHIMA (Method for Inferring Sequence History In terms of Multiple Alignment), that does not depend on pairwise sequence comparison. A new algorithm is used to quickly find rare oligonucleotide sequences shared by all sequences. Divide and conquer approach is then applied to break the sequences into fragments that can be aligned independently by an external alignment program. These partial alignments are assembled together to form a complete alignment of the original sequences.Conclusions: MISHIMA provides improved performance compared to the commonly used multiple alignment methods. As an example, six complete genome sequences of bacteria species Helicobacter pylori (about 1.7 Mb each) were successfully aligned in about 6 hours using a single PC. © 2010 Kryukov and Saitou; licensee BioMed Central Ltd.",
            "authors": [
                "Kryukov K.",
                "Saitou N."
            ],
            "cit_count": 9,
            "doi": "10.1186/1471-2105-11-142",
            "journal": "BMC Bioinformatics",
            "title": "MISHIMA - a new method for high speed multiple alignment of nucleotide sequences of bacterial genome scale data",
            "type": "Primary",
            "year": "2010-03-18"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:mishima",
        "biotoolsID": "mishima",
        "description": "MISHIMA is a program for multiple DNA sequence alignment. It takes input in FASTA format and outputs the alignment in MISHIMA or CLUSTALW format.",
        "homepage": "http://kirill-kryukov.com/study/mishima/",
        "name": "MISHIMA",
        "version": [
            "2.0.6"
        ]
    }
}