{
    "additionDate": "2021-03-19T08:30:00Z",
    "biotoolsCURIE": "biotools:auto-hmm-lmf",
    "biotoolsID": "auto-hmm-lmf",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "Ch-Eslahchi@sbu.ac.ir",
            "name": "Changiz Eslahchi",
            "orcidid": "https://orcid.org/0000-0002-8913-3904",
            "typeEntity": "Person"
        }
    ],
    "description": "Auto-HMM-LMF is a feature selection-based method to accurately predict cell line-drug associations and response using autoencoder and Hidden Markov Model.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Feature selection",
                    "uri": "http://edamontology.org/operation_3936"
                },
                {
                    "term": "Small molecule design",
                    "uri": "http://edamontology.org/operation_4009"
                },
                {
                    "term": "Gene expression profiling",
                    "uri": "http://edamontology.org/operation_0314"
                },
                {
                    "term": "Copy number estimation",
                    "uri": "http://edamontology.org/operation_3233"
                }
            ]
        }
    ],
    "homepage": "https://github.com/emdadi/Auto-HMM-LMF",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-04-11T10:30:19Z",
    "name": "Auto-HMM-LMF",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1186/S12859-021-03974-3",
            "metadata": {
                "abstract": "© 2021, The Author(s).Background: Predicting the response of cancer cell lines to specific drugs is an essential problem in personalized medicine. Since drug response is closely associated with genomic information in cancer cells, some large panels of several hundred human cancer cell lines are organized with genomic and pharmacogenomic data. Although several methods have been developed to predict the drug response, there are many challenges in achieving accurate predictions. This study proposes a novel feature selection-based method, named Auto-HMM-LMF, to predict cell line-drug associations accurately. Because of the vast dimensions of the feature space for predicting the drug response, Auto-HMM-LMF focuses on the feature selection issue for exploiting a subset of inputs with a significant contribution. Results: This research introduces a novel method for feature selection of mutation data based on signature assignments and hidden Markov models. Also, we use the autoencoder models for feature selection of gene expression and copy number variation data. After selecting features, the logistic matrix factorization model is applied to predict drug response values. Besides, by comparing to one of the most powerful feature selection methods, the ensemble feature selection method (EFS), we showed that the performance of the predictive model based on selected features introduced in this paper is much better for drug response prediction. Two datasets, the Genomics of Drug Sensitivity in Cancer (GDSC) and Cancer Cell Line Encyclopedia (CCLE) are used to indicate the efficiency of the proposed method across unseen patient cell-line. Evaluation of the proposed model showed that Auto-HMM-LMF could improve the accuracy of the results of the state-of-the-art algorithms, and it can find useful features for the logistic matrix factorization method. Conclusions: We depicted an application of Auto-HMM-LMF in exploring the new candidate drugs for head and neck cancer that showed the proposed method is useful in drug repositioning and personalized medicine. The source code of Auto-HMM-LMF method is available in https://github.com/emdadi/Auto-HMM-LMF.",
                "authors": [
                    {
                        "name": "Emdadi A."
                    },
                    {
                        "name": "Eslahchi C."
                    }
                ],
                "citationCount": 1,
                "date": "2021-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Auto-HMM-LMF: feature selection based method for prediction of drug response via autoencoder and hidden Markov model"
            },
            "pmcid": "PMC7844991",
            "pmid": "33509079"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Personalised medicine",
            "uri": "http://edamontology.org/topic_3577"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}