{
    "accessibility": "Open access",
    "additionDate": "2023-12-20T23:56:51.717877Z",
    "biotoolsCURIE": "biotools:fimpera",
    "biotoolsID": "fimpera",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "lucas.robidou@inria.fr",
            "name": "Lucas Robidou",
            "typeEntity": "Person"
        }
    ],
    "description": "Drastic improvement of approximate membership query data-structures with counts.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Filtering",
                    "uri": "http://edamontology.org/operation_3695"
                },
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                },
                {
                    "term": "k-mer counting",
                    "uri": "http://edamontology.org/operation_3472"
                }
            ]
        }
    ],
    "homepage": "https://github.com/lrobidou/fimpera",
    "language": [
        "C++",
        "Python",
        "Shell"
    ],
    "lastUpdate": "2023-12-20T23:56:51.720320Z",
    "license": "AGPL-3.0",
    "name": "fimpera",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAD305",
            "metadata": {
                "abstract": "Motivation: High throughput sequencing technologies generate massive amounts of biological sequence datasets as costs fall. One of the current algorithmic challenges for exploiting these data on a global scale consists in providing efficient query engines on these petabyte-scale datasets. Most methods indexing those datasets rely on indexing words of fixed length k, called k-mers. Many applications, such as metagenomics, require the abundance of indexed k-mers as well as their simple presence or absence, but no method scales up to petabyte-scaled datasets. This deficiency is primarily because storing abundance requires explicit storage of the k-mers in order to associate them with their counts. Using counting Approximate Membership Queries (cAMQ) data structures, such as counting Bloom filters, provides a way to index large amounts of k-mers with their abundance, but at the expense of a sensible false positive rate. Results: We propose a novel algorithm, called fimpera, that enables the improvement of any cAMQ performance. Applied to counting Bloom filters, our proposed algorithm reduces the false positive rate by two orders of magnitude and it improves the precision of the reported abundances. Alternatively, fimpera allows for the reduction of the size of a counting Bloom filter by two orders of magnitude while maintaining the same precision. fimpera does not introduce any memory overhead and may even reduces the query time.",
                "authors": [
                    {
                        "name": "Peterlongo P."
                    },
                    {
                        "name": "Robidou L."
                    }
                ],
                "date": "2023-05-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "fimpera: drastic improvement of Approximate Membership Query data-structures with counts"
            },
            "pmcid": "PMC10212535",
            "pmid": "37195454",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Software engineering",
            "uri": "http://edamontology.org/topic_3372"
        }
    ]
}
