{
    "accessibility": [
        "Open access"
    ],
    "additionDate": "2019-07-08T08:39:07Z",
    "biotoolsCURIE": "biotools:FBB",
    "biotoolsID": "FBB",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "rhuerta@ucsd.edu",
            "name": "Ramón Huerta",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Fast Bayesian-bound tool to calibrate RNA-seq aligners.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://bitbucket.org/irenerodriguez/fbb/src/master/README.md"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Read mapping",
                    "uri": "http://edamontology.org/operation_3198"
                },
                {
                    "term": "Mass spectra calibration",
                    "uri": "http://edamontology.org/operation_3627"
                }
            ]
        }
    ],
    "homepage": "https://bitbucket.org/irenerodriguez/fbb/src/master/",
    "language": [
        "C++"
    ],
    "lastUpdate": "2019-07-08T08:39:07Z",
    "license": "Unlicense",
    "maturity": "Mature",
    "name": "FBB",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "Ruta",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btw608",
            "metadata": {
                "abstract": "© The Author 2017. Published by Oxford University Press. All rights reserved.Motivation: Despite RNA-seq reads provide quality scores that represent the probability of calling a correct base, these values are not probabilistically integrated in most alignment algorithms. Based on the quality scores of the reads, we propose to calculate a lower bound of the probability of alignment of any fast alignment algorithm that generates SAM files. This bound is called Fast Bayesian Bound (FBB) and serves as a canonical reference to compare alignment results across different algorithms. This Bayesian Bound intends to provide additional support to the current state-of-the-art aligners, not to replace them. Results: We propose a feasible Bayesian bound that uses quality scores of the reads to align them to a genome of reference. Two theorems are provided to efficiently calculate the Bayesian bound that under some conditions becomes the equality. The algorithm reads the SAM files generated by the alignment algorithms using multiple command option values. The program options are mapped into the FBB reference values, and all the aligners can be compared respect to the same accuracy values provided by the FBB. Stranded paired read RNA-seq data was used for evaluation purposes. The errors of the alignments can be calculated based on the information contained in the distance between the pairs given by Theorem 2, and the alignments to the incorrect strand. Most of the algorithms (Bowtie, Bowtie 2, SHRiMP2, Soap 2, Novoalign) provide similar results with subtle variations.",
                "authors": [
                    {
                        "name": "Rodriguez-Lujan I."
                    },
                    {
                        "name": "Hasty J."
                    },
                    {
                        "name": "Huerta R."
                    }
                ],
                "citationCount": 1,
                "date": "2017-01-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "FBB: A fast Bayesian-bound tool to calibrate RNA-seq aligners"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "RNA-seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "RNA immunoprecipitation",
            "uri": "http://edamontology.org/topic_3794"
        }
    ]
}