{
    "additionDate": "2024-05-24T08:33:24.579530Z",
    "biotoolsCURIE": "biotools:ocbsa",
    "biotoolsID": "ocbsa",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "liguangcun@caas.cn",
            "name": "Guangcun Li",
            "orcidid": "https://orcid.org/0000-0003-2024-9914",
            "typeEntity": "Person"
        },
        {
            "email": "chengfeng@caas.cn",
            "name": "Feng Cheng",
            "typeEntity": "Person"
        }
    ],
    "description": "An NGS-based bulk segregant analysis tool for outcross populations.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genetic mapping",
                    "uri": "http://edamontology.org/operation_0282"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                }
            ]
        }
    ],
    "homepage": "https://gitee.com/Bioinformaticslab/OcBSA",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T13:56:32.249556Z",
    "name": "OcBSA",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1016/j.molp.2024.02.011",
            "metadata": {
                "abstract": "Constructing inbred lines for self-incompatible species and species with long generation times is challenging, making the use of F1 outcross/segregating populations the main strategy for genetic studies of such species. However, there is a lack of dedicated algorithms/tools for rapid quantitative trait locus (QTL) mapping using the F1 populations. To this end, we have designed and developed an algorithm/tool called OcBSA specifically for QTL mapping of F1 populations. OcBSA transforms the four-haplotype inheritance problem from the two heterozygous diploid parents of the F1 population into the two-haplotype inheritance problem common in current genetic studies by removing the two haplotypes from the heterozygous parent that do not contribute to phenotype segregation in the F1 population. Testing of OcBSA on 1800 simulated F1 populations demonstrated its advantages over other currently available tools in terms of sensitivity and accuracy. In addition, the broad applicability of OcBSA was validated by QTL mapping using seven reported F1 populations of apple, pear, peach, citrus, grape, tea, and rice. We also used OcBSA to map the QTL for flower color in a newly constructed F1 population of potato generated in this study. The OcBSA mapping result was verified by the insertion or deletion markers to be consistent with a previously reported locus harboring the ANTHOCYANIN 2 gene, which regulates potato flower color. Taken together, these results highlight the power and broad utility of OcBSA for QTL mapping using F1 populations and thus a great potential for functional gene mining in outcrossing species. For ease of use, we have developed both Windows and Linux versions of OcBSA, which are freely available at: https://gitee.com/Bioinformaticslab/OcBSA.",
                "authors": [
                    {
                        "name": "Cai C."
                    },
                    {
                        "name": "Chen S."
                    },
                    {
                        "name": "Cheng F."
                    },
                    {
                        "name": "Duan S."
                    },
                    {
                        "name": "Duan Y."
                    },
                    {
                        "name": "Li G."
                    },
                    {
                        "name": "Zhang K."
                    },
                    {
                        "name": "Zhang L."
                    },
                    {
                        "name": "Zhang L."
                    },
                    {
                        "name": "Zhang Z."
                    }
                ],
                "citationCount": 1,
                "date": "2024-04-01T00:00:00Z",
                "journal": "Molecular Plant",
                "title": "OcBSA: An NGS-based bulk segregant analysis tool for outcross populations"
            },
            "pmid": "38369755"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        },
        {
            "term": "Population genetics",
            "uri": "http://edamontology.org/topic_3056"
        }
    ]
}
