{
    "additionDate": "2021-01-18T10:46:24Z",
    "biotoolsCURIE": "biotools:animal-apadb",
    "biotoolsID": "animal-apadb",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "yudebing@njau.edu.cn",
            "name": "Debing Yu",
            "typeEntity": "Person"
        },
        {
            "email": "gong.jing@mail.hzau.edu.cn",
            "name": "Jing Gong",
            "typeEntity": "Person"
        }
    ],
    "description": "Alternative polyadenylation (APA) is an important post-transcriptional regulatory mechanism that recognizes different polyadenylation signals on transcripts, resulting in transcripts with different lengths of 3' untranslated regions and thereby influencing a series of biological processes. Recent studies have highlighted the important roles of APA in human. However, APA profiles in other animals have not been fully recognized, and there is no database that provides comprehensive APA information for other animals except human.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                },
                {
                    "term": "PolyA signal detection",
                    "uri": "http://edamontology.org/operation_0428"
                },
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                }
            ]
        }
    ],
    "homepage": "http://gong_lab.hzau.edu.cn/Animal-APAdb/",
    "lastUpdate": "2021-01-23T15:42:01Z",
    "name": "Animal-APAdb",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/NAR/GKAA778",
            "metadata": {
                "abstract": "© The Author(s) 2020. Published by Oxford University Press on behalf of Nucleic Acids Research. This is an Open Access article distributed under the terms of the Creative Commons Attribution Non-Commercial License (http://creativecommons.org/licenses/by-nc/4.0/), which permits non-commercial re-use, distribution, and reproduction in any medium, provided the original work is properly cited.Alternative polyadenylation (APA) is an important post-transcriptional regulatory mechanism that recognizes different polyadenylation signals on transcripts, resulting in transcripts with different lengths of 3 untranslated regions and thereby influencing a series of biological processes. Recent studies have highlighted the important roles of APA in human. However, APA profiles in other animals have not been fully recognized, and there is no database that provides comprehensive APA information for other animals except human. Here, by using the RNA sequencing data collected from public databases, we systematically characterized the APA profiles in 9244 samples of 18 species. In total, we identified 342 952 APA events with a median of 17 020 per species using the DaPars2 algorithm, and 315 691 APA events with a median of 17 953 per species using the QAPA algorithm in these 18 species, respectively. In addition, we predicted the polyadenylation sites (PAS) and motifs near PAS of these species. We further developed Animal-APAdb, a user-friendly database (http://gong lab.hzau.edu. cn/Animal-APAdb/) for data searching, browsing and downloading. With comprehensive information of APA events in different tissues of different species, Animal-APAdb may greatly facilitate the exploration of animal APA patterns and novel mechanisms, gene expression regulation and APA evolution across tissues and species.",
                "authors": [
                    {
                        "name": "Jin W."
                    },
                    {
                        "name": "Zhu Q."
                    },
                    {
                        "name": "Yang Y."
                    },
                    {
                        "name": "Yang W."
                    },
                    {
                        "name": "Wang D."
                    },
                    {
                        "name": "Yang J."
                    },
                    {
                        "name": "Niu X."
                    },
                    {
                        "name": "Yu D."
                    },
                    {
                        "name": "Gong J."
                    }
                ],
                "citationCount": 2,
                "date": "2021-01-08T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "Animal-APAdb: A comprehensive animal alternative polyadenylation database"
            },
            "pmid": "32986825"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Zoology",
            "uri": "http://edamontology.org/topic_3500"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        }
    ],
    "validated": 1
}