{
    "additionDate": "2021-03-19T09:07:40Z",
    "biotoolsCURIE": "biotools:biocie",
    "biotoolsID": "biocie",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "matthias.samwald@meduniwien.ac.at",
            "name": "Matthias Samwald",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "milad.moradivastegani@meduniwien.ac.at",
            "name": "Milad Moradi",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Biomedical Confident Itemsets Explanation (BioCIE) is a tool aiming at post-hoc explanation of black-box machine learning models for biomedical text classification. Using sources of domain knowledge and a confident itemset mining method, BioCIE discretizes the decision space of a black-box into smaller subspaces and extracts semantic relationships between the input text and class labels in different subspaces.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Named-entity and concept recognition",
                    "uri": "http://edamontology.org/operation_3280"
                },
                {
                    "term": "Relation extraction",
                    "uri": "http://edamontology.org/operation_3625"
                },
                {
                    "term": "Text mining",
                    "uri": "http://edamontology.org/operation_0306"
                }
            ]
        }
    ],
    "homepage": "https://github.com/mmoradi-iut/BioCIE",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-04-21T07:44:27Z",
    "name": "BioCIE",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1109/JBHI.2021.3056748",
            "metadata": {
                "abstract": "IEEEIn this paper, we propose a novel method named Biomedical Confident Itemsets Explanation (BioCIE), aiming at post-hoc explanation of black-box machine learning models for biomedical text classification. Using sources of domain knowledge and a confident itemset mining method, BioCIE discretizes the decision space of a black-box into smaller subspaces and extracts semantic relationships between the input text and class labels in different subspaces. Confident itemsets discover how biomedical concepts are related to class labels in the black-box&#x0027;s decision space. BioCIE uses the itemsets to approximate the black-box&#x0027;s behavior for individual predictions. Optimizing fidelity, interpretability, and coverage measures, BioCIE produces class-wise explanations that represent decision boundaries of the black-box. Results of evaluations on various biomedical text classification tasks and black-box models demonstrated that BioCIE can outperform perturbation-based and decision set methods in terms of producing concise, accurate, and interpretable explanations. BioCIE improved the fidelity of instance-wise and class-wise explanations by 11.6% and 7.5%, respectively. It also improved the interpretability of explanations by 8%. BioCIE can be effectively used to explain how a black-box biomedical text classification model semantically relates input texts to class labels. The source code and supplementary material are available at https://github.com/mmoradi-iut/BioCIE.",
                "authors": [
                    {
                        "name": "Moradi M."
                    },
                    {
                        "name": "Samwald M."
                    }
                ],
                "date": "2021-01-01T00:00:00Z",
                "journal": "IEEE Journal of Biomedical and Health Informatics",
                "title": "Explaining Black-box Models for Biomedical Text Classification"
            },
            "pmid": "33534720"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Medicine",
            "uri": "http://edamontology.org/topic_3303"
        },
        {
            "term": "Natural language processing",
            "uri": "http://edamontology.org/topic_0218"
        }
    ]
}
