{
    "name": "T-lex", 
    "description": "Here, we present a computational pipeline (T-lex) that uses NGS data to detect the presence/absence of annotated Transposable Element (TE) copies. T-lex can use data from a large number of strains and returns estimates of population frequencies of individual TE insertions in a reasonable time.", 
    "homepage": "http://petrov.stanford.edu/cgi-bin/Tlex_manual.html", 
    "biotoolsID": "t-lex", 
    "biotoolsCURIE": "biotools:t-lex", 
    "version": [], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_0427", 
                    "term": "Transposon prediction"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Script"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_0798", 
            "term": "Mobile genetic elements"
        }
    ], 
    "operatingSystem": [
        "Linux"
    ], 
    "language": [
        "Perl"
    ], 
    "license": null, 
    "collectionID": [], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [], 
    "download": [], 
    "documentation": [
        {
            "url": "http://petrov.stanford.edu/cgi-bin/Tlex_manual.html#How%20to%20run%20T-lex", 
            "type": "Manual", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": null, 
            "pmid": "21177644", 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "T-lex: A program for fast and accurate assessment of transposable element presence using next-generation sequencing data", 
                "abstract": "Transposable elements (TEs) are repetitive DNA sequences that are ubiquitous, extremely abundant and dynamic components of practically all genomes. Much effort has gone into annotation of TE copies in reference genomes. The sequencing cost reduction and the newly available next-generation sequencing (NGS) data from multiple strains within a species offer an unprecedented opportunity to study population genomics of TEs in a range of organisms. Here, we present a computational pipeline (T-lex) that uses NGS data to detect the presence/absence of annotated TE copies. T-lex can use data from a large number of strains and returns estimates of population frequencies of individual TE insertions in a reasonable time. We experimentally validated the accuracy of T-lex detecting presence or absence of 768 previously identified TE copies in two resequenced Drosophila melanogaster strains. Approximately 95% of the TE insertions were detected with 100% sensitivity and 97% specificity. We show that even at low levels of coverage T-lex produces accurate results for TE copies that it can identify reliably but that the rate of 'no data' calls increases as the coverage falls below 15x. T-lex is a broadly applicable and flexible tool that can be used in any genome provided the availability of the reference genome, individual TE copy annotation and NGS data. © The Author(s) 2010. Published by Oxford University Press.", 
                "date": "2011-03-01T00:00:00Z", 
                "citationCount": 36, 
                "authors": [
                    {
                        "name": "Fiston-Lavier A.-S."
                    }, 
                    {
                        "name": "Carrigan M."
                    }, 
                    {
                        "name": "Petrov D.A."
                    }, 
                    {
                        "name": "Gonzalez J."
                    }
                ], 
                "journal": "Nucleic Acids Research"
            }
        }
    ], 
    "credit": [
        {
            "name": "Anna-Sophie Fiston-Lavier", 
            "email": "asfiston@univ-montp2.fr", 
            "url": null, 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "seqwiki_import", 
    "additionDate": "2017-01-13T13:16:48Z", 
    "lastUpdate": "2018-12-10T12:58:55Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 1, 
    "homepage_status": 0, 
    "elixir_badge": 0
}