{
    "additionDate": "2017-01-17T14:59:50Z",
    "biotoolsCURIE": "biotools:qsea",
    "biotoolsID": "qsea",
    "collectionID": [
        "BioConductor"
    ],
    "credit": [
        {
            "email": "lienhard@molgen.mpg.de",
            "name": "Matthias Lienhard",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Tool developed as the successor of the MEDIPS package for analyzing data derived from methylated DNA immunoprecipitation (MeDIP) experiments followed by sequencing (MeDIP-seq). However, it provides several functionalities for the analysis of other kinds of quantitative sequencing data (e.g. ChIP-seq, MBD-seq, CMS-seq and others) including calculation of differential enrichment between groups of samples.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://bioconductor.org/packages/release/bioc/html/qsea.html"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://bioconductor/packages/release/bioc/src/contrib/qsea_1.0.3.tar.gz"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                }
            ]
        }
    ],
    "homepage": "http://bioconductor.org/packages/release/bioc/html/qsea.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2019-01-13T18:06:28Z",
    "license": "GPL-2.0",
    "name": "qsea",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "bioconductor_import",
    "publication": [
        {
            "doi": "10.1093/nar/gkw1193",
            "metadata": {
                "abstract": "© The Author(s) 2016.Genome-wide enrichment of methylated DNA followed by sequencing (MeDIP-seq) offers a reasonable compromise between experimental costs and genomic coverage. However, the computational analysis of these experiments is complex, and quantification of the enrichment signals in terms of absolute levels of methylation requires specific transformation. In this work, we present QSEA, Quantitative Sequence Enrichment Analysis, a comprehensive workflow for the modelling and subsequent quantification of MeDIP-seq data. As the central part of the workflow we have developed a Bayesian statistical model that transforms the enrichment read counts to absolute levels of methylation and, thus, enhances interpretability and facilitates comparison with other methylation assays. We suggest several calibration strategies for the critical parameters of the model, either using additional data or fairly general assumptions. By comparing the results with bisulfite sequencing (BS) validation data, we show the improvement of QSEA over existing methods. Additionally, we generated a clinically relevant benchmark data set consisting of methylation enrichment experiments (MeDIP-seq), BS-based validation experiments (Methyl-seq) as well as gene expression experiments (RNA-seq) derived from non-small cell lung cancer patients, and show that the workflow retrieves well-known lung tumour methylation markers that are causative for gene expression changes, demonstrating the applicability of QSEA for clinical studies. QSEA is implemented in R and available from the Bioconductor repository 3.4 (www.bioconductor. org/packages/qsea).",
                "authors": [
                    {
                        "name": "Lienhard M."
                    },
                    {
                        "name": "Grasse S."
                    },
                    {
                        "name": "Rolff J."
                    },
                    {
                        "name": "Frese S."
                    },
                    {
                        "name": "Schirmer U."
                    },
                    {
                        "name": "Becker M."
                    },
                    {
                        "name": "Borno S."
                    },
                    {
                        "name": "Timmermann B."
                    },
                    {
                        "name": "Chavez L."
                    },
                    {
                        "name": "Sultmann H."
                    },
                    {
                        "name": "Leschber G."
                    },
                    {
                        "name": "Fichtner I."
                    },
                    {
                        "name": "Schweiger M.R."
                    },
                    {
                        "name": "Herwig R."
                    }
                ],
                "citationCount": 20,
                "date": "2017-04-07T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "QSEA-modelling of genome-wide DNA methylation from sequencing enrichment experiments"
            },
            "pmcid": "PMC5389680",
            "pmid": "27913729",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool",
        "Library"
    ],
    "topic": [
        {
            "term": "ChIP-seq",
            "uri": "http://edamontology.org/topic_3169"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Data visualisation",
            "uri": "http://edamontology.org/topic_0092"
        }
    ],
    "validated": 1,
    "version": [
        "1.0.3"
    ]
}