{
    "additionDate": "2017-12-18T00:05:08Z",
    "biotoolsCURIE": "biotools:chaplin",
    "biotoolsID": "chaplin",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://genetics.web.emory.edu/labs/epstein/software/index.html"
        }
    ],
    "description": "Chaplin (Case-control haplotype inference package.) is a software program for identifying specific haplotypes or haplotype features that are associated with disease using genotype data from a case-control study.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Haplotype inference",
                    "uri": "http://edamontology.org/operation_0487"
                }
            ]
        }
    ],
    "homepage": "http://genetics.emory.edu/labs/epstein/software/chaplin/index.html",
    "language": [
        "Fortran"
    ],
    "lastUpdate": "2018-12-10T12:58:57Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/chaplin-1-2-3-case-control-haplotype-inference-package.html"
        }
    ],
    "name": "Chaplin",
    "operatingSystem": [
        "Windows"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1002/gepi.20020",
            "metadata": {
                "abstract": "We compare bias and power of three methods for haplotype inference on disease risk using unphased genotype data from a case-control study. We examine the prospective score test of Schaid et al. ([2002] Am. J. Hum. Genet 70:425-434), a novel modification of the prospective estimating equations of Zhao et al. ([2003] Am. J. Hum. Genet. 72:1231-1250) and the retrospective likelihood of Epstein and Satten ([2003] Am. J. Hum. Genet. 73:1316-1329). We find that all three approaches are roughly comparable when the haplotype effect on disease odds follows a multiplicative model. However, for dominant and recessive models of haplotype effect, the retrospective-likelihood method has increased efficiency with respect to the prospective methods. As all three methods assume haplotype frequencies are in Hardy-Weinberg Equilibrium (HWE), we compare the robustness of each procedure to departures from HWE. We find the prospective methods are robust to departure from HWE, while the retrospective-likelihood method is biased for dominant and recessive models of haplotype effect. To remedy this limitation of the retrospective-likelihood method, we propose a modification that allows for a non-negative fixation index (common to all haplotype pairs) and show it dramatically reduces the bias of the retrospective likelihood when HWE is violated.",
                "authors": [
                    {
                        "name": "Satten G.A."
                    },
                    {
                        "name": "Epstein M.P."
                    }
                ],
                "citationCount": 68,
                "date": "2004-11-01T00:00:00Z",
                "journal": "Genetic Epidemiology",
                "title": "Comparison of prospective and retrospective methods for haplotype inference in case-control studies"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Disease",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        }
    ],
    "validated": 1,
    "version": [
        "1.2.3"
    ]
}