{
    "additionDate": "2017-03-25T22:39:23Z",
    "biotoolsCURIE": "biotools:ffged",
    "biotoolsID": "ffged",
    "credit": [
        {
            "email": "Jeffrey.Townsend@yale.edu",
            "name": "Jeffrey Townsend",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "User-friendly management of gene expression data, which are assorted into experimental metadata, experimental design, raw data, normalized details, and analysis results. The web server functions as a collective and collaborative platform, by connecting each experiment with similar related experiments made public by other users, and correlating diverse gene expression levels under multiple experimental designs within different experiments.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://bioinfo.townsend.yale.edu/faq.jsp"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Differential gene expression analysis",
                    "uri": "http://edamontology.org/operation_3223"
                },
                {
                    "term": "Gene expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                },
                {
                    "term": "Gene expression correlation analysis",
                    "uri": "http://edamontology.org/operation_3463"
                },
                {
                    "term": "Gene expression profile clustering",
                    "uri": "http://edamontology.org/operation_0313"
                },
                {
                    "term": "Gene expression profiling",
                    "uri": "http://edamontology.org/operation_0314"
                }
            ]
        }
    ],
    "homepage": "http://bioinfo.townsend.yale.edu/",
    "lastUpdate": "2018-12-10T12:58:57Z",
    "name": "FFGED",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "A consortium of investigators is engaged in a functional genomics project centered on the filamentous fungus Neurospora, with an eye to opening up the functional genomic analysis of all the filamentous fungi. The overall goal of the four interdependent projects in this effort is to acccomplish functional genomics, annotation, and expression analyses of Neurospora crassa, a filamentous fungus that is an established model for the assemblage of over 250,000 species of nonyeast fungi. Building from the completely sequenced 43-Mb Neurospora genome, Project 1 is pursuing the systematic disruption of genes through targeted gene replacements, phenotypic analysis of mutant strains, and their distribution to the scientific community at large. Project 2, through a primary focus in Annotation and Bioinformatics, has developed a platform for electronically capturing community feedback and data about the existing annotation, while building and maintaining a database to capture and display information about phenotypes. Oligonucleotide-based microarrays created in Project 3 are being used to collect baseline expression data for the nearly 11,000 distinguishable transcripts in Neurospora under various conditions of growth and development, and eventually to begin to analyze the global effects of loss of novel genes in strains created by Project 1. cDNA libraries generated in Project 4 document the overall complexity of expressed sequences in Neurospora, including alternative splicing alternative promoters and antisense transcripts. In addition, these studies have driven the assembly of an SNP map presently populated by nearly 300 markers that will greatly accelerate the positional cloning of genes. © 2006 Elsevier Inc. All rights reserved.",
                "authors": [
                    {
                        "name": "Altamirano L."
                    },
                    {
                        "name": "Basturkmen M."
                    },
                    {
                        "name": "Birren B.W."
                    },
                    {
                        "name": "Borkovich K.A."
                    },
                    {
                        "name": "Collopy P."
                    },
                    {
                        "name": "Colot H.V."
                    },
                    {
                        "name": "Crawford M."
                    },
                    {
                        "name": "Crew C."
                    },
                    {
                        "name": "Curilla S."
                    },
                    {
                        "name": "DeCaprio D."
                    },
                    {
                        "name": "Dunlap J.C."
                    },
                    {
                        "name": "Galagan J.E."
                    },
                    {
                        "name": "Glass N.L."
                    },
                    {
                        "name": "Henn M.R."
                    },
                    {
                        "name": "Hood H.M."
                    },
                    {
                        "name": "Kasuga T."
                    },
                    {
                        "name": "Koerhsen M."
                    },
                    {
                        "name": "Lambreghts R."
                    },
                    {
                        "name": "Larson L."
                    },
                    {
                        "name": "Litvinkova L."
                    },
                    {
                        "name": "Loros J.J."
                    },
                    {
                        "name": "McCluskey K."
                    },
                    {
                        "name": "Montgomery P."
                    },
                    {
                        "name": "Nelson M.A."
                    },
                    {
                        "name": "Park G."
                    },
                    {
                        "name": "Pearson M."
                    },
                    {
                        "name": "Plamann M."
                    },
                    {
                        "name": "Ringelberg C."
                    },
                    {
                        "name": "Sachs M.S."
                    },
                    {
                        "name": "Shi M."
                    },
                    {
                        "name": "Tian C."
                    },
                    {
                        "name": "Townsend J.P."
                    },
                    {
                        "name": "Turner G.E."
                    },
                    {
                        "name": "Weiss R.L."
                    },
                    {
                        "name": "Xu J."
                    }
                ],
                "citationCount": 147,
                "date": "2007-03-12T00:00:00Z",
                "journal": "Advances in Genetics",
                "title": "Enabling a Community to Dissect an Organism: Overview of the Neurospora Functional Genomics Project"
            },
            "pmid": "17352902"
        },
        {
            "metadata": {
                "abstract": "Filamentous fungal gene expression assays provide essential information for understanding systemic cellular regulation. To aid research on fungal gene expression, we constructed a novel, comprehensive, free database, the filamentous fungal gene expression database (FFGED), available at http://bioinfo.townsend.yale.edu. FFGED features user-friendly management of gene expression data, which are assorted into experimental metadata, experimental design, raw data, normalized details, and analysis results. Data may be submitted in the process of an experiment, and any user can submit multiple experiments, thus classifying the FFGED as an \"active experiment\" database. Most importantly, FFGED functions as a collective and collaborative platform, by connecting each experiment with similar related experiments made public by other users, maximizing data sharing among different users, and correlating diverse gene expression levels under multiple experimental designs within different experiments. A clear and efficient web interface is provided with enhancement by AJAX (Asynchronous JavaScript and XML) and through a collection of tools to effectively facilitate data submission, sharing, retrieval and visualization. © 2009 Elsevier Inc. All rights reserved.",
                "authors": [
                    {
                        "name": "Townsend J.P."
                    },
                    {
                        "name": "Zhang Z."
                    }
                ],
                "citationCount": 28,
                "date": "2010-03-01T00:00:00Z",
                "journal": "Fungal Genetics and Biology",
                "title": "The filamentous fungal gene expression database (FFGED)"
            },
            "pmid": "20025988"
        },
        {
            "metadata": {
                "abstract": "Identifying and characterizing transcriptional regulatory networks is important for guiding experimental tests on gene function. The characterization of regulatory networks allows comparisons among both closely and distantly related species, providing insight into network evolution, which is predicted to correlate with the adaptation of different species to particular environmental niches. One of the most intensely studied regulatory factors in the yeast Saccharomyces cerevisiae is the bZIP transcription factor Gcn4p. Gcn4p is essential for a global transcriptional response when S. cerevisiae experiences amino acid starvation. In the filamentous ascomycete Neurospora crassa, the ortholog of GCN4 is called the cross pathway control-1 (cpc-1) gene; it is required for the ability of N. crassa to induce a number of amino acid biosynthetic genes in response to amino acid starvation. Here, we deciphered the CPC1 regulon by profiling transcription in wild-type and cpc-1 mutant strains with full-genome N. crassa 70-mer oligonucleotide microarrays. We observed that at least 443 genes were direct or indirect CPC1 targets; these included 67 amino acid biosynthetic genes, 16 tRNA synthetase genes, and 13 vitamin-related genes. Comparison among the N. crassa CPC1 transcriptional profiling data set and the Gcn4/CaGcn4 data sets from S. cerevisiae and Candida albicans revealed a conserved regulon of 32 genes, 10 of which are predicted to be directly regulated by Gcn4p/CPC1. The 32-gene conserved regulon comprises mostly amino acid biosynthetic genes. The comparison of regulatory networks in species with clear orthology among genes sheds light on how gene interaction networks evolve. Copyright © 2007, American Society for Microbiology. All Rights Reserved.",
                "authors": [
                    {
                        "name": "Glass N.L."
                    },
                    {
                        "name": "Kasuga T."
                    },
                    {
                        "name": "Sachs M.S."
                    },
                    {
                        "name": "Tian C."
                    }
                ],
                "citationCount": 64,
                "date": "2007-06-01T00:00:00Z",
                "journal": "Eukaryotic Cell",
                "title": "Transcriptional profiling of cross pathway control in Neurospora crassa and comparative analysis of the Gcn4 and CPC1 regulons"
            },
            "pmid": "17449655"
        },
        {
            "metadata": {
                "abstract": "To test the inferences of spotted microarray technology against a biochemically well-studied process, we performed transcriptional profiling of conidial germination in the filamentous fungus, Neurospora crassa. We first constructed a 70 base oligomer microarray that assays 3366 predicted genes. To estimate the relative gene expression levels and changes in gene expression during conidial germination, we analyzed a circuit design of competitive hybridizations throughout a time course using a Bayesian analysis of gene expression level. Remarkable consistency of mRNA profiles with previously published northern data was observed. Genes were hierarchically clustered into groups with respect to their expression profiles over the time course of conidial germination. A functional classification database was employed to characterize the global picture of gene expression. Consensus motif searches identified a putative regulatory component associated with genes involved in ribosomal biogenesis. Our transcriptional profiling data correlate well with biochemical and physiological processes associated with conidial germination and will facilitate functional predictions of novel genes in N.crassa and other filamentous ascomycete species. Furthermore, our dataset on conidial germination allowed comparisons to transcriptional mechanisms associated with germination processes of diverse propagules, such as teliospores of the phytopathogenic fungus Ustilago maydis and spores of the social amoeba Dictyostelium discoideum. © The Author 2005. Published by Oxford University Press. All rights reserved.",
                "authors": [
                    {
                        "name": "Gilbert L.B."
                    },
                    {
                        "name": "Glass N.L."
                    },
                    {
                        "name": "Kasuga T."
                    },
                    {
                        "name": "Mannhaupt G."
                    },
                    {
                        "name": "Taylor J.W."
                    },
                    {
                        "name": "Tian C."
                    },
                    {
                        "name": "Townsend J.P."
                    }
                ],
                "citationCount": 82,
                "date": "2005-12-27T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "Long-oligomer microarray profiling in Neurospora crassa reveals the transcriptional program underlying biochemical and physiological events of conidial germination"
            },
            "pmid": "16287898"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Experimental design and studies",
            "uri": "http://edamontology.org/topic_3678"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ],
    "validated": 1
}
