{
    "additionDate": "2021-01-18T07:43:14Z",
    "biotoolsCURIE": "biotools:pub2tools2020__genodive",
    "biotoolsID": "pub2tools2020__genodive",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "p.g.meirmans@uva.nl",
            "name": "Patrick G. Meirmans",
            "orcidid": "https://orcid.org/0000-0002-6395-8107",
            "typeEntity": "Person"
        }
    ],
    "description": "Easy-to-use software for the analysis of genetic data of diploids and polyploids.\n\nGenodive version 3.0 is a user-friendly program for the analysis of population genetic data.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Formatting",
                    "uri": "http://edamontology.org/operation_0335"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Imputation",
                    "uri": "http://edamontology.org/operation_3557"
                }
            ]
        }
    ],
    "homepage": "http://www.patrickmeirmans.com/software/Home.html",
    "lastUpdate": "2021-01-22T19:25:14Z",
    "name": "genodive",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1111/1755-0998.13145",
            "metadata": {
                "abstract": "© 2020 The Authors. Molecular Ecology Resources published by John Wiley & Sons Ltdgenodive version 3.0 is a user-friendly program for the analysis of population genetic data. This version presents a major update from the previous version and now offers a wide spectrum of different types of analyses. genodive has an intuitive graphical user interface that allows direct manipulation of the data through transformation, imputation of missing data, and exclusion and inclusion of individuals, population and/or loci. Furthermore, genodive seamlessly supports 15 different file formats for importing or exporting data from or to other programs. One major feature of genodive is that it supports both diploid and polyploid data, up to octaploidy (2n = 8x) for some analyses, but up to hexadecaploidy (2n = 16x) for other analyses. The different types of analyses offered by genodive include multiple statistics for estimating population differentiation (φST, FST, FʹST, GST, GʹST, GʹʹST, Dest, RST, ρ), analysis of molecular variance-based K-means clustering, Hardy–Weinberg equilibrium, hybrid index, population assignment, clone assignment, Mantel test, Spatial Autocorrelation, 23 ways of calculating genetic distances, and both principal components and principal coordinates analyses. A unique feature of genodive is that it can also open data sets with nongenetic variables, for example environmental data or geographical coordinates that can be included in the analysis. In addition, genodive makes it possible to run several external programs (lfmm, structure, instruct and vegan) directly from its own user interface, avoiding the need for data reformatting and use of the command line. genodive is available for computers running Mac OS X 10.7 or higher and can be downloaded freely from: http://www.patrickmeirmans.com/software.",
                "authors": [
                    {
                        "name": "Meirmans P.G."
                    }
                ],
                "citationCount": 35,
                "date": "2020-07-01T00:00:00Z",
                "journal": "Molecular Ecology Resources",
                "title": "genodive version 3.0: Easy-to-use software for the analysis of genetic data of diploids and polyploids"
            },
            "pmcid": "PMC7496249",
            "pmid": "32061017"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Population genetics",
            "uri": "http://edamontology.org/topic_3056"
        }
    ]
}
