
{
    "credit": [
        {
            "name": "Contact form",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://www.candidagenome.org/cgi-bin/suggestion"
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://www.candidagenome.org/HelpContents.shtml"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Text annotation",
                    "uri": "http://edamontology.org/operation_3778"
                },
                {
                    "term": "Pathway or network analysis",
                    "uri": "http://edamontology.org/operation_2497"
                },
                {
                    "term": "Gene functional annotation",
                    "uri": "http://edamontology.org/operation_3672"
                },
                {
                    "term": "Literature search",
                    "uri": "http://edamontology.org/operation_0305"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Database portal"
        ],
        "topic": [
            {
                "term": "Endocrinology and metabolism",
                "uri": "http://edamontology.org/topic_3407"
            },
            {
                "term": "Model organisms",
                "uri": "http://edamontology.org/topic_0621"
            },
            {
                "term": "Molecular interactions, pathways and networks",
                "uri": "http://edamontology.org/topic_0602"
            },
            {
                "term": "Experimental design and studies",
                "uri": "http://edamontology.org/topic_3678"
            }
        ]
    },
    "publication": [
        {
            "abstract": "The Candida Genome Database (CGD, http://www.candidagenome.org/) provides online access to genomic sequence data and manually curated functional information about genes and proteins of the human pathogen Candida albicans. Herein, we describe two recently added features, Candida Biochemical Pathways and the Textpresso full-text literature search tool. The Biochemical Pathways tool provides visualization of metabolic pathways and analysis tools that facilitate interpretation of experimental data, including results of large-scale experiments, in the context of Candida metabolism. Textpresso for Candida allows searching through the full-text of Candida-specific literature, including clinical and epidemiological studies. © The Author(s) 2009. Published by Oxford University Press.",
            "authors": [
                "Skrzypek M.S.",
                "Arnaud M.B.",
                "Costanzo M.C.",
                "Inglis D.O.",
                "Shah P.",
                "Binkley G.",
                "Miyasato S.R.",
                "Sherlock G."
            ],
            "cit_count": 44,
            "journal": "Nucleic Acids Research",
            "pmid": "19808938",
            "title": "New tools at the Candida Genome Database: Biochemical pathways and full-text literature search",
            "year": "2009-10-06"
        },
        {
            "abstract": "The Candida Genome Database (CGD, http://www .candidagenome.org/) is an internet-based resource that provides centralized access to genomic sequence data and manually curated functional information about genes and proteins of the fungal pathogen Candida albicans and other Candida species. As the scope of Candida research, and the number of sequenced strains and related species, has grown in recent years, the need for expanded genomic resources has also grown. To answer this need, CGD has expanded beyond storing data solely for C. albicans, now integrating data from multiple species. Herein we describe the incorporation of this multispecies information, which includes curated gene information and the reference sequence for C. glabrata, as well as orthology relationships that interconnect Locus Summary pages, allowing easy navigation between genes of C. albicans and C. glabrata. These orthology relationships are also used to predict GO annotations of their products. We have also added protein information pages that display domains, structural information and physicochemical properties; bibliographic pages highlighting important topic areas in Candida biology; and a laboratory strain lineage page that describes the lineage of commonly used laboratory strains. All of these data are freely available at http://www .candidagenome.org/. We welcome feedback from the research community at candidacurator@lists.stanford.edu. © The Author(s) 2011. Published by Oxford University Press.",
            "authors": [
                "Inglis D.O.",
                "Arnaud M.B.",
                "Binkley J.",
                "Shah P.",
                "Skrzypek M.S.",
                "Wymore F.",
                "Binkley G.",
                "Miyasato S.R.",
                "Simison M.",
                "Sherlock G."
            ],
            "cit_count": 139,
            "journal": "Nucleic Acids Research",
            "pmid": "22064862",
            "title": "The Candida genome database incorporates multiple Candida species: Multispecies search and analysis tools with curated gene and protein information for Candida albicans and Candida glabrata",
            "year": "2012-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:cgd",
        "biotoolsID": "cgd",
        "description": "Provides online access to genomic sequence data and manually curated functional information about genes and proteins of the human pathogen Candida albicans. Two tools have been added to the DB. The Biochemical Pathways tool provides visualization of metabolic pathways and analysis tools that facilitate interpretation of experimental data, including results of large-scale experiments, in the context of Candida metabolism.",
        "homepage": "http://www.candidagenome.org/",
        "name": "Candida genome database CGD"
    }
}