{
    "additionDate": "2020-01-09T18:27:05Z",
    "biotoolsCURIE": "biotools:Bridge_autogenerated",
    "biotoolsID": "Bridge_autogenerated",
    "confidence_flag": "low",
    "description": "A Graph-Based Algorithm to Analyze Dynamic H-Bond Networks in Membrane Proteins.\n\nMembrane proteins that function as transporters or receptors must communicate with both sides of the lipid bilayer in which they sit. This long distance communication enables transporters to move protons or other ions and small molecules across the bilayer and receptors to transmit an external signal to the cell. Hydrogen bonds, hydrogen-bond networks, and lipid-protein interactions are essential for the motions and functioning of the membrane protein and, consequently, of outmost interest to structural biology and numerical simulations. We present here Bridge, an algorithm tailored for efficient analyses of hydrogen-bond networks in membrane transporter and receptor proteins.\n\n||| HOMEPAGE MISSING!.\n\n||| NAME (Bridge) SIMILAR TO (PUB. DIFFERENT) bio.tools/bridge (bridge)",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Molecular dynamics",
                    "uri": "http://edamontology.org/operation_2476"
                },
                {
                    "term": "Hydrogen bond calculation",
                    "uri": "http://edamontology.org/operation_0394"
                }
            ]
        }
    ],
    "homepage": "https://www.ncbi.nlm.nih.gov/pubmed/?term=31652399",
    "language": [
        "PyMOL"
    ],
    "lastUpdate": "2020-01-09T18:27:05Z",
    "name": "Bridge_autogenerated",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1021/ACS.JCTC.9B00697",
            "metadata": {
                "abstract": "Copyright © 2019 American Chemical Society.Membrane proteins that function as transporters or receptors must communicate with both sides of the lipid bilayer in which they sit. This long distance communication enables transporters to move protons or other ions and small molecules across the bilayer and receptors to transmit an external signal to the cell. Hydrogen bonds, hydrogen-bond networks, and lipid-protein interactions are essential for the motions and functioning of the membrane protein and, consequently, of outmost interest to structural biology and numerical simulations. We present here Bridge, an algorithm tailored for efficient analyses of hydrogen-bond networks in membrane transporter and receptor proteins. For channelrhodopsin, a membrane protein whose functioning involves proton-transfer reactions, Bridge identifies extensive networks of protein-water hydrogen bonds and an unanticipated network that can bridge transiently two proton donors across a distance of ∼20 Å. Graphs of the protein hydrogen bonds reveal rapid propagation of structural changes within hydrogen-bond networks of mutant transporters and identify protein groups potentially important for the proton transfer activity. The algorithm is made available as a plugin for PyMol.",
                "authors": [
                    {
                        "name": "Siemers M."
                    },
                    {
                        "name": "Lazaratos M."
                    },
                    {
                        "name": "Karathanou K."
                    },
                    {
                        "name": "Guerra F."
                    },
                    {
                        "name": "Brown L.S."
                    },
                    {
                        "name": "Bondar A.-N."
                    }
                ],
                "date": "2019-12-10T00:00:00Z",
                "journal": "Journal of Chemical Theory and Computation",
                "title": "Bridge: A Graph-Based Algorithm to Analyze Dynamic H-Bond Networks in Membrane Proteins"
            },
            "pmid": "31652399"
        }
    ],
    "topic": [
        {
            "term": "Membrane and lipoproteins",
            "uri": "http://edamontology.org/topic_0820"
        },
        {
            "term": "Lipids",
            "uri": "http://edamontology.org/topic_0153"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "Protein folds and structural domains",
            "uri": "http://edamontology.org/topic_0736"
        }
    ]
}