{
    "accessibility": "Open access",
    "additionDate": "2023-03-17T10:21:39.616255Z",
    "biotoolsCURIE": "biotools:strainselect",
    "biotoolsID": "strainselect",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "todd.desantis@gmail.com",
            "name": "Todd Z. DeSantis",
            "typeEntity": "Person"
        },
        {
            "name": "Cesar Cardona"
        },
        {
            "name": "Cheryl-Emiliane Chow"
        },
        {
            "name": "Shoko Iwai"
        }
    ],
    "description": "A novel microbiome reference database that disambiguates all bacterial strains, genome assemblies and extant cultures worldwide.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genome annotation",
                    "uri": "http://edamontology.org/operation_0362"
                },
                {
                    "term": "Genome assembly",
                    "uri": "http://edamontology.org/operation_0525"
                },
                {
                    "term": "Mapping assembly",
                    "uri": "http://edamontology.org/operation_0523"
                }
            ]
        }
    ],
    "homepage": "http://strainselect.secondgenome.com",
    "lastUpdate": "2023-03-17T10:21:39.620897Z",
    "name": "StrainSelect",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1016/J.HELIYON.2023.E13314",
            "metadata": {
                "abstract": "Motivation: Microbial metagenomic profiling software and databases are advancing rapidly for development of novel disease biomarkers and therapeutics yet three problems impede analyses: 1) the conflation of “genome assembly” and “strain” in reference databases; 2) difficulty connecting DNA biomarkers to a procurable strain for laboratory experimentation; and 3) absence of a comprehensive and unified strain-resolved reference database for integrating both shotgun metagenomics and 16S rRNA gene data. Results: We demarcated 681,087 strains, the largest collection of its kind, by filtering public data into a knowledge graph of vertices representing contiguous DNA sequences, genome assemblies, strain monikers and bio-resource center (BRC) catalog numbers then adding inter-vertex edges only for synonyms or direct derivatives. Surprisingly, for 10,043 important strains, we found replicate RefSeq genome assemblies obstructing interpretation of database searches. We organized each strain into eight taxonomic ranks with bootstrap confidence inversely correlated with genome assembly contamination. The StrainSelect database is suited for applications where a taxonomic, functional or procurement reference is needed for shotgun or amplicon metagenomics since 636,568 strains have at least one 16S rRNA gene, 245,005 have at least one annotated genome assembly, and 36,671 are procurable from at least one BRC. The database overcomes all three aforementioned problems since it disambiguates strains from assemblies, locates strains at BRCs, and unifies a taxonomic reference for both 16S rRNA and shotgun metagenomics. Availability: The StrainSelect database is available in igraph and tabular vertex-edge formats compatible with Neo4J. Dereplicated MinHash and fasta databases are distributed for sourmash and usearch pipelines at http://strainselect.secondgenome.com. Contact: todd.desantis@gmail.com. Supplementary information: Supplementary data are available online.",
                "authors": [
                    {
                        "name": "Cardona C."
                    },
                    {
                        "name": "Chow C.-E."
                    },
                    {
                        "name": "DeSantis T.Z."
                    },
                    {
                        "name": "Iwai S."
                    },
                    {
                        "name": "Narayan N.R."
                    },
                    {
                        "name": "Ravichandar D."
                    },
                    {
                        "name": "Viswanatham S."
                    },
                    {
                        "name": "Wee B."
                    }
                ],
                "date": "2023-02-01T00:00:00Z",
                "journal": "Heliyon",
                "title": "StrainSelect: A novel microbiome reference database that disambiguates all bacterial strains, genome assemblies and extant cultures worldwide"
            },
            "pmcid": "PMC9939595",
            "pmid": "36814618"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Metagenomic sequencing",
            "uri": "http://edamontology.org/topic_3837"
        },
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "Microbial ecology",
            "uri": "http://edamontology.org/topic_3697"
        },
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        }
    ]
}
