{
    "additionDate": "2019-11-14T18:38:37Z",
    "biotoolsCURIE": "biotools:survivorship_care_plan",
    "biotoolsID": "survivorship_care_plan",
    "confidence_flag": "low",
    "credit": [
        {
            "email": "heatherleeper@gmail.com",
            "name": "Heather E Leeper",
            "typeEntity": "Person"
        }
    ],
    "description": "> LOW CONFIDENCE! | > CORRECT NAME OF TOOL COULD ALSO BE 'Survivorship care planning neuro-oncology', 'survivorship care plans', 'survivorship care planning', 'survivorship care' | Survivorship care planning in neuro-oncology | The Neuro-Oncology Patient Survivorship Care Plan | Cancer patient survivorship has become a significant topic within oncology for both adult and pediatric patients",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://www.soc-neuro-onc.org/SNO/Resources/Survivorship_Care_Plan.aspx",
    "lastUpdate": "2019-11-14T18:38:37Z",
    "name": "survivorship care plan",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/NOP/NPX034",
            "metadata": {
                "abstract": "© The Author(s) 2018. Published by Oxford University Press on behalf of the Society for Neuro-Oncology and the European Association of Neuro-Oncology. All rights reserved.Cancer patient survivorship has become a significant topic within oncology care for both adult and pediatric patients. Starting in 2005, the Institute of Medicine recommended the use of survivorship care plans to assist patients transitioning from active treatment to the posttreatment phase of their cancer care, a critical time for many patients. Since 2014 there has been a mandate within the United States for adult cancer patients treated with curative intent to receive survivorship care plans comprised of a treatment summary and a follow-up plan to facilitate a better understanding among patients of what to expect after treatment. In addition to a general oncology survivorship care plan, specific care plans have been created for breast, lung, prostate, and colon cancers, as well as lymphoma. A survivorship care plan specific to adult neuro-oncology has been developed by a multidisciplinary and interprofessional committee, with approval from the Society for Neuro-Oncology Guidelines Committee. It has been published in compendium with this review of survivorship care planning and available as a fillable PDF on the Society of Neuro-Oncology Guidelines Endorsement web page (https://www.soc-neuro-onc.org/SNO/Resources/Survivorship_Care_Plan.aspx). Implementation of this survivorship care plan provides a unique opportunity to begin addressing the range of survivorship issues our neuro-oncology patients navigate from diagnosis to end of life.",
                "authors": [
                    {
                        "name": "Leeper H.E."
                    },
                    {
                        "name": "Acquaye A.A."
                    },
                    {
                        "name": "Bell S."
                    },
                    {
                        "name": "Clarke J.L."
                    },
                    {
                        "name": "Forst D."
                    },
                    {
                        "name": "Laack N.N."
                    },
                    {
                        "name": "Link M.J."
                    },
                    {
                        "name": "Taylor J.W."
                    },
                    {
                        "name": "Armstrong T.S."
                    }
                ],
                "citationCount": 5,
                "date": "2018-03-02T00:00:00Z",
                "journal": "Neuro-Oncology Practice",
                "title": "Survivorship care planning in neuro-oncology"
            },
            "pmcid": "PMC6655526",
            "pmid": "31386011"
        }
    ],
    "topic": [
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Critical care medicine",
            "uri": "http://edamontology.org/topic_3403"
        },
        {
            "term": "Surgery",
            "uri": "http://edamontology.org/topic_3421"
        }
    ]
}