{
    "accessibility": "Open access",
    "additionDate": "2022-08-28T12:44:35.048909Z",
    "biotoolsCURIE": "biotools:imshot",
    "biotoolsID": "imshot",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "imhof@lmu.de",
            "name": "Axel Imhof",
            "typeEntity": "Person"
        },
        {
            "email": "shibojyoti.lahiri@med.uni-muenchen.de",
            "name": "Shibojyoti Lahiri",
            "typeEntity": "Person"
        }
    ],
    "description": "The software ImShot aims to identifying peptides obtained in MALDI-IMS.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Deisotoping",
                    "uri": "http://edamontology.org/operation_3629"
                },
                {
                    "term": "Mass spectra calibration",
                    "uri": "http://edamontology.org/operation_3627"
                },
                {
                    "term": "Protein identification",
                    "uri": "http://edamontology.org/operation_3767"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://github.com/wasimaftab/ImShot",
    "language": [
        "R"
    ],
    "lastUpdate": "2024-11-24T15:46:17.207447Z",
    "license": "Other",
    "name": "ImShot",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1016/j.mcpro.2022.100242",
            "metadata": {
                "abstract": "Imaging mass spectrometry (IMS) has developed into a powerful tool allowing label-free detection of numerous biomolecules in situ. In contrast to shotgun proteomics, proteins/peptides can be detected directly from biological tissues and correlated to its morphology leading to a gain of crucial clinical information. However, direct identification of the detected molecules is currently challenging for MALDI-IMS, thereby compelling researchers to use complementary techniques and resource intensive experimental setups. Despite these strategies, sufficient information could not be extracted because of lack of an optimum data combination strategy/software. Here, we introduce a new open-source software ImShot that aims at identifying peptides obtained in MALDI-IMS. This is achieved by combining information from IMS and shotgun proteomics (LC-MS) measurements of serial sections of the same tissue. The software takes advantage of a twogroup comparison to determine the search space of IMS masses after deisotoping the corresponding spectra. Ambiguity in annotations of IMS peptides is eliminated by introduction of a novel scoring system that identifies the most likely parent protein of a detected peptide in the corresponding IMS dataset. Thanks to its modular structure, the software can also handle LC-MS data separately and display interactive enrichment plots and enriched Gene Ontology terms or cellular pathways. The software has been built as a desktop application with a conveniently designed graphic user interface to provide users with a seamless experience in data analysis. ImShot can run on all the three major desktop operating systems and is freely available under Massachusetts Institute of Technology license.",
                "authors": [
                    {
                        "name": "Aftab W."
                    },
                    {
                        "name": "Imhof A."
                    },
                    {
                        "name": "Lahiri S."
                    }
                ],
                "citationCount": 4,
                "date": "2022-06-01T00:00:00Z",
                "journal": "Molecular and Cellular Proteomics",
                "title": "ImShot: An Open-Source Software for Probabilistic Identification of Proteins In Situ and Visualization of Proteomics Data"
            },
            "pmcid": "PMC9194865",
            "pmid": "35569805"
        }
    ],
    "toolType": [
        "Desktop application",
        "Library"
    ],
    "topic": [
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ],
    "validated": 1
}
