{
    "additionDate": "2019-11-14T19:35:49Z",
    "biotoolsCURIE": "biotools:nanite",
    "biotoolsID": "nanite",
    "confidence_flag": "high",
    "credit": [
        {
            "email": "paul_mueller@tu-dresden.de",
            "name": "Paul Müller",
            "orcidid": "https://orcid.org/0000-0002-5734-3130",
            "typeEntity": "Person"
        }
    ],
    "description": "using machine learning to assess the quality of atomic force microscopy-enabled nano-indentation data | Loading, fitting, and rating AFM force-indentation data | Documentation — nanite 1.2.4 documentation | The documentation, including the code reference and examples, is available at nanite.readthedocs.io | Loading, fitting, and rating AFM force-distance data | Free document hosting provided by Read the Docs",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://nanite.readthedocs.io"
        }
    ],
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Parsing",
                    "uri": "http://edamontology.org/operation_1812"
                },
                {
                    "term": "Sorting",
                    "uri": "http://edamontology.org/operation_3802"
                }
            ]
        }
    ],
    "homepage": "https://github.com/AFM-Analysis/nanite",
    "language": [
        "Python"
    ],
    "lastUpdate": "2019-11-14T19:35:49Z",
    "license": "GPL-3.0",
    "name": "nanite",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12859-019-3010-3",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Atomic force microscopy (AFM) allows the mechanical characterization of single cells and live tissue by quantifying force-distance (FD) data in nano-indentation experiments. One of the main problems when dealing with biological tissue is the fact that the measured FD curves can be disturbed. These disturbances are caused, for instance, by passive cell movement, adhesive forces between the AFM probe and the cell, or insufficient attachment of the tissue to the supporting cover slide. In practice, the resulting artifacts are easily spotted by an experimenter who then manually sorts out curves before proceeding with data evaluation. However, this manual sorting step becomes increasingly cumbersome for studies that involve numerous measurements or for quantitative imaging based on FD maps. Results: We introduce the Python package nanite, which automates all basic aspects of FD data analysis, including data import, tip-sample separation, base line correction, contact point retrieval, and model fitting. In addition, nanite enables the automation of the sorting step using supervised learning. This learning approach relates subjective ratings to predefined features extracted from FD curves. For ratings ranging from 0 to 10, our approach achieves a mean squared error below 1.0 rating points and a classification accuracy between good and poor curves that is above 87%. We showcase our approach by quantifying Young's moduli of the zebrafish spinal cord at different classification thresholds and by introducing data quality as a new dimension for quantitative AFM image analysis. Conclusion: The addition of quality-based sorting using supervised learning enables a fully automated and reproducible FD data analysis pipeline for biological samples in AFM.",
                "authors": [
                    {
                        "name": "Muller P."
                    },
                    {
                        "name": "Abuhattum S."
                    },
                    {
                        "name": "Mollmert S."
                    },
                    {
                        "name": "Ulbricht E."
                    },
                    {
                        "name": "Taubenberger A.V."
                    },
                    {
                        "name": "Guck J."
                    }
                ],
                "citationCount": 1,
                "date": "2019-09-10T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Nanite: Using machine learning to assess the quality of atomic force microscopy-enabled nano-indentation data"
            },
            "pmcid": "PMC6734308",
            "pmid": "31500563"
        }
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Probes and primers",
            "uri": "http://edamontology.org/topic_0632"
        }
    ]
}