{
    "additionDate": "2017-12-18T00:13:16Z",
    "biotoolsCURIE": "biotools:stepgram",
    "biotoolsID": "stepgram",
    "credit": [
        {
            "email": "dlipson@cs.technion.ac.il",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Detect aberrations in DNA copy number data from aCGH (array-based comparative genomic hybridization) experiments.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://bioinfo.cs.technion.ac.il/stepgram/help.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Microarray data analysis",
                    "uri": "http://edamontology.org/operation_2495"
                }
            ]
        }
    ],
    "homepage": "http://bioinfo.cs.technion.ac.il/stepgram/",
    "lastUpdate": "2018-12-10T12:58:58Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/stepgram-2-12-application-aberration-calling-acgh-data.html"
        }
    ],
    "name": "Stepgram",
    "operatingSystem": [
        "Windows"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1089/cmb.2006.13.215",
            "metadata": {
                "abstract": "DNA amplifications and deletions characterize cancer genome and are often related to disease evolution. Microarray-based techniques for measuring these DNA copy-number changes use fluorescence ratios at arrayed DNA elements (BACs, cDNA, or oligonucleotides) to provide signals at high resolution, in terms of genomic locations. These date are then further analyzed to map aberrations and boundaries and identify biologically significant structures. We develop a statistical framework that enables the casting of several DNA copy number data analysis questions as optimization problems over real-valued vectors of signals. The simplest form of the optimization problem seeks to maximize φ(I) = Σvi/√|I| over all subintervals I in the input vector. We present and prove a linear time approximation scheme for this problem, namely, a process with time complexity O (nε-2) that outputs an interval for which φ(I) is at least Opt/α(ε), where Opt is the actual optimum and α(ε) → 1 as ε → 0. We further develop practical implementations that improve the performance of the naive quadratic approach by orders of magnitude. We discuss properties of optimal intervals and how they apply to the algorithm performance. We benchmark our algorithms on synthetic as well as publicly available DNA copy number data. We demonstrate the use of these methods for identifying aberrations in single samples as well as common alterations in fixed sets and subsets of breast cancer samples. © Mary Ann Liebert, Inc.",
                "authors": [
                    {
                        "name": "Lipson D."
                    },
                    {
                        "name": "Aumann Y."
                    },
                    {
                        "name": "Ben-Dor A."
                    },
                    {
                        "name": "Linial N."
                    },
                    {
                        "name": "Yakhini Z."
                    }
                ],
                "citationCount": 124,
                "date": "2006-03-01T00:00:00Z",
                "journal": "Journal of Computational Biology",
                "title": "Efficient calculation of interval scores for DNA copy number data analysis"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        }
    ],
    "validated": 1,
    "version": [
        "2.12"
    ]
}