{
    "additionDate": "2018-08-12T10:17:56Z",
    "biotoolsCURIE": "biotools:cipher",
    "biotoolsID": "cipher",
    "credit": [
        {
            "email": "cag104@ucsd.edu",
            "name": "Carlos Guzman",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "Ivan.Dorso@utsouthwestern.edu",
            "name": "Iván D’Orso",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Flexible and extensive workflow platform for integrative next-generation sequencing data analysis and genomic regulatory element prediction.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/c-guzman/cipher-workflow-platform/blob/master/README.md"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene regulatory network analysis",
                    "uri": "http://edamontology.org/operation_1781"
                }
            ]
        }
    ],
    "homepage": "https://github.com/c-guzman/cipher-workflow-platform",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-10T12:59:01Z",
    "name": "CIPHER",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "migle_sur",
    "publication": [
        {
            "doi": "10.1186/s12859-017-1770-1",
            "metadata": {
                "abstract": "© 2017 The Author(s).Background: Next-generation sequencing (NGS) approaches are commonly used to identify key regulatory networks that drive transcriptional programs. Although these technologies are frequently used in biological studies, NGS data analysis remains a challenging, time-consuming, and often irreproducible process. Therefore, there is a need for a comprehensive and flexible workflow platform that can accelerate data processing and analysis so more time can be spent on functional studies. Results: We have developed an integrative, stand-alone workflow platform, named CIPHER, for the systematic analysis of several commonly used NGS datasets including ChIP-seq, RNA-seq, MNase-seq, DNase-seq, GRO-seq, and ATAC-seq data. CIPHER implements various open source software packages, in-house scripts, and Docker containers to analyze and process single-ended and pair-ended datasets. CIPHER's pipelines conduct extensive quality and contamination control checks, as well as comprehensive downstream analysis. A typical CIPHER workflow includes: (1) raw sequence evaluation, (2) read trimming and adapter removal, (3) read mapping and quality filtering, (4) visualization track generation, and (5) extensive quality control assessment. Furthermore, CIPHER conducts downstream analysis such as: narrow and broad peak calling, peak annotation, and motif identification for ChIP-seq, differential gene expression analysis for RNA-seq, nucleosome positioning for MNase-seq, DNase hypersensitive site mapping, site annotation and motif identification for DNase-seq, analysis of nascent transcription from Global-Run On (GRO-seq) data, and characterization of chromatin accessibility from ATAC-seq datasets. In addition, CIPHER contains an \"analysis\" mode that completes complex bioinformatics tasks such as enhancer discovery and provides functions to integrate various datasets together. Conclusions: Using public and simulated data, we demonstrate that CIPHER is an efficient and comprehensive workflow platform that can analyze several NGS datasets commonly used in genome biology studies. Additionally, CIPHER's integrative \"analysis\" mode allows researchers to elicit important biological information from the combined dataset analysis.",
                "authors": [
                    {
                        "name": "Guzman C."
                    },
                    {
                        "name": "D'Orso I."
                    }
                ],
                "citationCount": 5,
                "date": "2017-08-08T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "CIPHER: A flexible and extensive workflow platform for integrative next-generation sequencing data analysis and genomic regulatory element prediction"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "ChIP-seq",
            "uri": "http://edamontology.org/topic_3169"
        },
        {
            "term": "RNA-seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Gene regulation",
            "uri": "http://edamontology.org/topic_0204"
        }
    ],
    "validated": 1
}