{
    "accessibility": "Open access",
    "additionDate": "2022-08-17T22:53:06.189198Z",
    "biotoolsCURIE": "biotools:reet",
    "biotoolsID": "reet",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "amina.asif@warwick.ac.uk",
            "name": "Amina Asif",
            "orcidid": "https://orcid.org/0000-0002-4424-3093",
            "typeEntity": "Person"
        },
        {
            "email": "fayyaz.minhas@warwick.ac.uk",
            "name": "Fayyaz Minhas",
            "orcidid": "https://orcid.org/0000-0001-9129-1189",
            "typeEntity": "Person"
        },
        {
            "name": "Alex Foote"
        },
        {
            "name": "Nasir Rajpoot"
        }
    ],
    "description": "Robustness Evaluation and Enhancement Toolbox for Computational Pathology.",
    "editPermission": {
        "type": "private"
    },
    "homepage": "https://github.com/alexjfoote/reetoolbox",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-08-17T22:53:06.191660Z",
    "license": "Not licensed",
    "name": "REET",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAC315",
            "metadata": {
                "abstract": "© 2022 The Author(s) 2022. Published by Oxford University Press. All rights reserved.Motivation: Digitization of pathology laboratories through digital slide scanners and advances in deep learning approaches for objective histological assessment have resulted in rapid progress in the field of computational pathology (CPath) with wide-ranging applications in medical and pharmaceutical research as well as clinical workflows. However, the estimation of robustness of CPath models to variations in input images is an open problem with a significant impact on the downstream practical applicability, deployment and acceptability of these approaches. Furthermore, development of domain-specific strategies for enhancement of robustness of such models is of prime importance as well. Results: In this work, we propose the first domain-specific Robustness Evaluation and Enhancement Toolbox (REET) for computational pathology applications. It provides a suite of algorithmic strategies for enabling robustness assessment of predictive models with respect to specialized image transformations such as staining, compression, focusing, blurring, changes in spatial resolution, brightness variations, geometric changes as well as pixel-level adversarial perturbations. Furthermore, REET also enables efficient and robust training of deep learning pipelines in computational pathology. Python implementation of REET is available at https://github.com/alexjfoote/reetoolbox.",
                "authors": [
                    {
                        "name": "Asif A."
                    },
                    {
                        "name": "Foote A."
                    },
                    {
                        "name": "Minhas F."
                    },
                    {
                        "name": "Rajpoot N."
                    }
                ],
                "date": "2022-06-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "REET: Robustness evaluation and enhancement toolbox for computational pathology"
            },
            "pmid": "35532083"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ],
    "validated": 1
}
