{
    "additionDate": "2022-10-07T08:50:40.940223Z",
    "biotoolsCURIE": "biotools:cpril",
    "biotoolsID": "cpril",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Ammar Qaseem"
        },
        {
            "name": "Stefan Günther"
        }
    ],
    "description": "CPRiL is a webserver for exploring functional compound-protein relationships that are extracted automatically from PubMed literature.",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://www.pharmbioinf.uni-freiburg.de/cpril",
    "lastUpdate": "2024-11-24T15:29:16.849201Z",
    "license": "Other",
    "name": "CPRiL",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btac539",
            "metadata": {
                "abstract": "Summary: Newly discovered functional relationships of (bio-)molecules are a key component in molecular biology and life science research. Especially in the drug discovery field, knowledge of how small molecules associated with proteins plays a fundamental role in understanding how drugs or metabolites can affect cells, tissues and human metabolism. Finding relevant information about these relationships among the huge number of published articles is becoming increasingly challenging and time-consuming. On average, more than 25 000 new (bio-)medical articles are added to the literature database PubMed weekly. In this article, we present a new web server [compound-protein relationships in literature (CPRiL)] that provides information on functional relationships between small molecules and proteins in literature. Currently, CPRiL contains ∼465 000 unique names and synonyms of small molecules, ∼100 000 unique proteins and more than 9 million described functional relationships between these entities. The applied BioBERT machine learning model for the determination of functional relationships between small molecules and proteins in texts was extensively trained and tested. On a related benchmark, CPRiL yielded a high performance, with an F1 score of 84.3%, precision of 82.9% and recall of 85.7%.",
                "authors": [
                    {
                        "name": "Gunther S."
                    },
                    {
                        "name": "Qaseem A."
                    }
                ],
                "citationCount": 1,
                "date": "2022-09-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "CPRiL: compound-protein relationships in literature"
            },
            "pmid": "35920772"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Literature and language",
            "uri": "http://edamontology.org/topic_3068"
        },
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        },
        {
            "term": "Molecular biology",
            "uri": "http://edamontology.org/topic_3047"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ],
    "validated": 1
}
