{
    "accessibility": "Open access",
    "additionDate": "2023-11-30T15:34:14.095284Z",
    "biotoolsCURIE": "biotools:mrf",
    "biotoolsID": "mrf",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "Vinaya.Katneni@icar.gov.in",
            "name": "Vinaya Kumar Katneni",
            "typeEntity": "Person"
        }
    ],
    "description": "Tool to overcome the barrier of inconsistent genome annotations and perform comparative genomics studies for the largest animal DNA virus.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Annotation track",
                        "uri": "http://edamontology.org/data_3002"
                    },
                    "format": [
                        {
                            "term": "GFF3",
                            "uri": "http://edamontology.org/format_1975"
                        }
                    ]
                },
                {
                    "data": {
                        "term": "Nucleic acid sequence",
                        "uri": "http://edamontology.org/data_2977"
                    },
                    "format": [
                        {
                            "term": "FASTA",
                            "uri": "http://edamontology.org/format_1929"
                        }
                    ]
                }
            ],
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Genome annotation",
                    "uri": "http://edamontology.org/operation_0362"
                },
                {
                    "term": "Parsing",
                    "uri": "http://edamontology.org/operation_1812"
                },
                {
                    "term": "Scaffolding",
                    "uri": "http://edamontology.org/operation_3216"
                }
            ]
        }
    ],
    "homepage": "http://14.139.181.163/mrf",
    "language": [
        "Perl",
        "Shell"
    ],
    "lastUpdate": "2023-11-30T15:34:14.098244Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/vinayciba/MRF"
        }
    ],
    "name": "MRF",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12985-023-02035-W",
            "metadata": {
                "abstract": "Background: The genome of the largest known animal virus, the white spot syndrome virus (WSSV) responsible for huge economic losses and loss of employment in aquaculture, suffers from inconsistent annotation nomenclature. Novel genome sequence, circular genome and variable genome length led to nomenclature inconsistencies. Since vast knowledge has already accumulated in the past two decades with inconsistent nomenclature, the insights gained on a genome could not be easily extendable to other genomes. Therefore, the present study aims to perform comparative genomics studies in WSSV on uniform nomenclature. Methods: We have combined the standard mummer tool with custom scripts to develop missing regions finder (MRF) that documents the missing genome regions and coding sequences in virus genomes in comparison to a reference genome and in its annotation nomenclature. The procedure was implemented as web tool and in command-line interface. Using MRF, we have documented the missing coding sequences in WSSV and explored their role in virulence through application of phylogenomics, machine learning models and homologous genes. Results: We have tabulated and depicted the missing genome regions, missing coding sequences and deletion hotspots in WSSV on a common annotation nomenclature and attempted to link them to virus virulence. It was observed that the ubiquitination, transcription regulation and nucleotide metabolism might be essentially required for WSSV pathogenesis; and the structural proteins, VP19, VP26 and VP28 are essential for virus assembly. Few minor structural proteins in WSSV would act as envelope glycoproteins. We have also demonstrated the advantage of MRF in providing detailed graphic/tabular output in less time and also in handling of low-complexity, repeat-rich and highly similar regions of the genomes using other virus cases. Conclusions: Pathogenic virus research benefits from tools that could directly indicate the missing genomic regions and coding sequences between isolates/strains. In virus research, the analyses performed in this study provides an advancement to find the differences between genomes and to quickly identify the important coding sequences/genomes that require early attention from researchers. To conclude, the approach implemented in MRF complements similarity-based tools in comparative genomics involving large, highly-similar, length-varying and/or inconsistently annotated viral genomes.",
                "authors": [
                    {
                        "name": "Hauton C."
                    },
                    {
                        "name": "Jangam A.K."
                    },
                    {
                        "name": "Jena J."
                    },
                    {
                        "name": "Kaikkolante N."
                    },
                    {
                        "name": "Katneni U.K."
                    },
                    {
                        "name": "Katneni V.K."
                    },
                    {
                        "name": "Koyadan V.K."
                    },
                    {
                        "name": "Krishnan K."
                    },
                    {
                        "name": "Mudagandur S.S."
                    },
                    {
                        "name": "Peruzza L."
                    },
                    {
                        "name": "Poochirian J.K."
                    },
                    {
                        "name": "Prabhudas S.K."
                    }
                ],
                "citationCount": 1,
                "date": "2023-12-01T00:00:00Z",
                "journal": "Virology Journal",
                "title": "MRF: a tool to overcome the barrier of inconsistent genome annotations and perform comparative genomics studies for the largest animal DNA virus"
            },
            "pmcid": "PMC10111743",
            "pmid": "37072853"
        }
    ],
    "toolType": [
        "Command-line tool",
        "Web application"
    ],
    "topic": [
        {
            "term": "Ontology and terminology",
            "uri": "http://edamontology.org/topic_0089"
        },
        {
            "term": "Phylogenomics",
            "uri": "http://edamontology.org/topic_0194"
        },
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        },
        {
            "term": "Virology",
            "uri": "http://edamontology.org/topic_0781"
        },
        {
            "term": "Zoology",
            "uri": "http://edamontology.org/topic_3500"
        }
    ]
}
