{
    "accessibility": "Open access (with restrictions)",
    "additionDate": "2021-09-20T08:58:33.343700Z",
    "biotoolsCURIE": "biotools:genedive",
    "biotoolsID": "genedive",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "ak@sfsu.edu",
            "name": "Anagha Kulkarni",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "GeneDive is a powerful but easy-to-use application that can search, sort, group, filter, highlight, and visualize interactions between drugs, genes, and diseases (DGR). GeneDive also facilitates topology discovery through the various search modes that reveal direct and indirect interactions between DGR.",
    "editPermission": {
        "authors": [
            "KumaranK"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Relation extraction",
                    "uri": "http://edamontology.org/operation_3625"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "http://www.genedive.net",
    "lastUpdate": "2024-11-24T14:46:35.191212Z",
    "name": "GeneDive",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1016/j.jbi.2021.103732",
            "metadata": {
                "abstract": "Background: Understanding the relationships between genes, drugs, and disease states is at the core of pharmacogenomics. Two leading approaches for identifying these relationships in medical literature are: human expert led manual curation efforts, and modern data mining based automated approaches. The former generates small amounts of high-quality data, and the latter offers large volumes of mixed quality data. The algorithmically extracted relationships are often accompanied by supporting evidence, such as, confidence scores, source articles, and surrounding contexts (excerpts) from the articles, that can be used as data quality indicators. Tools that can leverage these quality indicators to help the user gain access to larger and high-quality data are needed. Approach: We introduce GeneDive, a web application for pharmacogenomics researchers and precision medicine practitioners that makes gene, disease, and drug interactions data easily accessible and usable. GeneDive is designed to meet three key objectives: (1) provide functionality to manage information-overload problem and facilitate easy assimilation of supporting evidence, (2) support longitudinal and exploratory research investigations, and (3) offer integration of user-provided interactions data without requiring data sharing. Results: GeneDive offers multiple search modalities, visualizations, and other features that guide the user efficiently to the information of their interest. To facilitate exploratory research, GeneDive makes the supporting evidence and context for each interaction readily available and allows the data quality threshold to be controlled by the user as per their risk tolerance level. The interactive search-visualization loop enables relationship discoveries between diseases, genes, and drugs that might not be explicitly described in literature but are emergent from the source medical corpus and deductive reasoning. The ability to utilize user's data either in combination with the GeneDive native datasets or in isolation promotes richer data-driven exploration and discovery. These functionalities along with GeneDive's applicability for precision medicine, bringing the knowledge contained in biomedical literature to bear on particular clinical situations and improving patient care, are illustrated through detailed use cases. Conclusion: GeneDive is a comprehensive, broad-use biological interactions browser. The GeneDive application and information about its underlying system architecture are available at http://www.genedive.net. GeneDive Docker image is also available for download at this URL, allowing users to (1) import their own interaction data securely and privately; and (2) generate and test hypotheses across their own and other datasets.",
                "authors": [
                    {
                        "name": "Altman R.B."
                    },
                    {
                        "name": "Cole J."
                    },
                    {
                        "name": "Kulkarni A."
                    },
                    {
                        "name": "Laxmeshwar N."
                    },
                    {
                        "name": "Lever J."
                    },
                    {
                        "name": "Mallory E."
                    },
                    {
                        "name": "Petkovic D."
                    },
                    {
                        "name": "Previde P."
                    },
                    {
                        "name": "Thomas B."
                    },
                    {
                        "name": "Wong M."
                    }
                ],
                "citationCount": 4,
                "date": "2021-05-01T00:00:00Z",
                "journal": "Journal of Biomedical Informatics",
                "title": "Search and visualization of gene-drug-disease interactions for pharmacogenomics and precision medicine research using GeneDive"
            },
            "pmcid": "PMC9042200",
            "pmid": "33737208",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Literature and language",
            "uri": "http://edamontology.org/topic_3068"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Personalised medicine",
            "uri": "http://edamontology.org/topic_3577"
        },
        {
            "term": "Pharmacogenomics",
            "uri": "http://edamontology.org/topic_0208"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ]
}
