{
    "additionDate": "2017-02-10T14:14:36Z",
    "biotoolsCURIE": "biotools:asepcr",
    "biotoolsID": "asepcr",
    "description": "Tool for carrying out e-PCR to detect differences in amplicon sizes in transcripts from different tissues and organs.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Splice transcript prediction",
                    "uri": "http://edamontology.org/operation_0264"
                },
                {
                    "term": "Splicing model analysis",
                    "uri": "http://edamontology.org/operation_2499"
                }
            ]
        }
    ],
    "homepage": "http://genome.ewha.ac.kr/ASePCR/",
    "homepage_status": 1,
    "lastUpdate": "2018-12-10T12:58:39Z",
    "name": "ASePCR",
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "RT-PCR is one of the most powerful and direct methods to detect transcript variants due to alternative splicing (AS) that increase transcript diversity significantly in vertebrates. ASePCR is an efficient web-based application that emulates RT-PCR in various tissues. It estimates the amplicon size for a given primer pair based on the transcript models identified by the reverse e-PCR program of the NCBI. The tissue specificity of each PCR band is deduced from the tissue information of expressed sequence tag (EST) sequences compatible with each transcript structure. The output page shows PCR bands like a gel electrophoresis in various tissues. Each band in the output picture represents a putative isoform that could happen in a tissue-specific manner. It also shows the EST alignment and tissue information in the genome browser. Furthermore, the user can compare the AS patterns of orthologous genes in other species. The ASePCR, available at http:// genome.ewha.ac.kr/ASePCR/, supports the transcriptome models of the RefSeq, Ensembl, ECgene and AceView for human, mouse, rat and chicken genomes. It will be a valuable web resource to explore the transcriptome diversity associated with different tissues and organs in multiple species. © 2005 Oxford University Press.",
                "authors": [
                    {
                        "name": "Kim N."
                    },
                    {
                        "name": "Lim D."
                    },
                    {
                        "name": "Lee S."
                    },
                    {
                        "name": "Kim H."
                    }
                ],
                "citationCount": 9,
                "date": "2005-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "ASePCR: Alternative splicing electronic RT-PCR in multiple tissues and organs"
            },
            "pmid": "15980562"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "RNA splicing",
            "uri": "http://edamontology.org/topic_3320"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ],
    "validated": 1
}