{
    "additionDate": "2021-01-18T09:16:24Z",
    "biotoolsCURIE": "biotools:brem-sc",
    "biotoolsID": "brem-sc",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "wei.chen@chp.edu",
            "name": "Wei Chen",
            "orcidid": "https://orcid.org/0000-0001-7196-8703",
            "typeEntity": "Person"
        }
    ],
    "description": "BREM-SC is an R package (with core functions jointDIMMSC and BREMSC) for joint clustering droplet-based scRNA-seq and CITE-seq data. jointDIMMSC is developed as a direct extension of DIMMSC, which assumes full indenpendency between single cell RNA and surface protein data. To take the correlation between two data sources into consideration, we further develop BREMSC, which uses random effects to incorporate the two data sources. This package can directly work on raw count data from droplet-based scRNA-seq and CITE-seq experiments without any data transformation, and it can provide clustering uncertainty for each cell.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "Epitope mapping",
                    "uri": "http://edamontology.org/operation_0416"
                },
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                }
            ]
        }
    ],
    "homepage": "https://github.com/tarot0410/BREMSC",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-02-06T17:21:46Z",
    "name": "BREM-SC",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/NAR/GKAA314",
            "metadata": {
                "abstract": "© 2020 Oxford University Press. All rights reserved.Droplet-based single cell transcriptome sequencing (scRNA-seq) technology, largely represented by the 10× Genomics Chromium system, is able tomeasure the gene expression from tens of thousands of single cells simultaneously. More recently, coupled with the cutting-edge Cellular Indexing of Transcriptomes and Epitopes by Sequencing (CITE-seq), the dropletbased system has allowed for immunophenotyping of single cells based on cell surface expression of specific proteins together with simultaneous transcriptome profiling in the same cell. Despite the rapid advances in technologies, novel statistical methods and computational tools for analyzing multi-modal CITE-Seq data are lacking. In this study, we developed BREM-SC, a novel Bayesian Random Effects Mixture model that jointly clusters paired single cell transcriptomic and proteomic data. Through simulation studies and analysis of public and in-house real data sets, we successfully demonstrated the validity and advantages of this method in fully utilizing both types of data to accurately identify cell clusters. In addition, as a probabilistic model-based approach, BREM-SC is able to quantify the clustering uncertainty for each single cell. This new method will greatly facilitate researchers to jointly study transcriptome and surface proteins at the single cell level to make new biological discoveries, particularly in the area of immunology.",
                "authors": [
                    {
                        "name": "Wang X."
                    },
                    {
                        "name": "Sun Z."
                    },
                    {
                        "name": "Zhang Y."
                    },
                    {
                        "name": "Xu Z."
                    },
                    {
                        "name": "Xin H."
                    },
                    {
                        "name": "Huang H."
                    },
                    {
                        "name": "Duerr R.H."
                    },
                    {
                        "name": "Chen K."
                    },
                    {
                        "name": "Ding Y."
                    },
                    {
                        "name": "Chen W."
                    }
                ],
                "citationCount": 1,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "BREM-SC: A bayesian random effects mixture model for joint clustering single cell multi-omics data"
            },
            "pmcid": "PMC7293045",
            "pmid": "32379315"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        },
        {
            "term": "Immunology",
            "uri": "http://edamontology.org/topic_0804"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ]
}