{"credit":[{"email":"zintza@med.uth.gr","name":"Elias Zintzaras","typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://biomath.med.uth.gr/"}],"documentation":[{"type":"GENERAL","url":"http://biomath.med.uth.gr/default.aspx?id=232164AC-9C6B-4A27-A595-2A22C35B6260"}],"function":[{"operation":[{"term":"Gene expression analysis","uri":"http://edamontology.org/operation_2495"}]}],"labels":{"operatingSystem":["Windows"],"toolType":["Command-line tool"],"topic":[{"term":"Microarray experiment","uri":"http://edamontology.org/topic_3518"},{"term":"Gene expression","uri":"http://edamontology.org/topic_0203"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/metradisc-metradisc-xl-meta-analysis-microarrays-datasets-heterogeneity-testing.html"}],"publication":[{"abstract":"The combination of results from different large-scale datasets of multidimensional biological signals (such as gene expression profiling) presents a major challenge. Methodologies are needed that can efficiently combine diverse datasets, but can also test the extent of diversity (heterogeneity) across the combined studies. We developed METa-analysis of RAnked DISCovery datasets (METRADISC), a generalized meta-analysis method for combining information across discovery-oriented datasets and for testing between-study heterogeneity for each biological variable of interest. The method is based on non-parametric Monte Carlo permutation testing. The tested biological variables are ranked in each study according to the level of statistical significance. METRADISC tests for each biological variable of interest its average rank and the between-study heterogeneity of the study-specific ranks. After accounting for ties and differences in tested variables across studies, we randomly permute the ranks of each study and the simulated metrics of average rank and heterogeneity are calculated. The procedure is repeated to generate null distributions for the metrics. The use of METRADISC is demonstrated empirically using gene expression data from seven studies comparing prostate cancer cases and normal controls. We offer a new tool for combining complex datasets derived from massive testing, discovery-oriented research and for examining the diversity of results across the combined studies. © 2007 Elsevier Ltd. All rights reserved.","authors":["Zintzaras E.","Ioannidis J.P.A."],"cit_count":30,"journal":"Computational Biology and Chemistry","pmid":"17988949","title":"Meta-analysis for ranked discovery datasets: Theoretical framework and empirical demonstration for microarrays","year":"2008-01-01"}],"summary":{"biotoolsCURIE":"biotools:metradisc","biotoolsID":"metradisc","description":"Generalized meta-analysis method for combining information across discovery-oriented datasets and for testing between-study heterogeneity for each biological variable of interest. The method is based on non-parametric Monte Carlo permutation testing.","homepage":"http://biomath.med.uth.gr/default.aspx?id=232164AC-9C6B-4A27-A595-2A22C35B6260","name":"METRADISC"}}