{
    "additionDate": "2018-05-17T16:37:08Z",
    "biotoolsCURIE": "biotools:hdam",
    "biotoolsID": "hdam",
    "credit": [
        {
            "name": "Support",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.megabionet.org/HDAM/contact.php"
        }
    ],
    "description": "A resource of human disease associated mutations from next generation sequencing studies.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://www.megabionet.org/HDAM/about.php"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                }
            ]
        }
    ],
    "homepage": "http://www.megabionet.org/HDAM/",
    "homepage_status": 1,
    "lastUpdate": "2018-12-10T12:58:58Z",
    "name": "HDAM",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1186/1755-8794-6-S1-S16",
            "metadata": {
                "abstract": "Background: Next generation sequencing (NGS) technologies have greatly facilitated the rapid and economical detection of pathogenic mutations in human disorders. However, mutation descriptions are hard to be compared and integrated due to various reference sequences and annotation tools adopted in different articles as well as the nomenclature of diseases/traits. Description. The Human Disease Associated Mutation (HDAM) database is dedicated to collect, standardize and re-annotate mutations for human diseases discovered by NGS studies. In the current release, HDAM contains 1,114 mutations, located in 669 genes and associated with 125 human diseases through literature mining. All mutation records have uniform and unequivocal descriptions of sequence changes according to the Human Genome Sequence Variation Society (HGVS) nomenclature recommendations. Each entry displays comprehensive information, including mutation location in genome (hg18/hg19), gene functional annotation, protein domain annotation, susceptible diseases, the first literature report of the mutation and etc. Moreover, new mutation-disease relationships predicted by Bayesian network are also presented under each mutation. Conclusion: HDAM contains hundreds rigorously curated human mutations from NGS studies and was created to provide a comprehensive view of these mutations that confer susceptibility to the common disorders. HDAM can be freely accessed at http://www.megabionet.org/HDAM. © 2013 Jia et al.; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Jia M."
                    },
                    {
                        "name": "Liu Y."
                    },
                    {
                        "name": "Shen Z."
                    },
                    {
                        "name": "Zhao C."
                    },
                    {
                        "name": "Zhang M."
                    },
                    {
                        "name": "Yi Z."
                    },
                    {
                        "name": "Wen C."
                    },
                    {
                        "name": "Deng Y."
                    },
                    {
                        "name": "Shi T."
                    }
                ],
                "citationCount": 3,
                "date": "2013-01-31T00:00:00Z",
                "journal": "BMC Medical Genomics",
                "title": "HDAM: A resource of human disease associated mutations from next generation sequencing studies"
            },
            "pmcid": "PMC3552701",
            "pmid": "23369322"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "DNA mutation",
            "uri": "http://edamontology.org/topic_2533"
        },
        {
            "term": "Human biology",
            "uri": "http://edamontology.org/topic_2815"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        }
    ],
    "validated": 1
}