{
    "additionDate": "2021-09-27T07:45:00.103652Z",
    "biotoolsCURIE": "biotools:idrbp-ppct",
    "biotoolsID": "idrbp-ppct",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "bliu@insun.hit.edu.cn",
            "name": "Bin Liu",
            "typeEntity": "Person"
        },
        {
            "email": "jzhang@bliulab.net",
            "name": "Jun Zhang",
            "typeEntity": "Person"
        },
        {
            "email": "nwang@bliulab.net",
            "name": "Ning Wang",
            "typeEntity": "Person"
        }
    ],
    "description": "IDRBP-PPCT is a web application for identifying nucleic acid-binding proteins based on position-specific score matrix and position-specific frequency matrix cross transformation.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "DNA-binding protein prediction",
                    "uri": "http://edamontology.org/operation_3900"
                },
                {
                    "term": "Nucleic acids-binding site prediction",
                    "uri": "http://edamontology.org/operation_0420"
                },
                {
                    "term": "RNA-binding protein prediction",
                    "uri": "http://edamontology.org/operation_3901"
                }
            ]
        }
    ],
    "homepage": "http://bliulab.net/IDRBP-PPCT",
    "lastUpdate": "2021-09-27T07:45:00.106112Z",
    "name": "IDRBP-PPCT",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1109/TCBB.2021.3069263",
            "metadata": {
                "abstract": "IEEEDNA-binding proteins (DBPs) and RNA-binding proteins (RBPs) are two important nucleic acid-binding proteins (NABPs), which play important roles in biological processes such as replication, translation and transcription of genetic material. Some proteins (DRBPs) bind to both DNA and RNA, also play a key role in gene expression. Identification of DBPs, RBPs and DRBPs is important to study protein-nucleic acid interactions. Computational methods are increasingly being proposed to automatically identify DNA- or RNA-binding proteins based only on protein sequences. One challenge is to design an effective protein representation method to convert protein sequences into fixed-dimension feature vectors. In this study, we proposed a novel protein representation method called Position-Specific Scoring Matrix (PSSM) and Position-Specific Frequency Matrix (PSFM) Cross Transformation (PPCT) to represent protein sequences. This method contains the evolutionary information in PSSM and PSFM, and their correlations. A new computational predictor called IDRBP-PPCT was proposed by combining PPCT and a two-layer framework based on the random forest algorithm to identify DBPs, RBPs and DRBPs. The experimental results on the independent dataset and the tomato genome proved the effectiveness of the proposed method. A user-friendly web-server of IDRBP-PPCT was constructed, which is freely available at http://bliulab.net/IDRBP-PPCT.",
                "authors": [
                    {
                        "name": "Liu B."
                    },
                    {
                        "name": "Wang N."
                    },
                    {
                        "name": "Zhang J."
                    }
                ],
                "date": "2021-01-01T00:00:00Z",
                "journal": "IEEE/ACM Transactions on Computational Biology and Bioinformatics",
                "title": "IDRBP-PPCT: Identifying nucleic acid-binding proteins based on Position-Specific Score Matrix and Position-Specific Frequency Matrix Cross Transformation"
            },
            "pmid": "33780341",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "DNA binding sites",
            "uri": "http://edamontology.org/topic_3125"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Protein expression",
            "uri": "http://edamontology.org/topic_0108"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        }
    ]
}
