
{
    "credit": [
        {
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://athena.bioc.uvic.ca/about-us/"
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://virology.uvic.ca/help/tool-help/how-to/vgo-how-to/"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence motif recognition",
                    "uri": "http://edamontology.org/operation_0239"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Genome visualisation",
                    "uri": "http://edamontology.org/operation_3208"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "JavaScript",
            "Java"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Desktop application"
        ],
        "topic": [
            {
                "term": "Sequence analysis",
                "uri": "http://edamontology.org/topic_0080"
            },
            {
                "term": "DNA",
                "uri": "http://edamontology.org/topic_0654"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/vgo-3-1-viral-genome-browser.html"
        }
    ],
    "publication": [
        {
            "abstract": "The Poxvirus Bioinformatics Resource Center (PBRC) has been established to provide informational and analytical resources to the scientific community to aid research directed at providing a better understanding of the Poxviridae family of viruses. The PBRC was specifically established as the result of the concern that variola virus, the causative agent of smallpox, as well as related viruses, might be utilized as biological weapons. In addition, the PBRC supports research on poxviruses that might be considered new and emerging infectious agents such as monkeypox virus. The PBRC consists of a relational database and web application that supports the data storage, annotation, analysis and information exchange goals of the project. The current release consists of over 35 complete genomic sequences of various genera, species and strains of viruses from the Poxviridae family. Sequence and annotation information for these viruses has been obtained from sequences publicly available from GenBank as well as sequences not yet deposited in GenBank that have been obtained from ongoing sequencing projects. In addition to sequence data, the PBRC provides comprehensive annotation and curation of virus genes; analytical tools to aid in the understanding of the available sequence data, including tools for the comparative analysis of different virus isolates; and visualization tools to help better display the results of various analyses. The PBRC represents the initial development of what will become a more comprehensive Viral Bioinformatics Resource Center for Biodefense that will be one of the National Institute of Allergy and Infectious Diseases' 'Bioinformatics Resource Centers for Biodefense and Emerging or Re-Emerging Infectious Diseases'. The PBRC website is available at http://www.poxvirus.org. © Oxford University Press 2005; all rights reserved.",
            "authors": [
                "Lefkowitz E.J.",
                "Upton C.",
                "Changayil S.S.",
                "Buck C.",
                "Traktman P.",
                "Buller R.M.L."
            ],
            "cit_count": 44,
            "doi": "10.1093/nar/gki110",
            "journal": "Nucleic Acids Research",
            "title": "Poxvirus Bioinformatics Resource Center: A comprehensive Poxviridae informational and analytical resource",
            "type": "Primary",
            "year": "2005-01-01"
        },
        {
            "abstract": "The viral genome organizer (VGO) is designed to simplify the characterization and annotation of complete viral genomes (particularly those of large poxviruses) and to help researchers discover new genes and detect gene fragmentation. VGO is based on Genotator [Harris, N.L., 1997. Genome Res. 7, 754-762], an annotation workbench designed for the analysis of eukaryotic genomic sequences. VGO automates a number of database search routines (FASTA, BLASTP, PSI-BLAST and TBLASTN), processes the results through a multiple-alignment viewer (MView; [Brown, N.P., Leroy, C., Sander, C., 1998. Bioinformatics 14, 380-381]) and serves to manage the hundreds of DNA, protein and database search results files that must be organized when dealing with large complete poxviral genomes. It also directs the generation a self-dotplot of the genome by Dotter [Sonnhammer, E.L.L., Durbin, R., 1995. A dot-matrix program with dynamic threshold control suited for genomic DNA and protein sequence analysis. Gene 167: GC1-10. http://www.sanger.ac.uk/Software/Dotter/] to uncover repeated genes and sequences and provides Internet links to programs for generation of restriction maps and analysis of potential PCR primers. The user-friendly graphical interface displays DNA and protein sequences, links to search results, ORFs, stop-start codons, restriction sites and flags of database searches. Currently, VGO and associated programs run in an X-windows environment on commonly available UNIX machines. (C) 2000 Elsevier Science B.V.",
            "authors": [
                "Upton C.",
                "Hogg D.",
                "Perrin D.",
                "Boone M.",
                "Harris N.L."
            ],
            "cit_count": 40,
            "doi": "10.1016/S0168-1702(00)00210-0",
            "journal": "Virus Research",
            "title": "Viral genome organizer: A system for analyzing complete viral genomes",
            "type": "Primary",
            "year": "2000-11-22"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:vgo",
        "biotoolsID": "vgo",
        "description": "Viral Genome Organizer is a genome browser that can be used to display information about a genome, its genes, ORFs and start/stop codons. It can also be used to perform a regular expression search, a fuzzy motif search and a masslist search, as well as compare genomes with VOCs genome sequence database.",
        "homepage": "http://athena.bioc.uvic.ca/virology-ca-tools/vgo/",
        "name": "VGO",
        "version": [
            "3.1"
        ]
    }
}