{
    "additionDate": "2020-01-14T19:51:09Z",
    "biotoolsCURIE": "biotools:LePrimAlign",
    "biotoolsID": "LePrimAlign",
    "confidence_flag": "high",
    "credit": [
        {
            "email": "Young-Rae_Cho@baylor.edu",
            "name": "Young-Rae Cho",
            "orcidid": "https://orcid.org/0000-0002-4645-2542",
            "typeEntity": "Person"
        }
    ],
    "description": "local entropy-based alignment of PPI networks to predict conserved modules.\n\nLePrimAlign: local entropy-based alignment of PPI networks.\n\nCross-species analysis of protein-protein interaction (PPI) networks provides an effective means of detecting conserved interaction patterns",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Pairwise sequence alignment",
                    "uri": "http://edamontology.org/operation_0491"
                },
                {
                    "term": "Pathway or network prediction",
                    "uri": "http://edamontology.org/operation_3439"
                },
                {
                    "term": "Local alignment",
                    "uri": "http://edamontology.org/operation_0495"
                },
                {
                    "term": "Protein interaction prediction",
                    "uri": "http://edamontology.org/operation_2492"
                }
            ]
        }
    ],
    "homepage": "http://web.ecs.baylor.edu/faculty/cho/LePrimAlign",
    "lastUpdate": "2020-01-14T19:51:09Z",
    "name": "LePrimAlign",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12864-019-6271-3",
            "metadata": {
                "abstract": "© 2019 Maskey and Cho.Background: Cross-species analysis of protein-protein interaction (PPI) networks provides an effective means of detecting conserved interaction patterns. Identifying such conserved substructures between PPI networks of different species increases our understanding of the principles deriving evolution of cellular organizations and their functions in a system level. In recent years, network alignment techniques have been applied to genome-scale PPI networks to predict evolutionary conserved modules. Although a wide variety of network alignment algorithms have been introduced, developing a scalable local network alignment algorithm with high accuracy is still challenging. Results: We present a novel pairwise local network alignment algorithm, called LePrimAlign, to predict conserved modules between PPI networks of three different species. The proposed algorithm exploits the results of a pairwise global alignment algorithm with many-to-many node mapping. It also applies the concept of graph entropy to detect initial cluster pairs from two networks. Finally, the initial clusters are expanded to increase the local alignment score that is formulated by a combination of intra-network and inter-network scores. The performance comparison with state-of-the-art approaches demonstrates that the proposed algorithm outperforms in terms of accuracy of identified protein complexes and quality of alignments. Conclusion: The proposed method produces local network alignment of higher accuracy in predicting conserved modules even with large biological networks at a reduced computational cost.",
                "authors": [
                    {
                        "name": "Maskey S."
                    },
                    {
                        "name": "Cho Y.-R."
                    }
                ],
                "citationCount": 1,
                "date": "2019-12-24T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "LePrimAlign: Local entropy-based alignment of PPI networks to predict conserved modules"
            },
            "pmcid": "PMC6929407",
            "pmid": "31874635"
        }
    ],
    "topic": [
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "Protein interaction experiment",
            "uri": "http://edamontology.org/topic_3557"
        }
    ]
}