{
    "additionDate": "2020-01-14T09:12:05Z",
    "biotoolsCURIE": "biotools:ADAPTABLE",
    "biotoolsID": "ADAPTABLE",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "francisco.ramos@u-picardie.fr",
            "name": "Francisco Ramos-Martín",
            "typeEntity": "Person"
        },
        {
            "email": "nicola.damelio@u-picardie.fr",
            "name": "Nicola D’Amelio",
            "orcidid": "https://orcid.org/0000-0002-4400-2222",
            "typeEntity": "Person"
        }
    ],
    "description": "A comprehensive web platform of antimicrobial peptides tailored to the user's research.\n\nAntimicrobial peptides (AMPs) are part of the innate immune response to pathogens in all of the kingdoms of life. They have received significant attention because of their extraordinary variety of activities, in particular, as candidate drugs against the threat of super-bacteria.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Pairwise sequence alignment",
                    "uri": "http://edamontology.org/operation_0491"
                },
                {
                    "term": "Scaffolding",
                    "uri": "http://edamontology.org/operation_3216"
                },
                {
                    "term": "Sorting",
                    "uri": "http://edamontology.org/operation_3802"
                }
            ]
        }
    ],
    "homepage": "http://gec.u-picardie.fr/adaptable/",
    "lastUpdate": "2021-01-14T14:57:11Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://gitlab.com/pachoramos/adaptable"
        }
    ],
    "name": "ADAPTABLE",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.26508/LSA.201900512",
            "metadata": {
                "abstract": "© 2019 Ramos-Martín et al.Antimicrobial peptides (AMPs) are part of the innate immune response to pathogens in all of the kingdoms of life. They have received significant attention because of their extraordinary variety of activities, in particular, as candidate drugs against the threat of super-bacteria. A systematic study of the relation between the sequence and the mechanism of action is urgently needed, given the thousands of sequences already in multiple web resources. ADAPTABLE web platform (http://gec.u-picardie.fr/adaptable) introduces the concept of “property alignment” to create families of property and sequence-related peptides (SR families). This feature provides the researcher with a tool to select those AMPs meaningful to their research from among more than 40,000 nonredundant sequences. Selectable properties include the target organism and experimental activity concentration, allowing selection of peptides with multiple simultaneous actions. This is made possible by ADAPTABLE because it not only merges sequences of AMP databases but also merges their data, thereby standardizing values and handling non-proteinogenic amino acids. In this unified platform, SR families allow the creation of peptide scaffolds based on common traits in peptides with similar activity, independently of their source.",
                "authors": [
                    {
                        "name": "Ramos-Martin F."
                    },
                    {
                        "name": "Annaval T."
                    },
                    {
                        "name": "Buchoux S."
                    },
                    {
                        "name": "Sarazin C."
                    },
                    {
                        "name": "D'Amelio N."
                    }
                ],
                "citationCount": 8,
                "date": "2019-01-01T00:00:00Z",
                "journal": "Life Science Alliance",
                "title": "Adaptable: A comprehensive web platform of antimicrobial peptides tailored to the user’s research"
            },
            "pmcid": "PMC6864362",
            "pmid": "31740563"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ],
    "validated": 1
}