{
    "additionDate": "2018-04-22T11:27:18Z",
    "biotoolsCURIE": "biotools:hypoxiadb",
    "biotoolsID": "hypoxiadb",
    "credit": [
        {
            "email": "pankaj@hypoxiadb.com",
            "name": "Pankaj Khurana",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Manually-curated non-redundant catalogue of human hypoxia-regulated proteins with a goal of collecting proteins whose expression patterns are altered in hypoxic conditions.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://www.hypoxiadb.com/tutorial.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                }
            ]
        }
    ],
    "homepage": "http://www.hypoxiadb.com/hypoxiadb.html",
    "lastUpdate": "2018-12-10T12:58:57Z",
    "name": "HypoxiaDB",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1093/database/bat074",
            "metadata": {
                "abstract": "There has been intense interest in the cellular response to hypoxia, and a large number of differentially expressed proteins have been identified through various high-throughput experiments. These valuable data are scattered, and there have been no systematic attempts to document the various proteins regulated by hypoxia. Compilation, curation and annotation of these data are important in deciphering their role in hypoxia and hypoxia-related disorders. Therefore, we have compiled HypoxiaDB, a database of hypoxia-regulated proteins. It is a comprehensive, manually-curated, non-redundant catalog of proteins whose expressions are shown experimentally to be altered at different levels and durations of hypoxia. The database currently contains 72 000 manually curated entries taken on 3500 proteins extracted from 73 peer-reviewed publications selected from PubMed. HypoxiaDB is distinctive from other generalized databases: (i) it compiles tissue-specific protein expression changes under different levels and duration of hypoxia. Also, it provides manually curated literature references to support the inclusion of the protein in the database and establish its association with hypoxia. (ii) For each protein, HypoxiaDB integrates data on gene ontology, KEGG (Kyoto Encyclopedia of Genes and Genomes) pathway, protein-protein interactions, protein family (Pfam), OMIM (Online Mendelian Inheritance in Man), PDB (Protein Data Bank) structures and homology to other sequenced genomes. (iii) It also provides pre-compiled information on hypoxiaproteins, which otherwise requires tedious computational analysis. This includes information like chromosomal location, identifiers like Entrez, HGNC, Unigene, Uniprot, Ensembl, Vega, GI numbers and Genbank accession numbers associated with the protein. These are further cross-linked to respective public databases augmenting HypoxiaDB to the external repositories. (iv) In addition, HypoxiaDB provides an online sequence-similarity search tool for users to compare their protein sequences with HypoxiaDB protein database. We hope that HypoxiaDB will enrich our knowledge about hypoxia-related biology and eventually will lead to the development of novel hypothesis and advancements in diagnostic and therapeutic activities. HypoxiaDB is freely accessible for academic and non-profit users via http://www.hypoxiadb.com. © The Author(s) 2013. Published by Oxford University Press.",
                "authors": [
                    {
                        "name": "Khurana P."
                    },
                    {
                        "name": "Sugadev R."
                    },
                    {
                        "name": "Jain J."
                    },
                    {
                        "name": "Singh S.B."
                    }
                ],
                "citationCount": 15,
                "date": "2013-12-01T00:00:00Z",
                "journal": "Database",
                "title": "HypoxiaDB: A database of hypoxia-regulated proteins"
            },
            "pmcid": "PMC3813937",
            "pmid": "24178989"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        },
        {
            "term": "Data submission, annotation and curation",
            "uri": "http://edamontology.org/topic_0219"
        }
    ],
    "validated": 1
}