{
    "accessibility": "Open access",
    "additionDate": "2022-07-17T10:24:43.662163Z",
    "biotoolsCURIE": "biotools:bletl",
    "biotoolsID": "bletl",
    "confidence_flag": "tool",
    "cost": "Free of charge (with restrictions)",
    "credit": [
        {
            "email": "m.oldiges@fz-juelich.de",
            "name": "Marco Oldiges",
            "orcidid": "https://orcid.org/0000-0003-0704-5597",
            "typeEntity": "Person"
        },
        {
            "name": "Michael Osthege",
            "orcidid": "https://orcid.org/0000-0002-2734-7624"
        }
    ],
    "description": "A Python package for integrating BioLector microcultivation devices in the Design-Build-Test-Learn cycle.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Feature extraction",
                    "uri": "http://edamontology.org/operation_3937"
                },
                {
                    "term": "Parsing",
                    "uri": "http://edamontology.org/operation_1812"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                }
            ]
        }
    ],
    "homepage": "https://github.com/JuBiotech/bletl",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-07-17T10:24:43.664862Z",
    "license": "AGPL-3.0",
    "name": "bletl",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1002/ELSC.202100108",
            "metadata": {
                "abstract": "© 2022 The Authors. Engineering in Life Sciences published by Wiley-VCH GmbH.Microbioreactor (MBR) devices have emerged as powerful cultivation tools for tasks of microbial phenotyping and bioprocess characterization and provide a wealth of online process data in a highly parallelized manner. Such datasets are difficult to interpret in short time by manual workflows. In this study, we present the Python package bletl and show how it enables robust data analyses and the application of machine learning techniques without tedious data parsing and preprocessing. bletl reads raw result files from BioLector I, II and Pro devices to make all the contained information available to Python-based data analysis workflows. Together with standard tooling from the Python scientific computing ecosystem, interactive visualizations and spline-based derivative calculations can be performed. Additionally, we present a new method for unbiased quantification of time-variable specific growth rate (Formula presented.) based on unsupervised switchpoint detection with Student-t distributed random walks. With an adequate calibration model, this method enables practitioners to quantify time-variable growth rate with Bayesian uncertainty quantification and automatically detect switch-points that indicate relevant metabolic changes. Finally, we show how time series feature extraction enables the application of machine learning methods to MBR data, resulting in unsupervised phenotype characterization. As an example, Neighbor Embedding (t-SNE) is performed to visualize datasets comprising a variety of growth/DO/pH phenotypes.",
                "authors": [
                    {
                        "name": "Hemmerich J."
                    },
                    {
                        "name": "Muller C."
                    },
                    {
                        "name": "Noack S."
                    },
                    {
                        "name": "Oldiges M."
                    },
                    {
                        "name": "Osthege M."
                    },
                    {
                        "name": "Tenhaef N."
                    },
                    {
                        "name": "Wiechert W."
                    },
                    {
                        "name": "Zyla R."
                    }
                ],
                "citationCount": 2,
                "date": "2022-03-01T00:00:00Z",
                "journal": "Engineering in Life Sciences",
                "title": "bletl - A Python package for integrating BioLector microcultivation devices in the Design-Build-Test-Learn cycle"
            },
            "pmcid": "PMC8961055",
            "pmid": "35382539"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ]
}
