{
    "name": "Marky", 
    "description": "It is able to annotate biomedical texts using different annotation classes. You only need a server with php technology and one database to annotate documents with a browser. Users can enter biomedical documents to be annotated by other users and get annotations for relevant terms, such as diseases, symptoms and treatments.", 
    "homepage": "http://sing.ei.uvigo.es/marky/", 
    "biotoolsID": "marky", 
    "biotoolsCURIE": "biotools:marky", 
    "version": [], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_0226", 
                    "term": "Annotation"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }, 
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_0335", 
                    "term": "Formatting"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Desktop application"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_0219", 
            "term": "Data submission, annotation and curation"
        }, 
        {
            "uri": "http://edamontology.org/topic_3071", 
            "term": "Data management"
        }
    ], 
    "operatingSystem": [
        "Linux", 
        "Windows", 
        "Mac"
    ], 
    "language": [], 
    "license": null, 
    "collectionID": [], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [
        {
            "url": "http://www.mybiosoftware.com/marky-1-0-0-annotate-biomedical-texts-annotation-classes.html", 
            "type": "Registry", 
            "note": null
        }
    ], 
    "download": [], 
    "documentation": [
        {
            "url": "http://sing.ei.uvigo.es/marky/howitworks.html", 
            "type": "General", 
            "note": null
        }, 
        {
            "url": "http://sing.ei.uvigo.es/marky/tutorial.html", 
            "type": "Training material", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": null, 
            "pmid": "25480679", 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "Marky: A tool supporting annotation consistency in multi-user and iterative document annotation projects", 
                "abstract": "© 2014 Elsevier Ireland Ltd.Background and objectives: Document annotation is a key task in the development of Text Mining methods and applications. High quality annotated corpora are invaluable, but their preparation requires a considerable amount of resources and time. Although the existing annotation tools offer good user interaction interfaces to domain experts, project management and quality control abilities are still limited. Therefore, the current work introduces Marky, a new Web-based document annotation tool equipped to manage multi-user and iterative projects, and to evaluate annotation quality throughout the project life cycle. Methods: At the core, Marky is a Web application based on the open source CakePHP framework. User interface relies on HTML5 and CSS3 technologies. Rangy library assists in browser-independent implementation of common DOM range and selection tasks, and Ajax and JQuery technologies are used to enhance user-system interaction. Results: Marky grants solid management of inter- and intra-annotator work. Most notably, its annotation tracking system supports systematic and on-demand agreement analysis and annotation amendment. Each annotator may work over documents as usual, but all the annotations made are saved by the tracking system and may be further compared. So, the project administrator is able to evaluate annotation consistency among annotators and across rounds of annotation, while annotators are able to reject or amend subsets of annotations made in previous rounds. As a side effect, the tracking system minimises resource and time consumption. Conclusions: Marky is a novel environment for managing multi-user and iterative document annotation projects. Compared to other tools, Marky offers a similar visually intuitive annotation experience while providing unique means to minimise annotation effort and enforce annotation quality, and therefore corpus consistency. Marky is freely available for non-commercial use at http://sing.ei.uvigo.es/marky.", 
                "date": "2015-01-01T00:00:00Z", 
                "citationCount": 5, 
                "authors": [
                    {
                        "name": "Perez-Perez M."
                    }, 
                    {
                        "name": "Glez-Pena D."
                    }, 
                    {
                        "name": "Fdez-Riverola F."
                    }, 
                    {
                        "name": "Lourenco A."
                    }
                ], 
                "journal": "Computer Methods and Programs in Biomedicine"
            }
        }
    ], 
    "credit": [
        {
            "name": "Martín Pérez Pérez", 
            "email": "mpperez3@esei.uvigo.es", 
            "url": "http://sing.ei.uvigo.es/", 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "mbs_import", 
    "additionDate": "2017-08-03T18:50:39Z", 
    "lastUpdate": "2018-12-10T12:58:44Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 1, 
    "homepage_status": 0, 
    "elixir_badge": 0
}