{
    "additionDate": "2020-01-14T09:08:11Z",
    "biotoolsCURIE": "biotools:SuperCRF",
    "biotoolsID": "SuperCRF",
    "confidence_flag": "high",
    "credit": [
        {
            "email": "yinyin.yuan@icr.ac.uk",
            "name": "Yinyin Yuan",
            "typeEntity": "Person"
        }
    ],
    "description": "Incorporating Global and Local Context for Enhanced Deep Learning in Melanoma Histopathology.\n\nSuper CRF toolbox for training an conditional random field in combination with super pixel annotations",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://github.com/Henrik86/SuperCRF",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2020-01-14T09:08:11Z",
    "name": "SuperCRF",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.3389/FONC.2019.01045",
            "metadata": {
                "abstract": "© Copyright © 2019 Zormpas-Petridis, Failmezger, Raza, Roxanis, Jamin and Yuan.Computational pathology-based cell classification algorithms are revolutionizing the study of the tumor microenvironment and can provide novel predictive/prognosis biomarkers crucial for the delivery of precision oncology. Current algorithms used on hematoxylin and eosin slides are based on individual cell nuclei morphology with limited local context features. Here, we propose a novel multi-resolution hierarchical framework (SuperCRF) inspired by the way pathologists perceive regional tissue architecture to improve cell classification and demonstrate its clinical applications. We develop SuperCRF by training a state-of-art deep learning spatially constrained- convolution neural network (SC-CNN) to detect and classify cells from 105 high-resolution (20×) H&E-stained slides of The Cancer Genome Atlas melanoma dataset and subsequently, a conditional random field (CRF) by combining cellular neighborhood with tumor regional classification from lower resolution images (5, 1.25×) given by a superpixel-based machine learning framework. SuperCRF led to an 11.85% overall improvement in the accuracy of the state-of-art deep learning SC-CNN cell classifier. Consistent with a stroma-mediated immune suppressive microenvironment, SuperCRF demonstrated that (i) a high ratio of lymphocytes to all lymphocytes within the stromal compartment (p = 0.026) and (ii) a high ratio of stromal cells to all cells (p < 0.0001 compared to p = 0.039 for SC-CNN only) are associated with poor survival in patients with melanoma. SuperCRF improves cell classification by introducing global and local context-based information and can be implemented in combination with any single-cell classifier. SuperCRF provides valuable tools to study the tumor microenvironment and identify predictors of survival and response to therapy.",
                "authors": [
                    {
                        "name": "Zormpas-Petridis K."
                    },
                    {
                        "name": "Failmezger H."
                    },
                    {
                        "name": "Raza S.E.A."
                    },
                    {
                        "name": "Roxanis I."
                    },
                    {
                        "name": "Jamin Y."
                    },
                    {
                        "name": "Yuan Y."
                    }
                ],
                "citationCount": 2,
                "date": "2019-10-11T00:00:00Z",
                "journal": "Frontiers in Oncology",
                "title": "Superpixel-Based Conditional Random Fields (SuperCRF): Incorporating Global and Local Context for Enhanced Deep Learning in Melanoma Histopathology"
            },
            "pmcid": "PMC6798642",
            "pmid": "31681583"
        }
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        }
    ]
}