{
    "accessibility": "Open access",
    "additionDate": "2023-12-30T20:06:42.317461Z",
    "biotoolsCURIE": "biotools:rnaenrich",
    "biotoolsID": "rnaenrich",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "zhufeng@zju.edu.cn",
            "name": "Feng Zhu",
            "orcidid": "https://orcid.org/0000-0001-8069-0053",
            "typeEntity": "Person"
        },
        {
            "name": "Kuerbannisha Amahong",
            "typeEntity": "Person"
        },
        {
            "name": "Song Zhang",
            "typeEntity": "Person"
        },
        {
            "name": "Yintao Zhang",
            "typeEntity": "Person"
        }
    ],
    "description": "RNAenrich is a web server for functional enrichment and interaction network analysis to almost all types of RNAs, covering mRNA or gene, microRNA ( miRNA ) , long non-coding RNA (lncRNA) , circular RNA (circRNA) , small nucleolar RNA (snoRNA) , and PIWI-interacting RNA (piRNA) in human and mouse. In particular, RNAenrich adopts a new enrichment strategy, employing RNA-targeted functional genes from experimentally-supported data, which not only makes the most coverage of different types of RNAs but also ensures confidence level of the enriched results. The enrichment results will give a description about which pathway, function and disease these RNAs mainly participate in, presenting as downloadable tables and visual figures.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene-set enrichment analysis",
                    "uri": "http://edamontology.org/operation_2436"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                },
                {
                    "term": "miRNA expression analysis",
                    "uri": "http://edamontology.org/operation_3792"
                },
                {
                    "term": "miRNA target prediction",
                    "uri": "http://edamontology.org/operation_0463"
                }
            ]
        }
    ],
    "homepage": "https://idrblab.org/rnaenr/",
    "lastUpdate": "2023-12-30T20:06:42.320135Z",
    "license": "CC-BY-4.0",
    "name": "RNAenrich",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAD421",
            "metadata": {
                "abstract": "Motivation: With the rapid advances of RNA sequencing and microarray technologies in non-coding RNA (ncRNA) research, functional tools that perform enrichment analysis for ncRNAs are needed. On the one hand, because of the rapidly growing interest in circRNAs, snoRNAs, and piRNAs, it is essential to develop tools for enrichment analysis for these newly emerged ncRNAs. On the other hand, due to the key role of ncRNAs' interacting target in the determination of their function, the interactions between ncRNA and its corresponding target should be fully considered in functional enrichment. Based on the ncRNA-mRNA/protein-function strategy, some tools have been developed to functionally analyze a single type of ncRNA (the majority focuses on miRNA); in addition, some tools adopt predicted target data and lead to only low-confidence results. Results: Herein, an online tool named RNAenrich was developed to enable the comprehensive and accurate enrichment analysis of ncRNAs. It is unique in (i) realizing the enrichment analysis for various RNA types in humans and mice, such as miRNA, lncRNA, circRNA, snoRNA, piRNA, and mRNA; (ii) extending the analysis by introducing millions of experimentally validated data of RNA-target interactions as a built-in database; and (iii) providing a comprehensive interacting network among various ncRNAs and targets to facilitate the mechanistic study of ncRNA function. Importantly, RNAenrich led to a more comprehensive and accurate enrichment analysis in a COVID-19-related miRNA case, which was largely attributed to its coverage of comprehensive ncRNA-target interactions.",
                "authors": [
                    {
                        "name": "Amahong K."
                    },
                    {
                        "name": "Dai H."
                    },
                    {
                        "name": "Gao J."
                    },
                    {
                        "name": "Hu X."
                    },
                    {
                        "name": "Huang S."
                    },
                    {
                        "name": "Li Z."
                    },
                    {
                        "name": "Lu M."
                    },
                    {
                        "name": "Qiu Y."
                    },
                    {
                        "name": "Zeng Z."
                    },
                    {
                        "name": "Zhang B."
                    },
                    {
                        "name": "Zhang S."
                    },
                    {
                        "name": "Zhang Y."
                    },
                    {
                        "name": "Zhu F."
                    }
                ],
                "date": "2023-07-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "RNAenrich: a web server for non-coding RNA enrichment"
            },
            "pmcid": "PMC10356780",
            "pmid": "37399102"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Endocrinology and metabolism",
            "uri": "http://edamontology.org/topic_3407"
        },
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ]
}
