{
    "additionDate": "2016-02-18T14:13:51Z",
    "biotoolsCURIE": "biotools:seek_for_science",
    "biotoolsID": "seek_for_science",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Heidelberg Institute for Theoretical Studies, Germany",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ],
            "url": "http://www.h-its.org/"
        },
        {
            "name": "SEEK",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://groups.google.com/group/seek4science"
        },
        {
            "name": "SEEK developers",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://groups.google.com/group/seek-developers"
        },
        {
            "name": "The University of Manchester, UK",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ],
            "url": "http://www.manchester.ac.uk"
        },
        {
            "name": "manchester.ac.uk",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ],
            "url": "http://www.manchester.ac.uk"
        },
        {
            "name": "SEEK",
            "typeRole": [
                "Support"
            ],
            "url": "http://groups.google.com/group/seek4science"
        },
        {
            "name": "SEEK developers",
            "typeRole": [
                "Developer"
            ],
            "url": "http://groups.google.com/group/seek-developers"
        }
    ],
    "description": "Web-based resource for sharing heterogeneous scientific research datasets, models or simulations, processes and research outcomes. It preserves associations between them, along with information about the people and organisations involved.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://docs.seek4science.org/help/"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "https://docs.seek4science.org/get-seek.html",
            "version": "All"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data handling",
                    "uri": "http://edamontology.org/operation_2409"
                },
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                },
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                }
            ]
        }
    ],
    "homepage": "http://seek4science.org/",
    "language": [
        "Ruby"
    ],
    "lastUpdate": "2021-07-21T11:17:37Z",
    "license": "BSD-3-Clause",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/seek4science/seek.git"
        }
    ],
    "maturity": "Mature",
    "name": "FAIRDOM-SEEK",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "alan.r.williams@manchester.ac.",
    "publication": [
        {
            "doi": "10.1093/nar/gkw1032",
            "metadata": {
                "abstract": "© The Author(s) 2016.The FAIRDOMHub is a repository for publishing FAIR (Findable, Accessible, Interoperable and Reusable) Data, Operating procedures and Models (https://fairdomhub.org/) for the Systems Biology community. It is a web-accessible repository for storing and sharing systems biology research assets. It enables researchers to organize, share and publish data, models and protocols, interlink them in the context of the systems biology investigations that produced them, and to interrogate them via API interfaces. By using the FAIRDOMHub, researchers can achievemore effective exchange with geographically distributed collaborators during projects, ensure results are sustained and preserved and generate reproducible publications that adhere to the FAIR guiding principles of data stewardship.",
                "authors": [
                    {
                        "name": "Bacall F."
                    },
                    {
                        "name": "Goble C."
                    },
                    {
                        "name": "Golebiewski M."
                    },
                    {
                        "name": "Krebs O."
                    },
                    {
                        "name": "Kuzyakiv R."
                    },
                    {
                        "name": "Malmstrom L."
                    },
                    {
                        "name": "Muller W."
                    },
                    {
                        "name": "Nguyen Q."
                    },
                    {
                        "name": "Owen S."
                    },
                    {
                        "name": "Rinn B."
                    },
                    {
                        "name": "Snoep J.L."
                    },
                    {
                        "name": "Soiland-Reyes S."
                    },
                    {
                        "name": "Stanford N.J."
                    },
                    {
                        "name": "Straszewski J."
                    },
                    {
                        "name": "Van Niekerk D.D."
                    },
                    {
                        "name": "Williams A.R."
                    },
                    {
                        "name": "Wolstencroft K."
                    }
                ],
                "citationCount": 37,
                "date": "2017-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "FAIRDOMHub: A repository and collaboration environment for sharing systems biology research"
            }
        },
        {
            "doi": "10.1186/s12918-015-0174-y",
            "metadata": {
                "abstract": "© 2015 Wolstencroft et al.Background: Systems biology research typically involves the integration and analysis of heterogeneous data types in order to model and predict biological processes. Researchers therefore require tools and resources to facilitate the sharing and integration of data, and for linking of data to systems biology models. There are a large number of public repositories for storing biological data of a particular type, for example transcriptomics or proteomics, and there are several model repositories. However, this silo-type storage of data and models is not conducive to systems biology investigations. Interdependencies between multiple omics datasets and between datasets and models are essential. Researchers require an environment that will allow the management and sharing of heterogeneous data and models in the context of the experiments which created them. Results: The SEEK is a suite of tools to support the management, sharing and exploration of data and models in systems biology. The SEEK platform provides an access-controlled, web-based environment for scientists to share and exchange data and models for day-to-day collaboration and for public dissemination. A plug-in architecture allows the linking of experiments, their protocols, data, models and results in a configurable system that is available 'off the shelf'. Tools to run model simulations, plot experimental data and assist with data annotation and standardisation combine to produce a collection of resources that support analysis as well as sharing. Underlying semantic web resources additionally extract and serve SEEK metadata in RDF (Resource Description Format). SEEK RDF enables rich semantic queries, both within SEEK and between related resources in the web of Linked Open Data. Conclusion: The SEEK platform has been adopted by many systems biology consortia across Europe. It is a data management environment that has a low barrier of uptake and provides rich resources for collaboration. This paper provides an update on the functions and features of the SEEK software, and describes the use of the SEEK in the SysMO consortium (Systems biology for Micro-organisms), and the VLN (virtual Liver Network), two large systems biology initiatives with different research aims and different scientific communities.",
                "authors": [
                    {
                        "name": "An L."
                    },
                    {
                        "name": "Bittkowski M."
                    },
                    {
                        "name": "Goble C."
                    },
                    {
                        "name": "Golebiewski M."
                    },
                    {
                        "name": "Krebs O."
                    },
                    {
                        "name": "Mueller W."
                    },
                    {
                        "name": "Nguyen Q."
                    },
                    {
                        "name": "Owen S."
                    },
                    {
                        "name": "Shockley D."
                    },
                    {
                        "name": "Snoep J.L."
                    },
                    {
                        "name": "Stanford N.J."
                    },
                    {
                        "name": "Weidemann A."
                    },
                    {
                        "name": "Wolstencroft K."
                    }
                ],
                "citationCount": 42,
                "date": "2015-07-11T00:00:00Z",
                "journal": "BMC Systems Biology",
                "title": "SEEK: A systems biology data and model management platform"
            }
        },
        {
            "doi": "10.1016/B978-0-12-385118-5.00029-3",
            "metadata": {
                "abstract": "Systems biology research is typically performed by multidisciplinary groups of scientists, often in large consortia and in distributed locations. The data generated in these projects tend to be heterogeneous and often involves high-throughput \"omics\" analyses. Models are developed iteratively from data generated in the projects and from the literature. Consequently, there is a growing requirement for exchanging experimental data, mathematical models, and scientific protocols between consortium members and a necessity to record and share the outcomes of experiments and the links between data and models. The overall output of a research consortium is also a valuable commodity in its own right. The research and associated data and models should eventually be available to the whole community for reuse and future analysis. The SEEK is an open-source, Web-based platform designed for the management and exchange of systems biology data and models. The SEEK was originally developed for the SysMO (systems biology of microorganisms) consortia, but the principles and objectives are applicable to any systems biology project. The SEEK provides an index of consortium resources and acts as gateway to other tools and services commonly used in the community. For example, the model simulation tool, JWS Online, has been integrated into the SEEK, and a plug-in to PubMed allows publications to be linked to supporting data and author profiles in the SEEK. The SEEK is a pragmatic solution to data management which encourages, but does not force, researchers to share and disseminate their data to community standard formats. It provides tools to assist with management and annotation as well as incentives and added value for following these recommendations. Data exchange and reuse rely on sufficient annotation, consistent metadata descriptions, and the use of standard exchange formats for models, data, and the experiments they are derived from. In this chapter, we present the SEEK platform, its functionalities, and the methods employed for lowering the barriers to adoption of standard formats. As the production of biological data continues to grow, in systems biology and in the life sciences in general, the need to record, manage, and exploit this wealth of information in the future is increasing. We promote the SEEK as a data and model management tool that can be adapted to the specific needs of a particular systems biology project. © 2011 Elsevier Inc. All rights reserved.",
                "authors": [
                    {
                        "name": "Du Preez F."
                    },
                    {
                        "name": "Goble C."
                    },
                    {
                        "name": "Krebs O."
                    },
                    {
                        "name": "Mueller W."
                    },
                    {
                        "name": "Owen S."
                    },
                    {
                        "name": "Snoep J.L."
                    },
                    {
                        "name": "Wolstencroft K."
                    }
                ],
                "citationCount": 37,
                "date": "2011-01-01T00:00:00Z",
                "journal": "Methods in Enzymology",
                "title": "The SEEK: A platform for sharing data and models in systems biology"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Data management",
            "uri": "http://edamontology.org/topic_3071"
        }
    ],
    "validated": 1,
    "version": [
        "1",
        "1.11",
        "1.11.1"
    ]
}
