
{
    "credit": [
        {
            "name": "The University of Manchester, UK",
            "typeEntity": "Institute",
            "typeRoles": [
                "Provider"
            ],
            "url": "http://www.manchester.ac.uk"
        },
        {
            "name": "Heidelberg Institute for Theoretical Studies, Germany",
            "typeEntity": "Institute",
            "typeRoles": [
                "Provider"
            ],
            "url": "http://www.h-its.org/"
        },
        {
            "name": "manchester.ac.uk",
            "typeEntity": "Institute",
            "typeRoles": [
                "Provider"
            ],
            "url": "http://www.manchester.ac.uk"
        },
        {
            "name": "SEEK",
            "typeRoles": [
                "Support"
            ],
            "url": "http://groups.google.com/group/seek4science"
        },
        {
            "name": "SEEK developers",
            "typeRoles": [
                "Developer"
            ],
            "url": "http://groups.google.com/group/seek-developers"
        },
        {
            "name": "SEEK",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://groups.google.com/group/seek4science"
        },
        {
            "name": "SEEK developers",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://groups.google.com/group/seek-developers"
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://seek4science.org/about"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://docs.seek4science.org/tech/install.html"
        },
        {
            "type": "Binaries",
            "url": "https://bitbucket.org/seek4science/seek/downloads/seek-1.0.2.tar.gz"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                }
            ]
        }
    ],
    "labels": {
        "cost": "Free of charge",
        "language": [
            "Ruby"
        ],
        "license": "BSD-3-Clause",
        "maturity": "Mature",
        "operatingSystem": [
            "Linux"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Data management",
                "uri": "http://edamontology.org/topic_3071"
            }
        ]
    },
    "link": [
        {
            "type": "Repository",
            "url": "https://github.com/seek4science/seek.git"
        }
    ],
    "publication": [
        {
            "abstract": "Systems biology research is typically performed by multidisciplinary groups of scientists, often in large consortia and in distributed locations. The data generated in these projects tend to be heterogeneous and often involves high-throughput \"omics\" analyses. Models are developed iteratively from data generated in the projects and from the literature. Consequently, there is a growing requirement for exchanging experimental data, mathematical models, and scientific protocols between consortium members and a necessity to record and share the outcomes of experiments and the links between data and models. The overall output of a research consortium is also a valuable commodity in its own right. The research and associated data and models should eventually be available to the whole community for reuse and future analysis. The SEEK is an open-source, Web-based platform designed for the management and exchange of systems biology data and models. The SEEK was originally developed for the SysMO (systems biology of microorganisms) consortia, but the principles and objectives are applicable to any systems biology project. The SEEK provides an index of consortium resources and acts as gateway to other tools and services commonly used in the community. For example, the model simulation tool, JWS Online, has been integrated into the SEEK, and a plug-in to PubMed allows publications to be linked to supporting data and author profiles in the SEEK. The SEEK is a pragmatic solution to data management which encourages, but does not force, researchers to share and disseminate their data to community standard formats. It provides tools to assist with management and annotation as well as incentives and added value for following these recommendations. Data exchange and reuse rely on sufficient annotation, consistent metadata descriptions, and the use of standard exchange formats for models, data, and the experiments they are derived from. In this chapter, we present the SEEK platform, its functionalities, and the methods employed for lowering the barriers to adoption of standard formats. As the production of biological data continues to grow, in systems biology and in the life sciences in general, the need to record, manage, and exploit this wealth of information in the future is increasing. We promote the SEEK as a data and model management tool that can be adapted to the specific needs of a particular systems biology project. © 2011 Elsevier Inc. All rights reserved.",
            "authors": [
                "Wolstencroft K.",
                "Owen S.",
                "Du Preez F.",
                "Krebs O.",
                "Mueller W.",
                "Goble C.",
                "Snoep J.L."
            ],
            "cit_count": 34,
            "doi": "10.1016/B978-0-12-385118-5.00029-3",
            "journal": "Methods in Enzymology",
            "title": "The SEEK: A platform for sharing data and models in systems biology",
            "type": "Primary",
            "year": "2011-09-27"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:seek_for_science",
        "biotoolsID": "seek_for_science",
        "description": "Web-based resource for sharing heterogeneous scientific research datasets, models or simulations, processes and research outcomes. It preserves associations between them, along with information about the people and organisations involved.",
        "homepage": "http://seek4science.org/",
        "name": "SEEK for Science",
        "version": [
            "1"
        ]
    }
}