{
    "additionDate": "2017-08-20T17:35:47Z",
    "biotoolsCURIE": "biotools:vizstruct",
    "biotoolsID": "vizstruct",
    "collectionID": [
        "Animal and Crop Genomics"
    ],
    "credit": [
        {
            "email": "murali@buffalo.edu",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Exploratory visualisation for gene expression profiling.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://www.cse.buffalo.edu/DBGROUP/bioinformatics/supplementary/vizstruct/tutorials/"
        }
    ],
    "editPermission": {
        "authors": [
            "animalandcropgenomics"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://www.cse.buffalo.edu/DBGROUP/bioinformatics/supplementary/vizstruct/index.html",
    "language": [
        "MATLAB",
        "Perl"
    ],
    "lastUpdate": "2020-01-19T17:47:47Z",
    "license": "Not licensed",
    "name": "VizStruct",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "admin",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btl144",
            "metadata": {
                "abstract": "Motivation: The size, dimensionality and the limited range of the data values make visualization of single nucleotide polymorphism (SNP) datasets challenging. The purpose of this study is to evaluate the usefulness of 3D VizStruct, a novel multi-dimensional data visualization technique for analyzing patterns in SNP datasets. Results: VizStruct is an interactive visualization technique that reduces multi-dimensional data to two dimensions using the complex-valued harmonics of the discrete Fourier transform (DFT). In the 3D VizStruct extension, the multi-dimensional SNP data vectors are reduced to three dimensions using a combination of the DFT and the Kullback-Leibler divergence. The performance of 3D VizStruct was challenged with several biologically relevant published datasets that included human Chromosome 21, the human lipoprotein lipase (LPL) gene locus and the multi-locus genotypes of coral populations. In every case, the 3D VizStruct mapping provided an intuitive visual description of the key characteristics of the underlying multi-dimensional genotype. © 2006 Oxford University Press.",
                "authors": [
                    {
                        "name": "Bhasi K."
                    },
                    {
                        "name": "Brazeau D."
                    },
                    {
                        "name": "Ramanathan M."
                    },
                    {
                        "name": "Zhang A."
                    },
                    {
                        "name": "Zhang L."
                    }
                ],
                "citationCount": 10,
                "date": "2006-07-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "VizStruct for visualization of genome-wide SNP analyses"
            },
            "pmid": "16613906",
            "type": [
                "Primary"
            ]
        },
        {
            "metadata": {
                "abstract": "Motivation: DNA arrays provide a broad snapshot of the state of the cell by measuring the expression levels of thousands of genes simultaneously. Visualization techniques can enable the exploration and detection of patterns and relationships in a complex data set by presenting the data in a graphical format in which the key characteristics become more apparent. The dimensionality and size of array data sets however present significant challenges to visualization. The purpose of this study is to present an interactive approach for visualizing variations in gene expression profiles and to assess its usefulness for classifying samples. Results: The first Fourier harmonic projection was used to map multi-dimensional gene expression data to two dimensions in an implementation called VizStruct. The visualization method was tested using the differentially expressed genes identified in eight separate gene expression data sets. The samples were classified using the oblique decision tree (OC1) algorithm to provide aprocedure for visualization-driven classification. The classifiers were evaluated by the holdout and the cross-validation techniques. The proposed method was found to achieve high accuracy.",
                "authors": [
                    {
                        "name": "Ramanathan M."
                    },
                    {
                        "name": "Zhang A."
                    },
                    {
                        "name": "Zhang L."
                    }
                ],
                "citationCount": 18,
                "date": "2004-01-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "VizStruct: Exploratory visualization for gene expression profiling"
            },
            "pmcid": "PMC2607484",
            "pmid": "14693813",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web service"
    ],
    "topic": [
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        }
    ],
    "validated": 1
}
