{
    "additionDate": "2019-11-14T19:30:31Z",
    "biotoolsCURIE": "biotools:Ragp",
    "biotoolsID": "Ragp",
    "confidence_flag": "tool",
    "description": "Pipeline for mining of plant hydroxyproline-rich glycoproteins with implementation in R | Filter plant hydroxyproline rich glycoproteins | ragp - hydroxyproline aware filtering of hydroxyproline rich glycoprotein sequences | ragp is an R package primarily designed for mining and analysis of plant hydroxyproline rich glycoproteins. It incorporates a novel concept with an additional analysis layer where the probability of proline hydroxylation is estimated by a machine learning model. Only proteins predicted to contain hydroxyprolines are further analysed for HRGP characteristic motifs and features. ragp can also be used for protein annotation by obtaining predictions for several protein features based on sequence (secretory signals, transmembrane regions, domains, glycosylphosphatidylinositol attachment sites and disordered regions). Additionally ragp provides tools for visualization of the mentioned attributes",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                },
                {
                    "term": "Post-translation modification site prediction",
                    "uri": "http://edamontology.org/operation_0417"
                },
                {
                    "term": "Protein signal peptide detection",
                    "uri": "http://edamontology.org/operation_0418"
                }
            ]
        }
    ],
    "homepage": "https://github.com/missuse/ragp",
    "language": [
        "R"
    ],
    "lastUpdate": "2020-12-11T15:24:21Z",
    "license": "MIT",
    "name": "Ragp",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/GLYCOB/CWZ072",
            "metadata": {
                "abstract": "© The Author(s) 2020Hydroxyproline-rich glycoproteins (HRGPs) are one of the most complex families of macromolecules found in plants, due to the diversity of glycans decorating the protein backbone, as well as the heterogeneity of the protein backbones. While this diversity is responsible for a wide array of physiological functions associated with HRGPs, it hinders attempts for homology-based identification. Current approaches, based on identifying sequences with characteristic motifs and biased amino acid composition, are limited to prototypical sequences. Ragp is an R package for mining and analysis of HRGPs, with emphasis on arabinogalactan proteins. The ragp filtering pipeline exploits one of the HRGPs key features, the presence of hydroxyprolines which represent glycosylation sites. Main package features include prediction of proline hydroxylation sites, amino acid motif and bias analyses, efficient communication with web servers for prediction of N-terminal signal peptides, glycosylphosphatidylinositol modification sites and disordered regions and the ability to annotate sequences through hmmscan and subsequent GO enrichment, based on predicted Pfam domains. As such, ragp extends R’s rich ecosystem for high-throughput sequence data analyses. The ragp R package is available under the MIT Open Source license and is freely available to download from GitHub at: https://github.com/missuse/ragp.",
                "authors": [
                    {
                        "name": "Bogdanovic M.D."
                    },
                    {
                        "name": "Dragicevic M.B."
                    },
                    {
                        "name": "Paunovic D.M."
                    },
                    {
                        "name": "Simonovic A.D."
                    },
                    {
                        "name": "Todorovic S.I."
                    }
                ],
                "citationCount": 3,
                "date": "2021-01-01T00:00:00Z",
                "journal": "Glycobiology",
                "title": "ragp: Pipeline for mining of plant hydroxyproline-rich glycoproteins with implementation in R"
            },
            "pmid": "31508799"
        }
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        },
        {
            "term": "Protein sites, features and motifs",
            "uri": "http://edamontology.org/topic_3510"
        }
    ],
    "validated": 1
}
