{
    "additionDate": "2022-10-03T06:36:21.079243Z",
    "biotoolsCURIE": "biotools:eslpred2",
    "biotoolsID": "eslpred2",
    "credit": [
        {
            "name": "Dr Gajendra P.S. Raghava",
            "url": "https://webs.iiitd.edu.in/raghava/eslpred2/index.html"
        }
    ],
    "description": "\"ESLpred2\" is an improved version of our previous most popular method, ESLpred, which can predict four major localizations (cytoplasmic, mitochondrial, nuclear and extracellular) with an accuracy of 88%.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://webs.iiitd.edu.in/raghava/eslpred2/index.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Analysis",
                    "uri": "http://edamontology.org/operation_2945"
                }
            ]
        }
    ],
    "homepage": "https://webs.iiitd.edu.in/raghava/eslpred2/index.html",
    "lastUpdate": "2022-10-03T06:36:26.573429Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "https://webs.iiitd.edu.in/raghava/eslpred2/index.html"
        }
    ],
    "name": "eslpred2",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "raghavagps",
    "publication": [
        {
            "doi": "10.1186/1471-2105-9-503",
            "metadata": {
                "abstract": "Background: The expansion of raw protein sequence databases in the post genomic era and availability of fresh annotated sequences for major localizations particularly motivated us to introduce a new improved version of our previously forged eukaryotic subcellular localizations prediction method namely \"ESLpred\". Since, subcellular localization of a protein offers essential clues about its functioning, hence, availability of localization predictor would definitely aid and expedite the protein deciphering studies. However, robustness of a predictor is highly dependent on the superiority of dataset and extracted protein attributes; hence, it becomes imperative to improve the performance of presently available method using latest dataset and crucial input features. Results: Here, we describe augmentation in the prediction performance obtained for our most popular ESLpred method using new crucial features as an input to Support Vector Machine (SVM). In addition, recently available, highly non-redundant dataset encompassing three kingdoms specific protein sequence sets; 1198 fungi sequences, 2597 from animal and 491 plant sequences were also included in the present study. First, using the evolutionary information in the form of profile composition along with whole and N-terminal sequence composition as an input feature vector of 440 dimensions, overall accuracies of 72.7, 75.8 and 74.5% were achieved respectively after five-fold cross-validation. Further, enhancement in performance was observed when similarity search based results were coupled with whole and N-terminal sequence composition along with profile composition by yielding overall accuracies of 75.9, 80.8, 76.6% respectively; best accuracies reported till date on the same datasets. Conclusion: These results provide confidence about the reliability and accurate prediction of SVM modules generated in the present study using sequence and profile compositions along with similarity search based results. The presently developed modules are implemented as web server \"ESLpred2\" available at http://www.imtech.res.in/raghava/ eslpred2/. © 2008 Garg and Raghava; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Garg A."
                    },
                    {
                        "name": "Raghava G.P.S."
                    }
                ],
                "citationCount": 44,
                "date": "2008-11-28T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "ESLpred2: Improved method for predicting subcellular localization of eukaryotic proteins"
            },
            "pmcid": "PMC2612013",
            "pmid": "19038062"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Computational biology",
            "uri": "http://edamontology.org/topic_3307"
        }
    ]
}
