{
    "additionDate": "2020-01-14T08:54:51Z",
    "biotoolsCURIE": "biotools:Dmipy",
    "biotoolsID": "Dmipy",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "fick.rutger@gmail.com",
            "name": "Rutger H. J. Fick",
            "typeEntity": "Person"
        }
    ],
    "description": "Diffusion MRI Multi-Compartment Modeling and Microstructure Recovery Made Easy.\n\nAn open source toolbox for reproducible diffusion MRI-based microstructure estimation.\n\nDmipy: Diffusion Microstructure Imaging in Python.\n\nThe Dmipy software package facilitates the reproducible estimation of diffusion MRI-based microstructure features. It does this by taking a completely modular approach to Microstructure Imaging. Using Dmipy you can design, fit, and recover the parameters of any multi-compartment microstructure model in usually less than 10 lines of code. Created models can be used to simulate and fit data for any PGSE-based dMRI acquisition, including single shell, multi-shell, multi-diffusion time and multi-TE acquisition schemes. Dmipy's main features include:",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Deisotoping",
                    "uri": "http://edamontology.org/operation_3629"
                },
                {
                    "term": "Modelling and simulation",
                    "uri": "http://edamontology.org/operation_2426"
                },
                {
                    "term": "Optimisation and refinement",
                    "uri": "http://edamontology.org/operation_2425"
                }
            ]
        }
    ],
    "homepage": "https://github.com/AthenaEPI/dmipy",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-12-22T09:03:09Z",
    "license": "MIT",
    "name": "Dmipy",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.3389/FNINF.2019.00064",
            "metadata": {
                "abstract": "© Copyright © 2019 Fick, Wassermann and Deriche.Non-invasive estimation of brain microstructure features using diffusion MRI (dMRI)—known as Microstructure Imaging—has become an increasingly diverse and complicated field over the last decades. Multi-compartment (MC)-models, representing the measured diffusion signal as a linear combination of signal models of distinct tissue types, have been developed in many forms to estimate these features. However, a generalized implementation of MC-modeling as a whole, providing deeper insights in its capabilities, remains missing. To address this fact, we present Diffusion Microstructure Imaging in Python (Dmipy), an open-source toolbox implementing PGSE-based MC-modeling in its most general form. Dmipy allows on-the-fly implementation, signal modeling, and optimization of any user-defined MC-model, for any PGSE acquisition scheme. Dmipy follows a “building block”-based philosophy to Microstructure Imaging, meaning MC-models are modularly constructed to include any number and type of tissue models, allowing simultaneous representation of a tissue's diffusivity, orientation, volume fractions, axon orientation dispersion, and axon diameter distribution. In particular, Dmipy is geared toward facilitating reproducible, reliable MC-modeling pipelines, often allowing the whole process from model construction to parameter map recovery in fewer than 10 lines of code. To demonstrate Dmipy's ease of use and potential, we implement a wide range of well-known MC-models, including IVIM, AxCaliber, NODDI(x), Bingham-NODDI, the spherical mean-based SMT and MC-MDI, and spherical convolution-based single- and multi-tissue CSD. By allowing parameter cascading between MC-models, Dmipy also facilitates implementation of advanced approaches like CSD with voxel-varying kernels and single-shell 3-tissue CSD. By providing a well-tested, user-friendly toolbox that simplifies the interaction with the otherwise complicated field of dMRI-based Microstructure Imaging, Dmipy contributes to more reproducible, high-quality research.",
                "authors": [
                    {
                        "name": "Deriche R."
                    },
                    {
                        "name": "Fick R.H.J."
                    },
                    {
                        "name": "Wassermann D."
                    }
                ],
                "citationCount": 7,
                "date": "2019-10-15T00:00:00Z",
                "journal": "Frontiers in Neuroinformatics",
                "title": "The Dmipy Toolbox: Diffusion MRI Multi-Compartment Modeling and Microstructure Recovery Made Easy"
            },
            "pmcid": "PMC6803556",
            "pmid": "31680924"
        }
    ],
    "toolType": [
        "Suite"
    ],
    "topic": [
        {
            "term": "Biophysics",
            "uri": "http://edamontology.org/topic_3306"
        },
        {
            "term": "Literature and language",
            "uri": "http://edamontology.org/topic_3068"
        },
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        }
    ],
    "validated": 1
}
