{"credit":[{"email":"asa@cs.colostate.edu","name":"Asa Ben-Hur","typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://combi.cs.colostate.edu/supplements/pairpred/"}],"documentation":[{"type":"GENERAL","url":"http://combi.cs.colostate.edu/supplements/pairpred/"}],"function":[{"operation":[{"term":"Protein-protein interaction prediction","uri":"http://edamontology.org/operation_2464"}]}],"labels":{"language":["Python"],"operatingSystem":["Linux"],"toolType":["Command-line tool"],"topic":[{"term":"Proteins","uri":"http://edamontology.org/topic_0078"},{"term":"Protein interactions","uri":"http://edamontology.org/topic_0128"},{"term":"Protein structure analysis","uri":"http://edamontology.org/topic_2814"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/pairpred-partner-aware-interacting-residue-predictor.html"}],"publication":[{"abstract":"We present a novel partner-specific protein-protein interaction site prediction method called PAIRpred. Unlike most existing machine learning binding site prediction methods, PAIRpred uses information from both proteins in a protein complex to predict pairs of interacting residues from the two proteins. PAIRpred captures sequence and structure information about residue pairs through pairwise kernels that are used for training a support vector machine classifier. As a result, PAIRpred presents a more detailed model of protein binding, and offers state of the art accuracy in predicting binding sites at the protein level as well as inter-protein residue contacts at the complex level. We demonstrate PAIRpred's performance on Docking Benchmark 4.0 and recent CAPRI targets. We present a detailed performance analysis outlining the contribution of different sequence and structure features, together with a comparison to a variety of existing interface prediction techniques. We have also studied the impact of binding-associated conformational change on prediction accuracy and found PAIRpred to be more robust to such structural changes than existing schemes. As an illustration of the potential applications of PAIRpred, we provide a case study in which PAIRpred is used to analyze the nature and specificity of the interface in the interaction of human ISG15 protein with NS1 protein from influenza A virus. Python code for PAIRpred is available at http://combi.cs.colostate.edu/supplements/pairpred/. © 2013 Wiley Periodicals, Inc.","authors":["Afsar Minhas F.U.A.","Geiss B.J.","Ben-Hur A."],"cit_count":22,"journal":"Proteins: Structure, Function and Bioinformatics","pmid":"24243399","title":"PAIRpred: Partner-specific prediction of interacting residues from sequence and structure","year":"2014-01-01"}],"summary":{"biotoolsCURIE":"biotools:pairpred","biotoolsID":"pairpred","description":"Partner specific protein-protein interaction site predictor that can make accurate predictions of whether a pair of residues from two different proteins interact or not.","homepage":"http://combi.cs.colostate.edu/supplements/pairpred/","name":"PAIRPred"}}