{
    "additionDate": "2021-11-29T08:31:14.153991Z",
    "biotoolsCURIE": "biotools:pystachio",
    "biotoolsID": "pystachio",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "mark.leake@york.ac.uk",
            "name": "Mark C. Leake",
            "orcidid": "https://orcid.org/0000-0002-1715-1249",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "PySTACHIO (Python Single-molecule TrAcking stoiCHiometry Intensity and simulatiOn) is flexible, extensible, beginner-friendly and optimized program for analysis of single-molecule microscopy.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Simulation analysis",
                    "uri": "http://edamontology.org/operation_0244"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://github.com/ejh516/pystachio-smt",
    "language": [
        "Python",
        "MATLAB"
    ],
    "lastUpdate": "2021-11-29T08:31:44.961023Z",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/ejh516/pystachio-smt/issues"
        }
    ],
    "name": "PySTACHIO",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1016/j.csbj.2021.07.004",
            "metadata": {
                "abstract": "© 2021 The AuthorsAs camera pixel arrays have grown larger and faster, and optical microscopy techniques ever more refined, there has been an explosion in the quantity of data acquired during routine light microscopy. At the single-molecule level, analysis involves multiple steps and can rapidly become computationally expensive, in some cases intractable on office workstations. Complex bespoke software can present high activation barriers to entry for new users. Here, we redevelop our quantitative single-molecule analysis routines into an optimized and extensible Python program, with GUI and command-line implementations to facilitate use on local machines and remote clusters, by beginners and advanced users alike. We demonstrate that its performance is on par with previous MATLAB implementations but runs an order of magnitude faster. We tested it against challenge data and demonstrate its performance is comparable to state-of-the-art analysis platforms. We show the code can extract fluorescence intensity values for single reporter dye molecules and, using these, estimate molecular stoichiometries and cellular copy numbers of fluorescently-labeled biomolecules. It can evaluate 2D diffusion coefficients for the characteristically short single-particle tracking data. To facilitate benchmarking we include data simulation routines to compare different analysis programs. Finally, we show that it works with 2-color data and enables colocalization analysis based on overlap integration, to infer interactions between differently labelled biomolecules. By making this freely available we aim to make complex light microscopy single-molecule analysis more democratized.",
                "authors": [
                    {
                        "name": "Shepherd J.W."
                    },
                    {
                        "name": "Higgins E.J."
                    },
                    {
                        "name": "Wollman A.J.M."
                    },
                    {
                        "name": "Leake M.C."
                    }
                ],
                "citationCount": 1,
                "date": "2021-01-01T00:00:00Z",
                "journal": "Computational and Structural Biotechnology Journal",
                "title": "PySTACHIO: Python Single-molecule TrAcking stoiCHiometry Intensity and simulatiOn, a flexible, extensible, beginner-friendly and optimized program for analysis of single-molecule microscopy data"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Light microscopy",
            "uri": "http://edamontology.org/topic_3385"
        },
        {
            "term": "Molecular biology",
            "uri": "http://edamontology.org/topic_3047"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        }
    ]
}