{
    "additionDate": "2021-03-19T08:29:22Z",
    "biotoolsCURIE": "biotools:hsm6ap",
    "biotoolsID": "hsm6ap",
    "confidence_flag": "high",
    "description": "A high-precision predictor for the Homo sapiens N6-methyladenosine (m^6 A) based on multiple weights and feature stitching.\n\nHSM6AP is a machine-learning framework to predict m6A based on Sequence and Gnomic coordinates.\n\nDNA methylation is an important epigenetic modification, which is closely related to the development and progression of cancer. As a cancer-related biomarker, the effective identification of DNA methylation sites has import implications in understanding the pathogenesis of cancer, cancer diagnosis and drug development.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "PTM site prediction",
                    "uri": "http://edamontology.org/operation_0417"
                },
                {
                    "term": "Sequence feature detection",
                    "uri": "http://edamontology.org/operation_0253"
                },
                {
                    "term": "Feature extraction",
                    "uri": "http://edamontology.org/operation_3937"
                }
            ]
        }
    ],
    "homepage": "http://lab.malab.cn/~lijing/HSM6AP.html",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-03-31T17:45:29Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/lijingtju/HSm6AP.git"
        },
        {
            "type": [
                "Service"
            ],
            "url": "http://120.27.24.199:10501/HSM6AP/WebServer"
        }
    ],
    "name": "HSM6AP",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1080/15476286.2021.1875180",
            "metadata": {
                "abstract": "© 2021 Informa UK Limited, trading as Taylor & Francis Group.Recent studies have shown that RNA methylation modification can affect RNA transcription, metabolism, splicing and stability. In addition, RNA methylation modification has been associated with cancer, obesity and other diseases. Based on information about human genome and machine learning, this paper discusses the effect of the fusion sequence and gene-level feature extraction on the accuracy of methylation site recognition. The significant limitation of existing computing tools was exposed by discovered of new features. (1) Most prediction models are based solely on sequence features and use SVM or random forest as classification methods. (2) Limited by the number of samples, the model may not achieve good performance. In order to establish a better prediction model for methylation sites, we must set specific weighting strategies for training samples and find more powerful and informative feature matrices to establish a comprehensive model. In this paper, we present HSM6AP, a high-precision predictor for the Homo sapiens N6-methyladenosine ((Formula presented.)) based on multiple weights and feature stitching. Compared with existing methods, HSM6AP samples were creatively weighted during training, and a wide range of features were explored. Max-Relevance-Max-Distance (MRMD) is employed for feature selection, and the feature matrix is generated by fusing a single feature. The extreme gradient boosting (XGBoost), an integrated machine learning algorithm based on decision tree, is used for model training and improves model performance through parameter adjustment. Two rigorous independent data sets demonstrated the superiority of HSM6AP in identifying methylation sites. HSM6AP is an advanced predictor that can be directly employed by users (especially non-professional users) to predict methylation sites. Users can access our related tools and data sets at the following website: http://lab.malab.cn/~lijing/HSM6AP.html The codes of our tool can be publicly accessible at https://github.com/lijingtju/HSm6AP.git.",
                "authors": [
                    {
                        "name": "Li J."
                    },
                    {
                        "name": "He S."
                    },
                    {
                        "name": "Guo F."
                    },
                    {
                        "name": "Zou Q."
                    }
                ],
                "citationCount": 1,
                "date": "2021-01-01T00:00:00Z",
                "journal": "RNA Biology",
                "title": "HSM6AP: a high-precision predictor for the Homo sapiens N6-methyladenosine (m^6 A) based on multiple weights and feature stitching"
            },
            "pmid": "33446014"
        }
    ],
    "topic": [
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        }
    ]
}