{
    "accessibility": "Open access",
    "additionDate": "2022-01-22T17:04:45.457270Z",
    "biotoolsCURIE": "biotools:argslab",
    "biotoolsID": "argslab",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Jasper N. Immink",
            "orcidid": "https://orcid.org/0000-0003-1251-5442",
            "typeEntity": "Person"
        }
    ],
    "description": "Tool for analyzing experimental or simulated particle networks.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                },
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                }
            ]
        }
    ],
    "homepage": "http://github.com/jimmink/argslab",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2022-01-22T17:04:45.460233Z",
    "name": "ArGSLab",
    "operatingSystem": [
        "Mac",
        "Linux",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1039/D1SM00692D",
            "metadata": {
                "abstract": "© The Royal Society of Chemistry 2021.Microscopy and particle-based simulations are both powerful techniques to study aggregated particulate matter such as colloidal gels. The data provided by these techniques often contains information on a wide array of length scales, but structural analysis methods typically focus on the local particle arrangement, even though the data also contains information about the particle network on the mesoscopic length scale. In this paper, we present a MATLAB software package for quantifying mesoscopic network structures in colloidal samples. ArGSLab (Arrested and Gelated Structures Laboratory) extracts a network backbone from the input data, which is in turn transformed into a set of nodes and links for graph theory-based analysis. The routines can process both image stacks from microscopy as well as explicit coordinate data, and thus allows quantitative comparison between simulations and experiments. ArGSLab furthermore enables the accurate analysis of microscopy data where,e.g., an extended point spread function prohibits the resolution of individual particles. We demonstrate the resulting output for example datasets from both microscopy and simulation of colloidal gels, in order to showcase the capability of ArGSLab to quantitatively analyze data from various sources. The freely available software package can be used either with a provided graphical user interface or directly as a MATLAB script.",
                "authors": [
                    {
                        "name": "Immink J.N."
                    },
                    {
                        "name": "Maris J.J.E."
                    },
                    {
                        "name": "Capellmann R.F."
                    },
                    {
                        "name": "Egelhaaf S.U."
                    },
                    {
                        "name": "Schurtenberger P."
                    },
                    {
                        "name": "Stenhammar J."
                    }
                ],
                "date": "2021-09-28T00:00:00Z",
                "journal": "Soft Matter",
                "title": "ArGSLab: a tool for analyzing experimental or simulated particle networks"
            },
            "pmcid": "PMC8457054",
            "pmid": "34550148"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Simulation experiment",
            "uri": "http://edamontology.org/topic_3524"
        }
    ]
}