{
    "additionDate": "2017-01-17T15:05:47Z",
    "biotoolsCURIE": "biotools:dupchecker",
    "biotoolsID": "dupchecker",
    "collectionID": [
        "BioConductor"
    ],
    "credit": [
        {
            "email": "shengqh@gmail.com",
            "name": "\"Quanhu SHENG\"",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Meta-analysis has become a popular approach for high-throughput genomic data analysis because it can significantly increase power to detect biological signals or patterns in datasets. However, when using public-available databases for meta-analysis, duplication of samples is an often-encountered problem. Not removing duplicates would make study results questionable. We developed a BioConductor package that efficiently identifies duplicated samples by generating MD5 fingerprints for raw data.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://bioconductor.org/packages/release/bioc/html/DupChecker.html"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://bioconductor/packages/release/bioc/src/contrib/DupChecker_1.12.0.tar.gz"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence redundancy removal",
                    "uri": "http://edamontology.org/operation_0290"
                }
            ]
        }
    ],
    "homepage": "http://bioconductor.org/packages/release/bioc/html/DupChecker.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2019-01-10T15:36:09Z",
    "license": "GPL-2.0",
    "name": "DupChecker",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "bioconductor_import",
    "publication": [
        {
            "doi": "10.1186/1471-2105-15-323",
            "metadata": {
                "abstract": "© 2014 Sheng et al.; licensee BioMed Central Ltd.Background: Meta-analysis has become a popular approach for high-throughput genomic data analysis because it often can significantly increase power to detect biological signals or patterns in datasets. However, when using public-available databases for meta-analysis, duplication of samples is an often encountered problem, especially for gene expression data. Not removing duplicates could lead false positive finding, misleading clustering pattern or model over-fitting issue, etc in the subsequent data analysis. Results: We developed a Bioconductor package Dupchecker that efficiently identifies duplicated samples by generating MD5 fingerprints for raw data. A real data example was demonstrated to show the usage and output of the package. Conclusions: Researchers may not pay enough attention to checking and removing duplicated samples, and then data contamination could make the results or conclusions from meta-analysis questionable. We suggest applying DupChecker to examine all gene expression data sets before any data analysis step.",
                "authors": [
                    {
                        "name": "Sheng Q."
                    },
                    {
                        "name": "Shyr Y."
                    },
                    {
                        "name": "Chen X."
                    }
                ],
                "citationCount": 1,
                "date": "2014-09-30T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "DupChecker: A bioconductor package for checking high-throughput genomic data redundancy in meta-analysis"
            },
            "pmcid": "PMC4261523",
            "pmid": "25267467",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool",
        "Library"
    ],
    "topic": [
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        }
    ],
    "validated": 1,
    "version": [
        "1.12.0"
    ]
}