{
    "additionDate": "2018-10-31T11:26:14Z",
    "biotoolsCURIE": "biotools:phylopythias",
    "biotoolsID": "phylopythias",
    "credit": [
        {
            "email": "Alice.McHardy@helmholz-hzi.de",
            "name": "Alice McHardy",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "PhyloPythiaS+ allows the analysis of Gb-sized metagenomes with inexpensive hardware and recovery of species or genera-level bins with low error rates in a fully automated fashion.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://github.com/algbioi/ppsp/blob/master/Tutorial.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genetic variation analysis",
                    "uri": "http://edamontology.org/operation_3197"
                }
            ]
        }
    ],
    "homepage": "https://github.com/algbioi/ppsp",
    "language": [
        "Python"
    ],
    "lastUpdate": "2018-12-10T12:59:01Z",
    "license": "Other",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/algbioi/ppsp/issues"
        }
    ],
    "name": "PhyloPythiaS+",
    "operatingSystem": [
        "Windows",
        "Mac"
    ],
    "owner": "daniel_stefan",
    "publication": [
        {
            "doi": "10.7717/peerj.1603",
            "metadata": {
                "abstract": "© 2016 Gregor et al.Background. Metagenomics is an approach for characterizing environmental microbial communities in situ, it allows their functional and taxonomic characterization and to recover sequences from uncultured taxa. This is often achieved by a combination of sequence assembly and binning, where sequences are grouped into `bins' representing taxa of the underlying microbial community. Assignment to low-ranking taxonomic bins is an important challenge for binning methods as is scalability to Gb-sized datasets generated with deep sequencing techniques. One of the best available methods for species bins recovery from deep-branching phyla is the expert-trained PhyloPythiaS package, where a human expert decides on the taxa to incorporate in the model and identifies `training' sequences based on marker genes directly from the sample. Due to the manual effort involved, this approach does not scale to multiple metagenome samples and requires substantial expertise, which researchers who are new to the area do not have. Results. We have developed PhyloPythiaS+, a successor to our PhyloPythia(S) software. The new (+) component performs the work previously done by the human expert. PhyloPythiaS+ also includes a new k-mer counting algorithm, which accelerated the simultaneous counting of 4-6-mers used for taxonomic binning 100-fold and reduced the overall execution time of the software by a factor of three. Our software allows to analyze Gb-sized metagenomes with inexpensive hardware, and to recover species or genera-level bins with low error rates in a fully automated fashion. PhyloPythiaS+ was compared to MEGAN, taxator-tk, Kraken and the generic PhyloPythiaS model. The results showed that PhyloPythiaS+ performs especially well for samples originating from novel environments in comparison to the other methods. Availability. PhyloPythiaS+ in a virtual machine is available for installation under Windows, Unix systems or OS X on: https://github.com/algbioi/ppsp/wiki.",
                "authors": [
                    {
                        "name": "Gregor I."
                    },
                    {
                        "name": "Droge J."
                    },
                    {
                        "name": "Schirmer M."
                    },
                    {
                        "name": "Quince C."
                    },
                    {
                        "name": "McHardy A.C."
                    }
                ],
                "citationCount": 42,
                "date": "2016-01-01T00:00:00Z",
                "journal": "PeerJ",
                "title": "PhyloPythiaS+: A self-training method for the rapid reconstruction of low-ranking taxonomic bins from metagenomes"
            },
            "pmcid": "PMC4748697",
            "pmid": "26870609",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "Population genetics",
            "uri": "http://edamontology.org/topic_3056"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Taxonomy",
            "uri": "http://edamontology.org/topic_0637"
        }
    ],
    "validated": 1
}