{
    "additionDate": "2021-06-14T13:20:43Z",
    "biotoolsCURIE": "biotools:covid19census",
    "biotoolsID": "covid19census",
    "collectionID": [
        "COVID-19"
    ],
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "lum4003@med.cornell.edu",
            "name": "Luigi Marchionni",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "The package covid19census provides functions to extract COVID-19 cases, deaths, hospitalizations and test of U.S. and Italy at the county and regional level, respectively, and then combines them with other population metrics (age, sex, prevalence of chronic conditions, income indexes, access to health services and many others).",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                },
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "https://github.com/c1au6i0/covid19census",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-08-23T17:59:18Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/c1au6i0/covid19census/issues"
        },
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/marchionniLab/covid19census_analysis"
        },
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/pcm-dpc/COVID-19"
        }
    ],
    "name": "covid19census",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/DATABASE/BAAB027",
            "metadata": {
                "abstract": "© 2021 The Author(s). Published by Oxford University Press.Since the beginning of the coronavirus disease-2019 (COVID-19) pandemic in 2020, there has been a tremendous accumulation of data capturing different statistics including the number of tests, confirmed cases and deaths. This data wealth offers a great opportunity for researchers to model the effect of certain variables on COVID-19 morbidity and mortality and to get a better understanding of the disease at the epidemiological level. However, in order to draw any reliable and unbiased estimate, models also need to take into account other variables and metrics available from a plurality of official and unofficial heterogenous resources. In this study, we introduce covid19census, an R package that extracts from many different repositories and combines together COVID-19 metrics and other demographic, environment- and health-related variables of the USA and Italy at the county and regional levels, respectively. The package is equipped with a number of user-friendly functions that dynamically extract the data over different timepoints and contains a detailed description of the included variables. To demonstrate the utility of this tool, we used it to extract and combine different county-level data from the USA, which we subsequently used to model the effect of diabetes on COVID-19 mortality at the county level, taking into account other variables that may influence such effects. In conclusion, it was observed that the 'covid19census' package allows to easily extract area-level data from both the USA and Italy using few functions. These comprehensive data can be used to provide reliable estimates of the effect of certain variables on COVID-19 outcomes.",
                "authors": [
                    {
                        "name": "Colantuoni E."
                    },
                    {
                        "name": "Dinalankara W."
                    },
                    {
                        "name": "Imada E.L."
                    },
                    {
                        "name": "Marchionni L."
                    },
                    {
                        "name": "Omar M."
                    },
                    {
                        "name": "Parmigiani G."
                    },
                    {
                        "name": "Zanettini C."
                    }
                ],
                "date": "2021-01-01T00:00:00Z",
                "journal": "Database",
                "title": "Covid19census: U.S. And Italy COVID-19 metrics and other epidemiological data"
            },
            "pmcid": "PMC8122363",
            "pmid": "33991092",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Public health and epidemiology",
            "uri": "http://edamontology.org/topic_3305"
        }
    ]
}
