{
    "additionDate": "2017-03-30T21:27:45Z",
    "biotoolsCURIE": "biotools:biomodels",
    "biotoolsID": "biomodels",
    "collectionID": [
        "EBI Tools",
        "TransQST"
    ],
    "credit": [
        {
            "email": "sheriff@ebi.ac.uk",
            "name": "Rahuman S Malik-Sheriff",
            "note": "Senior Project Leader, BioModels",
            "orcidid": "https://orcid.org/0000-0003-0705-9809",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "biomodels-net-support@lists.sf.net",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "name": "BioModels Team",
            "typeEntity": "Person",
            "typeRole": [
                "Developer"
            ]
        },
        {
            "name": "EMBL-EBI",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        }
    ],
    "description": "Database of annotated published models is a data resource that allows biologists to store, search and retrieve published mathematical models of biological interests. Models present in this database are annotated and linked to relevant data resources, such as publications, databases of compounds and controlled vocabularies, and this modelling formats can be converted, with some of them being available online to be used directly.",
    "documentation": [
        {
            "note": "Systems Biology Format Converter (SBFC) Online",
            "type": [
                "General"
            ],
            "url": "https://www.ebi.ac.uk/biomodels/tools/converters/"
        },
        {
            "type": [
                "Terms of use"
            ],
            "url": "https://www.ebi.ac.uk/about/terms-of-use"
        }
    ],
    "editPermission": {
        "authors": [
            "rsmsheriff"
        ],
        "type": "group"
    },
    "elixirNode": [
        "EMBL"
    ],
    "elixirPlatform": [
        "Data"
    ],
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Mathematical model",
                        "uri": "http://edamontology.org/data_0950"
                    },
                    "format": [
                        {
                            "term": "SBML",
                            "uri": "http://edamontology.org/format_2585"
                        }
                    ]
                }
            ],
            "operation": [
                {
                    "term": "Annotation",
                    "uri": "http://edamontology.org/operation_0226"
                },
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                },
                {
                    "term": "Formatting",
                    "uri": "http://edamontology.org/operation_0335"
                },
                {
                    "term": "Modelling and simulation",
                    "uri": "http://edamontology.org/operation_2426"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Mathematical model",
                        "uri": "http://edamontology.org/data_0950"
                    },
                    "format": [
                        {
                            "term": "BioPAX",
                            "uri": "http://edamontology.org/format_3156"
                        },
                        {
                            "term": "SBML",
                            "uri": "http://edamontology.org/format_2585"
                        }
                    ]
                }
            ]
        }
    ],
    "homepage": "https://www.ebi.ac.uk/biomodels",
    "lastUpdate": "2022-08-04T11:39:29.840424Z",
    "name": "BioModels database",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "rsmsheriff",
    "publication": [
        {
            "doi": "10.1093/nar/gkx1023",
            "metadata": {
                "abstract": "© 2017 The Author(s) .BioModels serves as a central repository of mathematical models representing biological processes. It offers a platform to make mathematical models easily shareable across the systems modelling community, thereby supporting model reuse. To facilitate hosting a broader range of model formats derived from diverse modelling approaches and tools, a new infrastructure for BioModels has been developed that is available at http://www.ebi.ac.uk/biomodels. This new system allows submitting and sharing of a wide range of models with improved support for formats other than SBML. It also offers a version-control backed environment in which authors and curators can work collaboratively to curate models. This article summarises the features available in the current system and discusses the potential benefit they offer to the users over the previous system. In summary, the new portal broadens the scope of models accepted in BioModels and supports collaborative model curation which is crucial for model reproducibility and sharing.",
                "authors": [
                    {
                        "name": "Ali R."
                    },
                    {
                        "name": "Chelliah V."
                    },
                    {
                        "name": "Eils J."
                    },
                    {
                        "name": "Eils R."
                    },
                    {
                        "name": "Glont M."
                    },
                    {
                        "name": "Graesslin M."
                    },
                    {
                        "name": "Halke R."
                    },
                    {
                        "name": "Hermjakob H."
                    },
                    {
                        "name": "Kothamachu V.B."
                    },
                    {
                        "name": "Laibe C."
                    },
                    {
                        "name": "Le Novere N."
                    },
                    {
                        "name": "Malik-Sheriff R.S."
                    },
                    {
                        "name": "Nguyen T.V.N."
                    },
                    {
                        "name": "Rodriguez N."
                    },
                    {
                        "name": "Schramm J."
                    },
                    {
                        "name": "Swat M.J."
                    },
                    {
                        "name": "Wimalaratne S.M."
                    }
                ],
                "citationCount": 40,
                "date": "2018-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "BioModels: Expanding horizons to include more modelling approaches and formats"
            },
            "pmcid": "PMC5753244",
            "pmid": "29106614"
        },
        {
            "doi": "10.1093/nar/gkz1055",
            "metadata": {
                "abstract": "© 2019 The Author(s) 2019. Published by Oxford University Press on behalf of Nucleic Acids Research.Computational modelling has become increasingly common in life science research. To provide a platform to support universal sharing, easy accessibility and model reproducibility, BioModels (https://www.ebi.ac.uk/biomodels/), a repository for mathematical models, was established in 2005. The current BioModels platform allows submission of models encoded in diverse modelling formats, including SBML, CellML, PharmML, COMBINE archive, MATLAB, Mathematica, R, Python or C++. The models submitted to BioModels are curated to verify the computational representation of the biological process and the reproducibility of the simulation results in the reference publication. The curation also involves encoding models in standard formats and annotation with controlled vocabularies following MIRIAM (minimal information required in the annotation of biochemical models) guidelines. BioModels now accepts large-scale submission of auto-generated computational models. With gradual growth in content over 15 years, BioModels currently hosts about 2000 models from the published literature. With about 800 curated models, BioModels has become the world's largest repository of curated models and emerged as the third most used data resource after PubMed and Google Scholar among the scientists who use modelling in their research. Thus, BioModels benefits modellers by providing access to reliable and semantically enriched curated models in standard formats that are easy to share, reproduce and reuse.",
                "authors": [
                    {
                        "name": "Arankalle C."
                    },
                    {
                        "name": "Buso N."
                    },
                    {
                        "name": "Dass G."
                    },
                    {
                        "name": "Duenas-Roca C."
                    },
                    {
                        "name": "Fairbanks E.L."
                    },
                    {
                        "name": "Glont M."
                    },
                    {
                        "name": "Hermjakob H."
                    },
                    {
                        "name": "Hucka M."
                    },
                    {
                        "name": "Kananathan S."
                    },
                    {
                        "name": "Keating S.M."
                    },
                    {
                        "name": "Knight-Schrijver V."
                    },
                    {
                        "name": "Li L."
                    },
                    {
                        "name": "Maire M."
                    },
                    {
                        "name": "Malik-Sheriff R.S."
                    },
                    {
                        "name": "Men J."
                    },
                    {
                        "name": "Meyer J.P."
                    },
                    {
                        "name": "Nguyen T.V.N."
                    },
                    {
                        "name": "Park Y.M."
                    },
                    {
                        "name": "Roberts M.G."
                    },
                    {
                        "name": "Rodriguez N."
                    },
                    {
                        "name": "Tiwari K."
                    },
                    {
                        "name": "Varusai T.M."
                    },
                    {
                        "name": "Vu M.T."
                    },
                    {
                        "name": "Xavier A."
                    }
                ],
                "citationCount": 85,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "BioModels-15 years of sharing computational models in life science"
            },
            "pmcid": "PMC7145643",
            "pmid": "31701150",
            "type": [
                "Primary"
            ]
        },
        {
            "doi": "10.1186/1752-0509-4-92",
            "metadata": {
                "abstract": "Background: Quantitative models of biochemical and cellular systems are used to answer a variety of questions in the biological sciences. The number of published quantitative models is growing steadily thanks to increasing interest in the use of models as well as the development of improved software systems and the availability of better, cheaper computer hardware. To maximise the benefits of this growing body of models, the field needs centralised model repositories that will encourage, facilitate and promote model dissemination and reuse. Ideally, the models stored in these repositories should be extensively tested and encoded in community-supported and standardised formats. In addition, the models and their components should be cross-referenced with other resources in order to allow their unambiguous identification.Description: BioModels Database http://www.ebi.ac.uk/biomodels/ is aimed at addressing exactly these needs. It is a freely-accessible online resource for storing, viewing, retrieving, and analysing published, peer-reviewed quantitative models of biochemical and cellular systems. The structure and behaviour of each simulation model distributed by BioModels Database are thoroughly checked; in addition, model elements are annotated with terms from controlled vocabularies as well as linked to relevant data resources. Models can be examined online or downloaded in various formats. Reaction network diagrams generated from the models are also available in several formats. BioModels Database also provides features such as online simulation and the extraction of components from large scale models into smaller submodels. Finally, the system provides a range of web services that external software systems can use to access up-to-date data from the database.Conclusions: BioModels Database has become a recognised reference resource for systems biology. It is being used by the community in a variety of ways; for example, it is used to benchmark different simulation systems, and to study the clustering of models based upon their annotations. Model deposition to the database today is advised by several publishers of scientific journals. The models in BioModels Database are freely distributed and reusable; the underlying software infrastructure is also available from SourceForge https://sourceforge.net/projects/biomodels/ under the GNU General Public License. © 2010 Li et al; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Chelliah V."
                    },
                    {
                        "name": "Dharuri H."
                    },
                    {
                        "name": "Donizelli M."
                    },
                    {
                        "name": "Endler L."
                    },
                    {
                        "name": "He E."
                    },
                    {
                        "name": "Henry A."
                    },
                    {
                        "name": "Hucka M."
                    },
                    {
                        "name": "Laibe C."
                    },
                    {
                        "name": "Le Novere N."
                    },
                    {
                        "name": "Li C."
                    },
                    {
                        "name": "Li L."
                    },
                    {
                        "name": "Rodriguez N."
                    },
                    {
                        "name": "Snoep J.L."
                    },
                    {
                        "name": "Stefan M.I."
                    }
                ],
                "citationCount": 405,
                "date": "2010-06-29T00:00:00Z",
                "journal": "BMC Systems Biology",
                "title": "BioModels Database: An enhanced, curated and annotated resource for published quantitative kinetic models"
            },
            "pmcid": "PMC2909940",
            "pmid": "20587024",
            "type": [
                "Other"
            ]
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Systems biology",
            "uri": "http://edamontology.org/topic_2259"
        }
    ],
    "validated": 1
}
