{
    "additionDate": "2017-03-30T21:27:45Z",
    "biotoolsCURIE": "biotools:biomodels",
    "biotoolsID": "biomodels",
    "collectionID": [
        "EBI Tools"
    ],
    "credit": [
        {
            "name": "BioModels Team",
            "typeEntity": "Person",
            "typeRole": [
                "Developer"
            ]
        },
        {
            "name": "EMBL-EBI",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        },
        {
            "email": "biomodels-net-support@lists.sf.net",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "laibe@ebi.ac.uk",
            "name": "Camille Laibe",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Database of annotated published models is a data resource that allows biologists to store, search and retrieve published mathematical models of biological interests. Models present in this database are annotated and linked to relevant data resources, such as publications, databases of compounds and controlled vocabularies, and this modelling formats can be converted, with some of them being available online to be used directly.",
    "documentation": [
        {
            "type": [
                "Terms of use"
            ],
            "url": "http://www.ebi.ac.uk/about/terms-of-use"
        },
        {
            "type": [
                "General"
            ],
            "url": "http://www.ebi.ac.uk/compneur-srv/sbml/converters/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "elixirNode": [
        "EMBL"
    ],
    "elixirPlatform": [
        "Data"
    ],
    "elixir_badge": 1,
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Mathematical model",
                        "uri": "http://edamontology.org/data_0950"
                    },
                    "format": [
                        {
                            "term": "SBML",
                            "uri": "http://edamontology.org/format_2585"
                        }
                    ]
                }
            ],
            "operation": [
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                },
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Annotation",
                    "uri": "http://edamontology.org/operation_0226"
                },
                {
                    "term": "Modelling and simulation",
                    "uri": "http://edamontology.org/operation_2426"
                },
                {
                    "term": "Formatting",
                    "uri": "http://edamontology.org/operation_0335"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Mathematical model",
                        "uri": "http://edamontology.org/data_0950"
                    },
                    "format": [
                        {
                            "term": "SBML",
                            "uri": "http://edamontology.org/format_2585"
                        },
                        {
                            "term": "BioPAX",
                            "uri": "http://edamontology.org/format_3156"
                        }
                    ]
                }
            ]
        }
    ],
    "homepage": "http://www.ebi.ac.uk/biomodels",
    "lastUpdate": "2019-02-15T10:24:01Z",
    "name": "BioModels database",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "doi": "10.1186/1752-0509-4-92",
            "metadata": {
                "abstract": "Background: Quantitative models of biochemical and cellular systems are used to answer a variety of questions in the biological sciences. The number of published quantitative models is growing steadily thanks to increasing interest in the use of models as well as the development of improved software systems and the availability of better, cheaper computer hardware. To maximise the benefits of this growing body of models, the field needs centralised model repositories that will encourage, facilitate and promote model dissemination and reuse. Ideally, the models stored in these repositories should be extensively tested and encoded in community-supported and standardised formats. In addition, the models and their components should be cross-referenced with other resources in order to allow their unambiguous identification.Description: BioModels Database http://www.ebi.ac.uk/biomodels/ is aimed at addressing exactly these needs. It is a freely-accessible online resource for storing, viewing, retrieving, and analysing published, peer-reviewed quantitative models of biochemical and cellular systems. The structure and behaviour of each simulation model distributed by BioModels Database are thoroughly checked; in addition, model elements are annotated with terms from controlled vocabularies as well as linked to relevant data resources. Models can be examined online or downloaded in various formats. Reaction network diagrams generated from the models are also available in several formats. BioModels Database also provides features such as online simulation and the extraction of components from large scale models into smaller submodels. Finally, the system provides a range of web services that external software systems can use to access up-to-date data from the database.Conclusions: BioModels Database has become a recognised reference resource for systems biology. It is being used by the community in a variety of ways; for example, it is used to benchmark different simulation systems, and to study the clustering of models based upon their annotations. Model deposition to the database today is advised by several publishers of scientific journals. The models in BioModels Database are freely distributed and reusable; the underlying software infrastructure is also available from SourceForge https://sourceforge.net/projects/biomodels/ under the GNU General Public License. © 2010 Li et al; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Li C."
                    },
                    {
                        "name": "Donizelli M."
                    },
                    {
                        "name": "Rodriguez N."
                    },
                    {
                        "name": "Dharuri H."
                    },
                    {
                        "name": "Endler L."
                    },
                    {
                        "name": "Chelliah V."
                    },
                    {
                        "name": "Li L."
                    },
                    {
                        "name": "He E."
                    },
                    {
                        "name": "Henry A."
                    },
                    {
                        "name": "Stefan M.I."
                    },
                    {
                        "name": "Snoep J.L."
                    },
                    {
                        "name": "Hucka M."
                    },
                    {
                        "name": "Le Novere N."
                    },
                    {
                        "name": "Laibe C."
                    }
                ],
                "citationCount": 385,
                "date": "2010-06-29T00:00:00Z",
                "journal": "BMC Systems Biology",
                "title": "BioModels Database: An enhanced, curated and annotated resource for published quantitative kinetic models"
            },
            "pmcid": "PMC2909940",
            "pmid": "20587024",
            "type": [
                "Primary"
            ]
        },
        {
            "doi": "10.1093/nar/gkv1352",
            "metadata": {
                "abstract": "© The Author(s) 2015.New technologies are revolutionising biological research and its applications by making it easier and cheaper to generate ever-greater volumes and types of data. In response, the services and infrastructure of the European Bioinformatics Institute (EMBL-EBI, www.ebi.ac.UK) are continually expanding: total disk capacity increases significantly every year to keep pace with demand (75 petabytes as of December 2015), and interoperability between resources remains a strategic priority. Since 2014 we have launched two new resources: the European Variation Archive for genetic variation data and EMPIAR for two-dimensional electron microscopy data, as well as a Resource Description Framework platform. We also launched the Embassy Cloud service, which allows users to run large analyses in a virtual environment next to EMBL-EBI's vast public data resources.",
                "authors": [
                    {
                        "name": "Cook C.E."
                    },
                    {
                        "name": "Bergman M.T."
                    },
                    {
                        "name": "Finn R.D."
                    },
                    {
                        "name": "Cochrane G."
                    },
                    {
                        "name": "Birney E."
                    },
                    {
                        "name": "Apweiler R."
                    }
                ],
                "citationCount": 74,
                "date": "2016-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "The European Bioinformatics Institute in 2016: Data growth and integration"
            }
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Systems biology",
            "uri": "http://edamontology.org/topic_2259"
        }
    ],
    "validated": 1
}