
{
    "credit": [
        {
            "email": "pd3@sanger.ac.uk",
            "name": "Petr Danecek",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://samtools.github.io/bcftools/howtos/index.html"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux",
            "Mac"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Genetic variation",
                "uri": "http://edamontology.org/topic_0199"
            },
            {
                "term": "Sequencing",
                "uri": "http://edamontology.org/topic_3168"
            },
            {
                "term": "Genomics",
                "uri": "http://edamontology.org/topic_0622"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© 2017 The Author. Motivation: Prediction of functional variant consequences is an important part of sequencing pipelines, allowing the categorization and prioritization of genetic variants for follow up analysis. However, current predictors analyze variants as isolated events, which can lead to incorrect predictions when adjacent variants alter the same codon, or when a frame-shifting indel is followed by a frame-restoring indel. Exploiting known haplotype information when making consequence predictions can resolve these issues. Results: BCFtools/csq is a fast program for haplotype-aware consequence calling which can take into account known phase. Consequence predictions are changed for 501 of 5019 compound variants found in the 81.7M variants in the 1000 Genomes Project data, with an average of 139 compound variants per haplotype. Predictions match existing tools when run in localized mode, but the program is an order of magnitude faster and requires an order of magnitude less memory. Availability and Implementation: The program is freely available for commercial and noncommercial use in the BCFtools package which is available for download from http://samtools. github.io/bcftools.",
            "authors": [
                "Danecek P.",
                "McCarthy S.A."
            ],
            "cit_count": 7,
            "doi": "10.1093/bioinformatics/btx100",
            "journal": "Bioinformatics",
            "title": "BCFtools/csq: Haplotype-aware variant consequences",
            "year": "2017-07-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:csq",
        "biotoolsID": "csq",
        "description": "fast program for haplotype-aware consequence calling which can take into account known phase.",
        "homepage": "http://samtools.github.io/bcftools/",
        "name": "csq"
    }
}