{
    "additionDate": "2021-12-06T13:39:23.802851Z",
    "biotoolsCURIE": "biotools:svexpress",
    "biotoolsID": "svexpress",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "creighto@bcm.edu",
            "name": "Chad J. Creighton",
            "orcidid": "https://orcid.org/0000-0002-6090-703X",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "SVExpress is a suite of computational tools (implemented in Excel VBA and R) that allows one to identify Structural Variant (SV) breakpoint-to-expression associations across a set of cancer samples profiled for both SVs and gene transcription. SVExpress takes as input a table of somatic SV breakpoints and a gene-to-sample expression matrix. SVExpress then constructs a gene-to-sample breakpoint matrix, which the user can then integrate with corresponding expression data by linear regression modeling. Furthermore, using SVExpress, top SV-gene associations identified can be examined in terms of enhancer hijacking or disruption of TADs.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene expression profiling",
                    "uri": "http://edamontology.org/operation_0314"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                },
                {
                    "term": "Expression correlation analysis",
                    "uri": "http://edamontology.org/operation_3463"
                }
            ]
        }
    ],
    "homepage": "https://github.com/chadcreighton/SVExpress",
    "language": [
        "R",
        "Visual Basic"
    ],
    "lastUpdate": "2021-12-06T13:39:23.805227Z",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/chadcreighton/SVExpress/issues"
        }
    ],
    "name": "SVExpress",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1186/S12859-021-04072-0",
            "metadata": {
                "abstract": "© 2021, The Author(s).Background: Combined whole-genome sequencing (WGS) and RNA sequencing of cancers offer the opportunity to identify genes with altered expression due to genomic rearrangements. Somatic structural variants (SVs), as identified by WGS, can involve altered gene cis-regulation, gene fusions, copy number alterations, or gene disruption. The absence of computational tools to streamline integrative analysis steps may represent a barrier in identifying genes recurrently altered by genomic rearrangement. Results: Here, we introduce SVExpress, a set of tools for carrying out integrative analysis of SV and gene expression data. SVExpress enables systematic cataloging of genes that consistently show increased or decreased expression in conjunction with the presence of nearby SV breakpoints. SVExpress can evaluate breakpoints in proximity to genes for potential enhancer translocation events or disruption of topologically associated domains, two mechanisms by which SVs may deregulate genes. The output from any commonly used SV calling algorithm may be easily adapted for use with SVExpress. SVExpress can readily analyze genomic datasets involving hundreds of cancer sample profiles. Here, we used SVExpress to analyze SV and expression data across 327 cancer cell lines with combined SV and expression data in the Cancer Cell Line Encyclopedia (CCLE). In the CCLE dataset, hundreds of genes showed altered gene expression in relation to nearby SV breakpoints. Altered genes involved TAD disruption, enhancer hijacking, and gene fusions. When comparing the top set of SV-altered genes from cancer cell lines with the top SV-altered genes previously reported for human tumors from The Cancer Genome Atlas and the Pan-Cancer Analysis of Whole Genomes datasets, a significant number of genes overlapped in the same direction for both cell lines and tumors, while some genes were significant for cell lines but not for human tumors and vice versa. Conclusion: Our SVExpress tools allow computational biologists with a working knowledge of R to integrate gene expression with SV breakpoint data to identify recurrently altered genes. SVExpress is freely available for academic or commercial use at https://github.com/chadcreighton/SVExpress. SVExpress is implemented as a set of Excel macros and R code. All source code (R and Visual Basic for Applications) is available.",
                "authors": [
                    {
                        "name": "Zhang Y."
                    },
                    {
                        "name": "Chen F."
                    },
                    {
                        "name": "Creighton C.J."
                    }
                ],
                "citationCount": 1,
                "date": "2021-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "SVExpress: identifying gene features altered recurrently in expression with nearby structural variant breakpoints"
            },
            "pmcid": "PMC7981925",
            "pmid": "33743584",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Suite",
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Whole genome sequencing",
            "uri": "http://edamontology.org/topic_3673"
        },
        {
            "term": "Structural variation",
            "uri": "http://edamontology.org/topic_3175"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        }
    ]
}