{
    "additionDate": "2020-01-09T18:12:10Z",
    "biotoolsCURIE": "biotools:Matched_Forest",
    "biotoolsID": "Matched_Forest",
    "confidence_flag": "tool",
    "description": "Supervised Learning for High-dimensional Matched Case-Control Studies.\n\nThis code implements Matched Forest algorithm which aims to find important variables in high-dimensional matched case-control data sets. Please refer to our papers for more details:",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                },
                {
                    "term": "Scatter plot plotting",
                    "uri": "http://edamontology.org/operation_2940"
                }
            ]
        }
    ],
    "homepage": "https://github.com/NooshinSh/Matched_Forest",
    "language": [
        "R"
    ],
    "lastUpdate": "2020-12-23T07:48:05Z",
    "name": "Matched Forest",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ785",
            "metadata": {
                "abstract": "© 2019 The Author(s). Published by Oxford University Press.Motivation: Matched case-control analysis is widely used in biomedical studies to identify exposure variables associated with health conditions. The matching is used to improve the efficiency. Existing variable selection methods for matched case-control studies are challenged in high-dimensional settings where interactions among variables are also important. We describe a quite different method for high-dimensional matched case-control data, based on the potential outcome model, which is not only flexible regarding the number of matching and exposure variables but also able to detect interaction effects. Results: We present Matched Forest (MF), an algorithm for variable selection in matched case-control data. The method preserves the case and control values in each instance but transforms the matched case-control data with added counterfactuals. A modified variable importance score from a supervised learner is used to detect important variables. The method is conceptually simple and can be applied with widely available software tools. Simulation studies show the effectiveness of MF in identifying important variables. MF is also applied to data from the biomedical domain and its performance is compared with alternative approaches.",
                "authors": [
                    {
                        "name": "Lin S."
                    },
                    {
                        "name": "Runger G.C."
                    },
                    {
                        "name": "Shomal Zadeh N."
                    }
                ],
                "date": "2020-03-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Matched Forest: Supervised learning for high-dimensional matched case-control studies"
            },
            "pmid": "31621830"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Bioinformatics",
            "uri": "http://edamontology.org/topic_0091"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        }
    ],
    "validated": 1
}
