{
    "additionDate": "2017-01-17T15:02:06Z",
    "biotoolsCURIE": "biotools:dmrcate",
    "biotoolsID": "dmrcate",
    "collectionID": [
        "BioConductor"
    ],
    "credit": [
        {
            "email": "t.peters@garvan.org.au",
            "name": "Tim Peters",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "De novo identification and extraction of differentially methylated regions (DMRs) from the human genome using Whole Genome Bisulphite Sequencing (WGBS) and Illumina Infinium Array (450K and EPIC) data. Provides functionality for filtering probes possibly confounded by SNPs and cross-hybridisation. Includes GRanges generation and plotting functions.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://bioconductor.org/packages/release/bioc/html/DMRcate.html"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://bioconductor/packages/release/bioc/src/contrib/DMRcate_1.10.1.tar.gz"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Methylation analysis",
                    "uri": "http://edamontology.org/operation_3204"
                }
            ]
        }
    ],
    "homepage": "http://bioconductor.org/packages/release/bioc/html/DMRcate.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2019-01-11T00:47:59Z",
    "name": "DMRcate",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "bioconductor_import",
    "publication": [
        {
            "doi": "10.1186/1756-8935-8-6",
            "metadata": {
                "abstract": "© 2015 Peters et al.; licensee BioMed Central.Background: The identification and characterisation of differentially methylated regions (DMRs) between phenotypes in the human genome is of prime interest in epigenetics. We present a novel method, DMRcate, that fits replicated methylation measurements from the Illumina HM450K BeadChip (or 450K array) spatially across the genome using a Gaussian kernel. DMRcate identifies and ranks the most differentially methylated regions across the genome based on tunable kernel smoothing of the differential methylation (DM) signal. The method is agnostic to both genomic annotation and local change in the direction of the DM signal, removes the bias incurred from irregularly spaced methylation sites, and assigns significance to each DMR called via comparison to a null model. Results: We show that, for both simulated and real data, the predictive performance of DMRcate is superior to those of Bumphunter and Probe Lasso, and commensurate with that of comb-p. For the real data, we validate all array-derived DMRs from the candidate methods on a suite of DMRs derived from whole-genome bisulfite sequencing called from the same DNA samples, using two separate phenotype comparisons. Conclusions: The agglomeration of genomically localised individual methylation sites into discrete DMRs is currently best served by a combination of DM-signal smoothing and subsequent threshold specification. The findings also suggest the design of the 450K array shows preference for CpG sites that are more likely to be differentially methylated, but its overall coverage does not adequately reflect the depth and complexity of methylation signatures afforded by sequencing. For the convenience of the research community we have created a user-friendly R software package called DMRcate, downloadable from Bioconductor and compatible with existing preprocessing packages, which allows others to apply the same DMR-finding method on 450K array data.",
                "authors": [
                    {
                        "name": "Peters T.J."
                    },
                    {
                        "name": "Buckley M.J."
                    },
                    {
                        "name": "Statham A.L."
                    },
                    {
                        "name": "Pidsley R."
                    },
                    {
                        "name": "Samaras K."
                    },
                    {
                        "name": "V Lord R."
                    },
                    {
                        "name": "Clark S.J."
                    },
                    {
                        "name": "Molloy P.L."
                    }
                ],
                "citationCount": 267,
                "date": "2015-01-27T00:00:00Z",
                "journal": "Epigenetics and Chromatin",
                "title": "De novo identification of differentially methylated regions in the human genome"
            },
            "pmcid": "PMC4429355",
            "pmid": "25972926",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool",
        "Library"
    ],
    "topic": [
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ],
    "validated": 1,
    "version": [
        "1.10.1"
    ]
}