{
    "accessibility": "Open access",
    "additionDate": "2023-01-23T09:36:49.074948Z",
    "biotoolsCURIE": "biotools:pleistodist",
    "biotoolsID": "pleistodist",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "David J.X. Tan",
            "orcidid": "http://orcid.org/0000-0001-7019-7871"
        },
        {
            "name": "Michael J. Andersen",
            "orcidid": "http://orcid.org/0000-0002-7220-5588"
        }
    ],
    "description": "A toolbox for visualising and quantifying the effects of Pleistocene sea-level change on island archipelagos.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence assembly",
                    "uri": "http://edamontology.org/operation_0310"
                },
                {
                    "term": "Sequence assembly visualisation",
                    "uri": "http://edamontology.org/operation_3184"
                }
            ]
        }
    ],
    "homepage": "https://github.com/g33k5p34k/PleistoDistR",
    "language": [
        "R"
    ],
    "lastUpdate": "2023-01-23T09:36:49.077566Z",
    "license": "MIT",
    "name": "PleistoDist",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1111/2041-210X.14024",
            "metadata": {
                "abstract": "© 2022 The Authors. Methods in Ecology and Evolution published by John Wiley & Sons Ltd on behalf of British Ecological Society.Pleistocene sea-level change played a significant role in the evolution and assembly of island biotas. The formation of land bridges between islands during Quaternary glacial maxima, when sea levels were more than 120 metres below present-day sea levels, often facilitated historical dispersal and gene flow between islands that are today geographically disconnected. Despite the importance of Pleistocene sea-level change, few software packages exist that model the effects of this phenomenon in a standardised and generalised manner. Here, we present PleistoDist, an R package that allows users to visualise and quantify the effects of Pleistocene sea-level change on islands over time, and test multiple temporally explicit hypotheses of inter-island dispersal and community assembly. Re-analysing published datasets, we demonstrate how using PleistoDist to account for historical sea-level change can provide greater explanatory power when analysing extant island communities, and show how population genetic simulations can be used to generate spatiotemporally explicit neutral expectations of population genetic structure across island archipelagos.",
                "authors": [
                    {
                        "name": "Andersen M.J."
                    },
                    {
                        "name": "Gyllenhaal E.F."
                    },
                    {
                        "name": "Tan D.J.X."
                    }
                ],
                "date": "2022-01-01T00:00:00Z",
                "journal": "Methods in Ecology and Evolution",
                "title": "PleistoDist: A toolbox for visualising and quantifying the effects of Pleistocene sea-level change on island archipelagos"
            }
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Evolutionary biology",
            "uri": "http://edamontology.org/topic_3299"
        },
        {
            "term": "Population genetics",
            "uri": "http://edamontology.org/topic_3056"
        },
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        }
    ]
}
