
{
    "credit": [
        {
            "email": "dsenalik@wisc.edu",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://alverson.openwetware.org/"
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://dogma.ccbb.utexas.edu/mitofy/README.pdf"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Genome annotation",
                    "uri": "http://edamontology.org/operation_0362"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Perl"
        ],
        "operatingSystem": [
            "Linux",
            "Mac"
        ],
        "toolType": [
            "Command-line tool",
            "Web application"
        ],
        "topic": [
            {
                "term": "Plant biology",
                "uri": "http://edamontology.org/topic_0780"
            },
            {
                "term": "Cell biology",
                "uri": "http://edamontology.org/topic_2229"
            },
            {
                "term": "Genomics",
                "uri": "http://edamontology.org/topic_0622"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://www.mybiosoftware.com/mitofy-plant-mitochondrial-genome-annotation.html"
        }
    ],
    "publication": [
        {
            "abstract": "The mitochondrial genomes of seed plants are unusually large and vary in size by at least an order of magnitude. Much of this variation occurs within a single family, the Cucurbitaceae, whose genomes range from an estimated 390 to 2,900 kb in size. We sequenced the mitochondrial genomes of Citrullus lanatus (watermelon: 379,236 nt) and Cucurbita pepo (zucchini: 982,833 nt)-the two smallest characterized cucurbit mitochondrial genomes-and determined their RNA editing content. The relatively compact Citrullus mitochondrial genome actually contains more and longer genes and introns, longer segmental duplications, and more discernibly nuclear-derived DNA. The large size of the Cucurbita mitochondrial genome reflects the accumulation of unprecedented amounts of both chloroplast sequences (>113 kb) and short repeated sequences (>370 kb). A low mutation rate has been hypothesized to underlie increases in both genome size and RNA editing frequency in plant mitochondria. However, despite its much larger genome, Cucurbita has a significantly higher synonymous substitution rate (and presumably mutation rate) than Citrullus but comparable levels of RNA editing. The evolution of mutation rate, genome size, and RNA editing are apparently decoupled in Cucurbitaceae, reflecting either simple stochastic variation or governance by different factors. © The Author 2010. Published by Oxford University Press on behalf of the Society for Molecular Biology and Evolution. All rights reserved.",
            "authors": [
                "Alverson A.J.",
                "Wei X.",
                "Rice D.W.",
                "Stern D.B.",
                "Barry K.",
                "Palmer J.D."
            ],
            "cit_count": 179,
            "journal": "Molecular Biology and Evolution",
            "pmid": "20118192",
            "title": "Insights into the evolution of mitochondrial genome size from complete sequences of citrullus lanatus and cucurbita pepo (Cucurbitaceae)",
            "year": "2010-06-03"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:mitofy",
        "biotoolsID": "mitofy",
        "description": "Developed to assist in the annotation of genes and tRNAs in seed plant mitochondrial genomes.",
        "homepage": "http://dogma.ccbb.utexas.edu/mitofy/",
        "name": "MITOFY"
    }
}