
{
    "credit": [
        {
            "name": "Drug Design Group",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://www.ddg-pharmfac.net/ddg/index.html"
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://www.ddg-pharmfac.net/AllergenFP/method.html"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Protein sequence analysis",
                    "uri": "http://edamontology.org/operation_2479"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Prediction and recognition",
                    "uri": "http://edamontology.org/operation_2423"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Computational biology",
                "uri": "http://edamontology.org/topic_3307"
            },
            {
                "term": "Proteins",
                "uri": "http://edamontology.org/topic_0078"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://www.mybiosoftware.com/allergenfp-1-0-allergenicity-prediction-based-on-a-novel-descriptor-fingerprint-approach.html"
        }
    ],
    "publication": [
        {
            "abstract": "Motivation: Allergenicity, like antigenicity and immunogenicity, is a property encoded linearly and non-linearly, and therefore the alignment- based approaches are not able to identify this property unambiguously. A novel alignment-free descriptor-based fingerprint approach is presented here and applied to identify allergens and non-allergens. The approach was implemented into a four step algorithm. Initially, the protein sequences are described by amino acid principal properties as hydrophobicity, size, relative abundance, helix and -strand forming propensities. Then, the generated strings of different length are converted into vectors with equal length by autoand cross-covariance (ACC). The vectors were transformed into binary fingerprints and compared in terms of Tanimoto coefficient. Results: The approach was applied to a set of 2427 known allergens and 2427 non-allergens and identified correctly 88% of them with Matthews correlation coefficient of 0.759. The descriptor fingerprint approach presented here is universal. It could be applied for any classification problem in computational biology. The set of E-descriptors is able to capture the main structural and physicochemical properties of amino acids building the proteins. The ACC transformation overcomes the main problem in the alignment-based comparative studies arising from the different length of the aligned protein sequences. The conversion of protein ACC values into binary descriptor fingerprints allows similarity search and classification. © 2013 The Author 2013. Published by Oxford University Press. All rights reserved.",
            "authors": [
                "Dimitrov I.",
                "Naneva L.",
                "Doytchinova I.",
                "Bangov I."
            ],
            "cit_count": 31,
            "journal": "Bioinformatics",
            "pmid": "24167156",
            "title": "AllergenFP: Allergenicity prediction by descriptor fingerprints",
            "year": "2014-03-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:allergenfp",
        "biotoolsID": "allergenfp",
        "description": "Bioinformatics tool for allergenicity prediction based on a novel descriptor fingerprint approach.",
        "homepage": "http://www.ddg-pharmfac.net/AllergenFP/",
        "name": "AllergenFP"
    }
}