{
    "additionDate": "2017-01-13T13:14:36Z",
    "biotoolsCURIE": "biotools:flash",
    "biotoolsID": "flash",
    "credit": [
        {
            "email": "flash.comment@gmail.com",
            "name": "FLASh team",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Identifies paired-end reads which overlap in the middle, converting them to single long reads",
    "editPermission": {
        "authors": [
            "ELIXIR-EE"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Read pre-processing",
                    "uri": "http://edamontology.org/operation_3219"
                },
                {
                    "term": "Sequence assembly",
                    "uri": "http://edamontology.org/operation_0310"
                },
                {
                    "term": "Sequence merging",
                    "uri": "http://edamontology.org/operation_0232"
                }
            ]
        }
    ],
    "homepage": "http://ccb.jhu.edu/software/FLASH/",
    "language": [
        "C"
    ],
    "lastUpdate": "2024-11-25T14:26:32.217431Z",
    "name": "FLASH",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "seqwiki_import",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btr507",
            "metadata": {
                "abstract": "Motivation: Next-generation sequencing technologies generate very large numbers of short reads. Even with very deep genome coverage, short read lengths cause problems in de novo assemblies. The use of paired-end libraries with a fragment size shorter than twice the read length provides an opportunity to generate much longer reads by overlapping and merging read pairs before assembling a genome. Results: We present FLASH, a fast computational tool to extend the length of short reads by overlapping paired-end reads from fragment libraries that are sufficiently short. We tested the correctness of the tool on one million simulated read pairs, and we then applied it as a pre-processor for genome assemblies of Illumina reads from the bacterium Staphylococcus aureus and human chromosome 14. FLASH correctly extended and merged reads >99% of the time on simulated reads with an error rate of <1%. With adequately set parameters, FLASH correctly merged reads over 90% of the time even when the reads contained up to 5% errors. When FLASH was used to extend reads prior to assembly, the resulting assemblies had substantially greater N50 lengths for both contigs and scaffolds. © The Author 2011. Published by Oxford University Press. All rights reserved.",
                "authors": [
                    {
                        "name": "Magoc T."
                    },
                    {
                        "name": "Salzberg S.L."
                    }
                ],
                "citationCount": 10908,
                "date": "2011-11-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "FLASH: Fast length adjustment of short reads to improve genome assemblies"
            },
            "pmcid": "PMC3198573",
            "pmid": "21903629"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ],
    "validated": 1
}
