{
    "additionDate": "2018-07-27T14:49:34Z",
    "biotoolsCURIE": "biotools:zfpkm",
    "biotoolsID": "zfpkm",
    "collectionID": [
        "BioConductor"
    ],
    "cost": "Free of charge",
    "credit": [
        {
            "email": "ron.ammar@bms.com",
            "name": "Ron Ammar",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "name": "Traver Hart",
            "orcidid": "http://orcid.org/0000-0002-1880-3341",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "This algorithm is based on the publication by Hart et al., 2013. Reference recommends using zFPKM > -3 to select expressed genes. Validated with encode open/closed chromosome data. Works well for gene level data using FPKM or TPM. Does not appear to calibrate well for transcript level data.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://bioconductor.org/packages/release/bioc/manuals/zFPKM/man/zFPKM.pdf"
        },
        {
            "type": [
                "General"
            ],
            "url": "http://bioconductor.org/packages/release/bioc/vignettes/zFPKM/inst/doc/zFPKM.html"
        }
    ],
    "download": [
        {
            "type": "Software package",
            "url": "http://bioconductor.org/packages/release/bioc/src/contrib/zFPKM_1.2.0.tar.gz"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Validation",
                    "uri": "http://edamontology.org/operation_2428"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Analysis",
                    "uri": "http://edamontology.org/operation_2945"
                }
            ]
        }
    ],
    "homepage": "http://bioconductor.org/packages/release/bioc/html/zFPKM.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2019-01-10T04:27:14Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Mirror"
            ],
            "url": "https://github.com/ronammar/zFPKM/"
        },
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/ronammar/zFPKM/issues"
        }
    ],
    "name": "zFPKM",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "shadi.m",
    "publication": [
        {
            "doi": "10.1186/1471-2164-14-778",
            "metadata": {
                "abstract": "Background: Early application of second-generation sequencing technologies to transcript quantitation (RNA-seq) has hinted at a vast mammalian transcriptome, including transcripts from nearly all known genes, which might be fully measured only by ultradeep sequencing. Subsequent studies suggested that low-abundance transcripts might be the result of technical or biological noise rather than active transcripts; moreover, most RNA-seq experiments did not provide enough read depth to generate high-confidence estimates of gene expression for low-abundance transcripts. As a result, the community adopted several heuristics for RNA-seq analysis, most notably an arbitrary expression threshold of 0.3 - 1 FPKM for downstream analysis. However, advances in RNA-seq library preparation, sequencing technology, and informatic analysis have addressed many of the systemic sources of uncertainty and undermined the assumptions that drove the adoption of these heuristics. We provide an updated view of the accuracy and efficiency of RNA-seq experiments, using genomic data from large-scale studies like the ENCODE project to provide orthogonal information against which to validate our conclusions. Results: We show that a human cell's transcriptome can be divided into active genes carrying out the work of the cell and other genes that are likely the by-products of biological or experimental noise. We use ENCODE data on chromatin state to show that ultralow-expression genes are predominantly associated with repressed chromatin; we provide a novel normalization metric, zFPKM, that identifies the threshold between active and background gene expression; and we show that this threshold is robust to experimental and analytical variations. Conclusions: The zFPKM normalization method accurately separates the biologically relevant genes in a cell, which are associated with active promoters, from the ultralow-expression noisy genes that have repressed promoters. A read depth of twenty to thirty million mapped reads allows high-confidence quantitation of genes expressed at this threshold, providing important guidance for the design of RNA-seq studies of gene expression. Moreover, we offer an example for using extensive ENCODE chromatin state information to validate RNA-seq analysis pipelines. © 2013 Hart et al.; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Hart T."
                    },
                    {
                        "name": "Komori H.K."
                    },
                    {
                        "name": "LaMere S."
                    },
                    {
                        "name": "Podshivalova K."
                    },
                    {
                        "name": "Salomon D.R."
                    }
                ],
                "citationCount": 92,
                "date": "2013-11-11T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "Finding the active genes in deep RNA-seq gene expression studies"
            },
            "pmcid": "PMC3870982",
            "pmid": "24215113",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "RNA-seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ],
    "validated": 1,
    "version": [
        "1.2.0"
    ]
}