{
    "additionDate": "2018-05-18T14:57:00Z",
    "biotoolsCURIE": "biotools:synfind",
    "biotoolsID": "synfind",
    "credit": [
        {
            "email": "coge.genome@gmail.com",
            "name": "Support",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Compiling Syntenic Regions across Any Set of Genomes on Demand.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://genomevolution.org/wiki/index.php/Tutorials"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence feature detection",
                    "uri": "http://edamontology.org/operation_0253"
                }
            ]
        }
    ],
    "homepage": "https://genomevolution.org/CoGe/SynFind.pl",
    "lastUpdate": "2018-12-10T12:58:58Z",
    "name": "SynFind",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1093/GBE/EVV219",
            "metadata": {
                "abstract": "© 2015 The Author(s).The identification of conserved syntenic regions enables discovery of predicted locations for orthologous and homeologous genes, even when no such gene is present. This capability means that synteny-based methods are far more effective than sequence similarity based methods in identifying true-negatives, a necessity for studying gene loss and gene transposition. However, the identification of syntenic regions requires complex analyses which must be repeated for pairwise comparisons between any two species. Therefore, as the number of published genomes increases, there is a growing demand for scalable, simple-to-use applications to perform comparative genomic analyses that cater to both gene family studies and genome-scale studies. We implemented SynFind, a web-based tool that addresses this need. Given one query genome, SynFind is capable of identifying conserved syntenic regions in any set of target genomes. SynFind is capable of reporting per-gene information, useful for researchers studying specificgene families, as well as genome-wide data sets of syntenic gene and predicted gene locations, critical for researchers focused on large-scale genomic analyses. Inference of syntenic homologs provides the basis for correlation of functional changes around genes of interests between related organisms. Deployed on the CoGe online platform, SynFind is connected to the genomic data from over 15,000 organisms from all domains of life as well as supporting multiple releases of the same organism. SynFindmakes use of a powerful job execution framework that promises scalability and reproducibility. SynFind can be accessed at http://genomevolution.org/CoGe/SynFind.pl. A video tutorial of SynFind using Phytophthrora as an example is available at http://www.youtube.com/watch?v=2Agczny9Nyc.",
                "authors": [
                    {
                        "name": "Bomhoff M.D."
                    },
                    {
                        "name": "Briones E."
                    },
                    {
                        "name": "Lyons E."
                    },
                    {
                        "name": "Schnable J.C."
                    },
                    {
                        "name": "Tang H."
                    },
                    {
                        "name": "Zhang L."
                    }
                ],
                "citationCount": 35,
                "date": "2015-12-01T00:00:00Z",
                "journal": "Genome Biology and Evolution",
                "title": "SynFind: Compiling syntenic regions across any set of genomes on demand"
            },
            "pmcid": "PMC4700967",
            "pmid": "26560340"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Sequence sites, features and motifs",
            "uri": "http://edamontology.org/topic_0160"
        }
    ],
    "validated": 1
}
