{
    "additionDate": "2017-12-18T00:03:50Z",
    "biotoolsCURIE": "biotools:bars",
    "biotoolsID": "bars",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://wpicr.wpic.pitt.edu/WPICCompGen/"
        }
    ],
    "description": "BARS is a statistical method that bridges the gap between single-locus and haplotype-based tests of association. It is based on the non-parametric regression techniques embodied by Bayesian Adaptive Regression Splines.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://wpicr.wpic.pitt.edu/WPICCompGen/BARS/BARS_R_INSTRUCTIONS.htm"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Regression",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "http://wpicr.wpic.pitt.edu/WPICCompGen/bars.htm",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-10T12:58:57Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/bars-bayesian-adaptive-regression-splines.html"
        }
    ],
    "name": "BARS",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1186/1479-7364-1-1-20",
            "metadata": {
                "abstract": "In the search for genetic determinants of complex disease, two approaches to association analysis are most often employed, testing single loci or testing a small group of loci jointly via haplotypes for their relationship to disease status. It is still debatable which of these approaches is more favourable, and under what conditions. The former has the advantage of simplicity but suffers severely when alleles at the tested loci are not in linkage disequilibrium (LD) with liability alleles; the latter should capture more of the signal encoded in LD, but is far from simple. The complexity of haplotype analysis could be especially troublesome for association scans over large genomic regions, which, in fact, is becoming the standard design. For these reasons, the authors have been evaluating statistical methods that bridge the gap between single-locus and haplotype-based tests. In this article, they present one such method, which uses non-parametric regression techniques embodied by Bayesian adaptive regression splines (BARS). For a set of markers falling within a common genomic region and a corresponding set of single-locus association statistics, the BARS procedure integrates these results into a single test by examining the class of smooth curves consistent with the data. The non-parametric BARS procedure generally finds no signal when no liability allele exists in the tested region (ie it achieves the specified size of the test) and it is sensitive enough to pick up signals when a liability allele is present. The BARS procedure provides a robust and potentially powerful alternative to classical tests of association, diminishes the multiple testing problem inherent in those tests and can be applied to a wide range of data types, including genotype frequencies estimated from pooled samples.",
                "authors": [
                    {
                        "name": "Zhang X."
                    },
                    {
                        "name": "Roeder K."
                    },
                    {
                        "name": "Wallstrom G."
                    },
                    {
                        "name": "Devlin B."
                    }
                ],
                "citationCount": 20,
                "date": "2003-01-01T00:00:00Z",
                "journal": "Human genomics",
                "title": "Integration of association statistics over genomic regions using Bayesian adaptive regression splines."
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        }
    ],
    "validated": 1
}