{
    "accessibility": "Open access",
    "additionDate": "2023-01-23T09:14:36.383238Z",
    "biotoolsCURIE": "biotools:meta-boa",
    "biotoolsID": "meta-boa",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "cuperlovim@nrc.ca",
            "name": "Miroslava Čuperlović-Culf",
            "orcidid": "http://orcid.org/0000-0002-9483-8159",
            "typeEntity": "Person"
        },
        {
            "name": "Emily Hashimoto-Roth"
        },
        {
            "name": "Mathieu Lavallée-Adam"
        },
        {
            "name": "Anuradha Surendra",
            "orcidid": "http://orcid.org/0000-0002-4736-3592"
        },
        {
            "name": "Steffany A. L. Bennett",
            "orcidid": "http://orcid.org/0000-0001-7944-5800"
        }
    ],
    "description": "META-BOA (METAbolomics data Balancing with Over-sampling Algorithms) is a software solution for handling sample imbalance primarily for metabolomics and lipidomics datasets.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Dimensionality reduction",
                    "uri": "http://edamontology.org/operation_3935"
                },
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Principal component visualisation",
                    "uri": "http://edamontology.org/operation_2939"
                }
            ]
        }
    ],
    "homepage": "https://complimet.ca/meta-boa",
    "language": [
        "R"
    ],
    "lastUpdate": "2023-01-23T09:14:36.386097Z",
    "name": "META-BOA",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btac649",
            "metadata": {
                "abstract": "© The Author(s) 2022. Published by Oxford University Press. All rights reserved. For permissions, please e-mail: journals.permissions@oup.com.MOTIVATION: Class imbalance, or unequal sample sizes between classes, is an increasing concern in machine learning for metabolomic and lipidomic data mining, which can result in overfitting for the over-represented class. Numerous methods have been developed for handling class imbalance, but they are not readily accessible to users with limited computational experience. Moreover, there is no resource that enables users to easily evaluate the effect of different over-sampling algorithms. RESULTS: METAbolomics data Balancing with Over-sampling Algorithms (META-BOA) is a web-based application that enables users to select between four different methods for class balancing, followed by data visualization and classification of the sample to observe the augmentation effects. META-BOA outputs a newly balanced dataset, generating additional samples in the minority class, according to the user's choice of Synthetic Minority Over-sampling Technique (SMOTE), Borderline-SMOTE (BSMOTE), Adaptive Synthetic (ADASYN) or Random Over-Sampling Examples (ROSE). To present the effect of over-sampling on the data META-BOA further displays both principal component analysis and t-distributed stochastic neighbor embedding visualization of data pre- and post-over-sampling. Random forest classification is utilized to compare sample classification in both the original and balanced datasets, enabling users to select the most appropriate method for their further analyses. AVAILABILITY AND IMPLEMENTATION: META-BOA is available at https://complimet.ca/meta-boa. SUPPLEMENTARY INFORMATION: Supplementary data are available at Bioinformatics online.",
                "authors": [
                    {
                        "name": "Bennett S.A.L."
                    },
                    {
                        "name": "Cuperlovic-Culf M."
                    },
                    {
                        "name": "Hashimoto-Roth E."
                    },
                    {
                        "name": "Lavallee-Adam M."
                    },
                    {
                        "name": "Surendra A."
                    }
                ],
                "date": "2022-11-30T00:00:00Z",
                "journal": "Bioinformatics (Oxford, England)",
                "title": "METAbolomics data Balancing with Over-sampling Algorithms (META-BOA): an online resource for addressing class imbalance"
            },
            "pmid": "36222566"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Lipids",
            "uri": "http://edamontology.org/topic_0153"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        }
    ],
    "validated": 1
}
