{
    "additionDate": "2021-03-19T08:48:08Z",
    "biotoolsCURIE": "biotools:earrings",
    "biotoolsID": "earrings",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "jhhung@nctu.edu.tw",
            "typeEntity": "Person"
        },
        {
            "email": "juihunghung@gmail.com",
            "typeEntity": "Person"
        }
    ],
    "description": "EARRINGS is an efficient and accurate adapter trimmer that entails no a priori adapter sequences for both single- and paired-end NGS reads.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "De-novo assembly",
                    "uri": "http://edamontology.org/operation_0524"
                },
                {
                    "term": "Genome indexing",
                    "uri": "http://edamontology.org/operation_3211"
                },
                {
                    "term": "Sequence trimming",
                    "uri": "http://edamontology.org/operation_3192"
                }
            ]
        }
    ],
    "homepage": "https://github.com/jhhung/EARRINGS",
    "language": [
        "C++",
        "Perl"
    ],
    "lastUpdate": "2021-04-10T12:28:31Z",
    "license": "GPL-2.0",
    "name": "EARRINGS",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAB025",
            "metadata": {
                "abstract": "©The Author(s) 2021. Published by Oxford University Press.Motivation: Cross-sample comparisons or large-scale meta-analyses based on the next generation sequencing (NGS) involve replicable and universal data preprocessing, including removing adapter fragments in contaminated reads (i.e. adapter trimming). While modern adapter trimmers require users to provide candidate adapter sequences for each sample, which are sometimes unavailable or falsely documented in the repositories (such as GEO or SRA), large-scale meta-analyses are therefore jeopardized by suboptimal adapter trimming. Results: Here we introduce a set of fast and accurate adapter detection and trimming algorithms that entail no a priori adapter sequences. These algorithms were implemented in modern Cþþ with SIMD and multithreading to accelerate its speed. Our experiments and benchmarks show that the implementation (i.e. EARRINGS), without being given any hint of adapter sequences, can reach comparable accuracy and higher throughput than that of existing adapter trimmers. EARRINGS is particularly useful in meta-analyses of a large batch of datasets and can be incorporated in any sequence analysis pipelines in all scales. Availability and implementation: EARRINGS is open-source software and is available at https://github.com/jhhung/ EARRINGS.",
                "authors": [
                    {
                        "name": "Huang C.-C."
                    },
                    {
                        "name": "Hung J.-H."
                    },
                    {
                        "name": "Wang T.-H."
                    }
                ],
                "date": "2021-07-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "EARRINGS: An efficient and accurate adapter trimmer entails no a priori adapter sequences"
            },
            "pmid": "33459339"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ]
}
