{
    "additionDate": "2022-08-15T14:17:37.015937Z",
    "biotoolsCURIE": "biotools:deephpi",
    "biotoolsID": "deephpi",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "rkaundal@usu.edu",
            "name": "Rakesh Kaundal",
            "typeEntity": "Person"
        }
    ],
    "description": "Adeep learning platform for accurate prediction and visualization of host-pathogen protein-protein interactions.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Network visualisation",
                    "uri": "http://edamontology.org/operation_3925"
                },
                {
                    "term": "Protein interaction prediction",
                    "uri": "http://edamontology.org/operation_2492"
                },
                {
                    "term": "Virulence prediction",
                    "uri": "http://edamontology.org/operation_3461"
                }
            ]
        }
    ],
    "homepage": "http://bioinfo.usu.edu/deepHPI/",
    "lastUpdate": "2022-08-15T14:17:37.018391Z",
    "license": "Not licensed",
    "name": "deepHPI",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1093/BIB/BBAC125",
            "metadata": {
                "abstract": "© The Author(s) 2022. Published by Oxford University Press. All rights reserved.Host-pathogen protein interactions (HPPIs) play vital roles in many biological processes and are directly involved in infectious diseases. With the outbreak of more frequent pandemics in the last couple of decades, such as the recent outburst of Covid-19 causing millions of deaths, it has become more critical to develop advanced methods to accurately predict pathogen interactions with their respective hosts. During the last decade, experimental methods to identify HPIs have been used to decipher host–pathogen systems with the caveat that those techniques are labor-intensive, expensive and time-consuming. Alternatively, accurate prediction of HPIs can be performed by the use of data-driven machine learning. To provide a more robust and accurate solution for the HPI prediction problem, we have developed a deepHPI tool based on deep learning. The web server delivers four host–pathogen model types: plant–pathogen, human–bacteria, human–virus and animal–pathogen, leveraging its operability to a wide range of analyses and cases of use. The deepHPI web tool is the first to use convolutional neural network models for HPI prediction. These models have been selected based on a comprehensive evaluation of protein features and neural network architectures. The best prediction models have been tested on independent validation datasets, which achieved an overall Matthews correlation coefficient value of 0.87 for animal–pathogen using the combined pseudo-amino acid composition and conjoint triad (PAAC_CT) features, 0.75 for human–bacteria using the combined pseudo-amino acid composition, conjoint triad and normalized Moreau-Broto feature (PAAC_CT_NMBroto), 0.96 for human–virus using PAAC_CT_NMBroto and 0.94 values for plant–pathogen interactions using the combined pseudo-amino acid composition, composition and transition feature (PAAC_CTDC_CTDT). Our server running deepHPI is deployed on a high-performance computing cluster that enables large and multiple user requests, and it provides more information about interactions discovered. It presents an enriched visualization of the resulting host–pathogen networks that is augmented with external links to various protein annotation resources. We believe that the deepHPI web server will be very useful to researchers, particularly those working on infectious diseases. Additionally, many novel and known host–pathogen systems can be further investigated to significantly advance our understanding of complex disease-causing agents. The developed models are established on a web server, which is freely accessible at http://bioinfo.usu.edu/deepHPI/.",
                "authors": [
                    {
                        "name": "Duhan N."
                    },
                    {
                        "name": "Flann N."
                    },
                    {
                        "name": "Kaundal R."
                    },
                    {
                        "name": "Loaiza C.D."
                    }
                ],
                "date": "2022-05-01T00:00:00Z",
                "journal": "Briefings in Bioinformatics",
                "title": "deepHPI: a comprehensive deep learning platform for accurate prediction and visualization of host–pathogen protein–protein interactions"
            },
            "pmid": "35511057"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Infectious disease",
            "uri": "http://edamontology.org/topic_3324"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Zoology",
            "uri": "http://edamontology.org/topic_3500"
        }
    ]
}
