{"credit":[{"email":"pfbaldi@ics.uci.edu","typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://www.igb.uci.edu/"},{"email":"cmagnan@ics.uci.edu","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"http://scratch.proteomics.ics.uci.edu/explanation.html#SSpro"}],"function":[{"operation":[{"term":"Accessible surface calculation","uri":"http://edamontology.org/operation_0384"},{"term":"Protein structure prediction","uri":"http://edamontology.org/operation_0474"}]}],"labels":{"operatingSystem":["Linux","Windows","Mac"],"toolType":["Command-line tool","Web application"],"topic":[{"term":"Protein secondary structure","uri":"http://edamontology.org/topic_3542"},{"term":"Structure prediction","uri":"http://edamontology.org/topic_0082"},{"term":"Sequence analysis","uri":"http://edamontology.org/topic_0080"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/sspro-accpro-4-03-protein-secondary-structure-solvent-accessibility-prediction-homology-analysis.html"}],"publication":[{"abstract":"© 2014 The Author.Motivation: Accurately predicting protein secondary structure and relative solvent accessibility is important for the study of protein evolution, structure and function and as a component of protein 3D structure prediction pipelines. Most predictors use a combination of machine learning and profiles, and thus must be retrained and assessed periodically as the number of available protein sequences and structures continues to grow.Results: We present newly trained modular versions of the SSpro and ACCpro predictors of secondary structure and relative solvent accessibility together with their multi-class variants SSpro8 and ACCpro20. We introduce a sharp distinction between the use of sequence similarity alone, typically in the form of sequence profiles at the input level, and the additional use of sequence-based structural similarity, which uses similarity to sequences in the Protein Data Bank to infer annotations at the output level, and study their relative contributions to modern predictors. Using sequence similarity alone, SSpro's accuracy is between 79 and 80% (79% for ACCpro) and no other predictor seems to exceed 82%. However, when sequence-based structural similarity is added, the accuracy of SSpro rises to 92.9% (90% for ACCpro). Thus, by combining both approaches, these problems appear now to be essentially solved, as an accuracy of 100% cannot be expected for several well-known reasons. These results point also to several open technical challenges, including (i) achieving on the order of ≥80% accuracy, without using any similarity with known proteins and (ii) achieving on the order of 85% accuracy, using sequence similarity alone.Availability and implementation: SSpro, SSpro8, ACCpro and ACCpro20 programs, data and web servers are available through the SCRATCH suite of protein structure predictors at http://scratch.proteomics.ics.uci.edu.","authors":["Magnan C.N.","Baldi P."],"cit_count":85,"journal":"Bioinformatics","pmid":"24860169","title":"SSpro/ACCpro 5: Almost perfect prediction of protein secondary structure and relative solvent accessibility using profiles, machine learning and structural similarity","year":"2014-01-01"}],"summary":{"biotoolsCURIE":"biotools:sspro","biotoolsID":"sspro","description":"The first hybrid approach of combining neural network (ab initio) and homology analysis to improve the prediction of secondary structure and solvent accessibility.","homepage":"http://scratch.proteomics.ics.uci.edu/","name":"SSpro"}}