{
    "additionDate": "2021-01-18T07:33:58Z",
    "biotoolsCURIE": "biotools:vdjview",
    "biotoolsID": "vdjview",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "luciani@unsw.edu.au",
            "name": "Fabio Luciani",
            "orcidid": "https://orcid.org/0000-0003-0666-6324",
            "typeEntity": "Person"
        }
    ],
    "description": "Exploring and analysing single cell multi-omics data with VDJView.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                },
                {
                    "term": "Sorting",
                    "uri": "http://edamontology.org/operation_3802"
                },
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://bitbucket.org/kirbyvisp/vdjview",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-03-11T10:25:08Z",
    "name": "VDJView",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1186/S12920-020-0696-Z",
            "metadata": {
                "abstract": "© 2020 The Author(s).Background: Single cell RNA sequencing provides unprecedented opportunity to simultaneously explore the transcriptomic and immune receptor diversity of T and B cells. However, there are limited tools available that simultaneously analyse large multi-omics datasets integrated with metadata such as patient and clinical information. Results: We developed VDJView, which permits the simultaneous or independent analysis and visualisation of gene expression, immune receptors, and clinical metadata of both T and B cells. This tool is implemented as an easy-to-use R shiny web-application, which integrates numerous gene expression and TCR analysis tools, and accepts data from plate-based sorted or high-throughput single cell platforms. We utilised VDJView to analyse several 10X scRNA-seq datasets, including a recent dataset of 150,000 CD8+ T cells with available gene expression, TCR sequences, quantification of 15 surface proteins, and 44 antigen specificities (across viruses, cancer, and self-antigens). We performed quality control, filtering of tetramer non-specific cells, clustering, random sampling and hypothesis testing to discover antigen specific gene signatures which were associated with immune cell differentiation states and clonal expansion across the pathogen specific T cells. We also analysed 563 single cells (plate-based sorted) obtained from 11 subjects, revealing clonally expanded T and B cells across primary cancer tissues and metastatic lymph-node. These immune cells clustered with distinct gene signatures according to the breast cancer molecular subtype. VDJView has been tested in lab meetings and peer-to-peer discussions, showing effective data generation and discussion without the need to consult bioinformaticians. Conclusions: VDJView enables researchers without profound bioinformatics skills to analyse immune scRNA-seq data, integrating and visualising this with clonality and metadata profiles, thus accelerating the process of hypothesis testing, data interpretation and discovery of cellular heterogeneity. VDJView is freely available at https://bitbucket.org/kirbyvisp/vdjview.",
                "authors": [
                    {
                        "name": "Samir J."
                    },
                    {
                        "name": "Rizzetto S."
                    },
                    {
                        "name": "Gupta M."
                    },
                    {
                        "name": "Luciani F."
                    }
                ],
                "citationCount": 1,
                "date": "2020-02-18T00:00:00Z",
                "journal": "BMC Medical Genomics",
                "title": "Exploring and analysing single cell multi-omics data with VDJView"
            },
            "pmcid": "PMC7029546",
            "pmid": "32070336"
        }
    ],
    "topic": [
        {
            "term": "Immunoproteins and antigens",
            "uri": "http://edamontology.org/topic_2830"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        },
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        }
    ]
}