
{
    "credit": [
        {
            "email": "webmaster@ms-utils.org",
            "typeEntity": "Person",
            "typeRoles": [
                "Documentor"
            ],
            "url": "http://ms-utils.org"
        }
    ],
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Data",
                        "uri": "http://edamontology.org/data_0006"
                    },
                    "format": [
                        {
                            "term": "XML",
                            "uri": "http://edamontology.org/format_2332"
                        },
                        {
                            "term": "Mascot .dat file",
                            "uri": "http://edamontology.org/format_3713"
                        },
                        {
                            "term": "X!Tandem XML",
                            "uri": "http://edamontology.org/format_3711"
                        }
                    ]
                }
            ],
            "operation": [
                {
                    "term": "Peptide identification",
                    "uri": "http://edamontology.org/operation_3631"
                }
            ]
        }
    ],
    "labels": {
        "collectionID": [
            "ms-utils",
            "Proteomics"
        ],
        "language": [
            "Java"
        ],
        "operatingSystem": [
            "Linux"
        ],
        "toolType": [
            "Command-line tool",
            "Desktop application"
        ],
        "topic": [
            {
                "term": "Proteomics",
                "uri": "http://edamontology.org/topic_0121"
            },
            {
                "term": "Proteomics experiment",
                "uri": "http://edamontology.org/topic_3520"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://ms-utils.org"
        }
    ],
    "publication": [
        {
            "abstract": "© 2017 Badalato et al. T. Lignocellulosic materials from municipal solid waste emerge as attractive resources for anaerobic digestion biorefinery. To increase the knowledge required for establishing efficient bioprocesses, dynamics of batch fermentation by the cellulolytic bacterium Ruminiclostridium cellulolyticum were compared using three cellulosic materials, paper handkerchief, cotton discs and Whatman filter paper. Fermentation of paper handkerchief occurred the fastest and resulted in a specific metabolic profile: it resulted in the lowest acetate-to-lactate and acetate-to-ethanol ratios. By shotgun proteomic analyses of paper handkerchief and Whatman paper incubations, 151 proteins with significantly different levels were detected, including 20 of the 65 cellulosomal components, 8 non-cellulosomal CAZymes and 44 distinct extracytoplasmic proteins. Consistent with the specific metabolic profile observed, many enzymes from the central carbon catabolic pathways had higher levels in paper handkerchief incubations. Among the quantified CAZymes and cellulosomal components, 10 endoglucanases mainly from the GH9 families and 7 other cellulosomal subunits had lower levels in paper handkerchief incubations. An in-depth characterization of the materials used showed that the lower levels of endoglucanases in paper handkerchief incubations could hypothetically result from its lower crystallinity index (50%) and degree of polymerization (970). By contrast, the higher hemicellulose rate in paper handkerchief (13.87%) did not result in the enhanced expression of enzyme with xylanase as primary activity, including enzymes from the \"xyl-doc \" cluster. It suggests the absence, in this material, of molecular structures that specifically lead to xylanase induction. The integrated approach developed in this work shows that subtle differences among cellulosic materials regarding chemical and structural characteristics have significant effects on expressed bacterial functions, in particular the cellulolysis machinery, resulting in different metabolic patterns and degradation dynamics.",
            "authors": [
                "Badalato N.",
                "Guillot A.",
                "Sabarly V.",
                "Dubois M.",
                "Pourette N.",
                "Pontoire B.",
                "Robert P.",
                "Bridier A.",
                "Monnet V.",
                "Sousa D.Z.",
                "Durand S.",
                "Mazeas L.",
                "Buleon A.",
                "Bouchez T.",
                "Mortha G.",
                "Bize A."
            ],
            "cit_count": 1,
            "doi": "10.1371/journal.pone.0170524",
            "journal": "PLoS ONE",
            "title": "Whole proteome analyses on Ruminiclostridium cellulolyticum show a modulation of the cellulolysis machinery in response to cellulosic materials with subtle differences in chemical and structural properties",
            "year": "2017-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:pappso",
        "biotoolsID": "pappso",
        "description": "Southwest Paris proteomic analysis platform.",
        "homepage": "http://pappso.inra.fr/bioinfo/",
        "name": "PAPPSO"
    }
}