{
    "additionDate": "2016-04-04T14:47:05Z",
    "biotoolsCURIE": "biotools:aspicdb",
    "biotoolsID": "aspicdb",
    "collectionID": [
        "DRCAT",
        "ELIXIR-ITA-CNR"
    ],
    "cost": "Free of charge",
    "credit": [
        {
            "email": "graziano.pesole@uniba.it",
            "name": "Graziano Pesole",
            "orcidid": "https://orcid.org/0000-0003-3663-0859",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "name": "IBBE-CNR, Bari"
        },
        {
            "name": "DRCAT",
            "typeEntity": "Project",
            "typeRole": [
                "Documentor"
            ]
        },
        {
            "name": "ELIXIR-ITA-CNR",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        }
    ],
    "description": "Database designed to provide access to reliable annotations of the alternative splicing pattern of human genes, obtained by ASPic algorithm and Pintron algorithm, and to the functional annotation of predicted isoforms.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://srv00.recas.ba.infn.it/ASPicDB/help.php"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Gene symbol",
                        "uri": "http://edamontology.org/data_1026"
                    }
                },
                {
                    "data": {
                        "term": "Keyword",
                        "uri": "http://edamontology.org/data_0968"
                    }
                },
                {
                    "data": {
                        "term": "Ontology",
                        "uri": "http://edamontology.org/data_0582"
                    }
                }
            ],
            "operation": [
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Gene transcript report",
                        "uri": "http://edamontology.org/data_3134"
                    },
                    "format": [
                        {
                            "term": "HTML",
                            "uri": "http://edamontology.org/format_2331"
                        }
                    ]
                }
            ]
        },
        {
            "input": [
                {
                    "data": {
                        "term": "Gene symbol",
                        "uri": "http://edamontology.org/data_1026"
                    }
                },
                {
                    "data": {
                        "term": "Keyword",
                        "uri": "http://edamontology.org/data_0968"
                    }
                },
                {
                    "data": {
                        "term": "Ontology",
                        "uri": "http://edamontology.org/data_0582"
                    }
                }
            ],
            "operation": [
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Protein report",
                        "uri": "http://edamontology.org/data_0896"
                    },
                    "format": [
                        {
                            "term": "HTML",
                            "uri": "http://edamontology.org/format_2331"
                        }
                    ]
                }
            ]
        }
    ],
    "homepage": "http://srv00.recas.ba.infn.it/ASPicDB/",
    "lastUpdate": "2019-01-15T03:11:25Z",
    "maturity": "Mature",
    "name": "Alternative splicing prediction database (ASPICdb)",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "ELIXIR-ITA-CNR",
    "publication": [
        {
            "doi": "10.1093/nar/gkl324",
            "metadata": {
                "abstract": "Alternative splicing (AS) is now emerging as a major mechanism contributing to the expansion of the transcriptome and proteome complexity of multicellular organisms. The fact that a single gene locus may give rise to multiple mRNAs and protein isoforms, showing both major and subtle structural variations, is an exceptionally versatile tool in the optimization of the coding capacity of the eukaryotic genome. The huge and continuously increasing number of genome and transcript sequences provides an essential information source for the computational detection of genes AS pattern. However, much of this information is not optimally or comprehensively used in gene annotation by current genome annotation pipelines. We present here a web resource implementing the ASPIC algorithm which we developed previously for the investigation of AS of user submitted genes, based on comparative analysis of available transcript and genome data from a variety of species. The ASPIC web resource provides graphical and tabular views of the splicing patterns of all full-length mRNA isoforms compatible with the detected splice sites of genes under investigation as well as relevant structural and functional annotation. The ASPIC web resource - available at http://www.caspur.it/ASPIC/ - is dynamically interconnected with the Ensembl and Unigene databases and also implements an upload facility. © The Author 2006. Published by Oxford University Press. All rights reserved.",
                "authors": [
                    {
                        "name": "Anselmo A."
                    },
                    {
                        "name": "Bonizzoni P."
                    },
                    {
                        "name": "Castrignano T."
                    },
                    {
                        "name": "De Meo P.D."
                    },
                    {
                        "name": "Pesole G."
                    },
                    {
                        "name": "Rizzi R."
                    },
                    {
                        "name": "Talamo I.V."
                    }
                ],
                "citationCount": 22,
                "date": "2006-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "ASPIC: A web resource for alternative splicing prediction and transcript isoforms characterization"
            },
            "pmcid": "PMC1538898",
            "pmid": "16845044",
            "type": [
                "Primary"
            ]
        },
        {
            "doi": "10.1186/1471-2105-13-S5-S2",
            "metadata": {
                "abstract": "© 2012.Background: A challenging issue in designing computational methods for predicting the gene structure into exons and introns from a cluster of transcript (EST, mRNA) sequences, is guaranteeing accuracy as well as efficiency in time and space, when large clusters of more than 20,000 ESTs and genes longer than 1 Mb are processed. Traditionally, the problem has been faced by combining different tools, not specifically designed for this task. Results: We propose a fast method based on ad hoc procedures for solving the problem. Our method combines two ideas: a novel algorithm of proved small time complexity for computing spliced alignments of a transcript against a genome, and an efficient algorithm that exploits the inherent redundancy of information in a cluster of transcripts to select, among all possible factorizations of EST sequences, those allowing to infer splice site junctions that are largely confirmed by the input data. The EST alignment procedure is based on the construction of maximal embeddings, that are sequences obtained from paths of a graph structure, called embedding graph, whose vertices are the maximal pairings of a genomic sequence T and an EST P. The procedure runs in time linear in the length of P and T and in the size of the output. The method was implemented into the PIntron package. PIntron requires as input a genomic sequence or region and a set of EST and/or mRNA sequences. Besides the prediction of the full-length transcript isoforms potentially expressed by the gene, the PIntron package includes a module for the CDS annotation of the predicted transcripts. Conclusions: PIntron, the software tool implementing our methodology, is available at http://www.algolab.eu/PIntron under GNU AGPL. PIntron has been shown to outperform state-of-the-art methods, and to quickly process some critical genes. At the same time, PIntron exhibits high accuracy (sensitivity and specificity) when benchmarked with ENCODE annotations.",
                "authors": [
                    {
                        "name": "Bonizzoni P."
                    },
                    {
                        "name": "Pesole G."
                    },
                    {
                        "name": "Picardi E."
                    },
                    {
                        "name": "Pirola Y."
                    },
                    {
                        "name": "Rizzi R."
                    },
                    {
                        "name": "Vedova G.D."
                    }
                ],
                "citationCount": 7,
                "date": "2012-01-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "PIntron: A fast method for detecting the gene structure due to alternative splicing via maximal pairings of a pattern and a text"
            },
            "pmcid": "PMC3358663",
            "pmid": "22537006",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Gene structure",
            "uri": "http://edamontology.org/topic_0114"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "RNA splicing",
            "uri": "http://edamontology.org/topic_3320"
        }
    ],
    "validated": 1
}
