{
    "additionDate": "2018-05-22T16:31:09Z",
    "biotoolsCURIE": "biotools:chsalign",
    "biotoolsID": "chsalign",
    "credit": [
        {
            "email": "wangj@njit.edu",
            "name": "Jason T.L. Wang",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Web Server That Builds upon Junction-Explorer and RNAJAG for Pairwise Alignment of RNA Secondary Structures with Coaxial Helical Stacking.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://nature.njit.edu/biosoft/CHSalign/examples.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Pairwise sequence alignment",
                    "uri": "http://edamontology.org/operation_0491"
                },
                {
                    "term": "RNA secondary structure prediction",
                    "uri": "http://edamontology.org/operation_0278"
                }
            ]
        }
    ],
    "homepage": "http://nature.njit.edu/biosoft/CHSalign/",
    "lastUpdate": "2018-12-10T12:58:58Z",
    "name": "CHSalign",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PONE.0147097",
            "metadata": {
                "abstract": "© 2016 Hua et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.RNA junctions are important structural elements of RNA molecules. They are formed when three or more helices come together in three-dimensional space. Recent studies have focused on the annotation and prediction of coaxial helical stacking (CHS) motifs within junctions. Here we exploit such predictions to develop an efficient alignment tool to handle RNA secondary structures with CHS motifs. Specifically, we build upon our Junction- Explorer software for predicting coaxial stacking and RNAJAG for modelling junction topologies as tree graphs to incorporate constrained tree matching and dynamic programming algorithms into a new method, called CHSalign, for aligning the secondary structures of RNA molecules containing CHS motifs. Thus, CHSalign is intended to be an efficient alignment tool for RNAs containing similar junctions. Experimental results based on thousands of alignments demonstrate that CHSalign can align two RNA secondary structures containing CHS motifs more accurately than other RNA secondary structure alignment tools. CHSalign yields a high score when aligning two RNA secondary structures with similar CHS motifs or helical arrangement patterns, and a low score otherwise. This new method has been implemented in a web server, and the program is also made freely available, at http://bioinformatics.njit.edu/CHSalign/.",
                "authors": [
                    {
                        "name": "Hua L."
                    },
                    {
                        "name": "Song Y."
                    },
                    {
                        "name": "Kim N."
                    },
                    {
                        "name": "Laing C."
                    },
                    {
                        "name": "Wang J.T.L."
                    },
                    {
                        "name": "Schlick T."
                    }
                ],
                "citationCount": 5,
                "date": "2016-01-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "CHSalign: A Web Server That Builds upon Junction-Explorer and RNAJAG for Pairwise Alignment of RNA Secondary Structures with Coaxial Helical Stacking"
            },
            "pmcid": "PMC4720362",
            "pmid": "26789998"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Nucleic acid structure analysis",
            "uri": "http://edamontology.org/topic_0097"
        },
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        },
        {
            "term": "Nucleic acid sites, features and motifs",
            "uri": "http://edamontology.org/topic_3511"
        }
    ],
    "validated": 1
}