{
    "additionDate": "2020-01-09T18:22:34Z",
    "biotoolsCURIE": "biotools:gsc",
    "biotoolsID": "gsc",
    "confidence_flag": "tool",
    "description": "An Online Calculator for the Prediction of Survival in Glioblastoma Patients Using Classical Statistics and Machine Learning.\n\nBACKGROUND:Although survival statistics in patients with glioblastoma multiforme (GBM) are well-defined at the group level, predicting individual patient survival remains challenging because of significant variation within strata. OBJECTIVE:To compare statistical and machine learning algorithms in their ability to predict survival in GBM patients and deploy the best performing model as an online survival calculator. METHODS:Patients undergoing an operation for a histopathologically confirmed GBM were extracted from the Surveillance Epidemiology and End Results (SEER) database (2005-2015) and split into a training and hold-out test set in an 80 20 ratio",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Post-translation modification site prediction",
                    "uri": "http://edamontology.org/operation_0417"
                },
                {
                    "term": "Incident curve plotting",
                    "uri": "http://edamontology.org/operation_3503"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "https://cnoc-bwh.shinyapps.io/gbmsurvivalpredictor/",
    "language": [
        "R"
    ],
    "lastUpdate": "2020-12-02T19:40:51Z",
    "name": "GSC",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1093/NEUROS/NYZ403",
            "metadata": {
                "abstract": "© 2019 by the Congress of Neurological Surgeons.Although survival statistics in patients with glioblastoma multiforme (GBM) are well-defined at the group level, predicting individual patient survival remains challenging because of significant variation within strata. OBJECTIVE: To compare statistical and machine learning algorithms in their ability to predict survival in GBM patients and deploy the best performing model as an online survival calculator. METHODS: Patients undergoing an operation for a histopathologically confirmed GBM were extracted from the Surveillance Epidemiology and End Results (SEER) database (2005-2015) and split into a training and hold-out test set in an 80/20 ratio. Fifteen statistical and machine learning algorithms were trained based on 13 demographic, socioeconomic, clinical, and radiographic features to predict overall survival, 1-yr survival status, and compute personalized survival curves. RESULTS: In total, 20 821 patients met our inclusion criteria. The accelerated failure time model demonstrated superior performance in terms of discrimination (concordance index = 0.70), calibration, interpretability, predictive applicability, and computational efficiency compared to Cox proportional hazards regression and other machine learning algorithms. This model was deployed through a free, publicly available software interface (https://cnoc-bwh.shinyapps.io/gbmsurvivalpredictor/). CONCLUSION: The development and deployment of survival prediction tools require a multimodal assessment rather than a single metric comparison. This study provides a framework for the development of prediction tools in cancer patients, as well as an online survival calculator for patients with GBM. Future efforts should improve the interpretability, predictive applicability, and computational efficiency of existing machine learning algorithms, increase the granularity of population-based registries, and externally validate the proposed prediction tool.",
                "authors": [
                    {
                        "name": "Senders J.T."
                    },
                    {
                        "name": "Staples P."
                    },
                    {
                        "name": "Mehrtash A."
                    },
                    {
                        "name": "Cote D.J."
                    },
                    {
                        "name": "Taphoorn M.J.B."
                    },
                    {
                        "name": "Reardon D.A."
                    },
                    {
                        "name": "Gormley W.B."
                    },
                    {
                        "name": "Smith T.R."
                    },
                    {
                        "name": "Broekman M.L."
                    },
                    {
                        "name": "Arnaout O."
                    }
                ],
                "citationCount": 6,
                "date": "2020-02-01T00:00:00Z",
                "journal": "Clinical Neurosurgery",
                "title": "An Online Calculator for the Prediction of Survival in Glioblastoma Patients Using Classical Statistics and Machine Learning"
            },
            "pmid": "31586211"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Public health and epidemiology",
            "uri": "http://edamontology.org/topic_3305"
        },
        {
            "term": "Surgery",
            "uri": "http://edamontology.org/topic_3421"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ],
    "validated": 1
}