{
    "additionDate": "2021-01-18T11:24:44Z",
    "biotoolsCURIE": "biotools:ncmhap",
    "biotoolsID": "ncmhap",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "khanteymoori@gmail.com",
            "name": "Alireza Khanteymoori",
            "typeEntity": "Person"
        }
    ],
    "description": "A novel method for haplotype reconstruction based on Neutrosophic c-means clustering.\n\nThis code is related to our recently proposed method called NCMHap. This method can solve single individual haplotype problem for diploid organisms.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Haplotype mapping",
                    "uri": "http://edamontology.org/operation_0487"
                },
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Fatemeh-Zamani/NCMHap",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2021-03-08T09:46:39Z",
    "name": "NCMHap",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1186/S12859-020-03775-0",
            "metadata": {
                "abstract": "© 2020, The Author(s).Background: Single individual haplotype problem refers to reconstructing haplotypes of an individual based on several input fragments sequenced from a specified chromosome. Solving this problem is an important task in computational biology and has many applications in the pharmaceutical industry, clinical decision-making, and genetic diseases. It is known that solving the problem is NP-hard. Although several methods have been proposed to solve the problem, it is found that most of them have low performances in dealing with noisy input fragments. Therefore, proposing a method which is accurate and scalable, is a challenging task. Results: In this paper, we introduced a method, named NCMHap, which utilizes the Neutrosophic c-means (NCM) clustering algorithm. The NCM algorithm can effectively detect the noise and outliers in the input data. In addition, it can reduce their effects in the clustering process. The proposed method has been evaluated by several benchmark datasets. Comparing with existing methods indicates when NCM is tuned by suitable parameters, the results are encouraging. In particular, when the amount of noise increases, it outperforms the comparing methods. Conclusion: The proposed method is validated using simulated and real datasets. The achieved results recommend the application of NCMHap on the datasets which involve the fragments with a huge amount of gaps and noise.",
                "authors": [
                    {
                        "name": "Zamani F."
                    },
                    {
                        "name": "Olyaee M.H."
                    },
                    {
                        "name": "Khanteymoori A."
                    }
                ],
                "date": "2020-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "NCMHap: a novel method for haplotype reconstruction based on Neutrosophic c-means clustering"
            },
            "pmcid": "PMC7579908",
            "pmid": "33092523"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Bioinformatics",
            "uri": "http://edamontology.org/topic_0091"
        }
    ]
}