{
    "additionDate": "2021-01-18T07:38:23Z",
    "biotoolsCURIE": "biotools:ddapred",
    "biotoolsID": "ddapred",
    "confidence_flag": "tool",
    "credit": [
        {
            "name": "Renxiang Yan",
            "typeEntity": "Person"
        }
    ],
    "description": "DDAPRED is a computational method for predicting drug repositioning using regularized logistic matrix factorization",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Fold recognition",
                    "uri": "http://edamontology.org/operation_0303"
                },
                {
                    "term": "Promoter prediction",
                    "uri": "http://edamontology.org/operation_0440"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "https://github.com/nongdaxiaofeng/DDAPRED",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-02-22T16:02:55Z",
    "name": "DDAPRED",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1007/S00894-020-4315-X",
            "metadata": {
                "abstract": "© 2020, Springer-Verlag GmbH Germany, part of Springer Nature.Due to rising development costs and stagnant product outputs of traditional drug discovery methods, drug repositioning, which discovers new indications for existing drugs, has attracted increasing interest. Computational drug repositioning can integrate prioritization information and accelerate time lines even further. However, most existing methods for predicting drug repositioning have low precisions. The present article proposed a new method named DDAPRED (https://github.com/nongdaxiaofeng/DDAPRED) for drug repositioning prediction. The method integrated multiple sources of drug similarity and disease similarity information, and it used the regularized logistic matrix decomposition method to significantly improve the prediction performance. In 5-fold cross-validation, the areas under the receiver operating characteristic curve (AUROC) and the precision-recall curve (AUPRC) of DDAPRED reached 0.932 and 0.438, respectively, exceeding other methods. The present study also analyzed the parameters influencing the model performance and the effect of different drug similarity information in-depth, and it verified the treatment relationship of the top 50 predictions with unknown relationships in the training set, further demonstrating the practicability of our method.",
                "authors": [
                    {
                        "name": "Wang X."
                    },
                    {
                        "name": "Yan R."
                    }
                ],
                "date": "2020-03-01T00:00:00Z",
                "journal": "Journal of Molecular Modeling",
                "title": "DDAPRED: a computational method for predicting drug repositioning using regularized logistic matrix factorization"
            },
            "pmid": "32062701"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Drug development",
            "uri": "http://edamontology.org/topic_3373"
        },
        {
            "term": "Drug discovery",
            "uri": "http://edamontology.org/topic_3336"
        },
        {
            "term": "Safety sciences",
            "uri": "http://edamontology.org/topic_3377"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
