{
    "additionDate": "2021-01-18T07:37:06Z",
    "biotoolsCURIE": "biotools:lemarns",
    "biotoolsID": "lemarns",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "michael.spence@cefas.co.uk",
            "name": "Michael A. Spence",
            "orcidid": "https://orcid.org/0000-0002-1682-0041",
            "typeEntity": "Person"
        }
    ],
    "description": "A Length-based Multi-species analysis by numerical simulation in R.\n\nLength-Based Multispecies Analysis by Numerical Simulation.\n\nSet up, run and explore the outputs of the Length-based Multi-species model (LeMans; Hall et al. 2006 <doi:10.1139/f06-039>), focused on the marine environment.\n\nLeMaRns is an R package to set up, run and explore the outputs of the Length-based Multi-species model LeMans, focused on the marine environment.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Simulation analysis",
                    "uri": "http://edamontology.org/operation_0244"
                },
                {
                    "term": "Ecological modelling",
                    "uri": "http://edamontology.org/operation_3946"
                }
            ]
        }
    ],
    "homepage": "https://cran.r-project.org/web/packages/LeMaRns/index.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-02-12T11:33:12Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/CefasRepRes/LeMaRns"
        }
    ],
    "name": "LeMaRns",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PONE.0227767",
            "metadata": {
                "abstract": "© 2020 Spence et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Fish stocks interact through predation and competition for resources, yet stocks are typically managed independently on a stock-by-stock basis. The need to take account of multispecies interactions is widely acknowledged. However, examples of the application of multi-species models to support management decisions are limited as they are often seen as too complex and lacking transparency. Thus there is a need for simple and transparent methods to address stock interactions in a way that supports managers. Here we introduce LeMaRns, a new R-package of a general length-structured fish community model, LeMans, that characterises fishing using fleets that can have different gears and species catch preferences. We describe the model, package implementation, and give three examples of use: determination of multi-species reference points; modelling of mixed-fishery interactions; and examination of the response of community indicators to dynamical changes in fleet effort within a mixed-fishery. LeMaRns offers a diverse array of options for parameterisation. This, along with the speed, comprehensive documentation, and open source nature of the package makes LeMans newly accessible, transparent, and easy to use, which we hope will lead to increased uptake by the fisheries management community.",
                "authors": [
                    {
                        "name": "Spence M.A."
                    },
                    {
                        "name": "Bannister H.J."
                    },
                    {
                        "name": "Ball J.E."
                    },
                    {
                        "name": "Dolder P.J."
                    },
                    {
                        "name": "Griffiths C.A."
                    },
                    {
                        "name": "Thorpe R.B."
                    }
                ],
                "citationCount": 1,
                "date": "2020-02-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "Lemarns: A Length-based Multi-species analysis by numerical simulation in R"
            },
            "pmcid": "PMC6996808",
            "pmid": "32012167"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Database management",
            "uri": "http://edamontology.org/topic_3489"
        },
        {
            "term": "Zoology",
            "uri": "http://edamontology.org/topic_3500"
        }
    ]
}