{
    "name": "CNSsolve", 
    "description": "CNSsolve (Crystallography & NMR System or CNS) is an X-ray crystallography suite used for refinement, phasing, and molecular replacement", 
    "homepage": "http://cns-online.org", 
    "biotoolsID": "cnssolve", 
    "biotoolsCURIE": "biotools:cnssolve", 
    "version": [
        "1.3"
    ], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_3454", 
                    "term": "Phasing"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }, 
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_3455", 
                    "term": "Molecular replacement"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Command-line tool"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_0593", 
            "term": "NMR"
        }, 
        {
            "uri": "http://edamontology.org/topic_2275", 
            "term": "Molecular modelling"
        }, 
        {
            "uri": "http://edamontology.org/topic_2828", 
            "term": "Crystallography"
        }, 
        {
            "uri": "http://edamontology.org/topic_2828", 
            "term": "X-ray crystallography"
        }
    ], 
    "operatingSystem": [
        "Linux", 
        "Mac"
    ], 
    "language": [
        "Fortran", 
        "C"
    ], 
    "license": null, 
    "collectionID": [], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [
        {
            "url": "http://www.mybiosoftware.com/cnssolve-1-3-x-ray-crystallography-suite.html", 
            "type": "Registry", 
            "note": null
        }
    ], 
    "download": [], 
    "documentation": [
        {
            "url": "http://cns-online.org/v1.3/", 
            "type": "General", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": null, 
            "pmid": "9757107", 
            "pmcid": null, 
            "type": "Primary", 
            "version": null, 
            "metadata": {
                "title": "Crystallography & NMR system: A new software suite for macromolecular structure determination", 
                "abstract": "A new software suite, called Crystallography & NMR System (CNS), has been developed for macromolecular structure determination by X-ray crystallography or solution nuclear magnetic resonance (NMR) spectroscopy. In contrast to existing structure-determination programs the architecture of CNS is highly flexible, allowing for extension to other structure-determination methods, such as electron microscopy and solid-state NMR spectroscopy. CNS has a hierarchical structure: a high-level hypertext markup language (HTML) user interface, task-oriented user input files, module files, a symbolic structure-determination language (CNS language), and low-level source code. Each layer is accessible to the user. The novice user may just use the HTML interface, while the more advanced user may use any of the other layers. The source code will be distributed, thus source-code modification is possible. The CNS language is sufficiently powerful and flexible that many new algorithms can be easily implemented in the CNS language without changes to the source code. The CNS language allows the user to perform operations on data structures, such as structure factors, electron-density maps, and atomic properties. The power of the CNS language has been demonstrated by the implementation of a comprehensive set of crystallographic procedures for phasing, density modification and refinement. User-friendly task-oriented input files are available for nearly all aspects of macromolecular structure determination by X-ray crystallography and solution NMR. © 1998 International Union of Crystallography all rights reserved.", 
                "date": "1998-09-01T00:00:00Z", 
                "citationCount": 16447, 
                "authors": [
                    {
                        "name": "Brunger A.T."
                    }, 
                    {
                        "name": "Adams P.D."
                    }, 
                    {
                        "name": "Clore G.M."
                    }, 
                    {
                        "name": "Delano W.L."
                    }, 
                    {
                        "name": "Gros P."
                    }, 
                    {
                        "name": "Grossekunstleve R.W."
                    }, 
                    {
                        "name": "Jiang J.S."
                    }, 
                    {
                        "name": "Kuszewski J."
                    }, 
                    {
                        "name": "Nilges M."
                    }, 
                    {
                        "name": "Pannu N.S."
                    }, 
                    {
                        "name": "Read R.J."
                    }, 
                    {
                        "name": "Rice L.M."
                    }, 
                    {
                        "name": "Simonson T."
                    }, 
                    {
                        "name": "Warren G.L."
                    }
                ], 
                "journal": "Acta Crystallographica Section D: Biological Crystallography"
            }
        }, 
        {
            "doi": "10.1038/nprot.2007.406", 
            "pmid": null, 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "Version 1.2 of the crystallography and nmr system", 
                "abstract": "Version 1.2 of the software system, termed Crystallography and NMR system (CNS), for crystallographic and NMR structure determination has been released. Since its first release, the goals of CNS have been (i) to create a flexible computational framework for exploration of new approaches to structure determination, (ii) to provide tools for structure solution of difficult or large structures, (iii) to develop models for analyzing structural and dynamical properties of macromolecules and (iv) to integrate all sources of information into all stages of the structure determination process. Version 1.2 includes an improved model for the treatment of disordered solvent for crystallographic refinement that employs a combined grid search and least-squares optimization of the bulk solvent model parameters. The method is more robust than previous implementations, especially at lower resolution, generally resulting in lower R values. Other advances include the ability to apply thermal factor sharpening to electron density maps. Consistent with the modular design of CNS, these additions and changes were implemented in the high-level computing language of CNS. © 2007 Nature Publishing Group.", 
                "date": "2007-11-15T00:00:00Z", 
                "citationCount": 886, 
                "authors": [
                    {
                        "name": "Brunger A.T."
                    }
                ], 
                "journal": "Nature Protocols"
            }
        }
    ], 
    "credit": [
        {
            "name": "Axel Brunger", 
            "email": null, 
            "url": null, 
            "orcidid": "http://orcid.org/0000-0001-5121-2036", 
            "typeEntity": null, 
            "typeRole": [], 
            "note": null
        }, 
        {
            "name": null, 
            "email": null, 
            "url": "http://cns-online.org/v1.3/", 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "mbs_import", 
    "additionDate": "2017-12-18T00:04:45Z", 
    "lastUpdate": "2018-12-10T13:32:34Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 1, 
    "homepage_status": 0, 
    "elixir_badge": 0
}