{
    "additionDate": "2021-01-18T07:41:06Z",
    "biotoolsCURIE": "biotools:clrs",
    "biotoolsID": "clrs",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "kingtaochao@csu.edu.cn",
            "name": "Chao Tao",
            "typeEntity": "Person"
        }
    ],
    "description": "Continual Learning Benchmark for Remote Sensing Image Scene Classification.\n\nThis is a database designed for the new task named Continual/Lifelong learning for remote sensing image scene classification. The existing remote sensing image scene classification datasets use static benchmarks and lack the standard to divide the datasets into several sequential learning training batches, which largely limits the development of Continual/Lifelong learning in remote sensing image scene classification.\n\nThe proposed CLRS data set consists of 15,000 remote sensing images divided into 25 scene classes, namely, airport, bare-land, beach, bridge, commercial, desert, farmland, forest, golf-course, highway, industrial, meadow, mountain, overpass, park, parking, playground, port, railway, railway-station, residential, river, runway, stadium, and storage-tank. Each class has 600 images, and the image size is 256x256. The resolution of the images ranges from 0.26 m to 8.85 m.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Image annotation",
                    "uri": "http://edamontology.org/operation_3553"
                },
                {
                    "term": "Splitting",
                    "uri": "http://edamontology.org/operation_3359"
                }
            ]
        }
    ],
    "homepage": "https://github.com/lehaifeng/CLRS",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-02-12T16:06:49Z",
    "name": "CLRS",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.3390/S20041226",
            "metadata": {
                "abstract": "© 2020 by the authors. Licensee MDPI, Basel, Switzerland.Remote sensing image scene classification has a high application value in the agricultural, military, as well as other fields. A large amount of remote sensing data is obtained every day. After learning the new batch data, scene classification algorithms based on deep learning face the problem of catastrophic forgetting, that is, they cannot maintain the performance of the old batch data. Therefore, it has become more and more important to ensure that the scene classification model has the ability of continual learning, that is, to learn new batch data without forgetting the performance of the old batch data. However, the existing remote sensing image scene classification datasets all use static benchmarks and lack the standard to divide the datasets into a number of sequential learning training batches, which largely limits the development of continual learning in remote sensing image scene classification. First, this study gives the criteria for training batches that have been partitioned into three continual learning scenarios, and proposes a large-scale remote sensing image scene classification database called the Continual Learning Benchmark for Remote Sensing (CLRS). The goal of CLRS is to help develop state-of-the-art continual learning algorithms in the field of remote sensing image scene classification. In addition, in this paper, a new method of constructing a large-scale remote sensing image classification database based on the target detection pretrained model is proposed, which can effectively reduce manual annotations. Finally, several mainstream continual learning methods are tested and analyzed under three continual learning scenarios, and the results can be used as a baseline for future work.",
                "authors": [
                    {
                        "name": "Li H."
                    },
                    {
                        "name": "Jiang H."
                    },
                    {
                        "name": "Gu X."
                    },
                    {
                        "name": "Peng J."
                    },
                    {
                        "name": "Li W."
                    },
                    {
                        "name": "Hong L."
                    },
                    {
                        "name": "Tao C."
                    }
                ],
                "citationCount": 3,
                "date": "2020-02-02T00:00:00Z",
                "journal": "Sensors (Switzerland)",
                "title": "CLRS: Continual learning benchmark for remote sensing image scene classification"
            },
            "pmcid": "PMC7070946",
            "pmid": "32102294"
        }
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Agricultural science",
            "uri": "http://edamontology.org/topic_3810"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        }
    ]
}