{
    "accessibility": "Open access",
    "additionDate": "2022-01-28T22:37:46.655233Z",
    "biotoolsCURIE": "biotools:shap",
    "biotoolsID": "shap",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "smusz@if-pan.krakow.pl",
            "name": "Sabina Podlewska",
            "orcidid": "https://orcid.org/0000-0002-2891-5603",
            "typeEntity": "Person"
        },
        {
            "name": "Agnieszka Wojtuch",
            "orcidid": "https://orcid.org/0000-0002-3112-2049"
        },
        {
            "name": "Rafał Jankowski",
            "orcidid": "https://orcid.org/0000-0003-4563-9230"
        }
    ],
    "description": "Evaluation of structural contributions to metabolic stability predictions with the use of SHAP values",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "SMILES string",
                        "uri": "http://edamontology.org/data_2301"
                    },
                    "format": [
                        {
                            "term": "Textual format",
                            "uri": "http://edamontology.org/format_2330"
                        }
                    ]
                }
            ],
            "operation": [
                {
                    "term": "Small molecule design",
                    "uri": "http://edamontology.org/operation_4009"
                },
                {
                    "term": "Metabolic pathway prediction",
                    "uri": "http://edamontology.org/operation_3929"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Feature table",
                        "uri": "http://edamontology.org/data_1270"
                    },
                    "format": [
                        {
                            "term": "CSV",
                            "uri": "http://edamontology.org/format_3752"
                        }
                    ]
                }
            ]
        }
    ],
    "homepage": "https://metstab-shap.matinf.uj.edu.pl/",
    "lastUpdate": "2022-01-28T22:37:46.657723Z",
    "name": "SHAP",
    "operatingSystem": [
        "Mac",
        "Linux",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1186/S13321-021-00542-Y",
            "metadata": {
                "abstract": "© 2021, The Author(s).Background: Computational methods support nowadays each stage of drug design campaigns. They assist not only in the process of identification of new active compounds towards particular biological target, but also help in the evaluation and optimization of their physicochemical and pharmacokinetic properties. Such features are not less important in terms of the possible turn of a compound into a future drug than its desired affinity profile towards considered proteins. In the study, we focus on metabolic stability, which determines the time that the compound can act in the organism and play its role as a drug. Due to great complexity of xenobiotic transformation pathways in the living organisms, evaluation and optimization of metabolic stability remains a big challenge. Results: Here, we present a novel methodology for the evaluation and analysis of structural features influencing metabolic stability. To this end, we use a well-established explainability method called SHAP. We built several predictive models and analyse their predictions with the SHAP values to reveal how particular compound substructures influence the model’s prediction. The method can be widely applied by users thanks to the web service, which accompanies the article. It allows a detailed analysis of SHAP values obtained for compounds from the ChEMBL database, as well as their determination and analysis for any compound submitted by a user. Moreover, the service enables manual analysis of the possible structural modifications via the provision of analogous analysis for the most similar compound from the ChEMBL dataset. Conclusions: To our knowledge, this is the first attempt to employ SHAP to reveal which substructural features are utilized by machine learning models when evaluating compound metabolic stability. The accompanying web service for metabolic stability evaluation can be of great help for medicinal chemists. Its significant usefulness is related not only to the possibility of assessing compound stability, but also to the provision of information about substructures influencing this parameter. It can assist in the design of new ligands with improved metabolic stability, helping in the detection of privileged and unfavourable chemical moieties during stability optimization. The tool is available at https://metstab-shap.matinf.uj.edu.pl/.",
                "authors": [
                    {
                        "name": "Wojtuch A."
                    },
                    {
                        "name": "Jankowski R."
                    },
                    {
                        "name": "Podlewska S."
                    }
                ],
                "date": "2021-12-01T00:00:00Z",
                "journal": "Journal of Cheminformatics",
                "title": "How can SHAP values help to shape metabolic stability of chemical compounds?"
            },
            "pmcid": "PMC8477573",
            "pmid": "34579792"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Drug metabolism",
            "uri": "http://edamontology.org/topic_3375"
        },
        {
            "term": "Endocrinology and metabolism",
            "uri": "http://edamontology.org/topic_3407"
        },
        {
            "term": "Medicinal chemistry",
            "uri": "http://edamontology.org/topic_0209"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ]
}