{
    "accessibility": "Open access",
    "additionDate": "2022-10-09T12:46:16.271429Z",
    "biotoolsCURIE": "biotools:dlf-sul",
    "biotoolsID": "dlf-sul",
    "confidence_flag": "tool",
    "credit": [
        {
            "name": "Jinmou Li"
        },
        {
            "name": "Qiao Ning"
        }
    ],
    "description": "A multi-module deep learning framework for prediction of S-sulfinylation sites in proteins.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Feature extraction",
                    "uri": "http://edamontology.org/operation_3937"
                },
                {
                    "term": "PTM site prediction",
                    "uri": "http://edamontology.org/operation_0417"
                }
            ]
        }
    ],
    "homepage": "https://github.com/ningq669/DLF-Sul",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-10-09T12:46:16.274137Z",
    "license": "Not licensed",
    "name": "DLF-Sul",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1093/BIB/BBAC323",
            "metadata": {
                "abstract": "© The Author(s) 2022. Published by Oxford University Press. All rights reserved. For Permissions, please email: journals.permissions@oup.com.Protein S-sulfinylation is an important posttranslational modification that regulates a variety of cell and protein functions. This modification has been linked to signal transduction, redox homeostasis and neuronal transmission in studies. Therefore, identification of S-sulfinylation sites is crucial to understanding its structure and function, which is critical in cell biology and human diseases. In this study, we propose a multi-module deep learning framework named DLF-Sul for identification of S-sulfinylation sites in proteins. First, three types of features are extracted including binary encoding, BLOSUM62 and amino acid index. Then, sequential features are further extracted based on these three types of features using bidirectional long short-term memory network. Next, multi-head self-attention mechanism is utilized to filter the effective attribute information, and residual connection helps to reduce information loss. Furthermore, convolutional neural network is employed to extract local deep features information. Finally, fully connected layers acts as classifier that map samples to corresponding label. Performance metrics on independent test set, including sensitivity, specificity, accuracy, Matthews correlation coefficient and area under curve, reach 91.80%, 92.36%, 92.08%, 0.8416 and 96.40%, respectively. The results show that DLF-Sul is an effective tool for predicting S-sulfinylation sites. The source code is available on the website https://github.com/ningq669/DLF-Sul.",
                "authors": [
                    {
                        "name": "Li J."
                    },
                    {
                        "name": "Ning Q."
                    }
                ],
                "date": "2022-09-20T00:00:00Z",
                "journal": "Briefings in bioinformatics",
                "title": "DLF-Sul: a multi-module deep learning framework for prediction of S-sulfinylation sites in proteins"
            },
            "pmid": "35945138"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Protein modifications",
            "uri": "http://edamontology.org/topic_0601"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
