{
    "additionDate": "2017-01-17T15:03:16Z",
    "biotoolsCURIE": "biotools:eximir",
    "biotoolsID": "eximir",
    "collectionID": [
        "BioConductor"
    ],
    "credit": [
        {
            "email": "DL.RSupport@pmi.com",
            "name": "Sylvain Gubian",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "This package contains functions for reading raw data in ImaGene TXT format obtained from Exiqon miRCURY LNA arrays, annotating them with appropriate GAL files, and normalizing them using a spike-in probe-based method. Other platforms and data formats are also supported.",
    "documentation": [
        {
            "type": "User manual",
            "url": "http://bioconductor.org/packages/release/bioc/html/ExiMiR.html"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://bioconductor/packages/release/bioc/src/contrib/ExiMiR_2.16.0.tar.gz"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Loading",
                    "uri": "http://edamontology.org/operation_1812"
                }
            ]
        }
    ],
    "homepage": "http://bioconductor.org/packages/release/bioc/html/ExiMiR.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-10T12:58:52Z",
    "license": "GPL-2.0",
    "name": "ExiMiR",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "bioconductor_import",
    "publication": [
        {
            "doi": "10.1186/1756-0500-7-302",
            "metadata": {
                "abstract": "Background: High-quality expression data are required to investigate the biological effects of microRNAs (miRNAs). The goal of this study was, first, to assess the quality of miRNA expression data based on microarray technologies and, second, to consolidate it by applying a novel normalization method. Indeed, because of significant differences in platform designs, miRNA raw data cannot be normalized blindly with standard methods developed for gene expression. This fundamental observation motivated the development of a novel multi-array normalization method based on controllable assumptions, which uses the spike-in control probes to adjust the measured intensities across arrays. Results: Raw expression data were obtained with the Exiqon dual-channel miRCURY LNA™ platform in the \"common reference design\" and processed as \"pseudo-single-channel\". They were used to apply several quality metrics based on the coefficient of variation and to test the novel spike-in controls based normalization method. Most of the considerations presented here could be applied to raw data obtained with other platforms. To assess the normalization method, it was compared with 13 other available approaches from both data quality and biological outcome perspectives. The results showed that the novel multi-array normalization method reduced the data variability in the most consistent way. Further, the reliability of the obtained differential expression values was confirmed based on a quantitative reverse transcription-polymerase chain reaction experiment performed for a subset of miRNAs. The results reported here support the applicability of the novel normalization method, in particular to datasets that display global decreases in miRNA expression similarly to the cigarette smoke-exposed mouse lung dataset considered in this study. Conclusions: Quality metrics to assess between-array variability were used to confirm that the novel spike-in controls based normalization method provided high-quality miRNA expression data suitable for reliable downstream analysis. The multi-array miRNA raw data normalization method was implemented in an R software package called ExiMiR and deposited in the Bioconductor repository. © 2014 Sewer et al.; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Sewer A."
                    },
                    {
                        "name": "Gubian S."
                    },
                    {
                        "name": "Kogel U."
                    },
                    {
                        "name": "Veljkovic E."
                    },
                    {
                        "name": "Han W."
                    },
                    {
                        "name": "Hengstermann A."
                    },
                    {
                        "name": "Peitsch M.C."
                    },
                    {
                        "name": "Hoeng J."
                    }
                ],
                "citationCount": 8,
                "date": "2014-05-17T00:00:00Z",
                "journal": "BMC Research Notes",
                "title": "Assessment of a novel multi-array normalization method based on spike-in control probes suitable for microRNA datasets with global decreases in expression"
            },
            "type": "Primary"
        }
    ],
    "toolType": [
        "Command-line tool",
        "Library"
    ],
    "topic": [
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        },
        {
            "term": "Data management",
            "uri": "http://edamontology.org/topic_3071"
        }
    ],
    "validated": 1,
    "version": [
        "2.16.0"
    ]
}