{
    "additionDate": "2021-01-18T08:28:51Z",
    "biotoolsCURIE": "biotools:bamscale",
    "biotoolsID": "bamscale",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "lorinc.pongor@nih.gov",
            "name": "Lorinc S. Pongor",
            "typeEntity": "Person"
        },
        {
            "email": "aladjemm@mail.nih.gov",
            "name": "Mirit I. Aladjem",
            "typeEntity": "Person"
        },
        {
            "email": "yves.pommier@nih.gov",
            "name": "Yves Pommier",
            "typeEntity": "Person"
        }
    ],
    "description": "BAMscale is a one-step tool for either 1) quantifying and normalizing the coverage of peaks or 2) generated scaled BigWig files for easy visualization of commonly used DNA-seq capture based methods.",
    "download": [
        {
            "type": "Container file",
            "url": "https://quay.io/repository/biocontainers/bamscale"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                },
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                },
                {
                    "term": "Peak calling",
                    "uri": "http://edamontology.org/operation_3222"
                }
            ]
        }
    ],
    "homepage": "https://github.com/ncbi/BAMscale",
    "language": [
        "C",
        "R"
    ],
    "lastUpdate": "2021-01-31T14:48:09Z",
    "name": "BAMscale",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.21203/RS.2.20856/V2"
        },
        {
            "doi": "10.1186/S13072-020-00343-X",
            "metadata": {
                "abstract": "© 2020 The Author(s).Background: Next-generation sequencing allows genome-wide analysis of changes in chromatin states and gene expression. Data analysis of these increasingly used methods either requires multiple analysis steps, or extensive computational time. We sought to develop a tool for rapid quantification of sequencing peaks from diverse experimental sources and an efficient method to produce coverage tracks for accurate visualization that can be intuitively displayed and interpreted by experimentalists with minimal bioinformatics background. We demonstrate its strength and usability by integrating data from several types of sequencing approaches. Results: We have developed BAMscale, a one-step tool that processes a wide set of sequencing datasets. To demonstrate the usefulness of BAMscale, we analyzed multiple sequencing datasets from chromatin immunoprecipitation sequencing data (ChIP-seq), chromatin state change data (assay for transposase-accessible chromatin using sequencing: ATAC-seq, DNA double-strand break mapping sequencing: END-seq), DNA replication data (Okazaki fragments sequencing: OK-seq, nascent-strand sequencing: NS-seq, single-cell replication timing sequencing: scRepli-seq) and RNA-seq data. The outputs consist of raw and normalized peak scores (multiple normalizations) in text format and scaled bigWig coverage tracks that are directly accessible to data visualization programs. BAMScale also includes a visualization module facilitating direct, on-demand quantitative peak comparisons that can be used by experimentalists. Our tool can effectively analyze large sequencing datasets (~ 100 Gb size) in minutes, outperforming currently available tools. Conclusions: BAMscale accurately quantifies and normalizes identified peaks directly from BAM files, and creates coverage tracks for visualization in genome browsers. BAMScale can be implemented for a wide set of methods for calculating coverage tracks, including ChIP-seq and ATAC-seq, as well as methods that currently require specialized, separate tools for analyses, such as splice-aware RNA-seq, END-seq and OK-seq for which no dedicated software is available. BAMscale is freely available on github (https://github.com/ncbi/BAMscale).",
                "authors": [
                    {
                        "name": "Pongor L.S."
                    },
                    {
                        "name": "Gross J.M."
                    },
                    {
                        "name": "Vera Alvarez R."
                    },
                    {
                        "name": "Murai J."
                    },
                    {
                        "name": "Jang S.-M."
                    },
                    {
                        "name": "Zhang H."
                    },
                    {
                        "name": "Redon C."
                    },
                    {
                        "name": "Fu H."
                    },
                    {
                        "name": "Huang S.-Y."
                    },
                    {
                        "name": "Thakur B."
                    },
                    {
                        "name": "Baris A."
                    },
                    {
                        "name": "Marino-Ramirez L."
                    },
                    {
                        "name": "Landsman D."
                    },
                    {
                        "name": "Aladjem M.I."
                    },
                    {
                        "name": "Pommier Y."
                    }
                ],
                "citationCount": 5,
                "date": "2020-04-22T00:00:00Z",
                "journal": "Epigenetics and Chromatin",
                "title": "BAMscale: Quantification of next-generation sequencing peaks and generation of scaled coverage tracks"
            },
            "pmcid": "PMC7175505",
            "pmid": "32321568"
        }
    ],
    "toolType": [
        "Command-line tool",
        "Workflow"
    ],
    "topic": [
        {
            "term": "ChIP-seq",
            "uri": "http://edamontology.org/topic_3169"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        }
    ]
}