{
    "additionDate": "2019-11-14T18:25:16Z",
    "biotoolsCURIE": "biotools:iDEF-PseRAAC",
    "biotoolsID": "iDEF-PseRAAC",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "yczuo@imu.edu.cn",
            "name": "Yongchun Zuo",
            "orcidid": "https://orcid.org/0000-0002-6065-7835",
            "typeEntity": "Person"
        }
    ],
    "description": "Identifying the Defensin Peptide by Using Reduced Amino Acid Composition Descriptor | Defensins as 1 of major classes of host defense peptides play a significant role in the innate immunity, which are extremely evolved in almost all living organisms. Developing high-throughput computational methods can accurately help in designing drugs or medical means to defense against pathogens. To take up such a challenge, an up-to-date server based on rigorous benchmark dataset, referred to as iDEF-PseRAAC, was designed for predicting the defensin family in this study. By extracting primary sequence compositions based on different types of reduced amino acid alphabet, it was calculated that the best overall accuracy of the selected feature subset was achieved to 92.38%",
    "editPermission": {
        "type": "public"
    },
    "homepage": "http://bioinfor.imu.edu.cn/idpf/public/",
    "lastUpdate": "2020-12-14T08:26:35Z",
    "name": "iDEF-PseRAAC",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1177/1176934319867088",
            "metadata": {
                "abstract": "© The Author(s) 2019.Defensins as 1 of major classes of host defense peptides play a significant role in the innate immunity, which are extremely evolved in almost all living organisms. Developing high-throughput computational methods can accurately help in designing drugs or medical means to defense against pathogens. To take up such a challenge, an up-to-date server based on rigorous benchmark dataset, referred to as iDEF-PseRAAC, was designed for predicting the defensin family in this study. By extracting primary sequence compositions based on different types of reduced amino acid alphabet, it was calculated that the best overall accuracy of the selected feature subset was achieved to 92.38%. Therefore, we can conclude that the information provided by abundant types of amino acid reduction will provide efficient and rational methodology for defensin identification. And, a free online server is freely available for academic users at http://bioinfor.imu.edu.cn/idpf. We hold expectations that iDEF-PseRAAC may be a promising weapon for the function annotation about the defensins protein.",
                "authors": [
                    {
                        "name": "Zuo Y."
                    },
                    {
                        "name": "Chang Y."
                    },
                    {
                        "name": "Huang S."
                    },
                    {
                        "name": "Zheng L."
                    },
                    {
                        "name": "Yang L."
                    },
                    {
                        "name": "Cao G."
                    }
                ],
                "citationCount": 2,
                "date": "2019-07-01T00:00:00Z",
                "journal": "Evolutionary Bioinformatics",
                "title": "iDEF-PseRAAC: Identifying the Defensin Peptide by Using Reduced Amino Acid Composition Descriptor"
            },
            "pmcid": "PMC6669840",
            "pmid": "31391777"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Sequence composition, complexity and repeats",
            "uri": "http://edamontology.org/topic_0157"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        }
    ],
    "validated": 1
}