
{
    "credit": [
        {
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://zhanglab.ccmb.med.umich.edu/"
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "https://zhanglab.ccmb.med.umich.edu/3DRobot/about.html"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Protein sequence analysis",
                    "uri": "http://edamontology.org/operation_2479"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Protein structure analysis",
                "uri": "http://edamontology.org/topic_2814"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://www.mybiosoftware.com/3drobot-protein-structural-decoy-generator.html"
        }
    ],
    "publication": [
        {
            "abstract": "© The Author 2015. Published by Oxford University Press. Motivation: Computationally generated non-native protein structure conformations (or decoys) are often used for designing protein folding simulation methods and force fields. However, almost all the decoy sets currently used in literature suffer from uneven root mean square deviation (RMSD) distribution with bias to non-protein like hydrogen-bonding and compactness patterns. Meanwhile, most protein decoy sets are pre-calculated and there is a lack of methods for automated generation of high-quality decoys for any target proteins. Results: We developed a new algorithm, 3DRobot, to create protein structure decoys by free fragment assembly with enhanced hydrogen-bonding and compactness interactions. The method was benchmarked with three widely used decoy sets from ab initio folding and comparative modeling simulations. The decoys generated by 3DRobot are shown to have significantly enhanced diversity and evenness with a continuous distribution in the RMSD space. The new energy terms introduced in 3DRobot improve the hydrogen-bonding network and compactness of decoys, which eliminates the possibility of native structure recognition by trivial potentials. Algorithms that can automatically create such diverse and well-packed non-native conformations from any protein structure should have a broad impact on the development of advanced protein force field and folding simulation methods. Availiablity and implementation: http://zhanglab.ccmb.med.umich.edu/3DRobot/ Contact:; zhng@umich.edu Supplementary information: Supplementary data are available at Bioinformatics online.",
            "authors": [
                "Deng H.",
                "Jia Y.",
                "Zhang Y."
            ],
            "cit_count": 22,
            "journal": "Bioinformatics",
            "pmid": "26471454",
            "title": "3DRobot: Automated generation of diverse and well-packed protein structure decoys",
            "year": "2015-04-23"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:3drobot",
        "biotoolsID": "3drobot",
        "description": "3DRobot is a program devoted for automated generation of diverse and well-packed protein structure decoys.",
        "homepage": "http://zhanglab.ccmb.med.umich.edu/3DRobot",
        "name": "3DRobot"
    }
}