{
    "additionDate": "2021-03-19T08:58:52Z",
    "biotoolsCURIE": "biotools:gcsscore",
    "biotoolsID": "gcsscore",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "michael.miles@vcuhealth.org",
            "name": "Michael F. Miles",
            "orcidid": "https://orcid.org/0000-0002-1532-584X",
            "typeEntity": "Person"
        }
    ],
    "description": "an R package for differential gene expression analysis in Affymetrix/Thermo-Fisher whole transcriptome microarrays.\n\nGCSscore is an R package that is available on GitHub that is also available in the BioConductor repository (release 3.10 and higher).\n\nGCSscore: an R package for microarray analysis for Affymetrix/Thermo Fisher arrays.\n\nFor differential expression analysis of 3'IVT and WT-style microarrays from Affymetrix Thermo-Fisher.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Differential gene expression profiling",
                    "uri": "http://edamontology.org/operation_3223"
                },
                {
                    "term": "Microarray probe design",
                    "uri": "http://edamontology.org/operation_0309"
                },
                {
                    "term": "Gene-set enrichment analysis",
                    "uri": "http://edamontology.org/operation_2436"
                },
                {
                    "term": "Sequence trimming",
                    "uri": "http://edamontology.org/operation_3192"
                }
            ]
        }
    ],
    "homepage": "https://github.com/harrisgm/GCSscore",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-03-26T09:14:53Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "http://www.bioconductor.org/packages/release/bioc/html/GCSscore.html"
        }
    ],
    "name": "GCSscore",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1186/S12864-021-07370-2",
            "metadata": {
                "abstract": "© 2021, The Author(s).Background: Despite the increasing use of RNAseq for transcriptome analysis, microarrays remain a widely-used methodology for genomic studies. The latest generation of Affymetrix/Thermo-Fisher microarrays, the ClariomD/XTA and ClariomS array, provide a sensitive and facile method for complex transcriptome expression analysis. However, existing methods of analysis for these high-density arrays do not leverage the statistical power contained in having multiple oligonucleotides representing each gene/exon, but rather summarize probes into a single expression value. We previously developed a methodology, the Sscore algorithm, for probe-level identification of differentially expressed genes (DEGs) between treatment and control samples with oligonucleotide microarrays. The Sscore algorithm was validated for sensitive detection of DEGs by comparison with existing methods. However, the prior version of the Sscore algorithm and a R-based implementation software, sscore, do not function with the latest generations of Affymetrix/Fisher microarrays due to changes in microarray design that eliminated probes previously used for estimation of non-specific binding. Results: Here we describe the GCSscore algorithm, which utilizes the GC-content of a given oligonucleotide probe to estimate non-specific binding using antigenomic background probes found on new generations of arrays. We implemented this algorithm in an improved GCSscore R package for analysis of modern oligonucleotide microarrays. GCSscore has multiple methods for grouping individual probes on the ClariomD/XTA chips, providing the user with differential expression analysis at the gene-level and the exon-level. By utilizing the direct probe-level intensities, the GCSscore algorithm was able to detect DEGs under stringent statistical criteria for all Clariom-based arrays. We demonstrate that for older 3′-IVT arrays, GCSscore produced very similar differential gene expression analysis results compared to the original Sscore method. However, GCSscore functioned well for both the ClariomS and ClariomD/XTA newer microarrays and outperformed existing analysis approaches insofar as the number of DEGs and cognate biological functions identified. This was particularly striking for analysis of the highly complex ClariomD/XTA based arrays. Conclusions: The GCSscore package represents a powerful new application for analysis of the newest generation of oligonucleotide microarrays such as the ClariomS and ClariomD/XTA arrays produced by Affymetrix/Fisher.",
                "authors": [
                    {
                        "name": "Harris G.M."
                    },
                    {
                        "name": "Abbas S."
                    },
                    {
                        "name": "Miles M.F."
                    }
                ],
                "citationCount": 1,
                "date": "2021-12-01T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "GCSscore: an R package for differential gene expression analysis in Affymetrix/Thermo-Fisher whole transcriptome microarrays"
            },
            "pmcid": "PMC7848880",
            "pmid": "33522903"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        },
        {
            "term": "Probes and primers",
            "uri": "http://edamontology.org/topic_0632"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "ChIP-on-chip",
            "uri": "http://edamontology.org/topic_3179"
        }
    ]
}