{
    "additionDate": "2021-11-29T10:55:29.399628Z",
    "biotoolsCURIE": "biotools:rnaseqdesign",
    "biotoolsID": "rnaseqdesign",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "chlin@mcw.com",
            "name": "Chien-Wei Lin",
            "typeEntity": "Person"
        },
        {
            "email": "ctseng@pitt.edu",
            "name": "George C. Tseng",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "RNASeqDesign is a framework for RNA-Seq genome-wide power calculation and study design issues.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Differential gene expression profiling",
                    "uri": "http://edamontology.org/operation_3223"
                },
                {
                    "term": "RNA-Seq quantification",
                    "uri": "http://edamontology.org/operation_3800"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/MasakiLin/RNASeqDesign",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-11-29T10:55:29.402254Z",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/MasakiLin/RNASeqDesign/issues"
        }
    ],
    "name": "RNASeqDesign",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1111/RSSC.12330",
            "metadata": {
                "abstract": "© 2018 Royal Statistical SocietyMassively parallel sequencing (also known as next generation sequencing (NGS)) technology has emerged as a powerful tool in characterizing genomic profiles. Among many NGS applications, ribonucleic acid sequencing (‘RNA-Seq’) has gradually become a standard tool for global transcriptomic monitoring. Although the cost of NGS experiments has dropped constantly, the high sequencing cost and bioinformatic complexity are still obstacles for many biomedical projects. Unlike earlier fluorescence-based technologies such as microarrays, modelling of NGS data should consider discrete count data. In addition to sample size, sequencing depth also directly relates to the experimental cost. Consequently, given a total budget and prespecified unit experimental cost, the study design issue in RNA-Seq is conceptually a more complex multi-dimensional constrained optimization problem rather than a one-dimensional sample size calculation in a traditional hypothesis setting. We propose a statistical framework, namely ‘RNASeqDesign’, to utilize pilot data for power calculation and study design of RNA-Seq experiments. The approach is based on mixture model fitting of the p-value distribution from pilot data and a parametric bootstrap procedure based on approximated Wald test statistics to infer the genomewide power for optimal sample size and sequencing depth. We further illustrate five practical study design tasks for practitioners. We perform simulations and three real applications to evaluate the performance and to compare with existing methods.",
                "authors": [
                    {
                        "name": "Lee M.-L.T."
                    },
                    {
                        "name": "Liao S.G."
                    },
                    {
                        "name": "Lin C.-W."
                    },
                    {
                        "name": "Liu P."
                    },
                    {
                        "name": "Park Y.S."
                    },
                    {
                        "name": "Tseng G.C."
                    }
                ],
                "date": "2019-04-01T00:00:00Z",
                "journal": "Journal of the Royal Statistical Society. Series C: Applied Statistics",
                "title": "RNASeqDesign: a framework for ribonucleic acid sequencing genomewide power calculation and study design issues"
            },
            "pmcid": "PMC7941184",
            "pmid": "33692596"
        }
    ],
    "toolType": [
        "Workbench"
    ],
    "topic": [
        {
            "term": "Experimental design and studies",
            "uri": "http://edamontology.org/topic_3678"
        },
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        },
        {
            "term": "Ontology and terminology",
            "uri": "http://edamontology.org/topic_0089"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ]
}
