
{
    "credit": [
        {
            "email": "perry.ridge@byu.edu",
            "name": "Perry Ridge",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "https://github.com/ridgelab/Kmer-SSR"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Repeat sequence detection",
                    "uri": "http://edamontology.org/operation_0379"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "C++"
        ],
        "operatingSystem": [
            "Linux"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Sequence composition, complexity and repeats",
                "uri": "http://edamontology.org/topic_0157"
            },
            {
                "term": "Sequence analysis",
                "uri": "http://edamontology.org/topic_0080"
            },
            {
                "term": "Sequencing",
                "uri": "http://edamontology.org/topic_3168"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© The Author 2017. Published by Oxford University Press. All rights reserved. Motivation: One of the main challenges with bioinformatics software is that the size and complexity of datasets necessitate trading speed for accuracy, or completeness. To combat this problem of computational complexity, a plethora of heuristic algorithms have arisen that report a 'good enough' solution to biological questions. However, in instances such as Simple Sequence Repeats (SSRs), a 'good enough' solution may not accurately portray results in population genetics, phylogenetics and forensics, which require accurate SSRs to calculate intra- and inter-species interactions. Results: We present Kmer-SSR, which finds all SSRs faster than most heuristic SSR identification algorithms in a parallelized, easy-to-use manner. The exhaustive Kmer-SSR option has 100% precision and 100% recall and accurately identifies every SSR of any specified length. To identify more biologically pertinent SSRs, we also developed several filters that allow users to easily view a subset of SSRs based on user input. Kmer-SSR, coupled with the filter options, accurately and intuitively identifies SSRs quickly and in a more user-friendly manner than any other SSR identification algorithm.",
            "authors": [
                "Pickett B.D.",
                "Miller J.B.",
                "Ridge P.G."
            ],
            "cit_count": 1,
            "doi": "10.1093/bioinformatics/btx538",
            "journal": "Bioinformatics",
            "title": "Kmer-SSR: A fast and exhaustive SSR search algorithm",
            "year": "2017-12-15"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:kmer-ssr",
        "biotoolsID": "kmer-ssr",
        "description": "Fast, Accurate, and Complete SSR Detection in Genomic Sequences.",
        "homepage": "https://github.com/ridgelab/Kmer-SSR",
        "name": "Kmer-SSR"
    }
}