{
    "additionDate": "2017-12-18T00:12:17Z",
    "biotoolsCURIE": "biotools:saqc",
    "biotoolsID": "saqc",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.stat.sinica.edu.tw/hsinchou/"
        }
    ],
    "description": "This software is written in R and R-GUI and was developed as a user-friendly tool for the visualization and evaluation of data quality of genome-wide SNP arrays.",
    "documentation": [
        {
            "type": "General",
            "url": "http://www.stat.sinica.edu.tw/hsinchou/genetics/quality/SAQC.htm"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Validation",
                    "uri": "http://edamontology.org/operation_2428"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "http://www.stat.sinica.edu.tw/hsinchou/genetics/quality/SAQC.htm",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-10T12:58:54Z",
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/saqc-1-0-snp-array-quality-control.html"
        }
    ],
    "name": "SAQC",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1186/1471-2105-12-100",
            "metadata": {
                "abstract": "Background: Genome-wide single-nucleotide polymorphism (SNP) arrays containing hundreds of thousands of SNPs from the human genome have proven useful for studying important human genome questions. Data quality of SNP arrays plays a key role in the accuracy and precision of downstream data analyses. However, good indices for assessing data quality of SNP arrays have not yet been developed.Results: We developed new quality indices to measure the quality of SNP arrays and/or DNA samples and investigated their statistical properties. The indices quantify a departure of estimated individual-level allele frequencies (AFs) from expected frequencies via standardized distances. The proposed quality indices followed lognormal distributions in several large genomic studies that we empirically evaluated. AF reference data and quality index reference data for different SNP array platforms were established based on samples from various reference populations. Furthermore, a confidence interval method based on the underlying empirical distributions of quality indices was developed to identify poor-quality SNP arrays and/or DNA samples. Analyses of authentic biological data and simulated data show that this new method is sensitive and specific for the detection of poor-quality SNP arrays and/or DNA samples.Conclusions: This study introduces new quality indices, establishes references for AFs and quality indices, and develops a detection method for poor-quality SNP arrays and/or DNA samples. We have developed a new computer program that utilizes these methods called SNP Array Quality Control (SAQC). SAQC software is written in R and R-GUI and was developed as a user-friendly tool for the visualization and evaluation of data quality of genome-wide SNP arrays. The program is available online (http://www.stat.sinica.edu.tw/hsinchou/genetics/quality/SAQC.htm). © 2011 Yang et al; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Yang H.-C."
                    },
                    {
                        "name": "Lin H.-C."
                    },
                    {
                        "name": "Kang M."
                    },
                    {
                        "name": "Chen C.-H."
                    },
                    {
                        "name": "Lin C.-W."
                    },
                    {
                        "name": "Li L.-H."
                    },
                    {
                        "name": "Wu J.-Y."
                    },
                    {
                        "name": "Chen Y.-T."
                    },
                    {
                        "name": "Pan W.-H."
                    }
                ],
                "citationCount": 4,
                "date": "2011-04-18T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "SAQC: SNP Array Quality Control"
            },
            "type": "Primary"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        },
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        }
    ],
    "validated": 1,
    "version": [
        "1.0"
    ]
}