{"credit":[{"email":"jlo@ua.pt","typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://bioinformatics.ua.pt/"}],"documentation":[{"type":"GENERAL","url":"http://bioinformatics.ua.pt/software/mafco/"}],"function":[{"operation":[{"term":"Data handling","uri":"http://edamontology.org/operation_2409"}]},{"operation":[{"term":"Multiple sequence alignment","uri":"http://edamontology.org/operation_0492"}]}],"labels":{"language":["C"],"operatingSystem":["Linux"],"toolType":["Command-line tool"],"topic":[{"term":"Nucleic acids","uri":"http://edamontology.org/topic_0077"},{"term":"Data management","uri":"http://edamontology.org/topic_3071"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/mafco-compression-tool-for-maf-files.html"}],"publication":[{"abstract":"© 2015 Matos et al. In the last decade, the cost of genomic sequencing has been decreasing so much that researchers all over the world accumulate huge amounts of data for present and future use. These genomic data need to be efficiently stored, because storage cost is not decreasing as fast as the cost of sequencing. In order to overcome this problem, the most popular generalpurpose compression tool, gzip, is usually used. However, these tools were not specifically designed to compress this kind of data, and often fall short when the intention is to reduce the data size as much as possible. There are several compression algorithms available, even for genomic data, but very few have been designed to deal with Whole Genome Alignments, containing alignments between entire genomes of several species. In this paper, we present a lossless compression tool, MAFCO, specifically designed to compress MAF (Multiple Alignment Format) files. Compared to gzip, the proposed tool attains a compression gain from 34% to 57%, depending on the data set. When compared to a recent dedicated method, which is not compatible with some data sets, the compression gain of MAFCO is about 9%. Both source-code and binaries for several operating systems are freely available for non-commercial use at: http://bioinformatics.ua.pt/software/mafco.","authors":["Matos L.M.O.","Neves A.J.R.","Pratas D.","Pinho A.J."],"cit_count":1,"journal":"PLoS ONE","pmid":"25816229","title":"Mafco: A compression tool for MAF files","year":"2015-03-27"}],"summary":{"biotoolsCURIE":"biotools:mafco","biotoolsID":"mafco","description":"Lossless compression tool specifically designed to compress MAF (Multiple Alignment Format) files.","homepage":"http://bioinformatics.ua.pt/software/mafco/","name":"MAFCO"}}