{
    "additionDate": "2019-11-14T19:44:25Z",
    "biotoolsCURIE": "biotools:Plant_Regulomics",
    "biotoolsID": "Plant_Regulomics",
    "confidence_flag": "tool",
    "description": "Plant Regulomics is a data-driven interface for retrieving upstream regulators from plant multi-omics data, which integrates 20,737 transcriptomic and epigenomic data sets and diverse sources of functional evidence (58,112 functional terms and 695,414 protein-protein interactions) from six plant species, namely Arabidopsis thaliana, Oryza sativa, Zea mays, Glycine max, Solanum lycopersicum and Triticum aestivum, along with the orthologous genes from 56 whole-genome sequenced plant species. These data were well-organized to gene modules and further implemented into the same statistical framework.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                },
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                }
            ]
        }
    ],
    "homepage": "http://bioinfo.sibs.ac.cn/plant-regulomics",
    "lastUpdate": "2021-01-10T14:13:15Z",
    "name": "Plant Regulomics",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1111/TPJ.14526",
            "metadata": {
                "abstract": "© 2019 The Authors The Plant Journal © 2019 John Wiley & Sons LtdHigh-throughput technology has become a powerful approach for routine plant research. Interpreting the biological significance of high-throughput data has largely focused on the functional characterization of a large gene list or genomic loci that involves the following two aspects: the functions of the genes or loci and how they are regulated as a whole, i.e. searching for the upstream regulators. Traditional platforms for functional annotation largely help resolving the first issue. Addressing the second issue is essential for a global understanding of the regulatory mechanism, but is more challenging, and requires additional high-throughput experimental evidence and a unified statistical framework for data-mining. The rapid accumulation of ’omics data provides a large amount of experimental data. We here present Plant Regulomics, an interface that integrates 19 925 transcriptomic and epigenomic data sets and diverse sources of functional evidence (58 112 terms and 695 414 protein−protein interactions) from six plant species along with the orthologous genes from 56 whole-genome sequenced plant species. All pair-wise transcriptomic comparisons with biological significance within the same study were performed, and all epigenomic data were processed to genomic loci targeted by various factors. These data were well organized to gene modules and loci lists, which were further implemented into the same statistical framework. For any input gene list or genomic loci, Plant Regulomics retrieves the upstream factors, treatments, and experimental/environmental conditions regulating the input from the integrated ’omics data. Additionally, multiple tools and an interactive visualization are available through a user-friendly web interface. Plant Regulomics is available at http://bioinfo.sibs.ac.cn/plant-regulomics.",
                "authors": [
                    {
                        "name": "Ran X."
                    },
                    {
                        "name": "Zhao F."
                    },
                    {
                        "name": "Wang Y."
                    },
                    {
                        "name": "Liu J."
                    },
                    {
                        "name": "Zhuang Y."
                    },
                    {
                        "name": "Ye L."
                    },
                    {
                        "name": "Qi M."
                    },
                    {
                        "name": "Cheng J."
                    },
                    {
                        "name": "Zhang Y."
                    }
                ],
                "citationCount": 21,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Plant Journal",
                "title": "Plant Regulomics: a data-driven interface for retrieving upstream regulators from plant multi-omics data"
            },
            "pmid": "31494994"
        }
    ],
    "topic": [
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        },
        {
            "term": "Epigenomics",
            "uri": "http://edamontology.org/topic_3173"
        },
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        }
    ],
    "validated": 1
}