{
    "accessibility": "Open access",
    "additionDate": "2022-05-12T19:21:09.077812Z",
    "biotoolsCURIE": "biotools:ds-ui",
    "biotoolsID": "ds-ui",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Guoqiang Zhang",
            "orcidid": "https://orcid.org/0000-0003-4521-542X"
        },
        {
            "name": "Jing-Hao Xue",
            "orcidid": "https://orcid.org/0000-0003-1174-610X"
        },
        {
            "name": "Jun Guo",
            "orcidid": "https://orcid.org/0000-0001-9045-1339"
        },
        {
            "name": "Yinhe Zheng",
            "orcidid": "https://orcid.org/0000-0002-7029-5671"
        }
    ],
    "description": "Dual-Supervised Mixture of Gaussian Mixture Models for Uncertainty Inference in Image Recognition",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Backbone modelling",
                    "uri": "http://edamontology.org/operation_0479"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://github.com/PRIS-CV/DS-UI",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-05-12T19:21:09.080233Z",
    "license": "MIT",
    "name": "DS-UI",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1109/TIP.2021.3123555",
            "metadata": {
                "abstract": "© 2021 Institute of Electrical and Electronics Engineers Inc.. All rights reserved.This paper proposes a dual-supervised uncertainty inference (DS-UI) framework for improving Bayesian estimation-based UI in DNN-based image recognition. In the DS-UI, we combine the classifier of a DNN, i.e., the last fully-connected (FC) layer, with a mixture of Gaussian mixture models (MoGMM) to obtain an MoGMM-FC layer. Unlike existing UI methods for DNNs, which only calculate the means or modes of the DNN outputs’ distributions, the proposed MoGMM-FC layer acts as a probabilistic interpreter for the features that are inputs of the classifier to directly calculate the probabilities of them for the DS-UI. In addition, we propose a dual-supervised stochastic gradient-based variational Bayes (DS-SGVB) algorithm for the MoGMM-FC layer optimization. Unlike conventional SGVB and optimization algorithms in other UI methods, the DS-SGVB not only models the samples in the specific class for each Gaussian mixture model (GMM) in the MoGMM, but also considers the negative samples from other classes for the GMM to reduce the intra-class distances and enlarge the inter-class margins simultaneously for enhancing the learning ability of the MoGMM-FC layer in the DS-UI. Experimental results show the DS-UI outperforms the state-of-the-art UI methods in misclassification detection. We further evaluate the DS-UI in open-set out-of-domain/-distribution detection and find statistically significant improvements. Visualizations of the feature spaces demonstrate the superiority of the DS-UI. Codes are available at https://github.com/PRIS-CV/DS-UI.",
                "authors": [
                    {
                        "name": "Guo J."
                    },
                    {
                        "name": "Ma Z."
                    },
                    {
                        "name": "Sun J."
                    },
                    {
                        "name": "Xie J."
                    },
                    {
                        "name": "Xue J.-H."
                    },
                    {
                        "name": "Zhang G."
                    },
                    {
                        "name": "Zheng Y."
                    }
                ],
                "date": "2021-01-01T00:00:00Z",
                "journal": "IEEE Transactions on Image Processing",
                "title": "DS-UI: Dual-supervised mixture of Gaussian mixture models for uncertainty inference in image recognition"
            },
            "pmid": "34739376"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ],
    "validated": 1
}
