{
    "additionDate": "2020-01-14T09:39:07Z",
    "biotoolsCURIE": "biotools:HVCoP",
    "biotoolsID": "HVCoP",
    "confidence_flag": "medium",
    "credit": [
        {
            "email": "jdwark@unimelb.edu.au",
            "name": "John D Wark",
            "orcidid": "https://orcid.org/0000-0003-2431-7902",
            "typeEntity": "Person"
        }
    ],
    "description": "Quantifying Use of a Health Virtual Community of Practice for General Practitioners' Continuing Professional Development.\n\nBACKGROUND:Health care practitioners (HPs), in particular general practitioners (GPs), are increasingly adopting Web-based social media platforms for continuing professional development (CPD). As GPs are restricted by time, distance, and demanding workloads, a health virtual community of practice (HVCoP) is an ideal solution to replace face-to-face CPD with Web-based CPD. However, barriers such as time and work schedules may limit participation in an HVCoP. Furthermore, it is difficult to gauge whether GPs engage actively or passively in HVCoP knowledge-acquisition for Web-based CPD, as GPs' competencies are usually measured with pre- and posttests.\n\n||| HOMEPAGE MISSING!.\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'GPs', 'Igloo', 'CPD'",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Anonymisation",
                    "uri": "http://edamontology.org/operation_3283"
                }
            ]
        }
    ],
    "homepage": "https://www.ncbi.nlm.nih.gov/pubmed/?term=31774401",
    "lastUpdate": "2020-01-14T09:39:07Z",
    "name": "HVCoP",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.2196/14545",
            "metadata": {
                "abstract": "© Abdulaziz Murad, Natalie Hyde, Shanton Chang, Reeva Lederman, Rachelle Bosua, Marie Pirotta, Ralph Audehm, Christopher J Yates, Andrew M Briggs, Alexandra Gorelik, Cherie Chiang, John D Wark.Background: Health care practitioners (HPs), in particular general practitioners (GPs), are increasingly adopting Web-based social media platforms for continuing professional development (CPD). As GPs are restricted by time, distance, and demanding workloads, a health virtual community of practice (HVCoP) is an ideal solution to replace face-to-face CPD with Web-based CPD. However, barriers such as time and work schedules may limit participation in an HVCoP. Furthermore, it is difficult to gauge whether GPs engage actively or passively in HVCoP knowledge-acquisition for Web-based CPD, as GPs’ competencies are usually measured with pre- and posttests. Objective: This study investigated a method for measuring the engagement features needed for an HVCoP (the Community Fracture Capture [CFC] Learning Hub) for learning and knowledge sharing among GPs for their CPD activity. Methods: A prototype CFC Learning Hub was developed using an Igloo Web-based social media software platform and involved a convenience sample of GPs interested in bone health topics. This Hub, a secure Web-based community site, included 2 key components: an online discussion forum and a knowledge repository (the Knowledge Hub). The discussion forum contained anonymized case studies (contributed by GP participants) and topical discussions (topics that were not case studies). Using 2 complementary tools (Google Analytics and Igloo Statistical Tool), we characterized individual participating GPs’ engagement with the Hub. We measured the GP participants’ behavior by quantifying the number of online sessions of the participants, activities undertaken within these online sessions, written posts made per learning topic, and their time spent per topic. We calculated time spent in both active and passive engagement for each topic. Results: Seven GPs participated in the CFC Learning Hub HVCoP from September to November 2017. The complementary tools successfully captured the GP participants’ engagement in the Hub. GPs were more active in topics in the discussion forum that had direct clinical application as opposed to didactic, evidence-based discussion topics (ie, topical discussions). From our knowledge hub, About Osteoporosis and Prevention were the most engaging topics, whereas shared decision making was the least active topic. Conclusions: We showcased a novel complementary analysis method that allowed us to quantify the CFC Learning Hub’s usage data into (1) sessions, (2) activities, (3) active or passive time spent, and (4) posts made to evaluate the potential engagement features needed for an HVCoP focused on GP participants’ CPD process. Our design and evaluation methods for ongoing use and engagement in this Hub may be useful to evaluate future learning and knowledge-sharing projects for GPs and may allow for extension to other HPs’ environments. However, owing to the limited number of GP participants in this study, we suggest that further research with a larger cohort should be performed to validate and extend these findings.",
                "authors": [
                    {
                        "name": "Murad A."
                    },
                    {
                        "name": "Hyde N."
                    },
                    {
                        "name": "Chang S."
                    },
                    {
                        "name": "Lederman R."
                    },
                    {
                        "name": "Bosua R."
                    },
                    {
                        "name": "Pirotta M."
                    },
                    {
                        "name": "Audehm R."
                    },
                    {
                        "name": "Yates C.J."
                    },
                    {
                        "name": "Briggs A.M."
                    },
                    {
                        "name": "Gorelik A."
                    },
                    {
                        "name": "Chiang C."
                    },
                    {
                        "name": "Wark J.D."
                    }
                ],
                "citationCount": 1,
                "date": "2019-11-01T00:00:00Z",
                "journal": "Journal of Medical Internet Research",
                "title": "Quantifying use of a health virtual community of practice for general practitioners’ continuing professional development: A novel methodology and pilot evaluation"
            },
            "pmcid": "PMC6906624",
            "pmid": "31774401"
        }
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Medicine",
            "uri": "http://edamontology.org/topic_3303"
        },
        {
            "term": "Data security",
            "uri": "http://edamontology.org/topic_3263"
        }
    ]
}