{
    "additionDate": "2021-01-18T08:11:25Z",
    "biotoolsCURIE": "biotools:dmlda-loclift",
    "biotoolsID": "dmlda-loclift",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "yubin@qust.edu.cn",
            "name": "Bin Yu",
            "typeEntity": "Person"
        }
    ],
    "description": "DMLDA-LocLIFT is a tool for identification of multi-label protein subcellular localization using direct multi-label linear discriminant analysis dimensionality reduction and Label-specIfic FeaTures classifier.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Dimensionality reduction",
                    "uri": "http://edamontology.org/operation_3935"
                },
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Subcellular localisation prediction",
                    "uri": "http://edamontology.org/operation_2489"
                }
            ]
        }
    ],
    "homepage": "https://github.com/QUST-AIBBDRC/DMLDA-LocLIFT/",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2021-03-01T18:47:51Z",
    "name": "DMLDA-LocLIFT",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1101/2020.03.06.980441"
        },
        {
            "doi": "10.1016/j.chemolab.2020.104148",
            "metadata": {
                "abstract": "© 2020 Elsevier B.V.Multi-label proteins occur in two or more subcellular locations, which play a vital role in cell development and metabolism. Prediction and analysis of multi-label subcellular localization (SCL) can present new perspective with drug target identification and new drug design. However, the prediction of multi-label protein SCL using biological experiments is expensive and labor-intensive. Therefore, predicting large-scale SCL with machine learning methods has turned into a popular study topic in bioinformatics. In this study, a novel multi-label learning methods for protein SCL prediction, called DMLDA-LocLIFT, is proposed. Firstly, the dipeptide composition (DC), encoding based on grouped weight (EBGW), pseudo amino acid composition (PseAAC), gene ontology (GO) and pseudo-position specific scoring matrix (PsePSSM) are employed to encode subcellular protein sequences. Then, using direct multi-label linear discriminant analysis (DMLDA) to get rid of noise information of the fused feature vector. Lastly, the first-best feature vectors are input into the multi-label learning with Label-specIfic FeaTures (LIFT) classifier to predict. The leave-one-out cross validation (LOOCV) shows that the overall actual accuracy on Gram-negative bacteria, Gram-positive bacteria, plant datasets, virus dataset and human dataset are 98.6%, 99.6%, 97.9%, 94.7% and 96.1% respectively, which are obviously better than other state-of-the-art prediction methods. The proposed model can effectively predict SCL of multi-label proteins and provide references for experimental identification of SCL. The source codes and datasets are available at https://github.com/QUST-AIBBDRC/DMLDA-LocLIFT/.",
                "authors": [
                    {
                        "name": "Han Y."
                    },
                    {
                        "name": "Li S."
                    },
                    {
                        "name": "Ma Q."
                    },
                    {
                        "name": "Yu B."
                    },
                    {
                        "name": "Zhang Q."
                    },
                    {
                        "name": "Zhang Q."
                    },
                    {
                        "name": "Zhang Y."
                    }
                ],
                "citationCount": 5,
                "date": "2020-11-15T00:00:00Z",
                "journal": "Chemometrics and Intelligent Laboratory Systems",
                "title": "DMLDA-LocLIFT: Identification of multi-label protein subcellular localization using DMLDA dimensionality reduction and LIFT classifier"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        },
        {
            "term": "Protein targeting and localisation",
            "uri": "http://edamontology.org/topic_0140"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
