{"credit":[{"email":"lwang@cs.cityu.edu.hk","name":"Lusheng Wang","typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://www.cs.cityu.edu.hk/~lwang/"}],"documentation":[{"type":"GENERAL","url":"http://www.cs.cityu.edu.hk/~lwang/software/mutationRegion/index.html"}],"function":[{"operation":[{"term":"Polymorphism detection","uri":"http://edamontology.org/operation_3202"}]}],"labels":{"language":["Java"],"operatingSystem":["Windows"],"toolType":["Command-line tool"],"topic":[{"term":"DNA mutation","uri":"http://edamontology.org/topic_2533"},{"term":"Genetics","uri":"http://edamontology.org/topic_3053"},{"term":"Genotype and phenotype","uri":"http://edamontology.org/topic_0625"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/mrd-finding-mutation-regions.html"}],"publication":[{"abstract":"Motivation: Motif detection for DNA sequences has many important applications in biological studies, e.g. locating binding sites regulatory signals, designing genetic probes etc. In this paper, we propose a randomized algorithm, design an improved EM algorithm and combine them to form a software tool. Results: (1) We design a randomized algorithm for consensus pattern problem. We can show that with high probability, our randomized algorithm finds a pattern in polynomial time with cost error at most ∈ X l for each string, where l is the length of the motif and ∈ can be any positive number given by the user. (2) We design an improved EM algorithm that outperforms the original EM algorithm. (3) We develop a software tool, MotifDetector, that uses our randomized algorithm to find good seeds and uses the improved EM algorithm to do local search. We compare MotifDetector with Buhler and Tompa's PROJECTION which is considered to be the best known software for motif detection. Simulations show that MotifDetector is slower than PROJECTION when the pattern length is relatively small, and outperforms PROJECTION when the pattern length becomes large. © Imperial College Press.","authors":["Wang L.","Dong L."],"cit_count":21,"journal":"Journal of Bioinformatics and Computational Biology","pmid":"16278946","title":"Randomized algorithms for motif detection","year":"2005-10-01"}],"summary":{"biotoolsCURIE":"biotools:mrd","biotoolsID":"mrd","description":"Software package for finding mutation regions where the input individuals are closely related, but the pedigree is not given. It takes the genotype data on a chromosome as well as the disease status for a set of input individuals without any pedigree information and outputs the predicted mutation regions.","homepage":"http://www.cs.cityu.edu.hk/~lwang/software/mutationRegion/index.html","name":"MRD"}}