{
    "accessibility": "Open access",
    "additionDate": "2023-01-25T22:08:40.634085Z",
    "biotoolsCURIE": "biotools:sparkec",
    "biotoolsID": "sparkec",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "roberto.rey.exposito@udc.es",
            "name": "Roberto R. Expósito",
            "orcidid": "https://orcid.org/0000-0002-2077-1473",
            "typeEntity": "Person"
        },
        {
            "name": "Juan Touriño"
        },
        {
            "name": "Marco Martínez-Sánchez"
        }
    ],
    "description": "Speeding up alignment-based DNA error correction tools.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "Phasing",
                    "uri": "http://edamontology.org/operation_3454"
                },
                {
                    "term": "k-mer counting",
                    "uri": "http://edamontology.org/operation_3472"
                }
            ]
        }
    ],
    "homepage": "https://github.com/UDC-GAC/SparkEC",
    "language": [
        "Java"
    ],
    "lastUpdate": "2024-11-24T15:09:27.917997Z",
    "license": "GPL-3.0",
    "name": "SparkEC",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1186/s12859-022-05013-1",
            "metadata": {
                "abstract": "Background: In recent years, huge improvements have been made in the context of sequencing genomic data under what is called Next Generation Sequencing (NGS). However, the DNA reads generated by current NGS platforms are not free of errors, which can affect the quality of downstream analysis. Although error correction can be performed as a preprocessing step to overcome this issue, it usually requires long computational times to analyze those large datasets generated nowadays through NGS. Therefore, new software capable of scaling out on a cluster of nodes with high performance is of great importance. Results: In this paper, we present SparkEC, a parallel tool capable of fixing those errors produced during the sequencing process. For this purpose, the algorithms proposed by the CloudEC tool, which is already proved to perform accurate corrections, have been analyzed and optimized to improve their performance by relying on the Apache Spark framework together with the introduction of other enhancements such as the usage of memory-efficient data structures and the avoidance of any input preprocessing. The experimental results have shown significant improvements in the computational times of SparkEC when compared to CloudEC for all the representative datasets and scenarios under evaluation, providing an average and maximum speedups of 4.9× and 11.9× , respectively, over its counterpart. Conclusion: As error correction can take excessive computational time, SparkEC provides a scalable solution for correcting large datasets. Due to its distributed implementation, SparkEC speed can increase with respect to the number of nodes in a cluster. Furthermore, the software is freely available under GPLv3 license and is compatible with different operating systems (Linux, Windows and macOS).",
                "authors": [
                    {
                        "name": "Exposito R.R."
                    },
                    {
                        "name": "Martinez-Sanchez M."
                    },
                    {
                        "name": "Tourino J."
                    }
                ],
                "citationCount": 2,
                "date": "2022-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "SparkEC: speeding up alignment-based DNA error correction tools"
            },
            "pmcid": "PMC9639292",
            "pmid": "36344928"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Software engineering",
            "uri": "http://edamontology.org/topic_3372"
        }
    ],
    "validated": 1
}
