{
    "additionDate": "2019-11-14T18:36:03Z",
    "biotoolsCURIE": "biotools:protein-domain-segmentor",
    "biotoolsID": "protein-domain-segmentor",
    "confidence_flag": "tool",
    "description": "A CNN for performing semantic segmantation of multi-domain protein structures. Multi-Scale Structural Analysis of Proteins by Deep Semantic Segmentation.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://www.proteindesign.org/segmentor-tutorial.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Fold recognition",
                    "uri": "http://edamontology.org/operation_0303"
                },
                {
                    "term": "Protein structure prediction",
                    "uri": "http://edamontology.org/operation_0474"
                }
            ]
        }
    ],
    "homepage": "https://github.com/egurapha/prot_domain_segmentor",
    "language": [
        "PyMOL",
        "Python"
    ],
    "lastUpdate": "2020-12-29T11:25:57Z",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/egurapha/prot_domain_segmentor/issues"
        }
    ],
    "name": "Protein Domain Segmentor",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ650",
            "metadata": {
                "abstract": "© The Author(s) 2019. Published by Oxford University Press. All rights reserved.Motivation: Recent advances in computational methods have facilitated large-scale sampling of protein structures, leading to breakthroughs in protein structural prediction and enabling de novo protein design. Establishing methods to identify candidate structures that can lead to native folds or designable structures remains a challenge, since few existing metrics capture high-level structural features such as architectures, folds and conformity to conserved structural motifs. Convolutional Neural Networks (CNNs) have been successfully used in semantic segmentation—a sub-field of image classification in which a class label is predicted for every pixel. Here, we apply semantic segmentation to protein structures as a novel strategy for fold identification and structure quality assessment. Results: We train a CNN that assigns each residue in a multi-domain protein to one of 38 architecture classes designated by the CATH database. Our model achieves a high per-residue accuracy of 90.8% on the test set (95.0% average per-class accuracy; 87.8% average per-structure accuracy). We demonstrate that individual class probabilities can be used as a metric that indicates the degree to which a randomly generated structure assumes a specific fold, as well as a metric that highlights non-conformative regions of a protein belonging to a known class. These capabilities yield a powerful tool for guiding structural sampling for both structural prediction and design.",
                "authors": [
                    {
                        "name": "Eguchi R.R."
                    },
                    {
                        "name": "Huang P.-S."
                    }
                ],
                "citationCount": 1,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Multi-scale structural analysis of proteins by deep semantic segmentation"
            },
            "pmid": "31424530"
        }
    ],
    "relation": [
        {
            "biotoolsID": "biopython",
            "type": "uses"
        }
    ],
    "toolType": [
        "Command-line tool",
        "Plug-in"
    ],
    "topic": [
        {
            "term": "Protein folds and structural domains",
            "uri": "http://edamontology.org/topic_0736"
        },
        {
            "term": "Protein structural motifs and surfaces",
            "uri": "http://edamontology.org/topic_0166"
        },
        {
            "term": "Structure prediction",
            "uri": "http://edamontology.org/topic_0082"
        }
    ],
    "validated": 1
}
