{
    "additionDate": "2020-01-09T18:27:33Z",
    "biotoolsCURIE": "biotools:vivasemtabaco",
    "biotoolsID": "vivasemtabaco",
    "confidence_flag": "tool",
    "description": "vivasemtabaco is a tool for comparing gain- and loss-framed ads for the purposes of an Internet-based smoking cessation intervention.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://www.vivasemtabaco.com.br/index.xhtml"
        }
    ],
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://github.com/crepeia/wati",
    "lastUpdate": "2021-01-16T18:04:33Z",
    "name": "vivasemtabaco",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1590/0102-311X00151318",
            "metadata": {
                "abstract": "© 2019 Fundacao Oswaldo Cruz. All rights reserved.Gain- and loss-framed messages about smoking behavior have commonly been used to promote cessation. However, there are still no clear conclusions as to what kind of message is more effective for motivating smokers to quit. This study compared the effectiveness of loss- and gain-framed messages in the online recruitment of smokers via Facebook Advertising. Loss- and gain-framed messages about smoking were created and released as Facebook ads. Users who clicked on the ads were automatically redirected to the “Live Without Tobacco” intervention (http://www.vivasemtabaco.com.br). The amount spent on the ads was BRL 647.64. Data were collected from the Facebook Ads platform and from a relational database. Analyses were performed on the 6,350 users who clicked on one of the ads and 1,731 who were successfully redirected to the intervention. Gain-framed ads reached 174,029 people and loss-framed ads reached 180,527. The former received 2,688 clicks, while the latter received 3,662. The cost of the click was BRL 0.12 per gain-framed ad and BRL 0.09 per loss-framed ad. Loss-framed ads reached more users, got more clicks (and website accesses), and led to more accounts and quit plans being created. Loss-framed messages about smoking appear to be more cost-effective for both initial recruitment and intervention engagement. Facebook has proven to be a good outreach and recruitment tool and can be a solution for the difficulty in reaching smokers for cessation interventions.",
                "authors": [
                    {
                        "name": "Machado N.M."
                    },
                    {
                        "name": "Gomide H.P."
                    },
                    {
                        "name": "Bernardino H.S."
                    },
                    {
                        "name": "Ronzani T.M."
                    }
                ],
                "citationCount": 2,
                "date": "2019-01-01T00:00:00Z",
                "journal": "Cadernos de Saude Publica",
                "title": "Facebook recruitment of smokers: Comparing gain- And loss-framed ads for the purposes of an Internet-based smoking cessation intervention"
            },
            "pmid": "31596400"
        }
    ],
    "topic": [
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "Pharmacology",
            "uri": "http://edamontology.org/topic_0202"
        },
        {
            "term": "Literature and language",
            "uri": "http://edamontology.org/topic_3068"
        }
    ],
    "validated": 1
}