
{
    "credit": [
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "R"
        ],
        "license": "GPL-3.0",
        "topic": [
            {
                "term": "Drug metabolism",
                "uri": "http://edamontology.org/topic_3375"
            },
            {
                "term": "Safety sciences",
                "uri": "http://edamontology.org/topic_3377"
            },
            {
                "term": "Physiology",
                "uri": "http://edamontology.org/topic_3300"
            },
            {
                "term": "Metabolomics",
                "uri": "http://edamontology.org/topic_3172"
            },
            {
                "term": "Small molecules",
                "uri": "http://edamontology.org/topic_0154"
            }
        ]
    },
    "link": [
        {
            "type": "Repository",
            "url": "https://sourceforge.net/projects/cardiacpbpk/"
        }
    ],
    "publication": [
        {
            "abstract": "© 2019 Elsevier LtdBackground and objective: Prediction of drug concentration in heart tissue is important in terms of drug safety and efficacy. This work presents the Open-Source CardiacPBPK platform for the prediction of the time-concentration profile of drugs, which could potentially reduce the risk of drug development failure due to cardiotoxicity. The objective of the CardiacPBPK development is to accelerate and simplify the in-silico toxicological assessment of new drugs, and to provide supportive material for the research community to use. Methods: The CardiacPBPK software provides a modular implementation of the PBPK model of heart tissue. It can be easily accessed via the Internet or installed locally. The graphical user interface and tabular design are easy to configure and use. Results: CardiacPBPK is a tool designed to predict and visualize the time-concentration profiles of a parent compound, and one metabolite, in venous plasma and heart tissue after oral or intravenous drug administration. CardiacPBPK is built on the R-environment framework and supports shiny application features such as interactive visualization of the results, and web applications interface by default. A shiny application refers to a computer program created with the use of shiny package in R. The application is freely available at https://github.com/jszlek/CardiacPBPK and https://sourceforge.net/projects/cardiacpbpk/. This open-source application runs on all platforms supporting R-environment (Linux, Windows, Mac OS X, Solaris). Conclusions: We demonstrate the application of CardiacPBPK by simulating the study of amitriptyline intoxication in the case of CYP2D6 genetic polymorphism.",
            "authors": [
                "Tylutki Z.",
                "Szlek J.",
                "Polak S."
            ],
            "cit_count": 0,
            "doi": "10.1016/J.COMPBIOMED.2019.103484",
            "journal": "Computers in Biology and Medicine",
            "pmid": "31606584",
            "title": "CardiacPBPK: A tool for the prediction and visualization of time-concentration profiles of drugs in heart tissue",
            "year": "2019-12-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:CardiacPBPK",
        "biotoolsID": "CardiacPBPK",
        "description": "A tool for the prediction and visualization of time-concentration profiles of drugs in heart tissue.\n\nCardiac mechanistic physiologically based pharmacokinetic simulation application.\n\nUser Interface (ui) application which implements PBPK models.\n\nPrediction of drug effect is valuable in terms of both safety and efficacy.\n\nphysiologically based pharmacokinetic-quantitative system.\n\n1) Download the tar.gz archive from the https: sourceforge.net projects cardiacpbpk files or clone github repository (if you have git packages installed in konsole terminal type ‘git clone https: github.com jszlek CardiacPBPK.git’)",
        "homepage": "https://github.com/jszlek/CardiacPBPK",
        "name": "CardiacPBPK"
    }
}