{
    "additionDate": "2019-11-14T18:33:20Z",
    "biotoolsCURIE": "biotools:SimVascular",
    "biotoolsID": "SimVascular",
    "confidence_flag": "tool",
    "description": "> MEDIUM CONFIDENCE! | > CORRECT NAME OF TOOL COULD ALSO BE 'vessel pathlines', 'vessel', 'FCNN', 'vessel pathline' | Accelerating cardiovascular model building with convolutional neural networks | The only fully opensource software package providing a complete pipeline from medical image data segmentation to patient specific blood flow simulation and analysis | Blood velocity distribution in CABG simulation | Blood velocity in coronary aneurism | SimVascular components svModel, svMesh, svPre, and svPost are provided under the full BSD license subject to the terms below: | Copyright © 1998-2007 Stanford University, Charles Taylor, Nathan Wilson, Ken Wang. See SimVascular Acknowledgements file for additional contributors to the source code",
    "editPermission": {
        "type": "public"
    },
    "homepage": "http://simvascular.github.io/",
    "lastUpdate": "2020-12-20T15:09:43Z",
    "name": "SimVascular",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1007/S11517-019-02029-3",
            "metadata": {
                "abstract": "© 2019, International Federation for Medical and Biological Engineering.The objective of this work is to reduce the user effort required for 2D segmentation when building patient-specific cardiovascular models using the SimVascular cardiovascular modeling software package. The proposed method uses a fully convolutional neural network (FCNN) to generate 2D cardiovascular segmentations. Given vessel pathlines, the neural network generates 2D vessel enhancement images along the pathlines. Thereafter, vessel segmentations are extracted using the marching-squares algorithm, which are then used to construct 3D cardiovascular models. The neural network is trained using a novel loss function, tailored for partially labeled segmentation data. An automated quality control method is also developed, allowing promising segmentations to be selected. Compared with a threshold and level set algorithm, the FCNN method improved 2D segmentation accuracy across several metrics. The proposed quality control approach further improved the average DICE score by 25.8%. In tests with users of SimVascular, when using quality control, users accepted 80% of segmentations produced by the best performing FCNN. The FCNN cardiovascular model building method reduces the amount of manual segmentation effort required for patient-specific model construction, by as much as 73%. This leads to reduced turnaround time for cardiovascular simulations. While the method was used for cardiovascular model building, it is applicable to general tubular structures.",
                "authors": [
                    {
                        "name": "Maher G."
                    },
                    {
                        "name": "Wilson N."
                    },
                    {
                        "name": "Marsden A."
                    }
                ],
                "citationCount": 7,
                "date": "2019-10-01T00:00:00Z",
                "journal": "Medical and Biological Engineering and Computing",
                "title": "Accelerating cardiovascular model building with convolutional neural networks"
            },
            "pmid": "31446517"
        }
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Cardiology",
            "uri": "http://edamontology.org/topic_3335"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        }
    ],
    "validated": 1
}