{
    "name": "AUGUSTUS", 
    "description": "AUGUSTUS is a eukaryotic gene prediction tool. It can integrate evidence, e.g. from RNA-Seq, ESTs, proteomics, but can also predict genes ab initio. The PPX extension to AUGUSTUS can take a protein sequence multiple sequence alignment as input to find new members of the family in a genome. It can be run through a web interface, or downloaded and run locally.", 
    "homepage": "http://bioinf.uni-greifswald.de/augustus", 
    "biotoolsID": "augustus", 
    "biotoolsCURIE": "biotools:augustus", 
    "version": [], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_0492", 
                    "term": "Multiple sequence alignment"
                }, 
                {
                    "uri": "http://edamontology.org/operation_2454", 
                    "term": "Gene prediction"
                }, 
                {
                    "uri": "http://edamontology.org/operation_0476", 
                    "term": "Ab initio structure prediction"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Web application"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_3512", 
            "term": "Gene transcripts"
        }, 
        {
            "uri": "http://edamontology.org/topic_3170", 
            "term": "RNA-seq"
        }, 
        {
            "uri": "http://edamontology.org/topic_0623", 
            "term": "Gene and protein families"
        }, 
        {
            "uri": "http://edamontology.org/topic_0121", 
            "term": "Proteomics"
        }
    ], 
    "operatingSystem": [
        "Linux", 
        "Mac"
    ], 
    "language": [
        "C++"
    ], 
    "license": "Artistic-1.0", 
    "collectionID": [
        "Animal and Crop Genomics", 
        "Proteomics"
    ], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [
        {
            "url": "https://github.com/Gaius-Augustus/Augustus", 
            "type": "Repository", 
            "note": null
        }, 
        {
            "url": "https://github.com/Gaius-Augustus/Augustus/issues", 
            "type": "Issue tracker", 
            "note": null
        }
    ], 
    "download": [], 
    "documentation": [
        {
            "url": "https://github.com/Gaius-Augustus/Augustus/blob/master/README.md", 
            "type": "General", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": null, 
            "pmid": "15215400", 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "AUGUSTUS: A web server for gene finding in eukaryotes", 
                "abstract": "We present a www server for AUGUSTUS, a novel software program for ab initio gene prediction in eukaryotic genomic sequences. Our method is based on a generalized Hidden Markov Model with a new method for modeling the intron length distribution. This method allows approximation of the true intron length distribution more accurately than do existing programs. For genomic sequence data from human and Drosophila melanogaster, the accuracy of AUGUSTUS is superior to existing gene-finding approaches. The advantage of our program becomes apparent especially for larger input sequences containing more than one gene. The server is available at http://augustus.gobics.de. © Oxford University Press 2004; all rights reserved.", 
                "date": "2004-07-01T00:00:00Z", 
                "citationCount": 383, 
                "authors": [
                    {
                        "name": "Stanke M."
                    }, 
                    {
                        "name": "Steinkamp R."
                    }, 
                    {
                        "name": "Waack S."
                    }, 
                    {
                        "name": "Morgenstern B."
                    }
                ], 
                "journal": "Nucleic Acids Research"
            }
        }, 
        {
            "doi": null, 
            "pmid": "16469098", 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "Gene prediction in eukaryotes with a generalized hidden Markov model that uses hints from external sources", 
                "abstract": "Background: In order to improve gene prediction, extrinsic evidence on the gene structure can be collected from various sources of information such as genome-genome comparisons and EST and protein alignments. However, such evidence is often incomplete and usually uncertain. The extrinsic evidence is usually not sufficient to recover the complete gene structure of all genes completely and the available evidence is often unreliable. Therefore extrinsic evidence is most valuable when it is balanced with sequence-intrinsic evidence. Results: We present a fairly general method for integration of external information. Our method is based on the evaluation of hints to potentially protein-coding regions by means of a Generalized Hidden Morkov Model (GHMM) that takes both intrinsic and extrinsic information into account. We used this method to extend the ab initio gene prediction program AUGUSTUS to a versatile tool that we call AUGUSTUS+. In this study, we focus on hints derived from matches to an EST or protein database, but our approach can be used to include arbitrary user-defined hints. Our method is only moderately effected by the length of a database match. Further, it exploits the information that can be derived from the absence of such matches. As a special case, AUGUSTUS+ can predict genes under user-defined constraints, e.g. if the positions of certain exons are known. With hints from EST and protein databases, our new approach was able to predict 89% of the exons in human chromosome 22 correctly. Conclusion: Sensitive probabilistic modeling of extrinsic evidence such as sequence database matches can increase gene prediction accuracy. When a match of a sequence interval to an EST or protein sequence is used it should be treated as compound information rather than as information about individual positions. © 2006 Stanke et al; licensee BioMed Central Ltd.", 
                "date": "2006-02-09T00:00:00Z", 
                "citationCount": 310, 
                "authors": [
                    {
                        "name": "Stanke M."
                    }, 
                    {
                        "name": "Schoffmann O."
                    }, 
                    {
                        "name": "Morgenstern B."
                    }, 
                    {
                        "name": "Waack S."
                    }
                ], 
                "journal": "BMC Bioinformatics"
            }
        }, 
        {
            "doi": null, 
            "pmid": "16845043", 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "AUGUSTUS: A b initio prediction of alternative transcripts", 
                "abstract": "AUGUSTUS is a software tool for gene prediction in eukaryotes based on a Generalized Hidden Markov Model, a probabilistic model of a sequence and its gene structure. Like most existing gene finders, the first version of AUGUSTUS returned one transcript per predicted gene and ignored the phenomenon of alternative splicing. Herein, we present a WWW server for an extended version of AUGUSTUS that is able to predict multiple splice variants. To our knowledge, this is the first ab initio gene finder that can predict multiple transcripts. In addition, we offer a motif searching facility, where user-defined regular expressions can be searched against putative proteins encoded by the predicted genes. The AUGUSTUS web interface and the downloadable open-source stand-alone program are freely available from http://augustus.gobics.de.", 
                "date": "2006-07-01T00:00:00Z", 
                "citationCount": 333, 
                "authors": [
                    {
                        "name": "Stanke M."
                    }, 
                    {
                        "name": "Keller O."
                    }, 
                    {
                        "name": "Gunduz I."
                    }, 
                    {
                        "name": "Hayes A."
                    }, 
                    {
                        "name": "Waack S."
                    }, 
                    {
                        "name": "Morgenstern B."
                    }
                ], 
                "journal": "Nucleic Acids Research"
            }
        }, 
        {
            "doi": null, 
            "pmid": "15980513", 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "AUGUSTUS: A web server for gene prediction in eukaryotes that allows user-defined constraints", 
                "abstract": "We present a WWW server for AUGUSTUS, a software for gene prediction in eukaryotic genomic sequences that is based on a generalized hidden Markov model, a probabilistic model of a sequence and its gene structure. The web server allows the user to impose constraints on the predicted gene structure. A constraint can specify the position of a splice site, a translation initiation site or a stop codon. Furthermore, it is possible to specify the position of known exons and intervals that are known to be exonic or intronic sequence. The number of constraints is arbitrary and constraints can be combined in order to pin down larger parts of the predicted gene structure. The result then is the most likely gene structure that complies with all given user constraints, if such a gene structure exists. The specification of constraints is useful when part of the gene structure is known, e.g. by expressed sequence tag or protein sequence alignments, or if the user wants to change the default prediction. The web interface and the downloadable stand-alone program are available free of charge at http://augustus.gobics.de/ submission. © 2005 Oxford University Press.", 
                "date": "2005-07-01T00:00:00Z", 
                "citationCount": 324, 
                "authors": [
                    {
                        "name": "Stanke M."
                    }, 
                    {
                        "name": "Morgenstern B."
                    }
                ], 
                "journal": "Nucleic Acids Research"
            }
        }, 
        {
            "doi": null, 
            "pmid": "182186", 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "The formation of deoxycholic acid in patients with type II and IV hyperlipoproteinaemia", 
                "abstract": "The formation of deoxycholic acid (D) was studied in 8 patients with Type II hyperlipoproteinaemia and in 6 with Type IV hyperlipoproteinaemia, using orally administered [2.4-3H]cholic acid and [24-14C]deoxycholic acid. The diet was standardized and of natural type. The mean values for fractional turn-over, pool size and D synthesis in the patients with Type II pattern were 0.23 days-1, 331 mg and 75 mg/day, respectively; in Type IV they were 0.39 days-, 587 mg and 191 mg/day. Compared with a group of healthy subjects, the pool size and formation of D were normal in Type IV, but significantly reduced in Type II. The mean conversion of cholic acid into the circulating pool of D was calculated to be 37% in Type II, and 38% in Type IV patients. Both these values are within normal limits. © 1976.", 
                "date": "1976-01-01T00:00:00Z", 
                "citationCount": 1, 
                "authors": [
                    {
                        "name": "Carella M."
                    }, 
                    {
                        "name": "Einarsson K."
                    }, 
                    {
                        "name": "Hellstrom K."
                    }
                ], 
                "journal": "Atherosclerosis"
            }
        }
    ], 
    "credit": [
        {
            "name": "Mario Stanke", 
            "email": "mario.stanke@uni-greifswald.de", 
            "url": null, 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "ELIXIR-EE", 
    "additionDate": "2017-02-10T11:35:09Z", 
    "lastUpdate": "2019-03-26T08:11:36Z", 
    "editPermission": {
        "type": "group", 
        "authors": [
            "animalandcropgenomics", 
            "proteomics.bio.tools"
        ]
    }, 
    "validated": 0, 
    "homepage_status": 0, 
    "elixir_badge": 0
}