
{
    "credit": [
        {
            "email": "mario.stanke@uni-greifswald.de",
            "name": "Mario Stanke",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "https://github.com/Gaius-Augustus/Augustus/blob/master/README.md"
        }
    ],
    "function": [
        {
            "note": "Gene prediction using experimental evidence (gene products)",
            "operation": [
                {
                    "term": "Gene prediction",
                    "uri": "http://edamontology.org/operation_2454"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Ab-initio gene prediction",
                    "uri": "http://edamontology.org/operation_3662"
                }
            ]
        },
        {
            "note": "Multi-genome annotation (simultaneous gene finding in multiple genomes)",
            "operation": [
                {
                    "term": "Homology-based gene prediction",
                    "uri": "http://edamontology.org/operation_3663"
                }
            ]
        },
        {
            "note": "Gene prediction using protein sequence profiles",
            "operation": [
                {
                    "term": "Homology-based gene prediction",
                    "uri": "http://edamontology.org/operation_3663"
                }
            ]
        },
        {
            "note": "Training the parameters for individual species of interest",
            "operation": [
                {
                    "term": "Operation",
                    "uri": "http://edamontology.org/operation_0004"
                }
            ]
        }
    ],
    "labels": {
        "collectionID": [
            "Animal and Crop Genomics",
            "Proteomics"
        ],
        "language": [
            "C++"
        ],
        "license": "Artistic-1.0",
        "maturity": "Mature",
        "operatingSystem": [
            "Linux",
            "Mac"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Gene transcripts",
                "uri": "http://edamontology.org/topic_3512"
            },
            {
                "term": "Gene and protein families",
                "uri": "http://edamontology.org/topic_0623"
            }
        ]
    },
    "link": [
        {
            "type": "Repository",
            "url": "https://github.com/Gaius-Augustus/Augustus"
        },
        {
            "type": "Issue tracker",
            "url": "https://github.com/Gaius-Augustus/Augustus/issues"
        }
    ],
    "publication": [
        {
            "abstract": "Motivation: The problem of finding the genes in eukaryotic DNA sequences by computational methods is still not satisfactorily solved. Gene finding programs have achieved relatively high accuracy on short genomic sequences but do not perform well on longer sequences with an unknown number of genes in them. Here existing programs tend to predict many false exons. Results: We have developed a new program, AUGUSTUS, for the ab initio prediction of protein coding genes in eukaryotic genomes. The program is based on a Hidden Markov Model and integrates a number of known methods and submodels. It employs a new way of modeling intron lengths. We use a new donor splice site model, a new model for a short region directly upstream of the donor splice site model that takes the reading frame into account and apply a method that allows better GC-content dependent parameter estimation. AUGUSTUS predicts on longer sequences far more human and drosophila genes accurately than the ab initio gene prediction programs we compared it with, while at the same time being more specific. Availability: A web interface for AUGUSTUS and the executable program are located at http://augustus.gobics. de. Supplementary Information: The datasets used for testing and training are available at http://augustus.gobics.de/datasets/. © Oxford University Press 2003; all rights reserved.",
            "authors": [
                "Stanke M.",
                "Waack S."
            ],
            "cit_count": 552,
            "doi": "10.1093/bioinformatics/btg1080",
            "journal": "Bioinformatics",
            "title": "Gene prediction with a hidden Markov model and a new intron submodel",
            "type": "Primary",
            "year": "2003-12-01"
        },
        {
            "abstract": "Background: In order to improve gene prediction, extrinsic evidence on the gene structure can be collected from various sources of information such as genome-genome comparisons and EST and protein alignments. However, such evidence is often incomplete and usually uncertain. The extrinsic evidence is usually not sufficient to recover the complete gene structure of all genes completely and the available evidence is often unreliable. Therefore extrinsic evidence is most valuable when it is balanced with sequence-intrinsic evidence. Results: We present a fairly general method for integration of external information. Our method is based on the evaluation of hints to potentially protein-coding regions by means of a Generalized Hidden Morkov Model (GHMM) that takes both intrinsic and extrinsic information into account. We used this method to extend the ab initio gene prediction program AUGUSTUS to a versatile tool that we call AUGUSTUS+. In this study, we focus on hints derived from matches to an EST or protein database, but our approach can be used to include arbitrary user-defined hints. Our method is only moderately effected by the length of a database match. Further, it exploits the information that can be derived from the absence of such matches. As a special case, AUGUSTUS+ can predict genes under user-defined constraints, e.g. if the positions of certain exons are known. With hints from EST and protein databases, our new approach was able to predict 89% of the exons in human chromosome 22 correctly. Conclusion: Sensitive probabilistic modeling of extrinsic evidence such as sequence database matches can increase gene prediction accuracy. When a match of a sequence interval to an EST or protein sequence is used it should be treated as compound information rather than as information about individual positions. © 2006 Stanke et al; licensee BioMed Central Ltd.",
            "authors": [
                "Stanke M.",
                "Schoffmann O.",
                "Morgenstern B.",
                "Waack S."
            ],
            "cit_count": 352,
            "doi": "10.1186/1471-2105-7-62",
            "journal": "BMC Bioinformatics",
            "title": "Gene prediction in eukaryotes with a generalized hidden Markov model that uses hints from external sources",
            "type": "Primary",
            "year": "2006-02-09"
        },
        {
            "doi": "10.1186/gb-2006-7-s1-s11",
            "type": "Usage"
        },
        {
            "abstract": "Motivation: Computational annotation of protein coding genes in genomic DNA is a widely used and essential tool for analyzing newly sequenced genomes. However, current methods suffer from inaccuracy and do poorly with certain types of genes. Including additional sources of evidence of the existence and structure of genes can improve the quality of gene predictions. For many eukaryotic genomes, expressed sequence tags (ESTs) are available as evidence for genes. Related genomes that have been sequenced, annotated, and aligned to the target genome provide evidence of existence and structure of genes. Results: We incorporate several different evidence sources into the gene finder AUGUSTUS. The sources of evidence are gene and transcript annotations from related species syntenically mapped to the target genome using TRANSMAP, evolutionary conservation of DNA, mRNA and ESTs of the target species, and retroposed genes. The predictions include alternative splice variants where evidence supports it. Using only ESTs we were able to correctly predict at least one splice form exactly correct in 57% of human genes. Also using evidence from other species and human mRNAs, this number rises to 77%. Syntenic mapping is well-suited to annotate genomes closely related to genomes that are already annotated or for which extensive transcript evidence is available. Native cDNA evidence is most helpful when the alignments are used as compound information rather than independent positionwise information. © 2008 The Author(s).",
            "authors": [
                "Stanke M.",
                "Diekhans M.",
                "Baertsch R.",
                "Haussler D."
            ],
            "cit_count": 451,
            "doi": "10.1093/bioinformatics/btn013",
            "journal": "Bioinformatics",
            "title": "Using native and syntenically mapped cDNA alignments to improve de novo gene finding",
            "type": "Primary",
            "year": "2008-03-01"
        },
        {
            "abstract": "Motivation: As improved DNA sequencing techniques have increased enormously the speed of producing new eukaryotic genome assemblies, the further development of automated gene prediction methods continues to be essential. While the classification of proteins into families is a task heavily relying on correct gene predictions, it can at the same time provide a source of additional information for the prediction, complementary to those presently used. Results: We extended the gene prediction software AUGUSTUS by a method that employs block profiles generated from multiple sequence alignments as a protein signature to improve the accuracy of the prediction. Equipped with profiles modelling human dynein heavy chain (DHC) proteins and other families, AUGUSTUS was run on the genomic sequences known to contain members of these families. Compared with AUGUSTUS' ab initio version, the rate of genes predicted with high accuracy showed a dramatic increase. © The Author 2011. Published by Oxford University Press. All rights reserved.",
            "authors": [
                "Keller O.",
                "Kollmar M.",
                "Stanke M.",
                "Waack S."
            ],
            "cit_count": 141,
            "doi": "10.1093/bioinformatics/btr010",
            "journal": "Bioinformatics",
            "title": "A novel hybrid gene prediction method employing protein multiple sequence alignments",
            "type": "Primary",
            "year": "2011-03-01"
        },
        {
            "abstract": "© 2016 The Author Published by Oxford University Press. All rights reserved. Motivation: As the tree of life is populated with sequenced genomes ever more densely, the new challenge is the accurate and consistent annotation of entire clades of genomes. We address this problem with a new approach to comparative gene finding that takes a multiple genome alignment of closely related species and simultaneously predicts the location and structure of protein-coding genes in all input genomes, thereby exploiting negative selection and sequence conservation. The model prefers potential gene structures in the different genomes that are in agreement with each other, or - if not - where the exon gains and losses are plausible given the species tree. We formulate the multi-species gene finding problem as a binary labeling problem on a graph. The resulting optimization problem is NP hard, but can be efficiently approximated using a subgradient-based dual decomposition approach. Results: The proposed method was tested on whole-genome alignments of 12 vertebrate and 12 Drosophila species. The accuracy was evaluated for human, mouse and Drosophila melanogaster and compared to competing methods. Results suggest that our method is well-suited for annotation of (a large number of) genomes of closely related species within a clade, in particular, when RNA-Seq data are available for many of the genomes. The transfer of existing annotations from one genome to another via the genome alignment is more accurate than previous approaches that are based on protein-spliced alignments, when the genomes are at close to medium distances.",
            "authors": [
                "Konig S.",
                "Romoth L.W.",
                "Gerischer L.",
                "Stanke M."
            ],
            "cit_count": 16,
            "doi": "10.1093/bioinformatics/btw494",
            "journal": "Bioinformatics",
            "title": "Simultaneous gene finding in multiple genomes",
            "type": "Primary",
            "year": "2016-11-15"
        },
        {
            "abstract": "© 2018 John Wiley & Sons, Inc.AUGUSTUS is a tool for finding protein-coding genes and their exon-intron structure in genomic sequences. It does not necessarily require additional experimental input, as it can be applied in so-called ab initio mode. However, extrinsic evidence from various sources such as transcriptome sequencing or the annotations of closely related genomes can be integrated in order to improve the accuracy and completeness of the annotation. AUGUSTUS can be applied to single genomes, or simultaneously to several aligned genomes. Here, we describe steps required for training AUGUSTUS for the annotation of individual genomes and the steps to do the actual structural annotation. Further, we describe the generation and integration of evidence from various sources of extrinsic evidence. © 2018 by John Wiley & Sons, Inc.",
            "authors": [
                "Hoff K.J.",
                "Stanke M."
            ],
            "cit_count": 5,
            "doi": "10.1002/cpbi.57",
            "journal": "Current Protocols in Bioinformatics",
            "title": "Predicting Genes in Single Genomes with AUGUSTUS",
            "type": "Usage",
            "year": "2019-03-01"
        },
        {
            "abstract": "© Springer Science+Business Media, LLC, part of Springer Nature 2019.BRAKER is a pipeline for highly accurate and fully automated gene prediction in novel eukaryotic genomes. It combines two major tools: GeneMark-ES/ET and AUGUSTUS. GeneMark-ES/ET learns its parameters from a novel genomic sequence in a fully automated fashion; if available, it uses extrinsic evidence for model refinement. From the protein-coding genes predicted by GeneMark-ES/ET, we select a set for training AUGUSTUS, one of the most accurate gene finding tools that, in contrast to GeneMark-ES/ET, integrates extrinsic evidence already into the gene prediction step. The first published version, BRAKER1, integrated genomic footprints of unassembled RNA-Seq reads into the training as well as into the prediction steps. The pipeline has since been extended to the integration of data on mapped cross-species proteins, and to the usage of heterogeneous extrinsic evidence, both RNA-Seq and protein alignments. In this book chapter, we briefly summarize the pipeline methodology and describe how to apply BRAKER in environments characterized by various combinations of external evidence.",
            "authors": [
                "Hoff K.J.",
                "Lomsadze A.",
                "Borodovsky M.",
                "Stanke M."
            ],
            "cit_count": 1,
            "doi": "10.1007/978-1-4939-9173-0_5",
            "journal": "Methods in Molecular Biology",
            "title": "Whole-genome annotation with BRAKER",
            "type": "Usage",
            "year": "2019-01-01"
        },
        {
            "abstract": "© Springer Science+Business Media, LLC, part of Springer Nature 2019.Comparing multiple related genomes can help to improve their structural annotation. The accuracy and consistency of the predicted exon–intron structures of the protein coding genes can be higher when considering all genomes at once rather than annotating one genome at a time. The comparative gene prediction algorithm of AUGUSTUS performs such a multi-genome annotation. A multiple alignment of genomes is used to exploit evolutionary clues to conservation and negative selection. Further, AUGUSTUS exploits the fact that orthologous genes typically have congruent exon–intron structures. Comparative AUGUSTUS simultaneously predicts the genes in all input genomes. In this chapter we walk the reader through a small example from eight vertebrate species, including the construction of an alignment of the input genomes and how to integrate RNA-Seq evidence from multiple species for gene finding.",
            "authors": [
                "Nachtweide S.",
                "Stanke M."
            ],
            "cit_count": 0,
            "doi": "10.1007/978-1-4939-9173-0_8",
            "journal": "Methods in Molecular Biology",
            "title": "Multi-genome annotation with AUGUSTUS",
            "type": "Usage",
            "year": "2019-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:augustus",
        "biotoolsID": "augustus",
        "description": "AUGUSTUS is a eukaryotic gene prediction tool. It can integrate evidence, e.g. from RNA-Seq, ESTs, proteomics, but can also predict genes ab initio. The PPX extension to AUGUSTUS can take a protein sequence multiple sequence alignment as input to find new members of the family in a genome. It can be run through a web interface (see https://bio.tools/webaugustus), or downloaded and run locally.",
        "homepage": "http://bioinf.uni-greifswald.de/augustus",
        "name": "AUGUSTUS"
    }
}