{
    "additionDate": "2020-01-14T09:08:25Z",
    "biotoolsCURIE": "biotools:PlantCircNet",
    "biotoolsID": "PlantCircNet",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "mchen@zju.edu.cn",
            "name": "Ming Chen",
            "typeEntity": "Person"
        }
    ],
    "description": "PlantCircNet is a database that provides plant circRNA-miRNA-gene regulatory networks, as well as circRNA information and circRNA expression profiles. It provides convenient search functions for circRNA-associated regulatory networks and enables users to retrieve regulatory interactions of interest by circRNAs, miRNAs and mRNAs across eight model species. Sequences search is also available. And an enrichment analysis tool has been provided for Gene Ontology categories of miRNA targets.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                },
                {
                    "term": "miRNA target prediction",
                    "uri": "http://edamontology.org/operation_0463"
                },
                {
                    "term": "miRNA expression analysis",
                    "uri": "http://edamontology.org/operation_3792"
                },
                {
                    "term": "Pathway or network visualisation",
                    "uri": "http://edamontology.org/operation_3083"
                }
            ]
        }
    ],
    "homepage": "http://bis.zju.edu.cn/plantcircnet/index.php",
    "lastUpdate": "2021-01-10T14:18:36Z",
    "name": "PlantCircNet",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/DATABASE/BAX089",
            "metadata": {
                "abstract": "© The Author(s) 2017. Published by Oxford University Press.Circular RNA (circRNA) is a novel type of endogenous noncoding RNA with covalently closed loop structures, which are widely expressed in various tissues and have functional implications in cellular processes. Acting as competing endogenous RNAs (ceRNAs), circRNAs are important regulators of miRNA activities. The identification of these circRNAs underlines the increasing complexity of ncRNA-mediated regulatory networks. However, more biological evidence is required to infer direct circRNA-miRNA associations while little attention has been paid to circRNAs in plants as compared to the abundant research in mammals. PlantCircNet is presented as an integrated database that provides visualized plant circRNA-miRNA-mRNA regulatory networks containing identified circRNAs in eight model plants. The bioinformatics integration of data from multiple sources reveals circRNA-miRNA-mRNA regulatory networks and helps identify mechanisms underlying metabolic effects of circRNAs. An enrichment analysis tool was implemented to detect significantly overrepresented Gene Ontology categories of miRNA targets. The genomic annotations, sequences and isoforms of circRNAs were also investigated. PlantCircNet provides a user-friendly interface for querying detailed information of specific plant circRNAs. The database may serve as a resource to facilitate plant circRNA research. Several circRNAs were identified to play potential regulatory roles in flower development and response to environmental stress from regulatory networks related with miR156a and AT5G59720, respectively. This present research indicated that circRNAs could be involved in diverse biological processes. Database URL: http://bis.zju.edu.cn/plantcircnet/index.php.",
                "authors": [
                    {
                        "name": "Zhang P."
                    },
                    {
                        "name": "Meng X."
                    },
                    {
                        "name": "Chen H."
                    },
                    {
                        "name": "Liu Y."
                    },
                    {
                        "name": "Xue J."
                    },
                    {
                        "name": "Zhou Y."
                    },
                    {
                        "name": "Chen M."
                    }
                ],
                "citationCount": 17,
                "date": "2017-01-01T00:00:00Z",
                "journal": "Database : the journal of biological databases and curation",
                "title": "PlantCircNet: a database for plant circRNA-miRNA-mRNA regulatory networks"
            },
            "pmcid": "PMC5727401",
            "pmid": "31725858"
        }
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Ontology and terminology",
            "uri": "http://edamontology.org/topic_0089"
        }
    ],
    "validated": 1
}