{
    "additionDate": "2021-01-18T12:23:18Z",
    "biotoolsCURIE": "biotools:wiz",
    "biotoolsID": "wiz",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "df334@cam.ac.uk",
            "name": "David Fairen-Jimenez",
            "typeEntity": "Person"
        },
        {
            "email": "p.moghadam@sheffield.ac.uk",
            "name": "Peyman Z. Moghadam",
            "typeEntity": "Person"
        }
    ],
    "description": "A Web-Based Tool for Interactive Visualization of Big Data.\n\nWiz is a web-based app for interactive data visualisation. \nWiz is a convienient tool for interactively plotting data. Wiz allows users to quickly explore their data with fast switching between plot types and data series. Built-in features allow users to filter their data, edit plot layouts, and even print high quality images of their graphs. Check out our original publication , the help guide, the video, and the info below to get started!.",
    "documentation": [
        {
            "type": [
                "Training material"
            ],
            "url": "https://wiz.shef.ac.uk/examples"
        },
        {
            "type": [
                "User manual"
            ],
            "url": "https://wiz.shef.ac.uk/help"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Editing",
                    "uri": "http://edamontology.org/operation_3096"
                },
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://wiz.shef.ac.uk",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-03-18T09:58:50Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/peymanzmoghadam/Wiz"
        }
    ],
    "name": "Wiz",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1016/J.PATTER.2020.100107",
            "metadata": {
                "abstract": "© 2020 The AuthorsIn an age of information, visualizing and discerning meaning from data is as important as its collection. Interactive data visualization addresses both fronts by allowing researchers to explore data beyond what static images can offer. Here, we present Wiz, a web-based application for handling and visualizing large amounts of data. Wiz does not require programming or downloadable software for its use and allows scientists and non-scientists to unravel the complexity of data by splitting their relationships through 5D visual analytics, performing multivariate data analysis, such as principal component and linear discriminant analyses, all in vivid, publication-ready figures. With the explosion of high-throughput practices for materials discovery, information streaming capabilities, and the emphasis on industrial digitalization and artificial intelligence, we expect Wiz to serve as an invaluable tool to have a broad impact in our world of big data. As data become bigger and more complex, ready-to-use visualization techniques are crucial in discovering patterns in unstructured data. Most methods to visualize big data effectively require access to commercial software or expertise in a programming language. Here, we introduce Wiz, a freely accessible web app that anyone with a browser can use to interactively visualize their data in multi-dimensions. Wiz serves as a framework for interactive dashboards that can be utilized by researchers to make their publication data available or commercially for Industry 4.0 applications via serving real-time data from process equipment. Wiz will continue to grow in functionality to be a one-stop-shop for both interactive data visualization and data analysis in the coming years. Data have become bigger than ever thanks to strides in computing and high-throughput experimental methods. Visualizing these large and complex datasets effectively requires the ability to quickly explore and interpret subsets of the data. Most tools for effective visualization require user programming or expensive commercial software. Wiz is a freely accessible web app that anyone with a browser can use to interactively visualize their data in multi-dimensions without any knowledge of a programming language.",
                "authors": [
                    {
                        "name": "Balzer C."
                    },
                    {
                        "name": "Fairen-Jimenez D."
                    },
                    {
                        "name": "Moghadam P.Z."
                    },
                    {
                        "name": "Oktavian R."
                    },
                    {
                        "name": "Zandi M."
                    }
                ],
                "citationCount": 2,
                "date": "2020-11-13T00:00:00Z",
                "journal": "Patterns",
                "title": "Wiz: A Web-Based Tool for Interactive Visualization of Big Data"
            },
            "pmcid": "PMC7691393",
            "pmid": "33294864"
        }
    ],
    "topic": [
        {
            "term": "Data visualisation",
            "uri": "http://edamontology.org/topic_0092"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        }
    ]
}
