{
    "additionDate": "2019-11-14T18:12:15Z",
    "biotoolsCURIE": "biotools:TeXP",
    "biotoolsID": "TeXP",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "mark@gersteinlab.org",
            "name": "Mark B. Gerstein",
            "orcidid": "https://orcid.org/0000-0002-9746-3719",
            "typeEntity": "Person"
        }
    ],
    "description": "Deconvolving the effects of pervasive and autonomous transcription of transposable elements | TeXP is a pipeline to gauge the autonomous transcription level of L1 subfamilies using short read RNA-seq data | #About TeXP is a pipeline for quantifying abundances of Transposable Elements transcripts from RNA-Seq data. TeXP is based on the assumption that RNA-seq reads overlapping Transposable Elements is a composition of pervasive transcription signal and autonomous transcription of Transposable Elements",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "RNA-Seq quantification",
                    "uri": "http://edamontology.org/operation_3800"
                },
                {
                    "term": "DNA transcription",
                    "uri": "http://edamontology.org/operation_0372"
                },
                {
                    "term": "Copy number estimation",
                    "uri": "http://edamontology.org/operation_3233"
                }
            ]
        }
    ],
    "homepage": "https://github.com/gersteinlab/texp",
    "language": [
        "R",
        "Shell",
        "Perl"
    ],
    "lastUpdate": "2020-12-28T11:40:31Z",
    "license": "Apache-2.0",
    "name": "TeXP",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PCBI.1007293",
            "metadata": {
                "abstract": "© 2019 Navarro et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.The Long interspersed nuclear element 1 (LINE-1) is a primary source of genetic variation in humans and other mammals. Despite its importance, LINE-1 activity remains difficult to study because of its highly repetitive nature. Here, we developed and validated a method called TeXP to gauge LINE-1 activity accurately. TeXP builds mappability signatures from LINE-1 subfamilies to deconvolve the effect of pervasive transcription from autonomous LINE-1 activity. In particular, it apportions the multiple reads aligned to the many LINE-1 instances in the genome into these two categories. Using our method, we evaluated well-established cell lines, cell-line compartments and healthy tissues and found that the vast majority (91.7%) of transcriptome reads overlapping LINE-1 derive from pervasive transcription. We validated TeXP by independently estimating the levels of LINE-1 autonomous transcription using ddPCR, finding high concordance. Next, we applied our method to comprehensively measure LINE-1 activity across healthy somatic cells, while backing out the effect of pervasive transcription. Unexpectedly, we found that LINE-1 activity is present in many normal somatic cells. This finding contrasts with earlier studies showing that LINE-1 has limited activity in healthy somatic tissues, except for neuroprogenitor cells. Interestingly, we found that the amount of LINE-1 activity was associated with the with the amount of cell turnover, with tissues with low cell turnover rates (e.g. the adult central nervous system) showing lower LINE-1 activity. Altogether, our results show how accounting for pervasive transcription is critical to accurately quantify the activity of highly repetitive regions of the human genome.",
                "authors": [
                    {
                        "name": "Navarro F.C.P."
                    },
                    {
                        "name": "Hoops J."
                    },
                    {
                        "name": "Bellfy L."
                    },
                    {
                        "name": "Cerveira E."
                    },
                    {
                        "name": "Zhu Q."
                    },
                    {
                        "name": "Zhang C."
                    },
                    {
                        "name": "Lee C."
                    },
                    {
                        "name": "Gerstein M.B."
                    }
                ],
                "citationCount": 7,
                "date": "2019-01-01T00:00:00Z",
                "journal": "PLoS Computational Biology",
                "title": "TeXP: Deconvolving the effects of pervasive and autonomous transcription of transposable elements"
            },
            "pmcid": "PMC6715295",
            "pmid": "31425522"
        }
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "PCR experiment",
            "uri": "http://edamontology.org/topic_3519"
        }
    ],
    "validated": 1
}