
{
    "credit": [
        {
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "https://github.com/databio/LOLAweb/issues"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "R",
            "Shell"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web service"
        ],
        "topic": [
            {
                "term": "Transcription factors and regulatory sites",
                "uri": "http://edamontology.org/topic_0749"
            },
            {
                "term": "Molecular interactions, pathways and networks",
                "uri": "http://edamontology.org/topic_0602"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© The Author(s) 2018. Published by Oxford University Press on behalf of Nucleic Acids Research. The past few years have seen an explosion of interest in understanding the role of regulatory DNA. This interest has driven large-scale production of functional genomics data and analytical methods. One popular analysis is to test for enrichment of overlaps between a query set of genomic regions and a database of region sets. In this way, new genomic data can be easily connected to annotations from external data sources. Here, we present an interactive interface for enrichment analysis of genomic locus overlaps using a web server called LOLAweb. LOLAweb accepts a set of genomic ranges from the user and tests it for enrichment against a database of region sets. LOLAweb renders results in an R Shiny application to provide interactive visualization features, enabling users to filter, sort, and explore enrichment results dynamically. LOLAweb is built and deployed in a Linux container, making it scalable to many concurrent users on our servers and also enabling users to download and run LOLAweb locally.",
            "authors": [
                "Nagraj V.P.",
                "Magee N.E.",
                "Sheffield N.C."
            ],
            "cit_count": 0,
            "doi": "10.1093/nar/gky464",
            "journal": "Nucleic Acids Research",
            "title": "LOLAweb: A containerized web server for interactive genomic locus overlap enrichment analysis",
            "year": "2018-07-02"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:lolaweb",
        "biotoolsID": "lolaweb",
        "description": "Interactive genomic locus overlap enrichment analysis.",
        "homepage": "http://lolaweb.databio.org",
        "name": "LOLAweb",
        "version": [
            "9a42c57c9"
        ]
    }
}