{"collectionID": [], "accessibility": [], "topic": [{"term": "Applied mathematics", "uri": "http://edamontology.org/topic_3569"}, {"term": "Pure mathematics", "uri": "http://edamontology.org/topic_3570"}, {"term": "Genetics", "uri": "http://edamontology.org/topic_3053"}], "owner": "mbs_import", "cost": null, "relation": [], "download": [], "validated": 1, "publication": [{"doi": "10.1186/1297-9686-44-32", "note": null, "version": null, "pmid": null, "type": "Primary", "pmcid": null, "metadata": {"title": "Statistical distributions of test statistics used for quantitative trait association mapping in structured populations", "abstract": "Background: Spurious associations between single nucleotide polymorphisms and phenotypes are a major issue in genome-wide association studies and have led to underestimation of type 1 error rate and overestimation of the number of quantitative trait loci found. Many authors have investigated the influence of population structure on the robustness of methods by simulation. This paper is aimed at developing further the algebraic formalization of power and type 1 error rate for some of the classical statistical methods used: simple regression, two approximate methods of mixed models involving the effect of a single nucleotide polymorphism (SNP) and a random polygenic effect (GRAMMAR and FASTA) and the transmission/disequilibrium test for quantitative traits and nuclear families. Analytical formulae were derived using matrix algebra for the first and second moments of the statistical tests, assuming a true mixed model with a polygenic effect and SNP effects. Results: The expectation and variance of the test statistics and their marginal expectations and variances according to the distribution of genotypes and estimators of variance components are given as a function of the relationship matrix and of the heritability of the polygenic effect. These formulae were used to compute type 1 error rate and power for any kind of relationship matrix between phenotyped and genotyped individuals for any level of heritability. For the regression method, type 1 error rate increased with the variability of relationships and with heritability, but decreased with the GRAMMAR method and was not affected with the FASTA and quantitative transmission/disequilibrium test methods. Conclusions: The formulae can be easily used to provide the correct threshold of type 1 error rate and to calculate the power when designing experiments or data collection protocols. The results concerning the efficacy of each method agree with simulation results in the literature but were generalized in this work. The power of the GRAMMAR method was equal to the power of the FASTA method at the same type 1 error rate. The power of the quantitative transmission/ disequilibrium test was low. In conclusion, the FASTA method, which is very close to the full mixed model, is recommended in association mapping studies. © 2012 Teyssèdre et al.; licensee BioMed Central Ltd.", "citationCount": 9, "authors": [{"name": "Teyssedre S."}, {"name": "Elsen J.-M."}, {"name": "Ricard A."}], "date": "2012-11-15T00:00:00Z", "journal": "Genetics Selection Evolution"}}], "homepage_status": 0, "credit": [{"typeRole": ["Primary contact"], "name": null, "url": "https://qgsp.jouy.inra.fr/index.php?option=com_content&view=article&id=54&Itemid=59", "gridid": null, "note": null, "orcidid": null, "typeEntity": "Person", "email": null}], "biotoolsCURIE": "biotools:robpower", "elixirPlatform": [], "elixirNode": [], "version": [], "elixir_badge": 0, "homepage": "https://qgsp.jouy.inra.fr/index.php?option=com_content&view=article&id=54&Itemid=59", "function": [{"note": null, "input": [], "operation": [{"term": "Modelling and simulation", "uri": "http://edamontology.org/operation_2426"}], "cmd": null, "output": []}], "lastUpdate": "2018-12-10T12:58:52Z", "otherID": [], "description": "R Program to compute algebric formulas in references to the article “Inuence of population structure on power and robustness of current association mapping tests”.", "toolType": ["Command-line tool"], "editPermission": {"type": "private", "authors": []}, "language": ["R"], "link": [{"url": "http://www.mybiosoftware.com/robpower-compute-algebric-formulaes.html", "note": null, "type": "Software catalogue"}], "biotoolsID": "robpower", "additionDate": "2017-12-18T00:12:09Z", "name": "RobPower", "license": null, "documentation": [{"url": "https://qgsp.jouy.inra.fr/index.php?option=com_content&view=article&id=54&Itemid=59", "note": null, "type": "General"}], "maturity": null, "confidence_flag": null, "operatingSystem": ["Linux", "Windows", "Mac"]}