{
    "name": "BamView", 
    "description": "Interactive Java application for visualising the large amounts of data stored for sequence reads which are aligned against a reference genome sequence", 
    "homepage": "http://bamview.sourceforge.net/", 
    "biotoolsID": "bamview", 
    "biotoolsCURIE": "biotools:bamview", 
    "version": [], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_0564", 
                    "term": "Sequence visualisation"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Desktop application"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_0080", 
            "term": "Sequence analysis"
        }
    ], 
    "operatingSystem": [
        "Linux", 
        "Windows", 
        "Mac"
    ], 
    "language": [
        "Java"
    ], 
    "license": "GPL-3.0", 
    "collectionID": [], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [], 
    "download": [], 
    "documentation": [
        {
            "url": "http://bamview.sourceforge.net", 
            "type": "General", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": "10.1093/bib/bbr073", 
            "pmid": null, 
            "pmcid": null, 
            "type": "Primary", 
            "version": null, 
            "metadata": {
                "title": "BamView: Visualizing and interpretation of next-generation sequencing read alignments", 
                "abstract": "So-called next-generation sequencing (NGS) has provided the ability to sequence on a massive scale at low cost, enabling biologists to perform powerful experiments and gain insight into biological processes. BamView has been developed to visualize and analyse sequence reads from NGS platforms, which have been aligned to a reference sequence. It is a desktop application for browsing the aligned or mapped reads [Ruffalo, M, LaFramboise, T, Koyutürk, M. Comparative analysis of algorithms for next-generation sequencing read alignment. Bioinformatics 2011;27:2790-6] at different levels of magnification, from nucleotide level, where the base qualities can be seen, to genome or chromosome level where overall coverage is shown. To enable in-depth investigation of NGS data, various views are provided that can be configured to highlight interesting aspects of the data. Multiple read alignment files can be overlaid to compare results from different experiments, and filters can be applied to facilitate the interpretation of the aligned reads. As well as being a standalone application it can be used as an integrated part of the Artemis genome browser, BamView allows the user to study NGS data in the context of the sequence and annotation of the reference genome. Single nucleotide polymorphism (SNP) density and candidate SNP sites can be highlighted and investigated, and read-pair information can be used to discover large structural insertions and deletions. The application will also calculate simple analyses of the read mapping, including reporting the read counts and reads per kilobase per million mapped reads (RPKM) for genes selected by the user. Availability: BamView and Artemis are freely available software. These can be downloaded from their home pages: http://bamview.sourceforge.net/; http://www.sanger.ac.uk/resources/software/artemis/. Requirements: Java 1.6 or higher. © The Author 2011. Published by Oxford University Press.", 
                "date": "2013-03-01T00:00:00Z", 
                "citationCount": 35, 
                "authors": [
                    {
                        "name": "Carver T."
                    }, 
                    {
                        "name": "Harris S.R."
                    }, 
                    {
                        "name": "Otto T.D."
                    }, 
                    {
                        "name": "Berriman M."
                    }, 
                    {
                        "name": "Parkhill J."
                    }, 
                    {
                        "name": "McQuillan J.A."
                    }
                ], 
                "journal": "Briefings in Bioinformatics"
            }
        }
    ], 
    "credit": [
        {
            "name": "BamView development team", 
            "email": "artemis@sanger.ac.uk", 
            "url": null, 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "seqwiki_import", 
    "additionDate": "2017-01-13T13:13:37Z", 
    "lastUpdate": "2018-12-10T12:58:56Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 1, 
    "homepage_status": 0, 
    "elixir_badge": 0
}