{
    "additionDate": "2022-10-20T15:47:13.376715Z",
    "biotoolsCURIE": "biotools:interd",
    "biotoolsID": "interd",
    "confidence_flag": "tool",
    "credit": [
        {
            "name": "Chixiang Chen"
        },
        {
            "name": "Mingyao Li"
        }
    ],
    "description": "Integrated and Robust Deconvolution algorithm to infer cell-type proportions from target bulk RNA-seq data. This package is able to effectively integrate deconvolution results from multiple scRNA-seq datasets and calibrates estimates from reference-based deconvolution by taking into account extra biological information as priors.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Deisotoping",
                    "uri": "http://edamontology.org/operation_3629"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "https://cran.r-project.org/web/packages/InteRD/index.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2024-11-24T15:26:26.226971Z",
    "license": "Artistic-2.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://cran.r-project.org/web/packages/InteRD/index.html"
        }
    ],
    "name": "InteRD",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btac563",
            "metadata": {
                "abstract": "Motivation: Cell-type deconvolution of bulk tissue RNA sequencing (RNA-seq) data is an important step toward understanding the variations in cell-type composition among disease conditions. Owing to recent advances in single-cell RNA sequencing (scRNA-seq) and the availability of large amounts of bulk RNA-seq data in disease-relevant tissues, various deconvolution methods have been developed. However, the performance of existing methods heavily relies on the quality of information provided by external data sources, such as the selection of scRNA-seq data as a reference and prior biological information. Results: We present the Integrated and Robust Deconvolution (InteRD) algorithm to infer cell-type proportions from target bulk RNA-seq data. Owing to the innovative use of penalized regression with a new evaluation criterion for deconvolution, InteRD has three primary advantages. First, it is able to effectively integrate deconvolution results from multiple scRNA-seq datasets. Second, InteRD calibrates estimates from reference-based deconvolution by taking into account extra biological information as priors. Third, the proposed algorithm is robust to inaccurate external information imposed in the deconvolution system. Extensive numerical evaluations and real-data applications demonstrate that InteRD yields more accurate and robust cell-type proportion estimates that agree well with known biology. Availability and implementation: The proposed InteRD framework is implemented in R and the package is available at https://cran.r-project.org/web/packages/InteRD/index.html.",
                "authors": [
                    {
                        "name": "Chen C."
                    },
                    {
                        "name": "Ionita M."
                    },
                    {
                        "name": "Leung Y.Y."
                    },
                    {
                        "name": "Li M."
                    },
                    {
                        "name": "Wang L.-S."
                    }
                ],
                "citationCount": 4,
                "date": "2022-10-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Omnibus and robust deconvolution scheme for bulk RNA sequencing data integrating multiple single-cell reference sets and prior biological knowledge"
            },
            "pmcid": "PMC9525013",
            "pmid": "35980155"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ],
    "validated": 1
}
