{
    "additionDate": "2021-01-18T09:29:49Z",
    "biotoolsCURIE": "biotools:gutmega",
    "biotoolsID": "gutmega",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "liuzx@sysucc.org.cn",
            "name": "Ze-Xian Liu",
            "typeEntity": "Person"
        },
        {
            "email": "lixiaox23@mail.sysu.edu.cn",
            "name": "Xiaoxing Li",
            "typeEntity": "Person"
        }
    ],
    "description": "a database of the human gut MEtaGenome Atlas.\n\nRecently numerous studies have identified that the perturbations in the gut microbiome were associated with human health, including diseases and cancers, even mental health. The recent development of high-throughput sequencing based metagenomics technologies such as 16S ribosomal RNA gene amplicon-based and genome-centric approaches have burst the profiling of the landscape for gut microbiome and the identification of human health related microbes. Here, we presented the gutMEGA database, which hosted the results of metagenomics studies.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                }
            ]
        }
    ],
    "homepage": "http://gutmega.omicsbio.info",
    "lastUpdate": "2021-01-30T10:18:17Z",
    "name": "gutMEGA",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1093/BIB/BBAA082",
            "metadata": {
                "abstract": "© The Author(s) 2020. Published by Oxford University Press. All rights reserved. For Permissions, please email: journals.permissions@oup.com.The gut microbiota plays important roles in human health through regulating both physiological homeostasis and disease emergence. The accumulation of metagenomic sequencing studies enables us to better understand the temporal and spatial variations of the gut microbiota under different physiological and pathological conditions. However, it is inconvenient for scientists to query and retrieve published data; thus, a comprehensive resource for the quantitative gut metagenome is urgently needed. In this study, we developed gut MEtaGenome Atlas (gutMEGA), a well-annotated comprehensive database, to curate and host published quantitative gut microbiota datasets from Homo sapiens. By carefully curating the gut microbiota composition, phenotypes and experimental information, gutMEGA finally integrated 59 132 quantification events for 6457 taxa at seven different levels (kingdom, phylum, class, order, family, genus and species) under 776 conditions. Moreover, with various browsing and search functions, gutMEGA provides a fast and simple way for users to obtain the relative abundances of intestinal microbes among phenotypes. Overall, gutMEGA is a convenient and comprehensive resource for gut metagenome research, which can be freely accessed at http://gutmega.omicsbio.info.",
                "authors": [
                    {
                        "name": "Zhang Q."
                    },
                    {
                        "name": "Yu K."
                    },
                    {
                        "name": "Li S."
                    },
                    {
                        "name": "Zhang X."
                    },
                    {
                        "name": "Zhao Q."
                    },
                    {
                        "name": "Zhao X."
                    },
                    {
                        "name": "Liu Z."
                    },
                    {
                        "name": "Cheng H."
                    },
                    {
                        "name": "Liu Z.-X."
                    },
                    {
                        "name": "Li X."
                    }
                ],
                "citationCount": 2,
                "date": "2021-05-20T00:00:00Z",
                "journal": "Briefings in bioinformatics",
                "title": "gutMEGA: a database of the human gut MEtaGenome Atlas"
            },
            "pmid": "32496513"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Microbial ecology",
            "uri": "http://edamontology.org/topic_3697"
        },
        {
            "term": "Psychiatry",
            "uri": "http://edamontology.org/topic_3419"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        }
    ]
}