{
    "additionDate": "2020-01-14T08:52:08Z",
    "biotoolsCURIE": "biotools:VariCarta",
    "biotoolsID": "VariCarta",
    "confidence_flag": "high",
    "description": "A Comprehensive Database of Harmonized Genomic Variants Found in Autism Spectrum Disorder Sequencing Studies.\n\nVariCarta is a curated, web-based database housing ASD-linked genes created from the meta-analysis of -omic sequencing literature.\n\nVariCarta is a database of human DNA genetic variants found in individuals diagnosed with Autism Spectrum Disorder (ASD) and reported in peer-reviewed scientific literature.\n\n||| COMMON LINK WITH (PUB. & NAME DIFFERENT) bio.tools/matrix2png (MSL.UBC.CA), bio.tools/erminej (MSL.UBC.CA)",
    "download": [
        {
            "type": "Downloads page",
            "url": "http://varicarta.msl.ubc.ca/downloads"
        }
    ],
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Variant prioritisation",
                    "uri": "http://edamontology.org/operation_3226"
                },
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                }
            ]
        }
    ],
    "homepage": "http://varicarta.msl.ubc.ca",
    "lastUpdate": "2020-01-14T08:52:08Z",
    "link": [
        {
            "type": "Other",
            "url": "http://varicarta.msl.ubc.ca/variant?chr=5&start=134059281&stop=134059281"
        },
        {
            "type": "Other",
            "url": "http://varicarta.msl.ubc.ca/publications"
        },
        {
            "type": "Other",
            "url": "http://varicarta.msl.ubc.ca/stats"
        },
        {
            "type": "Other",
            "url": "http://varicarta.msl.ubc.ca/variant?chr=20&start=49510027&stop=49510027"
        }
    ],
    "name": "VariCarta",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1002/AUR.2236",
            "metadata": {
                "abstract": "© 2019 International Society for Autism Research, Wiley Periodicals, Inc.Recent years have seen a boom in the application of the next-generation sequencing technology to the study of human disorders, including Autism Spectrum Disorder (ASD), where the focus has been on identifying rare, possibly causative genomic variants in ASD individuals. Because of the high genetic heterogeneity of ASD, a large number of subjects is needed to establish evidence for a variant or gene ASD-association, thus aggregating data across cohorts and studies is necessary. However, methodological inconsistencies and subject overlap across studies complicate data aggregation. Here we present VariCarta, a web-based database developed to address these challenges by collecting, reconciling, and consistently cataloging literature-derived genomic variants found in ASD subjects using ongoing semi-manual curation. The careful manual curation combined with a robust data import pipeline rectifies errors, converts variants into a standardized format, identifies and harmonizes cohort overlaps, and documents data provenance. The harmonization aspect is especially important since it prevents the potential double counting of variants, which can lead to inflation of gene-based evidence for ASD-association. The database currently contains 170,416 variant events from 10,893 subjects, collected across 61 publications, and reconciles 16,202 variants that have been reported in literature multiple times. VariCarta is freely accessible at http://varicarta.msl.ubc.ca. Autism Res 2019, 12: 1728–1736. © 2019 International Society for Autism Research, Wiley Periodicals, Inc. Lay Summary: The search for genetic factors underlying Autism Spectrum Disorder (ASD) yielded numerous studies reporting potentially causative genomic variants found in ASD individuals. However, methodological differences and subject overlap across studies complicate the assembly of these data, diminishing its utility and accessibility. We developed VariCarta, a web-based database that aggregates carefully curated, annotated, and harmonized literature-derived variants identified in individuals with ASD using ongoing semi-manual curation.",
                "authors": [
                    {
                        "name": "Belmadani M."
                    },
                    {
                        "name": "Jacobson M."
                    },
                    {
                        "name": "Holmes N."
                    },
                    {
                        "name": "Phan M."
                    },
                    {
                        "name": "Nguyen T."
                    },
                    {
                        "name": "Pavlidis P."
                    },
                    {
                        "name": "Rogic S."
                    }
                ],
                "date": "2019-12-01T00:00:00Z",
                "journal": "Autism Research",
                "title": "VariCarta: A Comprehensive Database of Harmonized Genomic Variants Found in Autism Spectrum Disorder Sequencing Studies"
            },
            "pmid": "31705629"
        }
    ],
    "topic": [
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Literature and language",
            "uri": "http://edamontology.org/topic_3068"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Phenomics",
            "uri": "http://edamontology.org/topic_3298"
        },
        {
            "term": "Data submission, annotation and curation",
            "uri": "http://edamontology.org/topic_0219"
        }
    ]
}