{
    "additionDate": "2021-01-18T08:00:17Z",
    "biotoolsCURIE": "biotools:ncrpheno",
    "biotoolsID": "ncrpheno",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "liweizhong@mail.sysu.edu.cn",
            "name": "Weizhong Li",
            "orcidid": "https://orcid.org/0000-0002-9003-7733",
            "typeEntity": "Person"
        }
    ],
    "description": "a comprehensive database platform for identification and validation of disease related noncoding RNAs.\n\nMar 26, 2020: ncRPheno was published on the journal of RNA Biology...\n\nncRPheno is a comprehensive database that provides experimentally supported associations between noncoding RNAs (ncRNAs, including miRNA, lncRNA, circRNA, snoRNA and piRNA etc.) and disease phenotypes across 11 species (including Homo sapiens, Mus musculus, Rattus norvegicus, Macaca mulatta, Sus scrofa, Pan troglodytes, Marmoset, Gallus gallus, Canis familiaris, Zebrafish and Rabbit). ncRNAs have been experimentally validated as a novel class of biomarkers and potential drug targets for disease diagnosis, therapy and prognosis.\n\n||| COMMON LINK WITH (PUB. & NAME DIFFERENT) bio.tools/starbase (SYSU.EDU.CN)",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "miRNA expression analysis",
                    "uri": "http://edamontology.org/operation_3792"
                },
                {
                    "term": "Validation",
                    "uri": "http://edamontology.org/operation_2428"
                },
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                }
            ]
        }
    ],
    "homepage": "http://lilab2.sysu.edu.cn/ncrpheno",
    "lastUpdate": "2021-03-08T09:52:25Z",
    "name": "ncRPheno",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1080/15476286.2020.1737441",
            "metadata": {
                "abstract": "© 2020, © 2020 Informa UK Limited, trading as Taylor & Francis Group.Noncoding RNAs (ncRNAs) play critical roles in many critical biological processes and have become a novel class of potential targets and bio-markers for disease diagnosis, therapy, and prognosis. Annotating and analysing ncRNA-disease association data are essential but challenging. Current computational resources lack comprehensive database platforms to consistently interpret and prioritize ncRNA-disease association data for biomedical investigation and application. Here, we present the ncRPheno database platform (http://lilab2.sysu.edu.cn/ncrpheno), which comprehensively integrates and annotates ncRNA-disease association data and provides novel searches, visualizations, and utilities for association identification and validation. ncRPheno contains 482,751 non-redundant associations between 14,494 ncRNAs and 3,210 disease phenotypes across 11 species with supporting evidence in the literature. A scoring model was refined to prioritize the associations based on evidential metrics. Moreover, ncRPheno provides user-friendly web interfaces, novel visualizations, and programmatic access to enable easy exploration, analysis, and utilization of the association data. A case study through ncRPheno demonstrated a comprehensive landscape of ncRNAs dysregulation associated with 22 cancers and uncovered 821 cancer-associated common ncRNAs. As a unique database platform, ncRPheno outperforms the existing similar databases in terms of data coverage and utilities, and it will assist studies in encoding ncRNAs associated with phenotypes ranging from genetic disorders to complex diseases. Abbreviations: APIs: application programming interfaces; circRNA: circular RNA; ECO: Evidence & Conclusion Ontology; EFO: Experimental Factor Ontology; FDR: false discovery rate; GO: Gene Ontology; GWAS: genome wide association studies; HPO: Human Phenotype Ontology; ICGC: International Cancer Genome Consortium; lncRNA: long noncoding RNA; miRNA: micro RNA; ncRNA: noncoding RNA; NGS: next generation sequencing; OMIM: Online Mendelian Inheritance in Man; piRNA: piwi-interacting RNA; snoRNA: small nucleolar RNA; TCGA: The Cancer Genome Atlas.",
                "authors": [
                    {
                        "name": "Zhang W."
                    },
                    {
                        "name": "Yao G."
                    },
                    {
                        "name": "Wang J."
                    },
                    {
                        "name": "Yang M."
                    },
                    {
                        "name": "Wang J."
                    },
                    {
                        "name": "Zhang H."
                    },
                    {
                        "name": "Li W."
                    }
                ],
                "citationCount": 6,
                "date": "2020-07-02T00:00:00Z",
                "journal": "RNA Biology",
                "title": "ncRPheno: a comprehensive database platform for identification and validation of disease related noncoding RNAs"
            },
            "pmcid": "PMC7549653",
            "pmid": "32122231"
        }
    ],
    "toolType": [
        "Database portal",
        "Web application"
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "GWAS study",
            "uri": "http://edamontology.org/topic_3517"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        }
    ]
}