{
    "accessibility": "Open access",
    "additionDate": "2024-01-10T19:24:50.373525Z",
    "biotoolsCURIE": "biotools:d-orb",
    "biotoolsID": "d-orb",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "François Major",
            "typeEntity": "Person"
        },
        {
            "name": "Mathieu J Dupont",
            "typeEntity": "Person"
        }
    ],
    "description": "Web server to extract structural features of related but unaligned RNA sequences.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "RNA secondary structure alignment",
                    "uri": "http://edamontology.org/operation_0502"
                },
                {
                    "term": "RNA secondary structure prediction",
                    "uri": "http://edamontology.org/operation_0278"
                },
                {
                    "term": "RNA structure covariance model generation",
                    "uri": "http://edamontology.org/operation_3469"
                }
            ]
        }
    ],
    "homepage": "https://d-orb.major.iric.ca/",
    "lastUpdate": "2024-01-10T19:24:50.378081Z",
    "name": "D-ORB",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1016/J.JMB.2023.168181",
            "metadata": {
                "abstract": "Identifying the common structural elements of functionally related RNA sequences (family) is usually based on an alignment of the sequences, which is often subject to human bias and may not be accurate. The resulting covariance model (CM) provides probabilities for each base to covary with another, which allows to support evolutionarily the formation of double helical regions and possibly pseudoknots. The coexistence of alternative folds in RNA, resulting from its dynamic nature, may lead to the potential omission of motifs by CM. To overcome this limitation, we present D-ORB, a system of algorithms that identifies overrepresented motifs in the secondary conformational landscapes of a family when compared to those of unrelated sequences. The algorithms are bundled into an easy-to-use website allowing users to submit a family, and optionally provide unrelated sequences. D-ORB produces a non-pseudoknotted secondary structure based on the overrepresented motifs, a deep neural network classifier and two decision trees. When used to model an Rfam family, D-ORB fits overrepresented motifs in the corresponding Rfam structure; more than a hundred Rfam families have been modeled. The statistical approach behind D-ORB derives the structural composition of an RNA family, making it a valuable tool for analyzing and modeling it. Its easy-to-use interface and advanced algorithms make it an essential resource for researchers studying RNA structure. D-ORB is available at https://d-orb.major.iric.ca/.",
                "authors": [
                    {
                        "name": "Dupont M.J."
                    },
                    {
                        "name": "Major F."
                    }
                ],
                "date": "2023-08-01T00:00:00Z",
                "journal": "Journal of Molecular Biology",
                "title": "D-ORB: A Web Server to Extract Structural Features of Related But Unaligned RNA Sequences"
            },
            "pmid": "37468182"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Nucleic acid structure analysis",
            "uri": "http://edamontology.org/topic_0097"
        },
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Sequence sites, features and motifs",
            "uri": "http://edamontology.org/topic_0160"
        }
    ]
}
