{
    "additionDate": "2023-02-06T07:23:04.525538Z",
    "biotoolsCURIE": "biotools:iamap-scm",
    "biotoolsID": "iamap-scm",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "watshara.sho@mahidol.ac.th",
            "name": "Watshara Shoombuatong",
            "orcidid": "https://orcid.org/0000-0002-3394-8709",
            "typeEntity": "Person"
        },
        {
            "email": "pramote.c@ku.th",
            "name": "Pramote Chumnanpuen",
            "typeEntity": "Person"
        }
    ],
    "description": "A Novel Computational Tool for Large-Scale Identification of Antimalarial Peptides Using Estimated Propensity Scores of Dipeptides.\n\nWelcome to the Home Page of iAMAP-SCM.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Molecular docking",
                    "uri": "http://edamontology.org/operation_0478"
                },
                {
                    "term": "Peptide identification",
                    "uri": "http://edamontology.org/operation_3631"
                },
                {
                    "term": "Protein structure validation",
                    "uri": "http://edamontology.org/operation_0321"
                }
            ]
        }
    ],
    "homepage": "http://pmlabstack.pythonanywhere.com/iAMAP-SCM",
    "lastUpdate": "2024-11-24T15:05:21.528550Z",
    "license": "Other",
    "name": "iAMAP-SCM",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1021/acsomega.2c04465",
            "metadata": {
                "abstract": "Antimalarial peptides (AMAPs) varying in length, amino acid composition, charge, conformational structure, hydrophobicity, and amphipathicity reflect their diversity in antimalarial mechanisms. Due to the worldwide major health problem concerning antimicrobial resistance, these peptides possess great therapeutic value owing to their low incidences of drug resistance as compared to conventional antibiotics. Although well-known experimental methods are able to precisely determine the antimalarial activity of peptides, these methods are still time-consuming and costly. Thus, machine learning (ML)-based methods that are capable of identifying AMAPs rapidly by using only sequence information would be beneficial for the high-throughput identification of AMAPs. In this study, we propose the first computational model (termed iAMAP-SCM) for the large-scale identification and characterization of peptides with antimalarial activity by using only sequence information. Specifically, we employed an interpretable scoring card method (SCM) to develop iAMAP-SCM and estimate propensities of 20 amino acids and 400 dipeptides to be AMAPs in a supervised manner. Experimental results showed that iAMAP-SCM could achieve a maximum accuracy and Matthew's coefficient correlation of 0.957 and 0.834, respectively, on the independent test dataset. In addition, SCM-derived propensities of 20 amino acids and selected physicochemical properties were used to provide an understanding of the functional mechanisms of AMAPs. Finally, a user-friendly online computational platform of iAMAP-SCM is publicly available at http://pmlabstack.pythonanywhere.com/iAMAP-SCM. The iAMAP-SCM predictor is anticipated to assist experimental scientists in the high-throughput identification of potential AMAP candidates for the treatment of malaria and other clinical applications.",
                "authors": [
                    {
                        "name": "Charoenkwan P."
                    },
                    {
                        "name": "Chumnanpuen P."
                    },
                    {
                        "name": "Lio P."
                    },
                    {
                        "name": "Moni M.A."
                    },
                    {
                        "name": "Schaduangrat N."
                    },
                    {
                        "name": "Shoombuatong W."
                    }
                ],
                "citationCount": 5,
                "date": "2022-11-15T00:00:00Z",
                "journal": "ACS Omega",
                "title": "iAMAP-SCM: A Novel Computational Tool for Large-Scale Identification of Antimalarial Peptides Using Estimated Propensity Scores of Dipeptides"
            },
            "pmcid": "PMC9670693",
            "pmid": "36406571"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
