{
    "additionDate": "2017-02-14T09:35:41Z",
    "biotoolsCURIE": "biotools:plecdom",
    "biotoolsID": "plecdom",
    "credit": [
        {
            "email": "gy@nipgr.res.in",
            "name": "Support",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Program for the detection of Plant Lectin Domains in a polypeptide or EST sequence. In the web server, users evaluate their input sequence for lectin domains, classify the identified domains into substrate classes, estimate the extent of divergence of new domains, extract domain boundaries and examine flanking sequence.",
    "documentation": [
        {
            "type": "General",
            "url": "http://www.nipgr.res.in/plecdom.tutorial.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Prediction and recognition",
                    "uri": "http://edamontology.org/operation_2423"
                }
            ]
        }
    ],
    "homepage": "http://www.nipgr.res.in/plecdom.html",
    "homepage_status": 1,
    "lastUpdate": "2018-12-10T12:58:57Z",
    "name": "PLecDom",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "PLecDom is a program for detection of Plant Lectin Domains in a polypeptide or EST sequence, followed by a classification of the identified domains into known families. The web server is a collection of plant lectin domain families represented by alignments and profile Hidden Markov Models. PLecDom was developed after a rigorous analysis of evolutionary relationships between available sequences of lectin domains with known specificities. Users can test their sequences for potential lectin domains, catalog the identified domains into broad substrate classes, estimate the extent of divergence of new domains with existing homologs, extract domain boundaries and examine flanking sequences for further analysis. The high prediction accuracy of PLecDom combined with the ease with which it handles large scale input, enabled us to apply the program to protein and EST data from 48 plant genome-sequencing projects in various stages of completion. Our results represent a significant enrichment of the currently annotated plant lectins, and highlight potential targets for biochemical characterization. The search algorithm requires input in fasta format and is designed to process simultaneous connection requests from multiple users, such that huge sets of input sequences can be scanned in a matter of seconds. PLecDom is available at http://www.nipgr.res.in/plecdom.html.",
                "authors": [
                    {
                        "name": "Shridhar S."
                    },
                    {
                        "name": "Chattopadhyay D."
                    },
                    {
                        "name": "Yadav G."
                    }
                ],
                "citationCount": 7,
                "date": "2009-08-04T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "PLecDom: A program for identification and analysis of plant lectin domains"
            },
            "pmid": "19474338"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Plants",
            "uri": "http://edamontology.org/topic_0780"
        },
        {
            "term": "Protein folds and structural domains",
            "uri": "http://edamontology.org/topic_0736"
        },
        {
            "term": "Protein structure analysis",
            "uri": "http://edamontology.org/topic_2814"
        }
    ],
    "validated": 1
}