{
    "additionDate": "2021-01-18T12:33:41Z",
    "biotoolsCURIE": "biotools:crispridentify",
    "biotoolsID": "crispridentify",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "backofen@informatik.uni-freiburg.de",
            "name": "Rolf Backofen",
            "typeEntity": "Person"
        }
    ],
    "description": "CRISPRidentify is a tool to search for CRISPR arrays which utilises machine learning approach for distinguishing false candidates from true CRISPRS. CRISPRidentify, performs three steps: detection, feature extraction and classification based on manually curated sets of positive and negative examples of CRISPR arrays. The identified CRISPR arrays are then reported to the user accompanied by detailed annotation. We demonstrate that our approach identifies not only previously detected CRISPR arrays, but also CRISPR array candidates not detected by other tools. Compared to other methods, our tool has a drastically reduced false positive rate. In contrast to the existing tools, CRISPRidentify approach not only provides the user with the basic statistics on the identified CRISPR arrays but also produces a certainty score as an intuitive measure of the likelihood that a given genomic region is a CRISPR array.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genome indexing",
                    "uri": "http://edamontology.org/operation_3211"
                },
                {
                    "term": "Repeat sequence detection",
                    "uri": "http://edamontology.org/operation_0379"
                },
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                }
            ]
        }
    ],
    "homepage": "https://github.com/BackofenLab/CRISPRidentify",
    "language": [
        "Python",
        "C"
    ],
    "lastUpdate": "2021-02-18T15:32:21Z",
    "name": "CRISPRidentify",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/NAR/GKAA1158",
            "metadata": {
                "abstract": "© The Author(s) 2020. Published by Oxford University Press on behalf of Nucleic Acids Research.CRISPR-Cas are adaptive immune systems that degrade foreign genetic elements in archaea and bacteria. In carrying out their immune functions, CRISPR-Cas systems heavily rely on RNA components. These CRISPR (cr) RNAs are repeat-spacer units that are produced by processing of pre-crRNA, the transcript of CRISPR arrays, and guide Cas protein(s) to the cognate invading nucleic acids, enabling their destruction. Several bioinformatics tools have been developed to detect CRISPR arrays based solely on DNA sequences, but all these tools employ the same strategy of looking for repetitive patterns, which might correspond to CRISPR array repeats. The identified patterns are evaluated using a fixed, built-in scoring function, and arrays exceeding a cut-off value are reported. Here, we instead introduce a data-driven approach that uses machine learning to detect and differentiate true CRISPR arrays from false ones based on several features. Our CRISPR detection tool, CRISPRidentify, performs three steps: detection, feature extraction and classification based on manually curated sets of positive and negative examples of CRISPR arrays. The identified CRISPR arrays are then reported to the user accompanied by detailed annotation. We demonstrate that our approach identifies not only previously detected CRISPR arrays, but also CRISPR array candidates not detected by other tools. Compared to other methods, our tool has a drastically reduced false positive rate. In contrast to the existing tools, our approach not only provides the user with the basic statistics on the identified CRISPR arrays but also produces a certainty score as a practical measure of the likelihood that a given genomic region is a CRISPR array.",
                "authors": [
                    {
                        "name": "Mitrofanov A."
                    },
                    {
                        "name": "Alkhnbashi O.S."
                    },
                    {
                        "name": "Shmakov S.A."
                    },
                    {
                        "name": "Makarova K.S."
                    },
                    {
                        "name": "Koonin E.V."
                    },
                    {
                        "name": "Backofen R."
                    }
                ],
                "date": "2021-02-26T00:00:00Z",
                "journal": "Nucleic acids research",
                "title": "CRISPRidentify: identification of CRISPR arrays using machine learning approach"
            },
            "pmid": "33290505"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Sequence sites, features and motifs",
            "uri": "http://edamontology.org/topic_0160"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Immunogenetics",
            "uri": "http://edamontology.org/topic_3930"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}