{
    "accessibility": "Open access",
    "additionDate": "2023-02-11T07:36:07.512699Z",
    "biotoolsCURIE": "biotools:kargamobile",
    "biotoolsID": "kargamobile",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "m.prosperi@ufl.edu",
            "name": "Mattia Prosperi",
            "typeEntity": "Person"
        }
    ],
    "description": "Android app for portable, real-time, easily interpretable analysis of antibiotic resistance genes via nanopore sequencing",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Antimicrobial resistance prediction",
                    "uri": "http://edamontology.org/operation_3482"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                },
                {
                    "term": "k-mer counting",
                    "uri": "http://edamontology.org/operation_3472"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Ruiz-HCI-Lab/KargaMobile",
    "language": [
        "Java"
    ],
    "lastUpdate": "2023-02-11T07:36:07.515188Z",
    "license": "MIT",
    "name": "KARGAMobile",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.3389/FBIOE.2022.1016408",
            "metadata": {
                "abstract": "Copyright © 2022 Barquero, Marini, Boucher, Ruiz and Prosperi.Nanopore technology enables portable, real-time sequencing of microbial populations from clinical and ecological samples. An emerging healthcare application for Nanopore includes point-of-care, timely identification of antibiotic resistance genes (ARGs) to help developing targeted treatments of bacterial infections, and monitoring resistant outbreaks in the environment. While several computational tools exist for classifying ARGs from sequencing data, to date (2022) none have been developed for mobile devices. We present here KARGAMobile, a mobile app for portable, real-time, easily interpretable analysis of ARGs from Nanopore sequencing. KARGAMobile is the porting of an existing ARG identification tool named KARGA; it retains the same algorithmic structure, but it is optimized for mobile devices. Specifically, KARGAMobile employs a compressed ARG reference database and different internal data structures to save RAM usage. The KARGAMobile app features a friendly graphical user interface that guides through file browsing, loading, parameter setup, and process execution. More importantly, the output files are post-processed to create visual, printable and shareable reports, aiding users to interpret the ARG findings. The difference in classification performance between KARGAMobile and KARGA is minimal (96.2% vs. 96.9% f-measure on semi-synthetic datasets of 1 million reads with known resistance ground truth). Using real Nanopore experiments, KARGAMobile processes on average 1 GB data every 23–48 min (targeted sequencing - metagenomics), with peak RAM usage below 500MB, independently from input file sizes, and an average temperature of 49°C after 1 h of continuous data processing. KARGAMobile is written in Java and is available at https://github.com/Ruiz-HCI-Lab/KargaMobile under the MIT license.",
                "authors": [
                    {
                        "name": "Barquero A."
                    },
                    {
                        "name": "Boucher C."
                    },
                    {
                        "name": "Marini S."
                    },
                    {
                        "name": "Prosperi M."
                    },
                    {
                        "name": "Ruiz J."
                    }
                ],
                "date": "2022-10-17T00:00:00Z",
                "journal": "Frontiers in Bioengineering and Biotechnology",
                "title": "KARGAMobile: Android app for portable, real-time, easily interpretable analysis of antibiotic resistance genes via nanopore sequencing"
            },
            "pmcid": "PMC9618647",
            "pmid": "36324897"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Metagenomic sequencing",
            "uri": "http://edamontology.org/topic_3837"
        },
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "Microbial ecology",
            "uri": "http://edamontology.org/topic_3697"
        }
    ]
}
