{
    "additionDate": "2021-06-14T12:32:31Z",
    "biotoolsCURIE": "biotools:covidxraynet",
    "biotoolsID": "covidxraynet",
    "collectionID": [
        "COVID-19"
    ],
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "mmon4544@uni.sydney.edu.au",
            "name": "Maram Mahmoud A. Monshi",
            "orcidid": "https://orcid.org/0000-0001-5622-1601",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "CovidXrayNet is a tool for optimizing data augmentation and CNN hyperparameters for improved COVID-19 detection from CXR.\nCovidXrayNet model improves the detection rate of coronavirus 2019 (COVID-19), form Chest X-Ray (CXR), by means of optimizing the data augmentation pipeline and Convolutional Neural Network (CNN) hyperparameters.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/MaramMonshi/CovidXrayNet",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-08-23T18:45:55Z",
    "license": "Apache-2.0",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/MaramMonshi/CovidXrayNet/issues"
        }
    ],
    "name": "CovidXrayNet",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1016/J.COMPBIOMED.2021.104375",
            "metadata": {
                "abstract": "© 2021 Elsevier LtdTo mitigate the spread of the current coronavirus disease 2019 (COVID-19) pandemic, it is crucial to have an effective screening of infected patients to be isolated and treated. Chest X-Ray (CXR) radiological imaging coupled with Artificial Intelligence (AI) applications, in particular Convolutional Neural Network (CNN), can speed the COVID-19 diagnostic process. In this paper, we optimize the data augmentation and the CNN hyperparameters for detecting COVID-19 from CXRs in terms of validation accuracy. This optimization increases the accuracy of the popular CNN architectures such as the Visual Geometry Group network (VGG-19) and the Residual Neural Network (ResNet-50), by 11.93% and 4.97%, respectively. We then proposed CovidXrayNet model that is based on EfficientNet-B0 and our optimization results. We evaluated CovidXrayNet on two datasets, including our generated balanced COVIDcxr dataset (960 CXRs) and the benchmark COVIDx dataset (15,496 CXRs). With only 30 epochs of training, CovidXrayNet achieves state-of-the-art accuracy of 95.82% on the COVIDx dataset in the three-class classification task (COVID-19, normal or pneumonia). The CovidXRayNet model, the COVIDcxr dataset, and several optimization experiments are publicly available at https://github.com/MaramMonshi/CovidXrayNet.",
                "authors": [
                    {
                        "name": "Chung V."
                    },
                    {
                        "name": "Monshi F.M."
                    },
                    {
                        "name": "Monshi M.M.A."
                    },
                    {
                        "name": "Poon J."
                    }
                ],
                "citationCount": 3,
                "date": "2021-06-01T00:00:00Z",
                "journal": "Computers in Biology and Medicine",
                "title": "CovidXrayNet: Optimizing data augmentation and CNN hyperparameters for improved COVID-19 detection from CXR"
            },
            "pmcid": "PMC8048393",
            "pmid": "33866253",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        },
        {
            "term": "Medicine",
            "uri": "http://edamontology.org/topic_3303"
        },
        {
            "term": "Tomography",
            "uri": "http://edamontology.org/topic_3452"
        }
    ]
}
