{
    "additionDate": "2020-01-14T08:53:55Z",
    "biotoolsCURIE": "biotools:DiscoRhythm",
    "biotoolsID": "DiscoRhythm",
    "confidence_flag": "tool",
    "description": "An easy-to-use web application and R package for discovering rhythmicity.\nAn R Package for Discovering Rhythmicity in Biological Data with an Interactive Web Interface.\nSet of functions for estimation of cyclical characteristics, such as period, phase, amplitude, and statistical significance in large temporal datasets.\nDiscoRhythm is available as a web application or an R/Bioconductor package for estimating phase, amplitude, and statistical significance using four popular approaches to rhythm detection (Cosinor, JTK Cycle, ARSER, and Lomb-Scargle). Informative visualizations, interactive modules for quality control, dimensionality reduction, periodicity profiling, and incorporation of experimental replicates make DiscoRhythm a thorough toolkit for analyzing rhythmicity.",
    "download": [
        {
            "type": "Container file",
            "url": "https://hub.docker.com/r/mcarlucci/discorhythm"
        }
    ],
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Phasing",
                    "uri": "http://edamontology.org/operation_3454"
                },
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://disco.camh.ca",
    "language": [
        "R"
    ],
    "lastUpdate": "2020-12-22T08:01:24Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://bioconductor.org/packages/DiscoRhythm"
        },
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/matthewcarlucci/DiscoRhythm"
        }
    ],
    "name": "DiscoRhythm",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ834",
            "metadata": {
                "abstract": "© The Author(s) 2019. Published by Oxford University Press. All rights reserved.Motivation: Biological rhythmicity is fundamental to almost all organisms on Earth and plays a key role in health and disease. Identification of oscillating signals could lead to novel biological insights, yet its investigation is impeded by the extensive computational and statistical knowledge required to perform such analysis. Results: To address this issue, we present DiscoRhythm (Discovering Rhythmicity), a user-friendly application for characterizing rhythmicity in temporal biological data. DiscoRhythm is available as a web application or an R/Bioconductor package for estimating phase, amplitude and statistical significance using four popular approaches to rhythm detection (Cosinor, JTK Cycle, ARSER and Lomb-Scargle). We optimized these algorithms for speed, improving their execution times up to 30-fold to enable rapid analysis of -omic-scale datasets in real-time. Informative visualizations, interactive modules for quality control, dimensionality reduction, periodicity profiling and incorporation of experimental replicates make DiscoRhythm a thorough toolkit for analyzing rhythmicity. Availability and implementation: The DiscoRhythm R package is available on Bioconductor (https://bioconductor.org/packages/DiscoRhythm), with source code available on GitHub (https://github.com/matthewcarlucci/DiscoRhythm) under a GPL-3 license. The web application is securely deployed over HTTPS (https://disco.camh.ca) and is freely available for use worldwide. Local instances of the DiscoRhythm web application can be created using the R package or by deploying the publicly available Docker container (https://hub.docker.com/r/mcarlucci/discorhythm).",
                "authors": [
                    {
                        "name": "Carlucci M."
                    },
                    {
                        "name": "Krisciunas A."
                    },
                    {
                        "name": "Li H."
                    },
                    {
                        "name": "Gibas P."
                    },
                    {
                        "name": "Koncevicius K."
                    },
                    {
                        "name": "Petronis A."
                    },
                    {
                        "name": "Oh G."
                    }
                ],
                "date": "2020-01-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "DiscoRhythm: An easy-to-use web application and R package for discovering rhythmicity"
            },
            "pmid": "31702788"
        }
    ],
    "toolType": [
        "Web application",
        "Library"
    ],
    "topic": [
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        },
        {
            "term": "Medical informatics",
            "uri": "http://edamontology.org/topic_3063"
        },
        {
            "term": "Bioinformatics",
            "uri": "http://edamontology.org/topic_0091"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        }
    ],
    "validated": 1
}