
{
    "credit": [
        {
            "name": "ELIXIR-ITA-PADOVA",
            "typeEntity": "Institute",
            "typeRoles": [
                "Provider"
            ]
        },
        {
            "email": "davide.campagna@cribi.unipd.it",
            "name": "Davide Campagna",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://pass.cribi.unipd.it/cgi-bin/pass.pl?action=Contact"
        }
    ],
    "documentation": [
        {
            "type": "User manual",
            "url": "http://pass.cribi.unipd.it/download/Manual.pdf"
        }
    ],
    "function": [
        {
            "note": "SOLiD/Illumina/454 reads aligner",
            "operation": [
                {
                    "term": "Sequence alignment",
                    "uri": "http://edamontology.org/operation_0292"
                }
            ]
        }
    ],
    "labels": {
        "license": "Other",
        "operatingSystem": [
            "Linux"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Sequence analysis",
                "uri": "http://edamontology.org/topic_0080"
            }
        ]
    },
    "publication": [
        {
            "abstract": "Summary: Standard DNA alignment programs are inadequate to manage the data produced by new generation DNA sequencers. To answer this problem, we developed PASS with the objective of improving execution time and sensitivity when compared with other available programs. PASS performs fast gapped and ungapped alignments of short DNA sequences onto a reference DNA, typically a genomic sequence. It is designed to handle a huge amount of reads such as those generated by Solexa, SOLiD or 454 technologies. The algorithm is based on a data structure that holds in RAM the index of the genomic positions of 'seed' words (typically 11 and 12 bases) as well as an index of the precomputed scores of short words (typically seven and eight bases) aligned against each other. After building the genomic index, the program scans every query sequence performing three steps: (1) it finds matching seed words in the genome; (2) for every match checks the precomputed alignment of the short flanking regions; (3) if passes step 2, then it performs an exact dynamic alignment of a narrow region around the match. The performance of the program is very striking both for sensitivity and speed. For instance, gap alignment is achieved hundreds of times faster than BLAST and several times faster than SOAP, especially when gaps are allowed. Furthermore, PASS has a higher sensitivity when compared with the other available programs. © The Author 2009. Published by Oxford University Press. All rights reserved.",
            "authors": [
                "Campagna D.",
                "Albiero A.",
                "Bilardi A.",
                "Caniato E.",
                "Forcato C.",
                "Manavski S.",
                "Vitulo N.",
                "Valle G."
            ],
            "cit_count": 86,
            "doi": "10.1093/bioinformatics/btp087",
            "journal": "Bioinformatics",
            "pmid": "19218350",
            "title": "PASS: A program to align short sequences",
            "type": "Primary",
            "year": "2009-04-07"
        },
        {
            "abstract": "The sequencing of bisulfite-treated DNA (Bi-Seq) is becoming a gold standard for methylation studies. The mapping of Bi-Seq reads is complex and requires special alignment algorithms. This problem is particularly relevant for SOLiD color space, where the bisulfite conversion C/T changes two adjacent colors into 16 possible combinations. Here, we present an algorithm that efficiently aligns Bi-Seq reads obtained either from SOLiD or Illumina. An accompanying methylation-caller program creates a genomic view of methylated and unmethylated Cs on both DNA strands. © 2012 The Author. Published by Oxford University Press. All rights reserved.",
            "authors": [
                "Campagna D.",
                "Telatin A.",
                "Forcato C.",
                "Vitulo N.",
                "Valle G."
            ],
            "cit_count": 10,
            "journal": "Bioinformatics",
            "pmid": "23162053",
            "title": "PASS-bis: A bisulfite aligner suitable for whole methylome analysis of Illumina and SOLiD reads",
            "type": "Other",
            "year": "2013-01-15"
        },
        {
            "doi": "10.1186/1471-2164-15-264",
            "pmcid": "PMC4051166",
            "pmid": "24708189",
            "type": "Benchmarking study"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:pass",
        "biotoolsID": "pass",
        "description": "PASS: a program to align short sequences",
        "homepage": "http://pass.cribi.unipd.it/cgi-bin/pass.pl",
        "name": "PASS",
        "version": [
            "2.25"
        ]
    }
}