{
    "additionDate": "2015-01-22T11:40:41Z",
    "biotoolsCURIE": "biotools:pass",
    "biotoolsID": "pass",
    "credit": [
        {
            "name": "ELIXIR-ITA-PADOVA",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        },
        {
            "email": "davide.campagna@cribi.unipd.it",
            "name": "Davide Campagna",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://pass.cribi.unipd.it/cgi-bin/pass.pl?action=Contact"
        }
    ],
    "description": "PASS: a program to align short sequences",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://pass.cribi.unipd.it/download/Manual.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "note": "SOLiD/Illumina/454 reads aligner",
            "operation": [
                {
                    "term": "Sequence alignment",
                    "uri": "http://edamontology.org/operation_0292"
                }
            ]
        }
    ],
    "homepage": "http://pass.cribi.unipd.it/cgi-bin/pass.pl",
    "lastUpdate": "2018-12-29T13:50:23Z",
    "license": "Other",
    "name": "PASS",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "ELIXIR-ITA-PADOVA",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btp087",
            "metadata": {
                "abstract": "Summary: Standard DNA alignment programs are inadequate to manage the data produced by new generation DNA sequencers. To answer this problem, we developed PASS with the objective of improving execution time and sensitivity when compared with other available programs. PASS performs fast gapped and ungapped alignments of short DNA sequences onto a reference DNA, typically a genomic sequence. It is designed to handle a huge amount of reads such as those generated by Solexa, SOLiD or 454 technologies. The algorithm is based on a data structure that holds in RAM the index of the genomic positions of 'seed' words (typically 11 and 12 bases) as well as an index of the precomputed scores of short words (typically seven and eight bases) aligned against each other. After building the genomic index, the program scans every query sequence performing three steps: (1) it finds matching seed words in the genome; (2) for every match checks the precomputed alignment of the short flanking regions; (3) if passes step 2, then it performs an exact dynamic alignment of a narrow region around the match. The performance of the program is very striking both for sensitivity and speed. For instance, gap alignment is achieved hundreds of times faster than BLAST and several times faster than SOAP, especially when gaps are allowed. Furthermore, PASS has a higher sensitivity when compared with the other available programs. © The Author 2009. Published by Oxford University Press. All rights reserved.",
                "authors": [
                    {
                        "name": "Campagna D."
                    },
                    {
                        "name": "Albiero A."
                    },
                    {
                        "name": "Bilardi A."
                    },
                    {
                        "name": "Caniato E."
                    },
                    {
                        "name": "Forcato C."
                    },
                    {
                        "name": "Manavski S."
                    },
                    {
                        "name": "Vitulo N."
                    },
                    {
                        "name": "Valle G."
                    }
                ],
                "citationCount": 93,
                "date": "2009-04-07T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "PASS: A program to align short sequences"
            },
            "pmid": "19218350",
            "type": [
                "Primary"
            ]
        },
        {
            "metadata": {
                "abstract": "The sequencing of bisulfite-treated DNA (Bi-Seq) is becoming a gold standard for methylation studies. The mapping of Bi-Seq reads is complex and requires special alignment algorithms. This problem is particularly relevant for SOLiD color space, where the bisulfite conversion C/T changes two adjacent colors into 16 possible combinations. Here, we present an algorithm that efficiently aligns Bi-Seq reads obtained either from SOLiD or Illumina. An accompanying methylation-caller program creates a genomic view of methylated and unmethylated Cs on both DNA strands. © 2012 The Author. Published by Oxford University Press. All rights reserved.",
                "authors": [
                    {
                        "name": "Campagna D."
                    },
                    {
                        "name": "Telatin A."
                    },
                    {
                        "name": "Forcato C."
                    },
                    {
                        "name": "Vitulo N."
                    },
                    {
                        "name": "Valle G."
                    }
                ],
                "citationCount": 10,
                "date": "2013-01-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "PASS-bis: A bisulfite aligner suitable for whole methylome analysis of Illumina and SOLiD reads"
            },
            "pmid": "23162053",
            "type": [
                "Other"
            ]
        },
        {
            "doi": "10.1186/1471-2164-15-264",
            "metadata": {
                "abstract": "Background: The rapid evolution in high-throughput sequencing (HTS) technologies has opened up new perspectives in several research fields and led to the production of large volumes of sequence data. A fundamental step in HTS data analysis is the mapping of reads onto reference sequences. Choosing a suitable mapper for a given technology and a given application is a subtle task because of the difficulty of evaluating mapping algorithms.Results: In this paper, we present a benchmark procedure to compare mapping algorithms used in HTS using both real and simulated datasets and considering four evaluation criteria: computational resource and time requirements, robustness of mapping, ability to report positions for reads in repetitive regions, and ability to retrieve true genetic variation positions. To measure robustness, we introduced a new definition for a correctly mapped read taking into account not only the expected start position of the read but also the end position and the number of indels and substitutions. We developed CuReSim, a new read simulator, that is able to generate customized benchmark data for any kind of HTS technology by adjusting parameters to the error types. CuReSim and CuReSimEval, a tool to evaluate the mapping quality of the CuReSim simulated reads, are freely available. We applied our benchmark procedure to evaluate 14 mappers in the context of whole genome sequencing of small genomes with Ion Torrent data for which such a comparison has not yet been established.Conclusions: A benchmark procedure to compare HTS data mappers is introduced with a new definition for the mapping correctness as well as tools to generate simulated reads and evaluate mapping quality. The application of this procedure to Ion Torrent data from the whole genome sequencing of small genomes has allowed us to validate our benchmark procedure and demonstrate that it is helpful for selecting a mapper based on the intended application, questions to be addressed, and the technology used. This benchmark procedure can be used to evaluate existing or in-development mappers as well as to optimize parameters of a chosen mapper for any application and any sequencing platform. © 2014 Caboche et al.; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Caboche S."
                    },
                    {
                        "name": "Audebert C."
                    },
                    {
                        "name": "Lemoine Y."
                    },
                    {
                        "name": "Hot D."
                    }
                ],
                "citationCount": 57,
                "date": "2014-04-05T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "Comparison of mapping algorithms used in high-throughput sequencing: Application to Ion Torrent data"
            },
            "pmcid": "PMC4051166",
            "pmid": "24708189",
            "type": [
                "Benchmarking study"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        }
    ],
    "validated": 1,
    "version": [
        "2.25"
    ]
}