{
    "additionDate": "2017-08-03T18:35:49Z",
    "biotoolsCURIE": "biotools:angle",
    "biotoolsID": "angle",
    "credit": [
        {
            "email": "shimizu-kana@aist.go.jp",
            "name": "Kana Shimizu",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://cbrc3.cbrc.jp/~shimizu/index.php"
        }
    ],
    "description": "Program for predicting coding sequences from low quality cDNA. To achieve error-tolerant prediction, it uses a machine-learning approach, which makes better expression of coding sequence maximizing the use of limited information from input sequences.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://cbrc3.cbrc.jp/~shimizu/index.php?Kana%20Shimizu%27s%20web%20site#zddbe95d"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Coding region prediction",
                    "uri": "http://edamontology.org/operation_0436"
                }
            ]
        }
    ],
    "homepage": "http://cbrc3.cbrc.jp/~shimizu/index.php?Kana%20Shimizu%27s%20web%20site#t11a427e",
    "language": [
        "C++"
    ],
    "lastUpdate": "2018-12-10T12:58:56Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/angle-predicte-coding-sequences-quality-cdna.html"
        }
    ],
    "name": "ANGLE",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "In the process of making full-length cDNA, predicting protein coding regions helps both in the preliminary analysis of genes and in any succeeding process. However, unfinished cDNA contains artifacts including many sequencing errors, which hinder the correct evaluation of coding sequences. Especially, predictions of short sequences are difficult because they provide little information for evaluating coding potential. In this paper, we describe ANGLE, a new program for predicting coding sequences in low quality cDNA. To achieve error-tolerant prediction, ANGLE uses a machine-learning approach, which makes better expression of coding sequence maximizing the use of limited information from input sequences. Our method utilizes not only codon usage, but also protein structure information which is difficult to be used for stochastic model-based algorithms, and optimizes limited information from a short segment when deciding coding potential, with the result that predictive accuracy does not depend on the length of an input sequence. The performance of ANGLE is compared with ESTSCAN on four dataset each of them having a different error rate (one frame-shift error or one substitution error per 200-500 nucleotides) and on one dataset which has no error. ANGLE outperforms ESTSCAN by 9.26% in average Matthews's correlation coefficient on short sequence dataset (< 1000 bases). On long sequence dataset, ANGLE achieves comparable performance. © 2006 Imperial College Press.",
                "authors": [
                    {
                        "name": "Shimizu K."
                    },
                    {
                        "name": "Adachi J."
                    },
                    {
                        "name": "Muraoka Y."
                    }
                ],
                "citationCount": 31,
                "date": "2006-06-01T00:00:00Z",
                "journal": "Journal of Bioinformatics and Computational Biology",
                "title": "Angle: A sequencing errors resistant program for predicting protein coding regions in unfinished cDNA"
            },
            "pmid": "16960968"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "Nucleic acids",
            "uri": "http://edamontology.org/topic_0077"
        },
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        }
    ],
    "validated": 1
}