
{
    "credit": [
        {
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://zhangroup.aporc.org/ZHANGroupContactUs"
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://doc.aporc.org/wiki/PrePPItar"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Protein-protein interaction prediction",
                    "uri": "http://edamontology.org/operation_2464"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "MATLAB"
        ],
        "operatingSystem": [
            "Linux",
            "Windows"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Systems biology",
                "uri": "http://edamontology.org/topic_2259"
            },
            {
                "term": "Molecular interactions, pathways and networks",
                "uri": "http://edamontology.org/topic_0602"
            },
            {
                "term": "Machine learning",
                "uri": "http://edamontology.org/topic_3474"
            },
            {
                "term": "Protein interaction experiment",
                "uri": "http://edamontology.org/topic_3557"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/preppitar-machine-learning-framework-to-predict-ppi-target-for-drug.html"
        }
    ],
    "publication": [
        {
            "abstract": "© 2015 The Author 2015. Published by Oxford University Press. All rights reserved. Motivation: With the booming of interactome studies, a lot of interactions can be measured in a high throughput way and large scale datasets are available. It is becoming apparent that many different types of interactions can be potential drug targets. Compared with inhibition of a single protein, inhibition of protein-protein interaction (PPI) is promising to improve the specificity with fewer adverse side-effects. Also it greatly broadens the drug target search space, which makes the drug target discovery difficult. Computational methods are highly desired to efficiently provide candidates for further experiments and hold the promise to greatly accelerate the discovery of novel drug targets. Results: Here, we propose a machine learning method to predict PPI targets in a genomic-wide scale. Specifically, we develop a computational method, named as PrePPItar, to Predict PPIs as drug targets by uncovering the potential associations between drugs and PPIs. First, we survey the databases and manually construct a gold-standard positive dataset for drug and PPI interactions. This effort leads to a dataset with 227 associations among 63 PPIs and 113 FDA-approved drugs and allows us to build models to learn the association rules from the data. Second, we characterize drugs by profiling in chemical structure, drug ATC-code annotation, and side-effect space and represent PPI similarity by a symmetrical S-kernel based on protein amino acid sequence. Then the drugs and PPIs are correlated by Kronecker product kernel. Finally, a support vector machine (SVM), is trained to predict novel associations between drugs and PPIs. We validate our PrePPItar method on the well-established gold-standard dataset by cross-validation. We find that all chemical structure, drug ATC-code, and side-effect information are predictive for PPI target. Moreover, we can increase the PPI target prediction coverage by integrating multiple data sources. Follow-up database search and pathway analysis indicate that our new predictions are worthy of future experimental validation. Conclusion: In conclusion, PrePPItar can serve as a useful tool for PPI target discovery and provides a general heterogeneous data integrative framework. Availability and implementation: PrePPItar is available at http://doc.aporc.org/wiki/PrePPItar. Contact: or ywang@amss.ac.cn Supplementary information: Supplementary data are available at Bioinformatics online.",
            "authors": [
                "Wang Y.-C.",
                "Chen S.-L.",
                "Deng N.-Y.",
                "Wang Y."
            ],
            "cit_count": 6,
            "journal": "Bioinformatics",
            "pmid": "26415726",
            "title": "Computational probing protein-protein interactions targeting small molecules",
            "year": "2015-07-22"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:preppitar",
        "biotoolsID": "preppitar",
        "description": "Computational method to Predict PPIs as drug targets by uncovering the potential associations between drugs and PPIs.",
        "homepage": "http://doc.aporc.org/wiki/PrePPItar",
        "name": "PrePPItar"
    }
}