{
    "additionDate": "2020-01-09T18:11:52Z",
    "biotoolsCURIE": "biotools:NanoDefiner",
    "biotoolsID": "NanoDefiner",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "christoph.friedrich@fh-dortmund.de",
            "name": "Christoph M. Friedrich",
            "orcidid": "https://orcid.org/0000-0001-7906-0038",
            "typeEntity": "Person"
        }
    ],
    "description": "An Implemented Decision Support Framework for Nanomaterial Identification.\n\nOfficial repository of the NanoDefiner e-tool for nanomaterial classification.\n\nThis is the official repository for the NanoDefiner e-tool, a decision support framework for the characterisation of potential nanomaterials. It is one of the products delivered by the NanoDefine project.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Validation",
                    "uri": "http://edamontology.org/operation_2428"
                },
                {
                    "term": "Single particle analysis",
                    "uri": "http://edamontology.org/operation_3457"
                }
            ]
        }
    ],
    "homepage": "https://fh.do/nanodefiner/",
    "language": [
        "JavaScript",
        "Java"
    ],
    "lastUpdate": "2021-01-04T07:23:31Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/NanoDefiner/NanoDefiner"
        },
        {
            "type": [
                "Other"
            ],
            "url": "https://labs.inf.fh-dortmund.de/NanoDefiner/"
        }
    ],
    "name": "NanoDefiner",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.3390/MA12193247",
            "metadata": {
                "abstract": "© 2019 by the authors.The European Commission's recommendation on the definition of nanomaterial (2011/696/EU) established an applicable standard for material categorization. However, manufacturers face regulatory challenges during registration of their products. Reliable categorization is difficult and requires considerable expertise in existing measurement techniques (MTs). Additionally, organizational complexity is increased as different authorities' registration processes require distinct reporting. The NanoDefine project tackled these obstacles by providing the NanoDefiner e-tool: A decision support expert system for nanomaterial identification in a regulatory context. It providesMT recommendations for categorization of specific materials using a tiered approach (screening/confirmatory), and was constructed with experts from academia and industry to be extensible, interoperable, and adaptable for forthcoming revisions of the nanomaterial definition. An implemented MT-driven material categorization scheme allows detailed description. Its guided workflow is suitable for a variety of user groups. Direct feedback and explanation enable transparent decisions. Expert knowledge is held in a knowledge base for representation ofMT performance criteria and physicochemical particle type properties. Continuous revision ensured data quality and validity. Recommendations were validated by independent case studies on industry-relevant particulate materials. Besides supporting material identification and registration, the free and open-source e-tool may serve as template for other expert systems within the nanoscience domain.",
                "authors": [
                    {
                        "name": "Brungel R."
                    },
                    {
                        "name": "Ruckert J."
                    },
                    {
                        "name": "Wohlleben W."
                    },
                    {
                        "name": "Babick F."
                    },
                    {
                        "name": "Ghanem A."
                    },
                    {
                        "name": "Gaillard C."
                    },
                    {
                        "name": "Mech A."
                    },
                    {
                        "name": "Rauscher H."
                    },
                    {
                        "name": "Hodoroaba V.-D."
                    },
                    {
                        "name": "Weigel S."
                    },
                    {
                        "name": "Friedrich C.M."
                    }
                ],
                "citationCount": 3,
                "date": "2019-10-01T00:00:00Z",
                "journal": "Materials",
                "title": "NanoDefiner e-tool: An implemented decision support framework for nanomaterial identification"
            },
            "pmcid": "PMC6803960",
            "pmid": "31590255"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ],
    "validated": 1
}