{"credit":[{"email":"henetadm@fhcrc.org","name":"LAHEDES Support","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"http://homingendonuclease.net/help/FAQ.html"}],"function":[{"operation":[{"term":"Database search","uri":"http://edamontology.org/operation_2421"},{"term":"Validation","uri":"http://edamontology.org/operation_2428"},{"term":"Protein model validation","uri":"http://edamontology.org/operation_0321"},{"term":"Scaffolding","uri":"http://edamontology.org/operation_3216"},{"term":"Protein feature detection","uri":"http://edamontology.org/operation_3092"}]}],"labels":{"operatingSystem":["Linux","Windows","Mac"],"toolType":["Web application"],"topic":[{"term":"Small molecules","uri":"http://edamontology.org/topic_0154"},{"term":"DNA","uri":"http://edamontology.org/topic_0654"},{"term":"Genetic variation","uri":"http://edamontology.org/topic_0199"},{"term":"Gene transcripts","uri":"http://edamontology.org/topic_3512"}]},"publication":[{"abstract":"LAGLIDADG homing endonucleases (LHEs) are DNA cleaving enzymes, also termed 'meganucleases' that are employed as gene-targeting reagents. This use of LHEs requires that their DNA specificity be altered to match sequences in genomic targets. The choice of the most appropriate LHE to target a particular gene is facilitated by the growing number of such enzymes with well-characterized activities and structures. 'LAHEDES' (The LAGLIDADG Homing Endonuclease Database and Engineering Server) provides both an online archive of LHEs with validated DNA cleavage specificities and DNA-binding interactions, as well as a tool for the identification of DNA sequences that might be targeted by various LHEs. Searches can be performed using four separate scoring algorithms and user-defined choices of LHE scaffolds. The webserver subsequently provides information regarding clusters of amino acids that should be interrogated during engineering and selection experiments. The webserver is fully open access and can be found at http://homingendonuclease.net. © 2012 The Author(s).","authors":["Taylor G.K.","Petrucci L.H.","Lambert A.R.","Baxter S.K.","Jarjour J.","Stoddard B.L."],"cit_count":29,"journal":"Nucleic Acids Research","pmid":"22570419","title":"LAHEDES: The LAGLIDADG homing endonuclease database and engineering server","year":"2012-07-01"}],"summary":{"biotoolsCURIE":"biotools:lahedes","biotoolsID":"lahedes","description":"The LAGLIDADG Homing Endonuclease Database and Engineering Server (LAHEDES) is a database listing basic properties of LAGLIDADG homing endonucleases (LHEs) with validated biochemical activity and known target site specificity. It also supports web-based searches of DNA sequences (ranging from single or multiple genes to entire genomic reads) for potential target sites that might be recognized either by wild-type or by engineered variants of those endonucleases.","homepage":"http://homingendonuclease.net","name":"LAHEDES"}}