{
    "additionDate": "2020-01-14T09:16:39Z",
    "biotoolsCURIE": "biotools:RapidACi",
    "biotoolsID": "RapidACi",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "Carole.Coursolle@Canada.ca",
            "name": "Carole Coursolle",
            "typeEntity": "Person"
        }
    ],
    "description": "Measuring Rapid A-Ci Curves in Boreal Conifers.\n\nR scripts for automatic correction of Rapid A-Ci curves.\n\nAn R package for the batch treatment of Rapid carbon dioxide response curves (A-Ci) generated by the LI-COR® portable photosynthesis systems.\n\nThe Rapid A-Ci measurement method (RACiR™) can save a lot of time characterising photosynthetic capacity of multiple plants.\n\ndevtools::install_github(\"ManuelLamothe/RapidACi\").\n\nIf, later on, you need to adjust leaf area values, you need to provide a dataframe containing at least one column for the unique sample identifier (named: “sample_ID”), and one column with the leaf area in mm2 (named: “LeafArea_mm2”)",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                }
            ]
        }
    ],
    "homepage": "https://github.com/ManuelLamothe/RapidACi",
    "language": [
        "R"
    ],
    "lastUpdate": "2020-12-11T15:32:59Z",
    "name": "RapidACi",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.3389/FPLS.2019.01276",
            "metadata": {
                "abstract": "© Copyright © 2019 Her Majesty the Queen in Right of Canada.Climate change is steering tree breeding programs towards the development of families and genotypes that will be adapted and more resilient to changing environments. Making genotype–phenotype–environment connections is central to these predictions and it requires the evaluation of functional traits such as photosynthetic rates that can be linked to environmental variables. However, the ability to rapidly measure photosynthetic parameters has always been limiting. The estimation of Vc,max and Jmax using CO2 response curves has traditionally been time consuming, taking anywhere from 30 min to more than an hour, thereby drastically limiting the number of trees that can be assessed per day. Technological advancements have led to the development of a new generation of portable photosynthesis measurement systems offering greater chamber environmental control and automated sampling and, as a result, the proposal of a new, faster, method (RACiR) for measuring Vc,max and Jmax. This method was developed using poplar trees and involves measuring photosynthetic responses to CO2 over a range of CO2 concentrations changing at a constant rate. The goal of the present study was to adapt the RACiR method for use on conifers whose measurement usually requires much larger leaf chambers. We demonstrate that the RACiR method can be used to estimate Vc,max and Jmax in conifers and provide recommendations to enhance the method. The use our method in conifers will substantially reduce measurement time, thus greatly improving genotype evaluation and selection capabilities based on photosynthetic traits. This study led to the developpement of an R package (RapidACi, https://github.com/ManuelLamothe/RapidACi) that facilitates the correction of multiple RACiR files and the post-measurement correction of leaf areas.",
                "authors": [
                    {
                        "name": "Coursolle C."
                    },
                    {
                        "name": "Otis Prud'homme G."
                    },
                    {
                        "name": "Lamothe M."
                    },
                    {
                        "name": "Isabel N."
                    }
                ],
                "citationCount": 1,
                "date": "2019-10-25T00:00:00Z",
                "journal": "Frontiers in Plant Science",
                "title": "Measuring Rapid A–Ci Curves in Boreal Conifers: Black Spruce and Balsam Fir"
            },
            "pmcid": "PMC6823239",
            "pmid": "31708940"
        }
    ],
    "topic": [
        {
            "term": "Phenomics",
            "uri": "http://edamontology.org/topic_3298"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ],
    "validated": 1
}