{"credit":[{"typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://www.ism.ac.jp/~higuchi/developers.htm"}],"documentation":[{"url":"http://www.ism.ac.jp/~higuchi/tutorial.htm"}],"function":[{"operation":[{"term":"Gene expression analysis","uri":"http://edamontology.org/operation_2495"}]},{"operation":[{"term":"Microarray data analysis","uri":"http://edamontology.org/operation_2495"}]},{"operation":[{"term":"Clustering","uri":"http://edamontology.org/operation_3432"}]}],"labels":{"language":["Fortran"],"operatingSystem":["Windows"],"toolType":["Desktop application"],"topic":[{"term":"Gene expression","uri":"http://edamontology.org/topic_0203"},{"term":"samples","uri":"http://edamontology.org/topic_3277"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/arraycluster-1-0-mixed-factors-analysis-microarray-gene-expression-data.html"}],"publication":[{"abstract":"Summary: One of the significant challenges in gene expression analysis is to find unknown subtypes of several diseases at the molecular levels. This task can be addressed by grouping gene expression patterns of the collected samples on the basis of a large number of genes. Application of commonly used clustering methods to such a dataset however are likely to fail owing to over-learning, because the number of samples to be grouped is much smaller than the data dimension which is equal to the number of genes involved in the dataset. To overcome such difficulty, we developed a novel model-based clustering method, referred to as the mixed factors analysis. The ArrayCluster is a freely available software to perform the mixed factors analysis. It provides us some analytic tools for clustering DNA microarray experiments, data visualization and an automatic detector for module transcriptional of genes that are relevant to the calibrated molecular subtypes and so on. © 2006 Oxford University Press.","authors":["Yoshida R.","Higuchi T.","Imoto S.","Miyano S."],"cit_count":21,"doi":"10.1093/bioinformatics/btl129","journal":"Bioinformatics","title":"ArrayCluster: An analytic tool for clustering, data visualization and module finder on gene expression profiles","type":"Primary","year":"2006-06-15"}],"summary":{"biotoolsCURIE":"biotools:arraycluster","biotoolsID":"arraycluster","description":"It is one of the significant challenges to find unknown subtypes of several diseases at the molecular levels. This task can be addressed by grouping gene expression patterns of the collected samples on the basis of a large number of genes. Application of commonly used clustering methods to such a dataset however are likely to fail, because the number of samples to be grouped is much smaller than the data dimension. To overcome such difficulty, a novel model-based clustering method is developed.","homepage":"http://www.ism.ac.jp/~higuchi/arraycluster.htm","name":"ArrayCluster","version":["1.0"]}}