{
    "additionDate": "2017-08-20T15:16:52Z",
    "biotoolsCURIE": "biotools:blimp",
    "biotoolsID": "blimp",
    "collectionID": [
        "Animal and Crop Genomics"
    ],
    "credit": [
        {
            "email": "xwen@umich.edu",
            "name": "Xiaoquan Wen",
            "orcidid": "https://orcid.org/0000-0001-8990-2737",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://stephenslab.uchicago.edu/"
        }
    ],
    "description": "BLIMP: Software for Best Linear IMPutation",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://stephenslab.uchicago.edu/assets/software/blimp/readme.11.2.txt"
        }
    ],
    "editPermission": {
        "authors": [
            "animalandcropgenomics"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Imputation",
                    "uri": "http://edamontology.org/operation_3557"
                }
            ]
        }
    ],
    "homepage": "http://stephenslab.uchicago.edu/software_pages/blimp/index.html",
    "language": [
        "Perl"
    ],
    "lastUpdate": "2024-11-25T14:01:41.916295Z",
    "license": "Not licensed",
    "name": "BLIMP",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "admin",
    "publication": [
        {
            "doi": "10.1214/10-aoas338",
            "metadata": {
                "abstract": "Recently-developed genotype imputation methods are a powerful tool for detecting untyped genetic variants that affect disease susceptibility in genetic association studies. However, existing imputation methods require individual-level genotype data, whereas, in practice, it is often the case that only summary data are available. For example, this may occur because, for reasons of privacy or politics, only summary data are made available to the research community at large; or because only summary data are collected, as in DNA pooling experiments. In this article we introduce a new statistical method that can accurately infer the frequencies of untyped genetic variants in these settings, and indeed substantially improve frequency estimates at typed variants in pooling experiments where observations are noisy. Our approach, which predicts each allele frequency using a linear combination of observed frequencies, is statistically straightforward, and related to a long history of the use of linear methods for estimating missing values (e.g., Kriging). The main statistical novelty is our approach to regularizing the covariance matrix estimates, and the resulting linear predictors, which is based on methods from population genetics. We find that, besides being both fast and flexible-allowing new problems to be tackled that cannot be handled by existing imputation approaches purpose-built for the genetic context-these linear methods are also very accurate. Indeed, imputation accuracy using this approach is similar to that obtained by state-of-the-art imputation methods that use individual-level data, but at a fraction of the computational cost. © Institute ol Mathematical Statistics.",
                "authors": [
                    {
                        "name": "Stephens M."
                    },
                    {
                        "name": "Wen X."
                    }
                ],
                "citationCount": 50,
                "date": "2010-09-01T00:00:00Z",
                "journal": "Annals of Applied Statistics",
                "title": "Using linear predictors to impute allele frequencies from summary or pooled genotype data"
            },
            "pmcid": "PMC3072818",
            "pmid": "21479081",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        }
    ],
    "validated": 1
}
