{"credit":[{"email":"jade.cheng@birc.au.dk","name":"Jade Cheng","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"https://github.com/jade-cheng/ohana"}],"function":[{"operation":[{"term":"SNP detection","uri":"http://edamontology.org/operation_0484"}]}],"labels":{"language":["C++"],"operatingSystem":["Linux","Mac"],"toolType":["Command-line tool"],"topic":[{"term":"DNA polymorphism","uri":"http://edamontology.org/topic_2885"},{"term":"Sequencing","uri":"http://edamontology.org/topic_3168"},{"term":"Sequence analysis","uri":"http://edamontology.org/topic_0080"}]},"publication":[{"abstract":"© 2017 The Author. Published by Oxford University Press. All rights reserved. Motivation: Structure methods are highly used population genetic methods for classifying individuals in a sample fractionally into discrete ancestry components. Contribution: We introduce a new optimization algorithm for the classical STRUCTURE model in a maximum likelihood framework. Using analyses of real data we show that the new method finds solutions with higher likelihoods than the state-of-the-art method in the same computational time. The optimization algorithm is also applicable to models based on genotype likelihoods, that can account for the uncertainty in genotype-calling associated with Next Generation Sequencing (NGS) data. We also present a new method for estimating population trees from ancestry components using a Gaussian approximation. Using coalescence simulations of diverging populations, we explore the adequacy of the STRUCTURE-style models and the Gaussian assumption for identifying ancestry components correctly and for inferring the correct tree. In most cases, ancestry components are inferred correctly, although sample sizes and times since admixture can influence the results. We show that the popular Gaussian approximation tends to perform poorly under extreme divergence scenarios e.g. with very long branch lengths, but the topologies of the population trees are accurately inferred in all scenarios explored. The new methods are implemented together with appropriate visualization tools in the software package Ohana.","authors":["Cheng J.Y.","Mailund T.","Nielsen R."],"cit_count":2,"doi":"10.1093/bioinformatics/btx098","journal":"Bioinformatics","title":"Fast admixture analysis and population tree estimation for SNP and NGS data","year":"2017-07-15"}],"summary":{"biotoolsCURIE":"biotools:ohana","biotoolsID":"ohana","description":"Fast admixture analysis and population tree estimation for SNP and NGS data.","homepage":"https://github.com/jade-cheng/ohana","name":"Ohana"}}