{
    "additionDate": "2018-04-27T09:39:01Z",
    "biotoolsCURIE": "biotools:caneapp",
    "biotoolsID": "caneapp",
    "credit": [
        {
            "email": "dvelmeshev@gmail.com",
            "name": "Dmitry Velmeshev",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Application for Comprehensive automated Analysis of Next-generation sequencing Experiments.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://psychiatry.med.miami.edu/documents/research/CANEapp_manual.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Differential gene expression analysis",
                    "uri": "http://edamontology.org/operation_3223"
                },
                {
                    "term": "RNA-Seq analysis",
                    "uri": "http://edamontology.org/operation_3680"
                }
            ]
        }
    ],
    "homepage": "http://psychiatry.med.miami.edu/research/laboratory-of-translational-rna-genomics/CANE-app",
    "language": [
        "Java"
    ],
    "lastUpdate": "2018-12-10T12:58:57Z",
    "name": "CANEapp",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1186/S12864-015-2346-Y",
            "metadata": {
                "abstract": "© 2016 Velmeshev et al.Background: Next generation sequencing (NGS) technologies are indispensable for molecular biology research, but data analysis represents the bottleneck in their application. Users need to be familiar with computer terminal commands, the Linux environment, and various software tools and scripts. Analysis workflows have to be optimized and experimentally validated to extract biologically meaningful data. Moreover, as larger datasets are being generated, their analysis requires use of high-performance servers. Results: To address these needs, we developed CANEapp (application for Comprehensive automated Analysis of Next-generation sequencing Experiments), a unique suite that combines a Graphical User Interface (GUI) and an automated server-side analysis pipeline that is platform-independent, making it suitable for any server architecture. The GUI runs on a PC or Mac and seamlessly connects to the server to provide full GUI control of RNA-sequencing (RNA-seq) project analysis. The server-side analysis pipeline contains a framework that is implemented on a Linux server through completely automated installation of software components and reference files. Analysis with CANEapp is also fully automated and performs differential gene expression analysis and novel noncoding RNA discovery through alternative workflows (Cuffdiff and R packages edgeR and DESeq2). We compared CANEapp to other similar tools, and it significantly improves on previous developments. We experimentally validated CANEapp's performance by applying it to data derived from different experimental paradigms and confirming the results with quantitative real-time PCR (qRT-PCR). CANEapp adapts to any server architecture by effectively using available resources and thus handles large amounts of data efficiently. CANEapp performance has been experimentally validated on various biological datasets. CANEapp is available free of charge at http://psychiatry.med.miami.edu/research/laboratory-of-translational-rna-genomics/CANE-app. Conclusions: We believe that CANEapp will serve both biologists with no computational experience and bioinformaticians as a simple, timesaving but accurate and powerful tool to analyze large RNA-seq datasets and will provide foundations for future development of integrated and automated high-throughput genomics data analysis tools. Due to its inherently standardized pipeline and combination of automated analysis and platform-independence, CANEapp is an ideal for large-scale collaborative RNA-seq projects between different institutions and research groups.",
                "authors": [
                    {
                        "name": "Faghihi M.A."
                    },
                    {
                        "name": "Lally P."
                    },
                    {
                        "name": "Magistri M."
                    },
                    {
                        "name": "Velmeshev D."
                    }
                ],
                "citationCount": 6,
                "date": "2016-01-13T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "CANEapp: A user-friendly application for automated next generation transcriptomic data analysis"
            },
            "pmcid": "PMC4710974",
            "pmid": "26758513"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "RNA-seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ],
    "validated": 1
}
