{
    "additionDate": "2021-03-19T08:34:52Z",
    "biotoolsCURIE": "biotools:deepdist",
    "biotoolsID": "deepdist",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "chengji@missouri.edu",
            "name": "Jianlin Cheng",
            "orcidid": "https://orcid.org/0000-0003-0305-2853",
            "typeEntity": "Person"
        }
    ],
    "description": "DeepDist is a tool for real-value inter-residue distance prediction with deep residual convolutional network.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Ab initio structure prediction",
                    "uri": "http://edamontology.org/operation_0476"
                },
                {
                    "term": "Residue contact prediction",
                    "uri": "http://edamontology.org/operation_0272"
                },
                {
                    "term": "Residue distance calculation",
                    "uri": "http://edamontology.org/operation_2950"
                }
            ]
        }
    ],
    "homepage": "https://github.com/multicom-toolbox/deepdist",
    "language": [
        "Python",
        "Perl"
    ],
    "lastUpdate": "2021-03-27T17:06:04Z",
    "name": "DeepDist",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1186/S12859-021-03960-9",
            "metadata": {
                "abstract": "© 2021, The Author(s).Background: Driven by deep learning, inter-residue contact/distance prediction has been significantly improved and substantially enhanced ab initio protein structure prediction. Currently, most of the distance prediction methods classify inter-residue distances into multiple distance intervals instead of directly predicting real-value distances. The output of the former has to be converted into real-value distances to be used in tertiary structure prediction. Results: To explore the potentials of predicting real-value inter-residue distances, we develop a multi-task deep learning distance predictor (DeepDist) based on new residual convolutional network architectures to simultaneously predict real-value inter-residue distances and classify them into multiple distance intervals. Tested on 43 CASP13 hard domains, DeepDist achieves comparable performance in real-value distance prediction and multi-class distance prediction. The average mean square error (MSE) of DeepDist’s real-value distance prediction is 0.896 Å2 when filtering out the predicted distance ≥ 16 Å, which is lower than 1.003 Å2 of DeepDist’s multi-class distance prediction. When distance predictions are converted into contact predictions at 8 Å threshold (the standard threshold in the field), the precision of top L/5 and L/2 contact predictions of DeepDist’s multi-class distance prediction is 79.3% and 66.1%, respectively, higher than 78.6% and 64.5% of its real-value distance prediction and the best results in the CASP13 experiment. Conclusions: DeepDist can predict inter-residue distances well and improve binary contact prediction over the existing state-of-the-art methods. Moreover, the predicted real-value distances can be directly used to reconstruct protein tertiary structures better than multi-class distance predictions due to the lower MSE. Finally, we demonstrate that predicting the real-value distance map and multi-class distance map at the same time performs better than predicting real-value distances alone.",
                "authors": [
                    {
                        "name": "Wu T."
                    },
                    {
                        "name": "Guo Z."
                    },
                    {
                        "name": "Hou J."
                    },
                    {
                        "name": "Cheng J."
                    }
                ],
                "citationCount": 8,
                "date": "2021-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "DeepDist: real-value inter-residue distance prediction with deep residual convolutional network"
            },
            "pmcid": "PMC7831258",
            "pmid": "33494711"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Protein structure analysis",
            "uri": "http://edamontology.org/topic_2814"
        },
        {
            "term": "Structure prediction",
            "uri": "http://edamontology.org/topic_0082"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        }
    ]
}