
{
    "credit": [
        {
            "email": "RiboZones@gmail.com",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://astrobiology.gatech.edu/"
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://apollo.chemistry.gatech.edu/RiboVision/Documentation/index.html"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Structure visualisation",
                    "uri": "http://edamontology.org/operation_0570"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Structure prediction",
                "uri": "http://edamontology.org/topic_0082"
            },
            {
                "term": "RNA",
                "uri": "http://edamontology.org/topic_0099"
            },
            {
                "term": "Nucleic acid structure analysis",
                "uri": "http://edamontology.org/topic_0097"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://www.mybiosoftware.com/ribovision-visualization-and-analysis-of-ribosomes.html"
        }
    ],
    "publication": [
        {
            "abstract": "© the Partner Organisations 2014.RiboVision is a visualization and analysis tool for the simultaneous display of multiple layers of diverse information on primary (1D), secondary (2D), and three-dimensional (3D) structures of ribosomes. The ribosome is a macromolecular complex containing ribosomal RNA and ribosomal proteins and is a key component of life responsible for the synthesis of proteins in all living organisms. RiboVision is intended for rapid retrieval, analysis, filtering, and display of a variety of ribosomal data. Preloaded information includes 1D, 2D, and 3D structures augmented by base-pairing, base-stacking, and other molecular interactions. RiboVision is preloaded with rRNA secondary structures, rRNA domains and helical structures, phylogeny, crystallographic thermal factors, etc. RiboVision contains structures of ribosomal proteins and a database of their molecular interactions with rRNA. RiboVision contains preloaded structures and data for two bacterial ribosomes (Thermus thermophilus and Escherichia coli), one archaeal ribosome (Haloarcula marismortui), and three eukaryotic ribosomes (Saccharomyces cerevisiae, Drosophila melanogaster, and Homo sapiens). RiboVision revealed several major discrepancies between the 2D and 3D structures of the rRNAs of the small and large subunits (SSU and LSU). Revised structures mapped with a variety of data are available in RiboVision as well as in a public gallery (http://apollo.chemistry.gatech.edu/RibosomeGallery). RiboVision is designed to allow users to distill complex data quickly and to easily generate publication-quality images of data mapped onto secondary structures. Users can readily import and analyze their own data in the context of other work. This package allows users to import and map data from CSV files directly onto 1D, 2D, and 3D levels of structure. RiboVision has features in rough analogy with web-based map services capable of seamlessly switching the type of data displayed and the resolution or magnification of the display. RiboVision is available at http://apollo.chemistry.gatech.edu/RiboVision. This journal is",
            "authors": [
                "Bernier C.R.",
                "Petrov A.S.",
                "Waterbury C.C.",
                "Jett J.",
                "Li F.",
                "Freil L.E.",
                "Xiong X.",
                "Wang L.",
                "Migliozzi B.L.R.",
                "Hershkovits E.",
                "Xue Y.",
                "Hsiao C.",
                "Bowman J.C.",
                "Harvey S.C.",
                "Grover M.A.",
                "Wartell Z.J.",
                "Williams L.D."
            ],
            "cit_count": 25,
            "journal": "Faraday Discussions",
            "pmid": "25340471",
            "title": "RiboVision suite for visualization and analysis of ribosomes",
            "year": "2014-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:ribovision",
        "biotoolsID": "ribovision",
        "description": "A visualization and analysis tool for the simultaneous display of multiple layers of diverse information on primary (1D), secondary (2D), and three-dimensional (3D) structures of ribosomes.",
        "homepage": "http://apollo.chemistry.gatech.edu/RiboVision/",
        "name": "RiboVision"
    }
}