{"credit":[{"email":"chiaenc@ucr.edu","typeEntity":"Person","typeRoles":["Primary contact"],"url":"https://sites.google.com/site/tanalystprogram/contact"}],"documentation":[{"type":"GENERAL","url":"https://sites.google.com/site/tanalystprogram/download/tutorial"}],"function":[{"operation":[{"term":"Molecular dynamics simulation","uri":"http://edamontology.org/operation_2476"},{"term":"Protein sequence analysis","uri":"http://edamontology.org/operation_2479"},{"term":"Protein structure analysis","uri":"http://edamontology.org/operation_2406"}]}],"labels":{"language":["Perl"],"operatingSystem":["Linux","Windows","Mac"],"toolType":["Command-line tool"],"topic":[{"term":"Molecular dynamics","uri":"http://edamontology.org/topic_0176"},{"term":"Protein structure analysis","uri":"http://edamontology.org/topic_2814"},{"term":"Structure analysis","uri":"http://edamontology.org/topic_0081"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/t-analyst-v2-efficient-analysis-protein-conformational.html"}],"publication":[{"abstract":"T-Analyst is a user-friendly computer program for analyzing trajectories from molecular modeling. Instead of using Cartesian coordinates for protein conformational analysis, T-Analyst is based on internal bond-angle-torsion coordinates in which internal torsion angle movements, such as side-chain rotations, can be easily detected. The program computes entropy and automatically detects and corrects angle periodicity to produce accurate rotameric states of dihedrals. It also clusters multiple conformations and detects dihedral rotations that contribute hinge-like motions. Correlated motions between selected dihedrals can also be observed from the correlation map. T-Analyst focuses on showing changes in protein flexibility between different states and selecting representative protein conformations for molecular docking studies. The program is provided with instructions and full source code in Perl. © 2010 The Author(s).","authors":["Ai R.","Qaiser Fatmi M.","Chang C.-E.A."],"cit_count":20,"journal":"Journal of Computer-Aided Molecular Design","pmid":"20689979","title":"T-Analyst: A program for efficient analysis of protein conformational changes by torsion angles","year":"2010-10-01"}],"summary":{"biotoolsCURIE":"biotools:t-analyst","biotoolsID":"t-analyst","description":"A program for analyzing molecular dynamics trajectories based on internal bond-angle-torsion coordinates. The program computes entropy and rotameric states of dihedrals, clusters multiple conformations and detects dihedral rotations that contribute hinge-like motions. It was developed with special focuses on showing changes of protein flexibility between different states, and selecting representative protein conformations for molecular docking studies.","homepage":"https://sites.google.com/site/tanalystprogram/","name":"T-Analyst"}}