{"credit":[{"email":"kchen22@wustl.edu","name":"K. Chen","typeEntity":"Person","typeRoles":["Primary contact"],"url":"https://sourceforge.net/u/pickwonder/profile/"}],"function":[{"operation":[{"term":"Variant calling","uri":"http://edamontology.org/operation_3227"}]}],"labels":{"language":["C++","Perl"],"license":"GPL-3.0","operatingSystem":["Linux"],"toolType":["Command-line tool"],"topic":[{"term":"Genomics","uri":"http://edamontology.org/topic_0622"},{"term":"DNA structural variation","uri":"http://edamontology.org/topic_3175"}]},"publication":[{"abstract":"Detection and characterization of genomic structural variation are important for understanding the landscape of genetic variation in human populations and in complex diseases such as cancer. Recent studies demonstrate the feasibility of detecting structural variation using next-generation, short-insert, paired-end sequencing reads. However, the utility of these reads is not entirely clear, nor are the analysis methods with which accurate detection can be achieved. The algorithm BreakDancer predicts a wide variety of structural variants including insertion-deletions (indels), inversions and translocations. We examined BreakDancer's performance in simulation, in comparison with other methods and in analyses of a sample from an individual with acute myeloid leukemia and of samples from the 1,000 Genomes trio individuals. BreakDancer sensitively and accurately detected indels ranging from 10 base pairs to 1 megabase pair that are difficult to detect via a single conventional approach.","authors":["Chen K.","Wallis J.W.","McLellan M.D.","Larson D.E.","Kalicki J.M.","Pohl C.S.","McGrath S.D.","Wendl M.C.","Zhang Q.","Locke D.P.","Shi X.","Fulton R.S.","Ley T.J.","Wilson R.K.","Ding L.","Mardis E.R."],"cit_count":744,"journal":"Nature Methods","pmid":"19668202","title":"BreakDancer: An algorithm for high-resolution mapping of genomic structural variation","year":"2009-08-10"}],"summary":{"biotoolsCURIE":"biotools:breakdancer","biotoolsID":"breakdancer","description":"Application for detecting structural rearrangements and indels in short read sequencing data.","homepage":"http://sourceforge.net/projects/breakdancer/","name":"BreakDancer"}}