
{
    "credit": [
        {
            "email": "diego.darriba@h-its.org",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "Terms of use",
            "url": "https://github.com/ddarriba/ForeSeqs/blob/master/Makefile.am"
        },
        {
            "type": "User manual",
            "url": "https://github.com/ddarriba/ForeSeqs/blob/master/INSTALL"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Prediction and recognition",
                    "uri": "http://edamontology.org/operation_2423"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "C++"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Sequence analysis",
                "uri": "http://edamontology.org/topic_0080"
            },
            {
                "term": "Phylogenomics",
                "uri": "http://edamontology.org/topic_0194"
            },
            {
                "term": "Phylogeny",
                "uri": "http://edamontology.org/topic_0084"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/foreseqs-forecasting-missing-sequences-for-multigene-alignments.html"
        }
    ],
    "publication": [
        {
            "abstract": "© The Author 2016. Published by Oxford University Press. Motivation: The presence of missing data in large-scale phylogenomic datasets has negative effects on the phylogenetic inference process. One effect that is caused by alignments with missing per-gene or per-partition sequences is that the inferred phylogenies may exhibit extremely long branch lengths. We investigate if statistically predicting missing sequences for organisms by using information from genes/partitions that have data for these organisms alleviates the problem and improves phylogenetic accuracy. Results: We present several algorithms for correcting excessively long branch lengths induced by missing data. We also present methods for predicting/imputing missing sequence data. We evaluate our algorithms by systematically removing sequence data from three empirical and 100 simulated alignments. We then compare the Maximum Likelihood trees inferred from the gappy alignments and on the alignments with predicted sequence data to the trees inferred from the original, complete datasets. The datasets with predicted sequences showed one to two orders of magnitude more accurate branch lengths compared to the branch lengths of the trees inferred from the alignments with missing data. However, prediction did not affect the RF distances between the trees.",
            "authors": [
                "Darriba D.",
                "Weiss M.",
                "Stamatakis A."
            ],
            "cit_count": 4,
            "journal": "Bioinformatics",
            "pmid": "26733454",
            "title": "Prediction of missing sequences and branch lengths in phylogenomic data",
            "year": "2016-05-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:foreseqs",
        "biotoolsID": "foreseqs",
        "description": "Predict missing sequences and branch lengths in phylogenomic data.",
        "homepage": "https://github.com/ddarriba/ForeSeqs",
        "name": "ForeSeqs"
    }
}