{
    "additionDate": "2021-11-01T13:35:48.111761Z",
    "biotoolsCURIE": "biotools:pet-abc",
    "biotoolsID": "pet-abc",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "steven.meikle@sydney.edu.au",
            "name": "Steven R Meikle",
            "orcidid": "https://orcid.org/0000-0001-7397-0364",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "PET-ABC is an R package for fully Bayesian likelihood-free inference for kinetic models.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Modelling and simulation",
                    "uri": "http://edamontology.org/operation_2426"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/cgrazian/PETabc",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-11-01T13:38:24.441382Z",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/cgrazian/PETabc/issues"
        }
    ],
    "name": "PET-ABC",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1088/1361-6560/ABFA37",
            "metadata": {
                "abstract": "© 2021 Institute of Physics and Engineering in Medicine.Aims. We describe an intuitive, easy to use method called PET-ABC that enables full Bayesian statistical inference from single subject dynamic PET data. The performance of PET-ABC was compared with weighted non-linear least squares (WNLS) in terms of reliability of kinetic parameter estimation and statistical power for model selection. Methods. Dynamic PET data based on 1-tissue and 2-tissue compartmental models were simulated with 2 noise models and 3 noise levels. PET-ABC was used to evaluate the reliability of parameter estimates under each condition. It was also used to perform model selection for a simulated noisy dataset composed of a mixture of 1- and 2-tissue compartment kinetics. Finally, PET-ABC was used to analyze a non-steady state dynamic [11C] raclopride study performed on a fully conscious rat administered either 2 mg.kg-1 amphetamine or saline 20 min after tracer injection. Results. PET-ABC yielded posterior point estimates for model parameters with smaller variance than WNLS, as well as probability density functions indicating confidence intervals for those estimates. It successfully identified the superiority of a 2-tissue compartment model to fit the simulated mixed model data. For the drug challenge study, the post observation probability of striatal displacement of the PET signal was 0.9 for amphetamine and approximately 0 for saline, indicating a high probability of amphetamine-induced endogenous dopamine release in the striatum. PET-ABC also demonstrated superior statistical power to WNLS (0.87 versus 0.09) for selecting the correct model in a simulated ligand displacement study. Conclusions. PET-ABC is a simple and intuitive method that provides complete Bayesian statistical analysis of single subject dynamic PET data, including the extent to which model parameter estimates and model choice are supported by the data. Software for PET-ABC is freely available as part of the PETabc package https://github.com/cgrazian/PETabc.",
                "authors": [
                    {
                        "name": "Emvalomenos G."
                    },
                    {
                        "name": "Fan Y."
                    },
                    {
                        "name": "Grazian C."
                    },
                    {
                        "name": "Meikle S.R."
                    }
                ],
                "date": "2021-06-07T00:00:00Z",
                "journal": "Physics in Medicine and Biology",
                "title": "PET-ABC: Fully Bayesian likelihood-free inference for kinetic models"
            },
            "pmid": "33882476",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        },
        {
            "term": "Tomography",
            "uri": "http://edamontology.org/topic_3452"
        }
    ]
}
