
{
    "credit": [
        {
            "email": "Mason.Christopher@mayo.edu",
            "name": "Mason Christopher",
            "typeEntity": "Person",
            "typeRoles": [
                "Maintainer"
            ]
        },
        {
            "email": "Chiarito.Rudi@mayo.edu",
            "name": "Chiarito Rudi",
            "typeEntity": "Person",
            "typeRoles": [
                "Maintainer"
            ]
        },
        {
            "email": "webmaster@ms-utils.org",
            "typeEntity": "Person",
            "typeRoles": [
                "Documentor"
            ],
            "url": "http://ms-utils.org"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Deisotoping",
                    "uri": "http://edamontology.org/operation_3629"
                }
            ]
        }
    ],
    "labels": {
        "collectionID": [
            "ms-utils",
            "Proteomics"
        ],
        "language": [
            "C++"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Proteomics",
                "uri": "http://edamontology.org/topic_0121"
            },
            {
                "term": "Proteomics experiment",
                "uri": "http://edamontology.org/topic_3520"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://ms-utils.org"
        }
    ],
    "publication": [
        {
            "abstract": "16O/18O labeling is one differential proteomics technology among many that promises diagnostic and prognostic biomarkers of disease. Although the incorporation of 18O in the C-terminal carboxyl group during endoproteinase digestion in the presence of H218O makes the process of labeling facile, the ease and effectiveness of label incorporation have in some regards been outweighed by the difficulties in interpreting the resulting spectra. Complex isotope patterns result from the composition of unlabeled (18O0), singly labeled (18O1), and doubly labeled species (18)2) as well as contributions from the naturally occurring isotopes (e.g. 13C and 15N). Moreover because labeling is enzymatic, the number of 18O atoms incorporated can vary from peptide to peptide. Finally it is difficult to distinguish highly up-regulated from highly down-regulated or C-terminal peptides. We have developed an algorithm entitled regression analysis applied to mass spectrometry (RAAMS) that automatically, rapidly, and confidently interprets spectra of 18O-labeled peptides without requiring chemical composition information derived from production spectra. The algorithm is able to measure the effective 18O incorporation rate due to variable enzyme substrate specificity of the pseudosubstrater during the isotope exchange reaction and corrects for the 18O0 abundance that remains in the labeled sample when using a two-step digestion/labeling procedure. We have also incorporated a method for distinguishing pure 18O0 from pure 18O2 peptides utilizing impure H218O. The algorithm operates on centroided peak lists and is therefore very fast: nine chromatograms of, on average, 1,168 spectra and containing, on average, 6,761 isotopic clusters were interpreted in, on average, 45 s per chromatogram. RAAMS is fast enough (average, 38 ms/spectrum) to allow the possibility of performing information-dependent MS/MS on a chromatographic time scale on species exceeding predetermined ratio thresholds. We describe in detail the operation of the algorithm and demonstrate its use on datasets with known and unknown ratios. © 2007 by The American Society for Biochemistry and Molecular Biology, Inc.",
            "authors": [
                "Mason C.J.",
                "Therneau T.M.",
                "Eckel-Passow J.E.",
                "Johnson K.L.",
                "Oberg A.L.",
                "Olson J.E.",
                "Nair K.S.",
                "Muddiman D.C.",
                "Bergen H.R."
            ],
            "cit_count": 49,
            "doi": "10.1074/mcp.M600148-MCP200",
            "journal": "Molecular and Cellular Proteomics",
            "title": "A method for automatically interpreting mass spectra of 18O-labeled isotopic clusters",
            "type": "Other",
            "year": "2007-02-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:libmprc",
        "biotoolsID": "libmprc",
        "description": "Library for analysis of high resolution mass spectrometry data (including THRASH).",
        "homepage": "http://informatics.mayo.edu/svn/trunk/mprc/raams/doc/index.html",
        "name": "libmprc"
    }
}