{
    "additionDate": "2019-11-14T20:03:03Z",
    "biotoolsCURIE": "biotools:MultimodalPrognosis",
    "biotoolsID": "MultimodalPrognosis",
    "confidence_flag": "low",
    "credit": [
        {
            "email": "ogevaert@stanford.edu",
            "name": "Olivier Gevaert",
            "typeEntity": "Person"
        }
    ],
    "description": "> LOW CONFIDENCE! | > CORRECT NAME OF TOOL COULD ALSO BE 'WSIs', 'multimodal', 'pancancer', 'encoder' | Deep learning with multimodal representation for pancancer prognosis prediction | Our model estimates the time-til-death for patients across 20 different cancer types using the vast amount of multimodal data that is available for cancer patients | git clone https://github.com/gevaertlab/MultimodalPrognosis | For more details, see our paper",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                }
            ]
        }
    ],
    "homepage": "https://github.com/gevaertlab/MultimodalPrognosis",
    "language": [
        "Python"
    ],
    "lastUpdate": "2019-11-14T20:03:03Z",
    "name": "MultimodalPrognosis",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ342",
            "metadata": {
                "abstract": "© 2019 The Author(s) 2019. Published by Oxford University Press.Motivation: Estimating the future course of patients with cancer lesions is invaluable to physicians; however, current clinical methods fail to effectively use the vast amount of multimodal data that is available for cancer patients. To tackle this problem, we constructed a multimodal neural network-based model to predict the survival of patients for 20 different cancer types using clinical data, mRNA expression data, microRNA expression data and histopathology whole slide images (WSIs). We developed an unsupervised encoder to compress these four data modalities into a single feature vector for each patient, handling missing data through a resilient, multimodal dropout method. Encoding methods were tailored to each data type - using deep highway networks to extract features from clinical and genomic data, and convolutional neural networks to extract features from WSIs. Results: We used pancancer data to train these feature encodings and predict single cancer and pancancer overall survival, achieving a C-index of 0.78 overall. This work shows that it is possible to build a pancancer model for prognosis that also predicts prognosis in single cancer sites. Furthermore, our model handles multiple data modalities, efficiently analyzes WSIs and represents patient multimodal data flexibly into an unsupervised, informative representation. We thus present a powerful automated tool to accurately determine prognosis, a key step towards personalized treatment for cancer patients.",
                "authors": [
                    {
                        "name": "Cheerla A."
                    },
                    {
                        "name": "Gevaert O."
                    }
                ],
                "citationCount": 6,
                "date": "2019-07-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Deep learning with multimodal representation for pancancer prognosis prediction"
            },
            "pmcid": "PMC6612862",
            "pmid": "31510656"
        }
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        }
    ]
}