{
    "accessibility": [],
    "additionDate": "2017-01-17T15:01:13Z",
    "biotoolsCURIE": "biotools:methylumi",
    "biotoolsID": "methylumi",
    "collectionID": [
        "BioConductor"
    ],
    "confidence_flag": null,
    "cost": null,
    "credit": [
        {
            "email": "sdavis2@mail.nih.gov",
            "gridid": null,
            "name": "Sean Davis",
            "note": null,
            "orcidid": null,
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": null
        }
    ],
    "description": "This package provides classes for holding and manipulating Illumina methylation data. Based on eSet, it can contain MIAME information, sample information, feature information, and multiple matrices of data. An \"intelligent\" import function, methylumiR can read the Illumina text files and create a MethyLumiSet. methylumIDAT can directly read raw IDAT files from HumanMethylation27 and HumanMethylation450 microarrays. Normalization, background correction, and quality control are also included.",
    "documentation": [
        {
            "note": null,
            "type": "User manual",
            "url": "http://bioconductor.org/packages/release/bioc/html/methylumi.html"
        }
    ],
    "download": [
        {
            "note": null,
            "type": "Source code",
            "url": "http://bioconductor/packages/release/bioc/src/contrib/methylumi_2.20.0.tar.gz",
            "version": null
        }
    ],
    "editPermission": {
        "authors": [],
        "type": "private"
    },
    "elixirNode": [],
    "elixirPlatform": [],
    "elixir_badge": 0,
    "function": [
        {
            "cmd": null,
            "input": [],
            "note": null,
            "operation": [
                {
                    "term": "Methylation analysis",
                    "uri": "http://edamontology.org/operation_3204"
                }
            ],
            "output": []
        }
    ],
    "homepage": "http://bioconductor.org/packages/release/bioc/html/methylumi.html",
    "homepage_status": 0,
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-10T12:58:52Z",
    "license": "GPL-2.0",
    "link": [],
    "maturity": null,
    "name": "methylumi",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "otherID": [],
    "owner": "bioconductor_import",
    "publication": [
        {
            "doi": "10.1186/1471-2164-14-293",
            "metadata": {
                "abstract": "Background: As the most stable and experimentally accessible epigenetic mark, DNA methylation is of great interest to the research community. The landscape of DNA methylation across tissues, through development and in disease pathogenesis is not yet well characterized. Thus there is a need for rapid and cost effective methods for assessing genome-wide levels of DNA methylation. The Illumina Infinium HumanMethylation450 (450K) BeadChip is a very useful addition to the available methods for DNA methylation analysis but its complex design, incorporating two different assay methods, requires careful consideration. Accordingly, several normalization schemes have been published. We have taken advantage of known DNA methylation patterns associated with genomic imprinting and X-chromosome inactivation (XCI), in addition to the performance of SNP genotyping assays present on the array, to derive three independent metrics which we use to test alternative schemes of correction and normalization. These metrics also have potential utility as quality scores for datasets.Results: The standard index of DNA methylation at any specific CpG site is β = M/(M + U + 100) where M and U are methylated and unmethylated signal intensities, respectively. Betas (βs) calculated from raw signal intensities (the default GenomeStudio behavior) perform well, but using 11 methylomic datasets we demonstrate that quantile normalization methods produce marked improvement, even in highly consistent data, by all three metrics. The commonly used procedure of normalizing betas is inferior to the separate normalization of M and U, and it is also advantageous to normalize Type I and Type II assays separately. More elaborate manipulation of quantiles proves to be counterproductive.Conclusions: Careful selection of preprocessing steps can minimize variance and thus improve statistical power, especially for the detection of the small absolute DNA methylation changes likely associated with complex disease phenotypes. For the convenience of the research community we have created a user-friendly R software package called wateRmelon, downloadable from bioConductor, compatible with the existing methylumi, minfi and IMA packages, that allows others to utilize the same normalization methods and data quality tests on 450K data. © 2013 Pidsley et al.; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Pidsley R."
                    },
                    {
                        "name": "Y Wong C.C."
                    },
                    {
                        "name": "Volta M."
                    },
                    {
                        "name": "Lunnon K."
                    },
                    {
                        "name": "Mill J."
                    },
                    {
                        "name": "Schalkwyk L.C."
                    }
                ],
                "citationCount": 292,
                "date": "2013-05-01T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "A data-driven approach to preprocessing Illumina 450K methylation array data"
            },
            "note": null,
            "pmcid": null,
            "pmid": null,
            "type": "Other",
            "version": null
        }
    ],
    "relation": [],
    "toolType": [
        "Command-line tool",
        "Library"
    ],
    "topic": [
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        },
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        }
    ],
    "validated": 1,
    "version": [
        "2.20.0"
    ]
}