{"credit":[{"typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://www.pesthomepage.org"}],"documentation":[{"type":"GENERAL","url":"http://www.pesthomepage.org/Training.php"}],"function":[{"operation":[{"term":"Modelling and simulation","uri":"http://edamontology.org/operation_2426"}]}],"labels":{"collectionID":["Animal and Crop Genomics"],"language":["C++","Fortran"],"operatingSystem":["Linux","Windows","Mac"],"toolType":["Command-line tool"],"topic":[{"term":"Systems biology","uri":"http://edamontology.org/topic_2259"}]},"publication":[{"abstract":"© 2018 Elsevier Ltd An open-source, scalable and model-independent (non-intrusive) implementation of an iterative ensemble smoother has been developed to alleviate the computational burden associated with history-matching and uncertainty quantification of real-world-scale environmental models that have very high dimensional parameter spaces. The tool, named pestpp-ies, implements the ensemble-smoother form of the popular Gauss-Levenberg-Marquardt algorithm, uses the pest model-interface protocols and includes a built-in parallel run manager, multiple lambda testing and model run failure tolerance. As a demonstration of its capabilities, pestpp-ies is applied to a synthetic groundwater model with thousands of parameters and to a real-world groundwater flow and transport model with tens of thousands of parameters. pestpp-ies is shown to efficiently and effectively condition parameters in both cases and can provide means to estimate posterior forecast uncertainty when the forecasts depend on large numbers of parameters.","authors":["White J.T."],"cit_count":2,"doi":"10.1016/j.envsoft.2018.06.009","journal":"Environmental Modelling and Software","title":"A model-independent iterative ensemble smoother for efficient history-matching and uncertainty quantification in very high dimensions","type":"Primary","year":"2018-11-01"}],"summary":{"biotoolsCURIE":"biotools:pest","biotoolsID":"pest","description":"Model-Independent Parameter Estimation and Uncertainty Analysis.","homepage":"http://www.pesthomepage.org","name":"PEST"}}