{
    "accessibility": "Open access",
    "additionDate": "2024-03-27T14:57:37.459010Z",
    "biotoolsCURIE": "biotools:sequal-stream",
    "biotoolsID": "sequal-stream",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "oscar.castellanos@udc.es",
            "name": "Óscar Castellanos-Rodríguez",
            "typeEntity": "Person"
        },
        {
            "name": "Juan Touriño",
            "typeEntity": "Person"
        },
        {
            "name": "Roberto R. Expósito",
            "typeEntity": "Person"
        }
    ],
    "description": "Big Data tool to perform quality control operations of NGS datasets in a scalable way, supporting single-end and paired-end reads in FASTQ/FASTA formats.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "Genetic mapping",
                    "uri": "http://edamontology.org/operation_0282"
                },
                {
                    "term": "Sequencing quality control",
                    "uri": "http://edamontology.org/operation_3218"
                }
            ]
        }
    ],
    "homepage": "https://github.com/UDC-GAC/SeQual-Stream",
    "language": [
        "Java"
    ],
    "lastUpdate": "2024-03-27T14:57:37.461606Z",
    "license": "AGPL-3.0",
    "name": "SeQual-Stream",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12859-023-05530-7",
            "metadata": {
                "abstract": "Background: Quality control of DNA sequences is an important data preprocessing step in many genomic analyses. However, all existing parallel tools for this purpose are based on a batch processing model, needing to have the complete genetic dataset before processing can even begin. This limitation clearly hinders quality control performance in those scenarios where the dataset must be downloaded from a remote repository and/or copied to a distributed file system for its parallel processing. Results: In this paper we present SeQual-Stream, a streaming tool that allows performing multiple quality control operations on genomic datasets in a fast, distributed and scalable way. To do so, our approach relies on the Apache Spark framework and the Hadoop Distributed File System (HDFS) to fully exploit the stream paradigm and accelerate the preprocessing of large datasets as they are being downloaded and/or copied to HDFS. The experimental results have shown significant improvements in the execution times of SeQual-Stream when compared to a batch processing tool with similar quality control features, providing a maximum speedup of 2.7 × when processing a dataset with more than 250 million DNA sequences, while also demonstrating good scalability features. Conclusion: Our solution provides a more scalable and higher performance way to carry out quality control of large genomic datasets by taking advantage of stream processing features. The tool is distributed as free open-source software released under the GNU AGPLv3 license and is publicly available to download at https://github.com/UDC-GAC/SeQual-Stream .",
                "authors": [
                    {
                        "name": "Castellanos-Rodriguez O."
                    },
                    {
                        "name": "Exposito R.R."
                    },
                    {
                        "name": "Tourino J."
                    }
                ],
                "date": "2023-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "SeQual-Stream: approaching stream processing to quality control of NGS datasets"
            },
            "pmcid": "PMC10612204",
            "pmid": "37891497"
        }
    ],
    "toolType": [
        "Command-line tool",
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Biotechnology",
            "uri": "http://edamontology.org/topic_3297"
        },
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ]
}
