{"credit":[{"email":"fabio.cerqueira@ufv.br","name":"Fabio R. Cerqueira","typeEntity":"Person","typeRoles":["Primary contact"]},{"email":"christian.baumgartner@umit.at","name":"Christian Baumgartner","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"https://sourceforge.net/projects/mude/"}],"function":[{"operation":[{"term":"Protein identification","uri":"http://edamontology.org/operation_3767"}]}],"labels":{"collectionID":["Proteomics"],"language":["Java"],"operatingSystem":["Linux","Windows","Mac"],"toolType":["Command-line tool"],"topic":[{"term":"Proteomics","uri":"http://edamontology.org/topic_0121"},{"term":"Proteins","uri":"http://edamontology.org/topic_0078"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/mude-1-0-assess-msms-spectra-assignments.html"}],"publication":[{"abstract":"The target-decoy search strategy has been successfully applied in shotgun proteomics for validating peptide and protein identifications. If, on one hand, this method has proven to be very efficient for error estimation, on the other hand, little attention has been paid to the resulting sensitivity. Only two scores are normally used and thresholds are explored in a very simplistic way. In this work, a multivariate decoy analysis is described, where many quality parameters are considered. This analysis is treated in our approach as an optimization problem for sensitivity maximization. Furthermore, an efficient heuristic is proposed to solve this problem. Experiments comparing our method, termed MUDE (multivariate decoy database analysis), with traditional bivariate decoy analysis and with Peptide/ProteinProphet showed that our procedure significantly enhances the retrieved number of identifications when comparing the same false discovery rates. Particularly for phosphopeptide/protein identifications, we could demonstrate more than a two-fold increase in sensitivity compared with the Trans-Proteomic Pipeline tools. © 2010 American Chemical Society.","authors":["Cerqueira F.R.","Graber A.","Schwikowski B.","Baumgartner C."],"cit_count":12,"journal":"Journal of Proteome Research","pmid":"20199108","title":"MUDE: A new approach for optimizing sensitivity in the target-decoy search strategy for large-scale peptide/protein identification","year":"2010-05-07"}],"summary":{"biotoolsCURIE":"biotools:mude","biotoolsID":"mude","description":"A set of programs implementing the framework to assess MS/MS spectra assignments","homepage":"http://sourceforge.net/projects/mude/","name":"MUDE"}}