{
    "accessibility": "Open access",
    "additionDate": "2019-03-17T14:27:40Z",
    "biotoolsCURIE": "biotools:DEWE_Differential_Expression_Workflow_Executor",
    "biotoolsID": "DEWE_Differential_Expression_Workflow_Executor",
    "cost": "Free of charge",
    "credit": [
        {
            "typeEntity": "Project",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://www.sing-group.org/dewe/contact-us.html"
        }
    ],
    "description": "DEWE is a software tool to perform genetic differential expression analysis of RNA-Seq data.\n\nDEWE offers built-in, easy-to-configure workflows that facilitate the execution of DE analyses. Currently, DEWE provides two differential expression analysis workflows: HISAT2, StringTie and R libraries (Ballgown and edgeR) and Bowtie2, StringTie and R libraries (Ballgown and edgeR).",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://www.sing-group.org/dewe/manual.html"
        }
    ],
    "download": [
        {
            "type": "Downloads page",
            "url": "https://www.sing-group.org/dewe/downloads.html"
        }
    ],
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "RNA sequence (raw)",
                        "uri": "http://edamontology.org/data_3496"
                    },
                    "format": [
                        {
                            "term": "FASTQ",
                            "uri": "http://edamontology.org/format_1930"
                        }
                    ]
                }
            ],
            "operation": [
                {
                    "term": "Differential gene expression analysis",
                    "uri": "http://edamontology.org/operation_3223"
                }
            ]
        }
    ],
    "homepage": "https://www.sing-group.org/dewe/",
    "language": [
        "Java"
    ],
    "lastUpdate": "2020-06-16T10:55:24Z",
    "license": "GPL-3.0",
    "maturity": "Mature",
    "name": "DEWE: Differential Expression Workflow Executor",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "hlfernandez@uvigo.es",
    "publication": [
        {
            "doi": "10.1016/j.compbiomed.2019.02.021",
            "metadata": {
                "abstract": "© 2019 Elsevier LtdBackground: Transcriptomics profiling aims to identify and quantify all transcripts present within a cell type or tissue at a particular state, and thus provide information on the genes expressed in specific experimental settings, differentiation or disease conditions. RNA-Seq technology is becoming the standard approach for such studies, but available analysis tools are often hard to install, configure and use by users without advanced bioinformatics skills. Methods: Within reason, DEWE aims to make RNA-Seq analysis as easy for non-proficient users as for experienced bioinformaticians. DEWE supports two well-established and widely used differential expression analysis workflows: using Bowtie2 or HISAT2 for sequence alignment; and, both applying StringTie for quantification, and Ballgown and edgeR for differential expression analysis. Also, it enables the tailored execution of individual tools as well as helps with the management and visualisation of differential expression results. Results: DEWE provides a user-friendly interface designed to reduce the learning curve of less knowledgeable users while enabling analysis customisation and software extension by advanced users. Docker technology helps overcome installation and configuration hurdles. In addition, DEWE produces high quality and publication-ready outputs in the form of tab-delimited files and figures, as well as helps researchers with further analyses, such as pathway enrichment analysis. Conclusions: The abilities of DEWE are exemplified here by practical application to a comparative analysis of monocytes and monocyte-derived dendritic cells, a study of clinical relevance. DEWE installers and documentation are freely available at https://www.sing-group.org/dewe.",
                "authors": [
                    {
                        "name": "Lopez-Fernandez H."
                    },
                    {
                        "name": "Blanco-Miguez A."
                    },
                    {
                        "name": "Fdez-Riverola F."
                    },
                    {
                        "name": "Sanchez B."
                    },
                    {
                        "name": "Lourenco A."
                    }
                ],
                "citationCount": 2,
                "date": "2019-04-01T00:00:00Z",
                "journal": "Computers in Biology and Medicine",
                "title": "DEWE: A novel tool for executing differential expression RNA-Seq workflows in biomedical research"
            },
            "pmid": "30849608",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        }
    ],
    "version": [
        "1.2.0"
    ]
}