{
    "additionDate": "2024-05-23T23:39:28.316223Z",
    "biotoolsCURIE": "biotools:snvstory",
    "biotoolsID": "snvstory",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "peter.white@nationwidechildrens.org",
            "name": "Peter White",
            "typeEntity": "Person"
        }
    ],
    "description": "Inferring genetic ancestry from genome sequencing data.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                },
                {
                    "term": "DNA testing",
                    "uri": "http://edamontology.org/operation_3920"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Variant prioritisation",
                    "uri": "http://edamontology.org/operation_3226"
                }
            ]
        }
    ],
    "homepage": "https://github.com/nch-igm/snvstory",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-05-23T23:39:28.318577Z",
    "license": "BSD-3-Clause",
    "name": "SNVstory",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/s12859-024-05703-y",
            "metadata": {
                "abstract": "Background: Genetic ancestry, inferred from genomic data, is a quantifiable biological parameter. While much of the human genome is identical across populations, it is estimated that as much as 0.4% of the genome can differ due to ancestry. This variation is primarily characterized by single nucleotide variants (SNVs), which are often unique to specific genetic populations. Knowledge of a patient's genetic ancestry can inform clinical decisions, from genetic testing and health screenings to medication dosages, based on ancestral disease predispositions. Nevertheless, the current reliance on self-reported ancestry can introduce subjectivity and exacerbate health disparities. While genomic sequencing data enables objective determination of a patient's genetic ancestry, existing approaches are limited to ancestry inference at the continental level. Results: To address this challenge, and create an objective, measurable metric of genetic ancestry we present SNVstory, a method built upon three independent machine learning models for accurately inferring the sub-continental ancestry of individuals. We also introduce a novel method for simulating individual samples from aggregate allele frequencies from known populations. SNVstory includes a feature-importance scheme, unique among open-source ancestral tools, which allows the user to track the ancestral signal broadcast by a given gene or locus. We successfully evaluated SNVstory using a clinical exome sequencing dataset, comparing self-reported ethnicity and race to our inferred genetic ancestry, and demonstrate the capability of the algorithm to estimate ancestry from 36 different populations with high accuracy. Conclusions: SNVstory represents a significant advance in methods to assign genetic ancestry, opening the door to ancestry-informed care. SNVstory, an open-source model, is packaged as a Docker container for enhanced reliability and interoperability. It can be accessed from https://github.com/nch-igm/snvstory.",
                "authors": [
                    {
                        "name": "Bollas A.E."
                    },
                    {
                        "name": "Ceyhan D."
                    },
                    {
                        "name": "Gaither J.B."
                    },
                    {
                        "name": "Mardis E.R."
                    },
                    {
                        "name": "Rajkovic A."
                    },
                    {
                        "name": "White P."
                    }
                ],
                "date": "2024-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "SNVstory: inferring genetic ancestry from genome sequencing data"
            },
            "pmcid": "PMC10877842",
            "pmid": "38378494"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Exome sequencing",
            "uri": "http://edamontology.org/topic_3676"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Personalised medicine",
            "uri": "http://edamontology.org/topic_3577"
        },
        {
            "term": "Population genetics",
            "uri": "http://edamontology.org/topic_3056"
        }
    ]
}
