{
    "additionDate": "2021-03-19T08:28:52Z",
    "biotoolsCURIE": "biotools:clpred",
    "biotoolsID": "clpred",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "jxwang@mail.csu.edu.cn",
            "name": "Yaohang Li",
            "typeEntity": "Person"
        },
        {
            "email": "yaohang@cs.odu.edu",
            "name": "Jianxin Wang",
            "typeEntity": "Person"
        }
    ],
    "description": "CLPred is a tool for sequence-based protein crystallization predictor using bidirectional recurrent neural network with long short-term memory (BLSTM). BLSTM to capture the long-range interaction patterns between k-mers amino acids.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein crystallizability prediction",
                    "uri": "http://edamontology.org/operation_0410"
                },
                {
                    "term": "Protein secondary structure prediction",
                    "uri": "http://edamontology.org/operation_0267"
                },
                {
                    "term": "Protein interaction network prediction",
                    "uri": "http://edamontology.org/operation_3094"
                }
            ]
        }
    ],
    "homepage": "https://github.com/xuanwenjing/CLPred",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-03-21T13:51:27Z",
    "name": "CLPred",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAA791",
            "metadata": {
                "abstract": "© The Author(s) 2020. Published by Oxford University Press. All rights reserved. For permissions, please e-mail: journals.permissions@oup.comMotivation: Determining the structures of proteins is a critical step to understand their biological functions. Crystallography-based X-ray diffraction technique is the main method for experimental protein structure determination. However, the underlying crystallization process, which needs multiple time-consuming and costly experimental steps, has a high attrition rate. To overcome this issue, a series of in silico methods have been developed with the primary aim of selecting the protein sequences that are promising to be crystallized. However, the predictive performance of the current methods is modest. Results: We propose a deep learning model, so-called CLPred, which uses a bidirectional recurrent neural network with long short-term memory (BLSTM) to capture the long-range interaction patterns between k-mers amino acids to predict protein crystallizability. Using sequence only information, CLPred outperforms the existing deep-learning predictors and a vast majority of sequence-based diffraction-quality crystals predictors on three independent test sets. The results highlight the effectiveness of BLSTM in capturing non-local, long-range inter-peptide interaction patterns to distinguish proteins that can result in diffraction-quality crystals from those that cannot. CLPred has been steadily improved over the previous window-based neural networks, which is able to predict crystallization propensity with high accuracy. CLPred can also be improved significantly if it incorporates additional features from pre-extracted evolutional, structural and physicochemical characteristics. The correctness of CLPred predictions is further validated by the case studies of Sox transcription factor family member proteins and Zika virus non-structural proteins.",
                "authors": [
                    {
                        "name": "Xuan W."
                    },
                    {
                        "name": "Liu N."
                    },
                    {
                        "name": "Huang N."
                    },
                    {
                        "name": "Li Y."
                    },
                    {
                        "name": "Wang J."
                    }
                ],
                "date": "2020-12-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "CLPred: A sequence-based protein crystallization predictor using BLSTM neural network"
            },
            "pmid": "33381840"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "X-ray diffraction",
            "uri": "http://edamontology.org/topic_2828"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "Protein structural motifs and surfaces",
            "uri": "http://edamontology.org/topic_0166"
        }
    ]
}