
{
    "credit": [
        {
            "email": "carlgdeboer@gmail.com",
            "name": "Carl G. de Boer",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        },
        {
            "email": "aregev@broadinstitute.org",
            "name": "Aviv Regev",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "https://www.biorxiv.org/content/early/2018/04/03/129247"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Analysis",
                    "uri": "http://edamontology.org/operation_2945"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "R",
            "Ruby"
        ],
        "operatingSystem": [
            "Linux",
            "Mac"
        ],
        "toolType": [
            "Command-line tool",
            "Suite"
        ],
        "topic": [
            {
                "term": "Epigenomics",
                "uri": "http://edamontology.org/topic_3173"
            },
            {
                "term": "Transcription factors",
                "uri": "http://edamontology.org/topic_0749"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© 2018 The Author(s).Background: Variation in chromatin organization across single cells can help shed important light on the mechanisms controlling gene expression, but scale, noise, and sparsity pose significant challenges for interpretation of single cell chromatin data. Here, we develop BROCKMAN (Brockman Representation Of Chromatin by K-mers in Mark-Associated Nucleotides), an approach to infer variation in transcription factor (TF) activity across samples through unsupervised analysis of the variation in DNA sequences associated with an epigenomic mark. Results: BROCKMAN represents each sample as a vector of epigenomic-mark-associated DNA word frequencies, and decomposes the resulting matrix to find hidden structure in the data, followed by unsupervised grouping of samples and identification of the TFs that distinguish groups. Applied to single cell ATAC-seq, BROCKMAN readily distinguished cell types, treatments, batch effects, experimental artifacts, and cycling cells. We show that each variable component in the k-mer landscape reflects a set of co-varying TFs, which are often known to physically interact. For example, in K562 cells, AP-1 TFs were central determinant of variability in chromatin accessibility through their variable expression levels and diverse interactions with other TFs. We provide a theoretical basis for why cooperative TF binding - and any associated epigenomic mark - is inherently more variable than non-cooperative binding. Conclusions: BROCKMAN and related approaches will help gain a mechanistic understanding of the trans determinants of chromatin variability between cells, treatments, and individuals.",
            "authors": [
                "de Boer C.G.",
                "Regev A."
            ],
            "cit_count": 0,
            "doi": "10.1186/s12859-018-2255-6",
            "journal": "BMC Bioinformatics",
            "title": "BROCKMAN: Deciphering variance in epigenomic regulators by k-mer factorization",
            "type": "Primary",
            "year": "2018-07-03"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:brockman",
        "biotoolsID": "brockman",
        "description": "It converts genomics data into DNA k-mer words representing the regions associated with a chromatin mark, and then analyzing these k-mer sets to see how samples differ from each other. This approach is primarily intended for single cell genomics data, and was tested most extensively on single cell ATAC-seq data. The bash scripts in particular may require some alteration for other types of genomics data.",
        "homepage": "https://carldeboer.github.io/brockman.html",
        "name": "BROCKMAN"
    }
}