{
    "accessibility": "Open access",
    "additionDate": "2021-11-20T07:34:20.541601Z",
    "biotoolsCURIE": "biotools:circexp",
    "biotoolsID": "circexp",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "quh@mail.cbi.pku.edu.cn",
            "name": "Hong Qu",
            "orcidid": "https://orcid.org/0000-0001-7735-5748",
            "typeEntity": "Person"
        }
    ],
    "description": "An online transcriptome platform for human circRNA expressions in cancers.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Differential gene expression profiling",
                    "uri": "http://edamontology.org/operation_3223"
                },
                {
                    "term": "Expression profile clustering",
                    "uri": "http://edamontology.org/operation_0313"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "http://soft.bioinfo-minzhao.org/circexp",
    "lastUpdate": "2021-11-20T07:34:20.544027Z",
    "name": "circExp",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1093/DATABASE/BAAB045",
            "metadata": {
                "abstract": "© 2021 The Author(s) 2021. Published by Oxford University Press.Circular RNA (circRNA) is a highly stable, single-stranded, closed-loop RNA that works as RNA or as a protein decoy to regulate gene expression. In humans, thousands of circRNA transcriptional products precisely express in specific developmental stages, tissues and cell types. Due to their stability and specificity, circRNAs are ideal biomarkers for cancer diagnosis and prognosis. To provide an integrated and standardized circRNA expression profile for human cancers, we performed extensive data curation across 11 technical platforms, collecting 48 expression profile data sets for 18 cancer types and amassing 860 751 expression records. We also identified 189 193 differential expression signatures that are significantly different between normal and cancer samples. All the pre-calculated expression analysis results are organized into 132 plain text files for bulk download. Our online interface, circExp, provides data browsing and search functions. For each data set, a dynamic expression heatmap provides a profile overview. Based on the processed data, we found that 52 circRNAs were consistently and differentially expressed in 20 or more processed analyses. By mapping those circRNAs to their parent protein-coding genes, we found that they may have profoundly affected the survival of 10 797 patients in the The Cancer Genome Atlas pan-cancer data set. In sum, we developed circExp and demonstrated that it is useful to identify circRNAs that have potential diagnostic and prognostic significance for a variety of cancer types. In this online and reusable database, found at http://soft.bioinfo-minzhao.org/circexp, we have provided pre-calculated expression data about circRNAs and their parental genes, as well as data browsing and searching functions. Database URL: http://soft.bioinfominzhao.org/circexp/",
                "authors": [
                    {
                        "name": "Liu Y."
                    },
                    {
                        "name": "Qu H."
                    },
                    {
                        "name": "Zhao M."
                    }
                ],
                "date": "2021-01-01T00:00:00Z",
                "journal": "Database",
                "title": "CircExp database: An online transcriptome platform for human circRNA expressions in cancers"
            },
            "pmcid": "PMC8299715",
            "pmid": "34296749"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ],
    "validated": 1
}
