
{
    "credit": [
        {
            "email": "jafar.taghiyar@gmail.com",
            "name": "Jafar Taghiyar",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "https://github.com/jtaghiyar/kronos"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Service invocation",
                    "uri": "http://edamontology.org/operation_3763"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Python"
        ],
        "license": "MIT",
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Software engineering",
                "uri": "http://edamontology.org/topic_3372"
            },
            {
                "term": "Genomics",
                "uri": "http://edamontology.org/topic_0622"
            },
            {
                "term": "Sequence analysis",
                "uri": "http://edamontology.org/topic_0080"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© The Author 2017. Published by Oxford University Press. Background: The field of next-generation sequencing informatics has matured to a point where algorithmic advances in sequence alignment and individual feature detection methods have stabilized. Practical and robust implementation of complex analytical workflows (where such tools are structured into \"best practices\" for automated analysis of next-generation sequencing datasets) still requires significant programming investment and expertise. Results: We present Kronos, a software platform for facilitating the development and execution of modular, auditable, and distributable bioinformatics workflows. Kronos obviates the need for explicit coding of workflows by compiling a text configuration file into executable Python applications. Making analysis modules would still require programming. The framework of each workflow includes a run manager to execute the encoded workflows locally (or on a cluster or cloud), parallelize tasks, and log all runtime events. The resulting workflows are highly modular and configurable by construction, facilitating flexible and extensible meta-applications that can be modified easily through configuration file editing. The workflows are fully encoded for ease of distribution and can be instantiated on external systems, a step toward reproducible research and comparative analyses. We introduce a framework for building Kronos components that function as shareable, modular nodes in Kronos workflows. Conclusions: The Kronos platform provides a standard framework for developers to implement custom tools, reuse existing tools, and contribute to the community at large. Kronos is shipped with both Docker and Amazon Web Services Machine Images. It is free, open source, and available through the Python Package Index and at https://github.com/jtaghiyar/kronos.",
            "authors": [
                "Jafar Taghiyar M.",
                "Rosner J.",
                "Grewal D.",
                "Grande B.M.",
                "Aniba R.",
                "Grewal J.",
                "Boutros P.C.",
                "Morin R.D.",
                "Bashashati A.",
                "Shah S.P."
            ],
            "cit_count": 2,
            "doi": "10.1093/gigascience/gix042",
            "journal": "GigaScience",
            "title": "Kronos: A workflow assembler for genome analytics and informatics",
            "year": "2017-07-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:kronos",
        "biotoolsID": "kronos",
        "description": "A workflow assembler for cancer genome analytics and informatics.",
        "homepage": "https://github.com/jtaghiyar/kronos",
        "name": "Kronos"
    }
}