{
    "accessibility": "Open access",
    "additionDate": "2019-08-03T12:59:45Z",
    "biotoolsCURIE": "biotools:CODA-ML",
    "biotoolsID": "CODA-ML",
    "cost": "Free of charge",
    "description": "Context-specific biological knowledge representation for systemic physiology analysis.",
    "editPermission": {
        "type": "private"
    },
    "homepage": "https://github.com/MijinKwon/CODA-ML",
    "language": [
        "Java"
    ],
    "lastUpdate": "2020-06-16T10:55:24Z",
    "license": "Unlicense",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/MijinKwon/CODA-ML/issues"
        }
    ],
    "maturity": "Mature",
    "name": "CODA-ML",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "Ruta",
    "publication": [
        {
            "doi": "10.1186/s12859-019-2812-7",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Computational analysis of complex diseases involving multiple organs requires the integration of multiple different models into a unified model. Different models are often constructed in heterogeneous formats. Thus, the integration of the models requires a standard language format that can effectively represent essential biological information. However, the previously introduced formats have limitations that prevent from adequately representing essential biological information, particularly specifications of bio-molecules and biological contexts. Results: We defined an XML-based markup language called context-oriented directed association markup language (CODA-ML), which better represents essential biological information. The CODA-ML has two major strengths in designating molecular specifications and biological contexts. It can cover heterogeneous entity types involved in biological events (e.g. gene/protein, compound, cellular function, disease). Molecular types of entities can have molecular specifications which include detailed information of a molecule from isoforms to modifications, enabling high-resolution representation of molecules. In addition, it can distinguish biological events that vary depending on different biological contexts such as cell types or disease conditions. Especially representation of inter-cellular events as well as intra-cellular events is available. These two major strengths can resolve contradictory associations when different models are integrated into one unified model, which improves the accuracy of the model. Conclusions: With the CODA-ML, diverse models such as signaling pathways, metabolic pathways, and gene regulatory pathways can be represented in a unified language format. Heterogeneous entity types can be covered by the CODA-ML, thus it enables detailed description for the mechanisms of diseases or drugs from multiple perspectives (e.g., molecule, function or disease). The CODA-ML is expected to help integrate different models into one systemic model in an efficient and effective. The unified model can be used to perform computational analysis not only for cancer but also for other complex diseases involving multiple organs beyond a single cell.",
                "authors": [
                    {
                        "name": "Kwon M."
                    },
                    {
                        "name": "Yim S."
                    },
                    {
                        "name": "Kim G."
                    },
                    {
                        "name": "Lee S."
                    },
                    {
                        "name": "Jeong C."
                    },
                    {
                        "name": "Lee D."
                    }
                ],
                "citationCount": 1,
                "date": "2019-05-29T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "CODA-ML: Context-specific biological knowledge representation for systemic physiology analysis"
            },
            "pmcid": "PMC6538558",
            "pmid": "31138123",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Physiology",
            "uri": "http://edamontology.org/topic_3300"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Endocrinology and metabolism",
            "uri": "http://edamontology.org/topic_3407"
        }
    ],
    "validated": 1
}