{
    "additionDate": "2022-10-26T08:58:02.493680Z",
    "biotoolsCURIE": "biotools:abosa",
    "biotoolsID": "abosa",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Sami Nikkonen"
        },
        {
            "name": "Tuomas Karhu"
        }
    ],
    "description": "Automatic blood oxygen saturation signal analysis software. This software automatically detects desaturation and following recovery events from the blood oxygen saturation signal. The software calculates numerous event-specific metrics for each scored event.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Validation",
                    "uri": "http://edamontology.org/operation_2428"
                }
            ]
        }
    ],
    "homepage": "https://zenodo.org/record/6962129",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2024-11-24T15:26:11.159286Z",
    "license": "Other",
    "name": "ABOSA",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1016/j.cmpb.2022.107120",
            "metadata": {
                "abstract": "Background and objective: Many sleep recording software used in clinical settings have some tools to automatically analyze the blood oxygen saturation (SpO2) signal by detecting desaturations. However, these tools are often inadequate for scientific research as they do not provide SpO2 signal-based parameters which are superior in the estimation of sleep apnea severity and related medical consequences. In addition, these software require expensive licenses and they lack batch analysis tools. Thus, we developed the first freely available automatic blood oxygen saturation analysis software (ABOSA) that provides sophisticated SpO2 signal-based parameters and enables batch analysis of large datasets. Methods: ABOSA was programmed with MATLAB. ABOSA automatically detects desaturation and recovery events from the SpO2 signals (EDF files) and calculates numerous parameters, such as oxygen desaturation index (ODI) and desaturation severity (DesSev). The accuracy of the ABOSA software was evaluated by comparing its desaturation scorings to manual scorings in Kuopio (n = 1981) and Loewenstein (n = 930) sleep apnea patient datasets. Validation was performed in a second-by-second manner by calculating Matthew's correlation coefficients (MCC) and median differences in parameter values. Finally, the performance of the ABOSA software was compared to two commercial software, Noxturnal and Profusion, in 100 patient subpopulations. As Noxturnal or Profusion does not calculate novel desaturation parameters, these were calculated with custom-made functions. Results: The agreements between ABOSA and manual scorings were great in both Kuopio (MCC = 0.801) and Loewenstein (MCC = 0.898) datasets. However, ABOSA slightly overestimated the desaturation parameter values. The median differences in ODIs were 0.8 (Kuopio) and 0.0 (Loewenstein) events/h. Similarly, the median differences in DesSevs were 0.02 (Kuopio) and 0.01 (Loewenstein) percentage points. In a second-by-second analysis, ABOSA performed very similarly to Noxturnal and Profusion software in both Kuopio (MCCABOSA = 0.807, MCCNoxturnal = 0.807, MCCProfusion = 0.811) and Loewenstein (MCCABOSA = 0.904, MCCNoxturnal = 0.911, MCCProfusion = 0.871) datasets. Based on Noxturnal and Profusion scorings, the desaturation parameter values were similarly overestimated compared to ABOSA. Conclusions: ABOSA is an accurate and freely available software that calculates both traditional clinical parameters and novel parameters, provides a detailed characterization of desaturation and recovery events, and enables batch analysis of large datasets. These are features that no other software currently provides making ABOSA uniquely suitable for scientific research use.",
                "authors": [
                    {
                        "name": "Karhu T."
                    },
                    {
                        "name": "Leppanen T."
                    },
                    {
                        "name": "Myllymaa S."
                    },
                    {
                        "name": "Nikkonen S."
                    },
                    {
                        "name": "Oksenberg A."
                    },
                    {
                        "name": "Toyras J."
                    }
                ],
                "citationCount": 10,
                "date": "2022-11-01T00:00:00Z",
                "journal": "Computer Methods and Programs in Biomedicine",
                "title": "ABOSA – Freely available automatic blood oxygen saturation signal analysis software: Structure and validation"
            },
            "pmid": "36152624"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Medicine",
            "uri": "http://edamontology.org/topic_3303"
        }
    ],
    "validated": 1
}
