{
    "accessibility": "Open access",
    "additionDate": "2024-01-02T17:23:18.932059Z",
    "biotoolsCURIE": "biotools:ged_map",
    "biotoolsID": "ged_map",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "thomas.buechler@uni-ulm.de",
            "name": "Thomas Büchler",
            "orcidid": "https://orcid.org/0000-0002-9273-5439",
            "typeEntity": "Person"
        },
        {
            "email": "enno.ohlebusch@uni-ulm.de",
            "name": "Enno Ohlebusch",
            "typeEntity": "Person"
        }
    ],
    "description": "Efficient short read mapping to a pangenome that is represented by a graph of ED strings.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Haplotype mapping",
                    "uri": "http://edamontology.org/operation_0487"
                },
                {
                    "term": "Read mapping",
                    "uri": "http://edamontology.org/operation_3198"
                },
                {
                    "term": "Sequence trimming",
                    "uri": "http://edamontology.org/operation_3192"
                }
            ]
        }
    ],
    "homepage": "https://github.com/thomas-buechler-ulm/gedmap",
    "language": [
        "C++"
    ],
    "lastUpdate": "2024-01-02T17:23:18.934629Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/thomas-buechler-ulm/gedmap#data"
        }
    ],
    "name": "GED-MAP",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAD320",
            "metadata": {
                "abstract": "Motivation: A pangenome represents many diverse genome sequences of the same species. In order to cope with small variations as well as structural variations, recent research focused on the development of graph-based models of pangenomes. Mapping is the process of finding the original location of a DNA read in a reference sequence, typically a genome. Using a pangenome instead of a (linear) reference genome can, e.g. reduce mapping bias, the tendency to incorrectly map sequences that differ from the reference genome. Mapping reads to a graph, however, is more complex and needs more resources than mapping to a reference genome. Reducing the complexity of the graph by encoding simple variations like SNPs in a simple way can accelerate read mapping and reduce the memory requirements at the same time. Results: We introduce graphs based on elastic-degenerate strings (ED strings, EDS) and the linearized form of these EDS graphs as a new representation for pangenomes. In this representation, small variations are encoded directly in the sequence. Structural variations are encoded in a graph structure. This reduces the size of the representation in comparison to sequence graphs. In the linearized form, mapping techniques that are known from ordinary strings can be applied with appropriate adjustments. Since most variations are expressed directly in the sequence, the mapping process rarely has to take edges of the EDS graph into account. We developed a prototypical software tool GED-MAP that uses this representation together with a minimizer index to map short reads to the pangenome. Our experiments show that the new method works on a whole human genome scale, taking structural variants properly into account. The advantage of GED-MAP, compared with other pangenomic short read mappers, is that the new representation allows for a simple indexing method. This makes GED-MAP fast and memory efficient.",
                "authors": [
                    {
                        "name": "Buchler T."
                    },
                    {
                        "name": "Ohlebusch E."
                    },
                    {
                        "name": "Olbrich J."
                    }
                ],
                "citationCount": 2,
                "date": "2023-05-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Efficient short read mapping to a pangenome that is represented by a graph of ED strings"
            },
            "pmcid": "PMC10232250",
            "pmid": "37171844"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "RNA immunoprecipitation",
            "uri": "http://edamontology.org/topic_3794"
        },
        {
            "term": "Structural variation",
            "uri": "http://edamontology.org/topic_3175"
        }
    ]
}
