{
    "additionDate": "2017-08-03T18:36:51Z",
    "biotoolsCURIE": "biotools:bew",
    "biotoolsID": "bew",
    "credit": [
        {
            "email": "analia@uvigo.es",
            "name": "Anália García Lourenço",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://sing.ei.uvigo.es/"
        }
    ],
    "description": "Novel software workbench for the operation and analysis of Biofilms experimental data.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://sing.ei.uvigo.es/bew/tutorial.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Analysis",
                    "uri": "http://edamontology.org/operation_2945"
                }
            ]
        }
    ],
    "homepage": "http://sing.ei.uvigo.es/bew",
    "lastUpdate": "2018-12-10T12:58:43Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/bew-biofilms-experiment-workbench.html"
        }
    ],
    "name": "BEW",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "© 2015 Elsevier Ireland Ltd.Background and objective: Biofilms are receiving increasing attention from the biomedical community. Biofilm-like growth within human body is considered one of the key microbial strategies to augment resistance and persistence during infectious processes. The Biofilms Experiment Workbench is a novel software workbench for the operation and analysis of biofilms experimental data. The goal is to promote the interchange and comparison of data among laboratories, providing systematic, harmonised and large-scale data computation. Methods: The workbench was developed with AIBench, an open-source Java desktop application framework for scientific software development in the domain of translational biomedicine. Implementation favours free and open-source third-parties, such as the R statistical package, and reaches for the Web services of the BiofOmics database to enable public experiment deposition. Results: First, we summarise the novel, free, open, XML-based interchange format for encoding biofilms experimental data. Then, we describe the execution of common scenarios of operation with the new workbench, such as the creation of new experiments, the importation of data from Excel spreadsheets, the computation of analytical results, the on-demand and highly customised construction of Web publishable reports, and the comparison of results between laboratories. Conclusions: A considerable and varied amount of biofilms data is being generated, and there is a critical need to develop bioinformatics tools that expedite the interchange and comparison of microbiological and clinical results among laboratories. We propose a simple, open-source software infrastructure which is effective, extensible and easy to understand. The workbench is freely available for non-commercial use at http://sing.ei.uvigo.es/bew under LGPL license.",
                "authors": [
                    {
                        "name": "Perez-Rodriguez G."
                    },
                    {
                        "name": "Glez-Pena D."
                    },
                    {
                        "name": "Azevedo N.F."
                    },
                    {
                        "name": "Pereira M.O."
                    },
                    {
                        "name": "Fdez-Riverola F."
                    },
                    {
                        "name": "Lourenco A."
                    }
                ],
                "citationCount": 5,
                "date": "2015-03-01T00:00:00Z",
                "journal": "Computer Methods and Programs in Biomedicine",
                "title": "Enabling systematic, harmonised and large-scale biofilms data computation: The biofilms experiment workbench"
            },
            "pmid": "25600941"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Microbiology",
            "uri": "http://edamontology.org/topic_3301"
        },
        {
            "term": "Experimental design and studies",
            "uri": "http://edamontology.org/topic_3678"
        },
        {
            "term": "Biotechnology",
            "uri": "http://edamontology.org/topic_3297"
        }
    ],
    "validated": 1
}