{
    "additionDate": "2021-11-11T19:14:59.774771Z",
    "biotoolsCURIE": "biotools:inferbert",
    "biotoolsID": "inferbert",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "Zhichao.Liu@fda.hhs.gov",
            "name": "Zhichao Liu",
            "typeEntity": "Person"
        },
        {
            "email": "xwxu@ualr.edu",
            "name": "Xiaowei Xu",
            "typeEntity": "Person"
        }
    ],
    "description": "A Transformer-Based Causal Inference Framework for Enhancing Pharmacovigilance.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                },
                {
                    "term": "Named-entity and concept recognition",
                    "uri": "http://edamontology.org/operation_3280"
                },
                {
                    "term": "Splitting",
                    "uri": "http://edamontology.org/operation_3359"
                }
            ]
        }
    ],
    "homepage": "https://github.com/XingqiaoWang/DeepCausalPV-master",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-11-11T19:14:59.777304Z",
    "license": "Apache-2.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/google-research/bert"
        }
    ],
    "name": "InferBERT",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.3389/FRAI.2021.659622",
            "metadata": {
                "abstract": "© Copyright © 2021 Wang, Xu, Tong, Roberts and Liu.Background: T ransformer-based language models have delivered clear improvements in a wide range of natural language processing (NLP) tasks. However, those models have a significant limitation; specifically, they cannot infer causality, a prerequisite for deployment in pharmacovigilance, and health care. Therefore, these transformer-based language models should be developed to infer causality to address the key question of the cause of a clinical outcome. Results: In this study, we propose an innovative causal inference model–InferBERT, by integrating the A Lite Bidirectional Encoder Representations from Transformers (ALBERT) and Judea Pearl’s Do-calculus to establish potential causality in pharmacovigilance. Two FDA Adverse Event Reporting System case studies, including Analgesics-related acute liver failure and Tramadol-related mortalities, were employed to evaluate the proposed InferBERT model. The InferBERT model yielded accuracies of 0.78 and 0.95 for identifying Analgesics-related acute liver failure and Tramadol-related death cases, respectively. Meanwhile, the inferred causes of the two clinical outcomes, (i.e. acute liver failure and death) were highly consistent with clinical knowledge. Furthermore, inferred causes were organized into a causal tree using the proposed recursive do-calculus algorithm to improve the model’s understanding of causality. Moreover, the high reproducibility of the proposed InferBERT model was demonstrated by a robustness assessment. Conclusion: The empirical results demonstrated that the proposed InferBERT approach is able to both predict clinical events and to infer their causes. Overall, the proposed InferBERT model is a promising approach to establish causal effects behind text-based observational data to enhance our understanding of intrinsic causality. Availability and implementation: The InferBERT model and preprocessed FAERS data sets are available on GitHub at https://github.com/XingqiaoWang/DeepCausalPV-master.",
                "authors": [
                    {
                        "name": "Liu Z."
                    },
                    {
                        "name": "Roberts R."
                    },
                    {
                        "name": "Tong W."
                    },
                    {
                        "name": "Wang X."
                    },
                    {
                        "name": "Xu X."
                    }
                ],
                "date": "2021-05-26T00:00:00Z",
                "journal": "Frontiers in Artificial Intelligence",
                "title": "InferBERT: A Transformer-Based Causal Inference Framework for Enhancing Pharmacovigilance"
            },
            "pmcid": "PMC8202286",
            "pmid": "34136800"
        }
    ],
    "toolType": [
        "Workbench"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Natural language processing",
            "uri": "http://edamontology.org/topic_0218"
        },
        {
            "term": "Pharmacovigilance",
            "uri": "http://edamontology.org/topic_3378"
        },
        {
            "term": "Preclinical and clinical studies",
            "uri": "http://edamontology.org/topic_3379"
        },
        {
            "term": "Toxicology",
            "uri": "http://edamontology.org/topic_2840"
        }
    ]
}
