{
    "additionDate": "2019-08-09T13:20:41Z",
    "biotoolsCURIE": "biotools:Nomogram_Prognostic_Model",
    "biotoolsID": "Nomogram_Prognostic_Model",
    "credit": [
        {
            "email": "Yang.Xie@UTSouthwestern.edu",
            "name": "Yang Xie",
            "typeEntity": "Person"
        }
    ],
    "description": "Online tool to predict the survival rate in non-small cell lung cancer patients.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Imputation",
                    "uri": "http://edamontology.org/operation_3557"
                }
            ]
        }
    ],
    "homepage": "http://lce.biohpc.swmed.edu/lungcancer/nomogram",
    "lastUpdate": "2019-10-31T12:00:30Z",
    "name": "Nomogram Prognostic Model",
    "owner": "hans",
    "publication": [
        {
            "doi": "10.1177/1176935119837547",
            "metadata": {
                "abstract": "© The Author(s) 2019.Importance: Nomogram prognostic models can facilitate cancer patient treatment plans and patient enrollment in clinical trials. Objective: The primary objective is to provide an updated and accurate prognostic model for predicting the survival of advanced non-small-cell lung cancer (NSCLC) patients, and the secondary objective is to validate a published nomogram prognostic model for NSCLC using an independent patient cohort. Design: 1817 patients with advanced NSCLC from the control arms of 4 Phase III randomized clinical trials were included in this study. Data from 524 NSCLC patients from one of these trials were used to validate a previously published nomogram and then used to develop an updated nomogram. Patients from the other 3 trials were used as independent validation cohorts of the new nomogram. The prognostic performances were comprehensively evaluated using hazard ratios, integrated area under the curve (AUC), concordance index, and calibration plots. Setting: General community. Main outcome: A nomogram model was developed to predict overall survival in NSCLC patients. Results: We demonstrated the prognostic power of the previously published model in an independent cohort. The updated prognostic model contains the following variables: sex, histology, performance status, liver metastasis, hemoglobin level, white blood cell counts, peritoneal metastasis, skin metastasis, and lymphocyte percentage. This model was validated using various evaluation criteria on the 3 independent cohorts with heterogeneous NSCLC populations. In the SUN1087 patient cohort, the continuous risk score output by the nomogram achieved an integrated area under the receiver operating characteristics (ROC) curve of 0.83, a log-rank P-value of 3.87e−11, and a concordance index of 0.717. In the SAVEONCO patient cohort, the integrated area under the ROC curve was 0.755, the log-rank P-value was 4.94e−6 and the concordance index was 0.678. In the VITAL patient cohort, the integrated area under the ROC curve was 0.723, the log-rank P-value was 1.36e−11, and the concordance index was 0.654. We implemented the proposed nomogram and several previously published prognostic models on an online Web server for easy user access. Conclusions: This nomogram model based on basic clinical features and routine lab testing predicts individual survival probabilities for advanced NSCLC and exhibits cross-study robustness.",
                "authors": [
                    {
                        "name": "Wang T."
                    },
                    {
                        "name": "Lu R."
                    },
                    {
                        "name": "Lai S."
                    },
                    {
                        "name": "Schiller J.H."
                    },
                    {
                        "name": "Zhou F.L."
                    },
                    {
                        "name": "Ci B."
                    },
                    {
                        "name": "Wang S."
                    },
                    {
                        "name": "Gao X."
                    },
                    {
                        "name": "Yao B."
                    },
                    {
                        "name": "Gerber D.E."
                    },
                    {
                        "name": "Johnson D.H."
                    },
                    {
                        "name": "Xiao G."
                    },
                    {
                        "name": "Xie Y."
                    }
                ],
                "citationCount": 3,
                "date": "2019-04-01T00:00:00Z",
                "journal": "Cancer Informatics",
                "title": "Development and Validation of a Nomogram Prognostic Model for Patients With Advanced Non-Small-Cell Lung Cancer"
            },
            "pmcid": "PMC6452590",
            "pmid": "31057324"
        }
    ],
    "topic": [
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Preclinical and clinical studies",
            "uri": "http://edamontology.org/topic_3379"
        },
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        }
    ]
}