{
    "additionDate": "2017-01-17T15:01:54Z",
    "biotoolsCURIE": "biotools:anota",
    "biotoolsID": "anota",
    "collectionID": [
        "BioConductor"
    ],
    "credit": [
        {
            "email": "ola.larsson@ki.se",
            "name": "Ola Larsson",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "This package allows for genome wide studies of translational control using partial variances and the random variance model, identifying differences in actively translated mRNA levels that are independent of underlying differences in cytosolic mRNA levels.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://bioconductor.org/packages/release/bioc/html/anota.html"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://bioconductor/packages/release/bioc/src/contrib/anota_1.22.0.tar.gz"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                }
            ]
        }
    ],
    "homepage": "http://bioconductor.org/packages/release/bioc/html/anota.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-10T12:58:54Z",
    "license": "GPL-3.0",
    "name": "anota",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "bioconductor_import",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btr146",
            "metadata": {
                "abstract": "Summary: Translational control of gene expression has emerged as a major mechanism that regulates many biological processes and shows dysregulation in human diseases including cancer. When studying differential translation, levels of both actively translating mRNAs and total cytosolic mRNAs are obtained where the latter is used to correct for a possible contribution of differential cytosolic mRNA levels to the observed differential levels of actively translated mRNAs. We have recently shown that analysis of partial variance (APV) corrects for cytosolic mRNA levels more effectively than the commonly applied log ratio approach. APV provides a high degree of specificity and sensitivity for detecting biologically meaningful translation changes, especially when combined with a variance shrinkage method for estimating random error. Here we describe the anota (analysis of translational activity) R-package which implements APV, allows scrutiny of associated statistical assumptions and provides biologically motivated filters for analysis of genome wide datasets. Although the package was developed for analysis of differential translation in polysome microarray or ribosome-profiling datasets, any high-dimensional data that result in paired controls, such as RNP immunoprecipitation-microarray (RIP-CHIP) datasets, can be successfully analyzed with anota. © The Author 2011. Published by Oxford University Press. All rights reserved.",
                "authors": [
                    {
                        "name": "Larsson O."
                    },
                    {
                        "name": "Sonenberg N."
                    },
                    {
                        "name": "Nadon R."
                    }
                ],
                "citationCount": 35,
                "date": "2011-05-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "anota: Analysis of differential translation in genome-wide studies"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool",
        "Library"
    ],
    "topic": [
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        }
    ],
    "validated": 1,
    "version": [
        "1.22.0"
    ]
}