{
    "accessibility": "Open access",
    "additionDate": "2023-03-17T09:10:33.478894Z",
    "biotoolsCURIE": "biotools:torchdiva",
    "biotoolsID": "torchdiva",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "skinahan@asu.edu",
            "name": "Sean P. Kinahan",
            "orcidid": "https://orcid.org/0000-0002-2369-4063",
            "typeEntity": "Person"
        },
        {
            "name": "Julie M Liss"
        },
        {
            "name": "Visar Berisha"
        }
    ],
    "description": "An extensible computational model of speech production built on an open-source machine learning library.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Modelling and simulation",
                    "uri": "http://edamontology.org/operation_2426"
                },
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                },
                {
                    "term": "Validation",
                    "uri": "http://edamontology.org/operation_2428"
                }
            ]
        }
    ],
    "homepage": "https://github.com/skinahan/DIVA_PyTorch",
    "language": [
        "MATLAB",
        "Python"
    ],
    "lastUpdate": "2024-11-24T14:55:00.153324Z",
    "license": "Not licensed",
    "name": "TorchDIVA",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1371/journal.pone.0281306",
            "metadata": {
                "abstract": "The DIVA model is a computational model of speech motor control that combines a simulation of the brain regions responsible for speech production with a model of the human vocal tract. The model is currently implemented in Matlab Simulink; however, this is less than ideal as most of the development in speech technology research is done in Python. This means there is a wealth of machine learning tools which are freely available in the Python ecosystem that cannot be easily integrated with DIVA. We present TorchDIVA, a full rebuild of DIVA in Python using PyTorch tensors. DIVA source code was directly translated from Matlab to Python, and built-in Simulink signal blocks were implemented from scratch. After implementation, the accuracy of each module was evaluated via systematic block-by-block validation. The TorchDIVA model is shown to produce outputs that closely match those of the original DIVA model, with a negligible difference between the two. We additionally present an example of the extensibility of TorchDIVA as a research platform. Speech quality enhancement in TorchDIVA is achieved through an integration with an existing PyTorch generative vocoder called DiffWave. A modified DiffWave mel-spectrum upsampler was trained on human speech waveforms and conditioned on the TorchDIVA speech production. The results indicate improved speech quality metrics in the DiffWave-enhanced output as compared to the baseline. This enhancement would have been difficult or impossible to accomplish in the original Matlab implementation. This proof-of-concept demonstrates the value TorchDIVA can bring to the research community. Researchers can download the new implementation at: https://github.com/skinahan/DIVA_PyTorch.",
                "authors": [
                    {
                        "name": "Berisha V."
                    },
                    {
                        "name": "Kinahan S.P."
                    },
                    {
                        "name": "Liss J.M."
                    }
                ],
                "citationCount": 2,
                "date": "2023-02-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "TorchDIVA: An extensible computational model of speech production built on an open-source machine learning library"
            },
            "pmcid": "PMC9937462",
            "pmid": "36800358"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Human biology",
            "uri": "http://edamontology.org/topic_2815"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Neurobiology",
            "uri": "http://edamontology.org/topic_3304"
        }
    ]
}
