{
    "additionDate": "2018-07-30T11:00:34Z",
    "biotoolsCURIE": "biotools:slimsearch",
    "biotoolsID": "slimsearch",
    "collectionID": [
        "Proteomics"
    ],
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://slim.ucd.ie/slimsearch/index.php?page=contact"
        }
    ],
    "description": "Short Linear Motifs Search. Proteome-wide discovery and annotation of functional modules in intrinsically disordered regions. Scans a motif consensus, representing the specificity determinants of a motif-binding domain, against a proteome to discover putative novel motif instances. It applies several distinct and complementary approaches exploiting the common properties of SLiMs to predict novel motifs.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://slim.ucd.ie/slimsearch/index.php?page=help"
        }
    ],
    "editPermission": {
        "authors": [
            "proteomics.bio.tools"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence motif discovery",
                    "uri": "http://edamontology.org/operation_0238"
                },
                {
                    "term": "Sequence motif recognition",
                    "uri": "http://edamontology.org/operation_0239"
                },
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                }
            ]
        }
    ],
    "homepage": "http://slim.ucd.ie/slimsearch/",
    "lastUpdate": "2019-07-01T18:08:48Z",
    "name": "SLiMSearch 4",
    "owner": "normandavey",
    "publication": [
        {
            "doi": "10.1093/NAR/GKX238",
            "metadata": {
                "abstract": "© The Author(s) 2017. Published by Oxford University Press on behalf of Nucleic Acids Research.The extensive intrinsically disordered regions of higher eukaryotic proteomes contain vast numbers of functional interaction modules known as short linear motifs (SLiMs). Here, we present SLiMSearch, a motif discovery tool that scans a motif consensus, representing the specificity determinants of a motif-binding domain, against a proteome to discover putative novel motif instances. SLiMSearch applies several distinct and complementary approaches exploiting the common properties of SLiMs to predict novel motifs. Consensus matches are annotated with overlapping sequence annotation, including feature information describing protein modular architecture, post-translational modification, structure, sequence variation and experimental characterisation of functional regions. Discriminatory motif attributes such as conservation and accessibility are also calculated. In addition, SLiMSearch provides functional enrichment and evolutionary analysis tools. The enrichment tool analyses GO terms, keywords and interacting partner enrichment to indicate possible motif function. The evolutionary tool evaluates motif taxonomic range and the conservation of motif sequence context. Consensus matches can be filtered based on motif attributes such as accessibility and taxonomic range; or by the localisation, interacting partners or ontology annotation of the peptide-containing protein.",
                "authors": [
                    {
                        "name": "Krystkowiak I."
                    },
                    {
                        "name": "Davey N.E."
                    }
                ],
                "citationCount": 35,
                "date": "2017-07-03T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "SLiMSearch: A framework for proteome-wide discovery and annotation of functional modules in intrinsically disordered regions"
            },
            "pmcid": "PMC5570202",
            "pmid": "28387819",
            "type": [
                "Primary"
            ]
        },
        {
            "doi": "10.1093/nar/gkr402",
            "metadata": {
                "abstract": "Short, linear motifs (SLiMs) play a critical role in many biological processes. The SLiMSearch 2.0 (Short, Linear Motif Search) web server allows researchers to identify occurrences of a user-defined SLiM in a proteome, using conservation and protein disorder context statistics to rank occurrences. User-friendly output and visualizations of motif context allow the user to quickly gain insight into the validity of a putatively functional motif occurrence. For each motif occurrence, overlapping UniProt features and annotated SLiMs are displayed. Visualization also includes annotated multiple sequence alignments surrounding each occurrence, showing conservation and protein disorder statistics in addition to known and predicted SLiMs, protein domains and known post-translational modifications. In addition, enrichment of Gene Ontology terms and protein interaction partners are provided as indicators of possible motif function. All web server results are available for download. Users can search motifs against the human proteome or a subset thereof defined by Uniprot accession numbers or GO term. The SLiMSearch server is available at: http://bioware.ucd.ie/slimsearch2.html. © 2011 The Author(s).",
                "authors": [
                    {
                        "name": "Davey N.E."
                    },
                    {
                        "name": "Haslam N.J."
                    },
                    {
                        "name": "Shields D.C."
                    },
                    {
                        "name": "Edwards R.J."
                    }
                ],
                "citationCount": 57,
                "date": "2011-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "SLiMSearch 2.0: Biological context for short linear motifs in proteins"
            },
            "pmid": "21622654",
            "type": [
                "Primary"
            ],
            "version": "2"
        }
    ],
    "toolType": [
        "Web application",
        "Suite"
    ],
    "topic": [
        {
            "term": "Protein structural motifs and surfaces",
            "uri": "http://edamontology.org/topic_0166"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Protein modifications",
            "uri": "http://edamontology.org/topic_0601"
        }
    ],
    "validated": 1
}