{
    "additionDate": "2020-01-14T08:51:04Z",
    "biotoolsCURIE": "biotools:pTuneos",
    "biotoolsID": "pTuneos",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "qiliu@tongji.edu.cn",
            "name": "Qi Liu",
            "orcidid": "https://orcid.org/0000-0003-2578-1221",
            "typeEntity": "Person"
        }
    ],
    "description": "prioritizing tumor neoantigens from next-generation sequencing data.\n\npTuneos: prioritizing Tumor neoantigen from next-generation sequencing data.\n\npTuneos is the state-of-the-art computational pipeline for identifying personalized tumor neoantigens from next-generation sequencing data. With raw whole-exome sequencing data and/or RNA-seq data, pTuneos calculates five important immunogenicity features to construct a machine learning-based classifier (Pre&RecNeo) to predict and prioritize neoantigens recognized by T cell, followed by an efficient score scheme (RefinedNeo) to ealuate naturally processed, MHC presented and T cell recognized probability of a predicted neoepitope",
    "download": [
        {
            "type": "Container file",
            "url": "https://cloud.docker.com/u/bm2lab/repository/docker/bm2lab/pTuneos"
        },
        {
            "type": "Container file",
            "url": "https://cloud.docker.com/u/bm2lab/repository/docker/bm2lab/ptuneos"
        }
    ],
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Peptide immunogenicity prediction",
                    "uri": "http://edamontology.org/operation_0252"
                },
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                },
                {
                    "term": "Variant prioritisation",
                    "uri": "http://edamontology.org/operation_3226"
                }
            ]
        }
    ],
    "homepage": "https://github.com/bm2-lab/pTuneos",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-12-10T12:16:21Z",
    "license": "MIT",
    "name": "pTuneos",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S13073-019-0679-X",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Cancer neoantigens are expressed only in cancer cells and presented on the tumor cell surface in complex with major histocompatibility complex (MHC) class I proteins for recognition by cytotoxic T cells. Accurate and rapid identification of neoantigens play a pivotal role in cancer immunotherapy. Although several in silico tools for neoantigen prediction have been presented, limitations of these tools exist. Results: We developed pTuneos, a computational pipeline for prioritizing tumor neoantigens from next-generation sequencing data. We tested the performance of pTuneos on the melanoma cancer vaccine cohort data and tumor-infiltrating lymphocyte (TIL)-recognized neopeptide data. pTuneos is able to predict the MHC presentation and T cell recognition ability of the candidate neoantigens, and the actual immunogenicity of single-nucleotide variant (SNV)-based neopeptides considering their natural processing and presentation, surpassing the existing tools with a comprehensive and quantitative benchmark of their neoantigen prioritization performance and running time. pTuneos was further tested on The Cancer Genome Atlas (TCGA) cohort data as well as the melanoma and non-small cell lung cancer (NSCLC) cohort data undergoing checkpoint blockade immunotherapy. The overall neoantigen immunogenicity score proposed by pTuneos is demonstrated to be a powerful and pan-cancer marker for survival prediction compared to traditional well-established biomarkers. Conclusions: In summary, pTuneos provides the state-of-the-art one-stop and user-friendly solution for prioritizing SNV-based candidate neoepitopes, which could help to advance research on next-generation cancer immunotherapies and personalized cancer vaccines. pTuneos is available at https://github.com/bm2-lab/pTuneos, with a Docker version for quick deployment at https://cloud.docker.com/u/bm2lab/repository/docker/bm2lab/ptuneos.",
                "authors": [
                    {
                        "name": "Chen K."
                    },
                    {
                        "name": "Chuai G."
                    },
                    {
                        "name": "Gao Y."
                    },
                    {
                        "name": "Liu Q."
                    },
                    {
                        "name": "Qu S."
                    },
                    {
                        "name": "Wei Z."
                    },
                    {
                        "name": "Xie L."
                    },
                    {
                        "name": "Zhang B."
                    },
                    {
                        "name": "Zhang Z."
                    },
                    {
                        "name": "Zhou C."
                    },
                    {
                        "name": "Zhu C."
                    }
                ],
                "citationCount": 8,
                "date": "2019-10-30T00:00:00Z",
                "journal": "Genome Medicine",
                "title": "PTuneos: Prioritizing tumor neoantigens from next-generation sequencing data"
            },
            "pmcid": "PMC6822339",
            "pmid": "31666118"
        }
    ],
    "topic": [
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Exome sequencing",
            "uri": "http://edamontology.org/topic_3676"
        },
        {
            "term": "Immunoproteins and antigens",
            "uri": "http://edamontology.org/topic_2830"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ],
    "validated": 1
}
