{
    "additionDate": "2020-01-14T08:54:28Z",
    "biotoolsCURIE": "biotools:WheatCRISPR",
    "biotoolsID": "WheatCRISPR",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "Sateesh.Kagale@nrc-cnrc.gc.ca",
            "name": "Sateesh Kagale",
            "orcidid": "https://orcid.org/0000-0002-7213-1590",
            "typeEntity": "Person"
        }
    ],
    "description": "a web-based guide RNA design tool for CRISPR/Cas9-mediated genome editing in wheat.\n\nBACKGROUND:CRISPR Cas9 gene editing has become a revolutionary technique for crop improvement as it can facilitate fast and efficient genetic changes without the retention of transgene components in the final plant line. Lack of robust bioinformatics tools to facilitate the design of highly specific functional guide RNAs (gRNAs) and prediction of off-target sites in wheat is currently an obstacle to effective application of CRISPR technology to wheat improvement. DESCRIPTION:We have developed a web-based bioinformatics tool to design specific gRNAs for genome editing and transcriptional regulation of gene expression in wheat",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Editing",
                    "uri": "http://edamontology.org/operation_3096"
                },
                {
                    "term": "Promoter prediction",
                    "uri": "http://edamontology.org/operation_0440"
                }
            ]
        }
    ],
    "homepage": "https://crispr.bioinfo.nrc.ca/WheatCrispr/",
    "lastUpdate": "2021-01-03T16:29:07Z",
    "name": "WheatCRISPR",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12870-019-2097-Z",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: CRISPR/Cas9 gene editing has become a revolutionary technique for crop improvement as it can facilitate fast and efficient genetic changes without the retention of transgene components in the final plant line. Lack of robust bioinformatics tools to facilitate the design of highly specific functional guide RNAs (gRNAs) and prediction of off-target sites in wheat is currently an obstacle to effective application of CRISPR technology to wheat improvement. Description: We have developed a web-based bioinformatics tool to design specific gRNAs for genome editing and transcriptional regulation of gene expression in wheat. A collaborative study between the Broad Institute and Microsoft Research used large-scale empirical evidence to devise algorithms (Doech et al., 2016, Nature Biotechnology 34, 184-191) for predicting the on-target activity and off-target potential of CRISPR/SpCas9 (Streptococcus pyogenes Cas9). We applied these prediction models to determine on-target specificity and potential off-target activity for individual gRNAs targeting specific loci in the wheat genome. The genome-wide gRNA mappings and the corresponding Doench scores predictive of the on-target and off-target activities were used to create a gRNA database which was used as a data source for the web application termed WheatCRISPR. Conclusion: The WheatCRISPR tool allows researchers to browse all possible gRNAs targeting a gene or sequence of interest and select effective gRNAs based on their predicted high on-target and low off-target activity scores, as well as other characteristics such as position within the targeted gene. It is publicly available at https://crispr.bioinfo.nrc.ca/WheatCrispr/.",
                "authors": [
                    {
                        "name": "Bhowmik P."
                    },
                    {
                        "name": "Buchwaldt M."
                    },
                    {
                        "name": "Cram D."
                    },
                    {
                        "name": "Kagale S."
                    },
                    {
                        "name": "Kulkarni M."
                    },
                    {
                        "name": "Parkin I.A.P."
                    },
                    {
                        "name": "Rajagopalan N."
                    },
                    {
                        "name": "Rozwadowski K."
                    },
                    {
                        "name": "Sharpe A.G."
                    }
                ],
                "citationCount": 5,
                "date": "2019-11-06T00:00:00Z",
                "journal": "BMC Plant Biology",
                "title": "WheatCRISPR: A web-based guide RNA design tool for CRISPR/Cas9-mediated genome editing in wheat"
            },
            "pmcid": "PMC6836449",
            "pmid": "31694550"
        }
    ],
    "topic": [
        {
            "term": "Agricultural science",
            "uri": "http://edamontology.org/topic_3810"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Genetic engineering",
            "uri": "http://edamontology.org/topic_3912"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        }
    ],
    "validated": 1
}
