{
    "additionDate": "2022-10-28T05:51:07.301295Z",
    "biotoolsCURIE": "biotools:brwcp",
    "biotoolsID": "brwcp",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "lyfinf@163.com",
            "name": "Jin-Mao Wei",
            "typeEntity": "Person"
        },
        {
            "email": "weijm@nankai.edu.cn",
            "name": "Jian Liu",
            "typeEntity": "Person"
        }
    ],
    "description": "Drug-Protein Interaction Prediction by Correcting the Effect of Incomplete Information in Heterogeneous Information.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein fragment weight comparison",
                    "uri": "http://edamontology.org/operation_2929"
                },
                {
                    "term": "Protein interaction network prediction",
                    "uri": "http://edamontology.org/operation_3094"
                }
            ]
        }
    ],
    "homepage": "https://github.com/lyfdomain/BRWCP",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T15:25:53.236710Z",
    "license": "Not licensed",
    "name": "BRWCP",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btac629",
            "metadata": {
                "abstract": "Motivation: Large-scale heterogeneous data provide diverse perspectives for predicting drug–protein interactions (DPIs). However, the available information on molecular interactions and clinical associations related to drugs or proteins is incomplete because there may be unproven interactions and associations. This incomplete information in the available data is presented in the form of non-interaction and non-correlation, which may mislead the prediction model. Existing methods fuse incomplete and complete information without considering their integrity, so the negative effects of incomplete information still exist. Results: We develop a network-based DPI prediction method named BRWCP, which uses the complete information network to correct the prediction results acquired by the incomplete information network. By integrating relevant heterogeneous information that may be incomplete, the feature similarities of drugs and proteins are obtained. Combining the feature similarities and known DPIs, an incomplete information-based drug–protein heterogeneous network is constructed. Then, a bidirectional random walk with pruning algorithm is adopted in this heterogeneous network to predict potential DPIs. Next, the predicted DPIs are combined with the chemical fingerprint similarity of drugs and amino acid sequence similarity of proteins to construct the complete information network. The bidirectional random walk with pruning algorithm is applied in the new network to obtain the final prediction results until it converges. Experimental results show that BRWCP is superior to several state-of-the-art DPI prediction methods, and case studies further confirm its ability to tap potential DPIs.",
                "authors": [
                    {
                        "name": "Li Y."
                    },
                    {
                        "name": "Liu J."
                    },
                    {
                        "name": "Sun C."
                    },
                    {
                        "name": "Wei J.-M."
                    }
                ],
                "citationCount": 9,
                "date": "2022-11-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Drug–Protein interaction prediction by correcting the effect of incomplete information in heterogeneous information"
            },
            "pmid": "36111859"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ],
    "validated": 1
}
