{
    "additionDate": "2019-11-14T18:20:55Z",
    "biotoolsCURIE": "biotools:PsiZ",
    "biotoolsID": "PsiZ",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "brett.roads@colorado.edu",
            "name": "Brett D. Roads",
            "typeEntity": "Person"
        }
    ],
    "description": "Obtaining psychological embeddings through joint kernel and metric learning | A python package for inferring psychological embeddings | PsiZ: A Psychological Embedding Package | Experiments using the PsiZ package published in Behavior Research Methods | PsiZ provides the computational tools to infer a continuous, multivariate stimulus representation using ordinal similarity relations. It integrates well-established cognitive theory with contemporary computational methods. The companion Open Access article is available at https://link.springer.com/article/10.3758/s13428-019-01285-3 | You will need a Python interpretter (>= 3.6) along with the an installation of the psiz package (version 0.1.0) in your preferred environment. You can install the correct version of the psiz package using pip: pip install psiz==0.1.0. You can also find version 0.1.0 on GitHub: https://github.com/roads/psiz/archive/v0.1.0.tar.gz",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://github.com/roads/psiz",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-12-10T11:23:58Z",
    "license": "Apache-2.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/roads/psiz-brm"
        }
    ],
    "name": "PsiZ",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.3758/S13428-019-01285-3",
            "metadata": {
                "abstract": "© 2019, The Author(s).Psychological embeddings provide a powerful formalism for characterizing human-perceived similarity among members of a stimulus set. Obtaining high-quality embeddings can be costly due to algorithm design, software deployment, and participant compensation. This work aims to advance state-of-the-art embedding techniques and provide a comprehensive software package that makes obtaining high-quality psychological embeddings both easy and relatively efficient. Contributions are made on four fronts. First, the embedding procedure allows multiple trial configurations (e.g., triplets) to be used for collecting similarity judgments from participants. For example, trials can be configured to collect triplet comparisons or to sort items into groups. Second, a likelihood model is provided for three classes of similarity kernels allowing users to easily infer the parameters of their preferred model using gradient descent. Third, an active selection algorithm is provided that makes data collection more efficient by proposing comparisons that provide the strongest constraints on the embedding. Fourth, the likelihood model allows the specification of group-specific attention weight parameters. A series of experiments are included to highlight each of these contributions and their impact on converging to a high-quality embedding. Collectively, these incremental improvements provide a powerful and complete set of tools for inferring psychological embeddings. The relevant tools are available as the Python package PsiZ, which can be cloned from GitHub (https://github.com/roads/psiz).",
                "authors": [
                    {
                        "name": "Roads B.D."
                    },
                    {
                        "name": "Mozer M.C."
                    }
                ],
                "citationCount": 4,
                "date": "2019-10-01T00:00:00Z",
                "journal": "Behavior Research Methods",
                "title": "Obtaining psychological embeddings through joint kernel and metric learning"
            },
            "pmcid": "PMC6797663",
            "pmid": "31432329"
        }
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        }
    ],
    "validated": 1
}