{"credit":[{"typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://www.imsb.ethz.ch/research/aebersold.html"},{"typeEntity":"Person","typeRoles":["Primary contact"],"url":"https://github.com/msproteomicstools"}],"documentation":[{"type":"GENERAL","url":"http://proteomics.ethz.ch/msproteomicstools/"},{"url":"https://github.com/msproteomicstools/msproteomicstools/blob/master/TRIC-README.md"}],"function":[{"operation":[{"term":"Sequence alignment","uri":"http://edamontology.org/operation_0292"}]}],"labels":{"collectionID":["Proteomics"],"language":["Python"],"operatingSystem":["Linux"],"toolType":["Command-line tool"],"topic":[{"term":"Proteomics","uri":"http://edamontology.org/topic_0121"},{"term":"Proteomics experiment","uri":"http://edamontology.org/topic_3520"},{"term":"Sequence analysis","uri":"http://edamontology.org/topic_0080"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/tric-alignment-tool-for-targeted-proteomics.html"}],"publication":[{"abstract":"© 2016 Nature America, Inc. All rights reserved. Next-generation mass spectrometric (MS) techniques such as SWATH-MS have substantially increased the throughput and reproducibility of proteomic analysis, but ensuring consistent quantification of thousands of peptide analytes across multiple liquid chromatography-tandem MS (LC-MS/MS) runs remains a challenging and laborious manual process. To produce highly consistent and quantitatively accurate proteomics data matrices in an automated fashion, we developed TRIC (http://proteomics.ethz.ch/tric/), a software tool that utilizes fragment-ion data to perform cross-run alignment, consistent peak-picking and quantification for high-throughput targeted proteomics. TRIC reduced the identification error compared to a state-of-the-art SWATH-MS analysis without alignment by more than threefold at constant recall while correcting for highly nonlinear chromatographic effects. On a pulsed-SILAC experiment performed on human induced pluripotent stem cells, TRIC was able to automatically align and quantify thousands of light and heavy isotopic peak groups. Thus, TRIC fills a gap in the pipeline for automated analysis of massively parallel targeted proteomics data sets.","authors":["Rost H.L.","Liu Y.","D'Agostino G.","Zanella M.","Navarro P.","Rosenberger G.","Collins B.C.","Gillet L.","Testa G.","Malmstrom L.","Aebersold R."],"cit_count":31,"journal":"Nature Methods","pmid":"27479329","title":"TRIC: An automated alignment strategy for reproducible protein quantification in targeted proteomics","year":"2016-08-30"}],"summary":{"biotoolsCURIE":"biotools:tric","biotoolsID":"tric","description":"An alignment software for targeted proteomics (SRM or SWATH-MS) data. It uses a graph-based alignment strategy based on non-linear retention time correction to integrate information from all available runs. The input consists of a set of csv files derived from a targeted proteomics experiment generated by OpenSWATH (using either mProphet or pyProphet) or generated by Peakview.","homepage":"http://proteomics.ethz.ch/tric/","name":"TRIC"}}