
{
    "credit": [
        {
            "email": "d.schomburg@tu-bs.de",
            "name": "Dr. Dietmar Schomburg",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "https://bibc.tu-bs.de/bioinf/?site=team"
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://mspecs.tu-bs.de/index.php?option=com_content&task=view&id=16&Itemid=42"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Spectral analysis",
                    "uri": "http://edamontology.org/operation_3214"
                }
            ]
        }
    ],
    "labels": {
        "collectionID": [
            "Proteomics"
        ],
        "operatingSystem": [
            "Windows"
        ],
        "toolType": [
            "Desktop application"
        ],
        "topic": [
            {
                "term": "Proteomics experiment",
                "uri": "http://edamontology.org/topic_3520"
            },
            {
                "term": "Metabolomics",
                "uri": "http://edamontology.org/topic_3172"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://www.mybiosoftware.com/mspecs-editor-1-01-tool-managing-mass-spectral-libraries.html"
        }
    ],
    "publication": [
        {
            "abstract": "Background: Metabolome analysis with GC/MS has meanwhile been established as one of the \"omics\" techniques. Compound identification is done by comparison of the MS data with compound libraries. Mass spectral libraries in the field of metabolomics ought to connect the relevant mass traces of the metabolites to other relevant data, e.g. formulas, chemical structures, identification numbers to other databases etc. Since existing solutions are either commercial and therefore only available for certain instruments or not capable of storing such information, there is need to provide a software tool for the management of such data. Results: Here we present mSpecs, an open source software tool to manage mass spectral data in the field of metabolomics. It provides editing of mass spectra and virtually any associated information, automatic calculation of formulas and masses and is extensible by scripts. The graphical user interface is capable of common techniques such as copy/ paste, undo/redo and drag and drop. It owns import and export filters for the major public file formats in order to provide compatibility to commercial instruments. Conclusion: mSpecs is a versatile tool for the management and editing of mass spectral libraries in the field of metabolomics. Beyond that it provides capabilities for the automatic management of libraries though its scripting functionality. mSpecs can be used on all major platforms and is licensed under the GNU General Public License and available at http://mspecs.tu-bs.de. © 2009 Thielen et al; licensee BioMed Central Ltd.",
            "authors": [
                "Thielen B.",
                "Heinen S.",
                "Schomburg D."
            ],
            "cit_count": 3,
            "journal": "BMC Bioinformatics",
            "pmid": "19624850",
            "title": "mSpecs: A software tool for the administration and editing of mass spectral libraries in the field of metabolomics",
            "year": "2009-07-22"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:mspecs_editor",
        "biotoolsID": "mspecs_editor",
        "description": "Free tool for managing mass spectral libraries with an additional focus on gas chromatography / mass spectrometry, liquid chromatography / mass spectrometry and related techniques.",
        "homepage": "http://mspecs.tu-bs.de/",
        "name": "mSpecs Editor"
    }
}