{"collectionID": [], "accessibility": [], "topic": [{"term": "Proteins", "uri": "http://edamontology.org/topic_0078"}, {"term": "Protein folds and structural domains", "uri": "http://edamontology.org/topic_0736"}], "owner": "mbs_import", "cost": null, "relation": [], "download": [], "validated": 1, "publication": [{"doi": null, "note": null, "version": null, "pmid": "26411868", "type": null, "pmcid": null, "metadata": {"title": "MDD-SOH: Exploiting maximal dependence decomposition to identify S-sulfenylation sites with substrate motifs", "abstract": "© 2015 The Author 2015. Published by Oxford University Press. All rights reserved. S-sulfenylation (S-sulphenylation, or sulfenic acid), the covalent attachment of S-hydroxyl (-SOH) to cysteine thiol, plays a significant role in redox regulation of protein functions. Although sulfenic acid is transient and labile, most of its physiological activities occur under control of S-hydroxylation. Therefore, discriminating the substrate site of S-sulfenylated proteins is an essential task in computational biology for the furtherance of protein structures and functions. Research into S-sulfenylated protein is currently very limited, and no dedicated tools are available for the computational identification of SOH sites. Given a total of 1096 experimentally verified S-sulfenylated proteins from humans, this study carries out a bioinformatics investigation on SOH sites based on amino acid composition and solvent-accessible surface area. A TwoSampleLogo indicates that the positively and negatively charged amino acids flanking the SOH sites may impact the formulation of S-sulfenylation in closed three-dimensional environments. In addition, the substrate motifs of SOH sites are studied using the maximal dependence decomposition (MDD). Based on the concept of binary classification between SOH and non-SOH sites, Support vector machine (SVM) is applied to learn the predictive model from MDD-identified substrate motifs. According to the evaluation results of 5-fold cross-validation, the integrated SVM model learned from substrate motifs yields an average accuracy of 0.87, significantly improving the prediction of SOH sites. Furthermore, the integrated SVM model also effectively improves the predictive performance in an independent testing set. Finally, the integrated SVM model is applied to implement an effective web resource, named MDD-SOH, to identify SOH sites with their corresponding substrate motifs. Availability and implementation: The MDD-SOH is now freely available to all interested users at http://csb.cse.yzu.edu.tw/MDDSOH/. All of the data set used in this work is also available for download in the website. Supplementary information: Supplementary data are available at Bioinformatics online. Contact: francis@saturn.yzu.edu.tw.", "citationCount": 17, "authors": [{"name": "Bui V.-M."}, {"name": "Lu C.-T."}, {"name": "Ho T.-T."}, {"name": "Lee T.-Y."}], "date": "2015-07-22T00:00:00Z", "journal": "Bioinformatics"}}], "homepage_status": 0, "credit": [{"typeRole": ["Primary contact"], "name": null, "url": "http://csb.cse.yzu.edu.tw/", "gridid": null, "note": null, "orcidid": null, "typeEntity": "Person", "email": "francis@saturn.yzu.edu.tw"}], "biotoolsCURIE": "biotools:mdd-soh", "elixirPlatform": [], "elixirNode": [], "version": [], "elixir_badge": 0, "homepage": "http://csb.cse.yzu.edu.tw/MDDSOH/", "function": [{"note": null, "input": [], "operation": [{"term": "Protein sequence analysis", "uri": "http://edamontology.org/operation_2479"}, {"term": "Protein feature detection", "uri": "http://edamontology.org/operation_3092"}], "cmd": null, "output": []}], "lastUpdate": "2018-12-10T12:58:45Z", "otherID": [], "description": "Web server for identifying S-sulfenylation sites", "toolType": ["Web application"], "editPermission": {"type": "private", "authors": []}, "language": [], "link": [{"url": "http://www.mybiosoftware.com/mdd-soh-web-server-for-identifying-s-sulfenylation-sites.html", "note": null, "type": "Software catalogue"}], "biotoolsID": "mdd-soh", "additionDate": "2017-08-03T18:49:06Z", "name": "MDD-SOH", "license": null, "documentation": [{"url": "http://csb.cse.yzu.edu.tw/MDDSOH/introduction.php", "note": null, "type": "General"}], "maturity": null, "confidence_flag": null, "operatingSystem": ["Linux", "Windows", "Mac"]}