{
    "accessibility": [],
    "additionDate": "2018-07-31T14:18:39Z",
    "biotoolsCURIE": "biotools:decres",
    "biotoolsID": "decres",
    "collectionID": [],
    "confidence_flag": null,
    "cost": null,
    "credit": [
        {
            "email": "wyeth@cmmt.ubc.ca",
            "gridid": null,
            "name": "Wyeth W. WassermanEmail author",
            "note": null,
            "orcidid": null,
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": null
        }
    ],
    "description": "DEep learning for identifying Cis-Regulatory ElementS is an extension of the Deep Learning Tutorials developped by LISA lab (www.deeplearning.net/tutorial/). Although it is developped for the identification of CREs, it can also be used for other applications.",
    "documentation": [
        {
            "note": null,
            "type": "General",
            "url": "https://github.com/yifeng-li/DECRES/blob/master/README.txt"
        }
    ],
    "download": [],
    "editPermission": {
        "authors": [],
        "type": "private"
    },
    "elixirNode": [],
    "elixirPlatform": [],
    "elixir_badge": 0,
    "function": [
        {
            "cmd": null,
            "input": [],
            "note": null,
            "operation": [
                {
                    "term": "Annotation",
                    "uri": "http://edamontology.org/operation_0226"
                }
            ],
            "output": []
        }
    ],
    "homepage": "https://github.com/yifeng-li/DECRES",
    "homepage_status": 0,
    "language": [
        "Python"
    ],
    "lastUpdate": "2018-12-10T12:59:00Z",
    "license": null,
    "link": [],
    "maturity": null,
    "name": "DECRES",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "otherID": [],
    "owner": "shadi.m",
    "publication": [
        {
            "doi": "10.1186/s12859-018-2187-1",
            "metadata": {
                "abstract": "© 2018 The Author(s). Background: In the human genome, 98% of DNA sequences are non-protein-coding regions that were previously disregarded as junk DNA. In fact, non-coding regions host a variety of cis-regulatory regions which precisely control the expression of genes. Thus, Identifying active cis-regulatory regions in the human genome is critical for understanding gene regulation and assessing the impact of genetic variation on phenotype. The developments of high-throughput sequencing and machine learning technologies make it possible to predict cis-regulatory regions genome wide. Results: Based on rich data resources such as the Encyclopedia of DNA Elements (ENCODE) and the Functional Annotation of the Mammalian Genome (FANTOM) projects, we introduce DECRES based on supervised deep learning approaches for the identification of enhancer and promoter regions in the human genome. Due to their ability to discover patterns in large and complex data, the introduction of deep learning methods enables a significant advance in our knowledge of the genomic locations of cis-regulatory regions. Using models for well-characterized cell lines, we identify key experimental features that contribute to the predictive performance. Applying DECRES, we delineate locations of 300,000 candidate enhancers genome wide (6.8% of the genome, of which 40,000 are supported by bidirectional transcription data), and 26,000 candidate promoters (0.6% of the genome). Conclusion: The predicted annotations of cis-regulatory regions will provide broad utility for genome interpretation from functional genomics to clinical applications. The DECRES model demonstrates potentials of deep learning technologies when combined with high-throughput sequencing data, and inspires the development of other advanced neural network models for further improvement of genome annotations.",
                "authors": [
                    {
                        "name": "Li Y."
                    },
                    {
                        "name": "Shi W."
                    },
                    {
                        "name": "Wasserman W.W."
                    }
                ],
                "citationCount": 3,
                "date": "2018-05-31T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Genome-wide prediction of cis-regulatory regions using supervised deep learning methods"
            },
            "note": null,
            "pmcid": null,
            "pmid": null,
            "type": "Primary",
            "version": null
        }
    ],
    "relation": [],
    "toolType": [
        "Library",
        "Script"
    ],
    "topic": [
        {
            "term": "Enhancers",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "Transcriptional regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "Promoters",
            "uri": "http://edamontology.org/topic_0749"
        }
    ],
    "validated": 1,
    "version": []
}