{
    "additionDate": "2023-02-14T12:35:48.559128Z",
    "biotoolsCURIE": "biotools:crmss",
    "biotoolsID": "crmss",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "jxwang@mail.csu.edu.cn",
            "name": "Jianxin Wang",
            "typeEntity": "Person"
        }
    ],
    "description": "Scripts for predicting circRNA-RBP binding sites based on multi-scale characterizing sequence and structure features.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Binding site prediction",
                    "uri": "http://edamontology.org/operation_2575"
                },
                {
                    "term": "RNA-binding protein prediction",
                    "uri": "http://edamontology.org/operation_3901"
                },
                {
                    "term": "Sequence feature detection",
                    "uri": "http://edamontology.org/operation_0253"
                }
            ]
        }
    ],
    "homepage": "https://github.com/BioinformaticsCSU/CRMSS",
    "language": [
        "Python"
    ],
    "lastUpdate": "2023-02-14T12:35:48.561673Z",
    "license": "GPL-3.0",
    "name": "CRMSS",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1093/BIB/BBAC530",
            "metadata": {
                "abstract": "© The Author(s) 2022. Published by Oxford University Press. All rights reserved. For Permissions, please email: journals.permissions@oup.com.Circular RNAs (circRNAs) are reverse-spliced and covalently closed RNAs. Their interactions with RNA-binding proteins (RBPs) have multiple effects on the progress of many diseases. Some computational methods are proposed to identify RBP binding sites on circRNAs but suffer from insufficient accuracy, robustness and explanation. In this study, we first take the characteristics of both RNA and RBP into consideration. We propose a method for discriminating circRNA-RBP binding sites based on multi-scale characterizing sequence and structure features, called CRMSS. For circRNAs, we use sequence ${k}\\hbox{-}{mer}$ embedding and the forming probabilities of local secondary structures as features. For RBPs, we combine sequence and structure frequencies of RNA-binding domain regions to generate features. We capture binding patterns with multi-scale residual blocks. With BiLSTM and attention mechanism, we obtain the contextual information of high-level representation for circRNA-RBP binding. To validate the effectiveness of CRMSS, we compare its predictive performance with other methods on 37 RBPs. Taking the properties of both circRNAs and RBPs into account, CRMSS achieves superior performance over state-of-the-art methods. In the case study, our model provides reliable predictions and correctly identifies experimentally verified circRNA-RBP pairs. The code of CRMSS is freely available at https://github.com/BioinformaticsCSU/CRMSS.",
                "authors": [
                    {
                        "name": "Li Y."
                    },
                    {
                        "name": "Lu C."
                    },
                    {
                        "name": "Wang J."
                    },
                    {
                        "name": "Zeng M."
                    },
                    {
                        "name": "Zhang L."
                    }
                ],
                "date": "2023-01-19T00:00:00Z",
                "journal": "Briefings in bioinformatics",
                "title": "CRMSS: predicting circRNA-RBP binding sites based on multi-scale characterizing sequence and structure features"
            },
            "pmid": "36511222"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Mathematics",
            "uri": "http://edamontology.org/topic_3315"
        },
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        },
        {
            "term": "RNA immunoprecipitation",
            "uri": "http://edamontology.org/topic_3794"
        },
        {
            "term": "Sequence sites, features and motifs",
            "uri": "http://edamontology.org/topic_0160"
        }
    ]
}
