{
    "additionDate": "2021-01-18T08:04:05Z",
    "biotoolsCURIE": "biotools:versavis",
    "biotoolsID": "versavis",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "florian.tschopp@mavt.ethz.ch",
            "name": "Florian Tschopp",
            "orcidid": "https://orcid.org/0000-0001-7346-2941",
            "typeEntity": "Person"
        }
    ],
    "description": "VersaVIS provides a complete, open-source hardware, firmware and software bundle to perform time synchronization of multiple cameras with an IMU featuring exposure compensation, host clock translation and independent and stereo camera triggering.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "http://www.github.com/ethz-asl/versavis",
    "language": [
        "C++",
        "MATLAB",
        "Python"
    ],
    "lastUpdate": "2021-03-12T16:09:27Z",
    "name": "VersaVIS",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.3390/S20051439",
            "metadata": {
                "abstract": "© 2020 by the authors. Licensee MDPI, Basel, Switzerland.Robust and accurate pose estimation is crucial for many applications in mobile robotics. Extending visual Simultaneous Localization and Mapping (SLAM) with other modalities such as an inertial measurement unit (IMU) can boost robustness and accuracy. However, for a tight sensor fusion, accurate time synchronization of the sensors is often crucial. Changing exposure times, internal sensor filtering, multiple clock sources and unpredictable delays from operation system scheduling and data transfer can make sensor synchronization challenging. In this paper, we present VersaVIS, an Open Versatile Multi-Camera Visual-Inertial Sensor Suite aimed to be an efficient research platform for easy deployment, integration and extension for many mobile robotic applications. VersaVIS provides a complete, open-source hardware, firmware and software bundle to perform time synchronization of multiple cameras with an IMU featuring exposure compensation, host clock translation and independent and stereo camera triggering. The sensor suite supports a wide range of cameras and IMUs to match the requirements of the application. The synchronization accuracy of the framework is evaluated on multiple experiments achieving timing accuracy of less than 1 ms. Furthermore, the applicability and versatility of the sensor suite is demonstrated in multiple applications including visual-inertial SLAM, multi-camera applications, multi-modal mapping, reconstruction and object based mapping.",
                "authors": [
                    {
                        "name": "Bernreiter L."
                    },
                    {
                        "name": "Cadena C."
                    },
                    {
                        "name": "Fehr M."
                    },
                    {
                        "name": "Furrer F."
                    },
                    {
                        "name": "Nieto J."
                    },
                    {
                        "name": "Novkovic T."
                    },
                    {
                        "name": "Pfrunder A."
                    },
                    {
                        "name": "Riner M."
                    },
                    {
                        "name": "Siegwart R."
                    },
                    {
                        "name": "Tschopp F."
                    }
                ],
                "citationCount": 4,
                "date": "2020-03-01T00:00:00Z",
                "journal": "Sensors (Switzerland)",
                "title": "VersaVIS—an open versatile multi-camera visual-inertial sensor suite"
            },
            "pmcid": "PMC7085520",
            "pmid": "32155749"
        }
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Protein expression",
            "uri": "http://edamontology.org/topic_0108"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        }
    ]
}
