{
    "additionDate": "2023-03-19T08:43:11.087335Z",
    "biotoolsCURIE": "biotools:eaqtldb",
    "biotoolsID": "eaqtldb",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Yang Yang"
        }
    ],
    "description": "An atlas of enhancer activity quantitative trait loci across cancer types.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene expression QTL analysis",
                    "uri": "http://edamontology.org/operation_3232"
                },
                {
                    "term": "Genetic mapping",
                    "uri": "http://edamontology.org/operation_0282"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                }
            ]
        }
    ],
    "homepage": "http://www.bioailab.com:3838/eaQTLdb",
    "language": [
        "R"
    ],
    "lastUpdate": "2024-11-24T14:53:20.886404Z",
    "license": "Other",
    "name": "eaQTLdb",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1002/ijc.34481",
            "metadata": {
                "abstract": "Enhancers are key regulatory elements that exert crucial roles in diverse biological processes, including tumorigenesis and cancer development. Active enhancers could produce transcripts termed enhancer RNAs (eRNAs), which could be used as an index of enhancer activity. Here, we present a versatile data portal, enhancer activity quantitative trait loci database (eaQTLdb; http://www.bioailab.com:3838/eaQTLdb), for exploring the effects of genetic variants on enhancer activity and prioritizing candidate variants across different cancer types. By leveraging the accumulated multiomics data, we systematically identified genetic variants which influence enhancer activity in different cancer types, termed as eaQTLs. We have linked the eaQTLs to hallmarks of cancer and patients' overall survival to illustrate their potential biological roles in cancer development and progression. Notably, eaQTLs associated with the infiltration abundance of 24 different immune cell types were identified and incorporated into eaQTLdb. In addition, we applied colocalization analyses to examine 59 complex diseases and traits to identify eaQTLs colocalized with diseases/traits GWAS signals. Overall, eaQTLdb, incorporating a rich resource for exploration of eaQTLs in different cancer types, will not only benefit users in prioritizing candidate genetic variants and enhancers, but also help researchers decipher the roles of eaQTLs in the dysregulated pathways of cancer and tumor immune microenvironment, opening new diagnostic and therapeutic avenues in precise medicine.",
                "authors": [
                    {
                        "name": "Li M.J."
                    },
                    {
                        "name": "Liu X."
                    },
                    {
                        "name": "Tong Y."
                    },
                    {
                        "name": "Yang Y."
                    },
                    {
                        "name": "Yuan J."
                    },
                    {
                        "name": "Zhang Q."
                    }
                ],
                "date": "2023-07-01T00:00:00Z",
                "journal": "International Journal of Cancer",
                "title": "eaQTLdb: An atlas of enhancer activity quantitative trait loci across cancer types"
            },
            "pmid": "36840614"
        }
    ],
    "toolType": [
        "Database portal",
        "Web application"
    ],
    "topic": [
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        },
        {
            "term": "GWAS study",
            "uri": "http://edamontology.org/topic_3517"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        }
    ]
}
