{
    "additionDate": "2024-02-09T09:40:27.583876Z",
    "biotoolsCURIE": "biotools:crypticproteindb",
    "biotoolsID": "crypticproteindb",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "christophermaher@wustl.edu",
            "name": "Christopher A Maher",
            "orcidid": "https://orcid.org/0000-0002-9035-603X",
            "typeEntity": "Person"
        }
    ],
    "description": "Integrated database of proteome and immunopeptidome-derived non-canonical cancer proteins.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Coding region prediction",
                    "uri": "http://edamontology.org/operation_0436"
                },
                {
                    "term": "Differential protein expression profiling",
                    "uri": "http://edamontology.org/operation_3741"
                },
                {
                    "term": "Epitope mapping",
                    "uri": "http://edamontology.org/operation_0416"
                }
            ]
        }
    ],
    "homepage": "https://www.maherlab.com/crypticproteindb",
    "lastUpdate": "2024-02-09T09:40:27.586643Z",
    "name": "CrypticProteinDB",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/NARCAN/ZCAD024",
            "metadata": {
                "abstract": "Translated non-canonical proteins derived from noncoding regions or alternative open reading frames (ORFs) can contribute to critical and diverse cellular processes. In the context of cancer, they also represent an under-appreciated source of targets for cancer immunotherapy through their tumor-enriched expression or by harboring somatic mutations that produce neoantigens. Here, we introduce the largest integration and proteogenomic analysis of novel peptides to assess the prevalence of non-canonical ORFs (ncORFs) in more than 900 patient proteomes and 26 immunopeptidome datasets across 14 cancer types. The integrative proteogenomic analysis of whole-cell proteomes and immunopeptidomes revealed peptide support for a nonredundant set of 9760 upstream, downstream, and out-of-frame ncORFs in protein coding genes and 12811 in noncoding RNAs. Notably, 6486 ncORFs were derived from differentially expressed genes and 340 were ubiquitously translated across eight or more cancers. The analysis also led to the discovery of thirty-four epitopes and eight neoantigens from noncanonical proteins in two cohorts as novel cancer immunotargets. Collectively, our analysis integrated both bottom-up proteogenomic and targeted peptide validation to illustrate the prevalence of translated non-canonical proteins in cancer and to provide a resource for the prioritization of novel proteins supported by proteomic, immunopeptidomic, genomic and transcriptomic data, available at https://www.maherlab.com/crypticproteindb.",
                "authors": [
                    {
                        "name": "Maher C.A."
                    },
                    {
                        "name": "Othoum G."
                    }
                ],
                "date": "2023-06-01T00:00:00Z",
                "journal": "NAR Cancer",
                "title": "CrypticProteinDB: an integrated database of proteome and immunopeptidome derived non-canonical cancer proteins"
            },
            "pmcid": "PMC10233886",
            "pmid": "37275273"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Immunoproteins and antigens",
            "uri": "http://edamontology.org/topic_2830"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Protein expression",
            "uri": "http://edamontology.org/topic_0108"
        },
        {
            "term": "Proteogenomics",
            "uri": "http://edamontology.org/topic_3922"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        }
    ]
}
