{
    "additionDate": "2021-01-18T11:52:40Z",
    "biotoolsCURIE": "biotools:rotational_profiler",
    "biotoolsID": "rotational_profiler",
    "confidence_flag": "tool",
    "description": "A Fast, Automated, and Interactive Server to Derive Torsional Dihedral Potentials for Classical Molecular Simulations.\n\nThe Rotational Profiler attempts to facilitate the task of performing this overall fit. The functional torsional form used in the code is.\n\nThere is a very fundamental difference in the use of torsional potential functions as compared to bond length and angle potentials. Only a small subset of the full potential energy domain, around the minumum, is realized in the parabolic-like bond length and angle potentials. Therefore the emphasis in fitting these potentials is to reproduce potential near the minimum, with not so much concern about the functional form, or parameterization, or large excursions from equilibrium because they are energetically disallowed.\n\nOn the other hand, torsional potentials are evaluated over the full 360° of rotation around a bond.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Forcefield parameterisation",
                    "uri": "http://edamontology.org/operation_3893"
                },
                {
                    "term": "Phasing",
                    "uri": "http://edamontology.org/operation_3454"
                },
                {
                    "term": "Protein geometry calculation",
                    "uri": "http://edamontology.org/operation_0249"
                },
                {
                    "term": "Protein geometry validation",
                    "uri": "http://edamontology.org/operation_1844"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "http://rotprof.lncc.br",
    "lastUpdate": "2021-02-08T13:05:57Z",
    "name": "Rotational Profiler",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1021/ACS.JCIM.0C01168",
            "metadata": {
                "abstract": "© Rotational Profiler provides an analytical algorithm to compute sets of classical torsional dihedral parameters by fitting an empirical energy profile to a reference one that can be obtained experimentally or by quantum-mechanical methods. The resulting profiles are compatible with the functional forms in the most widely used biomolecular force fields (e.g., GROMOS, AMBER, OPLS, and CHARMM). The linear least-squares regression method is used to generate sets of parameters that best satisfy the fitting. Rotational Profiler is free to use, analytical, and force field/package independent. The formalism is herein described, and its usage, in an interactive and automated manner, is made available as a Web server at http://rotprof.lncc.br.",
                "authors": [
                    {
                        "name": "Galheigo M.M."
                    },
                    {
                        "name": "Gomes A.T.A."
                    },
                    {
                        "name": "Lins R.D."
                    },
                    {
                        "name": "Poleto M.D."
                    },
                    {
                        "name": "Rusu V.H."
                    },
                    {
                        "name": "Santos D.E.S."
                    },
                    {
                        "name": "Soares T.A."
                    },
                    {
                        "name": "Verli H."
                    }
                ],
                "date": "2020-12-28T00:00:00Z",
                "journal": "Journal of Chemical Information and Modeling",
                "title": "Rotational Profiler: A Fast, Automated, and Interactive Server to Derive Torsional Dihedral Potentials for Classical Molecular Simulations"
            },
            "pmid": "33213140"
        }
    ],
    "topic": [
        {
            "term": "Molecular dynamics",
            "uri": "http://edamontology.org/topic_0176"
        },
        {
            "term": "NMR",
            "uri": "http://edamontology.org/topic_0593"
        },
        {
            "term": "Physics",
            "uri": "http://edamontology.org/topic_3318"
        }
    ]
}
