
{
    "credit": [
        {
            "email": "andrones@cs.ubc.ca",
            "name": "Mirela Andronescu",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://www.cs.ubc.ca/labs/beta"
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://www.rnasoft.ca/download/README.html"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Nucleic acid structure prediction",
                    "uri": "http://edamontology.org/operation_0475"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "C++"
        ],
        "operatingSystem": [
            "Linux",
            "Windows"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Nucleic acid structure analysis",
                "uri": "http://edamontology.org/topic_0097"
            },
            {
                "term": "RNA",
                "uri": "http://edamontology.org/topic_0099"
            },
            {
                "term": "DNA",
                "uri": "http://edamontology.org/topic_0654"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/multirnafold-2-0-secondary-structure-prediction-rnadna.html"
        }
    ],
    "publication": [
        {
            "abstract": "Computational tools for prediction of the secondary structure of two or more interacting nucleic acid molecules are useful for understanding mechanisms for ribozyme function, determining the affinity of an oligonucleotide primer to its target, and designing good antisense oligonucleotides, novel ribozymes, DNA code words, or nanostructures. Here, we introduce new algorithms for prediction of the minimum free energy pseudoknot-free secondary structure of two or more nucleic acid molecules, and for prediction of alternative low-energy (sub-optimal) secondary structures for two nucleic acid molecules. We provide a comprehensive analysis of our predictions against secondary structures of interacting RNA molecules drawn from the literature. Analysis of our tools on 17 sequences of up to 200 nucleotides that do not form pseudoknots shows that they have 79% accuracy, on average, for the minimum free energy predictions. When the best of 100 sub-optimal foldings is taken, the average accuracy increases to 91%. The accuracy decreases as the sequences increase in length and as the number of pseudoknots and tertiary interactions increases. Our algorithms extend the free energy minimization algorithm of Zuker & Stiegler for secondary structure prediction, and the sub-optimal folding algorithm by Wuchty et al. Implementations of our algorithms are freely available in the package MultiRNAFold (http://www.rnasoft.ca/download.html). © 2004 Elsevier Ltd. All rights reserved.",
            "authors": [
                "Andronescu M.",
                "Zhang Z.C.",
                "Condon A."
            ],
            "cit_count": 116,
            "journal": "Journal of Molecular Biology",
            "pmid": "15644199",
            "title": "Secondary structure prediction of interacting RNA molecules",
            "year": "2005-02-04"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:multirnafold",
        "biotoolsID": "multirnafold",
        "description": "Contains software for secondary structure prediction of one, two, or many interacting RNA or DNA molecules. It is composed of three pieces of software: SimFold, PairFold and MultiFold.",
        "homepage": "http://www.rnasoft.ca/download/README.html",
        "name": "MultiRNAFold"
    }
}