{
    "additionDate": "2021-01-18T07:09:14Z",
    "biotoolsCURIE": "biotools:swc-batch-check",
    "biotoolsID": "swc-batch-check",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "damienoh@gwu.edu",
            "name": "Damien M. O’Halloran",
            "orcidid": "https://orcid.org/0000-0001-5752-2131",
            "typeEntity": "Person"
        }
    ],
    "description": "Module for SWC neuron morphology file validation and correction enabled for high throughput batch processing.\n\nBatch validation of directory containing SWC files.\n\nEnsures structures are correctly connected.\n\nFix structures with zero size diameter.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Neurite measurement",
                    "uri": "http://edamontology.org/operation_3450"
                },
                {
                    "term": "Parsing",
                    "uri": "http://edamontology.org/operation_1812"
                },
                {
                    "term": "Validation",
                    "uri": "http://edamontology.org/operation_2428"
                }
            ]
        }
    ],
    "homepage": "https://github.com/dohalloran/SWC_BATCH_CHECK",
    "language": [
        "Perl"
    ],
    "lastUpdate": "2021-02-24T13:37:35Z",
    "license": "GPL-2.0",
    "name": "SWC BATCH CHECK",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PONE.0228091",
            "metadata": {
                "abstract": "Copyright: © 2020 Damien M. O’Halloran. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.SWC files are a widely used format to store neuron morphologies, and are used to share digitally reconstructed neurons using NeuroMorpho.org as well as predict functional attributes using simulation environments such as NEURON. Here we set out to develop an easily accessible tool to validate and correct SWC formatted files with an emphasis on high throughput batch processing. SWC_BATCH_CHECK is a package that provides a suite of methods to parse and correct the syntactic structure of a directory of SWC files. This tool ensures that user specified structures such as the soma or basal dendrite are correctly connected while fixing morphological features. This tool will report on missing or invalid data values while also returning basic statistical features for each file. SWC_BATCH_CHECK was validated and tested using thousands of individual SWC files to benchmark runtime performance and efficacy in both reporting on and correcting disparate SWC file features. SWC_BATCH_CHECK is open source and freely available to all users without restriction with guidelines and requirements provided to ensure straightforward installation and execution.",
                "authors": [
                    {
                        "name": "O'Halloran D.M."
                    }
                ],
                "citationCount": 3,
                "date": "2020-01-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "Module for SWC neuron morphology file validation and correction enabled for high throughput batch processing"
            },
            "pmcid": "PMC6977721",
            "pmid": "31971963"
        }
    ],
    "topic": [
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        }
    ]
}
