{"credit":[{"name":"Contact Form","typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://immunet.cn/bdb/index.php/site/contact"}],"documentation":[{"type":"GENERAL","url":"http://immunet.cn/bdb/index.php/help/index"}],"function":[{"operation":[{"term":"Database search","uri":"http://edamontology.org/operation_2421"},{"term":"Structure database search","uri":"http://edamontology.org/operation_0339"},{"term":"Structural similarity search","uri":"http://edamontology.org/operation_0360"},{"term":"Peptide database search","uri":"http://edamontology.org/operation_3646"}]}],"labels":{"operatingSystem":["Linux","Windows","Mac"],"toolType":["Database portal"],"topic":[{"term":"Gene transcripts","uri":"http://edamontology.org/topic_3512"},{"term":"Small molecules","uri":"http://edamontology.org/topic_0154"},{"term":"Protein interaction experiment","uri":"http://edamontology.org/topic_3557"},{"term":"Structure analysis","uri":"http://edamontology.org/topic_0081"}]},"publication":[{"abstract":"Mimotopes are peptides with affinities to given targets. They are readily obtained through biopanning against combinatorial peptide libraries constructed by phage display and other display technologies such as mRNA display, ribosome display, bacterial display and yeast display. Mimotopes have been used to infer the protein interaction sites and networks; they are also ideal candidates for developing new diagnostics, therapeutics and vaccines. However, such valuable peptides are not collected in the central data resources such as UniProt and NCBI GenPept due to their 'unnatural' short sequences. The MimoDB database is an information portal to biopanning results of random libraries. In version 2.0, it has 15 633 peptides collected from 849 papers and grouped into 1818 sets. Besides the core data on panning experiments and their results, broad background information on target, template, library and structure is included. An accompanied benchmark has also been compiled for bioinformaticians to develop and evaluate their new models, algorithms and programs. In addition, the MimoDB database provides tools for simple and advanced searches, structure visualization, BLAST and alignment view on the fly. The experimental biologists can easily use the database as a virtual control to exclude possible target-unrelated peptides. The MimoDB database is freely available at http://immunet.cn/mimodb. © The Author(s) 2011. Published by Oxford University Press.","authors":["Huang J.","Ru B.","Zhu P.","Nie F.","Yang J.","Wang X.","Dai P.","Lin H.","Guo F.-B.","Rao N."],"cit_count":68,"journal":"Nucleic Acids Research","pmid":"22053087","title":"MimoDB 2.0: A mimotope database and beyond","year":"2012-01-01"}],"summary":{"biotoolsCURIE":"biotools:mimodb","biotoolsID":"mimodb","description":"A mimotope database. The MimoDB database also provides tools for simple and advanced searches, structure visualization, BLAST and alignment view on the fly.","homepage":"http://immunet.cn/mimodb/","name":"MimoDB"}}