
{
    "credit": [
        {
            "email": "patrick.kimes@gmail.com",
            "name": "Patrick Kimes",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "User manual",
            "url": "http://bioconductor.org/packages/release/bioc/html/SigFuge.html"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://bioconductor/packages/release/bioc/src/contrib/SigFuge_1.12.0.tar.gz"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                }
            ]
        }
    ],
    "labels": {
        "collectionID": [
            "BioConductor"
        ],
        "language": [
            "R"
        ],
        "license": "GPL-3.0",
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Command-line tool",
            "Library"
        ],
        "topic": [
            {
                "term": "RNA-Seq",
                "uri": "http://edamontology.org/topic_3170"
            },
            {
                "term": "Gene expression",
                "uri": "http://edamontology.org/topic_0203"
            },
            {
                "term": "Data visualisation",
                "uri": "http://edamontology.org/topic_0092"
            },
            {
                "term": "RNA",
                "uri": "http://edamontology.org/topic_0099"
            }
        ]
    },
    "publication": [
        {
            "abstract": "High-throughput sequencing technologies, including RNA-seq, have made it possible to move beyond gene expression analysis to study transcriptional events including alternative splicing and gene fusions. Furthermore, recent studies in cancer have suggested the importance of identifying transcriptionally altered loci as biomarkers for improved prognosis and therapy. While many statistical methods have been proposed for identifying novel transcriptional events with RNA-seq, nearly all rely on contrasting known classes of samples, such as tumor and normal. Few tools exist for the unsupervised discovery of such events without class labels. In this paper, we present SigFuge for identifying genomic loci exhibiting differential transcription patterns across many RNA-seq samples. SigFuge combines clustering with hypothesis testing to identify genes exhibiting alternative splicing, or differences in isoform expression. We apply SigFuge to RNA-seq cohorts of 177 lung and 279 head and neck squamous cell carcinoma samples from the Cancer Genome Atlas, and identify several cases of differential isoform usage including CDKN2A, a tumor suppressor gene known to be inactivated in a majority of lung squamous cell tumors. By not restricting attention to known sample stratifications, SigFuge offers a novel approach to unsupervised screening of genetic loci across RNA-seq cohorts. SigFuge is available as an R package through Bioconductor. © The Author(s) 2014. Published by Oxford University Press on behalf of Nucleic Acids Research.",
            "authors": [
                "Kimes P.K.",
                "Cabanski C.R.",
                "Wilkerson M.D.",
                "Zhao N.",
                "Johnson A.R.",
                "Perou C.M.",
                "Makowski L.",
                "Maher C.A.",
                "Liu Y.",
                "Marron J.S.",
                "Hayes D.N."
            ],
            "cit_count": 9,
            "doi": "10.1093/nar/gku521",
            "journal": "Nucleic Acids Research",
            "title": "SigFuge: Single gene clustering of RNA-seq reveals differential isoform usage among cancer samples",
            "type": "Primary",
            "year": "2014-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:sigfuge",
        "biotoolsID": "sigfuge",
        "description": "Algorithm for testing significance of clustering in RNA-seq data.",
        "homepage": "http://bioconductor.org/packages/release/bioc/html/SigFuge.html",
        "name": "SigFuge",
        "version": [
            "1.12.0"
        ]
    }
}