{
    "additionDate": "2019-11-14T20:05:44Z",
    "biotoolsCURIE": "biotools:Data_Trends_Maps",
    "biotoolsID": "Data_Trends_Maps",
    "confidence_flag": "low",
    "credit": [
        {
            "email": "nya7@cdc.gov",
            "name": "Samantha J. Lange",
            "typeEntity": "Person"
        }
    ],
    "description": "> LOW CONFIDENCE! | > CORRECT NAME OF TOOL COULD ALSO BE 'DTM', 'Data Decision-Making' | Exploring the Division of Nutrition, Physical Activity, and Obesity's Data, Trends, and Maps | Nutrition, Physical Activity, and Obesity | Data, Trends and Maps is an interactive database that provides data on weight status as well as select behavioral, environmental and policy data in the areas of breastfeeding, diet and physical activity | Centers for Disease Control and Prevention. CDC twenty four seven. Saving Lives, Protecting People",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://www.cdc.gov/nccdphp/dnpao/data-trends-maps/index.html",
    "lastUpdate": "2019-11-14T20:05:44Z",
    "name": "Data Trends Maps",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.5888/PCD16.190043",
            "metadata": {
                "abstract": "© 2019 Centers for Disease Control and Prevention (CDC).Public health practitioners need quick and easy access to reliable surveillance data to monitor states' progress over time, compare benchmarks nationally or among states, and make strategic decisions about priorities and resources. Data, Trends, and Maps (DTM) at https://www.cdc.gov/nccdphp/dnpao/data-trends-maps/ index.html is a free, online interactive database that houses and displays data on nutrition, physical activity, breastfeeding, and obesity that practitioners can use for public health action. Created in 2015 by the Centers for Disease Control and Prevention's (CDC) Division of Nutrition, Physical Activity, and Obesity, DTM was updated and relaunched in April 2017 with the capability to customize and download data sets directly; DTM also has other user-friendly features, such as visualization options. Since its relaunch, DTM has received more than 386,000 page views from approximately 110,000 unique visitors. However, the potential exists for more widespread use of DTM if more public health practitioners understood what the site offered and how others have used it in the field. Here, we explain how public health practitioners can explore the most recent state-level data on nutrition, physical activity, breastfeeding, and obesity and use this data to inform programmatic and policy efforts to prevent and control chronic diseases. We demonstrate 3 different ways practitioners can visualize data (ie, Explore by Location, Explore by Topic, and the Open Data Portal) and present 3 real-world examples to highlight DTM's utility as a public health tool.",
                "authors": [
                    {
                        "name": "Lange S.J."
                    },
                    {
                        "name": "Moore L.V."
                    },
                    {
                        "name": "Galuska D.A."
                    }
                ],
                "date": "2019-09-01T00:00:00Z",
                "journal": "Preventing Chronic Disease",
                "title": "Data for decision-making: Exploring the division of nutrition, physical activity, and obesity's data, trends, and maps"
            },
            "pmcid": "PMC6795071",
            "pmid": "31560645"
        }
    ],
    "topic": [
        {
            "term": "Nutritional science",
            "uri": "http://edamontology.org/topic_3390"
        },
        {
            "term": "Public health and epidemiology",
            "uri": "http://edamontology.org/topic_3305"
        },
        {
            "term": "Physics",
            "uri": "http://edamontology.org/topic_3318"
        }
    ]
}