{
    "accessibility": "Open access",
    "additionDate": "2022-08-28T20:56:17.069258Z",
    "biotoolsCURIE": "biotools:lhspred",
    "biotoolsID": "lhspred",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Banani Saha"
        },
        {
            "name": "Parthasarathi Bhattacharyya"
        },
        {
            "name": "Sudipto Bhattacharjee"
        },
        {
            "name": "Sudipto Saha",
            "typeEntity": "Person"
        }
    ],
    "description": "A web based application for predicting lung health severity.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "http://dibresources.jcbose.ac.in/ssaha4/lhspred",
    "language": [
        "PHP",
        "Python"
    ],
    "lastUpdate": "2022-08-28T20:56:17.072906Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/ttsudipto/lhspred"
        }
    ],
    "name": "LHSPred",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1016/J.BSPC.2022.103745",
            "metadata": {
                "abstract": "© 2022 Elsevier LtdBackground and objectives: The computed tomography (CT) scan facilities are crucial for diagnosis of pulmonary diseases and are overburdened during the current pandemic of novel coronavirus disease 2019 (COVID-19). LHSPred (Lung Health Severity Prediction) is a web based tool that enables users to determine a score that evaluates CT scans, without radiologist intervention, and predict risk of pneumonia with features of blood examination and age of patient. It can help in early assessment of lung health severity of patients without CT-scan results and also enable monitoring of post-COVID lung health for recovered patients. Methods: This tool uses Support Vector Regression (SVR) and Multi-Layer Perceptron Regression (MLPR), trained on COVID-19 patient data reported in the literature. It allows to compute a score (CT severity score) that evaluates the involvement of lesions in lung lobes and to predict risk of pneumonia. A web application was implemented that uses the trained regression models. Results: The application has proven to be effective and user friendly in a clinical setting for pulmonary disease treatment. The SVR model achieved Pearson correlation coefficient (PCC) of 0.77 and mean absolute error (MAE) of 2.239 while determining the computed tomography (CT) severity score. The MLPR model achieved PCC of 0.77 and MAE of 2.309. Thus, it can be applied as a useful tool in predicting pneumonia in the post COVID-19 era. Conclusion: LHSPred can be used as a decision support system by the clinicians and as a tool for self-assessment by the patients with only six blood test input features.",
                "authors": [
                    {
                        "name": "Bhattacharjee S."
                    },
                    {
                        "name": "Bhattacharyya P."
                    },
                    {
                        "name": "Saha B."
                    },
                    {
                        "name": "Saha S."
                    }
                ],
                "date": "2022-08-01T00:00:00Z",
                "journal": "Biomedical Signal Processing and Control",
                "title": "LHSPred: A web based application for predicting lung health severity"
            },
            "pmcid": "PMC9098195",
            "pmid": "35582239"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Literature and language",
            "uri": "http://edamontology.org/topic_3068"
        },
        {
            "term": "Medical informatics",
            "uri": "http://edamontology.org/topic_3063"
        },
        {
            "term": "Tomography",
            "uri": "http://edamontology.org/topic_3452"
        }
    ],
    "validated": 1
}
