{
    "additionDate": "2024-04-11T14:07:53.499909Z",
    "biotoolsCURIE": "biotools:libgenie",
    "biotoolsID": "libgenie",
    "description": "bioinformatic pipeline for the design of information-enriched enzyme libraries",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Protein sequence",
                        "uri": "http://edamontology.org/data_2976"
                    }
                }
            ],
            "operation": [
                {
                    "term": "Variant classification",
                    "uri": "http://edamontology.org/operation_3225"
                },
                {
                    "term": "Variant effect prediction",
                    "uri": "http://edamontology.org/operation_0331"
                },
                {
                    "term": "Variant pattern analysis",
                    "uri": "http://edamontology.org/operation_3504"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Text data",
                        "uri": "http://edamontology.org/data_2526"
                    }
                }
            ]
        }
    ],
    "homepage": "https://libgenie.ch/",
    "lastUpdate": "2024-11-24T14:04:46.425205Z",
    "name": "LibGENiE",
    "owner": "nimstepf",
    "publication": [
        {
            "doi": "10.1016/j.csbj.2023.09.013",
            "metadata": {
                "abstract": "Enzymes are potent catalysts with high specificity and selectivity. To leverage nature's synthetic potential for industrial applications, various protein engineering techniques have emerged which allow to tailor the catalytic, biophysical, and molecular recognition properties of enzymes. However, the many possible ways a protein can be altered forces researchers to carefully balance between the exhaustiveness of an enzyme screening campaign and the required resources. Consequently, the optimal engineering strategy is often defined on a case-by-case basis. Strikingly, while predicting mutations that lead to an improved target function is challenging, here we show that the prediction and exclusion of deleterious mutations is a much more straightforward task as analyzed for an engineered carbonic acid anhydrase, a transaminase, a squalene-hopene cyclase and a Kemp eliminase. Combining such a pre-selection of allowed residues with advanced gene synthesis methods opens a path toward an efficient and generalizable library construction approach for protein engineering. To give researchers easy access to this methodology, we provide the website LibGENiE containing the bioinformatic tools for the library design workflow.",
                "authors": [
                    {
                        "name": "Bornscheuer U.T."
                    },
                    {
                        "name": "Buller R.M."
                    },
                    {
                        "name": "Eichenberger M."
                    },
                    {
                        "name": "Patsch D."
                    },
                    {
                        "name": "Voss M."
                    }
                ],
                "citationCount": 5,
                "date": "2023-01-01T00:00:00Z",
                "journal": "Computational and Structural Biotechnology Journal",
                "title": "LibGENiE – A bioinformatic pipeline for the design of information-enriched enzyme libraries"
            },
            "pmcid": "PMC10510078",
            "pmid": "37736300",
            "type": [
                "Primary"
            ]
        }
    ]
}
