{
    "additionDate": "2018-07-01T14:19:55Z",
    "biotoolsCURIE": "biotools:pssmsearch",
    "biotoolsID": "pssmsearch",
    "collectionID": [
        "Proteomics"
    ],
    "credit": [
        {
            "email": "norman.davey@ucd.ie",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Discover novel protein motifs (SLiMs, mORFs, miniMotifs) and PTM sites. Analyses proteomes for regions with significant similarity to a specificity determinant model built from a set of aligned functional peptides.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://slim.ucd.ie/pssmsearch/help/"
        }
    ],
    "editPermission": {
        "authors": [
            "proteomics.bio.tools"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence motif discovery",
                    "uri": "http://edamontology.org/operation_0238"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Sequence motif recognition",
                    "uri": "http://edamontology.org/operation_0239"
                }
            ]
        }
    ],
    "homepage": "http://slim.ucd.ie/pssmsearch/",
    "lastUpdate": "2019-07-01T15:40:41Z",
    "license": "GPL-3.0",
    "name": "PSSMSearch",
    "owner": "normandavey",
    "publication": [
        {
            "doi": "10.1093/nar/gky426",
            "metadata": {
                "abstract": "© The Author(s) 2018. Published by Oxford University Press on behalf of Nucleic Acids Research.There is a pressing need for in silico tools that can aid in the identification of the complete repertoire of protein binding (SLiMs, MoRFs, miniMotifs) and modification (moiety attachment/removal, isomerization, cleavage) motifs. We have created PSSMSearch, an interactive web-based tool for rapid statistical modeling, visualization, discovery and annotation of protein motif specificity determinants to discover novel motifs in a proteome-wide manner. PSSMSearch analyses proteomes for regions with significant similarity to a motif specificity determinant model built from a set of aligned motif-containing peptides. Multiple scoring methods are available to build a position-specific scoring matrix (PSSM) describing the motif specificity determinant model. This model can then be modified by a user to add prior knowledge of specificity determinants through an interactive PSSM heatmap. PSSMSearch includes a statistical framework to calculate the significance of specificity determinant model matches against a proteome of interest. PSSMSearch also includes the SLiMSearch framework's annotation, motif functional analysis and filtering tools to highlight relevant discriminatory information. Additional tools to annotate statistically significant shared keywords and GO terms, or experimental evidence of interaction with a motif-recognizing protein have been added. Finally, PSSM-based conservation metrics have been created for taxonomic range analyses. The PSSMSearch web server is available at http://slim.ucd.ie/pssmsearch/.",
                "authors": [
                    {
                        "name": "Davey N.E."
                    },
                    {
                        "name": "Krystkowiak I."
                    },
                    {
                        "name": "Manguy J."
                    }
                ],
                "citationCount": 19,
                "date": "2018-07-02T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "PSSMSearch: A server for modeling, visualization, proteome-wide discovery and annotation of protein motif specificity determinants"
            },
            "pmid": "29873773"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Sequence sites, features and motifs",
            "uri": "http://edamontology.org/topic_0160"
        }
    ],
    "validated": 1
}
