{
    "additionDate": "2019-11-14T18:00:38Z",
    "biotoolsCURIE": "biotools:MILAMP",
    "biotoolsID": "MILAMP",
    "confidence_flag": "tool",
    "description": "Multiple Instance Prediction of Amyloid Proteins | Software and Data Downloads — Personal Webpage documentation | Note: This page will be discontinued. Please visit my new webpage HERE and update your bookmarks | Link to my GitHub profile: HERE Here is a list of the software developed in my lab | AMAP: Antimicrobial activity prediction | MILAMP: Multiple Instance Learning of Amyloid Proteins. Webserver available HERE. Code available HERE",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Fold recognition",
                    "uri": "http://edamontology.org/operation_0303"
                },
                {
                    "term": "Protein interaction prediction",
                    "uri": "http://edamontology.org/operation_2492"
                },
                {
                    "term": "Protein secondary structure prediction",
                    "uri": "http://edamontology.org/operation_0267"
                }
            ]
        }
    ],
    "homepage": "http://faculty.pieas.edu.pk/fayyaz/software.html#MILAMP",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-12-28T10:47:11Z",
    "name": "MILAMP",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1109/TCBB.2019.2936846",
            "metadata": {
                "abstract": "© 2004-2012 IEEE.Amyloid proteins are implicated in several diseases such as Parkinson's, Alzheimer's, prion diseases, etc. In order to characterize the amyloidogenicity of a given protein, it is important to locate the amyloid forming hotspot regions within the protein as well as to analyze the effects of mutations on these proteins. The biochemical and biological assays used for this purpose can be facilitated by computational means. This paper presents a machine learning method that can predict hotspot amyloidogenic regions within proteins and characterize changes in their amyloidogenicity due to point mutations. The proposed method called MILAMP (Multiple Instance Learning of AMyloid Proteins) achieves high accuracy for identification of amyloid proteins, hotspot localization, and prediction of mutation effects on amyloidogenicity by integrating heterogenous data sources and exploiting common predictive patterns across these tasks through multiple instance learning. The paper presents comprehensive benchmarking experiments to test the predictive performance of MILAMP in comparison to previously published state of the art techniques for amyloid prediction. The python code for the implementation and webserver for MILAMP is available at the URL: http://faculty.pieas.edu.pk/fayyaz/software.html#MILAMP.",
                "authors": [
                    {
                        "name": "Asif A."
                    },
                    {
                        "name": "Gul S."
                    },
                    {
                        "name": "Minhas F.-U.-A.A."
                    },
                    {
                        "name": "Munir F."
                    }
                ],
                "citationCount": 2,
                "date": "2021-05-01T00:00:00Z",
                "journal": "IEEE/ACM Transactions on Computational Biology and Bioinformatics",
                "title": "MILAMP: Multiple Instance Prediction of Amyloid Proteins"
            },
            "pmid": "31443048"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        }
    ],
    "validated": 1
}
