{"credit":[{"email":"arnaud.droit@crchuq.ulaval.ca","name":"Arnaud Droit","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"url":"http://bioconductor.org/packages/release/bioc/html/rGADEM.html"}],"download":[{"type":"Source code","url":"http://bioconductor/packages/release/bioc/src/contrib/rGADEM_2.22.0.tar.gz"}],"function":[{"operation":[{"term":"Sequence motif recognition","uri":"http://edamontology.org/operation_0239"}]}],"labels":{"collectionID":["BioConductor"],"language":["R"],"license":"Artistic-2.0","operatingSystem":["Linux","Windows","Mac"],"toolType":["Command-line tool","Library"],"topic":[{"term":"Sequence sites, features and motifs","uri":"http://edamontology.org/topic_0160"}]},"publication":[{"abstract":"ChIP-Seq has become the standard method for genome-wide profiling DNA association of transcription factors. To simplify analyzing and interpreting ChIP-Seq data, which typically involves using multiple applications, we describe an integrated, open source, R-based analysis pipeline. The pipeline addresses data input, peak detection, sequence and motif analysis, visualization, and data export, and can readily be extended via other R and Bioconductor packages. Using a standard multicore computer, it can be used with datasets consisting of tens of thousands of enriched regions. We demonstrate its effectiveness on published human ChIP-Seq datasets for FOXA1, ER, CTCF and STAT1, where it detected co-occurring motifs that were consistent with the literature but not detected by other methods. Our pipeline provides the first complete set of Bioconductor tools for sequence and motif analysis of ChIP-Seq and ChIP-chip data. © 2011 Mercier et al. This is an open-access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.","authors":["Mercier E.","Droit A.","Li L.","Robertson G.","Zhang X.","Gottardo R."],"cit_count":23,"doi":"10.1371/journal.pone.0016432","journal":"PLoS ONE","title":"An integrated pipeline for the genome-wide analysis of transcription factor binding sites from ChiP-Seq","type":"Primary","year":"2011-02-28"}],"summary":{"biotoolsCURIE":"biotools:rgadem","biotoolsID":"rgadem","description":"Efficient de novo motif discovery tool for large-scale genomic sequence data. It is an open-source R package, which is based on the GADEM software.","homepage":"http://bioconductor.org/packages/release/bioc/html/rGADEM.html","name":"rGADEM","version":["2.22.0"]}}