{
    "additionDate": "2017-12-18T00:05:43Z",
    "biotoolsCURIE": "biotools:dsm",
    "biotoolsID": "dsm",
    "credit": [
        {
            "email": "xiaojingfa@big.ac.cn",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Software of content-based exploration and retrieval method for whole metagenome sequencing samples.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/HIITMetagenomics/dsm-framework"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                }
            ]
        }
    ],
    "homepage": "https://github.com/HIITMetagenomics/dsm-framework",
    "language": [
        "MATLAB",
        "C++"
    ],
    "lastUpdate": "2019-01-10T05:31:10Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/dsm-20140113-distributed-string-mining-framework.html"
        }
    ],
    "name": "DSM",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btu340",
            "metadata": {
                "abstract": "Motivation: Over the recent years, the field of whole-metagenome shotgun sequencing has witnessed significant growth owing to the high-throughput sequencing technologies that allow sequencing genomic samples cheaper, faster and with better coverage than before. This technical advancement has initiated the trend of sequencing multiple samples in different conditions or environments to explore the similarities and dissimilarities of the microbial communities. Examples include the human microbiome project and various studies of the human intestinal tract. With the availability of ever larger databases of such measurements, finding samples similar to a given query sample is becoming a central operation. Results: In this article, we develop a content-based exploration and retrieval method for whole-metagenome sequencing samples. We apply a distributed string mining framework to efficiently extract all informative sequence k-mers from a pool of metagenomic samples and use them to measure the dissimilarity between two samples. We evaluate the performance of the proposed approach on two human gut metagenome datasets as well as human microbiome project metagenomic samples. We observe significant enrichment for diseased gut samples in results of queries with another diseased sample and high accuracy in discriminating between different body sites even though the method is unsupervised. © The Author 2014. Published by Oxford University Press. All rights reserved.",
                "authors": [
                    {
                        "name": "Seth S."
                    },
                    {
                        "name": "Valimaki N."
                    },
                    {
                        "name": "Kaski S."
                    },
                    {
                        "name": "Honkela A."
                    }
                ],
                "citationCount": 16,
                "date": "2014-09-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Exploration and retrieval of whole-metagenome sequencing samples"
            },
            "pmcid": "PMC4230234",
            "pmid": "24845653",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        }
    ],
    "validated": 1,
    "version": [
        "20140113"
    ]
}