
{
    "credit": [
        {
            "email": "shulmana@tau.ac.il",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://bioinfo3d.cs.tau.ac.il/wk/index.php/Main_Page"
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://bioinfo3d.cs.tau.ac.il/SiteEngine/SiteEngine.html"
        },
        {
            "type": "User manual",
            "url": "http://bioinfo3d.cs.tau.ac.il/SiteEngine/help.html"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Protein binding site prediction",
                    "uri": "http://edamontology.org/operation_2575"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Proteins",
                "uri": "http://edamontology.org/topic_0078"
            },
            {
                "term": "Protein sites, features and motifs",
                "uri": "http://edamontology.org/topic_3510"
            },
            {
                "term": "Protein binding sites",
                "uri": "http://edamontology.org/topic_3534"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/siteengine-pairwise-3d-alignment-binding-sites.html"
        }
    ],
    "publication": [
        {
            "abstract": "Recognition of regions on the surface of one protein, that are similar to a binding site of another is crucial for the prediction of molecular interactions and for functional classifications. We first describe a novel method, SiteEngine, that assumes no sequence or fold similarities and is able to recognize proteins that have similar binding sites and may perform similar functions. We achieve high efficiency and speed by introducing a low-resolution surface representation via chemically important surface points, by hashing triangles of physico-chemical properties and by application of hierarchical scoring schemes for a thorough exploration of global and local similarities. We proceed to rigorously apply this method to functional site recognition in three possible ways: first, we search a given functional site on a large set of complete protein structures. Second, a potential functional site on a protein of interest is compared with known binding sites, to recognize similar features. Third, a complete protein structure is searched for the presence of an a priori unknown functional site, similar to known sites. Our method is robust and efficient enough to allow computationally demanding applications such as the first and the third. From the biological standpoint, the first application may identify secondary binding sites of drugs that may lead to side-effects. The third application finds new potential sites on the protein that may provide targets for drug design. Each of the three applications may aid in assigning a function and in classification of binding patterns. We highlight the advantages and disadvantages of each type of search, provide examples of large-scale searches of the entire Protein Data Base and make functional predictions. © 2004 Elsevier Ltd. All rights reserved.",
            "authors": [
                "Shulman-Peleg A.",
                "Nussinov R.",
                "Wolfson H.J."
            ],
            "cit_count": 204,
            "journal": "Journal of Molecular Biology",
            "pmid": "15147845",
            "title": "Recognition of functional sites in protein structures",
            "year": "2004-06-04"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:siteengine",
        "biotoolsID": "siteengine",
        "description": "The tool predicts regions that can potentially function as binding sites. The methods is based on recognition of geometrical and physico-chemical environments that are similar to known binding sites.",
        "homepage": "http://bioinfo3d.cs.tau.ac.il/SiteEngine/",
        "name": "SiteEngine"
    }
}