
{
    "credit": [
        {
            "email": "augustus-web@uni-greifswald.de",
            "name": "Augustus-web team",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://bioinf.uni-greifswald.de/webaugustus/trainingtutorial.gsp"
        }
    ],
    "function": [
        {
            "note": "Gene prediction using experimental evidence (gene products)",
            "operation": [
                {
                    "term": "Gene prediction",
                    "uri": "http://edamontology.org/operation_2454"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Ab-initio gene prediction",
                    "uri": "http://edamontology.org/operation_3662"
                }
            ]
        },
        {
            "note": "Multi-genome annotation (simultaneous gene finding in multiple genomes)",
            "operation": [
                {
                    "term": "Homology-based gene prediction",
                    "uri": "http://edamontology.org/operation_3663"
                }
            ]
        },
        {
            "note": "Gene prediction using protein sequence profiles",
            "operation": [
                {
                    "term": "Homology-based gene prediction",
                    "uri": "http://edamontology.org/operation_3663"
                }
            ]
        },
        {
            "note": "Training the parameters for individual species of interest",
            "operation": [
                {
                    "term": "Operation",
                    "uri": "http://edamontology.org/operation_0004"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "C++",
            "Perl"
        ],
        "maturity": "Mature",
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Gene transcripts",
                "uri": "http://edamontology.org/topic_3512"
            },
            {
                "term": "Gene and protein families",
                "uri": "http://edamontology.org/topic_0623"
            }
        ]
    },
    "publication": [
        {
            "abstract": "Motivation: The problem of finding the genes in eukaryotic DNA sequences by computational methods is still not satisfactorily solved. Gene finding programs have achieved relatively high accuracy on short genomic sequences but do not perform well on longer sequences with an unknown number of genes in them. Here existing programs tend to predict many false exons. Results: We have developed a new program, AUGUSTUS, for the ab initio prediction of protein coding genes in eukaryotic genomes. The program is based on a Hidden Markov Model and integrates a number of known methods and submodels. It employs a new way of modeling intron lengths. We use a new donor splice site model, a new model for a short region directly upstream of the donor splice site model that takes the reading frame into account and apply a method that allows better GC-content dependent parameter estimation. AUGUSTUS predicts on longer sequences far more human and drosophila genes accurately than the ab initio gene prediction programs we compared it with, while at the same time being more specific. Availability: A web interface for AUGUSTUS and the executable program are located at http://augustus.gobics. de. Supplementary Information: The datasets used for testing and training are available at http://augustus.gobics.de/datasets/. © Oxford University Press 2003; all rights reserved.",
            "authors": [
                "Stanke M.",
                "Waack S."
            ],
            "cit_count": 552,
            "doi": "10.1093/bioinformatics/btg1080",
            "journal": "Bioinformatics",
            "title": "Gene prediction with a hidden Markov model and a new intron submodel",
            "type": "Primary",
            "year": "2003-12-01"
        },
        {
            "abstract": "We present a www server for AUGUSTUS, a novel software program for ab initio gene prediction in eukaryotic genomic sequences. Our method is based on a generalized Hidden Markov Model with a new method for modeling the intron length distribution. This method allows approximation of the true intron length distribution more accurately than do existing programs. For genomic sequence data from human and Drosophila melanogaster, the accuracy of AUGUSTUS is superior to existing gene-finding approaches. The advantage of our program becomes apparent especially for larger input sequences containing more than one gene. The server is available at http://augustus.gobics.de. © Oxford University Press 2004; all rights reserved.",
            "authors": [
                "Stanke M.",
                "Steinkamp R.",
                "Waack S.",
                "Morgenstern B."
            ],
            "cit_count": 442,
            "doi": "10.1093/nar/gkh379",
            "journal": "Nucleic Acids Research",
            "title": "AUGUSTUS: A web server for gene finding in eukaryotes",
            "type": "Primary",
            "year": "2004-07-01"
        },
        {
            "abstract": "We present a WWW server for AUGUSTUS, a software for gene prediction in eukaryotic genomic sequences that is based on a generalized hidden Markov model, a probabilistic model of a sequence and its gene structure. The web server allows the user to impose constraints on the predicted gene structure. A constraint can specify the position of a splice site, a translation initiation site or a stop codon. Furthermore, it is possible to specify the position of known exons and intervals that are known to be exonic or intronic sequence. The number of constraints is arbitrary and constraints can be combined in order to pin down larger parts of the predicted gene structure. The result then is the most likely gene structure that complies with all given user constraints, if such a gene structure exists. The specification of constraints is useful when part of the gene structure is known, e.g. by expressed sequence tag or protein sequence alignments, or if the user wants to change the default prediction. The web interface and the downloadable stand-alone program are available free of charge at http://augustus.gobics.de/ submission. © 2005 Oxford University Press.",
            "authors": [
                "Stanke M.",
                "Morgenstern B."
            ],
            "cit_count": 417,
            "doi": "10.1093/nar/gki458",
            "journal": "Nucleic Acids Research",
            "title": "AUGUSTUS: A web server for gene prediction in eukaryotes that allows user-defined constraints",
            "type": "Primary",
            "year": "2005-07-01"
        },
        {
            "abstract": "AUGUSTUS is a software tool for gene prediction in eukaryotes based on a Generalized Hidden Markov Model, a probabilistic model of a sequence and its gene structure. Like most existing gene finders, the first version of AUGUSTUS returned one transcript per predicted gene and ignored the phenomenon of alternative splicing. Herein, we present a WWW server for an extended version of AUGUSTUS that is able to predict multiple splice variants. To our knowledge, this is the first ab initio gene finder that can predict multiple transcripts. In addition, we offer a motif searching facility, where user-defined regular expressions can be searched against putative proteins encoded by the predicted genes. The AUGUSTUS web interface and the downloadable open-source stand-alone program are freely available from http://augustus.gobics.de.",
            "authors": [
                "Stanke M.",
                "Keller O.",
                "Gunduz I.",
                "Hayes A.",
                "Waack S.",
                "Morgenstern B."
            ],
            "cit_count": 418,
            "doi": "10.1093/nar/gkl200",
            "journal": "Nucleic Acids Research",
            "title": "AUGUSTUS: A b initio prediction of alternative transcripts",
            "type": "Primary",
            "year": "2006-07-01"
        },
        {
            "abstract": "The prediction of protein coding genes is an important step in the annotation of newly sequenced and assembled genomes. AUGUSTUS is one of the most accurate tools for eukaryotic gene prediction. Here, we present WebAUGUSTUS, a web interface for training AUGUSTUS and predicting genes with AUGUSTUS. Depending on the needs of the user, WebAUGUSTUS generates training gene structures automatically. Besides a genome file, either a file with expressed sequence tags or a file with protein sequences is required for this step. Alternatively, it is possible to submit an externally generated training gene structure file and a genome file. The web service optimizes AUGUSTUS parameters and predicts genes with those parameters. WebAUGUSTUS is available at http://bioinf.uni-greifswald.de/webaugustus.",
            "authors": [
                "Hoff K.J.",
                "Stanke M."
            ],
            "cit_count": 91,
            "doi": "10.1093/nar/gkt418",
            "journal": "Nucleic acids research",
            "title": "WebAUGUSTUS--a web service for training AUGUSTUS and predicting genes in eukaryotes.",
            "type": "Primary",
            "year": "2013-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:webaugustus",
        "biotoolsID": "webaugustus",
        "description": "WebAUGUSTUS is a web server for the prediction of genes in eukaryotic genomic sequences. This web server provides an interface for training AUGUSTUS for predicting genes in genomes of novel species. It also enables users to predict genes in a genome sequence with already trained parameters.",
        "homepage": "http://bioinf.uni-greifswald.de/webaugustus",
        "name": "WebAUGUSTUS"
    }
}