{
    "additionDate": "2017-03-25T12:51:30Z",
    "biotoolsCURIE": "biotools:toppcluster",
    "biotoolsID": "toppcluster",
    "credit": [
        {
            "email": "Anil.Jegga@cchmc.org",
            "name": "Anil Jegga",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "ToppCluster is a human/mammalian genomes-centered web server application for comparative enrichment and network analysis of multiple gene lists. Features such as Gene Ontology terms, protein interactions,disease or disease-associated mammalian phenotypes, promoter cis-elements, miR binding sites, etc. that are differentially represented  in the gene lists can be clustered or transformed into high dimensional Cytoscape or Gephi -compatible networks.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://toppcluster.cchmc.org/help/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene regulatory network analysis",
                    "uri": "http://edamontology.org/operation_1781"
                },
                {
                    "term": "Gene-set enrichment analysis",
                    "uri": "http://edamontology.org/operation_2436"
                },
                {
                    "term": "Weighted correlation network analysis",
                    "uri": "http://edamontology.org/operation_3766"
                }
            ]
        }
    ],
    "homepage": "http://toppcluster.cchmc.org",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-10T12:58:53Z",
    "name": "ToppCluster",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "ToppCluster is a web server application that leverages a powerful enrichment analysis and underlying data environment for comparative analyses of multiple gene lists. It generates heatmaps or connectivity networks that reveal functional features shared or specific to multiple gene lists. ToppCluster uses hypergeometric tests to obtain list-specific feature enrichment P-values for currently 17 categories of annotations of humanortholog genes, and provides user-selectable cutoffs and multiple testing correction methods to control false discovery. Each nameable gene list represents a column input to a resulting matrix whose rows are overrepresented features, and individual cells per-list P-values and corresponding genes per feature. ToppCluster provides users with choices of tabular outputs, hierarchical clustering and heatmap generation, or the ability to interactively select features from the functional enrichment matrix to be transformed into XGMML or GEXF network format documents for use in Cytoscape or Gephi applications, respectively. Here, as example, we demonstrate the ability of ToppCluster to enable identification of list-specific phenotypic and regulatory element features (both cis-elements and 30UTR microRNA binding sites) among tissue-specific gene lists. ToppCluster's functionalities enable the identification of specialized biological functions and regulatory networks and systems biology-based dissection of biological states. ToppCluster can be accessed freely at http://toppcluster.cchmc.org. © The Author(s) 2010. Published by Oxford University Press.",
                "authors": [
                    {
                        "name": "Aronow B.J."
                    },
                    {
                        "name": "Bardes E.E."
                    },
                    {
                        "name": "Jegga A.G."
                    },
                    {
                        "name": "Kaimal V."
                    },
                    {
                        "name": "Tabar S.C."
                    }
                ],
                "citationCount": 209,
                "date": "2010-05-19T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "ToppCluster: A multiple gene list feature analyzer for comparative enrichment clustering and networkbased dissection of biological systems"
            },
            "pmid": "20484371"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Gene structure",
            "uri": "http://edamontology.org/topic_0114"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ],
    "validated": 1
}
