{
    "additionDate": "2020-01-09T18:03:23Z",
    "biotoolsCURIE": "biotools:DriverSub",
    "biotoolsID": "DriverSub",
    "confidence_flag": "tool",
    "description": "Inferring subgroup specific driver genes from heterogeneous cancer samples via subspace learning with subgroup indication.\n\nDeveloper: Jianing Xi xjn@nwpu.edu.cn.\n\nInstructions to DriverSub (version 1.0.0).\n\nAfter the raw data are loaded, the script ./GenerateInputData.m with function ./bin/P02_GenerateMutData.m can generate the mutation matrix of BRCA and BLCA as ./InputData/D01_brca.mat and ./InputData/D02_blca.mat. The two generated .mat files are the input data of DriverSub",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Pathway or network prediction",
                    "uri": "http://edamontology.org/operation_3439"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Gene prediction",
                    "uri": "http://edamontology.org/operation_2454"
                }
            ]
        }
    ],
    "homepage": "https://github.com/JianingXi/DriverSub",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2020-12-22T12:11:52Z",
    "name": "DriverSub",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ793",
            "metadata": {
                "abstract": "© The Author(s) 2019. Published by Oxford University Press. All rights reserved.Motivation: Detecting driver genes from gene mutation data is a fundamental task for tumorigenesis research. Due to the fact that cancer is a heterogeneous disease with various subgroups, subgroup-specific driver genes are the key factors in the development of precision medicine for heterogeneous cancer. However, the existing driver gene detection methods are not designed to identify subgroup specificities of their detected driver genes, and therefore cannot indicate which group of patients is associated with the detected driver genes, which is difficult to provide specifically clinical guidance for individual patients. Results: By incorporating the subspace learning framework, we propose a novel bioinformatics method called DriverSub, which can efficiently predict subgroup-specific driver genes in the situation where the subgroup annotations are not available. When evaluated by simulation datasets with known ground truth and compared with existing methods, DriverSub yields the best prediction of driver genes and the inference of their related subgroups. When we apply DriverSub on the mutation data of real heterogeneous cancers, we can observe that the predicted results of DriverSub are highly enriched for experimentally validated known driver genes. Moreover, the subgroups inferred by DriverSub are significantly associated with the annotated molecular subgroups, indicating its capability of predicting subgroup-specific driver genes.",
                "authors": [
                    {
                        "name": "Xi J."
                    },
                    {
                        "name": "Yuan X."
                    },
                    {
                        "name": "Wang M."
                    },
                    {
                        "name": "Li A."
                    },
                    {
                        "name": "Li X."
                    },
                    {
                        "name": "Huang Q."
                    }
                ],
                "citationCount": 8,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Inferring subgroup-specific driver genes from heterogeneous cancer samples via subspace learning with subgroup indication"
            },
            "pmid": "31626284"
        }
    ],
    "topic": [
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Personalised medicine",
            "uri": "http://edamontology.org/topic_3577"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        }
    ],
    "validated": 1
}