{
    "accessibility": "Open access",
    "additionDate": "2022-06-07T07:30:39.371626Z",
    "biotoolsCURIE": "biotools:dual-use_quickscan",
    "biotoolsID": "dual-use_quickscan",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "rik.bleijs@rivm.nl",
            "name": "Diederik A. Bleijs",
            "typeEntity": "Person"
        }
    ],
    "description": "A web-based tool to assess the dual-use potential of life science research. The aim of the tool is to provide a clear and practical dual-use risk assessment of research concerned and to create dual-use awareness amongst life-science researchers, as explicitly stated in the WHO Benchmarks for International Health Regulations Capacities.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Anonymisation",
                    "uri": "http://edamontology.org/operation_3283"
                }
            ]
        }
    ],
    "homepage": "http://www.dualusequickscan.com",
    "lastUpdate": "2022-06-07T07:30:39.374309Z",
    "name": "Dual-Use Quickscan",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.3389/FBIOE.2021.797076",
            "metadata": {
                "abstract": "Copyright © 2021 Vennis, Schaap, Hogervorst, de Bruin, Schulpen, Boot, van Passel, Rutjes and Bleijs.Research on pathogenic organisms is crucial for medical, biological and agricultural developments. However, biological agents as well as associated knowledge and techniques, can also be misused, for example for the development of biological weapons. Potential malicious use of well-intended research, referred to as “dual-use research”, poses a threat to public health and the environment. There are various international resources providing frameworks to assess dual-use potential of the research concerned. However, concrete instructions for researchers on how to perform a dual-use risk assessment is largely lacking. The international need for practical dual-use monitoring and risk assessment instructions, in addition to the need to raise awareness among scientists about potential dual-use aspects of their research has been identified over the last years by the Netherlands Biosecurity Office, through consulting national and international biorisk stakeholders. We identified that Biorisk Management Advisors and researchers need a practical tool to facilitate a dual-use assessment on their specific research. Therefore, the Netherlands Biosecurity Office developed a web-based Dual-Use Quickscan (www.dualusequickscan.com), that can be used periodically by researchers working with microorganisms to assess potential dual-use risks of their research by answering a set of fifteen yes/no questions. The questions for the tool were extracted from existing international open resources, and categorized into three themes: characteristics of the biological agent, knowledge and technology about the biological agent, and consequences of misuse. The results of the Quickscan provide the researcher with an indication of the dual-use potential of the research and can be used as a basis for further discussions with a Biorisk Management Advisor. The Dual-Use Quickscan can be embedded in a broader system of biosafety and biosecurity that includes dual-use monitoring and awareness within organizations. Increased international attention to examine pathogens with pandemic potential has been enhanced by the current COVID-19 pandemic, hence monitoring of dual-use potential urgently needs to be encouraged.",
                "authors": [
                    {
                        "name": "Bleijs D.A."
                    },
                    {
                        "name": "Boot M.A."
                    },
                    {
                        "name": "Hogervorst P.A.M."
                    },
                    {
                        "name": "Rutjes S.A."
                    },
                    {
                        "name": "Schaap M.M."
                    },
                    {
                        "name": "Schulpen S."
                    },
                    {
                        "name": "Vennis I.M."
                    },
                    {
                        "name": "de Bruin A."
                    },
                    {
                        "name": "van Passel M.W.J."
                    }
                ],
                "date": "2021-12-09T00:00:00Z",
                "journal": "Frontiers in Bioengineering and Biotechnology",
                "title": "Dual-Use Quickscan: A Web-Based Tool to Assess the Dual-Use Potential of Life Science Research"
            },
            "pmcid": "PMC8696162",
            "pmid": "34957083"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Agricultural science",
            "uri": "http://edamontology.org/topic_3810"
        },
        {
            "term": "Biotechnology",
            "uri": "http://edamontology.org/topic_3297"
        },
        {
            "term": "Microbiology",
            "uri": "http://edamontology.org/topic_3301"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        }
    ],
    "validated": 1
}
