{
    "accessibility": "Open access",
    "additionDate": "2023-02-27T23:05:48.793378Z",
    "biotoolsCURIE": "biotools:mha",
    "biotoolsID": "mha",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "zlyinwangyi@163.com",
            "name": "LiangYu Zhao",
            "typeEntity": "Person"
        },
        {
            "name": "ChenCheng Yao"
        },
        {
            "name": "YiFan Zhao"
        },
        {
            "name": "YuXin Tang"
        }
    ],
    "description": "Interactive website for scRNA-seq data of male genitourinary development and disease.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "http://malehealthatlas.cn/",
    "lastUpdate": "2024-11-24T14:56:56.358242Z",
    "name": "MHA",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1111/andr.13402",
            "metadata": {
                "abstract": "Background: The development of single-cell sequencing technology has expanded the understanding of cell heterogeneity and disease progression in the male genitourinary system. However, complex processing and unprofessional analytical annotations limit the daily use and widely sharing of published datasets. Objectives: Single-cell sequencing data of male-specific tissues and organs. Materials and methods: The data were downloaded from published studies and were processed based on the Seurat R package, including quality control, cell clustering, reduction and graph generation, and cell type annotation were differentiated by referring to the related paper or recognized cell markers. Input and visual results output through the Shiny package, which was loaded into the remote server. Results: The current version of the Male Health Atlas database includes two species (human and mouse), five male-specific tissues and organs (testis, epididymis, vas deferens, corpus cavernosum, and prostate), and eight major cell types, with a total of 57 samples and 258,428 single-cell profiles. The results were divided into two main parts: Cell Clustering and Gene Display. In Cell Clustering section, visitors are free to change cell dimensionality reduction (t-distributed stochastic neighbor embedding, or uniform manifold approximation and projection), color palette, and annotation (cell type or sample type). The Gene Display section includes a reduced dimension scatter plot, violin plot, and bubble plot. Visitors can easily view the expression characteristics of single or multiple genes, and compare the expression differences between different cell types or groups. Discussion and conclusion: Male Health Atlas is the first single-cell database website in the field of andrology and male reproduction, providing researchers with single-cell sequencing resources and an accessible tool. Male Health Atlas is freely available at http://malehealthatlas.cn/.",
                "authors": [
                    {
                        "name": "Dai Y."
                    },
                    {
                        "name": "Li Z."
                    },
                    {
                        "name": "Tang Y."
                    },
                    {
                        "name": "Yao C."
                    },
                    {
                        "name": "Zhao L."
                    },
                    {
                        "name": "Zhao Y."
                    }
                ],
                "citationCount": 5,
                "date": "2023-09-01T00:00:00Z",
                "journal": "Andrology",
                "title": "MHA, an interactive website for scRNA-seq data of male genitourinary development and disease"
            },
            "pmid": "36710661"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Reproductive health",
            "uri": "http://edamontology.org/topic_3420"
        },
        {
            "term": "Urology and nephrology",
            "uri": "http://edamontology.org/topic_3422"
        }
    ]
}
