{
    "accessibility": "Open access",
    "additionDate": "2022-08-13T08:59:30.589195Z",
    "biotoolsCURIE": "biotools:coilgen",
    "biotoolsID": "coilgen",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Philipp Amrein",
            "orcidid": "https://orcid.org/0000-0002-0215-1510"
        },
        {
            "name": "Sebastian Littin",
            "orcidid": "https://orcid.org/0000-0002-8190-1761"
        }
    ],
    "description": "The CoilGen Project is a community-based tool for the generation of coil Layouts within the MRI/NMR environment.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein super-secondary structure prediction",
                    "uri": "http://edamontology.org/operation_0268"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Philipp-MR/CoilGen",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2022-08-13T08:59:30.591664Z",
    "license": "GPL-3.0",
    "name": "CoilGen",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1002/MRM.29294",
            "metadata": {
                "abstract": "© 2022 The Authors. Magnetic Resonance in Medicine published by Wiley Periodicals LLC on behalf of International Society for Magnetic Resonance in Medicine.Purpose: An automated algorithm for generating realizable MR gradient and shim coil layouts based on the boundary element method is presented here. The overall goal is to reduce postprocessing effort and thus enable for rapid prototyping of new coil designs. For a given surface mesh and target field, the algorithm generates a connected, non-overlapping wire path. Methods: The proposed algorithm consists of several steps: Stream function optimization, two-dimensional surface projection, potential discretization, topological contour sorting, opening and interconnecting contours, and finally adding non-overlapping return paths. Several technical parameters such as current strength, inductance and field accuracy are assessed for quality control. Results: The proposed method is successfully demonstrated in four different examples. All exemplary results demonstrate high accuracy with regard to reaching the respective target field. The optimal discretization for a given stream function is found by generating multiple layouts while varying the input parameter values. Conclusion: The presented algorithm allows for a rapid generation of interconnected coil layouts with high flexibility and low discretization error. This enables to reduce the overall post-processing effort. The source code of this work is publicly available (https://github.com/Philipp-MR/CoilGen).",
                "authors": [
                    {
                        "name": "Amrein P."
                    },
                    {
                        "name": "Jia F."
                    },
                    {
                        "name": "Littin S."
                    },
                    {
                        "name": "Zaitsev M."
                    }
                ],
                "date": "2022-09-01T00:00:00Z",
                "journal": "Magnetic Resonance in Medicine",
                "title": "CoilGen: Open-source MR coil layout generator"
            },
            "pmid": "35526237"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        },
        {
            "term": "NMR",
            "uri": "http://edamontology.org/topic_0593"
        }
    ],
    "validated": 1
}
