{
    "additionDate": "2022-10-07T08:25:02.426719Z",
    "biotoolsCURIE": "biotools:clover_cluster",
    "biotoolsID": "clover_cluster",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Guanjin Qu"
        },
        {
            "name": "Huaming Wu"
        }
    ],
    "description": "An Efficient DNA Clustering algorithm based on Tree Structure.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Guanjinqu/Clover",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-10-07T08:25:02.429223Z",
    "license": "GPL-3.0",
    "name": "Clover",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1093/BIB/BBAC336",
            "metadata": {
                "abstract": "© The Author(s) 2022. Published by Oxford University Press. All rights reserved. For Permissions, please email: journals.permissions@oup.com.Deoxyribonucleic acid (DNA)-based data storage is a promising new storage technology which has the advantage of high storage capacity and long storage time compared with traditional storage media. However, the synthesis and sequencing process of DNA can randomly generate many types of errors, which makes it more difficult to cluster DNA sequences to recover DNA information. Currently, the available DNA clustering algorithms are targeted at DNA sequences in the biological domain, which not only cannot adapt to the characteristics of sequences in DNA storage, but also tend to be unacceptably time-consuming for billions of DNA sequences in DNA storage. In this paper, we propose an efficient DNA clustering method termed Clover for DNA storage with linear computational complexity and low memory. Clover avoids the computation of the Levenshtein distance by using a tree structure for interval-specific retrieval. We argue through theoretical proofs that Clover has standard linear computational complexity, low space complexity, etc. Experiments show that our method can cluster 10 million DNA sequences into 50 000 classes in 10 s and meet an accuracy rate of over 99%. Furthermore, we have successfully completed an unprecedented clustering of 10 billion DNA data on a single home computer and the time consumption still satisfies the linear relationship. Clover is freely available at https://github.com/Guanjinqu/Clover.",
                "authors": [
                    {
                        "name": "Qu G."
                    },
                    {
                        "name": "Wu H."
                    },
                    {
                        "name": "Yan Z."
                    }
                ],
                "date": "2022-09-20T00:00:00Z",
                "journal": "Briefings in bioinformatics",
                "title": "Clover: tree structure-based efficient DNA clustering for DNA-based data storage"
            },
            "pmid": "35975958"
        }
    ],
    "toolType": [
        "Command-line tool",
        "Library"
    ],
    "topic": [
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        }
    ]
}
