{
    "accessibility": "Open access (with restrictions)",
    "additionDate": "2022-07-17T09:37:37.498460Z",
    "biotoolsCURIE": "biotools:autosolvate",
    "biotoolsID": "autosolvate",
    "confidence_flag": "tool",
    "cost": "Free of charge (with restrictions)",
    "credit": [
        {
            "name": "Eugen Hruska",
            "orcidid": "https://orcid.org/0000-0001-5679-8419"
        },
        {
            "name": "Fang Liu",
            "orcidid": "https://orcid.org/0000-0003-1322-4997"
        }
    ],
    "description": "Automated workflow for generating quantum chemistry calculation of explicitly solvated molecules",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://autosolvate.readthedocs.io/en/latest/"
        }
    ],
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://github.com/Liu-group/AutoSolvate",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T15:54:57.676430Z",
    "license": "BSD-3-Clause",
    "name": "AutoSolvate",
    "operatingSystem": [
        "Linux",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1063/5.0084833",
            "metadata": {
                "abstract": "The availability of large, high-quality datasets is crucial for artificial intelligence design and discovery in chemistry. Despite the essential roles of solvents in chemistry, the rapid computational dataset generation of solution-phase molecular properties at the quantum mechanical level of theory was previously hampered by the complicated simulation procedure. Software toolkits that can automate the procedure to set up high-throughput explicit-solvent quantum chemistry (QC) calculations for arbitrary solutes and solvents in an open-source framework are still lacking. We developed AutoSolvate, an open-source toolkit, to streamline the workflow for QC calculation of explicitly solvated molecules. It automates the solvated-structure generation, force field fitting, configuration sampling, and the final extraction of microsolvated cluster structures that QC packages can readily use to predict molecular properties of interest. AutoSolvate is available through both a command line interface and a graphical user interface, making it accessible to the broader scientific community. To improve the quality of the initial structures generated by AutoSolvate, we investigated the dependence of solute-solvent closeness on solute/solvent identities and trained a machine learning model to predict the closeness and guide initial structure generation. Finally, we tested the capability of AutoSolvate for rapid dataset curation by calculating the outer-sphere reorganization energy of a large dataset of 166 redox couples, which demonstrated the promise of the AutoSolvate package for chemical discovery efforts.",
                "authors": [
                    {
                        "name": "Gale A."
                    },
                    {
                        "name": "Hruska E."
                    },
                    {
                        "name": "Huang X."
                    },
                    {
                        "name": "Liu F."
                    }
                ],
                "citationCount": 12,
                "date": "2022-03-28T00:00:00Z",
                "journal": "Journal of Chemical Physics",
                "title": "AutoSolvate: A toolkit for automating quantum chemistry design and discovery of solvated molecules"
            },
            "pmid": "35364887"
        }
    ],
    "toolType": [
        "Workflow"
    ],
    "topic": [
        {
            "term": "Chemistry",
            "uri": "http://edamontology.org/topic_3314"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Molecular biology",
            "uri": "http://edamontology.org/topic_3047"
        }
    ],
    "validated": 1
}
