{
    "accessibility": "Open access",
    "additionDate": "2022-06-08T15:06:38.183927Z",
    "biotoolsCURIE": "biotools:studierfenster",
    "biotoolsID": "studierfenster",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "egger@tugraz.at",
            "name": "Jan Egger",
            "typeEntity": "Person"
        },
        {
            "name": "Antonio Pepe"
        },
        {
            "name": "Daniel Wild"
        }
    ],
    "description": "An Open Science Cloud-Based Medical Imaging Analysis Platform.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                },
                {
                    "term": "Parsing",
                    "uri": "http://edamontology.org/operation_1812"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "http://studierfenster.icg.tugraz.at",
    "lastUpdate": "2022-06-08T15:06:38.186532Z",
    "name": "Studierfenster",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1007/S10278-021-00574-8",
            "metadata": {
                "abstract": "© 2022, The Author(s) under exclusive licence to Society for Imaging Informatics in Medicine.Imaging modalities such as computed tomography (CT) and magnetic resonance imaging (MRI) are widely used in diagnostics, clinical studies, and treatment planning. Automatic algorithms for image analysis have thus become an invaluable tool in medicine. Examples of this are two- and three-dimensional visualizations, image segmentation, and the registration of all anatomical structure and pathology types. In this context, we introduce Studierfenster (www.studierfenster.at): a free, non-commercial open science client-server framework for (bio-)medical image analysis. Studierfenster offers a wide range of capabilities, including the visualization of medical data (CT, MRI, etc.) in two-dimensional (2D) and three-dimensional (3D) space in common web browsers, such as Google Chrome, Mozilla Firefox, Safari, or Microsoft Edge. Other functionalities are the calculation of medical metrics (dice score and Hausdorff distance), manual slice-by-slice outlining of structures in medical images, manual placing of (anatomical) landmarks in medical imaging data, visualization of medical data in virtual reality (VR), and a facial reconstruction and registration of medical data for augmented reality (AR). More sophisticated features include the automatic cranial implant design with a convolutional neural network (CNN), the inpainting of aortic dissections with a generative adversarial network, and a CNN for automatic aortic landmark detection in CT angiography images. A user study with medical and non-medical experts in medical image analysis was performed, to evaluate the usability and the manual functionalities of Studierfenster. When participants were asked about their overall impression of Studierfenster in an ISO standard (ISO-Norm) questionnaire, a mean of 6.3 out of 7.0 possible points were achieved. The evaluation also provided insights into the results achievable with Studierfenster in practice, by comparing these with two ground truth segmentations performed by a physician of the Medical University of Graz in Austria. In this contribution, we presented an online environment for (bio-)medical image analysis. In doing so, we established a client-server-based architecture, which is able to process medical data, especially 3D volumes. Our online environment is not limited to medical applications for humans. Rather, its underlying concept could be interesting for researchers from other fields, in applying the already existing functionalities or future additional implementations of further image processing applications. An example could be the processing of medical acquisitions like CT or MRI from animals [Clinical Pharmacology & Therapeutics, 84(4):448–456, 68], which get more and more common, as veterinary clinics and centers get more and more equipped with such imaging devices. Furthermore, applications in entirely non-medical research in which images/volumes need to be processed are also thinkable, such as those in optical measuring techniques, astronomy, or archaeology.",
                "authors": [
                    {
                        "name": "Bedoya C.A.R."
                    },
                    {
                        "name": "Dionysio C."
                    },
                    {
                        "name": "Egger J."
                    },
                    {
                        "name": "Gsaxner C."
                    },
                    {
                        "name": "Jin Y."
                    },
                    {
                        "name": "Karner F."
                    },
                    {
                        "name": "Krobath D."
                    },
                    {
                        "name": "Li J."
                    },
                    {
                        "name": "Pepe A."
                    },
                    {
                        "name": "Prutsch A."
                    },
                    {
                        "name": "Schmied M."
                    },
                    {
                        "name": "Weber M."
                    },
                    {
                        "name": "Wild D."
                    }
                ],
                "citationCount": 1,
                "date": "2022-04-01T00:00:00Z",
                "journal": "Journal of Digital Imaging",
                "title": "Studierfenster: an Open Science Cloud-Based Medical Imaging Analysis Platform"
            },
            "pmcid": "PMC8782222",
            "pmid": "35064372"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        },
        {
            "term": "Surgery",
            "uri": "http://edamontology.org/topic_3421"
        },
        {
            "term": "Tomography",
            "uri": "http://edamontology.org/topic_3452"
        },
        {
            "term": "Veterinary medicine",
            "uri": "http://edamontology.org/topic_3397"
        }
    ]
}
