{
    "accessibility": "Open access",
    "additionDate": "2019-08-11T12:10:43Z",
    "biotoolsCURIE": "biotools:CORGi",
    "biotoolsID": "CORGi",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "Kocher.JeanPierre@mayo.edu",
            "name": "J. P. Kocher",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "CORGi (COmplex Rearrangement detection with Graph-search), a method for the detection and visualization of complex local genomic rearrangements.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/zstephens/CORGi/blob/master/README.md"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Indel detection",
                    "uri": "http://edamontology.org/operation_0452"
                },
                {
                    "term": "Base-calling",
                    "uri": "http://edamontology.org/operation_3185"
                }
            ]
        }
    ],
    "homepage": "https://github.com/zstephens/CORGi",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-06-16T10:55:24Z",
    "license": "Unlicense",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/zstephens/CORGi/issues"
        }
    ],
    "maturity": "Mature",
    "name": "CORGi",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "Ruta",
    "publication": [
        {
            "doi": "10.1186/s12859-018-2539-x",
            "metadata": {
                "abstract": "© 2018 The Author(s).Background: With applications in cancer, drug metabolism, and disease etiology, understanding structural variation in the human genome is critical in advancing the thrusts of individualized medicine. However, structural variants (SVs) remain challenging to detect with high sensitivity using short read sequencing technologies. This problem is exacerbated when considering complex SVs comprised of multiple overlapping or nested rearrangements. Longer reads, such as those from Pacific Biosciences platforms, often span multiple breakpoints of such events, and thus provide a way to unravel small-scale complexities in SVs with higher confidence. Results: We present CORGi (COmplex Rearrangement detection with Graph-search), a method for the detection and visualization of complex local genomic rearrangements. This method leverages the ability of long reads to span multiple breakpoints to untangle SVs that appear very complicated with respect to a reference genome. We validated our approach against both simulated long reads, and real data from two long read sequencing technologies. We demonstrate the ability of our method to identify breakpoints inserted in synthetic data with high accuracy, and the ability to detect and plot SVs from NA12878 germline, achieving 88.4% concordance between the two sets of sequence data. The patterns of complexity we find in many NA12878 SVs match known mechanisms associated with DNA replication and structural variant formation, and highlight the ability of our method to automatically label complex SVs with an intuitive combination of adjacent or overlapping reference transformations. Conclusions: CORGi is a method for interrogating genomic regions suspected to contain local rearrangements using long reads. Using pairwise alignments and graph search CORGi produces labels and visualizations for local SVs of arbitrary complexity.",
                "authors": [
                    {
                        "name": "Stephens Z."
                    },
                    {
                        "name": "Wang C."
                    },
                    {
                        "name": "Iyer R.K."
                    },
                    {
                        "name": "Kocher J.-P."
                    }
                ],
                "citationCount": 5,
                "date": "2018-12-21T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Detection and visualization of complex structural variants from long reads"
            },
            "pmcid": "PMC6302372",
            "pmid": "30577744",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "DNA structural variation",
            "uri": "http://edamontology.org/topic_3175"
        },
        {
            "term": "Endocrinology and metabolism",
            "uri": "http://edamontology.org/topic_3407"
        }
    ],
    "validated": 1
}