{
    "additionDate": "2023-02-20T17:11:29.353190Z",
    "biotoolsCURIE": "biotools:endecon",
    "biotoolsID": "endecon",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "zhangxf@ccnu.edu.cn",
            "name": "Xiao-Fei Zhang",
            "orcidid": "https://orcid.org/0000-0002-5052-9725",
            "typeEntity": "Person"
        }
    ],
    "description": "Cell type deconvolution of spatially resolved transcriptomics data via ensemble learning.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Deisotoping",
                    "uri": "http://edamontology.org/operation_3629"
                },
                {
                    "term": "Gene expression profiling",
                    "uri": "http://edamontology.org/operation_0314"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Zhangxf-ccnu/EnDecon",
    "language": [
        "Python",
        "R"
    ],
    "lastUpdate": "2023-02-20T17:11:29.355834Z",
    "license": "Not licensed",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/SunXQlab/EnDecon"
        },
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/SunXQlab/ST-deconvoulution"
        }
    ],
    "name": "EnDecon",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAC805",
            "metadata": {
                "abstract": "© The Author(s) 2022. Published by Oxford University Press.MOTIVATION: The rapid development of spatial transcriptomics (ST) approaches has provided new insights into understanding tissue architecture and function. However, the gene expressions measured at a spot may contain contributions from multiple cells due to the low-resolution of current ST technologies. Although many computational methods have been developed to disentangle discrete cell types from spatial mixtures, the community lacks a thorough evaluation of the performance of those deconvolution methods. RESULTS: Here, we present a comprehensive benchmarking of 14 deconvolution methods on four datasets. Furthermore, we investigate the robustness of different methods to sequencing depth, spot size and the choice of normalization. Moreover, we propose a new ensemble learning-based deconvolution method (EnDecon) by integrating multiple individual methods for more accurate deconvolution. The major new findings include: (i) cell2loction, RCTD and spatialDWLS are more accurate than other ST deconvolution methods, based on the evaluation of three metrics: RMSE, PCC and JSD; (ii) cell2location and spatialDWLS are more robust to the variation of sequencing depth than RCTD; (iii) the accuracy of the existing methods tends to decrease as the spot size becomes smaller; (iv) most deconvolution methods perform best when they normalize ST data using the method described in their original papers; and (v) the integrative method, EnDecon, could achieve more accurate ST deconvolution. Our study provides valuable information and guideline for practically applying ST deconvolution tools and developing new and more effective methods. AVAILABILITY AND IMPLEMENTATION: The benchmarking pipeline is available at https://github.com/SunXQlab/ST-deconvoulution. An R package for EnDecon is available at https://github.com/SunXQlab/EnDecon. SUPPLEMENTARY INFORMATION: Supplementary data are available at Bioinformatics online.",
                "authors": [
                    {
                        "name": "Sun X."
                    },
                    {
                        "name": "Yan L."
                    }
                ],
                "date": "2023-01-01T00:00:00Z",
                "journal": "Bioinformatics (Oxford, England)",
                "title": "Benchmarking and integration of methods for deconvoluting spatial transcriptomic data"
            },
            "pmcid": "PMC9825747",
            "pmid": "36515467",
            "type": [
                "Benchmarking study"
            ]
        },
        {
            "doi": "10.1093/BIOINFORMATICS/BTAC825",
            "metadata": {
                "abstract": "© The Author(s) 2022. Published by Oxford University Press.MOTIVATION: Spatially resolved gene expression profiles are the key to exploring the cell type spatial distributions and understanding the architecture of tissues. Many spatially resolved transcriptomics (SRT) techniques do not provide single-cell resolutions, but they measure gene expression profiles on captured locations (spots) instead, which are mixtures of potentially heterogeneous cell types. Currently, several cell-type deconvolution methods have been proposed to deconvolute SRT data. Due to the different model strategies of these methods, their deconvolution results also vary. RESULTS: Leveraging the strengths of multiple deconvolution methods, we introduce a new weighted ensemble learning deconvolution method, EnDecon, to predict cell-type compositions on SRT data in this work. EnDecon integrates multiple base deconvolution results using a weighted optimization model to generate a more accurate result. Simulation studies demonstrate that EnDecon outperforms the competing methods and the learned weights assigned to base deconvolution methods have high positive correlations with the performances of these base methods. Applied to real datasets from different spatial techniques, EnDecon identifies multiple cell types on spots, localizes these cell types to specific spatial regions and distinguishes distinct spatial colocalization and enrichment patterns, providing valuable insights into spatial heterogeneity and regionalization of tissues. AVAILABILITY AND IMPLEMENTATION: The source code is available at https://github.com/Zhangxf-ccnu/EnDecon. SUPPLEMENTARY INFORMATION: Supplementary data are available at Bioinformatics online.",
                "authors": [
                    {
                        "name": "Li H.-S."
                    },
                    {
                        "name": "Tu J.-J."
                    },
                    {
                        "name": "Yan H."
                    },
                    {
                        "name": "Zhang X.-F."
                    }
                ],
                "date": "2023-01-01T00:00:00Z",
                "journal": "Bioinformatics (Oxford, England)",
                "title": "EnDecon: cell type deconvolution of spatially resolved transcriptomics data via ensemble learning"
            },
            "pmcid": "PMC9825263",
            "pmid": "36548388",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ]
}
