{"credit":[{"name":"Biomarker group","typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://www.biomarker.com.cn/"},{"email":"highmap@biomarker.com.cn","name":"Support","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"http://highmap.biomarker.com.cn/"}],"function":[{"operation":[{"term":"Genetic mapping","uri":"http://edamontology.org/operation_0282"}]}],"labels":{"operatingSystem":["Linux","Windows","Mac"],"toolType":["Web application"],"topic":[{"term":"Genetics","uri":"http://edamontology.org/topic_3053"},{"term":"Molecular interactions, pathways and networks","uri":"http://edamontology.org/topic_0602"},{"term":"Mapping","uri":"http://edamontology.org/topic_0102"},{"term":"Sequence analysis","uri":"http://edamontology.org/topic_0080"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/highmap-construction-and-analysis-of-high-density-linkage-map.html"}],"publication":[{"abstract":"Linkage maps enable the study of important biological questions. The construction of high-density linkage maps appears more feasible since the advent of next-generation sequencing (NGS), which eases SNP discovery and high-throughput genotyping of large population. However, the marker number explosion and genotyping errors from NGS data challenge the computational efficiency and linkage map quality of linkage study methods. Here we report the HighMap method for constructing high-density linkage maps from NGS data. HighMap employs an iterative ordering and error correction strategy based on a k-nearest neighbor algorithm and a Monte Carlo multipoint maximum likelihood algorithm. Simulation study shows HighMap can create a linkage map with three times as many markers as ordering-only methods while offering more accurate marker orders and stable genetic distances. Using HighMap, we constructed a common carp linkage map with 10,004 markers. The singleton rate was less than one-ninth of that generated by JoinMap4.1. Its total map distance was 5,908 cM, consistent with reports on low-density maps. HighMap is an efficient method for constructing high-density, high-quality linkage maps from high-throughput population NGS data. It will facilitate genome assembling, comparative genomic analysis, and QTL studies. HighMap is available at http://highmap.biomarker.com. cn/. © 2014 Liu et al.","authors":["Liu D.","Ma C.","Hong W.","Huang L.","Liu M.","Liu H.","Zeng H.","Deng D.","Xin H.","Song J.","Xu C.","Sun X.","Hou X.","Wang X.","Zheng H."],"cit_count":84,"journal":"PLoS ONE","pmid":"24905985","title":"Construction and analysis of high-density linkage map using high-throughput sequencing data","year":"2014-06-06"}],"summary":{"biotoolsCURIE":"biotools:highmap","biotoolsID":"highmap","description":"Software suitable for genetic map. This software utilized maximum likelihood and smooth algorithm, and could deal with ten thousand markers that make map distance more stably.","homepage":"http://highmap.biomarker.com.cn/","name":"HighMap"}}