{
    "additionDate": "2022-10-30T09:56:46.357266Z",
    "biotoolsCURIE": "biotools:chembioport",
    "biotoolsID": "chembioport",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "matthieu.schapira@utoronto.ca",
            "name": "Matthieu Schapira",
            "typeEntity": "Person"
        },
        {
            "name": "Evianne Rovers"
        },
        {
            "name": "Lihua Liu"
        }
    ],
    "description": "An integrative platform to navigate the biology, structure and chemical inhibition of human proteins.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene expression profiling",
                    "uri": "http://edamontology.org/operation_0314"
                },
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                },
                {
                    "term": "Small molecule design",
                    "uri": "http://edamontology.org/operation_4009"
                }
            ]
        }
    ],
    "homepage": "https://chembioport.thesgc.org",
    "lastUpdate": "2024-11-24T15:25:19.733386Z",
    "license": "Not licensed",
    "name": "ChemBioPort",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1093/database/baac088",
            "metadata": {
                "abstract": "Chemical probes are important tools to investigate the function of proteins, evaluate their potential as therapeutic targets and provide chemical starting points for drug discovery. As a result, a growing federation of scientists aims to generate chemical probes for all human druggable proteins. A diverse array of data typically guides target selection and chemical probe discovery: information on protein function can help prioritize targets, domain architecture can provide insight on druggability, structural data enables molecular design and existing chemical ligands can serve as foundation or inspiration for chemical probe development. But these heterogenous data types are dispersed across a variety of public repositories that are difficult to cross-reference by non-experts. We developed ChemBioPort, an online resource that allows users to combine queries related to the ontology, domain architecture or name of human proteins to produce downloadable tables that integrate information on function, disease association, essentiality, tissue enrichment, domain architecture, structure and chemical ligands of proteins. Users can convert these tables into dendrograms reflecting sequence similarity, onto which they can graphically project all data types, linked via a mouse-click to their original repositories or published articles. This interface will support the growing community of chemical biologists, chemists, cell and structural biologists on their perilous journey from genes to medicines. Database URL: https://chembioport.thesgc.org",
                "authors": [
                    {
                        "name": "Liu L."
                    },
                    {
                        "name": "Rovers E."
                    },
                    {
                        "name": "Schapira M."
                    }
                ],
                "citationCount": 3,
                "date": "2022-01-01T00:00:00Z",
                "journal": "Database",
                "title": "ChemBioPort: An online portal to navigate the structure, function and chemical inhibition of the human proteome"
            },
            "pmcid": "PMC9513561",
            "pmid": "36164975"
        }
    ],
    "toolType": [
        "Database portal",
        "Web application"
    ],
    "topic": [
        {
            "term": "Drug discovery",
            "uri": "http://edamontology.org/topic_3336"
        },
        {
            "term": "Human biology",
            "uri": "http://edamontology.org/topic_2815"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ],
    "validated": 1
}
