{
    "additionDate": "2020-01-09T18:00:48Z",
    "biotoolsCURIE": "biotools:Hyppo-X",
    "biotoolsID": "Hyppo-X",
    "confidence_flag": "tool",
    "description": "A Scalable Exploratory Framework for Analyzing Complex Phenomics Data.\n\nA header only software library helps to visually discover the insights of high dimensional complex data set.\n\nWe can represent the category of points in a cluster using a pie chart. In our Hyppo-X framework, we have capability to define a category of a point using single or multiple columns of the dataset. Pie chart shows the percentage distribution of points among all categories. For instance, for the above sample dataset, we can define the locaion column named Loc as the category of all the points then we will get following graphs. Here, blue color indicates points those belong in location N and red color indicates points those belong in location K. This graph with pie chart node helps us to understand the behavior of points with respect to two locations.\n\nThis software library is built to delve the insights of a complex high dimensional dataset",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Genetic mapping",
                    "uri": "http://edamontology.org/operation_0282"
                },
                {
                    "term": "Parsing",
                    "uri": "http://edamontology.org/operation_1812"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://xperthut.github.io/HYPPO-X",
    "lastUpdate": "2020-12-11T08:07:45Z",
    "name": "Hyppo-X",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1109/TCBB.2019.2947500",
            "metadata": {
                "abstract": "© 2004-2012 IEEE.Phenomics is an emerging branch of modern biology that uses high throughput phenotyping tools to capture multiple environmental and phenotypic traits, often at massive spatial and temporal scales. The resulting high dimensional data represent a treasure trove of information for providing an in-depth understanding of how multiple factors interact and contribute to the overall growth and behavior of different genotypes. However, computational tools that can parse through such complex data and aid in extracting plausible hypotheses are currently lacking. In this article, we present Hyppo-X, a new algorithmic approach to visually explore complex phenomics data and in the process characterize the role of environment on phenotypic traits. We model the problem as one of unsupervised structure discovery, and use emerging principles from algebraic topology and graph theory for discovering higher-order structures of complex phenomics data. We present an open source software which has interactive visualization capabilities to facilitate data navigation and hypothesis formulation. We test and evaluate Hyppo-X on two real-world plant (maize) data sets. Our results demonstrate the ability of our approach to delineate divergent subpopulation-level behavior. Notably, our approach shows how environmental factors could influence phenotypic behavior, and how that effect varies across different genotypes and different time scales. To the best of our knowledge, this effort provides one of the first approaches to systematically formalize the problem of hypothesis extraction for phenomics data. Considering the infancy of the phenomics field, tools that help users explore complex data and extract plausible hypotheses in a data-guided manner will be critical to future advancements in the use of such data.",
                "authors": [
                    {
                        "name": "Hey S."
                    },
                    {
                        "name": "Kalyanaraman A."
                    },
                    {
                        "name": "Kamruzzaman M."
                    },
                    {
                        "name": "Krishnamoorthy B."
                    },
                    {
                        "name": "Schnable P.S."
                    }
                ],
                "citationCount": 1,
                "date": "2021-07-01T00:00:00Z",
                "journal": "IEEE/ACM Transactions on Computational Biology and Bioinformatics",
                "title": "Hyppo-X: A Scalable Exploratory Framework for Analyzing Complex Phenomics Data"
            },
            "pmid": "31647442"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Mathematics",
            "uri": "http://edamontology.org/topic_3315"
        },
        {
            "term": "Phenomics",
            "uri": "http://edamontology.org/topic_3298"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        }
    ],
    "validated": 1
}
