{
    "additionDate": "2022-08-19T19:30:10.074031Z",
    "biotoolsCURIE": "biotools:dleb",
    "biotoolsID": "dleb",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "jbkim@konkuk.ac.kr",
            "name": "Jaebum Kim",
            "orcidid": "https://orcid.org/0000-0002-8772-7071",
            "typeEntity": "Person"
        },
        {
            "name": "Suyeon Wy"
        }
    ],
    "description": "A web application for building deep learning models in biological research.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Feature extraction",
                    "uri": "http://edamontology.org/operation_3937"
                },
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                }
            ]
        }
    ],
    "homepage": "http://dleb.konkuk.ac.kr/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-08-19T19:30:10.076572Z",
    "license": "Not licensed",
    "name": "DLEB",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1093/NAR/GKAC369",
            "metadata": {
                "abstract": "© 2022 The Author(s). Published by Oxford University Press on behalf of Nucleic Acids Research.Deep learning has been applied for solving many biological problems, and it has shown outstanding performance. Applying deep learning in research requires knowledge of deep learning theories and programming skills, but researchers have developed diverse deep learning platforms to allow users to build deep learning models without programming. Despite these efforts, it is still difficult for biologists to use deep learning because of limitations of the existing platforms. Therefore, a new platform is necessary that can solve these challenges for biologists. To alleviate this situation, we developed a user-friendly and easy-to-use web application called DLEB (Deep Learning Editor for Biologists) that allows for building deep learning models specialized for biologists. DLEB helps researchers (i) design deep learning models easily and (ii) generate corresponding Python code to run directly in their machines. DLEB provides other useful features for biologists, such as recommending deep learning models for specific learning tasks and data, pre-processing of input biological data, and availability of various template models and example biological datasets for model training. DLEB can serve as a highly valuable platform for easily applying deep learning to solve many important biological problems. DLEB is freely available at http://dleb.konkuk.ac.kr/.",
                "authors": [
                    {
                        "name": "Kim J."
                    },
                    {
                        "name": "Kwon D."
                    },
                    {
                        "name": "Kwon K."
                    },
                    {
                        "name": "Wy S."
                    }
                ],
                "date": "2022-07-05T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "DLEB: a web application for building deep learning models in biological research"
            },
            "pmcid": "PMC9252827",
            "pmid": "35552439"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ]
}
