{
    "additionDate": "2021-01-18T10:25:21Z",
    "biotoolsCURIE": "biotools:netsets",
    "biotoolsID": "netsets",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "sharmila.mande@tcs.com",
            "name": "Sharmila S Mande",
            "typeEntity": "Person"
        }
    ],
    "description": "A JavaScript framework for compositional assessment and comparison of biological networks through Venn integrated Network diagrams.\n\nVenn diagrams are frequently used to compare composition of datasets (e.g. datasets containing list of proteins and genes). \nNetwork diagram constructed using such datasets are usually generated using 'list of edges', popularly known as edge-lists. \nAn edge-list and the corresponding generated network are however composed of two elements, namely, edges (e.g. protein-protein interactions) and nodes (e.g. proteins). Researchers often use individual lists of edges and nodes to compare composition of biological networks using existing Venn diagram tools.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Network visualisation",
                    "uri": "http://edamontology.org/operation_3925"
                },
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                }
            ]
        }
    ],
    "homepage": "http://web.rniapps.net/netsets",
    "language": [
        "JavaScript"
    ],
    "lastUpdate": "2021-03-08T13:45:01Z",
    "name": "NetSets",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAA723",
            "metadata": {
                "abstract": "© 2020 The Author(s) 2020. Published by Oxford University Press. All rights reserved.Motivation: Venn diagrams are frequently used to compare composition of datasets (e.g. datasets containing list of proteins and genes). Network diagram constructed using such datasets are usually generated using 'list of edges', popularly known as edge-lists. An edge-list and the corresponding generated network are, however, composed of two elements, namely, edges (e.g. protein-protein interactions) and nodes (e.g. proteins). Researchers often use individual lists of edges and nodes to compare composition of biological networks using existing Venn diagram tools. However, specialized analysis workflows are required for comparison of nodes as well as edges. Apart from this, different tools or graph libraries are needed for visualizing any specific edges of interest (e.g. protein-protein interactions which are present across all networks or are shared between subset of networks or are exclusively present in a selected network). Further, these results are required to be exported in the form of publication worthy network diagram(s), particularly for small networks. Results: We introduce a (server independent) JavaScript framework (called NetSets.js) that integrates popular Venn and network diagrams in a single application. A free to use intuitive web application (utilizing NetSets.js), specifically designed to perform both compositional comparisons (e.g. for identifying common/exclusive edges or nodes) and interactive user defined visualizations of network (for the identified common/exclusive interactions across multiple networks) using simple edge-lists is also presented. The tool also enables connection to Cytoscape desktop application using the Netsets-Cyapp. We demonstrate the utility of our tool using real world biological networks (microbiome, gene interaction, multiplex and protein-protein interaction networks). Availabilityand implementation: Http://web.rniapps.net/netsets (freely available for academic use).",
                "authors": [
                    {
                        "name": "Nagpal S."
                    },
                    {
                        "name": "Kuntal B.K."
                    },
                    {
                        "name": "Mande S.S."
                    }
                ],
                "citationCount": 1,
                "date": "2021-02-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "NetSets.js: A JavaScript framework for compositional assessment and comparison of biological networks through Venn-integrated network diagrams"
            },
            "pmid": "32805035"
        }
    ],
    "toolType": [
        "Web application",
        "Web service"
    ],
    "topic": [
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "Microbial ecology",
            "uri": "http://edamontology.org/topic_3697"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ]
}