{
    "additionDate": "2021-01-18T08:06:52Z",
    "biotoolsCURIE": "biotools:i-tree_cool_river",
    "biotoolsID": "i-tree_cool_river",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "rabdi@mines.edu",
            "name": "Reza Abdi",
            "typeEntity": "Person"
        }
    ],
    "description": "An open source, freeware tool to simulate river water temperature coupled with HEC-RAS.\n\nThis method paper explains the i-Tree Cool River model algorithms for simulating the response of river water temperature to urban greening. The model captures the warming and cooling impacts of urban development and restoration through a water and energy budget. The water budget includes river inflows from urban storm sewers and reservoirs, and the associated water temperatures. The energy budget adjusts radiation fluxes due to riparian shading and evapotranspiration, and propagates temperature downstream. Restorative cooling of the river can be simulated through algorithms for cool groundwater, either as direct inflows or by river water replacement called hyporheic exchange",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Modelling and simulation",
                    "uri": "http://edamontology.org/operation_2426"
                },
                {
                    "term": "Molecular surface calculation",
                    "uri": "http://edamontology.org/operation_0387"
                }
            ]
        }
    ],
    "homepage": "https://www.itreetools.org/tools/research-suite/",
    "language": [
        "C++"
    ],
    "lastUpdate": "2021-03-18T09:21:55.189237Z",
    "name": "i-Tree Cool River",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1016/J.MEX.2020.100808",
            "metadata": {
                "abstract": "© 2020This method paper explains the i-Tree Cool River model algorithms for simulating the response of river water temperature to urban greening. The model captures the warming and cooling impacts of urban development and restoration through a water and energy budget. The water budget includes river inflows from urban storm sewers and reservoirs, and the associated water temperatures. The energy budget adjusts radiation fluxes due to riparian shading and evapotranspiration, and propagates temperature downstream. Restorative cooling of the river can be simulated through algorithms for cool groundwater, either as direct inflows or by river water replacement called hyporheic exchange. Novel features in the model include diurnal variation in riparian shading, use of the Army Corps of Engineers HEC-RAS model predicted river depths and velocities, and periodic boundary conditions to rapidly extend restoration scenarios. • Freely available code in C++ for Visual Studio, with a detailed manual and sample inputs and outputs at http://www.itreetools.org/research_suite/coolriver. • Useful for simulating river warming or cooling due to urban development or greening. • Well documented source code compatible with requirements of other modeling groups.",
                "authors": [
                    {
                        "name": "Abdi R."
                    },
                    {
                        "name": "Endreny T."
                    },
                    {
                        "name": "Nowak D."
                    }
                ],
                "citationCount": 1,
                "date": "2020-01-01T00:00:00Z",
                "journal": "MethodsX",
                "title": "i-Tree cool river: An open source, freeware tool to simulate river water temperature coupled with HEC-RAS"
            },
            "pmcid": "PMC7063232",
            "pmid": "32181151"
        }
    ],
    "toolType": [
        "Suite"
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        }
    ]
}