{
    "accessibility": "Open access",
    "additionDate": "2021-11-08T12:50:56.440220Z",
    "biotoolsCURIE": "biotools:gcsenet",
    "biotoolsID": "gcsenet",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "lizhong@zstu.edu.cn",
            "name": "Zhong Li",
            "orcidid": "https://orcid.org/0000-0002-2730-6427",
            "typeEntity": "Person"
        }
    ],
    "description": "GCSENet is a novel learning-based framework for miRNA-disease association identification via graph convolutional neural networks, convolutional neural networks, Squeeze-and-Excitation Networks(SENet).",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "miRNA target prediction",
                    "uri": "http://edamontology.org/operation_0463"
                },
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                },
                {
                    "term": "Promoter prediction",
                    "uri": "http://edamontology.org/operation_0440"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Appleabc123/GCSENet",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-11-08T12:50:56.442896Z",
    "name": "GCSENet",
    "operatingSystem": [
        "Mac",
        "Linux",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PCBI.1009048",
            "metadata": {
                "abstract": "© 2021 Li et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Recently, an increasing number of studies have demonstrated that miRNAs are involved in human diseases, indicating that miRNAs might be a potential pathogenic factor for various diseases. Therefore, figuring out the relationship between miRNAs and diseases plays a critical role in not only the development of new drugs, but also the formulation of individualized diagnosis and treatment. As the prediction of miRNA-disease association via biological experiments is expensive and time-consuming, computational methods have a positive effect on revealing the association. In this study, a novel prediction model integrating GCN, CNN and Squeeze-and-Excitation Networks (GCSENet) was constructed for the identification of miRNA-disease association. The model first captured features by GCN based on a heterogeneous graph including diseases, genes and miRNAs. Then, considering the different effects of genes on each type of miRNA and disease, as well as the different effects of the miRNA-gene and disease-gene relationships on miRNA-disease association, a feature weight was set and a combination of miRNA-gene and disease-gene associations was added as feature input for the convolution operation in CNN. Furthermore, the squeeze and excitation blocks of SENet were applied to determine the importance of each feature channel and enhance useful features by means of the attention mechanism, thus achieving a satisfactory prediction of miRNA-disease association. The proposed method was compared against other state-of-the-art methods. It achieved an AUROC score of 95.02% and an AUPR score of 95.55% in a 10-fold cross-validation, which led to the finding that the proposed method is superior to these popular methods on most of the performance evaluation indexes.",
                "authors": [
                    {
                        "name": "Li Z."
                    },
                    {
                        "name": "Jiang K."
                    },
                    {
                        "name": "Qin S."
                    },
                    {
                        "name": "Zhong Y."
                    },
                    {
                        "name": "Elofsson A."
                    }
                ],
                "date": "2021-06-01T00:00:00Z",
                "journal": "PLoS Computational Biology",
                "title": "GCSENet: A GCN, CNN and SENet ensemble model for microRNA-disease association prediction"
            },
            "pmcid": "PMC8205154",
            "pmid": "34081706"
        }
    ],
    "toolType": [
        "Workbench"
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Biotherapeutics",
            "uri": "http://edamontology.org/topic_3374"
        }
    ]
}