{"credit":[{"email":"mviterson@gmail.com","name":"Maarten van Iterson","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"url":"http://bioconductor.org/packages/release/bioc/html/TurboNorm.html"}],"download":[{"type":"Source code","url":"http://bioconductor/packages/release/bioc/src/contrib/TurboNorm_1.22.0.tar.gz"}],"function":[{"operation":[{"term":"Calculation","uri":"http://edamontology.org/operation_3438"},{"term":"Image analysis","uri":"http://edamontology.org/operation_3443"},{"term":"Image annotation","uri":"http://edamontology.org/operation_3553"}]}],"labels":{"collectionID":["BioConductor"],"language":["R"],"license":"GPL-3.0","operatingSystem":["Linux","Windows","Mac"],"toolType":["Command-line tool","Library"],"topic":[{"term":"Microarray experiment","uri":"http://edamontology.org/topic_3518"},{"term":"Data quality management","uri":"http://edamontology.org/topic_3572"},{"term":"Data visualisation","uri":"http://edamontology.org/topic_0092"}]},"link":[{"type":"MIRROR","url":"http://www.humgen.nl/MicroarrayAnalysisGroup.html"}],"publication":[{"abstract":"Background: Among the most commonly applied microarray normalization methods are intensity-dependent normalization methods such as lowess or loess algorithms. Their computational complexity makes them slow and thus less suitable for normalization of large datasets. Current implementations try to circumvent this problem by using a random subset of the data for normalization, but the impact of this modification has not been previously assessed. We developed a novel intensity-dependent normalization method for microarrays that is fast, simple and can include weighing of observations. Results: Our normalization method is based on the P-spline scatterplot smoother using all data points for normalization. We show that using a random subset of the data for normalization should be avoided as unstable results can be produced. However, in certain cases normalization based on an invariant subset is desirable, for example, when groups of samples before and after intervention are compared. We show in the context of DNA methylation arrays that a constant weighted P-spline normalization yields a more reliable normalization curve than the one obtained by normalization on the invariant subset only. Conclusions: Our novel intensity-dependent normalization method is simpler and faster than current loess algorithms, and can be applied to one- and two-colour array data, similar to normalization based on loess. Availability: An implementation of the method is currently available as an R package called TurboNorm from www.bioconductor.org. © 2012 De Gruyter. All rights reserved.","authors":["Van Iterson M.","Duijkers F.A.M.","Meijerink J.P.P.","Admiraal P.","Van Ommen G.-J.B.","Boer J.M.","Van Noesel M.M.","Menezes R.X."],"cit_count":2,"doi":"10.1515/1544-6115.1753","journal":"Statistical Applications in Genetics and Molecular Biology","pmid":"22850064","title":"A novel and fast normalization method for high-density arrays","type":"Primary","year":"2012-01-01"}],"summary":{"biotoolsCURIE":"biotools:turbonorm","biotoolsID":"turbonorm","description":"An R package for fast scatterplot smoothing suitable for microarray normalization.","homepage":"http://bioconductor.org/packages/release/bioc/html/TurboNorm.html","name":"TurboNorm","version":["1.26.0"]}}