{
    "additionDate": "2021-03-19T08:52:25Z",
    "biotoolsCURIE": "biotools:fdmd",
    "biotoolsID": "fdmd",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "jaime.rubio@ub.edu",
            "name": "Jaime Rubio-Martinez",
            "typeEntity": "Person"
        }
    ],
    "description": "A systematic and efficient method to locate binding sites.\n\n# Fragment-Dissolved-Molecular-Dynamics.\n\nAn efficient method to locate binding sites : Fragment Dissolved Molecular Dynamics (fdMD).",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                },
                {
                    "term": "Binding site prediction",
                    "uri": "http://edamontology.org/operation_2575"
                },
                {
                    "term": "Molecular docking",
                    "uri": "http://edamontology.org/operation_0478"
                },
                {
                    "term": "Molecular dynamics",
                    "uri": "http://edamontology.org/operation_2476"
                },
                {
                    "term": "Small molecule design",
                    "uri": "http://edamontology.org/operation_4009"
                }
            ]
        }
    ],
    "homepage": "https://github.com/DrugDesignUBUJA/fdMD",
    "language": [
        "Python",
        "Shell"
    ],
    "lastUpdate": "2021-03-22T11:34:06Z",
    "license": "BSD-3-Clause",
    "name": "fdMD",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1039/D0CP05471B",
            "metadata": {
                "abstract": "© the Owner Societies 2021.Diverse computational methods to support fragment-based drug discovery (FBDD) are available in the literature. Despite their demonstrated efficacy in supporting FBDD campaigns, they exhibit some drawbacks such as protein denaturation or ligand aggregation that have not yet been clearly overcome in the framework of biomolecular simulations. In the present work, we discuss a systematic semi-automatic novel computational procedure, designed to surpass these difficulties. The method, named fragment dissolved Molecular Dynamics (fdMD), utilizes simulation boxes of solvated small fragments, adding a repulsive Lennard-Jones potential term to avoid aggregation, which can be easily used to solvate the targets of interest. This method has the advantage of solvating the target with a low number of ligands, thus preventing the denaturation of the target, while simultaneously generating a database of ligand-solvated boxes that can be used in further studies. A number of scripts are made available to analyze the results and obtain the descriptors proposed as a means to trustfully discard spurious binding sites. To test our method, four test cases of different complexity have been solvated with ligand boxes and four molecular dynamics runs of 200 ns length have been run for each system, which have been extended up to 1 μs when needed. The reported results point out that the selected number of replicas are enough to identify the correct binding sites irrespective of the initial structure, even in the case of proteins having several close binding sites for the same ligand. We also propose a set of descriptors to analyze the results, among which the average MMGBSA and the averageKDEEPenergies have emerged as the most robust ones.",
                "authors": [
                    {
                        "name": "Bonet J."
                    },
                    {
                        "name": "Granadino-Roldan J.M."
                    },
                    {
                        "name": "Perez J.J."
                    },
                    {
                        "name": "Privat C."
                    },
                    {
                        "name": "Rubio-Martinez J."
                    },
                    {
                        "name": "Santos Tomas M."
                    }
                ],
                "date": "2021-01-28T00:00:00Z",
                "journal": "Physical Chemistry Chemical Physics",
                "title": "Fragment dissolved molecular dynamics: A systematic and efficient method to locate binding sites"
            },
            "pmid": "33491698"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Drug discovery",
            "uri": "http://edamontology.org/topic_3336"
        },
        {
            "term": "Drug metabolism",
            "uri": "http://edamontology.org/topic_3375"
        },
        {
            "term": "Molecular dynamics",
            "uri": "http://edamontology.org/topic_0176"
        },
        {
            "term": "Protein binding sites",
            "uri": "http://edamontology.org/topic_3534"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
