{
    "accessibility": "Open access",
    "additionDate": "2017-02-14T09:35:03Z",
    "biotoolsCURIE": "biotools:variowatch",
    "biotoolsID": "variowatch",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "genepipe@ibms.sinica.edu.tw",
            "typeEntity": "Project",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Disease gene mining browser for association study. It annotates both known SNPs and novel variants using information from public domain websites such as NCBI, UniProt, KEGG and GO.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "SNP annotation",
                    "uri": "http://edamontology.org/operation_3661"
                }
            ]
        }
    ],
    "homepage": "http://grch38.genepipe.ncgm.sinica.edu.tw/variowatch/main.do",
    "lastUpdate": "2020-06-16T10:55:24Z",
    "license": "Unlicense",
    "maturity": "Mature",
    "name": "VarioWatch",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "A human gene association study often involves several genomic markers such as single nucleotide polymorphisms (SNPs) or short tandem repeat polymorphisms, and many statistically significant markers may be identified during the study. GenoWatch can efficiently extract up-to-date information about multiple markers and their associated genes in batch mode from many relevant biological databases in real-time. The comprehensive gene information retrieved includes gene ontology, function, pathway, disease, related articles in PubMed and so on. Subsequent SNP functional impact analysis and primer design of a target gene for re-sequencing can also be done in a few clicks. The presentation of results has been carefully designed to be as intuitive as possible to all users. The GenoWatch is available at the website http://genepipe.ngc.sinica.edu.tw/genowatch.",
                "authors": [
                    {
                        "name": "Chang S.C."
                    },
                    {
                        "name": "Chen Y.H."
                    },
                    {
                        "name": "Chen Y.T."
                    },
                    {
                        "name": "Lin Y.J."
                    },
                    {
                        "name": "Liu C.K."
                    },
                    {
                        "name": "Tsai M.F."
                    },
                    {
                        "name": "Yao A."
                    }
                ],
                "citationCount": 13,
                "date": "2008-01-01T00:00:00Z",
                "journal": "Nucleic acids research",
                "title": "GenoWatch: a disease gene mining browser for association study."
            },
            "pmid": "18440974"
        },
        {
            "metadata": {
                "abstract": "VarioWatch (http://genepipe.ncgm.sinica.edu.tw/variowatch/) has been vastly improved since its former publication GenoWatch in the 2008 Web Server Issue. It is now at least 10000-times faster in annotating a variant. Drastic speed increase, through complete re-design of its working mechanism, makes VarioWatch capable of annotating millions of human genomic variants generated from next generation sequencing in minutes, if not seconds. While using MegaQuery of VarioWatch to quickly annotate variants, users can apply various filters to retrieve a subgroup of variants according to the risk levels, interested regions, etc. that satisfy users' requirements. In addition to performance leap, many new features have also been added, such as annotation on novel variants, functional analyses on splice sites and in/dels, detailed variant information in tabulated form, plus a risk level decision tree regarding the analyzed variant. Up to 1000 target variants can be visualized with our carefully designed Genome View, Gene View, Transcript View and Variation View. Two commonly used reference versions, NCBI build 36.3 and NCBI build 37.2, are supported. VarioWatch is unique in its ability to annotate comprehensively and efficiently millions of variants online, immediately delivering the results in real time, plus visualizes up to 1000 annotated variants. © 2012 The Author(s).",
                "authors": [
                    {
                        "name": "Chen C.-C."
                    },
                    {
                        "name": "Chen Y.-T."
                    },
                    {
                        "name": "Cheng Y.-C."
                    },
                    {
                        "name": "Hsiao F.-C."
                    },
                    {
                        "name": "Lin W.-J."
                    },
                    {
                        "name": "Liu C.-K."
                    },
                    {
                        "name": "Tang C.-Y.L."
                    },
                    {
                        "name": "Tseng H.-C."
                    },
                    {
                        "name": "Wu H.-T."
                    },
                    {
                        "name": "Yao A."
                    },
                    {
                        "name": "Yeh E.-C."
                    }
                ],
                "citationCount": 36,
                "date": "2012-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "VarioWatch: Providing large-scale and comprehensive annotations on human genomic variants in the next generation sequencing era"
            },
            "pmid": "22618869"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Experimental design and studies",
            "uri": "http://edamontology.org/topic_3678"
        },
        {
            "term": "GWAS study",
            "uri": "http://edamontology.org/topic_3517"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        }
    ],
    "validated": 1
}
