{
    "accessibility": "Open access",
    "additionDate": "2022-12-31T00:15:05.074311Z",
    "biotoolsCURIE": "biotools:icardiotoxcsm",
    "biotoolsID": "icardiotoxcsm",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Alex G. C. de Sá"
        },
        {
            "name": "Saba Iftkhar"
        },
        {
            "name": "David B. Ascher",
            "orcidid": "https://orcid.org/0000-0003-2948-2413"
        },
        {
            "name": "Douglas E. V. Pires",
            "orcidid": "https://orcid.org/0000-0002-3004-2119"
        }
    ],
    "description": "A Web Server for Predicting Cardiotoxicity of Small Molecules.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "SMILES string",
                        "uri": "http://edamontology.org/data_2301"
                    }
                }
            ],
            "operation": [
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Small molecule design",
                    "uri": "http://edamontology.org/operation_4009"
                }
            ]
        }
    ],
    "homepage": "https://biosig.lab.uq.edu.au/cardiotoxcsm",
    "lastUpdate": "2024-11-24T15:14:45.701152Z",
    "name": "icardioToxCSM",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1021/acs.jcim.2c00822",
            "metadata": {
                "abstract": "The design of novel, safe, and effective drugs to treat human diseases is a challenging venture, with toxicity being one of the main sources of attrition at later stages of development. Failure due to toxicity incurs a significant increase in costs and time to market, with multiple drugs being withdrawn from the market due to their adverse effects. Cardiotoxicity, for instance, was responsible for the failure of drugs such as fenspiride, propoxyphene, and valdecoxib. While significant effort has been dedicated to mitigate this issue by developing computational approaches that aim to identify molecules likely to be toxic, including quantitative structure-activity relationship models and machine learning methods, current approaches present limited performance and interpretability. To overcome these, we propose a new web-based computational method, cardioToxCSM, which can predict six types of cardiac toxicity outcomes, including arrhythmia, cardiac failure, heart block, hERG toxicity, hypertension, and myocardial infarction, efficiently and accurately. cardioToxCSM was developed using the concept of graph-based signatures, molecular descriptors, toxicophore matchings, and molecular fingerprints, leveraging explainable machine learning, and was validated internally via different cross validation schemes and externally via low-redundancy blind sets. The models presented robust performances with areas under ROC curves of up to 0.898 on 5-fold cross-validation, consistent with metrics on blind tests. Additionally, our models provide interpretation of the predictions by identifying whether substructures that are commonly enriched in toxic compounds were present. We believe cardioToxCSM will provide valuable insight into the potential cardiotoxicity of small molecules early on drug screening efforts. The method is made freely available as a web server at https://biosig.lab.uq.edu.au/cardiotoxcsm.",
                "authors": [
                    {
                        "name": "Aljarf R."
                    },
                    {
                        "name": "Ascher D.B."
                    },
                    {
                        "name": "De Sa A.G.C."
                    },
                    {
                        "name": "Iftkhar S."
                    },
                    {
                        "name": "Pires D.E.V."
                    },
                    {
                        "name": "Velloso J.P.L."
                    }
                ],
                "citationCount": 21,
                "date": "2022-10-24T00:00:00Z",
                "journal": "Journal of Chemical Information and Modeling",
                "title": "CardioToxCSM: A Web Server for Predicting Cardiotoxicity of Small Molecules"
            },
            "pmid": "36219164"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Medicinal chemistry",
            "uri": "http://edamontology.org/topic_0209"
        },
        {
            "term": "Molecular biology",
            "uri": "http://edamontology.org/topic_3047"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ],
    "validated": 1
}
