{
    "additionDate": "2018-05-08T19:54:01Z",
    "biotoolsCURIE": "biotools:ffbskat",
    "biotoolsID": "ffbskat",
    "credit": [
        {
            "email": "gulsvi@mail.ru",
            "name": "G.R. Svishcheva",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "belon@bionet.nsc.ru",
            "name": "N.M. Belonogova",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Fast Family-Based Sequence Kernel Association Test.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://mga.bionet.nsc.ru/soft/FFBSKAT/FFBSKAT-manual.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genetic variation analysis",
                    "uri": "http://edamontology.org/operation_3197"
                }
            ]
        }
    ],
    "homepage": "http://mga.bionet.nsc.ru/soft/FFBSKAT/",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-10T12:58:58Z",
    "license": "GPL-3.0",
    "name": "FFBSKAT",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PONE.0099407",
            "metadata": {
                "abstract": "The kernel machine-based regression is an efficient approach to region-based association analysis aimed at identification of rare genetic variants. However, this method is computationally complex. The running time of kernel-based association analysis becomes especially long for samples with genetic (sub) structures, thus increasing the need to develop new and effective methods, algorithms, and software packages. We have developed a new R-package called fast family-based sequence kernel association test (FFBSKAT) for analysis of quantitative traits in samples of related individuals. This software implements a score-based variance component test to assess the association of a given set of single nucleotide polymorphisms with a continuous phenotype. We compared the performance of our software with that of two existing software for family-based sequence kernel association testing, namely, ASKAT and famSKAT, using the Genetic Analysis Workshop 17 family sample. Results demonstrate that FFBSKAT is several times faster than other available programs. In addition, the calculations of the three-compared software were similarly accurate. With respect to the available analysis modes, we combined the advantages of both ASKAT and famSKAT and added new options to empower FFBSKAT users. The FFBSKAT package is fast, user-friendly, and provides an easy-to-use method to perform whole-exome kernel machine-based regression association analysis of quantitative traits in samples of related individuals. The FFBSKAT package, along with its manual, is available for free download at http://mga.bionet.nsc.ru/soft/FFBSKAT/ . © 2014 Svishcheva et al.",
                "authors": [
                    {
                        "name": "Svishcheva G.R."
                    },
                    {
                        "name": "Belonogova N.M."
                    },
                    {
                        "name": "Axenovich T.I."
                    }
                ],
                "citationCount": 17,
                "date": "2014-06-06T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "FFBSKAT: Fast family-based sequence kernel association test"
            },
            "pmcid": "PMC4048315",
            "pmid": "24905468"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Molecular genetics",
            "uri": "http://edamontology.org/topic_3321"
        }
    ],
    "validated": 1
}