{"collectionID": [], "accessibility": [], "topic": [{"term": "Gene transcripts", "uri": "http://edamontology.org/topic_3512"}, {"term": "Transcription factors and regulatory sites", "uri": "http://edamontology.org/topic_0749"}, {"term": "Gene expression", "uri": "http://edamontology.org/topic_0203"}, {"term": "Epigenomics", "uri": "http://edamontology.org/topic_3173"}, {"term": "Cell culture collection", "uri": "http://edamontology.org/topic_3340"}], "owner": "ELIXIR-EE", "cost": null, "relation": [], "download": [], "validated": 1, "publication": [{"doi": null, "note": null, "version": null, "pmid": "19910371", "type": null, "pmcid": null, "metadata": {"title": "DBTSS provides a tissue specific dynamic view of transcription start sites", "abstract": "DataBase of Transcription Start Sites (DBTSS) is a database which contains precise positional information for transcription start sites (TSSs) of eukaryotic mRNAs. In this update, we included 330 million new tags generated by massively sequencing the 5′-end of oligo-cap selected cDNAs in humans and mice. The tags were collected from normal fetal or adult human tissues, including brain, thymus, liver, kidney and heart, from 6 human cell lines in 21 diverse growth conditions as well as from mouse NIH3T3 cell line: altogether 31 different cell types or culture conditions are represented. This unprecedented increase in depth of data now allows DBTSS to faithfully represent the dynamically changing landscape of TSSs in different cell types and conditions, during development and in the course of evolution. Differential usage of alternative 5′-ends across cell types and conditions can be viewed in a series of new interfaces. Promoter sequence information is now displayed in a comparative genomics viewer where evolutionary turnover of the TSSs can be evaluated. DBTSS can be accessed at http://dbtss.hgc.jp/. © The Author(s) 2009. Published by Oxford University Press.", "citationCount": 39, "authors": [{"name": "Yamashita R."}, {"name": "Wakaguri H."}, {"name": "Sugano S."}, {"name": "Suzuki Y."}, {"name": "Nakai K."}], "date": "2009-11-11T00:00:00Z", "journal": "Nucleic Acids Research"}}, {"doi": null, "note": null, "version": null, "pmid": "22086958", "type": null, "pmcid": null, "metadata": {"title": "DBTSS: DataBase of Transcriptional Start Sites progress report in 2012", "abstract": "To support transcriptional regulation studies, we have constructed DBTSS (DataBase of Transcriptional Start Sites), which contains exact positions of transcriptional start sites (TSSs), determined with our own technique named TSSseq, in the genomes of various species. In its latest version, DBTSS covers the data of the majority of human adult and embryonic tissues: it now contains 418 million TSS tag sequences from 28 tissues/cell cultures. Moreover, we integrated a series of our own transcriptomic data, such as the RNA-seq data of subcellular-fractionated RNAs as well as the ChIP-seq data of histone modifications and the binding of RNA polymerase II/several transcription factors in cultured cell lines into our original TSS information. We also included several external epigenomic data, such as the chromatin map of the ENCODE project. We further associated our TSS information with public or original single-nucleotide variation (SNV) data, in order to identify SNVs in the regulatory regions. These data can be browsed in our new viewer, which supports versatile search conditions of users. We believe that our new DBTSS will be an invaluable resource for interpreting the differential uses of TSSs and for identifying human genetic variations that are associated with disordered transcriptional regulation. DBTSS can be accessed at http://dbtss.hgc.jp. © The Author(s) 2011. Published by Oxford University Press.", "citationCount": 32, "authors": [{"name": "Yamashita R."}, {"name": "Sugano S."}, {"name": "Suzuki Y."}, {"name": "Nakai K."}], "date": "2012-01-01T00:00:00Z", "journal": "Nucleic Acids Research"}}], "homepage_status": 0, "credit": [{"typeRole": ["Primary contact"], "name": "Y. Suzuki", "url": null, "gridid": null, "note": null, "orcidid": null, "typeEntity": "Person", "email": "ysuzuki@ims.u-tokyo.ac.jp"}], "biotoolsCURIE": "biotools:dbtss", "elixirPlatform": [], "elixirNode": [], "version": [], "elixir_badge": 0, "homepage": "http://dbtss.hgc.jp/", "function": [{"note": null, "input": [], "operation": [{"term": "Genetic variation analysis", "uri": "http://edamontology.org/operation_3197"}, {"term": "Generation", "uri": "http://edamontology.org/operation_3429"}, {"term": "Sequence tag mapping", "uri": "http://edamontology.org/operation_0527"}, {"term": "Gene expression profiling", "uri": "http://edamontology.org/operation_0314"}, {"term": "Promoter prediction", "uri": "http://edamontology.org/operation_0440"}], "cmd": null, "output": []}], "lastUpdate": "2018-12-10T12:58:59Z", "otherID": [], "description": "DataBase of Transcription Start Sites is a database which contains precise positional information for transcription start sites of eukaryotic mRNAs. Included are 330 million new tags generated by massively sequencing the 5-end of oligo-cap selected cDNAs in humans and mice. 31 different cell types or culture conditions are represented. Promoter sequence information is now displayed in a comparative genomics viewer where evolutionary turnover of the TSSs can be evaluated.", "toolType": ["Database portal"], "editPermission": {"type": "private", "authors": []}, "language": [], "link": [], "biotoolsID": "dbtss", "additionDate": "2017-03-27T07:56:21Z", "name": "DBTSS", "license": null, "documentation": [{"url": "https://dbtss.hgc.jp/?doc:help_2017.html", "note": null, "type": "General"}], "maturity": null, "confidence_flag": null, "operatingSystem": ["Linux", "Windows", "Mac"]}