{
    "additionDate": "2019-11-14T19:43:36Z",
    "biotoolsCURIE": "biotools:NEMII",
    "biotoolsID": "NEMII",
    "confidence_flag": "high",
    "credit": [
        {
            "email": "zhangwen@mail.hzau.edu.cn",
            "name": "Wen Zhang",
            "typeEntity": "Person"
        },
        {
            "email": "leexh@whu.edu.cn",
            "name": "Xiaohong Li",
            "typeEntity": "Person"
        }
    ],
    "description": "A network embedding-based multiple information integration method for the MiRNA-disease association prediction | Code and data for “A network embedding-based multiple information integration method for the MiRNA-disease association prediction” | data/miRNA_disease.csv is the miRNA_disease association matrix, which contain 4479 associations between 412 miRNAs and 314 diseases | data/miRNA_family.csv is the miRNA_family association matrix, which contain 278 miRNA-family associations between 412 miRNAs and 278 families | NEMII_main.py implements 5-fold CV of NEMII on our dataset",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "miRNA target prediction",
                    "uri": "http://edamontology.org/operation_0463"
                }
            ]
        }
    ],
    "homepage": "https://github.com/BioMedicalBigDataMiningLab/NEMII",
    "language": [
        "Python"
    ],
    "lastUpdate": "2019-11-14T19:43:36Z",
    "name": "NEMII",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12859-019-3063-3",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: MiRNAs play significant roles in many fundamental and important biological processes, and predicting potential miRNA-disease associations makes contributions to understanding the molecular mechanism of human diseases. Existing state-of-the-art methods make use of miRNA-target associations, miRNA-family associations, miRNA functional similarity, disease semantic similarity and known miRNA-disease associations, but the known miRNA-disease associations are not well exploited. Results: In this paper, a network embedding-based multiple information integration method (NEMII) is proposed for the miRNA-disease association prediction. First, known miRNA-disease associations are formulated as a bipartite network, and the network embedding method Structural Deep Network Embedding (SDNE) is adopted to learn embeddings of nodes in the bipartite network. Second, the embedding representations of miRNAs and diseases are combined with biological features about miRNAs and diseases (miRNA-family associations and disease semantic similarities) to represent miRNA-disease pairs. Third, the prediction models are constructed based on the miRNA-disease pairs by using the random forest. In computational experiments, NEMII achieves high-accuracy performances and outperforms other state-of-the-art methods: GRNMF, NTSMDA and PBMDA. The usefulness of NEMII is further validated by case studies. The studies demonstrate the great potential of network embedding method for the miRNA-disease association prediction, and SDNE outperforms other popular network embedding methods: DeepWalk, High-Order Proximity preserved Embedding (HOPE) and Laplacian Eigenmaps (LE). Conclusion: We propose a new method, named NEMII, for predicting miRNA-disease associations, which has great potential to benefit the field of miRNA-disease association prediction.",
                "authors": [
                    {
                        "name": "Gong Y."
                    },
                    {
                        "name": "Niu Y."
                    },
                    {
                        "name": "Zhang W."
                    },
                    {
                        "name": "Li X."
                    }
                ],
                "citationCount": 14,
                "date": "2019-09-12T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "A network embedding-based multiple information integration method for the MiRNA-disease association prediction"
            },
            "pmcid": "PMC6740005",
            "pmid": "31510919"
        }
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        }
    ]
}