{
    "additionDate": "2022-03-14T07:35:59.487652Z",
    "biotoolsCURIE": "biotools:canvs",
    "biotoolsID": "canvs",
    "confidence_flag": "tool",
    "description": "CANVS is an easy-to-use application for the analysis and visualization of mass spectrometry-based protein-protein interaction/association data. The elucidation of a protein's interaction association network is important for defining its biological function. Mass spectrometry-based proteomic approaches have emerged as powerful tools for identifying protein-protein interactions (PPIs) and protein-protein associations (PPAs). However, interactome association experiments are difficult to interpret, considering the complexity and abundance of data that are generated. Although tools have been developed to identify protein interactions associations quantitatively, there is still a pressing need for easy-to-use tools that allow users to contextualize their results. To address this, we developed CANVS, a computational pipeline that cleans, analyzes, and visualizes mass spectrometry-based interactome association data",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Network visualisation",
                    "uri": "http://edamontology.org/operation_3925"
                },
                {
                    "term": "Protein-protein interaction analysis",
                    "uri": "http://edamontology.org/operation_2949"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                }
            ]
        }
    ],
    "homepage": "https://sourceforge.net/projects/canvs/files/",
    "language": [
        "R"
    ],
    "lastUpdate": "2022-03-14T07:35:59.490260Z",
    "name": "CANVS",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1091/MBC.E21-05-0257",
            "metadata": {
                "abstract": "The elucidation of a protein's interaction/association network is important for defining its biological function. Mass spectrometry-based proteomic approaches have emerged as powerful tools for identifying protein-protein interactions (PPIs) and protein-protein associations (PPAs). However, interactome/association experiments are difficult to interpret, considering the complexity and abundance of data that are generated. Although tools have been developed to identify protein interactions/associations quantitatively, there is still a pressing need for easy-to-use tools that allow users to contextualize their results. To address this, we developed CANVS, a computational pipeline that cleans, analyzes, and visualizes mass spectrometry-based interactome/association data. CANVS is wrapped as an interactive Shiny dashboard with simple requirements, allowing users to interface easily with the pipeline, analyze complex experimental data, and create PPI/A networks. The application integrates systems biology databases such as BioGRID and CORUM to contextualize the results. Furthermore, CANVS features a Gene Ontology tool that allows users to identify relevant GO terms in their results and create visual networks with proteins associated with relevant GO terms. Overall, CANVS is an easy-to-use application that benefits all researchers, especially those who lack an established bioinformatic pipeline and are interested in studying interactome/association data.",
                "authors": [
                    {
                        "name": "Garcia Y.A."
                    },
                    {
                        "name": "Gholkar A.A."
                    },
                    {
                        "name": "Ramirez I."
                    },
                    {
                        "name": "Torres J.Z."
                    },
                    {
                        "name": "Velasquez E.F."
                    }
                ],
                "date": "2021-11-01T00:00:00Z",
                "journal": "Molecular biology of the cell",
                "title": "CANVS: an easy-to-use application for the analysis and visualization of mass spectrometry-based protein-protein interaction/association data"
            },
            "pmid": "34432510"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Ontology and terminology",
            "uri": "http://edamontology.org/topic_0089"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ]
}
