{
    "additionDate": "2017-08-03T18:57:05Z",
    "biotoolsCURIE": "biotools:quanto",
    "biotoolsID": "quanto",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://pressroom.usc.edu/w-james-gauderman/"
        }
    ],
    "description": "Program that computes sample size or power for association studies of genes, environmental factors, gene-environment interaction, or gene-gene interaction. Available study designs for a disease (binary) outcome include the unmatched case-control, matched case-control, case-sibling, case-parent, and case-only designs. Study designs for a quantitative trait include independent individuals and case parent designs.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://biostats.usc.edu/Quanto.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Statistical calculation",
                    "uri": "http://edamontology.org/operation_2238"
                }
            ]
        }
    ],
    "homepage": "http://biostats.usc.edu/Quanto.html",
    "lastUpdate": "2019-07-17T10:26:45Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/quanto-1-2-4-computes-sample-size-power-association-studies.html"
        }
    ],
    "name": "QUANTO",
    "operatingSystem": [
        "Windows"
    ],
    "owner": "lhhays",
    "publication": [
        {
            "metadata": {
                "abstract": "Consideration of gene-environment (G × E) interaction is becoming increasingly important in the design of new epidemiologic studies. We present a method for computing required sample size or power to detect G × E interaction in the context of three specific designs: the standard matched case-control; the case-sibling, and the case-parent designs. The method is based on computation of the expected value of the likelihood ratio test statistic, assuming that the data will be analysed using conditional logistic regression. Comparisons of required sample sizes indicate that the family-based designs (case-sibling and case-parent) generally require fewer matched sets than the case-control design to achieve the same power for detecting a G × E interaction. The case-sibling design is most efficient when studying a dominant gene, while the case-parent design is preferred for a recessive gene. Methods are also presented for computing sample size when matched sets are obtained from a stratified population, for example, when the population consists of multiple ethnic groups. A software program that implements the method is freely available, and may be downloaded from the website http://hydra.usc.edu/gxe. Copyright © 2002 John Wiley & Sons, Ltd.",
                "authors": [
                    {
                        "name": "Gauderman W.J."
                    }
                ],
                "citationCount": 481,
                "date": "2002-01-15T00:00:00Z",
                "journal": "Statistics in Medicine",
                "title": "Sample size requirements for matched case-control studies of gene-environment interaction"
            },
            "pmid": "11782049"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        },
        {
            "term": "Public health and epidemiology",
            "uri": "http://edamontology.org/topic_3305"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ],
    "validated": 1
}