{"credit":[{"email":"nrabbee@post.harvard.edu","name":"Nusrat Rabbee","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"url":"http://bioconductor.org/packages/release/bioc/html/RLMM.html"}],"download":[{"type":"Source code","url":"http://bioconductor/packages/release/bioc/src/contrib/RLMM_1.36.0.tar.gz"}],"function":[{"operation":[{"term":"Genotyping","uri":"http://edamontology.org/operation_3196"}]}],"labels":{"collectionID":["BioConductor"],"language":["R"],"license":"GPL-2.0","operatingSystem":["Linux","Windows","Mac"],"toolType":["Command-line tool","Library"],"topic":[{"term":"Genotyping experiment","uri":"http://edamontology.org/topic_3516"},{"term":"DNA polymorphism","uri":"http://edamontology.org/topic_2885"}]},"link":[{"type":"MIRROR","url":"http://www.stat.berkeley.edu/users/nrabbee/RLMM"}],"publication":[{"abstract":"Motivation: A classification algorithm, based on a multi-chip, multi-SNP approach is proposed for Affymetrix SNP arrays. Current procedures for calling genotypes on SNP arrays process all the features associated with one chip and one SNP at a time. Using a large training sample where the genotype labels are known, we develop a supervised learning algorithm to obtain more accurate classification results on new data. The method we propose, RLMM, is based on a robustly fitted, linear model and uses the Mahalanobis distance for classification. The chip-to-chip non-biological variance is reduced through normalization. This model-based algorithm captures the similarities across genotype groups and probes, as well as across thousands of SNPs for accurate classification. In this paper, we apply RLMM to Affymetrix 100 K SNP array data, present classification results and compare them with genotype calls obtained from the Affymetrix procedure DM, as well as to the publicly available genotype calls from the HapMap project. © The Author 2005. Published by Oxford University Press. All rights reserved.","authors":["Rabbee N.","Speed T.P."],"cit_count":231,"doi":"10.1093/bioinformatics/bti741","journal":"Bioinformatics","title":"A genotype calling algorithm for affymetrix SNP arrays","type":"Primary","year":"2006-01-01"}],"summary":{"biotoolsCURIE":"biotools:rlmm","biotoolsID":"rlmm","description":"A classification algorithm, based on a multi-chip, multi-SNP approach for Affymetrix SNP arrays. Using a large training sample where the genotype labels are known, the algorithm will obtain more accurate classification results on new data. It is based on a linear model, uses the Mahalanobis distance for classification. Non-biological variation is removed through normalization. It captures similarities across genotype groups and probes, as well as thousands other SNPs for accurate classification.","homepage":"http://bioconductor.org/packages/release/bioc/html/RLMM.html","name":"RLMM","version":["1.36.0"]}}