
{
    "credit": [
        {
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://www-vendruscolo.ch.cam.ac.uk/index.html"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Protein modelling",
                    "uri": "http://edamontology.org/operation_0477"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "C++"
        ],
        "operatingSystem": [
            "Linux"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Molecular modelling",
                "uri": "http://edamontology.org/topic_2275"
            },
            {
                "term": "Structural biology",
                "uri": "http://edamontology.org/topic_1317"
            },
            {
                "term": "Protein structure analysis",
                "uri": "http://edamontology.org/topic_2814"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/almost-2-1-0-molecular-simulation-toolkit-for-protein-structure-determination.html"
        }
    ],
    "publication": [
        {
            "abstract": "Almost (all atom molecular simulation toolkit) is an open source computational package for structure determination and analysis of complex molecular systems including proteins, and nucleic acids. Almost has been designed with two primary goals: to provide tools for molecular structure determination using various types of experimental measurements as conformational restraints, and to provide methods for the analysis and assessment of structural and dynamical properties of complex molecular systems. The methods incorporated in Almost include the determination of structural and dynamical features of proteins using distance restraints derived from nuclear Overhauser effect measurements, orientational restraints obtained from residual dipolar couplings and the structural restraints from chemical shifts. Here, we present the first public release of Almost, highlight the key aspects of its computational design and discuss the main features currently implemented. Almost is available for the most common Unix-based operating systems, including Linux and Mac OS X. Almost is distributed free of charge under the GNU Public License, and is available both as a source code and as a binary executable from the project web site at http://www.open-almost.org. Interested users can follow and contribute to the further development of Almost on http://sourceforge.net/ projects/almost. © 2014 Wiley Periodicals, Inc. \"Almost\" (all atom molecular simulation toolkit) is an open source computational package for the structure determination and analysis of biomolecules. Almost provides tools for the molecular structure determination using various types of experimental measurements as conformational restraints and methods for the analysis of structural and dynamical properties of complex molecular systems. Copyright © 2014 Wiley Periodicals, Inc.",
            "authors": [
                "Fu B.",
                "Sahakyan A.B.",
                "Camilloni C.",
                "Tartaglia G.G.",
                "Paci E.",
                "Caflisch A.",
                "Vendruscolo M.",
                "Cavalli A."
            ],
            "cit_count": 20,
            "journal": "Journal of Computational Chemistry",
            "pmid": "24676684",
            "title": "ALMOST: An all atom molecular simulation toolkit for protein structure determination",
            "year": "2014-05-30"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:almost",
        "biotoolsID": "almost",
        "description": "This modelling environment provides powerful and efficient algorithms for molecular simulation, homology modeling, de novo design and ab-initio calculations.",
        "homepage": "http://www-mvsoftware.ch.cam.ac.uk",
        "name": "ALMOST"
    }
}