{
    "additionDate": "2022-10-10T09:13:00.355787Z",
    "biotoolsCURIE": "biotools:polysacdb",
    "biotoolsID": "polysacdb",
    "credit": [
        {
            "name": "Dr Gajendra P.S. Raghava",
            "url": "https://webs.iiitd.edu.in/raghava/polysacdb/index.html"
        }
    ],
    "description": "A comprehensive database of microbial polysaccharide antigens and their antibodies.\nPolysacDB database has been developed to facilitate easy retrieval of information pertaining to microbial surface polysaccharides.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://webs.iiitd.edu.in/raghava/polysacdb/index.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Analysis",
                    "uri": "http://edamontology.org/operation_2945"
                }
            ]
        }
    ],
    "homepage": "https://webs.iiitd.edu.in/raghava/polysacdb/index.html",
    "lastUpdate": "2022-10-10T09:13:05.433004Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "https://webs.iiitd.edu.in/raghava/polysacdb/index.html"
        }
    ],
    "name": "polysacdb",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "raghavagps",
    "publication": [
        {
            "doi": "10.1371/journal.pone.0034613",
            "metadata": {
                "abstract": "Vaccines based on microbial cell surface polysaccharides have long been considered as attractive means to control infectious diseases. To realize this goal, detailed systematic information about the antigenic polysaccharide is necessary. However, only a few databases that provide limited knowledge in this area are available. This paper describes PolysacDB, a manually curated database of antigenic polysaccharides. We collected and compiled comprehensive information from literature and web resources about antigenic polysaccharides of microbial origin. The current version of the database has 1,554 entries of 149 different antigenic polysaccharides from 347 different microbes. Each entry provides comprehensive information about an antigenic polysaccharide, i.e., its origin, function, protocols for its conjugation to carriers, antibodies produced, details of assay systems, specificities of antibodies, proposed epitopes involved and antibody utilities. For convenience to the user, we have integrated web interface for searching, advanced searching and browsing data in database. This database will be useful for researchers working on polysaccharide-based vaccines. It is freely available from the URL: http://crdd.osdd.net/raghava/polysacdb/. © 2012 Aithal et al.",
                "authors": [
                    {
                        "name": "Aithal A."
                    },
                    {
                        "name": "Joshi S."
                    },
                    {
                        "name": "Raghava G.P.S."
                    },
                    {
                        "name": "Sharma A."
                    },
                    {
                        "name": "Varshney G.C."
                    }
                ],
                "citationCount": 8,
                "date": "2012-04-16T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "PolysacDB: A database of microbial polysaccharide antigens and their antibodies"
            },
            "pmcid": "PMC3324500",
            "pmid": "22509333"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Computational biology",
            "uri": "http://edamontology.org/topic_3307"
        }
    ]
}
