{
    "additionDate": "2020-01-14T20:09:51Z",
    "biotoolsCURIE": "biotools:Tree-Weighting",
    "biotoolsID": "Tree-Weighting",
    "confidence_flag": "tool",
    "description": "Tree-Weighting for Multi-Study Ensemble Learners.",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://github.com/m-ramchandran/tree-weighting",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-01-16T17:24:15Z",
    "name": "Tree-Weighting",
    "owner": "Pub2Tools",
    "publication": [
        {
            "metadata": {
                "abstract": "© 2019 The Authors.Multi-study learning uses multiple training studies, separately trains classi-ers on each, and forms an ensemble with weights rewarding members with better cross-study predic-tion ability. This article considers novel weighting approaches for constructing tree-based ensemble learners in this setting. Using Random Forests as a single-study learner, we com-pare weighting each forest to form the ensemble, to extracting the individual trees trained by each Random Forest and weighting them directly. We find that incorporating multiple layers of ensembling in the training process by weighting trees increases the robustness of the resulting predictor. Furthermore, we explore how ensembling weights correspond to tree structure, to shed light on the features that determine whether weighting trees directly is advantageous. Finally, we apply our approach to genomic datasets and show that weight-ing trees improves upon the basic multi-study learning paradigm. Code and supplementary material are available at https://github.com/m-ramchandran/tree-weighting.",
                "authors": [
                    {
                        "name": "Ramchandran M."
                    },
                    {
                        "name": "Patil P."
                    },
                    {
                        "name": "Parmigiani G."
                    }
                ],
                "date": "2020-01-01T00:00:00Z",
                "journal": "Pacific Symposium on Biocomputing",
                "title": "Tree-weighting for multi-study ensemble learners"
            },
            "pmid": "31797618"
        }
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        }
    ],
    "validated": 1
}