
{
    "credit": [
        {
            "email": "jacques.rougemont@epfl.ch",
            "name": "Jacques Rougemont",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://master.bioconductor.org/packages//2.10/bioc/manuals/Rolexa/man/Rolexa.pdf"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Base-calling",
                    "uri": "http://edamontology.org/operation_3185"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "R"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Plug-in"
        ],
        "topic": [
            {
                "term": "Sequencing",
                "uri": "http://edamontology.org/topic_3168"
            }
        ]
    },
    "publication": [
        {
            "abstract": "Background: Solexa/Illumina short-read ultra-high throughput DNA sequencing technology produces millions of short tags (up to 36 bases) by parallel sequencing-by-synthesis of DNA colonies. The processing and statistical analysis of such high-throughput data poses new challenges; currently a fair proportion of the tags are routinely discarded due to an inability to match them to a reference sequence, thereby reducing the effective throughput of the technology. Results: We propose a novel base calling algorithm using model-based clustering and probability theory to identify ambiguous bases and code them with IUPAC symbols. We also select optimal sub-tags using a score based on information content to remove uncertain bases towards the ends of the reads. Conclusion: We show that the method improves genome coverage and number of usable tags as compared with Solexa's data processing pipeline by an average of 15%. An R package is provided which allows fast and accurate base calling of Solexa's fluorescence intensity files and the production of informative diagnostic plots. © 2008 Rougemont et al; licensee BioMed Central Ltd.",
            "authors": [
                "Rougemont J.",
                "Amzallag A.",
                "Iseli C.",
                "Farinelli L.",
                "Xenarios I.",
                "Naef F."
            ],
            "cit_count": 66,
            "journal": "BMC Bioinformatics",
            "pmid": "18851737",
            "title": "Probabilistic base calling of Solexa sequencing data",
            "year": "2008-10-13"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:rolexa",
        "biotoolsID": "rolexa",
        "description": "Allows fast and accurate base calling of Solexa's fluorescence intensity files and the production of informative diagnostic plots.",
        "homepage": "http://master.bioconductor.org/packages//2.10/bioc/html/Rolexa.html",
        "name": "Rolexa"
    }
}