{"collectionID": [], "accessibility": [], "topic": [{"term": "Sequence analysis", "uri": "http://edamontology.org/topic_0080"}], "owner": "migle_sur", "cost": null, "relation": [], "download": [], "validated": 1, "publication": [{"doi": "10.1186/s12859-017-1953-9", "note": null, "version": null, "pmid": null, "type": "Primary", "pmcid": null, "metadata": {"title": "HISEA: HIerarchical SEed Aligner for PacBio data", "abstract": "© 2017 The Author(s). Background: The next generation sequencing (NGS) techniques have been around for over a decade. Many of their fundamental applications rely on the ability to compute good genome assemblies. As the technology evolves, the assembly algorithms and tools have to continuously adjust and improve. The currently dominant technology of Illumina produces reads that are too short to bridge many repeats, setting limits on what can be successfully assembled. The emerging SMRT (Single Molecule, Real-Time) sequencing technique from Pacific Biosciences produces uniform coverage and long reads of length up to sixty thousand base pairs, enabling significantly better genome assemblies. However, SMRT reads are much more expensive and have a much higher error rate than Illumina's - around 10-15% - mostly due to indels. New algorithms are very much needed to take advantage of the long reads while mitigating the effect of high error rate and lowering the required coverage. Methods: An essential step in assembling SMRT data is the detection of alignments, or overlaps, between reads. High error rate and very long reads make this a much more challenging problem than for Illumina data. We present a new pairwise read aligner, or overlapper, HISEA (Hierarchical SEed Aligner) for SMRT sequencing data. HISEA uses a novel two-step k-mer search, employing consistent clustering, k-mer filtering, and read alignment extension. Results: We compare HISEA against several state-of-the-art programs - BLASR, DALIGNER, GraphMap, MHAP, and Minimap - on real datasets from five organisms. We compare their sensitivity, precision, specificity, F1-score, as well as time and memory usage. We also introduce a new, more precise, evaluation method. Finally, we compare the two leading programs, MHAP and HISEA, for their genome assembly performance in the Canu pipeline. Discussion: Our algorithm has the best alignment detection sensitivity among all programs for SMRT data, significantly higher than the current best. The currently best assembler for SMRT data is the Canu program which uses the MHAP aligner in its pipeline. We have incorporated our new HISEA aligner in the Canu pipeline and benchmarked it against the best pipeline for multiple datasets at two relevant coverage levels: 30x and 50x. Our assemblies are better than those using MHAP for both coverage levels. Moreover, Canu+HISEA assemblies for 30x coverage are comparable with Canu+MHAP assemblies for 50x coverage, while being faster and cheaper. Conclusions: The HISEA algorithm produces alignments with highest sensitivity compared with the current state-of-the-art algorithms. Integrated in the Canu pipeline, currently the best for assembling PacBio data, it produces better assemblies than Canu+MHAP.", "citationCount": 0, "authors": [{"name": "Khiste N."}, {"name": "Ilie L."}], "date": "2017-12-19T00:00:00Z", "journal": "BMC Bioinformatics"}}], "homepage_status": 0, "credit": [{"typeRole": ["Primary contact"], "name": "Lucian Ilie", "url": null, "gridid": null, "note": null, "orcidid": null, "typeEntity": "Person", "email": "ilie@uwo.ca"}], "biotoolsCURIE": "biotools:hisea", "elixirPlatform": [], "elixirNode": [], "version": [], "elixir_badge": 0, "homepage": "https://github.com/lucian-ilie/HISEA", "function": [{"note": null, "input": [], "operation": [{"term": "Genome assembly", "uri": "http://edamontology.org/operation_0525"}], "cmd": null, "output": []}], "lastUpdate": "2018-12-10T12:59:00Z", "otherID": [], "description": "Efficient all-vs-all long read aligner for SMRT sequencing data.", "toolType": ["Command-line tool"], "editPermission": {"type": "private", "authors": []}, "language": ["Java"], "link": [], "biotoolsID": "hisea", "additionDate": "2018-07-21T10:51:40Z", "name": "HISEA", "license": "Other", "documentation": [{"url": "https://github.com/lucian-ilie/HISEA/blob/master/README.md", "note": null, "type": "General"}], "maturity": null, "confidence_flag": null, "operatingSystem": ["Linux"]}