{
    "additionDate": "2019-11-14T18:00:47Z",
    "biotoolsCURIE": "biotools:gFACs",
    "biotoolsID": "gFACs",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "Jill.Wegrzyn@uconn.edu",
            "name": "Jill Wegrzyn",
            "typeEntity": "Person"
        },
        {
            "email": "Madison.Caballero@uconn.edu",
            "name": "Madison Caballero",
            "typeEntity": "Person"
        }
    ],
    "description": "Gene Filtering, Analysis, and Conversion to Unify Genome Annotations Across Alignment and Gene Prediction Frameworks | Gene filtering, analysis, and conversion",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene prediction",
                    "uri": "http://edamontology.org/operation_2454"
                }
            ]
        }
    ],
    "homepage": "https://gitlab.com/PlantGenomicsLab/gFACs",
    "language": [
        "Perl"
    ],
    "lastUpdate": "2020-12-03T11:11:16Z",
    "license": "GPL-3.0",
    "name": "gFACs",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1016/J.GPB.2019.04.002",
            "metadata": {
                "abstract": "© 2019 The AuthorsPublished genomes frequently contain erroneous gene models that represent issues associated with identification of open reading frames, start sites, splice sites, and related structural features. The source of these inconsistencies is often traced back to integration across text file formats designed to describe long read alignments and predicted gene structures. In addition, the majority of gene prediction frameworks do not provide robust downstream filtering to remove problematic gene annotations, nor do they represent these annotations in a format consistent with current file standards. These frameworks also lack consideration for functional attributes, such as the presence or absence of protein domains that can be used for gene model validation. To provide oversight to the increasing number of published genome annotations, we present a software package, the Gene Filtering, Analysis, and Conversion (gFACs), to filter, analyze, and convert predicted gene models and alignments. The software operates across a wide range of alignment, analysis, and gene prediction files with a flexible framework for defining gene models with reliable structural and functional attributes. gFACs supports common downstream applications, including genome browsers, and generates extensive details on the filtering process, including distributions that can be visualized to further assess the proposed gene space. gFACs is freely available and implemented in Perl with support from BioPerl libraries at https://gitlab.com/PlantGenomicsLab/gFACs.",
                "authors": [
                    {
                        "name": "Caballero M."
                    },
                    {
                        "name": "Wegrzyn J."
                    }
                ],
                "citationCount": 4,
                "date": "2019-06-01T00:00:00Z",
                "journal": "Genomics, Proteomics and Bioinformatics",
                "title": "gFACs: Gene Filtering, Analysis, and Conversion to Unify Genome Annotations Across Alignment and Gene Prediction Frameworks"
            },
            "pmcid": "PMC6818179",
            "pmid": "31437583"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Bioinformatics",
            "uri": "http://edamontology.org/topic_0091"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "RNA splicing",
            "uri": "http://edamontology.org/topic_3320"
        }
    ],
    "validated": 1
}
