{"credit":[{"email":"enrichmentmap-dev@googlegroups.com","name":"EnrichmentMap Team","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"http://enrichmentmap.readthedocs.io/en/latest/"},{"url":"https://baderlab.github.io/Cytoscape_workflows/EnrichmentMapPipeline/"}],"function":[{"operation":[{"term":"Clustering","uri":"http://edamontology.org/operation_3432"},{"term":"Over-representation analysis","uri":"http://edamontology.org/operation_3501"},{"term":"Gene-set enrichment analysis","uri":"http://edamontology.org/operation_2436"},{"term":"Mapping","uri":"http://edamontology.org/operation_2429"}]}],"labels":{"language":["Java"],"operatingSystem":["Linux","Windows","Mac"],"toolType":["Desktop application"],"topic":[{"term":"Mapping","uri":"http://edamontology.org/topic_0102"},{"term":"Molecular interactions, pathways and networks","uri":"http://edamontology.org/topic_0602"},{"term":"Model organisms","uri":"http://edamontology.org/topic_0621"},{"term":"Ontology and terminology","uri":"http://edamontology.org/topic_0089"}]},"publication":[{"abstract":"Background: Gene-set enrichment analysis is a useful technique to help functionally characterize large gene lists, such as the results of gene expression experiments. This technique finds functionally coherent gene-sets, such as pathways, that are statistically over-represented in a given gene list. Ideally, the number of resulting sets is smaller than the number of genes in the list, thus simplifying interpretation. However, the increasing number and redundancy of gene-sets used by many current enrichment analysis software works against this ideal. Principal Findings: To overcome gene-set redundancy and help in the interpretation of large gene lists, we developed \"Enrichment Map\", a network-based visualization method for gene-set enrichment results. Gene-sets are organized in a network, where each set is a node and edges represent gene overlap between sets. Automated network layout groups related gene-sets into network clusters, enabling the user to quickly identify the major enriched functional themes and more easily interpret the enrichment results. Conclusions: Enrichment Map is a significant advance in the interpretation of enrichment analysis. Any research project that generates a list of genes can take advantage of this visualization framework. Enrichment Map is implemented as a freely available and user friendly plug-in for the Cytoscape network visualization software. © 2010 Merico et al.","authors":["Merico D.","Isserlin R.","Stueker O.","Emili A.","Bader G.D."],"cit_count":636,"journal":"PLoS ONE","pmid":"21085593","title":"Enrichment map: A network-based method for gene-set enrichment visualization and interpretation","year":"2010-12-10"}],"summary":{"biotoolsCURIE":"biotools:enrichmentmap","biotoolsID":"enrichmentmap","description":"A Cytoscape plugin for functional enrichment visualization. Gene-sets, such as pathways and Gene Ontology terms, are organized into a network (i.e. the \"\"enrichment map\"\"). In this way, mutually overlapping gene-sets cluster together, making interpretation easier. It also enables the comparison of two different enrichment results in the same map.","homepage":"http://baderlab.org/Software/EnrichmentMap","name":"Enrichment Map Cytoscape Plugin"}}