{
    "additionDate": "2021-01-18T06:59:33Z",
    "biotoolsCURIE": "biotools:orso",
    "biotoolsID": "orso",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "fargod@niehs.nih.gov",
            "name": "David C. Fargo",
            "orcidid": "https://orcid.org/0000-0003-4728-2642",
            "typeEntity": "Person"
        }
    ],
    "description": "A data-driven social network connecting scientists to genomics datasets.\nORSO (Online Resource for Social Omics) is a web application designed to help users find next generation sequencing (NGS) datasets relevant to their research interests. ORSO performs this task by creating and maintaining a network of datasets connected based on similarity in primary read coverage values and annotated metadata. An ORSO user can follow these connections to discover datasets with similar characteristics. ORSO is also a social network. Users may favorite datasets and follow other users, creating new connections that influence how datasets are recommended.",
    "download": [
        {
            "type": "Software package",
            "url": "https://github.com/NIEHS/orso/raw/master/ontologies.tar.gz"
        },
        {
            "type": "Source code",
            "url": "https://github.com/niehs/orso/tree/master/data/colors"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                },
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Principal component visualisation",
                    "uri": "http://edamontology.org/operation_2939"
                }
            ]
        }
    ],
    "homepage": "https://orso.niehs.nih.gov",
    "language": [
        "JavaScript",
        "Python"
    ],
    "lastUpdate": "2021-03-15T09:37:43Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/niehs/orso"
        }
    ],
    "name": "ORSO",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PCBI.1007571",
            "metadata": {
                "abstract": "Copyright: This is an open access article, free of all copyright, and may be freely reproduced, distributed, transmitted, modified, built upon, or otherwise used by anyone for any lawful purpose. The work is made available under the Creative Commons CC0 public domain dedication.High-throughput sequencing has become ubiquitous in biomedical sciences. As new technologies emerge and sequencing costs decline, the diversity and volume of available data increases exponentially, and successfully navigating the data becomes more challenging. Though datasets are often hosted by public repositories, scientists must rely on inconsistent annotation to identify and interpret meaningful data. Moreover, the experimental heterogeneity and wide-ranging quality of high-throughput biological data means that even data with desired cell lines, tissue types, or molecular targets may not be readily interpretable or integrated. We have developed ORSO (Online Resource for Social Omics) as an easy-to-use web application to connect life scientists with genomics data. In ORSO, users interact within a data-driven social network, where they can favorite datasets and follow other users. In addition to more than 30,000 datasets hosted from major biomedical consortia, users may contribute their own data to ORSO, facilitating its discovery by other users. Leveraging user interactions, ORSO provides a novel recommendation system to automatically connect users with hosted data. In addition to social interactions, the recommendation system considers primary read coverage information and annotated metadata. Similarities used by the recommendation system are presented by ORSO in a graph display, allowing exploration of dataset associations. The topology of the network graph reflects established biology, with samples from related systems grouped together. We tested the recommendation system using an RNA-seq time course dataset from differentiation of embryonic stem cells to cardiomyocytes. The ORSO recommendation system correctly predicted early data point sources as embryonic stem cells and late data point sources as heart and muscle samples, resulting in recommendation of related datasets. By connecting scientists with relevant data, ORSO provides a critical new service that facilitates wide-ranging research interests.",
                "authors": [
                    {
                        "name": "Day F.S."
                    },
                    {
                        "name": "Fargo D.C."
                    },
                    {
                        "name": "Lavender C.A."
                    },
                    {
                        "name": "Shapiro A.J."
                    }
                ],
                "citationCount": 1,
                "date": "2020-01-01T00:00:00Z",
                "journal": "PLoS Computational Biology",
                "title": "ORSO (Online Resource for Social Omics): A data-driven social network connecting scientists to genomics datasets"
            },
            "pmcid": "PMC7001987",
            "pmid": "31978042"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Ontology and terminology",
            "uri": "http://edamontology.org/topic_0089"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ]
}
