{
    "additionDate": "2021-01-18T09:03:27Z",
    "biotoolsCURIE": "biotools:mmannot",
    "biotoolsID": "mmannot",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "matthias.zytnicki@inra.fr",
            "name": "Matthias Zytnicki",
            "orcidid": "https://orcid.org/0000-0002-4895-8731",
            "typeEntity": "Person"
        }
    ],
    "description": "Welcome to the mmannot Web page.\n\nFor instance, suppose that you have sequenced your organism of interest with sRNA-Seq (RNA-Seq works too), and you want to know how many times you have sequenced miRNAs, rRNAs, tRNAs, etc. This is what mmannot does.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "RNA-Seq quantification",
                    "uri": "http://edamontology.org/operation_3800"
                },
                {
                    "term": "Genome annotation",
                    "uri": "http://edamontology.org/operation_0362"
                },
                {
                    "term": "Sequence trimming",
                    "uri": "http://edamontology.org/operation_3192"
                }
            ]
        }
    ],
    "homepage": "https://github.com/mzytnicki/mmannot",
    "language": [
        "C++",
        "Python"
    ],
    "lastUpdate": "2021-02-26T08:52:52Z",
    "name": "mmannot",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PONE.0231738",
            "metadata": {
                "abstract": "© 2020 Zytnicki, Gaspin. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.High-throughput sequencing makes it possible to provide the genome-wide distribution of small non coding RNAs in a single experiment, and contributed greatly to the identification and understanding of these RNAs in the last decade. Small non coding RNAs gather a wide collection of classes, such as microRNAs, tRNA-derived fragments, small nucleolar RNAs and small nuclear RNAs, to name a few. As usual in RNA-seq studies, the sequencing step is followed by a feature quantification step: when a genome is available, the reads are aligned to the genome, their genomic positions are compared to the already available annotations, and the corresponding features are quantified. However, problem arises when many reads map at several positions and while different strategies exist to circumvent this problem, all of them are biased. In this article, we present a new strategy that compares all the reads that map at several positions, and their annotations when available. In many cases, all the hits co-localize with the same feature annotation (a duplicated miRNA or a duplicated gene, for instance). When different annotations exist for a given read, we propose to merge existing features and provide the counts for the merged features.",
                "authors": [
                    {
                        "name": "Zytnicki M."
                    },
                    {
                        "name": "Gaspin C."
                    }
                ],
                "citationCount": 1,
                "date": "2020-05-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "Mmannot: How to improve small-RNA annotation?"
            },
            "pmcid": "PMC7255610",
            "pmid": "32463818"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        }
    ]
}