{
    "additionDate": "2017-08-03T18:51:58Z",
    "biotoolsCURIE": "biotools:multigems",
    "biotoolsID": "multigems",
    "credit": [
        {
            "email": "xinping.cui@ucr.edu",
            "name": "Xinping Cui",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://sites.google.com/a/bioinformatics.ucr.edu/xinping-cui/"
        }
    ],
    "description": "A multiple sample single nucleotide variant (SNV) caller that works with alignment files of high-throughput sequencing (HTS) data. MultiGeMS calls SNVs based on a statistical model selection procedure and accounts for enzymatic substitution sequencing errors.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/cui-lab/multigems/blob/master/README.md"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Statistical modelling",
                    "uri": "http://edamontology.org/operation_3664"
                }
            ]
        }
    ],
    "homepage": "https://github.com/cui-lab/multigems",
    "language": [
        "C++"
    ],
    "lastUpdate": "2018-12-10T12:58:50Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/multigems-detection-of-snvs-from-multiple-samples-using-model-selection-on-high-throughput-sequencing-data.html"
        }
    ],
    "name": "MultiGeMS",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "© 2016 The Author 2016. Published by Oxford University Press. All rights reserved.Motivation: Single nucleotide variant (SNV) detection procedures are being utilized as never before to analyze the recent abundance of high-throughput DNA sequencing data, both on single and multiple sample datasets. Building on previously published work with the single sample SNV caller genotype model selection (GeMS), a multiple sample version of GeMS (MultiGeMS) is introduced. Unlike other popular multiple sample SNV callers, the MultiGeMS statistical model accounts for enzymatic substitution sequencing errors. It also addresses the multiple testing problem endemic to multiple sample SNV calling and utilizes high performance computing (HPC) techniques. Results: A simulation study demonstrates that MultiGeMS ranks highest in precision among a selection of popular multiple sample SNV callers, while showing exceptional recall in calling common SNVs. Further, both simulation studies and real data analyses indicate that MultiGeMS is robust to low-quality data. We also demonstrate that accounting for enzymatic substitution sequencing errors not only improves SNV call precision at low mapping quality regions, but also improves recall at reference allele-dominated sites with high mapping quality. Availability and implementation: The MultiGeMS package can be downloaded from https://github.com/cui-lab/multigems.",
                "authors": [
                    {
                        "name": "Murillo G.H."
                    },
                    {
                        "name": "You N."
                    },
                    {
                        "name": "Su X."
                    },
                    {
                        "name": "Cui W."
                    },
                    {
                        "name": "Reilly M.P."
                    },
                    {
                        "name": "Li M."
                    },
                    {
                        "name": "Ning K."
                    },
                    {
                        "name": "Cui X."
                    }
                ],
                "citationCount": 2,
                "date": "2016-05-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "MultiGeMS: Detection of SNVs from multiple samples using model selection on high-throughput sequencing data"
            },
            "pmid": "26787661"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        }
    ],
    "validated": 1
}