{
    "additionDate": "2020-01-14T08:58:38Z",
    "biotoolsCURIE": "biotools:ContraDRG",
    "biotoolsID": "ContraDRG",
    "confidence_flag": "high",
    "credit": [
        {
            "email": "dominik.heider@uni-marburg.de",
            "name": "Dominik Heider",
            "typeEntity": "Person"
        }
    ],
    "description": "Automatic Partial Charge Prediction by Machine Learning.\n\nIn recent years, machine learning techniques have been widely used in biomedical research to predict unseen data based on models trained on experimentally derived data. In the current study, we used machine learning algorithms to emulate computationally complex predictions in a reverse engineering-like manner and developed ContraDRG, a software that can be used to predict partial charges for small molecules based on PRODRG and Automated Topology Builder (ATB) predictions. Both tools generate molecular topology files, including the partial atomic charge, by using different procedures.\n\n||| HOMEPAGE BROKEN!.\n\n||| COMMON LINK WITH (PUB. & NAME DIFFERENT) bio.tools/efs (HEIDERLAB.DE), bio.tools/ecccl (HEIDERLAB.DE)",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Forcefield parameterisation",
                    "uri": "http://edamontology.org/operation_3893"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Molecular dynamics",
                    "uri": "http://edamontology.org/operation_2476"
                }
            ]
        }
    ],
    "homepage": "http://contradrg.heiderlab.de",
    "lastUpdate": "2020-01-14T08:58:38Z",
    "name": "ContraDRG",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.3389/FGENE.2019.00990",
            "metadata": {
                "abstract": "© 2019 Martin and Heider.In recent years, machine learning techniques have been widely used in biomedical research to predict unseen data based on models trained on experimentally derived data. In the current study, we used machine learning algorithms to emulate computationally complex predictions in a reverse engineering–like manner and developed ContraDRG, a software that can be used to predict partial charges for small molecules based on PRODRG and Automated Topology Builder (ATB) predictions. Both tools generate molecular topology files, including the partial atomic charge, by using different procedures. We show that ContraDRG can accurately predict partial charges in a fraction of the time, because it exploits existing complex models with intensive calculations by using machine learning techniques and thus can also be applied for screening projects with large amounts of molecules. We provide ContraDRG as a web server, which can be used to automatically assign partial charges to incoming user-specified molecules by using our machine learning models. In this study, we compared ContraDRG with PRODRG and ATB in regard of predictivity by statistical methods. ContraDRG allows predicting ATB-derived partial charges with an R2 value up to 0.980 and for PRODRG up to 1.00. While ATB requires hours or days for the quantum mechanical accurate calculation and refinements, ContraDRG does its approximation within seconds.",
                "authors": [
                    {
                        "name": "Martin R."
                    },
                    {
                        "name": "Heider D."
                    }
                ],
                "date": "2019-01-01T00:00:00Z",
                "journal": "Frontiers in Genetics",
                "title": "Contradrg: Automatic partial charge prediction by machine learning"
            },
            "pmcid": "PMC6831742",
            "pmid": "31737032"
        }
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Molecular dynamics",
            "uri": "http://edamontology.org/topic_0176"
        },
        {
            "term": "Molecular biology",
            "uri": "http://edamontology.org/topic_3047"
        }
    ]
}