{
    "additionDate": "2018-05-17T16:47:47Z",
    "biotoolsCURIE": "biotools:synttax",
    "biotoolsID": "synttax",
    "credit": [
        {
            "email": "jacques.oberto@igmors.u-psud.fr",
            "name": "Jacques Oberto",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "A web server linking synteny to prokaryotic taxonomy.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://archaea.u-psud.fr/SyntTax/SyntTax_Help.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Taxonomic classification",
                    "uri": "http://edamontology.org/operation_3460"
                }
            ]
        }
    ],
    "homepage": "http://archaea.u-psud.fr/SyntTax/",
    "language": [
        "C#",
        "JavaScript"
    ],
    "lastUpdate": "2018-12-10T12:58:58Z",
    "name": "SyntTax",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1186/1471-2105-14-4",
            "metadata": {
                "abstract": "Background: The study of the conservation of gene order or synteny constitutes a powerful methodology to assess the orthology of genomic regions and to predict functional relationships between genes. The exponential growth of microbial genomic databases is expected to improve synteny predictions significantly. Paradoxically, this genomic data plethora, without information on organisms relatedness, could impair the performance of synteny analysis programs.Results: In this work, I present SyntTax, a synteny web service designed to take full advantage of the large amount or archaeal and bacterial genomes by linking them through taxonomic relationships. SyntTax incorporates a full hierarchical taxonomic tree allowing intuitive access to all completely sequenced prokaryotes. Single or multiple organisms can be chosen on the basis of their lineage by selecting the corresponding rank nodes in the tree. The synteny methodology is built upon our previously described Absynte algorithm with several additional improvements.Conclusions: SyntTax aims to produce robust syntenies by providing prompt access to the taxonomic relationships connecting all completely sequenced microbial genomes. The reduction in redundancy offered by lineage selection presents the benefit of increasing accuracy while reducing computation time. This web tool was used to resolve successfully several conserved complex gene clusters described in the literature. In addition, particular features of SyntTax permit the confirmation of the involvement of the four components constituting the E. coli YgjD multiprotein complex responsible for tRNA modification. By analyzing the clustering evolution of alternative gene fusions, new proteins potentially interacting with this complex could be proposed. The web service is available at http://archaea.u-psud.fr/SyntTax. © 2013 Oberto; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Oberto J."
                    }
                ],
                "citationCount": 90,
                "date": "2013-01-16T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "SyntTax: A web server linking synteny to prokaryotic taxonomy"
            },
            "pmcid": "PMC3571937",
            "pmid": "23323735"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Gene regulation",
            "uri": "http://edamontology.org/topic_0204"
        },
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        },
        {
            "term": "Taxonomy",
            "uri": "http://edamontology.org/topic_0637"
        }
    ],
    "validated": 1
}
