{
    "additionDate": "2023-05-05T21:44:08.496602Z",
    "biotoolsCURIE": "biotools:ireceptor",
    "biotoolsID": "ireceptor",
    "collectionID": [
        "COVID-19"
    ],
    "cost": "Free of charge",
    "description": "iReceptor is a data discovery platform that facilitates the curation, analysis and sharing of antibody/B-cell and T-cell receptor repertoires (Adaptive Immune Receptor Repertoire or AIRR-seq data) and related subject and sample metadata from multiple studies across many labs and institutions.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://www.ireceptor.org/platform/doc"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sample comparison",
                    "uri": "http://edamontology.org/operation_3731"
                },
                {
                    "term": "Sequence motif comparison",
                    "uri": "http://edamontology.org/operation_0240"
                },
                {
                    "term": "Sequence motif discovery",
                    "uri": "http://edamontology.org/operation_0238"
                }
            ]
        }
    ],
    "homepage": "https://gateway.ireceptor.org",
    "lastUpdate": "2024-11-24T14:47:59.800865Z",
    "license": "LGPL-3.0",
    "maturity": "Mature",
    "name": "iReceptor",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "bcorrie",
    "publication": [
        {
            "doi": "10.1111/imr.12666",
            "metadata": {
                "abstract": "Next-generation sequencing allows the characterization of the adaptive immune receptor repertoire (AIRR) in exquisite detail. These large-scale AIRR-seq data sets have rapidly become critical to vaccine development, understanding the immune response in autoimmune and infectious disease, and monitoring novel therapeutics against cancer. However, at present there is no easy way to compare these AIRR-seq data sets across studies and institutions. The ability to combine and compare information for different disease conditions will greatly enhance the value of AIRR-seq data for improving biomedical research and patient care. The iReceptor Data Integration Platform (gateway.ireceptor.org) provides one implementation of the AIRR Data Commons envisioned by the AIRR Community (airr-community.org), an initiative that is developing protocols to facilitate sharing and comparing AIRR-seq data. The iReceptor Scientific Gateway links distributed (federated) AIRR-seq repositories, allowing sequence searches or metadata queries across multiple studies at multiple institutions, returning sets of sequences fulfilling specific criteria. We present a review of the development of iReceptor, and how it fits in with the general trend toward sharing genomic and health data, and the development of standards for describing and reporting AIRR-seq data. Researchers interested in integrating their repositories of AIRR-seq data into the iReceptor Platform are invited to contact support@ireceptor.org.",
                "authors": [
                    {
                        "name": "Barr E."
                    },
                    {
                        "name": "Breden F."
                    },
                    {
                        "name": "Breden F.M.W."
                    },
                    {
                        "name": "Christley S."
                    },
                    {
                        "name": "Corrie B.D."
                    },
                    {
                        "name": "Cowell L.G."
                    },
                    {
                        "name": "Jaglale J."
                    },
                    {
                        "name": "Knoetze N."
                    },
                    {
                        "name": "Marthandan N."
                    },
                    {
                        "name": "Scott J.K."
                    },
                    {
                        "name": "Zhou Y."
                    },
                    {
                        "name": "Zimonja B."
                    }
                ],
                "citationCount": 107,
                "date": "2018-07-01T00:00:00Z",
                "journal": "Immunological Reviews",
                "title": "iReceptor: A platform for querying and analyzing antibody/B-cell and T-cell receptor repertoire data across federated repositories"
            },
            "pmcid": "PMC6344122",
            "pmid": "29944754",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Bioinformatics portal"
    ],
    "topic": [
        {
            "term": "Immunogenetics",
            "uri": "http://edamontology.org/topic_3930"
        },
        {
            "term": "Immunomics",
            "uri": "http://edamontology.org/topic_3967"
        }
    ],
    "version": [
        "v4.0"
    ]
}
