{
    "additionDate": "2017-12-18T00:11:19Z",
    "biotoolsCURIE": "biotools:proteinshader",
    "biotoolsID": "proteinshader",
    "credit": [
        {
            "email": "joe.weber@alumni.duke.edu",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "It is a new tool for macromolecular visualization, uses information from Protein Data Bank files to produce illustrative renderings of proteins that approximate what an artist might create by hand using pen and ink. A combination of Hermite and spherical linear interpolation is used to draw smooth, gradually rotating three-dimensional tubes and ribbons with a repeating pattern of texture coordinates.",
    "documentation": [
        {
            "type": "User manual",
            "url": "http://proteinshader.sourceforge.net/tutorials/tutorials.php"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Mapping",
                    "uri": "http://edamontology.org/operation_2429"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Rendering",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "http://proteinshader.sourceforge.net/",
    "language": [
        "Java"
    ],
    "lastUpdate": "2019-02-08T09:54:32Z",
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/proteinshader-beta-0-9-4-illustrative-rendering-macromolecules.html"
        }
    ],
    "maturity": "Emerging",
    "name": "ProteinShader beta",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1186/1472-6807-9-19",
            "metadata": {
                "abstract": "Background. Cartoon-style illustrative renderings of proteins can help clarify structural features that are obscured by space filling or balls and sticks style models, and recent advances in programmable graphics cards offer many new opportunities for improving illustrative renderings. Results. The ProteinShader program, a new tool for macromolecular visualization, uses information from Protein Data Bank files to produce illustrative renderings of proteins that approximate what an artist might create by hand using pen and ink. A combination of Hermite and spherical linear interpolation is used to draw smooth, gradually rotating three-dimensional tubes and ribbons with a repeating pattern of texture coordinates, which allows the application of texture mapping, real-time halftoning, and smooth edge lines. This free platform-independent open-source program is written primarily in Java, but also makes extensive use of the OpenGL Shading Language to modify the graphics pipeline. Conclusion. By programming to the graphics processor unit, ProteinShader is able to produce high quality images and illustrative rendering effects in real-time. The main feature that distinguishes ProteinShader from other free molecular visualization tools is its use of texture mapping techniques that allow two-dimensional images to be mapped onto the curved three-dimensional surfaces of ribbons and tubes with minimum distortion of the images.",
                "authors": [
                    {
                        "name": "Weber J.R."
                    }
                ],
                "citationCount": 14,
                "date": "2009-05-05T00:00:00Z",
                "journal": "BMC Structural Biology",
                "title": "ProteinShader: Illustrative rendering of macromolecules"
            },
            "type": "Primary"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        },
        {
            "term": "Molecular modelling",
            "uri": "http://edamontology.org/topic_2275"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        }
    ],
    "validated": 1,
    "version": [
        "0.9.4"
    ]
}