{
    "additionDate": "2021-09-28T17:51:42.227670Z",
    "biotoolsCURIE": "biotools:inppdh",
    "biotoolsID": "inppdh",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "ynbin@ahu.edu.cn",
            "name": "Yannan Bin",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "jfxia@ahu.edu.cn",
            "name": "Junfeng Xia",
            "orcidid": "https://orcid.org/0000-0003-3024-1705",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "inpPDH is an improved DNA-binding hot spot residues prediction method by exploring interfacial neighbor properties.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "DNA-binding protein prediction",
                    "uri": "http://edamontology.org/operation_3900"
                },
                {
                    "term": "Feature selection",
                    "uri": "http://edamontology.org/operation_3936"
                },
                {
                    "term": "Residue contact prediction",
                    "uri": "http://edamontology.org/operation_0272"
                }
            ]
        }
    ],
    "homepage": "http://bioinfo.ahu.edu.cn/inpPDH",
    "lastUpdate": "2021-09-28T17:51:42.231538Z",
    "name": "inpPDH",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1186/S12859-020-03871-1",
            "metadata": {
                "abstract": "© 2021, The Author(s).Background: DNA-binding hot spots are dominant and fundamental residues that contribute most of the binding free energy yet accounting for a small portion of protein–DNA interfaces. As experimental methods for identifying hot spots are time-consuming and costly, high-efficiency computational approaches are emerging as alternative pathways to experimental methods. Results: Herein, we present a new computational method, termed inpPDH, for hot spot prediction. To improve the prediction performance, we extract hybrid features which incorporate traditional features and new interfacial neighbor properties. To remove redundant and irrelevant features, feature selection is employed using a two-step feature selection strategy. Finally, a subset of 7 optimal features are chosen to construct the predictor using support vector machine. The results on the benchmark dataset show that this proposed method yields significantly better prediction accuracy than those previously published methods in the literature. Moreover, a user-friendly web server for inpPDH is well established and is freely available at http://bioinfo.ahu.edu.cn/inpPDH. Conclusions: We have developed an accurate improved prediction model, inpPDH, for hot spot residues in protein–DNA binding interfaces by given the structure of a protein–DNA complex. Moreover, we identify a comprehensive and useful feature subset including the proposed interfacial neighbor features that has an important strength for identifying hot spot residues. Our results indicate that these features are more effective than the conventional features considered previously, and that the combination of interfacial neighbor features and traditional features may support the creation of a discriminative feature set for efficient prediction of hot spot residues in protein–DNA complexes.",
                "authors": [
                    {
                        "name": "Zhang S."
                    },
                    {
                        "name": "Wang L."
                    },
                    {
                        "name": "Zhao L."
                    },
                    {
                        "name": "Li M."
                    },
                    {
                        "name": "Liu M."
                    },
                    {
                        "name": "Li K."
                    },
                    {
                        "name": "Bin Y."
                    },
                    {
                        "name": "Xia J."
                    }
                ],
                "date": "2021-05-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "An improved DNA-binding hot spot residues prediction method by exploring interfacial neighbor properties"
            },
            "pmcid": "PMC8130120",
            "pmid": "34000983",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "Structure prediction",
            "uri": "http://edamontology.org/topic_0082"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}