{
    "additionDate": "2021-03-19T08:32:27Z",
    "biotoolsCURIE": "biotools:musa-r",
    "biotoolsID": "musa-r",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "Rossana.castaldo@synlab.it",
            "name": "Rossana Castaldo",
            "typeEntity": "Person"
        }
    ],
    "description": "a graphical user interface for multi-OMICs data integration in radiogenomic studies.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                }
            ]
        }
    ],
    "homepage": "https://gitlab.com/Zanfardino/musa",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-04-11T11:18:20Z",
    "name": "MuSA-r",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1038/S41598-021-81200-Z",
            "metadata": {
                "abstract": "© 2021, The Author(s).Analysis of large-scale omics data along with biomedical images has gaining a huge interest in predicting phenotypic conditions towards personalized medicine. Multiple layers of investigations such as genomics, transcriptomics and proteomics, have led to high dimensionality and heterogeneity of data. Multi-omics data integration can provide meaningful contribution to early diagnosis and an accurate estimate of prognosis and treatment in cancer. Some multi-layer data structures have been developed to integrate multi-omics biological information, but none of these has been developed and evaluated to include radiomic data. We proposed to use MultiAssayExperiment (MAE) as an integrated data structure to combine multi-omics data facilitating the exploration of heterogeneous data. We improved the usability of the MAE, developing a Multi-omics Statistical Approaches (MuSA) tool that uses a Shiny graphical user interface, able to simplify the management and the analysis of radiogenomic datasets. The capabilities of MuSA were shown using public breast cancer datasets from TCGA-TCIA databases. MuSA architecture is modular and can be divided in Pre-processing and Downstream analysis. The pre-processing section allows data filtering and normalization. The downstream analysis section contains modules for data science such as correlation, clustering (i.e., heatmap) and feature selection methods. The results are dynamically shown in MuSA. MuSA tool provides an easy-to-use way to create, manage and analyze radiogenomic data. The application is specifically designed to guide no-programmer researchers through different computational steps. Integration analysis is implemented in a modular structure, making MuSA an easily expansible open-source software.",
                "authors": [
                    {
                        "name": "Zanfardino M."
                    },
                    {
                        "name": "Castaldo R."
                    },
                    {
                        "name": "Pane K."
                    },
                    {
                        "name": "Affinito O."
                    },
                    {
                        "name": "Aiello M."
                    },
                    {
                        "name": "Salvatore M."
                    },
                    {
                        "name": "Franzese M."
                    }
                ],
                "date": "2021-12-01T00:00:00Z",
                "journal": "Scientific Reports",
                "title": "MuSA: a graphical user interface for multi-OMICs data integration in radiogenomic studies"
            },
            "pmcid": "PMC7811020",
            "pmid": "33452365"
        }
    ],
    "toolType": [
        "Desktop application",
        "Command-line tool",
        "Library"
    ],
    "topic": [
        {
            "term": "Data integration and warehousing",
            "uri": "http://edamontology.org/topic_3366"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Data quality management",
            "uri": "http://edamontology.org/topic_3572"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Personalised medicine",
            "uri": "http://edamontology.org/topic_3577"
        }
    ]
}