{
    "additionDate": "2017-08-20T15:16:16Z",
    "biotoolsCURIE": "biotools:bimbam",
    "biotoolsID": "bimbam",
    "collectionID": [
        "Animal and Crop Genomics"
    ],
    "credit": [
        {
            "email": "yongtaog@bcm.edu",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Baysian Imputation Based Association Mapping. Genotype imputation and statistical tests for disease association, including single SNP tests and regional multi-SNP tests.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://www.haplotype.org/download/bimbam-manual.pdf"
        }
    ],
    "editPermission": {
        "authors": [
            "animalandcropgenomics"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Imputation",
                    "uri": "http://edamontology.org/operation_3557"
                },
                {
                    "term": "Statistical calculation",
                    "uri": "http://edamontology.org/operation_2238"
                }
            ]
        }
    ],
    "homepage": "http://www.haplotype.org/bimbam.html",
    "language": [
        "C++"
    ],
    "lastUpdate": "2019-09-04T08:37:56Z",
    "license": "GPL-3.0",
    "name": "BIMBAM",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "admin",
    "publication": [
        {
            "doi": "10.1371/journal.pgen.1000279",
            "metadata": {
                "abstract": "Imputation-based association methods provide a powerful framework for testing untyped variants for association with phenotypes and for combining results from multiple studies that use different genotyping platforms. Here, we consider several issues that arise when applying these methods in practice, including: (i) factors affecting imputation accuracy, including choice of reference panel; (ii) the effects of imputation accuracy on power to detect associations; (iii) the relative merits of Bayesian and frequentist approaches to testing imputed genotypes for association with phenotype; and (iv) how to quickly and accurately compute Bayes factors for testing imputed SNPs. We find that imputation-based methods can be robust to imputation accuracy and can improve power to detect associations, even when average imputation accuracy is poor. We explain how ranking SNPs for association by a standard likelihood ratio test gives the same results as a Bayesian procedure that uses an unnatural prior assumption - specifically, that difficult-to-impute SNPs tend to have larger effects - and assess the power gained from using a Bayesian approach that does not make this assumption. Within the Bayesian framework, we find that good approximations to a full analysis can be achieved by simply replacing unknown genotypes with a point estimate - their posterior mean. This approximation considerably reduces computational expense compared with published sampling-based approaches, and the methods we present are practical on a genome-wide scale with very modest computational resources (e.g., a single desktop computer). The approximation also facilitates combining information across studies, using only summary data for each SNP. Methods discussed here are implemented in the software package BIMBAM, which is available from http://stephenslab.uchicago.edu/software.html. © 2008 Guan, Stephens.",
                "authors": [
                    {
                        "name": "Guan Y."
                    },
                    {
                        "name": "Stephens M."
                    }
                ],
                "citationCount": 123,
                "date": "2008-12-01T00:00:00Z",
                "journal": "PLoS Genetics",
                "title": "Practical issues in imputation-based association mapping"
            },
            "pmcid": "PMC2585794",
            "pmid": "19057666",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        }
    ],
    "validated": 1
}
