{
    "accessibility": "Open access",
    "additionDate": "2023-01-26T02:05:31.475404Z",
    "biotoolsCURIE": "biotools:sensdeep",
    "biotoolsID": "sensdeep",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "enginaybey@gmail.com",
            "name": "Engin Aybey",
            "orcidid": "http://orcid.org/0000-0002-1780-262X",
            "typeEntity": "Person"
        },
        {
            "email": "ozgur.gumus@ege.edu.tr",
            "name": "Özgür Gümüş",
            "typeEntity": "Person"
        }
    ],
    "description": "An Ensemble Deep Learning Method for Protein-Protein Interaction Sites Prediction.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein interaction prediction",
                    "uri": "http://edamontology.org/operation_2492"
                },
                {
                    "term": "Protein secondary structure prediction",
                    "uri": "http://edamontology.org/operation_0267"
                },
                {
                    "term": "Protein-protein binding site prediction",
                    "uri": "http://edamontology.org/operation_2464"
                }
            ]
        }
    ],
    "homepage": "https://github.com/enginaybey/SENSDeep",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T15:09:17.913502Z",
    "license": "Not licensed",
    "name": "SENSDeep",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1007/s12539-022-00543-x",
            "metadata": {
                "abstract": "Purpose: The determination of which amino acid in a protein interacts with other proteins is important in understanding the functional mechanism of that protein. Although there are experimental methods to detect protein–protein interaction sites (PPISs), these are costly, time-consuming, and require expertise. Therefore, many computational methods have been proposed to accelerate this type of research, but they are generally insufficient to predict PPISs accurately. There is a need for development in this field. Methods: In this study, we introduce a new PPISs prediction method. This method is a sequence-based Stacking ENSemble Deep (SENSDeep) learning method that has an ensemble learning model including the models of RNN, CNN, GRU sequence to sequence (GRUs2s), GRU sequence to sequence with an attention layer (GRUs2satt) and a multilayer perceptron. Two embedded features, secondary structure, and protein sequence information are added to the training data set in addition to twelve existing features to improve the prediction performance of the method. Results: SENSDeep trained on the training data set without two extra features obtains a better performance on some of the independent testing data sets than that of the other methods in the literature, especially on scoring metrics of sensitivity, F1, MCC, and AUPRC, having increments up to 63.5%, 19.3%, 18.5%, 11.4%, respectively. It is shown that the added extra features improve the performance of the method by having almost the same performance with less data as the method trained on the data set without these added features. On the other hand, different sizes of the sliding window are tried on the data sets and an optimal sliding window size for SENSDeep is found. Moreover, SENSDeep has also been compared to structure-based methods. Some of these methods have been found to perform better. Using SENSDeep obtained by training with both training data sets, PPISs prediction examples of various proteins that are not in these training data sets are also presented. Furthermore, execution times for SENSDeep and its submodels are shown. Availability and implementation: https://github.com/enginaybey/SENSDeep.",
                "authors": [
                    {
                        "name": "Aybey E."
                    },
                    {
                        "name": "Gumus O."
                    }
                ],
                "citationCount": 7,
                "date": "2023-03-01T00:00:00Z",
                "journal": "Interdisciplinary Sciences – Computational Life Sciences",
                "title": "SENSDeep: An Ensemble Deep Learning Method for Protein–Protein Interaction Sites Prediction"
            },
            "pmid": "36346583"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Protein binding sites",
            "uri": "http://edamontology.org/topic_3534"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        }
    ],
    "validated": 1
}
