{
    "accessibility": "Open access",
    "additionDate": "2020-10-01T08:03:40Z",
    "biotoolsCURIE": "biotools:rexdb",
    "biotoolsID": "rexdb",
    "collectionID": [
        "ELIXIR-CZ",
        "Czech Republic"
    ],
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "ELIXIR-CZ",
            "typeEntity": "Institute"
        }
    ],
    "description": "REXdb: a reference database of transposable element protein domains",
    "download": [
        {
            "type": "Biological data",
            "url": "http://repeatexplorer.org/?page_id=918"
        },
        {
            "type": "Biological data",
            "url": "https://bitbucket.org/petrnovak/rexdb_for_dant"
        }
    ],
    "editPermission": {
        "authors": [
            "ELIXIR-CZ"
        ],
        "type": "group"
    },
    "elixirCommunity": [
        "Plant Sciences"
    ],
    "elixirNode": [
        "Czech Republic"
    ],
    "elixirPlatform": [
        "Data"
    ],
    "homepage": "http://repeatexplorer.org/?page_id=918",
    "lastUpdate": "2021-04-15T07:33:28.246812Z",
    "license": "Not licensed",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "http://repeatexplorer.org/?page_id=918"
        }
    ],
    "maturity": "Emerging",
    "name": "REXdb",
    "owner": "kavonrtep",
    "publication": [
        {
            "doi": "10.1186/s13100-018-0144-1",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Plant LTR-retrotransposons are classified into two superfamilies, Ty1/copia and Ty3/gypsy. They are further divided into an enormous number of families which are, due to the high diversity of their nucleotide sequences, usually specific to a single or a group of closely related species. Previous attempts to group these families into broader categories reflecting their phylogenetic relationships were limited either to analyzing a narrow range of plant species or to analyzing a small numbers of elements. Furthermore, there is no reference database that allows for similarity based classification of LTR-retrotransposons. Results: We have assembled a database of retrotransposon encoded polyprotein domains sequences extracted from 5410 Ty1/copia elements and 8453 Ty3/gypsy elements sampled from 80 species representing major groups of green plants (Viridiplantae). Phylogenetic analysis of the three most conserved polyprotein domains (RT, RH and INT) led to dividing Ty1/copia and Ty3/gypsy retrotransposons into 16 and 14 lineages respectively. We also characterized various features of LTR-retrotransposon sequences including additional polyprotein domains, extra open reading frames and primer binding sites, and found that the occurrence and/or type of these features correlates with phylogenies inferred from the three protein domains. Conclusions: We have established an improved classification system applicable to LTR-retrotransposons from a wide range of plant species. This system reflects phylogenetic relationships as well as distinct sequence and structural features of the elements. A comprehensive database of retrotransposon protein domains (REXdb) that reflects this classification provides a reference for efficient and unified annotation of LTR-retrotransposons in plant genomes. Access to REXdb related tools is implemented in the RepeatExplorer web server (https://repeatexplorer-elixir.cerit-sc.cz/) or using a standalone version of REXdb that can be downloaded seaparately from RepeatExplorer web page (http://repeatexplorer.org/).",
                "authors": [
                    {
                        "name": "Neumann P."
                    },
                    {
                        "name": "Novak P."
                    },
                    {
                        "name": "Hostakova N."
                    },
                    {
                        "name": "MacAs J."
                    }
                ],
                "citationCount": 48,
                "date": "2019-01-03T00:00:00Z",
                "journal": "Mobile DNA",
                "title": "Systematic survey of plant LTR-retrotransposons elucidates phylogenetic relationships of their polyprotein domains and provides a reference for element classification"
            },
            "pmcid": "PMC6317226",
            "pmid": "30622655",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "validated": 1
}