{
    "accessibility": [
        "Open access"
    ],
    "additionDate": "2018-07-06T11:57:04Z",
    "biotoolsCURIE": "biotools:interevdock2",
    "biotoolsID": "interevdock2",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "raphael.guerois@cea.fr",
            "name": "Raphael Guerois",
            "orcidid": "https://orcid.org/0000-0001-5294-2858",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "jessica.andreani@cea.fr",
            "name": "Jessica Andreani",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Ab initio protein docking based on rigid-body sampling followed by consensus scoring using physics-based and statistical potentials, including the InterEvScore function specifically developed to incorporate co-evolutionary information in docking.",
    "documentation": [
        {
            "type": "General",
            "url": "http://bioserv.rpbs.univ-paris-diderot.fr/services/InterEvDock2/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Protein structure",
                        "uri": "http://edamontology.org/data_1460"
                    },
                    "format": [
                        {
                            "term": "PDB",
                            "uri": "http://edamontology.org/format_1476"
                        }
                    ]
                },
                {
                    "data": {
                        "term": "Protein structure",
                        "uri": "http://edamontology.org/data_1460"
                    },
                    "format": [
                        {
                            "term": "PDB",
                            "uri": "http://edamontology.org/format_1476"
                        }
                    ]
                }
            ],
            "operation": [
                {
                    "term": "Protein-protein docking",
                    "uri": "http://edamontology.org/operation_3899"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Protein complex",
                        "uri": "http://edamontology.org/data_2877"
                    },
                    "format": [
                        {
                            "term": "PDB",
                            "uri": "http://edamontology.org/format_1476"
                        }
                    ]
                }
            ]
        },
        {
            "input": [
                {
                    "data": {
                        "term": "Protein sequence",
                        "uri": "http://edamontology.org/data_2976"
                    },
                    "format": [
                        {
                            "term": "FASTA",
                            "uri": "http://edamontology.org/format_1929"
                        }
                    ]
                },
                {
                    "data": {
                        "term": "Protein sequence",
                        "uri": "http://edamontology.org/data_2976"
                    },
                    "format": [
                        {
                            "term": "FASTA",
                            "uri": "http://edamontology.org/format_1929"
                        }
                    ]
                }
            ],
            "operation": [
                {
                    "term": "Protein modelling",
                    "uri": "http://edamontology.org/operation_0477"
                },
                {
                    "term": "Protein-protein docking",
                    "uri": "http://edamontology.org/operation_3899"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Protein complex",
                        "uri": "http://edamontology.org/data_2877"
                    },
                    "format": [
                        {
                            "term": "PDB",
                            "uri": "http://edamontology.org/format_1476"
                        }
                    ]
                }
            ]
        }
    ],
    "homepage": "https://mobyle.rpbs.univ-paris-diderot.fr/cgi-bin/portal.py#forms::InterEvDock2",
    "lastUpdate": "2020-01-23T15:28:05Z",
    "license": "Freeware",
    "maturity": "Mature",
    "name": "InterEvDock",
    "owner": "reyjul",
    "publication": [
        {
            "metadata": {
                "abstract": "© The Author(s) 2018. Published by Oxford University Press on behalf of Nucleic Acids Research.Computational protein docking is a powerful strategy to predict structures of protein-protein interactions and provides crucial insights for the functional characterization of macromolecular cross-talks. We previously developed InterEvDock, a server for ab initio protein docking based on rigid-body sampling followed by consensus scoring using physics-based and statistical potentials, including the InterEvScore function specifically developed to incorporate co-evolutionary information in docking. InterEvDock2 is a major evolution of InterEvDock which allows users to submit input sequences - not only structures - and multimeric inputs and to specify constraints for the pairwise docking process based on previous knowledge about the interaction. For this purpose, we added modules in InterEvDock2 for automatic template search and comparative modeling of the input proteins. The InterEvDock2 pipeline was benchmarked on 812 complexes for which unbound homology models of the two partners and co-evolutionary information are available in the PPI4DOCK database. InterEvDock2 identified a correct model among the top 10 consensus in 29% of these cases (compared to 15-24% for individual scoring functions) and at least one correct interface residue among 10 predicted in 91% of these cases. InterEvDock2 is thus a unique protein docking server, designed to be useful for the experimental biology community. The InterEvDock2 web interface is available at http://bioserv.rpbs.univ-Paris-diderot.fr/services/InterEvDock2/.",
                "authors": [
                    {
                        "name": "Quignot C."
                    },
                    {
                        "name": "Rey J."
                    },
                    {
                        "name": "Yu J."
                    },
                    {
                        "name": "Tuffery P."
                    },
                    {
                        "name": "Guerois R."
                    },
                    {
                        "name": "Andreani J."
                    }
                ],
                "citationCount": 7,
                "date": "2018-07-02T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "InterEvDock2: An expanded server for protein docking using evolutionary and biological information from homology models and multimeric inputs"
            },
            "pmid": "29741647",
            "type": "Primary",
            "version": "2.0"
        },
        {
            "metadata": {
                "abstract": "© The Author(s) 2016.The structural modeling of protein-protein interactions is key in understanding how cell machineries cross-talk with each other. Molecular docking simulations provide efficient means to explore how two unbound protein structures interact. InterEvDock is a server for protein docking based on a free rigidbody docking strategy. A systematic rigid-body docking search is performed using the FRODOCK program and the resulting models are re-scored with InterEvScore and SOAP-PP statistical potentials. The InterEvScore potential was specifically designed to integrate co-evolutionary information in the docking process. InterEvDock server is thus particularly well suited in case homologous sequences are available for both binding partners. The server returns 10 structures of the most likely consensus models together with 10 predicted residues most likely involved in the interface. In 91% of all complexes tested in the benchmark, at least one residue out of the 10 predicted is involved in the interface, providing useful guidelines for mutagenesis. InterEvDock is able to identify a correct model among the top10 models for 49% of the rigid-body cases with evolutionary information, making it a unique and efficient tool to explore structural interactomes under an evolutionary perspective. The InterEvDock web interface is available at http://bioserv.rpbs.univ-Paris-diderot.fr/services/InterEvDock/.",
                "authors": [
                    {
                        "name": "Yu J."
                    },
                    {
                        "name": "Vavrusa M."
                    },
                    {
                        "name": "Andreani J."
                    },
                    {
                        "name": "Rey J."
                    },
                    {
                        "name": "Tuffery P."
                    },
                    {
                        "name": "Guerois R."
                    }
                ],
                "citationCount": 30,
                "date": "2016-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "InterEvDock: A docking server to predict the structure of protein-protein interactions using evolutionary information"
            },
            "pmid": "27131368",
            "type": "Primary",
            "version": "1.0"
        },
        {
            "metadata": {
                "abstract": "Motivation: Structural prediction of protein interactions currently remains a challenging but fundamental goal. In particular, progress in scoring functions is critical for the efficient discrimination of near-native interfaces among large sets of decoys. Many functions have been developed using knowledge-based potentials, but few make use of multi-body interactions or evolutionary information, although multi-residue interactions are crucial for protein-protein binding and protein interfaces undergo significant selection pressure to maintain their interactions.Results: This article presents InterEvScore, a novel scoring function using a coarse-grained statistical potential including two- and three-body interactions, which provides each residue with the opportunity to contribute in its most favorable local structural environment. Combination of this potential with evolutionary information considerably improves scoring results on the 54 test cases from the widely used protein docking benchmark for which evolutionary information can be collected. We analyze how our way to include evolutionary information gradually increases the discriminative power of InterEvScore. Comparison with several previously published scoring functions (ZDOCK, ZRANK and SPIDER) shows the significant progress brought by InterEvScore. © 2013 The Author 2013. Published by Oxford University Press. All rights reserved.",
                "authors": [
                    {
                        "name": "Andreani J."
                    },
                    {
                        "name": "Faure G."
                    },
                    {
                        "name": "Guerois R."
                    }
                ],
                "citationCount": 35,
                "date": "2013-07-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "InterEvScore: A novel coarse-grained interface scoring function using a multi-body statistical potential coupled to evolution"
            },
            "pmid": "23652426",
            "type": "Method"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Molecular modelling",
            "uri": "http://edamontology.org/topic_2275"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        }
    ],
    "version": [
        "2.0"
    ]
}