{
    "accessibility": "Open access",
    "additionDate": "2022-09-05T22:06:20.168228Z",
    "biotoolsCURIE": "biotools:mlcpp_2.0",
    "biotoolsID": "mlcpp_2.0",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Balachandran Manavalan"
        },
        {
            "name": "Mahesh Chandra Patra"
        }
    ],
    "description": "An Updated Cell-penetrating Peptides and Their Uptake Efficiency Predictor.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Sequence",
                        "uri": "http://edamontology.org/data_2044"
                    },
                    "format": [
                        {
                            "term": "FASTA",
                            "uri": "http://edamontology.org/format_1929"
                        }
                    ]
                }
            ],
            "operation": [
                {
                    "term": "Feature selection",
                    "uri": "http://edamontology.org/operation_3936"
                }
            ]
        }
    ],
    "homepage": "https://balalab-skku.org/mlcpp2/",
    "lastUpdate": "2024-11-24T14:39:01.558665Z",
    "name": "MLCPP 2.0",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "BYX",
    "publication": [
        {
            "doi": "10.1016/j.jmb.2022.167604",
            "metadata": {
                "abstract": "Cell-penetrating peptides (CPPs) translocate into the cell as various biologically active conjugates and possess numerous biomedical applications. Several machine learning-based predictors have been proposed in the past, but they mostly focus on identifying only CPPs. We proposed a two-layered predictor in 2018 in order to predict CPPs and their uptake efficiency simultaneously. While MLCPP has gained widespread access to research, further improvements are needed to enhance its practical application. A new version of MLCPP is presented in this study called MLCPP 2.0, an interpretable stacking model that identifies CPPs and their strength of uptake efficiency. We updated the benchmarking dataset, explored 17 different sequence-based feature encoding algorithms, and used seven different conventional machine learning classifiers. With multiple 10-fold cross-validation, we constructed 119 baseline models whose predicted probability values were merged and treated as a new feature vector. In a systematic way, a feature set and a classifier are identified that are optimal for predicting the CPP and uptake efficiency separately. The MLCPP 2.0 model achieved outstanding performance on the independent test set, significantly outperforming the existing state-of-the-art predictors. Hence, we expect that our proposed MLCPP 2.0 will facilitate the design of hypothesis-driven experiments by enabling the discovery of novel CPPs. MLCPP 2.0 is freely accessible at https://balalab-skku.org/mlcpp2/.",
                "authors": [
                    {
                        "name": "Manavalan B."
                    },
                    {
                        "name": "Patra M.C."
                    }
                ],
                "citationCount": 54,
                "date": "2022-06-15T00:00:00Z",
                "journal": "Journal of Molecular Biology",
                "title": "MLCPP 2.0: An Updated Cell-penetrating Peptides and Their Uptake Efficiency Predictor"
            },
            "pmid": "35662468"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Structural variation",
            "uri": "http://edamontology.org/topic_3175"
        }
    ],
    "validated": 1
}
