{
    "additionDate": "2016-05-24T10:54:36Z",
    "biotoolsCURIE": "biotools:gwips-viz",
    "biotoolsID": "gwips-viz",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Michel AM, Fox G, M Kiran A, De Bo C, O'Connor PB, Heaphy SM",
            "typeEntity": "Person",
            "typeRole": [
                "Developer"
            ]
        },
        {
            "name": "School of Biochemistry & Cell Biology, University College Cork",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        },
        {
            "name": "Science Foundation Ireland",
            "typeEntity": "Funding agency",
            "typeRole": [
                "Contributor"
            ]
        },
        {
            "name": "ucc.ie",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        },
        {
            "email": "gwipsviz@gmail.com",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://gwips.ucc.ie/"
        }
    ],
    "description": "Specialized ribosome profiling (ribo-seq) browser providing free access to the genomic alignments of ribo-seq reads in conjunction with mRNA-seq controls along with relevant annotation tracks. Based on the UCSC Genome Browser, the tool’s ribo-seq tracks for various organisms allows for cross-species comparison of orthologous genes while the separate tracks for each ribo-seq study enables cross-study comparisons.",
    "documentation": [
        {
            "type": [
                "Citation instructions"
            ],
            "url": "http://gwips.ucc.ie/index.html"
        },
        {
            "type": [
                "General"
            ],
            "url": "http://gwips.ucc.ie/Forum/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                },
                {
                    "term": "Gene expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                }
            ]
        }
    ],
    "homepage": "http://gwips.ucc.ie",
    "lastUpdate": "2019-01-10T04:24:39Z",
    "maturity": "Mature",
    "name": "GWIPS-viz",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "A.Michel@ucc.ie",
    "publication": [
        {
            "doi": "10.1093/nar/gkt1035",
            "metadata": {
                "abstract": "We describe the development of GWIPS-viz (http://gwips.ucc.ie), an online genome browser for viewing ribosome profiling data. Ribosome profiling (ribo-seq) is a recently developed technique that provides genome-wide information on protein synthesis (GWIPS) in vivo. It is based on the deep sequencing of ribosome-protected messenger RNA (mRNA) fragments, which allows the ribosome density along all mRNA transcripts present in the cell to be quantified. Since its inception, ribo-seq has been carried out in a number of eukaryotic and prokaryotic organisms. Owing to the increasing interest in ribo-seq, there is a pertinent demand for a dedicated ribo-seq genome browser. GWIPS-viz is based on The University of California Santa Cruz (UCSC) Genome Browser. Ribo-seq tracks, coupled with mRNA-seq tracks, are currently available for several genomes: human, mouse, zebrafish, nematode, yeast, bacteria (Escherichia coli K12, Bacillus subtilis), human cytomegalovirus and bacteriophage lambda. Our objective is to continue incorporating published ribo-seq data sets so that the wider community can readily view ribosome profiling information from multiple studies without the need to carry out computational processing. © 2013 The Author(s). Published by Oxford University Press.",
                "authors": [
                    {
                        "name": "Michel A.M."
                    },
                    {
                        "name": "Fox G."
                    },
                    {
                        "name": "M. Kiran A."
                    },
                    {
                        "name": "De Bo C."
                    },
                    {
                        "name": "O'Connor P.B.F."
                    },
                    {
                        "name": "Heaphy S.M."
                    },
                    {
                        "name": "Mullan J.P.A."
                    },
                    {
                        "name": "Donohue C.A."
                    },
                    {
                        "name": "Higgins D.G."
                    },
                    {
                        "name": "Baranov P.V."
                    }
                ],
                "citationCount": 124,
                "date": "2014-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "GWIPS-viz: Development of a ribo-seq genome browser"
            },
            "pmcid": "PMC3965066",
            "pmid": "24185699",
            "type": [
                "Primary"
            ]
        },
        {
            "metadata": {
                "abstract": "© 2015 The Authors. PROTEOMICS published by Wiley-VCH Verlag GmbH & Co. KGaA, Weinheim.The boundaries of protein coding sequences are more difficult to define at the 5′ end than at the 3′ end due to potential multiple translation initiation sites (TISs). Even in the presence of phylogenetic data, the use of sequence information only may not be sufficient for the accurate identification of TISs. Traditional proteomics approaches may also fail because the N-termini of newly synthesized proteins are often processed. Thus ribosome profiling (ribo-seq), producing a snapshot of the ribosome distribution across the entire transcriptome, is an attractive experimental technique for the purpose of TIS location exploration. The GWIPS-viz (Genome Wide Information on Protein Synthesis visualized) browser (http://gwips.ucc.ie) provides free access to the genomic alignments of ribo-seq data and corresponding mRNA-seq data along with relevant annotation tracks. In this brief, we illustrate how GWIPS-viz can be used to explore the ribosome occupancy at the 5′ ends of protein coding genes to assess the activity of AUG and non-AUG TISs responsible for the synthesis of proteoforms with alternative or heterogeneous N-termini. The presence of ribo-seq tracks for various organisms allows for cross-species comparison of orthologous genes and the availability of datasets from multiple laboratories permits the assessment of the technical reproducibility of the ribosome densities.",
                "authors": [
                    {
                        "name": "Michel A.M."
                    },
                    {
                        "name": "Ahern A.M."
                    },
                    {
                        "name": "Donohue C.A."
                    },
                    {
                        "name": "Baranov P.V."
                    }
                ],
                "citationCount": 17,
                "date": "2015-07-01T00:00:00Z",
                "journal": "Proteomics",
                "title": "GWIPS-viz as a tool for exploring ribosome profiling evidence supporting the synthesis of alternative proteoforms"
            },
            "pmid": "25736862",
            "type": [
                "Other"
            ]
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        }
    ],
    "validated": 1
}