
{
    "credit": [
        {
            "email": "wei@math.msu.edu",
            "name": "Guo-Wei Wei",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://weilab.math.msu.edu/TML/TML-MP/"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Protein folding analysis",
                    "uri": "http://edamontology.org/operation_2415"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Proteins",
                "uri": "http://edamontology.org/topic_0078"
            },
            {
                "term": "Protein variants",
                "uri": "http://edamontology.org/topic_3120"
            },
            {
                "term": "Genetic variation",
                "uri": "http://edamontology.org/topic_0199"
            },
            {
                "term": "Protein folding, stability and design",
                "uri": "http://edamontology.org/topic_0130"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© The Author 2017. Published by Oxford University Press. All rights reserved. Motivation Site directed mutagenesis is widely used to understand the structure and function of biomolecules. Computational prediction of mutation impacts on protein stability offers a fast, economical and potentially accurate alternative to laboratory mutagenesis. Most existing methods rely on geometric descriptions, this work introduces a topology based approach to provide an entirely new representation of mutation induced protein stability changes that could not be obtained from conventional techniques. Results Topology based mutation predictor (T-MP) is introduced to dramatically reduce the geometric complexity and number of degrees of freedom of proteins, while element specific persistent homology is proposed to retain essential biological information. The present approach is found to outperform other existing methods in the predictions of globular protein stability changes upon mutation. A Pearson correlation coefficient of 0.82 with an RMSE of 0.92 kcal/mol is obtained on a test set of 350 mutation samples. For the prediction of membrane protein stability changes upon mutation, the proposed topological approach has a 84% higher Pearson correlation coefficient than the current state-of-the-art empirical methods, achieving a Pearson correlation of 0.57 and an RMSE of 1.09 kcal/mol in a 5-fold cross validation on a set of 223 membrane protein mutation samples. Availability and implementation http://weilab.math.msu.edu/TML/TML-MP/ Contact wei@math.msu.edu Supplementary informationSupplementary dataare available at Bioinformatics online.",
            "authors": [
                "Cang Z.",
                "Wei G.-W."
            ],
            "cit_count": 12,
            "doi": "10.1093/bioinformatics/btx460",
            "journal": "Bioinformatics",
            "title": "Analysis and prediction of protein folding energy changes upon mutation by element specific persistent homology",
            "year": "2017-11-15"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:tml-mp",
        "biotoolsID": "tml-mp",
        "description": "Predictor for protein folding free energy change upon single point mutation for soluble proteins.",
        "homepage": "http://weilab.math.msu.edu/TML/TML-MP/",
        "name": "TML-MP"
    }
}