{
    "additionDate": "2022-10-31T08:39:35.025831Z",
    "biotoolsCURIE": "biotools:deepropre",
    "biotoolsID": "deepropre",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Chun-Hou Zheng"
        },
        {
            "name": "Jian-Ping Zhao"
        },
        {
            "name": "Jing Tian"
        },
        {
            "name": "Zhi-Wen Ma"
        }
    ],
    "description": "DeeProPre, based on convolutional neural network and bidirectional long short-term memory model connecting attention mechanism. It is used for the computational recognition of promoters of with TATA-box, without TATA-box and mixed data types.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                },
                {
                    "term": "Promoter prediction",
                    "uri": "http://edamontology.org/operation_0440"
                }
            ]
        }
    ],
    "homepage": "https://github.com/zzwwmmm/DeeProPre/tree/master",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-10-31T08:39:35.028554Z",
    "license": "GPL-3.0",
    "name": "DeeProPre",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1016/J.COMPBIOLCHEM.2022.107770",
            "metadata": {
                "abstract": "© 2022 Elsevier LtdThe promoter is a DNA sequence recognized, bound and transcribed by RNA polymerase. It is usually located at the upstream or 5′end of the transcription start site (TSS). Studies have shown that the structure of the promoter affects its affinity for RNA polymerase, thus affecting the level of gene expression. Therefore, the correct identification of core promoter and common structural gene is of great significance in the field of biomedicine. At present, many methods have been proposed to improve the accuracy of promoter recognition, but the performances still need to be further improved. In this study, a deep learning algorithm (DeeProPre) based on bidirectional long short-term memory (BiLSTM) and convolutional neural network (CNN) was proposed. Firstly, the supervised embedding layer was applied to map the sequence to a high-dimensional space. Secondly, two 1D convolutional layers, BiLSTM and attentional mechanism layer were used for extracting features. Finally, the full connection layer activated by Sigmoid function was used to obtain the probability of classification into target categories. This model can identify the promoter region of eukaryotes with high accuracy, providing an analytical basis for further understanding of promoter physiological functions and studies of gene transcription mechanisms. The source code of DeeProPre is freely available at https://github.com/zzwwmmm/DeeProPre/tree/master.",
                "authors": [
                    {
                        "name": "Ma Z.-W."
                    },
                    {
                        "name": "Tian J."
                    },
                    {
                        "name": "Zhao J.-P."
                    },
                    {
                        "name": "Zheng C.-H."
                    }
                ],
                "date": "2022-12-01T00:00:00Z",
                "journal": "Computational Biology and Chemistry",
                "title": "DeeProPre: A promoter predictor based on deep learning"
            },
            "pmid": "36116322"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Bioinformatics",
            "uri": "http://edamontology.org/topic_0091"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ]
}
