
{
    "credit": [
        {
            "email": "shrimp@cs.toronto.edu",
            "name": "Shrimp Support",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "https://github.com/compbio-UofT/shrimp/blob/master/README"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence assembly",
                    "uri": "http://edamontology.org/operation_0310"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "C"
        ],
        "operatingSystem": [
            "Linux"
        ],
        "toolType": [
            "Suite"
        ],
        "topic": [
            {
                "term": "Sequence analysis",
                "uri": "http://edamontology.org/topic_0080"
            },
            {
                "term": "Sequence assembly",
                "uri": "http://edamontology.org/topic_0196"
            },
            {
                "term": "Sequencing",
                "uri": "http://edamontology.org/topic_3168"
            }
        ]
    },
    "publication": [
        {
            "abstract": "The development of Next Generation Sequencing technologies, capable of sequencing hundreds of millions of short reads (25-70 bp each) in a single run, is opening the door to population genomic studies of non-model species. In this paper we present SHRiMP - the SHort Read Mapping Package: a set of algorithms and methods to map short reads to a genome, even in the presence of a large amount of polymorphism. Our method is based upon a fast read mapping technique, separate thorough alignment methods for regular letter-space as well as AB SOLiD (color-space) reads, and a statistical model for false positive hits. We use SHRiMP to map reads from a newly sequenced Ciona savignyi individual to the reference genome. We demonstrate that SHRiMP can accurately map reads to this highly polymorphic genome, while confirming high heterozygosity of C. savignyi in this second individual. SHRiMP is freely available at http://compbio.cs. toronto.edu/shrimp. © 2009 Rumble et al.",
            "authors": [
                "Rumble S.M.",
                "Lacroute P.",
                "Dalca A.V.",
                "Fiume M.",
                "Sidow A.",
                "Brudno M."
            ],
            "cit_count": 376,
            "journal": "PLoS Computational Biology",
            "pmid": "19461883",
            "title": "SHRiMP: Accurate mapping of short color-space reads",
            "year": "2009-05-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:shrimp",
        "biotoolsID": "shrimp",
        "description": "Assembles to a reference sequence. Developed with Applied Biosystem's colourspace genomic representation in mind. Authors are Michael Brudno and Stephen Rumble at the University of Toronto. Works with data in letterspace (Roche, Illumina), colourspace (AB) and Helicos space.",
        "homepage": "https://github.com/compbio-UofT/shrimp",
        "name": "SHRiMP"
    }
}