{
    "additionDate": "2017-03-24T11:31:29Z",
    "biotoolsCURIE": "biotools:visant",
    "biotoolsID": "visant",
    "credit": [
        {
            "email": "VisANT@zlab.bu.edu",
            "name": "VisANT Support",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "VisANT is an integrative visual analysis tool for biological networks and pathways that contains modules for querying and integrating KEGG pathways with expression data. VisANT is java-based, and can be run as a java applet, as a java web application, or downloaded and run locally. New functions allow determination of over-representation and expression enrichment, integrated search and navigation of disease and drug hierarchies, drug/disease annotation, etc.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://visant.bu.edu"
        },
        {
            "type": [
                "User manual"
            ],
            "url": "http://visant.bu.edu/vmanual/index.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Weighted correlation network analysis",
                    "uri": "http://edamontology.org/operation_3766"
                },
                {
                    "term": "Pathway or network analysis",
                    "uri": "http://edamontology.org/operation_2497"
                },
                {
                    "term": "Gene-set enrichment analysis",
                    "uri": "http://edamontology.org/operation_2436"
                },
                {
                    "term": "Gene expression correlation",
                    "uri": "http://edamontology.org/operation_3463"
                },
                {
                    "term": "Gene to pathway mapping",
                    "uri": "http://edamontology.org/operation_0533"
                }
            ]
        }
    ],
    "homepage": "http://visant.bu.edu/",
    "language": [
        "Java"
    ],
    "lastUpdate": "2018-12-10T12:58:54Z",
    "name": "VisANT",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "Background: New techniques for determining relationships between biomolecules of all types - genes, proteins, noncoding DNA, metabolites and small molecules - are now making a substantial contribution to the widely discussed explosion of facts about the cell. The data generated by these techniques promote a picture of the cell as an interconnected information network, with molecular components linked with one another in topologies that can encode and represent many features of cellular function. This networked view of biology brings the potential for systematic understanding of living molecular systems. Results: We present VisANT, an application for integrating biomolecular interaction data into a cohesive, graphical interface. This software features a multi-tiered architecture for data flexibility, separating back-end modules for data retrieval from a front-end visualization and analysis package. VisANT is a freely available, open-source tool for researchers, and offers an online interface for a large range of published data sets on biomolecular interactions, including those entered by users. This system is integrated with standard databases for organized annotation, including GenBank, KEGG and SwissProt. VisANT is a Java-based, platform-independent tool suitable for a wide range of biological applications, including studies of pathways, gene regulation and systems biology. Conclusion: VisANT has been developed to provide interactive visual mining of biological interaction data sets. The new software provides a general tool for mining and visualizing such data in the context of sequence, pathway, structure, and associated annotations. Interaction and predicted association data can be combined, overlaid, manipulated and analyzed using a variety of built-in functions. © 2004 Hu et al; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Hu Z."
                    },
                    {
                        "name": "Mellor J."
                    },
                    {
                        "name": "Wu J."
                    },
                    {
                        "name": "DeLisi C."
                    }
                ],
                "citationCount": 165,
                "date": "2004-02-19T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "VisANT: An online visualization and analysis tool for biological interaction data"
            },
            "pmid": "15028117"
        },
        {
            "metadata": {
                "abstract": "The detailed structure of molecular networks, including their dependence on conditions and time, are now routinely assayed by various experimental techniques. Visualization is a vital aid in integrating and interpreting such data. We describe emerging approaches for representing and visualizing systems data and for achieving semantic zooming, or changes in information density concordant with scale. A central challenge is to move beyond the display of a static network to visualizations of networks as a function of time, space and cell state, which capture the adaptability of the cell. We consider approaches for representing the role of protein complexes in the cell cycle, displaying modules of metabolism in a hierarchical format, integrating experimental interaction data with structured vocabularies such as Gene Ontology categories and representing conserved interactions among orthologous groups of genes. © 2007 Nature Publishing Group.",
                "authors": [
                    {
                        "name": "Hu Z."
                    },
                    {
                        "name": "Mellor J."
                    },
                    {
                        "name": "Wu J."
                    },
                    {
                        "name": "Kanehisa M."
                    },
                    {
                        "name": "Stuart J.M."
                    },
                    {
                        "name": "DeLisi C."
                    }
                ],
                "citationCount": 64,
                "date": "2007-05-01T00:00:00Z",
                "journal": "Nature Biotechnology",
                "title": "Towards zoomable multidimensional maps of the cell"
            },
            "pmid": "17483841"
        },
        {
            "metadata": {
                "abstract": "VisANT is a web-based software framework for visualizing and analyzing many types of networks of biological interactions and associations. Networks are a useful computational tool for representing many types of biological data, such as biomolecular interactions, cellular pathways and functional modules. Given user-defined sets of interactions or groupings between genes or proteins, VisANT provides: (i) a visual interface for combining and annotating network data, (ii) supporting function and annotation data for different genomes from the Gene Ontology and KEGG databases and (iii) the statistical and analytical tools needed for extracting topological properties of the user-defined networks. Users can customize, modify, save and share network views with other users, and import basic network data representations from their own data sources, and from standard exchange formats such as PSI-MI and BioPAX. The software framework we employ also supports the development of more sophisticated visualization and analysis functions through its open API for Java-based plug-ins. VisANT is distributed freely via the web at http://visant.bu.edu and can also be downloaded for individual use. © 2005 Oxford University Press.",
                "authors": [
                    {
                        "name": "Hu Z."
                    },
                    {
                        "name": "Mellor J."
                    },
                    {
                        "name": "Wu J."
                    },
                    {
                        "name": "Yamada T."
                    },
                    {
                        "name": "Holloway D."
                    },
                    {
                        "name": "DeLisi C."
                    }
                ],
                "citationCount": 139,
                "date": "2005-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "VisANT: Data-integrating visual framework for biological networks and modules"
            },
            "pmid": "15980487"
        },
        {
            "metadata": {
                "abstract": "With the integration of the KEGG and Predictome databases as well as two search engines for coexpressed genes/proteins using data sets obtained from the Stanford Microarray Database (SMD) and Gene Expression Omnibus (GEO) database, VisANT 3.0 supports exploratory pathway analysis, which includes multi-scale visualization of multiple pathways, editing and annotating pathways using a KEGG compatible visual notation and visualization of expression data in the context of pathways. Expression levels are represented either by color intensity or by nodes with an embedded expression profile. Multiple experiments can be navigated or animated. Known KEGG pathways can be enriched by querying either coexpressed components of known pathway members or proteins with known physical interactions. Predicted pathways for genes/proteins with unknown functions can be inferred from coexpression or physical interaction data. Pathways produced in VisANT can be saved as computer-readable XML format (VisML), graphic images or high-resolution Scalable Vector Graphics (SVG). Pathways in the format of VisML can be securely shared within an interested group or published online using a simple Web link. VisANT is freely available at http://visant.bu.edu. © 2007 The Author(s).",
                "authors": [
                    {
                        "name": "Hu Z."
                    },
                    {
                        "name": "Ng D.M."
                    },
                    {
                        "name": "Yamada T."
                    },
                    {
                        "name": "Chen C."
                    },
                    {
                        "name": "Kawashima S."
                    },
                    {
                        "name": "Mellor J."
                    },
                    {
                        "name": "Linghu B."
                    },
                    {
                        "name": "Kanehisa M."
                    },
                    {
                        "name": "Stuart J.M."
                    },
                    {
                        "name": "DeLisi C."
                    }
                ],
                "citationCount": 60,
                "date": "2007-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "VisANT 3.0: New modules for pathway visualization, editing, prediction and construction"
            },
            "pmid": "17586824"
        },
        {
            "metadata": {
                "abstract": "Despite its wide usage in biological databases and applications, the role of the gene ontology (GO) in network analysis is usually limited to functional annotation of genes or gene sets with auxiliary information on correlations ignored. Here, we report on new capabilities of VisANT-an integrative software platform for the visualization, mining, analysis and modeling of the biological networks-which extend the application of GO in network visualization, analysis and inference. The new VisANT functions can be classified into three categories. (i) Visualization: a new tree-based browser allows visualization of GO hierarchies. GO terms can be easily dropped into the network to group genes annotated under the term, thereby integrating the hierarchical ontology with the network. This facilitates multi-scale visualization and analysis. (ii) Flexible annotation schema: in addition to conventional methods for annotating network nodes with the most specific functional descriptions available, VisANT also provides functions to annotate genes at any customized level of abstraction. (iii) Finding over-represented GO terms and expression-enriched GO modules: two new algorithms have been implemented as VisANT plugins. One detects over-represented GO annotations in any given sub-network and the other finds the GO categories that are enriched in a specified phenotype or perturbed dataset. Both algorithms take account of network topology (i.e. correlations between genes based on various sources of evidence). VisANT is freely available at http://visant.bu.edu.",
                "authors": [
                    {
                        "name": "Hu Z."
                    },
                    {
                        "name": "Hung J.-H."
                    },
                    {
                        "name": "Wang Y."
                    },
                    {
                        "name": "Chang Y.-C."
                    },
                    {
                        "name": "Huang C.-L."
                    },
                    {
                        "name": "Huyck M."
                    },
                    {
                        "name": "Delisi C."
                    }
                ],
                "citationCount": 147,
                "date": "2009-08-04T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "VisANT 3.5: Multi-scale network visualization, analysis and inference based on the gene ontology"
            },
            "pmid": "19465394"
        },
        {
            "metadata": {
                "abstract": "With the rapid accumulation of our knowledge on diseases, disease-related genes and drug targets, network-based analysis plays an increasingly important role in systems biology, systems pharmacology and translational science. The new release of VisANT aims to provide new functions to facilitate the convenient network analysis of diseases, therapies, genes and drugs. With improved understanding of the mechanisms of complex diseases and drug actions through network analysis, novel drug methods (e.g., drug repositioning, multi-target drug and combination therapy) can be designed. More specifically, the new update includes (i) integrated search and navigation of disease and drug hierarchies; (ii) integrated disease-gene, therapy-drug and drug-target association to aid the network construction and filtering; (iii) annotation of genes/drugs using disease/therapy information; (iv) prediction of associated diseases/therapies for a given set of genes/drugs using enrichment analysis; (v) network transformation to support construction of versatile network of drugs, genes, diseases and therapies; (vi) enhanced user interface using docking windows to allow easy customization of node and edge properties with build-in legend node to distinguish different node type. VisANT is freely available at: http://visant.bu.edu.",
                "authors": [
                    {
                        "name": "Hu Z."
                    },
                    {
                        "name": "Chang Y.C."
                    },
                    {
                        "name": "Wang Y."
                    },
                    {
                        "name": "Huang C.L."
                    },
                    {
                        "name": "Liu Y."
                    },
                    {
                        "name": "Tian F."
                    },
                    {
                        "name": "Granger B."
                    },
                    {
                        "name": "Delisi C."
                    }
                ],
                "citationCount": 75,
                "date": "2013-01-01T00:00:00Z",
                "journal": "Nucleic acids research",
                "title": "VisANT 4.0: Integrative network platform to connect genes, drugs, diseases and therapies."
            },
            "pmid": "23716640"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Pharmacology",
            "uri": "http://edamontology.org/topic_0202"
        },
        {
            "term": "Endocrinology and metabolism",
            "uri": "http://edamontology.org/topic_3407"
        }
    ],
    "validated": 1
}