{
    "additionDate": "2017-01-13T13:16:58Z",
    "biotoolsCURIE": "biotools:varscan",
    "biotoolsID": "varscan",
    "credit": [
        {
            "name": "Support Forum",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://sourceforge.net/p/varscan/discussion/1073559"
        }
    ],
    "description": "VarScan, an open source tool for variant detection that is compatible with several short read align-ers.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://dkoboldt.github.io/varscan/using-varscan.html"
        }
    ],
    "editPermission": {
        "authors": [
            "alice",
            "sergitobara"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                }
            ]
        }
    ],
    "homepage": "http://dkoboldt.github.io/varscan/",
    "language": [
        "Java"
    ],
    "lastUpdate": "2024-11-24T15:57:36.820696Z",
    "maturity": "Mature",
    "name": "VarScan",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "seqwiki_import",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btp373",
            "metadata": {
                "abstract": "Massively parallel sequencing technologies hold incredible promise for the study of DNA sequence variation, particularly the identification of variants affecting human disease. The unprecedented throughput and relatively short read lengths of Roche/454, Illumina/Solexa, and other platforms have spurred development of a new generation of sequence alignment algorithms. Yet detection of sequence variants based on short read alignments remains challenging, and most currently available tools are limited to a single platform or aligner type. We present VarScan, an open source tool for variant detection that is compatible with several short read aligners. We demonstrate VarScan's ability to detect SNPs and indels with high sensitivity and specificity, in both Roche/454 sequencing of individuals and deep Illumina/Solexa sequencing of pooled samples. © The Author 2009. Published by Oxford University Press. All rights reserved.",
                "authors": [
                    {
                        "name": "Chen K."
                    },
                    {
                        "name": "Ding L."
                    },
                    {
                        "name": "Koboldt D.C."
                    },
                    {
                        "name": "Larson D.E."
                    },
                    {
                        "name": "Mardis E.R."
                    },
                    {
                        "name": "McLellan M.D."
                    },
                    {
                        "name": "Weinstock G.M."
                    },
                    {
                        "name": "Wilson R.K."
                    },
                    {
                        "name": "Wylie T."
                    }
                ],
                "citationCount": 1007,
                "date": "2009-09-14T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "VarScan: Variant detection in massively parallel sequencing of individual and pooled samples"
            },
            "pmcid": "PMC2734323",
            "pmid": "19542151"
        },
        {
            "doi": "10.1101/gr.129684.111",
            "metadata": {
                "abstract": "Cancer is a disease driven by genetic variation and mutation. Exome sequencing can be utilized for discovering these variants and mutations across hundreds of tumors. Here we present an analysis tool, VarScan 2, for the detection of somatic mutations and copy number alterations (CNAs) in exome data from tumor-normal pairs. Unlike most current approaches, our algorithm reads data from both samples simultaneously; a heuristic and statistical algorithm detects sequence variants and classifies them by somatic status (germline, somatic, or LOH); while a comparison of normalized read depth delineates relative copy number changes. We apply these methods to the analysis of exome sequence data from 151 high-grade ovarian tumors characterized as part of the Cancer Genome Atlas (TCGA). We validated some 7790 somatic coding mutations, achieving 93% sensitivity and 85% precision for single nucleotide variant (SNV) detection. Exome-based CNA analysis identified 29 large-scale alterations and 619 focal events per tumor on average. As in our previous analysis of these data, we observed frequent amplification of oncogenes (e.g., CCNE1, MYC) and deletion of tumor suppressors (NF1, PTEN, and CDKN2A). We searched for additional recurrent focal CNAs using the correlation matrix diagonal segmentation (CMDS) algorithm, which identified 424 significant events affecting 582 genes. Taken together, our results demonstrate the robust performance of VarScan 2 for somatic mutation and CNA detection and shed new light on the landscape of genetic alterations in ovarian cancer. © 2012 by Cold Spring Harbor Laboratory Press.",
                "authors": [
                    {
                        "name": "Ding L."
                    },
                    {
                        "name": "Koboldt D.C."
                    },
                    {
                        "name": "Larson D.E."
                    },
                    {
                        "name": "Lin L."
                    },
                    {
                        "name": "Mardis E.R."
                    },
                    {
                        "name": "McLellan M.D."
                    },
                    {
                        "name": "Miller C.A."
                    },
                    {
                        "name": "Shen D."
                    },
                    {
                        "name": "Wilson R.K."
                    },
                    {
                        "name": "Zhang Q."
                    }
                ],
                "citationCount": 3492,
                "date": "2012-03-01T00:00:00Z",
                "journal": "Genome Research",
                "title": "VarScan 2: Somatic mutation and copy number alteration discovery in cancer by exome sequencing"
            },
            "pmcid": "PMC3290792",
            "pmid": "22300766"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ],
    "validated": 1
}
