{
    "additionDate": "2019-11-14T18:35:09Z",
    "biotoolsCURIE": "biotools:VTA",
    "biotoolsID": "VTA",
    "confidence_flag": "tool",
    "description": "Transcriptional profiling aligned with in situ expression image analysis reveals mosaically-expressed molecular markers for GABA neuron sub-groups in the ventral tegmental area | VTA Expression Data Extractor",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence trimming",
                    "uri": "http://edamontology.org/operation_3192"
                },
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                }
            ]
        }
    ],
    "homepage": "https://gitlab.com/mlinitaur/vta-expression-data-extractor",
    "lastUpdate": "2021-01-03T16:00:25Z",
    "name": "VTA",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1111/EJN.14534",
            "metadata": {
                "abstract": "© 2019 The Authors. European Journal of Neuroscience published by Federation of European Neuroscience Societies and John Wiley & Sons Ltd.γ-Aminobutyric acid (GABA) neurons in the ventral tegmental area (VTA) provide local inhibitory control of dopamine neuron activity and send long-range projections to several target regions including the nucleus accumbens. They play diverse roles in reward and aversion, suggesting that they be comprised of several functionally distinct sub-groups, but our understanding of this diversity has been limited by a lack of molecular markers that might provide genetic entry points for cell type-specific investigations. To address this, we conducted transcriptional profiling of GABA neurons and dopamine neurons using immunoprecipitation of tagged polyribosomes (RiboTag) and RNAseq. First, we directly compared these two transcriptomes in order to obtain a list of genes enriched in GABA neurons compared with dopamine neurons. Next, we created a novel bioinformatic approach, that used the PANTHER (Protein ANalysis THrough Evolutionary Relationships) gene ontology database and VTA gene expression data from the Allen Mouse Brain Atlas, from which we obtained 6 candidate genes: Cbln4, Rxfp3, Rora, Gpr101, Trh and Nrp2. As a final step, we verified the selective expression of these candidate genes in sub-groups of GABA neurons in the VTA (and neighbouring substantia nigra pars compacta) using immunolabelling. Taken together, our study provides a valuable toolbox for the future investigation of GABA neuron sub-groups in the VTA.",
                "authors": [
                    {
                        "name": "Paul E.J."
                    },
                    {
                        "name": "Tossell K."
                    },
                    {
                        "name": "Ungless M.A."
                    }
                ],
                "citationCount": 7,
                "date": "2019-12-01T00:00:00Z",
                "journal": "European Journal of Neuroscience",
                "title": "Transcriptional profiling aligned with in situ expression image analysis reveals mosaically expressed molecular markers for GABA neuron sub-groups in the ventral tegmental area"
            },
            "pmid": "31374129"
        }
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Electron microscopy",
            "uri": "http://edamontology.org/topic_0611"
        }
    ],
    "validated": 1
}