{
    "additionDate": "2018-08-19T09:06:03Z",
    "biotoolsCURIE": "biotools:elsa",
    "biotoolsID": "elsa",
    "credit": [
        {
            "email": "fsun@usc.edu",
            "name": "Fengzhu Sun",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Finding Time-Dependent Associations in Time Series Datasets.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://bitbucket.org/charade/elsa/wiki/Home"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "RNA-seq time series data analysis",
                    "uri": "http://edamontology.org/operation_3565"
                }
            ]
        }
    ],
    "homepage": "http://meta.usc.edu/softs/lsa/",
    "language": [
        "C++",
        "Python"
    ],
    "lastUpdate": "2018-12-10T12:59:01Z",
    "name": "eLSA",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1186/1752-0509-5-S2-S15",
            "metadata": {
                "abstract": "Background: The increasing availability of time series microbial community data from metagenomics and other molecular biological studies has enabled the analysis of large-scale microbial co-occurrence and association networks. Among the many analytical techniques available, the Local Similarity Analysis (LSA) method is unique in that it captures local and potentially time-delayed co-occurrence and association patterns in time series data that cannot otherwise be identified by ordinary correlation analysis. However LSA, as originally developed, does not consider time series data with replicates, which hinders the full exploitation of available information. With replicates, it is possible to understand the variability of local similarity (LS) score and to obtain its confidence interval.Results: We extended our LSA technique to time series data with replicates and termed it extended LSA, or eLSA. Simulations showed the capability of eLSA to capture subinterval and time-delayed associations. We implemented the eLSA technique into an easy-to-use analytic software package. The software pipeline integrates data normalization, statistical correlation calculation, statistical significance evaluation, and association network construction steps. We applied the eLSA technique to microbial community and gene expression datasets, where unique time-dependent associations were identified.Conclusions: The extended LSA analysis technique was demonstrated to reveal statistically significant local and potentially time-delayed association patterns in replicated time series data beyond that of ordinary correlation analysis. These statistically significant associations can provide insights to the real dynamics of biological systems. The newly designed eLSA software efficiently streamlines the analysis and is freely available from the eLSA homepage, which can be accessed at http://meta.usc.edu/softs/lsa. © 2011 Xia et al; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Xia L.C."
                    },
                    {
                        "name": "Steele J.A."
                    },
                    {
                        "name": "Cram J.A."
                    },
                    {
                        "name": "Cardon Z.G."
                    },
                    {
                        "name": "Simmons S.L."
                    },
                    {
                        "name": "Vallino J.J."
                    },
                    {
                        "name": "Fuhrman J.A."
                    },
                    {
                        "name": "Sun F."
                    }
                ],
                "citationCount": 118,
                "date": "2011-12-14T00:00:00Z",
                "journal": "BMC Systems Biology",
                "title": "Extended local similarity analysis (eLSA) of microbial community and other time series data with replicates"
            }
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Systems biology",
            "uri": "http://edamontology.org/topic_2259"
        },
        {
            "term": "Microbiology",
            "uri": "http://edamontology.org/topic_3301"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        }
    ],
    "validated": 1
}