{
    "additionDate": "2017-02-10T14:14:51Z",
    "biotoolsCURIE": "biotools:neuropred",
    "biotoolsID": "neuropred",
    "credit": [
        {
            "email": "jsweedle@illinois.edu",
            "name": "Jonathan V. Sweedler",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "NeuroPred is a tool designed to predict cleavage sites at basic amino acid locations in neuropeptide precursor sequences. Neuropred also computes the mass of the predicted peptides with or without selected post-translational modifications.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "PTM localisation",
                    "uri": "http://edamontology.org/operation_3755"
                },
                {
                    "term": "Protein post-translation modification site prediction",
                    "uri": "http://edamontology.org/operation_0417"
                },
                {
                    "term": "Protein cleavage site prediction",
                    "uri": "http://edamontology.org/operation_0422"
                }
            ]
        }
    ],
    "homepage": "http://stagbeetle.animal.uiuc.edu/cgi-bin/neuropred.py",
    "lastUpdate": "2018-12-10T12:58:47Z",
    "name": "Neuropred",
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "NeuroPred is a web application designed to predict cleavage sites at basic amino acid locations in neuropeptide precursor sequences. The user can study one amino acid sequence or multiple sequences simultaneously, selecting from several prediction models and optional, user-defined functions. Logistic regression models are trained on experimentally verified or published cleavage data from mollusks, mammals and insects, and amino acid motifs reported to be associated with cleavage. Confidence interval limits of the probabilities of cleavage indicate the precision of the predictions; these predictions are transformed into cleavage or non-cleavage events according to user-defined thresholds. In addition to the precursor sequence, NeuroPred accepts user-specified cleavage information, providing model accuracy statistics based on observed and predicted cleavages. Neuropred also computes the mass of the predicted peptides, including user-selectable post-translational modifications. The resulting mass list aids the discovery and confirmation of new neuropeptides using mass spectrometry techniques. The NeuroPred application, manual, reference manuscripts and training sequences are available at http://neuroproteomics. scs.uiuc.edu/ neuropred.html. © The Author 2006. Published by Oxford University Press. All rights reserved.",
                "authors": [
                    {
                        "name": "Southey B.R."
                    },
                    {
                        "name": "Amare A."
                    },
                    {
                        "name": "Zimmerman T.A."
                    },
                    {
                        "name": "Rodriguez-Zas S.L."
                    },
                    {
                        "name": "Sweedler J.V."
                    }
                ],
                "citationCount": 152,
                "date": "2006-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "NeuroPred: A tool to predict cleavage sites in neuropeptide precursors and provide the masses of the resulting peptides"
            },
            "pmid": "16845008"
        },
        {
            "metadata": {
                "abstract": "Predicting the final neuropeptide products from neuropeptides genes has been problematic because of the large number of enzymes responsible for their processing. The basic processing of 22 Aplysia californica prohormones representing 750 cleavage sites have been analyzed and statistically modeled using binary logistic regression analyses. Two models are presented that predict cleavage probabilities at basic residues based on prohormone sequence. The complex model has a correct classification rate of 97%, a sensitivity of 97%, and a specificity of 96% when tested on the Aplysia dataset.",
                "authors": [
                    {
                        "name": "Hummon A.B."
                    },
                    {
                        "name": "Hummon N.P."
                    },
                    {
                        "name": "Corbin R.W."
                    },
                    {
                        "name": "Li L."
                    },
                    {
                        "name": "Vilim F.S."
                    },
                    {
                        "name": "Weiss K.R."
                    },
                    {
                        "name": "Sweedler J.V."
                    }
                ],
                "citationCount": 32,
                "date": "2003-11-01T00:00:00Z",
                "journal": "Journal of Proteome Research",
                "title": "From Precursor to Final Peptides: A Statistical Sequence-Based Approach to Predicting Prohormone Processing"
            },
            "pmid": "14692459"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Protein modifications",
            "uri": "http://edamontology.org/topic_0601"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Protein sites, features and motifs",
            "uri": "http://edamontology.org/topic_3510"
        },
        {
            "term": "Structure prediction",
            "uri": "http://edamontology.org/topic_0082"
        },
        {
            "term": "Protein binding sites",
            "uri": "http://edamontology.org/topic_3534"
        }
    ],
    "validated": 1
}