{
    "accessibility": "Open access",
    "additionDate": "2023-02-15T02:03:53.572616Z",
    "biotoolsCURIE": "biotools:raagr2-net",
    "biotoolsID": "raagr2-net",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Imran Fareed Nizami"
        },
        {
            "name": "Jihyoung Ryu"
        },
        {
            "name": "Kil To Chong",
            "orcidid": "https://orcid.org/0000-0002-1952-0001"
        },
        {
            "name": "Mobeen Ur Rehman",
            "orcidid": "https://orcid.org/0000-0003-0914-7132"
        }
    ],
    "description": "A brain tumor segmentation network using parallel processing of multiple spatial frames.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Rehman1995/RAAGR2-Net",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T15:01:00.861254Z",
    "license": "Not licensed",
    "name": "RAAGR2-Net",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1016/j.compbiomed.2022.106426",
            "metadata": {
                "abstract": "Brain tumors are one of the most fatal cancers. Magnetic Resonance Imaging (MRI) is a non-invasive method that provides multi-modal images containing important information regarding the tumor. Many contemporary techniques employ four modalities: T1-weighted (T1), T1-weighted with contrast (T1c), T2-weighted (T2), and fluid-attenuation-inversion-recovery (FLAIR), each of which provides unique and important characteristics for the location of each tumor. Although several modern procedures provide decent segmentation results on the multimodal brain tumor image segmentation benchmark (BraTS) dataset, they lack performance when evaluated simultaneously on all the regions of MRI images. Furthermore, there is still room for improvement due to parameter limitations and computational complexity. Therefore, in this work, a novel encoder–decoder-based architecture is proposed for the effective segmentation of brain tumor regions. Data pre-processing is performed by applying N4 bias field correction, z-score, and 0 to 1 resampling to facilitate model training. To minimize the loss of location information in different modules, a residual spatial pyramid pooling (RASPP) module is proposed. RASPP is a set of parallel layers using dilated convolution. In addition, an attention gate (AG) module is used to efficiently emphasize and restore the segmented output from extracted feature maps. The proposed modules attempt to acquire rich feature representations by combining knowledge from diverse feature maps and retaining their local information. The performance of the proposed deep network based on RASPP, AG, and recursive residual (R2) block termed RAAGR2-Net is evaluated on the BraTS benchmarks. The experimental results show that the suggested network outperforms existing networks that exhibit the usefulness of the proposed modules for “fine” segmentation. The code for this work is made available online at: https://github.com/Rehman1995/RAAGR2-Net.",
                "authors": [
                    {
                        "name": "Chong K.T."
                    },
                    {
                        "name": "Nizami I.F."
                    },
                    {
                        "name": "Rehman M.U."
                    },
                    {
                        "name": "Ryu J."
                    }
                ],
                "citationCount": 37,
                "date": "2023-01-01T00:00:00Z",
                "journal": "Computers in Biology and Medicine",
                "title": "RAAGR2-Net: A brain tumor segmentation network using parallel processing of multiple spatial frames"
            },
            "pmid": "36565485"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Human biology",
            "uri": "http://edamontology.org/topic_2815"
        },
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        }
    ]
}
