{"credit":[{"typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://primerdigital.com/"}],"function":[{"operation":[{"term":"PCR primer design","uri":"http://edamontology.org/operation_0308"}]}],"labels":{"language":["Java"],"operatingSystem":["Linux","Windows","Mac"],"toolType":["Desktop application"],"topic":[{"term":"Primers","uri":"http://edamontology.org/topic_0632"},{"term":"Enzymes","uri":"http://edamontology.org/topic_0821"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/pcrsetup-tool-planning-pcr-qpcr-reactions.html"}],"publication":[{"abstract":"The polymerase chain reaction is fundamental to molecular biology and is the most important practical molecular technique for the research laboratory. We have developed and tested efficient tools for PCR primer and probe design, which also predict oligonucleotide properties based on experimental studies of PCR efficiency. The tools provide comprehensive facilities for designing primers for most PCR applications and their combinations, including standard, multiplex, long-distance, inverse, real-time, unique, group-specific, bisulphite modification assays, Overlap-Extension PCR Multi-Fragment Assembly, as well as a programme to design oligonucleotide sets for long sequence assembly by ligase chain reaction. The in silico PCR primer or probe search includes comprehensive analyses of individual primers and primer pairs. It calculates the melting temperature for standard and degenerate oligonucleotides including LNA and other modifications, provides analyses for a set of primers with prediction of oligonucleotide properties, dimer and G-quadruplex detection, linguistic complexity. , and provides a dilution and resuspension calculator. © 2011 Elsevier Inc.","authors":["Kalendar R.","Lee D.","Schulman A.H."],"cit_count":99,"doi":"10.1016/j.ygeno.2011.04.009","journal":"Genomics","title":"Java web tools for PCR, in silico PCR, and oligonucleotide assembly and analysis","type":"Primary","year":"2011-08-01"}],"summary":{"biotoolsCURIE":"biotools:pcrsetup","biotoolsID":"pcrsetup","description":"PCRsetup is a tool for planning PCR and qPCR reactions, mixing solutions. The higher quality of primers is help to save PCR efficiency at changing PCR conditions. PCR reaction can set up in room temperature and performed without hot-start enzymes.","homepage":"http://primerdigital.com/tools/ReactionMixture.html","name":"PCRsetup"}}