{
    "accessibility": "Open access",
    "additionDate": "2019-08-09T13:06:24Z",
    "biotoolsCURIE": "biotools:EpiAlignment",
    "biotoolsID": "EpiAlignment",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "szhong@ucsd.edu",
            "name": "Sheng Zhong",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Alignment of genomic regions with both sequence and epigenomic information.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://epialign.ucsd.edu/manual.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "homepage": "https://epialign.ucsd.edu/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-06-16T10:55:25Z",
    "license": "Apache-2.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/Zhong-Lab-UCSD/EpiAlignment_WebApp"
        }
    ],
    "maturity": "Mature",
    "name": "EpiAlignment",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "hans",
    "publication": [
        {
            "doi": "10.1093/NAR/GKZ426",
            "metadata": {
                "abstract": "© 2019 The Author(s).Comparative epigenomics, which subjects both epigenome and genome to interspecies comparison, has become a powerful approach to reveal regulatory features of the genome. Thus elucidated regulatory features surpass the information derived from comparison of genomic sequences alone. Here, we present EpiAlignment, a web-based tool to align genomic regions with both DNA sequence and epigenomic data. EpiAlignment takes DNA sequence and epigenomic profiles derived by ChIP-seq from two species as input data, and outputs the best semi-global alignments. These alignments are based on EpiAlignment scores, computed by a dynamic programming algorithm that accounts for both sequence alignment and epigenome similarity. For timely response, the EpiAlignment web server automatically initiates up to 140 computing threads depending on the size of user input data. For users' convenience, we have pre-compiled the comparable human and mouse epigenome datasets in matched cell types and tissues from the Roadmap Epigenomics and ENCODE consortia. Users can either upload their own data or select pre-compiled datasets as inputs for EpiAlignment analyses. Results are presented in graphical and tabular formats where the entries can be interactively expanded to visualize additional features of these aligned regions. EpiAlignment is available at https://epialign.ucsd.edu/.",
                "authors": [
                    {
                        "name": "Lu J."
                    },
                    {
                        "name": "Cao X."
                    },
                    {
                        "name": "Zhong S."
                    }
                ],
                "date": "2019-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "EpiAlignment: alignment with both DNA sequence and epigenomic data"
            },
            "pmcid": "PMC6602515",
            "pmid": "31114924",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Epigenomics",
            "uri": "http://edamontology.org/topic_3173"
        },
        {
            "term": "ChIP-seq",
            "uri": "http://edamontology.org/topic_3169"
        },
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        }
    ],
    "validated": 1
}