{
    "accessibility": "Open access",
    "additionDate": "2019-05-25T14:43:59Z",
    "biotoolsCURIE": "biotools:NeuroMeasure",
    "biotoolsID": "NeuroMeasure",
    "cost": "Free of charge",
    "description": "Software Package for Quantification of Cortical Motor Maps Using Frameless Stereotaxic Transcranial Magnetic Stimulation.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://github.com/EdwardsLabNeuroSci/NeuroMeasure/blob/master/NeuroMeasure%20v4.4%20User%20Manual.docx"
        },
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/EdwardsLabNeuroSci/NeuroMeasure/blob/master/README.md"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "https://github.com/EdwardsLabNeuroSci/NeuroMeasure/releases"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                }
            ]
        }
    ],
    "homepage": "https://github.com/EdwardsLabNeuroSci/NeuroMeasure",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2020-06-16T10:55:24Z",
    "license": "Unlicense",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/EdwardsLabNeuroSci/NeuroMeasure/issues"
        }
    ],
    "maturity": "Mature",
    "name": "NeuroMeasure",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "Ruta",
    "publication": [
        {
            "doi": "10.3389/fninf.2019.00023",
            "metadata": {
                "abstract": "© 2019 Gerber, McLean, Stephen, Chalco, Arshad, Thickbroom, Silverstein, Tsagaris, Kuceyeski, Friel, Santos and Edwards.The recent enhanced sophistication of non-invasive mapping of the human motor cortex using MRI-guided Transcranial Magnetic Stimulation (TMS) techniques, has not been matched by refinement of methods for generating maps from motor evoked potential (MEP) data, or in quantifying map features. This is despite continued interest in understanding cortical reorganization for natural adaptive processes such as skill learning, or in the case of motor recovery, such as after lesion affecting the corticospinal system. With the observation that TMS-MEP map calculation and quantification methods vary, and that no readily available commercial or free software exists, we sought to establish and make freely available a comprehensive software package that advances existing methods, and could be helpful to scientists and clinician-researchers. Therefore, we developed NeuroMeasure, an open source interactive software application for the analysis of TMS motor cortex mapping data collected from Nexstim® and BrainSight®, two commonly used neuronavigation platforms. NeuroMeasure features four key innovations designed to improve motor mapping analysis: de-dimensionalization of the mapping data, fitting a predictive model, reporting measurements to characterize the motor map, and comparing those measurements between datasets. This software provides a powerful and easy to use workflow for characterizing and comparing motor maps generated with neuronavigated TMS. The software can be downloaded on our github page: https://github.com/EdwardsLabNeuroSci/NeuroMeasure Aim: This paper aims to describe a software platform for quantifying and comparing maps of the human primary motor cortex, using neuronavigated transcranial magnetic stimulation, for the purpose of studying brain plasticity in health and disease.",
                "authors": [
                    {
                        "name": "Gerber M.B."
                    },
                    {
                        "name": "McLean A.C."
                    },
                    {
                        "name": "Stephen S.J."
                    },
                    {
                        "name": "Chalco A.G."
                    },
                    {
                        "name": "Arshad U.M."
                    },
                    {
                        "name": "Thickbroom G.W."
                    },
                    {
                        "name": "Silverstein J."
                    },
                    {
                        "name": "Tsagaris K.Z."
                    },
                    {
                        "name": "Kuceyeski A."
                    },
                    {
                        "name": "Friel K."
                    },
                    {
                        "name": "Santos T.E.G."
                    },
                    {
                        "name": "Edwards D.J."
                    }
                ],
                "date": "2019-04-16T00:00:00Z",
                "journal": "Frontiers in Neuroinformatics",
                "title": "Neuromeasure: A software package for quantification of cortical motor maps using frameless stereotaxic transcranial magnetic stimulation"
            },
            "pmcid": "PMC6499165",
            "pmid": "31105546",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        },
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        },
        {
            "term": "Neurobiology",
            "uri": "http://edamontology.org/topic_3304"
        }
    ]
}