{
    "accessibility": "Open access",
    "additionDate": "2022-04-11T23:31:57.012927Z",
    "biotoolsCURIE": "biotools:allhic",
    "biotoolsID": "allhic",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Qian Zhao"
        },
        {
            "name": "Shengcheng Zhang"
        },
        {
            "name": "Xingtan Zhang"
        },
        {
            "name": "Haibao Tang",
            "orcidid": "https://orcid.org/0000-0002-3460-8570"
        },
        {
            "name": "Ray Ming",
            "orcidid": "https://orcid.org/0000-0002-9417-5789"
        }
    ],
    "description": "Genome scaffolding based on HiC data in heterozygous and high ploidy genomes",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Scaffolding",
                    "uri": "http://edamontology.org/operation_3216"
                }
            ]
        }
    ],
    "homepage": "https://github.com/tanghaibao/allhic",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-04-11T23:33:58.225279Z",
    "license": "BSD-2-Clause",
    "name": "allhic",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1038/s41477-019-0487-8",
            "metadata": {
                "abstract": "© 2019, The Author(s), under exclusive licence to Springer Nature Limited.Construction of chromosome-level assembly is a vital step in achieving the goal of a ‘Platinum’ genome, but it remains a major challenge to assemble and anchor sequences to chromosomes in autopolyploid or highly heterozygous genomes. High-throughput chromosome conformation capture (Hi-C) technology serves as a robust tool to dramatically advance chromosome scaffolding; however, existing approaches are mostly designed for diploid genomes and often with the aim of reconstructing a haploid representation, thereby having limited power to reconstruct chromosomes for autopolyploid genomes. We developed a novel algorithm (ALLHiC) that is capable of building allele-aware, chromosomal-scale assembly for autopolyploid genomes using Hi-C paired-end reads with innovative ‘prune’ and ‘optimize’ steps. Application on simulated data showed that ALLHiC can phase allelic contigs and substantially improve ordering and orientation when compared to other mainstream Hi-C assemblers. We applied ALLHiC on an autotetraploid and an autooctoploid sugar-cane genome and successfully constructed the phased chromosomal-level assemblies, revealing allelic variations present in these two genomes. The ALLHiC pipeline enables de novo chromosome-level assembly of autopolyploid genomes, separating each allele. Haplotype chromosome-level assembly of allopolyploid and heterozygous diploid genomes can be achieved using ALLHiC, overcoming obstacles in assembling complex genomes.",
                "authors": [
                    {
                        "name": "Ming R."
                    },
                    {
                        "name": "Tang H."
                    },
                    {
                        "name": "Zhang S."
                    },
                    {
                        "name": "Zhang X."
                    },
                    {
                        "name": "Zhao Q."
                    }
                ],
                "citationCount": 64,
                "date": "2019-08-01T00:00:00Z",
                "journal": "Nature Plants",
                "title": "Assembly of allele-aware, chromosomal-scale autopolyploid genomes based on Hi-C data"
            },
            "pmid": "31383970"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Data mining",
            "uri": "http://edamontology.org/topic_3473"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        }
    ]
}
