
{
    "credit": [
        {
            "email": "statgen.arunabha@gmail.com",
            "name": "Arunabha Majumdar",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "User manual",
            "url": "https://cran.r-project.org/web/packages/CPBayes/CPBayes.pdf"
        },
        {
            "type": "General",
            "url": "https://cran.r-project.org/web/packages/CPBayes/vignettes/cpbayes.html"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Network simulation",
                    "uri": "http://edamontology.org/operation_3562"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "R"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Library"
        ],
        "topic": [
            {
                "term": "Statistics and probability",
                "uri": "http://edamontology.org/topic_2269"
            },
            {
                "term": "Simulation experiment",
                "uri": "http://edamontology.org/topic_3524"
            },
            {
                "term": "GWAS study",
                "uri": "http://edamontology.org/topic_3517"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© 2018 Majumdar et al. Simultaneous analysis of genetic associations with multiple phenotypes may reveal shared genetic susceptibility across traits (pleiotropy). For a locus exhibiting overall pleiotropy, it is important to identify which specific traits underlie this association. We propose a Bayesian meta-analysis approach (termed CPBayes) that uses summary-level data across multiple phenotypes to simultaneously measure the evidence of aggregate-level pleiotropic association and estimate an optimal subset of traits associated with the risk locus. This method uses a unified Bayesian statistical framework based on a spike and slab prior. CPBayes performs a fully Bayesian analysis by employing the Markov Chain Monte Carlo (MCMC) technique Gibbs sampling. It takes into account heterogeneity in the size and direction of the genetic effects across traits. It can be applied to both cohort data and separate studies of multiple traits having overlapping or non-overlapping subjects. Simulations show that CPBayes can produce higher accuracy in the selection of associated traits underlying a pleiotropic signal than the subset-based meta-analysis ASSET. We used CPBayes to undertake a genome-wide pleiotropic association study of 22 traits in the large Kaiser GERA cohort and detected six independent pleiotropic loci associated with at least two phenotypes. This includes a locus at chromosomal region 1q24.2 which exhibits an association simultaneously with the risk of five different diseases: Dermatophytosis, Hemorrhoids, Iron Deficiency, Osteoporosis and Peripheral Vascular Disease. We provide an R-package ‘CPBayes’ implementing the proposed method.",
            "authors": [
                "Majumdar A.",
                "Haldar T.",
                "Bhattacharya S.",
                "Witte J.S."
            ],
            "cit_count": 2,
            "doi": "10.1371/journal.pgen.1007139",
            "journal": "PLoS Genetics",
            "title": "An efficient Bayesian meta-analysis approach for studying cross-phenotype genetic associations",
            "type": "Primary",
            "year": "2018-02-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:cpbayes",
        "biotoolsID": "cpbayes",
        "description": "A Bayesian meta-analysis method for studying cross-phenotype genetic associations. It uses summary-level data across multiple phenotypes to simultaneously measure the evidence of aggregate-level pleiotropic association and estimate an optimal subset of traits associated with the risk locus.",
        "homepage": "https://cran.r-project.org/web/packages/CPBayes/index.html",
        "name": "CPBayes"
    }
}