{
    "additionDate": "2021-01-18T09:07:48Z",
    "biotoolsCURIE": "biotools:artdeco",
    "biotoolsID": "artdeco",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "cbenner@ucsd.edu",
            "name": "Christopher Benner",
            "orcidid": "https://orcid.org/0000-0002-4618-0719",
            "typeEntity": "Person"
        }
    ],
    "description": "ARTDeco is a pipeline for analyzing and characterizing transcriptional readthrough. ARTDeco functions to process a set of BAM files such that transcriptional readthrough can be quantified via a variety of measures including read-in levels, readthrough levels, downstream of gene (DoG) transcript detection, and inference of read-in genes. ARTDeco can also correct gene expression values by using read-in levels to deconvolute native gene expression and contribution from upstream readthrough transcription. ARTDeco works on both single-end and paired-end data, stranded and unstranded data, and forward and reverse strand oriented data.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Deisotoping",
                    "uri": "http://edamontology.org/operation_3629"
                },
                {
                    "term": "Differential gene expression analysis",
                    "uri": "http://edamontology.org/operation_3223"
                },
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                },
                {
                    "term": "Peak calling",
                    "uri": "http://edamontology.org/operation_3222"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                }
            ]
        }
    ],
    "homepage": "https://github.com/sjroth/ARTDeco",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-01-28T19:19:16Z",
    "license": "MIT",
    "name": "ARTDeco",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1186/S12859-020-03551-0",
            "metadata": {
                "abstract": "© 2020 The Author(s).Background: Mounting evidence suggests several diseases and biological processes target transcription termination to misregulate gene expression. Disruption of transcription termination leads to readthrough transcription past the 3′ end of genes, which can result in novel transcripts, changes in epigenetic states and altered 3D genome structure. Results: We developed Automatic Readthrough Transcription Detection (ARTDeco), a tool to detect and analyze multiple features of readthrough transcription from RNA-seq and other next-generation sequencing (NGS) assays that profile transcriptional activity. ARTDeco robustly quantifies the global severity of readthrough phenotypes, and reliably identifies individual genes that fail to terminate (readthrough genes), are aberrantly transcribed due to upstream termination failure (read-in genes), and novel transcripts created as a result of readthrough (downstream of gene or DoG transcripts). We used ARTDeco to characterize readthrough transcription observed during influenza A virus (IAV) infection, validating its specificity and sensitivity by comparing its performance in samples infected with a mutant virus that fails to block transcription termination. We verify ARTDeco's ability to detect readthrough as well as identify read-in genes from different experimental assays across multiple experimental systems with known defects in transcriptional termination, and show how these results can be leveraged to improve the interpretation of gene expression and downstream analysis. Applying ARTDeco to a gene expression data set from IAV-infected monocytes from different donors, we find strong evidence that read-in gene-associated expression quantitative trait loci (eQTLs) likely regulate genes upstream of read-in genes. This indicates that taking readthrough transcription into account is important for the interpretation of eQTLs in systems where transcription termination is blocked. Conclusions: ARTDeco aids researchers investigating readthrough transcription in a variety of systems and contexts.",
                "authors": [
                    {
                        "name": "Benner C."
                    },
                    {
                        "name": "Heinz S."
                    },
                    {
                        "name": "Roth S.J."
                    }
                ],
                "citationCount": 2,
                "date": "2020-05-26T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "ARTDeco: Automatic readthrough transcription detection"
            },
            "pmcid": "PMC7249449",
            "pmid": "32456667"
        }
    ],
    "toolType": [
        "Command-line tool",
        "Workflow"
    ],
    "topic": [
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ]
}
