{
    "additionDate": "2017-08-03T18:44:00Z",
    "biotoolsCURIE": "biotools:gate",
    "biotoolsID": "gate",
    "credit": [
        {
            "email": "yu68@illinois.edu",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Probabilistic model to annotate the genome. This model detects similar but not necessarily synchronous epigenomic changes in different genomic segments.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://systemsbio.ucsd.edu/GATE/Usage.htm"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genome annotation",
                    "uri": "http://edamontology.org/operation_0362"
                }
            ]
        }
    ],
    "homepage": "http://systemsbio.ucsd.edu/GATE/",
    "language": [
        "R",
        "C"
    ],
    "lastUpdate": "2018-12-10T12:58:51Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/gate-20120721-genomic-annotation-temporal-epigenomic-data.html"
        }
    ],
    "name": "GATE",
    "operatingSystem": [
        "Linux",
        "Windows"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Spatial organization of different epigenomic marks was used to infer functions of the epigenome. It remains unclear what can be learned from the temporal changes of the epigenome. Here, we developed a probabilistic model to cluster genomic sequences based on the similarity of temporal changes of multiple epigenomic marks during a cellular differentiation process. We differentiated mouse embryonic stem (ES) cells into mesendoderm cells. At three time points during this differentiation process, we used high-throughput sequencing to measure seven histone modifications and variants- H3K4me1/2/3, H3K27ac, H3K27me3, H3K36me3, and H2A.Z; two DNA modifications-5-mC and 5-hmC; and transcribed mRNAs and noncoding RNAs (ncRNAs). Genomic sequences were clustered based on the spatiotemporal epigenomic information. These clusters not only clearly distinguished gene bodies, promoters, and enhancers, but also were predictive of bidirectional promoters, miRNA promoters, and piRNAs. This suggests specific epigenomic patterns exist on piRNA genes much earlier than germ cell development. Temporal changes of H3K4me2, unmethylated CpG, and H2A.Z were predictive of 5-hmC changes, suggesting unmethylated CpG and H3K4me2 as potential upstream signals guiding TETs to specific sequences. Several rules on combinatorial epigenomic changes and their effects on mRNA expression and ncRNA expression were derived, including a simple rule governing the relationship between 5-hmC and gene expression levels. A Sox17 enhancer containing a FOXA2 binding site and a Foxa2 enhancer containing a SOX17 binding site were identified, suggesting a positive feedback loop between the two mesendoderm transcription factors. These data illustrate the power of using epigenome dynamics to investigate regulatory functions. © 2013, Published by Cold Spring Harbor Laboratory Press.",
                "authors": [
                    {
                        "name": "Yu P."
                    },
                    {
                        "name": "Xiao S."
                    },
                    {
                        "name": "Xin X."
                    },
                    {
                        "name": "Song C.-X."
                    },
                    {
                        "name": "Huang W."
                    },
                    {
                        "name": "McDee D."
                    },
                    {
                        "name": "Tanaka T."
                    },
                    {
                        "name": "Wang T."
                    },
                    {
                        "name": "He C."
                    },
                    {
                        "name": "Zhong S."
                    }
                ],
                "citationCount": 46,
                "date": "2013-02-01T00:00:00Z",
                "journal": "Genome Research",
                "title": "Spatiotemporal clustering of the epigenome reveals rules of dynamic gene regulation"
            },
            "pmid": "23033340"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Data submission, annotation and curation",
            "uri": "http://edamontology.org/topic_0219"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        }
    ],
    "validated": 1
}