{
    "additionDate": "2021-01-18T08:06:24Z",
    "biotoolsCURIE": "biotools:iggeneusage",
    "biotoolsID": "iggeneusage",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "simo.kitanovski@uni-due.de",
            "name": "Simo Kitanovski",
            "typeEntity": "Person"
        }
    ],
    "description": "Differential gene usage in immune repertoires.\n\nDecoding the properties of immune repertoires is key in understanding the response of adaptive immunity to challenges such as viral infection. One important task in immune repertoire profiling is the detection of biases in Ig gene usage between biological conditions. IgGeneUsage is a computational tool for the analysis of differential gene usage in immune repertoires. It employs Bayesian hierarchical models to fit complex gene usage data from immune repertoire sequencing experiments and quantifies Ig gene usage biases as probabilities.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Differential gene expression analysis",
                    "uri": "http://edamontology.org/operation_3223"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Peptide immunogenicity prediction",
                    "uri": "http://edamontology.org/operation_0252"
                }
            ]
        }
    ],
    "homepage": "https://bioconductor.org/packages/IgGeneUsage/",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-02-03T07:41:37Z",
    "name": "IgGeneUsage",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAA174",
            "metadata": {
                "abstract": "© 2020 The Author(s) 2020. Published by Oxford University Press. All rights reserved. For permissions, please e-mail: journals.permissions@oup.com.Decoding the properties of immune repertoires is key to understanding the adaptive immune response to challenges such as viral infection. One important quantitative property is differential usage of Ig genes between biological conditions. Yet, most analyses for differential Ig gene usage are performed qualitatively or with inadequate statistical methods. Here we introduce IgGeneUsage, a computational tool for the analysis of differential Ig gene usage. IgGeneUsage employs Bayesian inference with hierarchical models to analyze complex gene usage data from high-throughput sequencing experiments of immune repertoires. It quantifies differential Ig gene usage probabilistically and avoids some common problems related to the current practice of null-hypothesis significance testing. Contact: simo.kitanovski@uni-due.de",
                "authors": [
                    {
                        "name": "Kitanovski S."
                    },
                    {
                        "name": "Hoffmann D."
                    }
                ],
                "citationCount": 1,
                "date": "2020-06-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "IgGeneUsage: Differential gene usage in immune repertoires"
            },
            "pmid": "32163125"
        }
    ],
    "toolType": [
        "Plug-in"
    ],
    "topic": [
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        },
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        },
        {
            "term": "Bioinformatics",
            "uri": "http://edamontology.org/topic_0091"
        }
    ]
}