{
    "additionDate": "2021-03-19T08:31:05Z",
    "biotoolsCURIE": "biotools:megar",
    "biotoolsID": "megar",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "taehyuk.ahn@slu.edu",
            "name": "Tae-Hyuk Ahn",
            "orcidid": "https://orcid.org/0000-0002-7281-9459",
            "typeEntity": "Person"
        }
    ],
    "description": "An interactive R package for rapid sample classification and phenotype prediction using metagenome profiles and machine learning.\n\nMegaR: A user-friendly interactive machine learning interface for metagenomic analysis to identify and predict disease sample accurately.\n\nMachine learning has been utilized in many applications from biomedical imaging to business analytics. Machine learning is stipulated to be a strong method for diagnostics and even for determining therapeutics in future as we move to personalized medicine. MegaR provides an unprecedented opportunity to develop machine learning models from metagenomic data available publicly as well as to perform classification of data samples based on the optimal model we developed.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence trimming",
                    "uri": "http://edamontology.org/operation_3192"
                },
                {
                    "term": "Splitting",
                    "uri": "http://edamontology.org/operation_3359"
                },
                {
                    "term": "Taxonomic classification",
                    "uri": "http://edamontology.org/operation_3460"
                }
            ]
        }
    ],
    "homepage": "https://github.com/BioHPC/MegaR",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-05-04T06:53:49Z",
    "license": "GPL-3.0",
    "name": "MegaR",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1186/S12859-020-03933-4",
            "metadata": {
                "abstract": "© 2021, The Author(s).Background: Diverse microbiome communities drive biogeochemical processes and evolution of animals in their ecosystems. Many microbiome projects have demonstrated the power of using metagenomics to understand the structures and factors influencing the function of the microbiomes in their environments. In order to characterize the effects from microbiome composition for human health, diseases, and even ecosystems, one must first understand the relationship of microbes and their environment in different samples. Running machine learning model with metagenomic sequencing data is encouraged for this purpose, but it is not an easy task to make an appropriate machine learning model for all diverse metagenomic datasets. Results: We introduce MegaR, an R Shiny package and web application, to build an unbiased machine learning model effortlessly with interactive visual analysis. The MegaR employs taxonomic profiles from either whole metagenome sequencing or 16S rRNA sequencing data to develop machine learning models and classify the samples into two or more categories. It provides various options for model fine tuning throughout the analysis pipeline such as data processing, multiple machine learning techniques, model validation, and unknown sample prediction that can be used to achieve the highest prediction accuracy possible for any given dataset while still maintaining a user-friendly experience. Conclusions: Metagenomic sample classification and phenotype prediction is important particularly when it applies to a diagnostic method for identifying and predicting microbe-related human diseases. MegaR provides various interactive visualizations for user to build an accurate machine-learning model without difficulty. Unknown sample prediction with a properly trained model using MegaR will enhance researchers to identify the sample property in a fast turnaround time.",
                "authors": [
                    {
                        "name": "Ahn T.-H."
                    },
                    {
                        "name": "Dhungel E."
                    },
                    {
                        "name": "Gwak H.-J."
                    },
                    {
                        "name": "Mreyoud Y."
                    },
                    {
                        "name": "Rajeh A."
                    },
                    {
                        "name": "Rho M."
                    }
                ],
                "date": "2021-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "MegaR: an interactive R package for rapid sample classification and phenotype prediction using metagenome profiles and machine learning"
            },
            "pmcid": "PMC7814621",
            "pmid": "33461494"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Gene and protein families",
            "uri": "http://edamontology.org/topic_0623"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "Microbial ecology",
            "uri": "http://edamontology.org/topic_3697"
        },
        {
            "term": "Personalised medicine",
            "uri": "http://edamontology.org/topic_3577"
        }
    ]
}
