
{
    "credit": [
        {
            "email": "natlie.ahn@colorado.edu",
            "name": "Natalie Ahn",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Protein identification",
                    "uri": "http://edamontology.org/operation_3767"
                }
            ]
        }
    ],
    "labels": {
        "collectionID": [
            "Proteomics"
        ],
        "language": [
            "Perl"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Proteomics",
                "uri": "http://edamontology.org/topic_0121"
            }
        ]
    },
    "publication": [
        {
            "abstract": "When analyzing proteins in complex samples using tandem mass spectrometry of peptides generated by proteolysis, the inference of proteins can be ambiguous, even with well-validated peptides. Unresolved questions include whether to show all possible proteins vs a minimal list, what to do when proteins are inferred ambiguously, and how to quantify peptides that bridge multiple proteins, each with distinguishing evidence. Here we describe IsoformResolver, a peptide-centric protein inference algorithm that clusters proteins in two ways, one based on peptides experimentally identified from MS/MS spectra, and the other based on peptides derived from an in silico digest of the protein database. MS/MS-derived protein groups report minimal list proteins in the context of all possible proteins, without redundantly listing peptides. In silico-derived protein groups pull together functionally related proteins, providing stable identifiers. The peptide-centric grouping strategy used by IsoformResolver allows proteins to be displayed together when they share peptides in common, providing a comprehensive yet concise way to organize protein profiles. It also summarizes information on spectral counts and is especially useful for comparing results from multiple LC-MS/MS experiments. Finally, we examine the relatedness of proteins within IsoformResolver groups and compare its performance to other protein inference software. © 2011 American Chemical Society.",
            "authors": [
                "Meyer-Arendt K.",
                "Old W.M.",
                "Houel S.",
                "Renganathan K.",
                "Eichelberger B.",
                "Resing K.A.",
                "Ahn N.G."
            ],
            "cit_count": 31,
            "doi": "10.1021/pr200039p",
            "journal": "Journal of Proteome Research",
            "title": "IsoformResolver: A peptide-centric algorithm for protein inference",
            "type": "Primary",
            "year": "2011-07-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:isoformresolver",
        "biotoolsID": "isoformresolver",
        "description": "A peptide-centric algorithm for protein inference.",
        "homepage": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3167374/",
        "name": "IsoformResolver"
    }
}