{
    "additionDate": "2019-11-14T18:43:05Z",
    "biotoolsCURIE": "biotools:TDA",
    "biotoolsID": "TDA",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "mkchung@wisc.edu",
            "name": "Moo K. Chung",
            "typeEntity": "Person"
        }
    ],
    "description": "> LOW CONFIDENCE! | > CORRECT NAME OF TOOL COULD ALSO BE 'Betti', 'resting-state' | Exact topological inference of the resting-state brain networks in twins | Exact Topological Inference (ETI) for Brain Networks | The data/codes presented here is published in [4,5,6]. Using the data, we will show how to construct Betti plots from weighted brain graphs, where the weights are Pearson correlations. Then show how to perform the exact topological inference and obtain the p-value on the Betti plots. The Betti plots are the basic data visualization technique in persistent homology but statistical inference procedure has been lacking in the field [1,2,3]. New exact topological inference framework is developed for determining statistical significance of Betti plots | The codes have been tested with MacBook Pro with MATLAB 2016",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Network simulation",
                    "uri": "http://edamontology.org/operation_3562"
                },
                {
                    "term": "Scaffolding",
                    "uri": "http://edamontology.org/operation_3216"
                }
            ]
        }
    ],
    "homepage": "http://www.stat.wisc.edu/~mchung/TDA",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2020-12-27T15:08:56Z",
    "name": "TDA",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1162/NETN_A_00091",
            "metadata": {
                "abstract": "© 2019 Massachusetts Institute of Technology.A cycle in a brain network is a subset of a connected component with redundant additional connections. If there are many cycles in a connected component, the connected component is more densely connected. Whereas the number of connected components represents the integration of the brain network, the number of cycles represents how strong the integration is. However, it is unclear how to perform statistical inference on the number of cycles in the brain network. In this study, we present a new statistical inference framework for determining the significance of the number of cycles through the Kolmogorov-Smirnov (KS) distance, which was recently introduced to measure the similarity between networks across different filtration values by using the zeroth Betti number. In this paper, we show how to extend the method to the first Betti number, which measures the number of cycles. The performance analysis was conducted using the random network simulations with ground truths. By using a twin imaging study, which provides biological ground truth, the methods are applied in determining if the number of cycles is a statistically significant heritable network feature in the resting-state functional connectivity in 217 twins obtained from the Human Connectome Project. The MATLAB codes as well as the connectivity matrices used in generating results are provided at http://www.stat.wisc.edu/~mchung/TDA.",
                "authors": [
                    {
                        "name": "Chung M.K."
                    },
                    {
                        "name": "Di Christofano A."
                    },
                    {
                        "name": "Lee H."
                    },
                    {
                        "name": "Ombao H."
                    },
                    {
                        "name": "Solo V."
                    }
                ],
                "citationCount": 11,
                "date": "2019-01-01T00:00:00Z",
                "journal": "Network Neuroscience",
                "title": "Exact topological inference of the resting-state brain networks in twins"
            },
            "pmcid": "PMC6663192",
            "pmid": "31410373"
        }
    ],
    "topic": [
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ],
    "validated": 1
}
