{
    "additionDate": "2017-08-03T18:54:53Z",
    "biotoolsCURIE": "biotools:psvs",
    "biotoolsID": "psvs",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www-nmr.cabm.rutgers.edu/about/contact.htm"
        }
    ],
    "description": "It evaluates the quality of protein structures. It integrates analyses from several widely-used structure quality evaluation tools. It provides standard constraint analyses, statistics on the PDB validation goodness-of-fit between structures and experimental data, and knowledge-based structure quality scores in standardized format suitable for database integration. Global quality measures are reported as Z scores, based on calibration with a set of high-resolution X-ray crystal structures.",
    "documentation": [
        {
            "type": "User manual",
            "url": "http://psvs-1_5-dev.nesg.org/htdocs/psvs_help.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein sequence analysis",
                    "uri": "http://edamontology.org/operation_2479"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Protein model validation",
                    "uri": "http://edamontology.org/operation_0321"
                }
            ]
        }
    ],
    "homepage": "http://psvs-1_5-dev.nesg.org/",
    "lastUpdate": "2018-12-10T12:58:59Z",
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/psvs-1-5-protein-structure-validation-software-suite.html"
        }
    ],
    "name": "PSVS",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Structural genomics projects are providing large quantities of new 3D structural data for proteins. To monitor the quality of these data, we have developed the protein structure validation software suite (PSVS), for assessment of protein structures generated by NMR or X-ray crystallographic methods. PSVS is broadly applicable for structure quality assessment in structural biology projects. The software integrates under a single interface analyses from several widely-used structure quality evaluation tools, including PROCHECK (Laskowski et al., J Appl Crystallog 1993;26:283-291), MolProbity (Lovell et al., Proteins 2003;50:437-450), Verify3D (Luthy et al. Nature 1992;358:83-85), ProsaII (Sippl, Proteins 1993;17: 355-362), the PDB validation software, and various structure-validation tools developed in our own laboratory. PSVS provides standard constraint analyses, statistics on goodness-of-fit between structures and experimental data, and knowledge-based structure quality scores in standardized format suitable for database integration. The analysis provides both global and site-specific measures of protein structure quality. Global quality measures are reported as Z scores, based on calibration with a set of high-resolution X-ray crystal structures. PSVS is particularly useful in assessing protein, structures determined by NMR methods, but is also valuable for assessing X-ray crystal structures or homology models. Using these tools, we assessed protein structures generated by the Northeast Structural Genomics Consortium and other international structural genomics projects, over a 5-year period. Protein structures produced from structural genomics projects exhibit quality score distributions similar to those of structures produced in traditional structural biology projects during the same time period. However, while some NMR structures have structure quality scores similar to those seen in higher-resolution X-ray crystal structures, the majority of NMR structures have lower scores. Potential reasons for this \"structure quality score gap\" between NMR and X-ray crystal structures are discussed. © 2006 Wiley-Liss, Inc.",
                "authors": [
                    {
                        "name": "Bhattacharya A."
                    },
                    {
                        "name": "Tejero R."
                    },
                    {
                        "name": "Montelione G.T."
                    }
                ],
                "citationCount": 400,
                "date": "2007-03-01T00:00:00Z",
                "journal": "Proteins: Structure, Function and Genetics",
                "title": "Evaluating protein structures determined by structural genomics consortia"
            },
            "pmid": "17186527"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        },
        {
            "term": "Data quality management",
            "uri": "http://edamontology.org/topic_3572"
        },
        {
            "term": "Protein structure analysis",
            "uri": "http://edamontology.org/topic_2814"
        }
    ],
    "validated": 1
}