{
    "additionDate": "2020-01-09T17:50:34Z",
    "biotoolsCURIE": "biotools:GENAVi",
    "biotoolsID": "GENAVi",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "michelle.jones@csmc.edu",
            "name": "Michelle R. Jones",
            "orcidid": "https://orcid.org/0000-0001-5466-3844",
            "typeEntity": "Person"
        }
    ],
    "description": "a shiny web application for gene expression normalization, analysis and visualization.\n\nGENAVi (Gene Expression Normalization Analysis and Visualization) is an rshiny web application that provides a GUI based platform for the analysis of gene expression data.\n\nGENAVi combines several R packages commonly used for normalizing, clustering, visualizing, and performing differential expression analysis (DEA) on RNA-seq data",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Expression data visualisation",
                    "uri": "http://edamontology.org/operation_0571"
                },
                {
                    "term": "Gene-set enrichment analysis",
                    "uri": "http://edamontology.org/operation_2436"
                },
                {
                    "term": "Principal component visualisation",
                    "uri": "http://edamontology.org/operation_2939"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://junkdnalab.shinyapps.io/GENAVi/",
    "language": [
        "R"
    ],
    "lastUpdate": "2020-12-03T07:26:40Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/alpreyes/GENAVi"
        }
    ],
    "name": "GENAVi",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12864-019-6073-7",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: The development of next generation sequencing (NGS) methods led to a rapid rise in the generation of large genomic datasets, but the development of user-friendly tools to analyze and visualize these datasets has not developed at the same pace. This presents a two-fold challenge to biologists; the expertise to select an appropriate data analysis pipeline, and the need for bioinformatics or programming skills to apply this pipeline. The development of graphical user interface (GUI) applications hosted on web-based servers such as Shiny can make complex workflows accessible across operating systems and internet browsers to those without programming knowledge. Results: We have developed GENAVi (Gene Expression Normalization Analysis and Visualization) to provide a user-friendly interface for normalization and differential expression analysis (DEA) of human or mouse feature count level RNA-Seq data. GENAVi is a GUI based tool that combines Bioconductor packages in a format for scientists without bioinformatics expertise. We provide a panel of 20 cell lines commonly used for the study of breast and ovarian cancer within GENAVi as a foundation for users to bring their own data to the application. Users can visualize expression across samples, cluster samples based on gene expression or correlation, calculate and plot the results of principal components analysis, perform DEA and gene set enrichment and produce plots for each of these analyses. To allow scalability for large datasets we have provided local install via three methods. We improve on available tools by offering a range of normalization methods and a simple to use interface that provides clear and complete session reporting and for reproducible analysis. Conclusion: The development of tools using a GUI makes them practical and accessible to scientists without bioinformatics expertise, or access to a data analyst with relevant skills. While several GUI based tools are currently available for RNA-Seq analysis we improve on these existing tools. This user-friendly application provides a convenient platform for the normalization, analysis and visualization of gene expression data for scientists without bioinformatics expertise.",
                "authors": [
                    {
                        "name": "Berman B.P."
                    },
                    {
                        "name": "Chen S."
                    },
                    {
                        "name": "Coetzee S.G."
                    },
                    {
                        "name": "Davis B.D."
                    },
                    {
                        "name": "Gayther S.A."
                    },
                    {
                        "name": "Hazelett D.J."
                    },
                    {
                        "name": "Jones M.R."
                    },
                    {
                        "name": "Lawrenson K."
                    },
                    {
                        "name": "Plummer J.T."
                    },
                    {
                        "name": "Reyes A.L.P."
                    },
                    {
                        "name": "Silva T.C."
                    }
                ],
                "citationCount": 6,
                "date": "2019-10-16T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "GENAVi: A shiny web application for gene expression normalization, analysis and visualization"
            },
            "pmcid": "PMC6796420",
            "pmid": "31619158"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ],
    "validated": 1
}
