{
    "additionDate": "2019-11-14T18:16:51Z",
    "biotoolsCURIE": "biotools:LABiocin_database",
    "biotoolsID": "LABiocin_database",
    "confidence_flag": "tool",
    "description": "A new database designed specifically for Lactic Acid Bacteria bacteriocins | Bacteriocins from lactic acid bacteria (LAB) are successfully applied as natural alternatives to food preservation and to antibiotics; however, information on these antimicrobial peptides (AMPs) is scattered through the literature and databases. Therefore, we developed the LABiocin database, a specialized database on LAB bacteriocins. The database was stored and compiled using MySQL with NetBeans IDE as the platform. Important data are compiled, including bacteriocin name, class, amino acids and nucleic acid sequences, if available. Target microorganisms, origin, status of the producing strains and their culture conditions and extraction and purification methods are also included in this new database. A phylogenetic tree for the mature peptide bacteriocin sequences has also been created",
    "editPermission": {
        "type": "public"
    },
    "homepage": "http://labiocin.net",
    "language": [
        "SQL"
    ],
    "lastUpdate": "2020-12-14T14:32:23Z",
    "name": "LABiocin database",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1016/J.IJANTIMICAG.2019.07.012",
            "metadata": {
                "abstract": "© 2019 Elsevier LtdBacteriocins from lactic acid bacteria (LAB) are successfully applied as natural alternatives to food preservation and to antibiotics; however, information on these antimicrobial peptides (AMPs) is scattered through the literature and databases. Therefore, we developed the LABiocin database, a specialized database on LAB bacteriocins. The database was stored and compiled using MySQL with NetBeans IDE as the platform. Important data are compiled, including bacteriocin name, class, amino acids and nucleic acid sequences, if available. Target microorganisms, origin, status of the producing strains and their culture conditions and extraction and purification methods are also included in this new database. A phylogenetic tree for the mature peptide bacteriocin sequences has also been created. LABiocin is an interactive database with a user-friendly interface that integrates several tools and services and comprises up to 517 LAB bacteriocins. Besides data searching tools, a BLAST tool was integrated into the database to enable the user to perform a homology search against mature peptide sequences. Users can be linked to other databases that contain additional information, particularly about predicted bacteriocin structure and mechanisms of action. The LABiocin database enables comprehensive functional analysis of this special group of AMPs. This would be useful in food preservation and food safety applications and would also have substantial implications for development of new drugs for medical use. LABiocin database is available at labiocin.net.",
                "authors": [
                    {
                        "name": "Kassaa I.A."
                    },
                    {
                        "name": "Rafei R."
                    },
                    {
                        "name": "Moukhtar M."
                    },
                    {
                        "name": "Zaylaa M."
                    },
                    {
                        "name": "Gharsallaoui A."
                    },
                    {
                        "name": "Asehraou A."
                    },
                    {
                        "name": "Omari K.E."
                    },
                    {
                        "name": "Shahin A."
                    },
                    {
                        "name": "Hamze M."
                    },
                    {
                        "name": "Chihib N.-E."
                    }
                ],
                "citationCount": 9,
                "date": "2019-12-01T00:00:00Z",
                "journal": "International Journal of Antimicrobial Agents",
                "title": "LABiocin database: A new database designed specifically for Lactic Acid Bacteria bacteriocins"
            },
            "pmid": "31374334"
        }
    ],
    "toolType": [
        "Web application",
        "Database portal"
    ],
    "topic": [
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        },
        {
            "term": "Laboratory techniques",
            "uri": "http://edamontology.org/topic_3361"
        }
    ],
    "validated": 1
}