{
    "accessibility": "Open access",
    "additionDate": "2025-03-17T16:13:12.338060Z",
    "biotoolsCURIE": "biotools:pymlst",
    "biotoolsID": "pymlst",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "description": "A Python Mlst Local Search Tool. The input can be (i) an assembler-generated draft genome, (ii) the direct raw data, or (iii) other genomes stored in the sequence database.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://pymlst.readthedocs.io/en/latest/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Multilocus sequence typing",
                    "uri": "http://edamontology.org/operation_3840"
                }
            ]
        }
    ],
    "homepage": "https://github.com/bvalot/pyMLST",
    "language": [
        "Python"
    ],
    "lastUpdate": "2025-03-19T14:40:54.280165Z",
    "name": "pyMLST",
    "owner": "EngyNasr",
    "publication": [
        {
            "doi": "10.1099/mgen.0.001126",
            "metadata": {
                "abstract": "Core genome multilocus sequence typing (cgMLST) has gained in popularity for bacterial typing since whole-genome sequencing (WGS) has become affordable. We introduce here pyMLST, a new complete, stand-alone, free and open source pipeline for cgMLST analysis. pyMLST can create or import a core genome database. For each gene, the first allele is aligned against the bacterial genome of interest using BLAT. Incomplete genes are aligned using MAFT. All data are stored in a SQLite database. pyMLST accepts assembly genomes or raw data (with the option pyMLST-KMA) as input. To evaluate our new tool, we selected three genome collections of major bacterial pathogens (Escherichia coli, Pseudomonas aeruginosa and Staphylococcus aureus) and compared them with pyMLST, pyMLST-KMA, ChewBBACA, SeqSphere and the variant calling approach. We compared the sensitivity, precision and false-positive rate for each method with those of the variant calling approach. Minimal spanning trees were generated with each type of software to evaluate their interest in the context of a bacterial outbreak. We found that pyMLST-KMA is a convenient screening method to avoid assembling large bacterial collections. Our data showed that pyMLST (free, open source, available in Galaxy and pipeline ready) performed similarly to the commercial SeqSphere and performed better than ChewBBACA and pyMLST-KMA.",
                "authors": [
                    {
                        "name": "Atchon A."
                    },
                    {
                        "name": "Biguenet A."
                    },
                    {
                        "name": "Bordy A."
                    },
                    {
                        "name": "Hocquet D."
                    },
                    {
                        "name": "Valot B."
                    }
                ],
                "citationCount": 7,
                "date": "2023-11-01T00:00:00Z",
                "journal": "Microbial Genomics",
                "title": "Introduction and benchmarking of pyMLST: open-source software for assessing bacterial clonality using core genome MLST"
            },
            "pmcid": "PMC10711306",
            "pmid": "37966168"
        }
    ],
    "toolType": [
        "Command-line tool",
        "Library"
    ],
    "topic": [
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        }
    ]
}
