{
    "additionDate": "2017-03-25T22:23:14Z",
    "biotoolsCURIE": "biotools:karma",
    "biotoolsID": "karma",
    "description": "Allows you compare and annotate your own microarrays against other available arrays.  Comparison of arrays can be achieved within the same species as well as across species (array comparison is based on UniGene Cluster ID and/or Homologene data).  Annotation data includes LocusLink, SwissProt, and Gene Ontology.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Ontology comparison",
                    "uri": "http://edamontology.org/operation_3352"
                }
            ]
        }
    ],
    "homepage": "http://biryani.med.yale.edu/karma/cgi-bin/mysql/karma.pl",
    "homepage_status": 1,
    "language": [
        "Perl"
    ],
    "lastUpdate": "2018-12-10T12:58:57Z",
    "name": "KARMA",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "We have developed a universal web server application (KARMA) that allows comparison and annotation of user-defined pairs of microarray platforms based on diverse types of genome annotation data (across different species) collected from multiple sources. The application is an effective tool for diverse microarray platforms, including arrays that are provided by (i) the Keck Microarray Resource at Yale, (ii) commercially available Affymetrix GeneChips® and spotted arrays and (iii) custom arrays made by individual academics. The tool provides a web interface that allows users to input pairs of test files that represent diverse array platforms for either single or multiple species. The program dynamically identifies analogous DNA fragments spotted or synthesized on multiple microarray platforms based on the following types of information: (i) NCBI-Unigene identifiers, if the platforms being compared are within the same species or (ii) NCBI-Homologene data, if they are cross-species. The single-species comparison is implemented based on set operations: intersection, union and difference. Other forms of retrievable annotation data, including LocusLink, SwissProt and Gene Ontology (GO), are collected from multiple remote sites and stored in an integrated fashion using an Oracle database. The KARMA database, which is updated periodically, is available on line at the following URL: http://ymd.med.yale.edu/karma/cgi-bin/karma.pl. © Oxford University Press 2004; all rights reserved.",
                "authors": [
                    {
                        "name": "Cheung K.-H."
                    },
                    {
                        "name": "Hager J."
                    },
                    {
                        "name": "Li Y."
                    },
                    {
                        "name": "Mane S."
                    },
                    {
                        "name": "Miller P."
                    },
                    {
                        "name": "Pan D."
                    },
                    {
                        "name": "Srivastava R."
                    },
                    {
                        "name": "Williams K.R."
                    }
                ],
                "citationCount": 13,
                "date": "2004-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "KARMA: A web server application for comparing and annotating heterogeneous microarray platforms"
            },
            "pmid": "15215426"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        },
        {
            "term": "Ontology and terminology",
            "uri": "http://edamontology.org/topic_0089"
        }
    ],
    "validated": 1
}
