{"credit":[{"name":"NTNU","typeEntity":"Institute","typeRoles":["Provider"]},{"email":"contact@bioinfo.no","name":"The Norwegian Bioinformatics Platform (ELIXIR-Norway) Helpdesk","typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://www.bioinfo.no/help-desk"}],"function":[{"input":[{"data":{"term":"RNA sequence","uri":"http://edamontology.org/data_3495"},"format":[{"term":"FASTQ-sanger","uri":"http://edamontology.org/format_1932"}]}],"note":"Align reads from RNA-Seq data (eukaryote). Sensitive to splice-sites. Assign reads to transcriptome features. Perform differential expression of features for pre-selected groups of data. Paired-end Fastq files separated in different files for the paired ends. Use dataset-collection to group samples for differential analysis.\n\nNeed access to a bowtie indexed reference genome and reference transcriptome .gtf file. Table of differentially expressed genes","operation":[{"term":"Splicing model analysis","uri":"http://edamontology.org/operation_2499"},{"term":"RNA-seq read count analysis","uri":"http://edamontology.org/operation_3563"},{"term":"Differential gene expression analysis","uri":"http://edamontology.org/operation_3223"},{"term":"Read mapping","uri":"http://edamontology.org/operation_3198"}],"output":[{"data":{"term":"Gene transcript report","uri":"http://edamontology.org/data_3134"},"format":[{"term":"TSV","uri":"http://edamontology.org/format_3475"}]}]}],"labels":{"toolType":["Web application"],"topic":[{"term":"Transcriptomics","uri":"http://edamontology.org/topic_3308"}]},"link":[{"type":"HELPDESK","url":"http://www.bioinfo.no/help-desk"}],"publication":[{"abstract":"Recent advances in high-throughput cDNA sequencing (RNA-seq) can reveal new genes and splice variants and quantify expression genome-wide in a single assay. The volume and complexity of data from RNA-seq experiments necessitate scalable, fast and mathematically principled analysis software. TopHat and Cufflinks are free, open-source software tools for gene discovery and comprehensive expression analysis of high-throughput mRNA sequencing (RNA-seq) data. Together, they allow biologists to identify new genes and new splice variants of known ones, as well as compare gene and transcript expression under two or more conditions. This protocol describes in detail how to use TopHat and Cufflinks to perform such analyses. It also covers several accessory tools and utilities that aid in managing data, including CummeRbund, a tool for visualizing RNA-seq analysis results. Although the procedure assumes basic informatics skills, these tools assume little to no background with RNA-seq analysis and are meant for novices and experts alike. The protocol begins with raw sequencing reads and produces a transcriptome assembly, lists of differentially expressed and regulated genes and transcripts, and publication-quality visualizations of analysis results. The protocol's execution time depends on the volume of transcriptome sequencing data and available computing resources but takes less than 1 d of computer time for typical experiments and ∼1 h of hands-on time. © 2012 Nature America, Inc. All rights reserved.","authors":["Trapnell C.","Roberts A.","Goff L.","Pertea G.","Kim D.","Kelley D.R.","Pimentel H.","Salzberg S.L.","Rinn J.L.","Pachter L."],"cit_count":45,"doi":"10.1038/nprot.2012.016","journal":"Nature Protocols","title":"Differential gene and transcript expression analysis of RNA-seq experiments with TopHat and Cufflinks","type":"Primary","year":"2012-03-01"}],"summary":{"biotoolsCURIE":"biotools:differential_rna-seq_pipeline","biotoolsID":"differential_rna-seq_pipeline","description":"RNA-seq pipeline for differential gene expression analysis (paired-end, pooled samples, animals). Illumina RNA Sequencing differential expression analysis pipeline between two collections of eukaryote samples. The collections represents the two conditions being compared, and the datasets in each collection is defined by the user.","homepage":"https://galaxy-ntnu.bioinfo.no/toolshed_nels","name":"Differential RNA-seq pipeline","version":["1"]}}