{
    "additionDate": "2019-11-14T18:03:04Z",
    "biotoolsCURIE": "biotools:EdgeScaping",
    "biotoolsID": "EdgeScaping",
    "confidence_flag": "high",
    "credit": [
        {
            "email": "ffeltus@clemson.edu",
            "name": "F. Alex Feltus",
            "orcidid": "https://orcid.org/0000-0002-2123-6114",
            "typeEntity": "Person"
        }
    ],
    "description": "Mapping the spatial distribution of pairwise gene expression intensities | This file details the different codes that we utlized to create the results for EdgeScaping",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Expression correlation analysis",
                    "uri": "http://edamontology.org/operation_3463"
                },
                {
                    "term": "Expression profile clustering",
                    "uri": "http://edamontology.org/operation_0313"
                },
                {
                    "term": "Weighted correlation network analysis",
                    "uri": "http://edamontology.org/operation_3766"
                }
            ]
        }
    ],
    "homepage": "https://github.com/bhusain/EdgeScaping",
    "language": [
        "Python"
    ],
    "lastUpdate": "2019-11-14T18:03:04Z",
    "license": "MIT",
    "name": "EdgeScaping",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PONE.0220279",
            "metadata": {
                "abstract": "© 2019 Husain, Feltus. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Gene co-expression networks (GCNs) are constructed from Gene Expression Matrices (GEMs) in a bottom up approach where all gene pairs are tested for correlation within the context of the input sample set. This approach is computationally intensive for many current GEMs and may not be scalable to millions of samples. Further, traditional GCNs do not detect non-linear relationships missed by correlation tests and do not place genetic relationships in a gene expression intensity context. In this report, we propose EdgeScaping, which constructs and analyzes the pairwise gene intensity network in a holistic, top down approach where no edges are filtered. EdgeScaping uses a novel technique to convert traditional pairwise gene expression data to an image based format. This conversion not only performs feature compression, making our algorithm highly scalable, but it also allows for exploring non-linear relationships between genes by leveraging deep learning image analysis algorithms. Using the learned embedded feature space we implement a fast, efficient algorithm to cluster the entire space of gene expression relationships while retaining gene expression intensity. Since EdgeScaping does not eliminate conventionally noisy edges, it extends the identification of co-expression relationships beyond classically correlated edges to facilitate the discovery of novel or unusual expression patterns within the network. We applied EdgeScaping to a human tumor GEM to identify sets of genes that exhibit conventional and non-conventional interdependent non-linear behavior associated with brain specific tumor subtypes that would be eliminated in conventional bottom-up construction of GCNs. Edgescaping source code is available at https://github.com/bhusain/EdgeScaping under the MIT license.",
                "authors": [
                    {
                        "name": "Husain B."
                    },
                    {
                        "name": "Feltus F.A."
                    }
                ],
                "date": "2019-08-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "Edgescaping: Mapping the spatial distribution of pairwise gene expression intensities"
            },
            "pmcid": "PMC6684082",
            "pmid": "31386677"
        }
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        }
    ]
}