{
    "additionDate": "2017-12-18T00:15:03Z",
    "biotoolsCURIE": "biotools:ismp-grey",
    "biotoolsID": "ismp-grey",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.jci-bioinfo.cn/"
        }
    ],
    "description": "The web-server iSMP-Grey was establish for identifying uncharacterized proteins as secretory proteins of malaria parasite or not according to their evolutionary information in form of position specific scoring matrix (PSSM).",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://www.jci-bioinfo.cn/secretory/readme.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein sequence analysis",
                    "uri": "http://edamontology.org/operation_2479"
                }
            ]
        }
    ],
    "homepage": "http://www.jci-bioinfo.cn/iSMP-Grey",
    "lastUpdate": "2018-12-10T12:58:52Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/ismp-grey-predicting-secretory-proteins-of-malaria-parasite-using-grey-psepssm-and-svm.html"
        }
    ],
    "name": "iSMP-Grey",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1371/journal.pone.0049040",
            "metadata": {
                "abstract": "The malaria disease has become a cause of poverty and a major hindrance to economic development. The culprit of the disease is the parasite, which secretes an array of proteins within the host erythrocyte to facilitate its own survival. Accordingly, the secretory proteins of malaria parasite have become a logical target for drug design against malaria. Unfortunately, with the increasing resistance to the drugs thus developed, the situation has become more complicated. To cope with the drug resistance problem, one strategy is to timely identify the secreted proteins by malaria parasite, which can serve as potential drug targets. However, it is both expensive and time-consuming to identify the secretory proteins of malaria parasite by experiments alone. To expedite the process for developing effective drugs against malaria, a computational predictor called \"iSMP-Grey\" was developed that can be used to identify the secretory proteins of malaria parasite based on the protein sequence information alone. During the prediction process a protein sample was formulated with a 60D (dimensional) feature vector formed by incorporating the sequence evolution information into the general form of PseAAC (pseudo amino acid composition) via a grey system model, which is particularly useful for solving complicated problems that are lack of sufficient information or need to process uncertain information. It was observed by the jackknife test that iSMP-Grey achieved an overall success rate of 94.8%, remarkably higher than those by the existing predictors in this area. As a user-friendly web-server, iSMP-Grey is freely accessible to the public at http://www.jci-bioinfo.cn/iSMP-Grey. Moreover, for the convenience of most experimental scientists, a step-by-step guide is provided on how to use the web-server to get the desired results without the need to follow the complicated mathematical equations involved in this paper. © 2012 Lin et al.",
                "authors": [
                    {
                        "name": "Chou K.-C."
                    },
                    {
                        "name": "Fang J.-A."
                    },
                    {
                        "name": "Lin W.-Z."
                    },
                    {
                        "name": "Xiao X."
                    }
                ],
                "citationCount": 44,
                "date": "2012-11-26T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "Predicting Secretory Proteins of Malaria Parasite by Incorporating Sequence Evolution Information into Pseudo Amino Acid Composition via Grey System Model"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        }
    ],
    "validated": 1
}
