
{
    "credit": [
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                }
            ]
        }
    ],
    "labels": {
        "topic": [
            {
                "term": "Sequencing",
                "uri": "http://edamontology.org/topic_3168"
            },
            {
                "term": "Workflows",
                "uri": "http://edamontology.org/topic_0769"
            },
            {
                "term": "Probes and primers",
                "uri": "http://edamontology.org/topic_0632"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© 2019 Verduci Editore s.r.l. All rights reserved.OBJECTIVE: We describe how to set up a custom workflow for the analysis of next generation sequencing (NGS) data suitable for the diagnosis of genetic disorders and that meets the strictest standards of quality and accuracy. Our method goes from DNA extraction to data analysis with a computational in-house pipeline. The system was extensively validated using three publicly available Coriell samples, estimating accuracy, sensitivity and specificity. Multiple runs were also made to assess repeatability and reproducibility. MATERIALS AND METHODS: Three different Coriell samples were analyzed in a single run to perform coverage, sensitivity, specificity, accuracy, reproducibility and repeatability analysis. The three samples were analyzed with a custom-made oligonucleotide probe library using Nextera Rapid Capture enrichment technique and subsequently quantified using the Qubit method. Sample quality was verified using a 4200 TapeStation and sequenced on a MiSeq personal sequencer. Analysis of NGS data was then performed with a custom pipeline. RESULTS: The workflow enabled an accurate and precise analysis of NGS data that meets all the requirements of quality and accuracy required by international standards such as ISO15189 and the Association of Molecular Pathology. CONCLUSIONS: The proposed analysis/validation workflow has high assay accuracy, precision and robustness and can, therefore, be used for clinical diagnostic applications.",
            "authors": [
                "Marceddu G.",
                "Dallavilla T.",
                "Guerri G.",
                "Manara E.",
                "Chiurazzi P.",
                "Bertelli M."
            ],
            "cit_count": 0,
            "doi": "10.26355/EURREV_201908_18566",
            "journal": "European Review for Medical and Pharmacological Sciences",
            "pmid": "31378919",
            "title": "PipeMagi: An integrated and validated workflow for analysis of NGS data for clinical diagnostics",
            "year": "2019-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:PipeMAGI",
        "biotoolsID": "PipeMAGI",
        "description": "> MEDIUM CONFIDENCE! | > HOMEPAGE MISSING! | > CORRECT NAME OF TOOL COULD ALSO BE 'METHODS:Three', 'OBJECTIVE:We' | an integrated and validated workflow for analysis of NGS data for clinical diagnostics | OBJECTIVE:We describe how to set up a custom workflow for the analysis of next generation sequencing (NGS) data suitable for the diagnosis of genetic disorders and that meets the strictest standards of quality and accuracy. Our method goes from DNA extraction to data analysis with a computational in-house pipeline. The system was extensively validated using three publicly available Coriell samples, estimating accuracy, sensitivity and specificity. Multiple runs were also made to assess repeatability and reproducibility. MATERIALS AND METHODS:Three different Coriell samples were analyzed in a single run to perform coverage, sensitivity, specificity, accuracy, reproducibility and repeatability analysis",
        "homepage": "https://www.ncbi.nlm.nih.gov/pubmed/?term=31378919",
        "name": "PipeMAGI"
    }
}