{
    "additionDate": "2017-08-03T19:03:43Z",
    "biotoolsCURIE": "biotools:unipop",
    "biotoolsID": "unipop",
    "credit": [
        {
            "email": "dche@po-box.esu.edu",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www5.esu.edu/cpsc/bioinfo/"
        }
    ],
    "description": "A universal and accurate operon predictor for all prokaryotic genomes.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://www5.esu.edu/cpsc/bioinfo/software/UNIPOP/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Operon prediction",
                    "uri": "http://edamontology.org/operation_0435"
                }
            ]
        }
    ],
    "homepage": "http://www5.esu.edu/cpsc/bioinfo/software/UNIPOP/",
    "language": [
        "C++"
    ],
    "lastUpdate": "2018-12-10T12:58:51Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/unipop-0-1-universal-predictor-operons.html"
        }
    ],
    "name": "UNIPOP",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Identification of operons at the genome scale of prokaryotic organisms represents a key step in deciphering of their transcriptional regulation machinery, biological pathways, and networks. While numerous computational methods have been shown to be effective in predicting operons for well-studied organisms such as Escherichia coli K12 and Bacillus subtilis 168, these methods generally do not generalize well to genomes other than the ones used to train the methods, or closely related genomes because they rely on organism-specific information. Several methods have been explored to address this problem through utilizing only genomic structural information conserved across multiple organisms, but they all suffer from the issue of low prediction sensitivity. In this paper, we report a novel operon prediction method that is applicable to any prokaryotic genome with high prediction accuracy. The key idea of the method is to predict operons through identification of conserved gene clusters across multiple genomes and through deriving a key parameter relevant to the distribution of intergenic distances in genomes. We have implemented this method using a graph-theoretic approach, to calculate a set of maximum gene clusters in the target genome that are conserved across multiple reference genomes. Our computational results have shown that this method has higher prediction sensitivity as well as specificity than most of the published methods. We have carried out a preliminary study on operons unique to archaea and bacteria, respectively, and derived a number of interesting new insights about operons between these two kingdoms. The software and predicted operons of 365 prokaryotic genomes are available at http://csbl.bmb.uga.edu/~dongsheng/UNIPOP. © 2009 Imperial College Press.",
                "authors": [
                    {
                        "name": "Li G."
                    },
                    {
                        "name": "Che D."
                    },
                    {
                        "name": "Xu Y."
                    }
                ],
                "citationCount": 22,
                "date": "2009-05-11T00:00:00Z",
                "journal": "Journal of Bioinformatics and Computational Biology",
                "title": "A universal operon predictor for prokaryotic genomes"
            },
            "pmid": "19226658"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ],
    "validated": 1
}