
{
    "credit": [
        {
            "name": "Federico Zambelli",
            "typeEntity": "Person",
            "typeRoles": [
                "Maintainer"
            ]
        },
        {
            "name": "Giulio Pavesi",
            "typeEntity": "Person",
            "typeRoles": [
                "Developer"
            ]
        },
        {
            "name": "Graziano Pesole",
            "typeEntity": "Person",
            "typeRoles": [
                "Contributor"
            ]
        },
        {
            "name": "ELIXIR-ITA-MILANO",
            "typeEntity": "Institute",
            "typeRoles": [
                "Provider"
            ]
        },
        {
            "email": "federico.zambelli@unimi.it",
            "name": "Federico Zambelli",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Gene expression matrix",
                        "uri": "http://edamontology.org/data_3112"
                    }
                }
            ],
            "operation": [
                {
                    "term": "Differential gene expression analysis",
                    "uri": "http://edamontology.org/operation_3223"
                }
            ]
        }
    ],
    "labels": {
        "cost": "Free of charge",
        "language": [
            "R",
            "C++"
        ],
        "license": "GPL-3.0",
        "maturity": "Mature",
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Gene expression",
                "uri": "http://edamontology.org/topic_0203"
            }
        ]
    },
    "link": [
        {
            "note": "CRAN package",
            "type": "Repository",
            "url": "https://CRAN.R-project.org/package=RNentropy"
        },
        {
            "note": "C++ implementation",
            "type": "Other",
            "url": "http://www.beaconlab.it/RNentropy"
        }
    ],
    "publication": [
        {
            "abstract": "© The Author(s) 2018. Published by Oxford University Press on behalf of Nucleic Acids Research.RNA sequencing (RNA-Seq) has become the experimental standard in transcriptome studies. While most of the bioinformatic pipelines for the analysis of RNA-Seq data and the identification of significant changes in transcript abundance are based on the comparison of two conditions, it is common practice to perform several experiments in parallel (e.g. from different individuals, developmental stages, tissues), for the identification of genes showing a significant variation of expression across all the conditions studied. In this work we present RNentropy, a methodology based on information theory devised for this task, which given expression estimates from any number of RNA-Seq samples and conditions identifies genes or transcripts with a significant variation of expression across all the conditions studied, together with the samples in which they are over- or under-expressed. To show the capabilities offered by our methodology, we applied it to different RNA-Seq datasets: 48 biological replicates of two different yeast conditions; samples extracted from six human tissues of three individuals; seven different mouse brain cell types; human liver samples from six individuals. Results, and their comparison to different state of the art bioinformatic methods, show that RNentropy can provide a quick and in depth analysis of significant changes in gene expression profiles over any number of conditions.",
            "authors": [
                "Zambelli F.",
                "Mastropasqua F.",
                "Picardi E.",
                "D'Erchia A.M.",
                "Pesole G.",
                "Pavesi G."
            ],
            "cit_count": 1,
            "doi": "10.1093/nar/gky055",
            "journal": "Nucleic Acids Research",
            "title": "RNentropy: An entropy-based tool for the detection of significant variation of gene expression across multiple RNA-Seq experiments",
            "year": "2018-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:rnentropy",
        "biotoolsID": "rnentropy",
        "description": "A methodology for the identification of genes showing a significant variation of expression across multiple conditions. Given expression estimates from any number of RNA-Seq samples and conditions identifies genes or transcripts with a significant variation of expression across all the conditions studied, together with the samples in which they are over- or under-expressed.",
        "homepage": "http://www.beaconlab.it/RNentrpy",
        "name": "RNentropy",
        "version": [
            "1.1.2"
        ]
    }
}