{
    "additionDate": "2016-03-03T13:48:39Z",
    "biotoolsCURIE": "biotools:tap",
    "biotoolsID": "tap",
    "credit": [
        {
            "name": "ELIXIR-ITA-PADOVA",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        },
        {
            "email": "silvio.tosatto@unipd.it",
            "name": "Silvio C.E. Tosatto",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://protein.bio.unipd.it"
        }
    ],
    "description": "Validate the local torsion angles of a protein structure.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://protein.bio.unipd.it/tap/help.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Prediction and recognition",
                    "uri": "http://edamontology.org/operation_2423"
                }
            ]
        }
    ],
    "homepage": "http://old.protein.bio.unipd.it/tap/",
    "lastUpdate": "2021-04-11T10:37:45.370278Z",
    "name": "TAP",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "ELIXIR-ITA-PADOVA",
    "publication": [
        {
            "doi": "10.1186/1471-2105-8-155",
            "metadata": {
                "abstract": "Background: Experimentally determined protein structures may contain errors and require validation. Conformational criteria based on the Ramachandran plot are mainly used to distinguish between distorted and adequately refined models. While the readily available criteria are sufficient to detect totally wrong structures, establishing the more subtle differences between plausible structures remains more challenging. Results: A new criterion, called TAP score, measuring local sequence to structure fitness based on torsion angle propensities normalized against the global minimum and maximum is introduced. It is shown to be more accurate than previous methods at estimating the validity of a protein model in terms of commonly used experimental quality parameters on two test sets representing the full PDB database and a subset of obsolete PDB structures. Highly selective TAP thresholds are derived to recognize over 90% of the top experimental structures in the absence of experimental information. Both a web server and an executable version of the TAP score are available at http://protein.cribi.unipd.it/tap/. Conclusion: A novel procedure for energy normalization (TAP) has significantly improved the possibility to recognize the best experimental structures. It will allow the user to more reliably isolate problematic structures in the context of automated experimental structure determination. © 2007 Tosatto and Battistutta; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Tosatto S.C.E."
                    },
                    {
                        "name": "Battistutta R."
                    }
                ],
                "citationCount": 33,
                "date": "2007-05-15T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "TAP score: Torsion angle propensity normalization applied to local protein structure evaluation"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Protein structure analysis",
            "uri": "http://edamontology.org/topic_2814"
        }
    ],
    "validated": 1,
    "version": [
        "1.1"
    ]
}