{
    "additionDate": "2021-01-18T09:25:31Z",
    "biotoolsCURIE": "biotools:allestm",
    "biotoolsID": "allestm",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "d.frishman@wzw.tum.de",
            "name": "Dmitrij Frishman",
            "orcidid": "https://orcid.org/0000-0002-9006-4707",
            "typeEntity": "Person"
        }
    ],
    "description": "AllesTM is an integrated tool to predict almost all structural features of transmembrane proteins that can be extracted from atomic coordinate data. It blends several machine learning algorithms: random forests and gradient boosting machines, convolutional neural networks in their original form as well as those enhanced by dilated convolutions and residual connections, and, finally, long short-term memory architectures.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Fold recognition",
                    "uri": "http://edamontology.org/operation_0303"
                },
                {
                    "term": "Protein geometry calculation",
                    "uri": "http://edamontology.org/operation_0249"
                },
                {
                    "term": "Protein structure prediction",
                    "uri": "http://edamontology.org/operation_0474"
                },
                {
                    "term": "Transmembrane protein prediction",
                    "uri": "http://edamontology.org/operation_0269"
                },
                {
                    "term": "Transmembrane protein visualisation",
                    "uri": "http://edamontology.org/operation_2241"
                }
            ]
        }
    ],
    "homepage": "https://github.com/phngs/allestm",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-01-23T14:07:57Z",
    "license": "MIT",
    "name": "AllesTM",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1186/S12859-020-03581-8",
            "metadata": {
                "abstract": "© 2020 The Author(s).Background: This study is motivated by the following three considerations: a) the physico-chemical properties of transmembrane (TM) proteins are distinctly different from those of globular proteins, necessitating the development of specialized structure prediction techniques, b) for many structural features no specialized predictors for TM proteins are available at all, and c) deep learning algorithms allow to automate the feature engineering process and thus facilitate the development of multi-target methods for predicting several protein properties at once. Results: We present AllesTM, an integrated tool to predict almost all structural features of transmembrane proteins that can be extracted from atomic coordinate data. It blends several machine learning algorithms: random forests and gradient boosting machines, convolutional neural networks in their original form as well as those enhanced by dilated convolutions and residual connections, and, finally, long short-term memory architectures. AllesTM outperforms other available methods in predicting residue depth in the membrane, flexibility, topology, relative solvent accessibility in its bound state, while in torsion angles, secondary structure and monomer relative solvent accessibility prediction it lags only slightly behind the currently leading technique SPOT-1D. High accuracy on a multitude of prediction targets and easy installation make AllesTM a one-stop shop for many typical problems in the structural bioinformatics of transmembrane proteins. Conclusions: In addition to presenting a highly accurate prediction method and eliminating the need to install and maintain many different software tools, we also provide a comprehensive overview of the impact of different machine learning algorithms and parameter choices on the prediction performance. AllesTM is freely available at https://github.com/phngs/allestm.",
                "authors": [
                    {
                        "name": "Breimann S."
                    },
                    {
                        "name": "Frishman D."
                    },
                    {
                        "name": "Honigschmid P."
                    },
                    {
                        "name": "Weigl M."
                    }
                ],
                "date": "2020-06-12T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "AllesTM: Predicting multiple structural features of transmembrane proteins"
            },
            "pmcid": "PMC7291640",
            "pmid": "32532211"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Membrane and lipoproteins",
            "uri": "http://edamontology.org/topic_0820"
        },
        {
            "term": "Protein folds and structural domains",
            "uri": "http://edamontology.org/topic_0736"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Structure prediction",
            "uri": "http://edamontology.org/topic_0082"
        }
    ],
    "validated": 1
}
