{
    "additionDate": "2018-06-18T09:30:36Z",
    "biotoolsCURIE": "biotools:hsymdock",
    "biotoolsID": "hsymdock",
    "credit": [
        {
            "email": "huanglab@hust.edu.cn",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Symmetric protein docking for oligomers with Cn or Dn symmetry from the structure or sequence of a subunit molecule.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://huanglab.phys.hust.edu.cn/hsymdock/help.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Protein sequence",
                        "uri": "http://edamontology.org/data_2976"
                    },
                    "format": [
                        {
                            "term": "FASTA-like (text)",
                            "uri": "http://edamontology.org/format_2200"
                        },
                        {
                            "term": "PDB",
                            "uri": "http://edamontology.org/format_1476"
                        }
                    ]
                }
            ],
            "operation": [
                {
                    "term": "Molecular docking",
                    "uri": "http://edamontology.org/operation_0478"
                }
            ]
        }
    ],
    "homepage": "http://huanglab.phys.hust.edu.cn/hsymdock/",
    "language": [
        "PHP"
    ],
    "lastUpdate": "2018-12-10T12:58:59Z",
    "name": "HSYMDOCK",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "aotamendi.1",
    "publication": [
        {
            "doi": "10.1093/nar/gky398",
            "metadata": {
                "abstract": "© The Author(s) 2018. Published by Oxford University Press on behalf of Nucleic Acids Research.A major subclass of protein-protein interactions is formed by homo-oligomers with certain symmetry. Therefore, computational modeling of the symmetric protein complexes is important for understanding the molecular mechanism of related biological processes. Although several symmetric docking algorithms have been developed for Cn symmetry, few docking servers have been proposed for Dn symmetry. Here, we present HSYMDOCK, a web server of our hierarchical symmetric docking algorithm that supports both Cn and Dn symmetry. The HSYMDOCK server was extensively evaluated on three benchmarks of symmetric protein complexes, including the 20 CASP11-CAPRI30 homo-oligomer targets, the symmetric docking benchmark of 213 Cn targets and 35 Dn targets, and a nonredundant test set of 55 transmembrane proteins. It was shown that HSYMDOCK obtained a significantly better performance than other similar docking algorithms. The server supports both sequence and structure inputs for the monomer/subunit. Users have an option to provide the symmetry type of the complex, or the server can predict the symmetry type automatically. The docking process is fast and on average consumes 101/420 min for a docking job. The HSYMDOCK web server is available at http://huanglab.phys.hust.edu.cn/hsymdock/.",
                "authors": [
                    {
                        "name": "Yan Y."
                    },
                    {
                        "name": "Tao H."
                    },
                    {
                        "name": "Huang S.-Y."
                    }
                ],
                "citationCount": 16,
                "date": "2018-07-02T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "HSYMDOCK: A docking web server for predicting the structure of protein homo-oligomers with Cn or Dn symmetry"
            },
            "pmid": "29846641",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Molecular modelling",
            "uri": "http://edamontology.org/topic_2275"
        }
    ],
    "validated": 1,
    "version": [
        "2018-06-02"
    ]
}