{
    "additionDate": "2017-01-13T13:14:34Z",
    "biotoolsCURIE": "biotools:featurecounts",
    "biotoolsID": "featurecounts",
    "credit": [
        {
            "email": "liao@wehi.edu.au",
            "name": "Yang Liao",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "shi@wehi.edu.au",
            "name": "Wei Shi",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "smyth@wehi.EDU.AU",
            "name": "Gordon K Smyth",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "featureCounts is a very efficient read quantifier. It can be used to summarize RNA-seq reads and gDNA-seq reads to a variety of genomic features such as genes, exons, promoters, gene bodies and genomic bins. It is included in the Bioconductor Rsubread package and also in the SourceForge Subread package.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://bioconductor.org/packages/release/bioc/manuals/Rsubread/man/Rsubread.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Read summarisation",
                    "uri": "http://edamontology.org/operation_3793"
                }
            ]
        }
    ],
    "homepage": "http://bioconductor.org/packages/release/bioc/html/Rsubread.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-10T12:58:57Z",
    "license": "GPL-3.0",
    "maturity": "Mature",
    "name": "FeatureCounts",
    "operatingSystem": [
        "Mac",
        "Windows"
    ],
    "owner": "seqwiki_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Motivation: Next-generation sequencing technologies generate millions of short sequence reads, which are usually aligned to a reference genome. In many applications, the key information required for downstream analysis is the number of reads mapping to each genomic feature, for example to each exon or each gene. The process of counting reads is called read summarization. Read summarization is required for a great variety of genomic analyses but has so far received relatively little attention in the literature.Results: We present featureCounts, a read summarization program suitable for counting reads generated from either RNA or genomic DNA sequencing experiments. featureCounts implements highly efficient chromosome hashing and feature blocking techniques. It is considerably faster than existing methods (by an order of magnitude for gene-level summarization) and requires far less computer memory. It works with either single or paired-end reads and provides a wide range of options appropriate for different sequencing applications. © 2013 The Author 2013. Published by Oxford University Press. All rights reserved.",
                "authors": [
                    {
                        "name": "Liao Y."
                    },
                    {
                        "name": "Shi W."
                    },
                    {
                        "name": "Smyth G.K."
                    }
                ],
                "citationCount": 5317,
                "date": "2014-04-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "FeatureCounts: An efficient general purpose program for assigning sequence reads to genomic features"
            },
            "pmid": "24227677"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ],
    "validated": 1
}
