{"credit":[],"function":[{"operation":[{"term":"Alignment","uri":"http://edamontology.org/operation_2928"}]}],"labels":{"toolType":["Web application"],"topic":[{"term":"Immunoproteins, genes and antigens","uri":"http://edamontology.org/topic_2830"},{"term":"Gene transcripts","uri":"http://edamontology.org/topic_3512"},{"term":"Humans","uri":"http://edamontology.org/topic_2815"},{"term":"Sequence analysis","uri":"http://edamontology.org/topic_0080"},{"term":"Genetic variation","uri":"http://edamontology.org/topic_0199"}]},"publication":[{"abstract":"The dbMHC resource (http://www.ncbi.nlm.nih.gov/mhc/sbt.cgi?cmd=main) at the National Center for Biotechnology Information (NCBI) has developed an online tool for evaluating the allelic composition of sequencing-based typing (SBT) results of cDNA or genomic sequences. Whether the samples are heterozygous, haploid or a combination of the two, they can be compared with two up-to-date databases of all known alleles of several human leukocyte antigen (HLA) and killer cell immunoglobulin-like receptor (KIR) loci. The results of the submission are returned as a table of potential allele hits, along with the respective base changes and an interactive sequence viewer for close examination of the alignment. © Oxford University Press 2004; all rights reserved.","authors":["Helmberg W.","Dunivin R.","Feolo M."],"cit_count":28,"journal":"Nucleic Acids Research","pmid":"15215374","title":"The sequencing-based typing tool of dbMHC: Typing highly polymorphic gene sequences","year":"2004-07-01"}],"summary":{"biotoolsCURIE":"biotools:sbt_interface","biotoolsID":"sbt_interface","description":"Tool accompanying the NCBI&apos,s Major Histocompatibility Complex database (dbMHC). It identifies the allelic composition of sequence-based typing (SBT) results of cDNA or genomic sequences. Samples are compared with databases containing all known alleles for several human leukocyte antigen (HLA) and killer cell immunoglobulin-like receptors (KIR) loci. An interactive sequence viewer allows inspection of the alignments.","homepage":"http://www.ncbi.nlm.nih.gov/gv/mhc/sbt.cgi?cmd=main","name":"The SBT (Sequencing-based typing) interface "}}