{
    "accessibility": "Open access",
    "additionDate": "2024-01-03T20:27:02.049718Z",
    "biotoolsCURIE": "biotools:ogre",
    "biotoolsID": "ogre",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "Sandra.Laurentino@ukmuenster.de",
            "name": "Sandra Laurentino",
            "orcidid": "https://orcid.org/0000-0002-5213-2756",
            "typeEntity": "Person"
        },
        {
            "name": "Jörg Gromoll",
            "typeEntity": "Person"
        },
        {
            "name": "Sven Berres",
            "typeEntity": "Person"
        }
    ],
    "description": "OGRE calculates overlap between user defined genomic region datasets. Any regions can be supplied i.e. genes, SNPs, or reads from sequencing experiments. Key numbers help analyse the extend of overlaps which can also be visualized at a genomic level.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genome annotation",
                    "uri": "http://edamontology.org/operation_0362"
                },
                {
                    "term": "Parsing",
                    "uri": "http://edamontology.org/operation_1812"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://bioconductor.org/packages/devel/bioc/html/OGRE.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2024-01-03T20:27:02.052273Z",
    "license": "Artistic-2.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/svenbioinf/OGRE"
        }
    ],
    "name": "OGRE",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12859-023-05422-W",
            "metadata": {
                "abstract": "Background: Modern genome sequencing leads to an ever-growing collection of genomic annotations. Combining these elements with a set of input regions (e.g. genes) would yield new insights in genomic associations, such as those involved in gene regulation. The required data are scattered across different databases making a manual approach tiresome, unpractical, and prone to error. Semi-automatic approaches require programming skills in data parsing, processing, overlap calculation, and visualization, which most biomedical researchers lack. Our aim was to develop an automated tool providing all necessary algorithms, benefiting both bioinformaticians and researchers without bioinformatic training. Results: We developed overlapping annotated genomic regions (OGRE) as a comprehensive tool to associate and visualize input regions with genomic annotations. It does so by parsing regions of interest, mining publicly available annotations, and calculating possible overlaps between them. The user can thus identify location, type, and number of associated regulatory elements. Results are presented as easy to understand visualizations and result tables. We applied OGRE to recent studies and could show high reproducibility and potential new insights. To demonstrate OGRE’s performance in terms of running time and output, we have conducted a benchmark and compared its features with similar tools. Conclusions: OGRE’s functions and built-in annotations can be applied as a downstream overlap association step, which is compatible with most genomic sequencing outputs, and can thus enrich pre-existing analyses pipelines. Compared to similar tools, OGRE shows competitive performance, offers additional features, and has been successfully applied to two recent studies. Overall, OGRE addresses the lack of tools for automatic analysis, local genomic overlap calculation, and visualization by providing an easy to use, end-to-end solution for both biologists and computational scientists.",
                "authors": [
                    {
                        "name": "Berres S."
                    },
                    {
                        "name": "Gromoll J."
                    },
                    {
                        "name": "Laurentino S."
                    },
                    {
                        "name": "Sandmann S."
                    },
                    {
                        "name": "Woste M."
                    }
                ],
                "date": "2023-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "OGRE: calculate, visualize, and analyze overlap between genomic input regions and public annotations"
            },
            "pmcid": "PMC10369718",
            "pmid": "37496002"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "ChIP-seq",
            "uri": "http://edamontology.org/topic_3169"
        },
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ]
}
