{
    "additionDate": "2022-10-11T11:07:41.656569Z",
    "biotoolsCURIE": "biotools:topicalpdb",
    "biotoolsID": "topicalpdb",
    "credit": [
        {
            "name": "Dr Gajendra P.S. Raghava",
            "url": "https://webs.iiitd.edu.in/raghava/topicalpdb/"
        }
    ],
    "description": "TopicalPdb: Database of Topically Administered Peptide.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://webs.iiitd.edu.in/raghava/topicalpdb/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Analysis",
                    "uri": "http://edamontology.org/operation_2945"
                }
            ]
        }
    ],
    "homepage": "https://webs.iiitd.edu.in/raghava/topicalpdb/",
    "lastUpdate": "2022-10-11T11:07:47.605030Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "https://webs.iiitd.edu.in/raghava/topicalpdb/"
        }
    ],
    "name": "topicalpdb",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "raghavagps",
    "publication": [
        {
            "doi": "10.1371/journal.pone.0190134",
            "metadata": {
                "abstract": "© 2018 Mathur et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.TopicalPdb (http://crdd.osdd.net/raghava/topicalpdb/) is a repository of experimentally verified topically delivered peptides. Data was manually collected from research articles. The current release of TopicalPdb consists of 657 entries, which includes peptides delivered through the skin (462 entries), eye (173 entries), and nose (22 entries). Each entry provides comprehensive information related to these peptides like the source of origin, nature of peptide, length, N- and C-terminal modifications, mechanism of penetration, type of assays, cargo and biological properties of peptides, etc. In addition to natural peptides, TopicalPdb contains information of peptides having non-natural, chemically modified residues and D-amino acids. Besides this primary information, TopicalPdb stores predicted tertiary structures as well as peptide sequences in SMILE format. Tertiary structures of peptides were predicted using state-of-art method PEPstrMod. In order to assist users, a number of web-based tools have been integrated that includes keyword search, data browsing, similarity search and structural similarity. We believe that TopicalPdb is a unique database of its kind and it will be very useful in designing peptides for non-invasive topical delivery.",
                "authors": [
                    {
                        "name": "Bedi G."
                    },
                    {
                        "name": "Firmal P."
                    },
                    {
                        "name": "Gautam A."
                    },
                    {
                        "name": "Mathur D."
                    },
                    {
                        "name": "Mehta A."
                    },
                    {
                        "name": "Raghava G.P.S."
                    },
                    {
                        "name": "Sood C."
                    }
                ],
                "citationCount": 6,
                "date": "2018-02-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "TopicalPdb: A database of topically delivered peptides"
            },
            "pmcid": "PMC5809007",
            "pmid": "29432422"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Computational biology",
            "uri": "http://edamontology.org/topic_3307"
        }
    ]
}
