{
    "accessibility": "Open access",
    "additionDate": "2022-02-10T01:14:31.563820Z",
    "biotoolsCURIE": "biotools:pen",
    "biotoolsID": "pen",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "charn78@ncc.re.kr",
            "name": "Charny Park",
            "orcidid": "https://orcid.org/0000-0001-5857-7695",
            "typeEntity": "Person"
        },
        {
            "email": "sooycho@ncc.re.kr",
            "name": "Soo Young Cho",
            "typeEntity": "Person"
        },
        {
            "name": "Daejin Hyung"
        },
        {
            "name": "Jongkeun Lee"
        },
        {
            "name": "Min-Jeong Baek"
        }
    ],
    "description": "Protein-gene Expression Nexus (PEN), which consolidates an extensive dataset of paired proteomics and genomics studies. PEN present a database that allows researchers to easily and extensively visualize and annotate changes such as somatic copy number alterations, transcriptomic differences, peptide expressions, and modifications. As a freely available resource, PEN provide new insights into the proteogenomic landscape cancer cells, allowing more detailed study of oncogenesis and cancer treatment. A search using PEN can produce quantitative comparisons of proteogenomic analysis results, as following feature.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://combio.snu.ac.kr/pen/tutorial.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Name",
                        "uri": "http://edamontology.org/data_2099"
                    }
                }
            ],
            "operation": [
                {
                    "term": "PTM localisation",
                    "uri": "http://edamontology.org/operation_3755"
                },
                {
                    "term": "PTM site prediction",
                    "uri": "http://edamontology.org/operation_0417"
                },
                {
                    "term": "SILAC",
                    "uri": "http://edamontology.org/operation_3638"
                }
            ]
        }
    ],
    "homepage": "http://combio.snu.ac.kr/pen",
    "lastUpdate": "2022-02-10T01:14:31.567181Z",
    "name": "PEN",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1016/J.CSBJ.2021.08.022",
            "metadata": {
                "abstract": "© 2021 The AuthorsResearchers have gained new therapeutic insights using multi-omics platform approaches to study DNA, RNA, and proteins of comprehensively characterized human cancer cell lines. To improve our understanding of the molecular features associated with oncogenic modulation in cancer, we proposed a proteogenomic database for human cancer cell lines, called Protein-gene Expression Nexus (PEN). We have expanded the characterization of cancer cell lines to include genetic, mRNA, and protein data of 145 cancer cell lines from various public studies. PEN contains proteomic and phosphoproteomic data on 4,129,728 peptides, 13,862 proteins, 7,138 phosphorylation site-associated genomic variations, 117 studies, and 12 cancer. We analyzed functional characterizations along with the integrated datasets, such as cis/trans association for copy number alteration (CNA), single amino acid variation for coding genes, post-translation modification site variation for Single Amino Acid Variation, and novel peptide expression for noncoding regions and fusion genes. PEN provides a user-friendly interface for searching, browsing, and downloading data and also supports the visualization of genome-wide association between CNA and expression, novel peptide landscape, mRNA-protein abundance, and functional annotation. Together, this dataset and PEN data portal provide a resource to accelerate cancer research using model cancer cell lines. PEN is freely accessible at http://combio.snu.ac.kr/pen.",
                "authors": [
                    {
                        "name": "Baek M.-J."
                    },
                    {
                        "name": "Cho J."
                    },
                    {
                        "name": "Cho S.Y."
                    },
                    {
                        "name": "Hyung D."
                    },
                    {
                        "name": "Kim H.S."
                    },
                    {
                        "name": "Lee J."
                    },
                    {
                        "name": "Park C."
                    }
                ],
                "citationCount": 1,
                "date": "2021-01-01T00:00:00Z",
                "journal": "Computational and Structural Biotechnology Journal",
                "title": "Protein-gene Expression Nexus: Comprehensive characterization of human cancer cell lines with proteogenomic analysis"
            },
            "pmcid": "PMC8405889",
            "pmid": "34504668"
        }
    ],
    "toolType": [
        "Database portal",
        "Web application"
    ],
    "topic": [
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Proteogenomics",
            "uri": "http://edamontology.org/topic_3922"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
