{
    "additionDate": "2022-09-12T06:07:05.018956Z",
    "biotoolsCURIE": "biotools:detective-qsar",
    "biotoolsID": "detective-qsar",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "zushi.yasuyuki@aist.go.jp",
            "name": "Yasuyuki Zushi",
            "orcidid": "https://orcid.org/0000-0001-8062-1592",
            "typeEntity": "Person"
        }
    ],
    "description": "Detective-QSAR is a web applications to evaluate the known/unknown spectra aquired by MS",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Deisotoping",
                    "uri": "http://edamontology.org/operation_3629"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Spectrum calculation",
                    "uri": "http://edamontology.org/operation_3860"
                }
            ]
        }
    ],
    "homepage": "http://www.mixture-platform.net/Detective_QSAR_Med_Open/",
    "language": [
        "R"
    ],
    "lastUpdate": "2022-09-12T06:07:05.021423Z",
    "license": "CC-BY-4.0",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "http://www.mixture-platform.net/Detective_QSAR_Pred_Open/"
        }
    ],
    "name": "Detective-QSAR",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1021/ACS.ANALCHEM.2C01667",
            "metadata": {
                "abstract": "© 2022 The Author. Published by American Chemical Society.With advances in machine learning (ML) techniques, the quantitative structure-activity relationship (QSAR) approach is becoming popular for evaluating chemicals. However, the QSAR approach requires that the chemical structure of the target compound is known and that it should be convertible to molecular descriptors. These requirements lead to limitations in predicting the properties and toxicities of chemicals distributed in the environment as in the PubChem database; the structural information on only 14% of compounds is available. This study proposes a new ML-based QSAR approach that can predict the properties and toxicities of compounds using analytical descriptors of mass spectrum and retention index obtained via gas chromatography-mass spectrometry without requiring exact structural information. The model was developed based on the XGBoost ML method. The root-mean-square errors (RMSEs) for log Ko-w, log (molecular weight), melting point, boiling point, log (vapor pressure), log (water solubility), log (LD50) (rat, oral), and log (LD50) (mouse, oral) are 0.97, 0.052, 51, 23, 0.74, 1.1, 0.74, and 0.6, respectively. The model performed well on a chemical standard mixture measurement, with similar results to those of model validation. It also performed well on a measurement of contaminated oil with spectral deconvolution. These results indicate that the model is suitable for investigating unknown-structured chemicals detected in measurements. Any online user can execute the model through a web application named Detective-QSAR (http://www.mixture-platform.net/Detective_QSAR_Med_Open/). The analytical descriptor-based approach is expected to create new opportunities for the evaluation of unknown chemicals around us.",
                "authors": [
                    {
                        "name": "Zushi Y."
                    }
                ],
                "date": "2022-06-28T00:00:00Z",
                "journal": "Analytical Chemistry",
                "title": "Direct Prediction of Physicochemical Properties and Toxicities of Chemicals from Analytical Descriptors by GC-MS"
            },
            "pmcid": "PMC9246259",
            "pmid": "35700270"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Chemistry",
            "uri": "http://edamontology.org/topic_3314"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Toxicology",
            "uri": "http://edamontology.org/topic_2840"
        }
    ],
    "validated": 1
}
