{
    "additionDate": "2020-01-09T18:34:28Z",
    "biotoolsCURIE": "biotools:t-cell-classification",
    "biotoolsID": "t-cell-classification",
    "confidence_flag": "tool",
    "description": "Classifying T cell activity in autofluorescence intensity images with convolutional neural networks.\n\nJupyter notebooks demonstrating a microscopy machine learning image analysis workflow.\n\nThis repository contains code and data for the manuscript:.\n\nClassifying T cell activity in autofluorescence intensity images with convolutional neural networks. Zijie J Wang, Alex J Walsh, Melissa C Skala, Anthony Gitter. bioRxiv 2019. doi:10.1101/737346.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                },
                {
                    "term": "Ion counting",
                    "uri": "http://edamontology.org/operation_3704"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://github.com/gitter-lab/t-cell-classification",
    "lastUpdate": "2024-11-24T20:49:43.757707Z",
    "license": "BSD-3-Clause-Clear",
    "name": "T cell classification",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1002/jbio.201960050",
            "metadata": {
                "abstract": "The importance of T cells in immunotherapy has motivated developing technologies to improve therapeutic efficacy. One objective is assessing antigen-induced T cell activation because only functionally active T cells are capable of killing the desired targets. Autofluorescence imaging can distinguish T cell activity states in a non-destructive manner by detecting endogenous changes in metabolic co-enzymes such as NAD(P)H. However, recognizing robust activity patterns is computationally challenging in the absence of exogenous labels. We demonstrate machine learning methods that can accurately classify T cell activity across human donors from NAD(P)H intensity images. Using 8260 cropped single-cell images from six donors, we evaluate classifiers ranging from traditional models that use previously-extracted image features to convolutional neural networks (CNNs) pre-trained on general non-biological images. Adapting pre-trained CNNs for the T cell activity classification task provides substantially better performance than traditional models or a simple CNN trained with the autofluorescence images alone. Visualizing the images with dimension reduction provides intuition into why the CNNs achieve higher accuracy than other approaches. Our image processing and classifier training software is available at https://github.com/gitter-lab/t-cell-classification.",
                "authors": [
                    {
                        "name": "Gitter A."
                    },
                    {
                        "name": "Skala M.C."
                    },
                    {
                        "name": "Walsh A.J."
                    },
                    {
                        "name": "Wang Z.J."
                    }
                ],
                "citationCount": 20,
                "date": "2020-03-01T00:00:00Z",
                "journal": "Journal of Biophotonics",
                "title": "Classifying T cell activity in autofluorescence intensity images with convolutional neural networks"
            },
            "pmcid": "PMC7065628",
            "pmid": "31661592"
        }
    ],
    "topic": [
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Endocrinology and metabolism",
            "uri": "http://edamontology.org/topic_3407"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Immunoproteins and antigens",
            "uri": "http://edamontology.org/topic_2830"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        }
    ],
    "validated": 1
}
