{
    "additionDate": "2019-11-14T18:04:59Z",
    "biotoolsCURIE": "biotools:KBbox",
    "biotoolsID": "KBbox",
    "confidence_flag": "tool",
    "description": "A Toolbox of Computational Methods for Studying the Kinetics of Molecular Binding | KBbox is developed to be of use to researchers interested in applying these methods in their work. To help with this, KBbox provides an updated list of examples of published work, along with detailed tutorials to guide less experienced researchers",
    "editPermission": {
        "authors": [
            "Stefan.Richter"
        ],
        "type": "group"
    },
    "homepage": "https://kbbox.h-its.org/",
    "lastUpdate": "2020-12-14T14:14:16Z",
    "name": "KBbox",
    "owner": "Stefan.Richter",
    "publication": [
        {
            "doi": "10.1021/ACS.JCIM.9B00485",
            "metadata": {
                "abstract": "Copyright © 2019 American Chemical Society.The past few years have seen increasing recognition of the importance of understanding molecular binding kinetics. This has led to the development of myriad computational methods for studying the kinetics of binding processes and predicting their associated rate constants that show varying ranges of application, degrees of accuracy, and computational requirements. In order to help researchers decide which method might be suitable for their projects, we have developed KBbox, a web server that guides users in choosing the methods they should consider on the basis of the information they wish to obtain, the data they currently have available, and the computational resources to which they have access. KBbox provides information on the toolbox of available methods, their associated software tools, an expanding list of curated examples of published applications, and tutorials explaining how to apply some of the methods. It has been designed to allow the easy addition of new methods, tools, and examples as they are developed and published. KBbox is available at https://kbbox.h-its.org/.",
                "authors": [
                    {
                        "name": "Bruce N.J."
                    },
                    {
                        "name": "Ganotra G.K."
                    },
                    {
                        "name": "Richter S."
                    },
                    {
                        "name": "Wade R.C."
                    }
                ],
                "citationCount": 5,
                "date": "2019-09-23T00:00:00Z",
                "journal": "Journal of Chemical Information and Modeling",
                "title": "KBbox: A Toolbox of Computational Methods for Studying the Kinetics of Molecular Binding"
            },
            "pmid": "31381336"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Drug metabolism",
            "uri": "http://edamontology.org/topic_3375"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Pharmacology",
            "uri": "http://edamontology.org/topic_0202"
        }
    ],
    "validated": 1
}
