{"credit":[{"email":"efaraggi@mamiris.com","typeEntity":"Person","typeRoles":["Primary contact"],"url":"https://www.mathmed.org/"}],"documentation":[{"type":"GENERAL","url":"http://mamiris.com/services.html"}],"function":[{"operation":[{"term":"Protein structure prediction","uri":"http://edamontology.org/operation_0474"}]}],"labels":{"language":["Fortran","C"],"operatingSystem":["Linux","Windows"],"toolType":["Command-line tool"],"topic":[{"term":"Protein structure analysis","uri":"http://edamontology.org/topic_2814"},{"term":"Proteins","uri":"http://edamontology.org/topic_0078"},{"term":"Structure prediction","uri":"http://edamontology.org/topic_0082"},{"term":"Machine learning","uri":"http://edamontology.org/topic_3474"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/seder-2-0-a-global-protein-structure-scoring-function.html"}],"publication":[{"abstract":"We present a knowledge-based function to score protein decoys based on their similarity to native structure. A set of features is constructed to describe the structure and sequence of the entire protein chain. Furthermore, a qualitative relationship is established between the calculated features and the underlying electromagnetic interaction that dominates this scale. The features we use are associated with residue-residue distances, residue-solvent distances, pairwise knowledge-based potentials and a four-body potential. In addition, we introduce a new target to be predicted, the fitness score, which measures the similarity of a model to the native structure. This new approach enables us to obtain information both from decoys and from native structures. It is also devoid of previous problems associated with knowledge-based potentials. These features were obtained for a large set of native and decoy structures and a back-propagating neural network was trained to predict the fitness score. Overall this new scoring potential proved to be superior to the knowledge-based scoring functions used as its inputs. In particular, in the latest CASP (CASP10) experiment our method was ranked third for all targets, and second for freely modeled hard targets among about 200 groups for top model prediction. Ours was the only method ranked in the top three for all targets and for hard targets. This shows that initial results from the novel approach are able to capture details that were missed by a broad spectrum of protein structure prediction approaches. Source codes and executable from this work are freely available at http://mathmed.org/#Software and http://mamiris.com/. © 2013 Wiley Periodicals, Inc.","authors":["Faraggi E.","Kloczkowski A."],"cit_count":13,"journal":"Proteins: Structure, Function and Bioinformatics","pmid":"24264942","title":"A global machine learning based scoring function for protein structure prediction","year":"2014-01-01"}],"summary":{"biotoolsCURIE":"biotools:seder","biotoolsID":"seder","description":"A global machine learning based scoring function for protein structure prediction. The package was designed using the GEneral Neural Network program.","homepage":"http://mamiris.com/services.html","name":"Seder"}}