{"credit":[{"typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://ouyanglab.jax.org/"}],"documentation":[{"type":"GENERAL","url":"http://ouyanglab.jax.org/seqfold/#Instructions"}],"function":[{"operation":[{"term":"Structure prediction","uri":"http://edamontology.org/operation_0271"}]},{"operation":[{"term":"RNA secondary structure prediction","uri":"http://edamontology.org/operation_0278"}]},{"operation":[{"term":"Prediction","uri":"http://edamontology.org/operation_2423"}]}],"labels":{"language":["Python"],"operatingSystem":["Linux","Windows"],"toolType":["Command-line tool"],"topic":[{"term":"Structure prediction","uri":"http://edamontology.org/topic_0082"},{"term":"Transcriptome","uri":"http://edamontology.org/topic_3308"},{"term":"RNA","uri":"http://edamontology.org/topic_0099"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/seqfold-genome-scale-reconstruction-of-rna-secondary-structure-integrating-experimental-measurements.html"}],"publication":[{"abstract":"We present an integrative approach, SeqFold, that combines high-throughput RNA structure profiling data with computational prediction for genome-scale reconstruction of RNA secondary structures. SeqFold transforms experimental RNA structure information into a structure preference profile (SPP) and uses it to select stable RNA structure candidates representing the structure ensemble. Under a high-dimensional classification framework, SeqFold efficiently matches a given SPP to the most likely cluster of structures sampled from the Boltzmann-weighted ensemble. SeqFold is able to incorporate diverse types of RNA structure profiling data, including parallel analysis of RNA structure (PARS), selective 29-hydroxyl acylation analyzed by primer extension sequencing (SHAPE-Seq), fragmentation sequencing (FragSeq) data generated by deep sequencing, and conventional SHAPE data. Using the known structures of a wide range of mRNAs and noncoding RNAs as benchmarks, we demonstrate that SeqFold outperforms or matches existing approaches in accuracy and is more robust to noise in experimental data. Application of SeqFold to reconstruct the secondary structures of the yeast transcriptome reveals the diverse impact of RNA secondary structure on gene regulation, including translation efficiency, transcription initiation, and protein-RNA interactions. SeqFold can be easily adapted to incorporate any new types of highthroughput RNA structure profiling data and is widely applicable to analyze RNA structures in any transcriptome. © 2013, Published by Cold Spring Harbor Laboratory Press.","authors":["Ouyang Z.","Snyder M.P.","Chang H.Y."],"cit_count":56,"doi":"10.1101/gr.138545.112","journal":"Genome Research","title":"SeqFold: Genome-scale reconstruction of RNA secondary structure integrating high-throughput sequencing data","type":"Primary","year":"2013-02-01"}],"summary":{"biotoolsCURIE":"biotools:seqfold","biotoolsID":"seqfold","description":"RNA secondary structure prediction from experimental data. Given high-throughput data, it can reconstruct the secondary structures of the whole transcriptome, termed the RNA structurome.","homepage":"http://ouyanglab.jax.org/seqfold/","name":"SeqFold"}}