
{
    "credit": [
        {
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://www.cs.technion.ac.il/labs/cbl/"
        }
    ],
    "documentation": [
        {
            "type": "User manual",
            "url": "http://bioinfo.cs.technion.ac.il/haploblock/HaploBlock_Manual.pdf"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Phasing",
                    "uri": "http://edamontology.org/operation_3454"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Mapping",
                    "uri": "http://edamontology.org/operation_2429"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux",
            "Mac"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Studies",
                "uri": "http://edamontology.org/topic_3678"
            },
            {
                "term": "SNP",
                "uri": "http://edamontology.org/topic_2885"
            },
            {
                "term": "Genetics",
                "uri": "http://edamontology.org/topic_3053"
            },
            {
                "term": "Mapping",
                "uri": "http://edamontology.org/topic_0102"
            },
            {
                "term": "Linkage",
                "uri": "http://edamontology.org/topic_0102"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/haploblock-1-2-haplotype-block-identification-resolution-high-density-snp-data.html"
        }
    ],
    "publication": [
        {
            "abstract": "Motivation: The presence of millions of single nucleotide polymorphisms (SNPs) in the human genome has spurred interest in genetic mapping methods based on linkage disequilibrium. The recently discovered haplotype block structure of human variation promises to improve the effectiveness of these methods. A key difficulty for mapping techniques is the cost involved in separately identifying the haplotypes on each of an individual's chromosomes. Results: We present a new approach for performing linkage disequilibrium mapping using high density haplotype or genotype data. Our method is based on a statistical model of haplotype block variation, which takes account of recombination hotspots, bottlenecks, genetic drift and mutation. We test our technique on two empirically determined high density datasets, attempting to recover the location of an SNP which was hidden and converted into phenotype information. We compare the results against a mapping method based on individual SNPs as well as a competing haplotype-based approach. We show that our strategy significantly outperforms these other approaches when used as a guide for resequencing and that it can also deal with both unphased genotype data and low penetrance diseases. Availability: HaploBlock executables for Linux, Mac OS X and Sun OS, as well as user documentation, are available online at http://bioinfo.cs. technion.ac.il/haploblock/. © Oxford University Press 2004; all rights reserved.",
            "authors": [
                "Greenspan G.",
                "Geiger D."
            ],
            "cit_count": 31,
            "doi": "10.1093/bioinformatics/bth907",
            "journal": "Bioinformatics",
            "title": "High density linkage disequilibrium mapping using models of haplotype block variation",
            "type": "Primary",
            "year": "2004-12-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:haploblock",
        "biotoolsID": "haploblock",
        "description": "HaploBlock is a software program which provides an integrated approach to haplotype block identification, haplotyping SNPs (or haplotype phasing, resolution or reconstruction) and linkage disequilibrium (LD) mapping (or genetic association studies). HaploBlock is suitable for high density haplotype or genotype SNP marker data and is based on a statistical model which takes account of recombination hotspots, bottlenecks, genetic drift and mutations and has a Markov Chain at its core.",
        "homepage": "http://www.cs.technion.ac.il/labs/cbl/haploblock/",
        "name": "HaploBlock",
        "version": [
            "1.2"
        ]
    }
}