{
    "additionDate": "2017-02-10T14:15:48Z",
    "biotoolsCURIE": "biotools:zifit",
    "biotoolsID": "zifit",
    "credit": [
        {
            "email": "jdsander@iastate.edu",
            "name": "J.D. Sander",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "ZiFiT (Zinc Finger Targeter) assists in the design of zinc finger proteins that can bind to specific DNA sequences. ZiFiT has been updated to integrate additional tools and resources including scoring schemes for modular assembly, an interface with the Zinc Finger Database of engineered ZFPs, and direct query of NCBI BLAST servers for identification of potential off-target sites within a host genome.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein-nucleic acid binding prediction",
                    "uri": "http://edamontology.org/operation_0420"
                },
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                },
                {
                    "term": "Sequence assembly",
                    "uri": "http://edamontology.org/operation_0310"
                }
            ]
        }
    ],
    "homepage": "http://bindr.gdcb.iastate.edu/ZiFiT/",
    "homepage_status": 1,
    "lastUpdate": "2018-12-10T12:58:57Z",
    "name": "ZiFiT",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "ZiFiT (Zinc Finger Targeter) is a simple and intuitive web-based tool that provides an interface to identify potential binding sites for engineered zinc finger proteins (ZFPs) in user-supplied DNA sequences. In this updated version, ZiFiT identifies potential sites for ZFPs made by both the modular assembly and OPEN engineering methods. In addition, ZiFiT now integrates additional tools and resources including scoring schemes for modular assembly, an interface with the Zinc Finger Database (ZiFDB) of engineered ZFPs, and direct querying of NCBI BLAST servers for identifying potential off-target sites within a host genome. Taken together, these features facilitate design of ZFPs using reagents made available to the academic research community by the Zinc Finger Consortium. ZiFiT is freely available on the web without registration at http://bindr.gdcb.iastate.edu/ZiFiT/. © The Author(s) 2010. Published by Oxford University Press.",
                "authors": [
                    {
                        "name": "Dobbs D."
                    },
                    {
                        "name": "Joung J.K."
                    },
                    {
                        "name": "Maeder M.L."
                    },
                    {
                        "name": "Reyon D."
                    },
                    {
                        "name": "Sander J.D."
                    },
                    {
                        "name": "Voytas D.F."
                    }
                ],
                "citationCount": 251,
                "date": "2010-04-30T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "ZiFiT (Zinc Finger Targeter): An updated zinc finger engineering tool"
            },
            "pmid": "20435679"
        },
        {
            "metadata": {
                "abstract": "Zinc Finger Targeter (ZiFiT) is a simple and intuitive web-based tool that facilitates the design of zinc finger proteins (ZFPs) that can bind to specific DNA sequences. The current version of ZiFiT is based on a widely employed method of ZFP design, the 'modular assembly' approach, in which pre-existing individual zinc fingers are linked together to recognize desired target DNA sequences. Several research groups have described experimentally characterized zinc finger modules that bind many of the 64 possible DNA triplets. ZiFiT leverages the combined capabilities of three of the largest and best characterized module archives by enabling users to select fingers from any of these sets. ZiFiT searches a query DNA sequence for target sites for which a ZFP can be designed using modules available in one or more of the three archives. In addition, ZiFiT output facilitates identification of specific zinc finger modules that are publicly available from the Zinc Finger Consortium. ZiFiT is freely available at http://bindr.gdcb.iastate. edu/ZiFiT/. © 2007 The Author(s).",
                "authors": [
                    {
                        "name": "Dobbs D."
                    },
                    {
                        "name": "Joung J.K."
                    },
                    {
                        "name": "Sander J.D."
                    },
                    {
                        "name": "Voytas D.F."
                    },
                    {
                        "name": "Zaback P."
                    }
                ],
                "citationCount": 179,
                "date": "2007-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "Zinc Finger Targeter (ZiFiT): An engineered zinc finger/target site design tool"
            },
            "pmid": "17526515"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "DNA binding sites",
            "uri": "http://edamontology.org/topic_3125"
        },
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ],
    "validated": 1
}
