{
    "additionDate": "2018-05-17T17:15:17Z",
    "biotoolsCURIE": "biotools:synchr",
    "biotoolsID": "synchr",
    "credit": [
        {
            "email": "Gilles.Fischer@upmc.fr",
            "name": "Gilles Fischer",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "A Fast and Easy Tool to Reconstruct and Visualize Synteny Blocks along Eukaryotic Chromosomes.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://www.lcqb.upmc.fr/CHROnicle/SynChro.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Linkage analysis",
                    "uri": "http://edamontology.org/operation_0283"
                }
            ]
        }
    ],
    "homepage": "http://www.lcqb.upmc.fr/CHROnicle/SynChro.html",
    "language": [
        "Python"
    ],
    "lastUpdate": "2018-12-10T12:58:58Z",
    "name": "SynChr",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PONE.0092621",
            "metadata": {
                "abstract": "Reconstructing synteny blocks is an essential step in comparative genomics studies. Different methods were already developed to answer various needs such as genome (re-)annotation, identification of duplicated regions and whole genome duplication events or estimation of rearrangement rates. We present SynChro, a tool that reconstructs synteny blocks between pairwise comparisons of multiple genomes. SynChro is based on a simple algorithm that computes Reciprocal Best-Hits (RBH) to reconstruct the backbones of the synteny blocks and then automatically completes these blocks with non-RBH syntenic homologs. This approach has two main advantages: (i) synteny block reconstruction is fast (feasible on a desk computer for large eukaryotic genomes such as human) and (ii) synteny block reconstruction is straightforward as all steps are integrated (no need to run Blast or TribeMCL prior to reconstruction) and there is only one parameter to set up, the synteny block stringency Δ. Benchmarks on three pairwise comparisons of genomes, representing three different levels of synteny conservation (Human/Mouse, Human/Zebra Finch and Human/Zebrafish) show that Synchro runs faster and performs at least as well as two other commonly used and more sophisticated tools (MCScanX and i-ADHoRe). In addition, SynChro provides the user with a rich set of graphical outputs including dotplots, chromosome paintings and detailed synteny maps to visualize synteny blocks with all homology relationships and synteny breakpoints with all included genetic features. SynChro is freely available under the BSD license at http://www.lcqb.upmc.fr/CHROnicle/SynChro.html. © 2014 Drillon et al.",
                "authors": [
                    {
                        "name": "Drillon G."
                    },
                    {
                        "name": "Carbone A."
                    },
                    {
                        "name": "Fischer G."
                    }
                ],
                "citationCount": 43,
                "date": "2014-03-20T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "SynChro: A fast and easy tool to reconstruct and visualize synteny blocks along eukaryotic chromosomes"
            },
            "pmcid": "PMC3961402",
            "pmid": "24651407"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        },
        {
            "term": "Sequence sites, features and motifs",
            "uri": "http://edamontology.org/topic_0160"
        },
        {
            "term": "Data visualisation",
            "uri": "http://edamontology.org/topic_0092"
        }
    ],
    "validated": 1
}