{
    "additionDate": "2017-01-17T15:05:40Z",
    "biotoolsCURIE": "biotools:birewire",
    "biotoolsID": "birewire",
    "collectionID": [
        "BioConductor"
    ],
    "credit": [
        {
            "email": "gobbi.andrea@mail.com",
            "name": "Andrea Gobbi",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Fast functions for bipartite network rewiring through N consecutive switching steps and for the computation of the minimal number of switching steps to be performed in order to maximise the dissimilarity with respect to the original network. Includes functions for the analysis of the introduced randomness across the switching steps and several other routines to analyse the resulting networks and their natural projections.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://bioconductor.org/packages/release/bioc/html/BiRewire.html"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://bioconductor/packages/release/bioc/src/contrib/BiRewire_3.4.0.tar.gz"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence mutation and randomisation",
                    "uri": "http://edamontology.org/operation_0367"
                }
            ]
        }
    ],
    "homepage": "http://bioconductor.org/packages/release/bioc/html/BiRewire.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2019-01-10T15:26:33Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Mirror"
            ],
            "url": "http://www.ebi.ac.uk/~iorio/BiRewire"
        }
    ],
    "name": "BiRewire",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "bioconductor_import",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btu474",
            "metadata": {
                "abstract": "Motivation: Studying combinatorial patterns in cancer genomic datasets has recently emerged as a tool for identifying novel cancer driver networks. Approaches have been devised to quantify, for example, the tendency of a set of genes to be mutated in a 'mutually exclusive' manner. The significance of the proposed metrics is usually evaluated by computing P-values under appropriate null models. To this end, a Monte Carlo method (the switching-Algorithm) is used to sample simulated datasets under a null model that preserves patient-and genewise mutation rates. In this method, a genomic dataset is represented as a bipartite network, to which Markov chain updates (switchingsteps) are applied. These steps modify the network topology, and a minimal number of them must be executed to draw simulated datasets independently under the null model. This number has previously been deducted empirically to be a linear function of the total number of variants, making this process computationally expensive. Results: We present a novel approximate lower bound for the number of switching-steps, derived analytically. Additionally, we have developed the R package BiRewire, including new efficient implementations of the switching-Algorithm. We illustrate the performances of BiRewire by applying it to large real cancer genomics datasets. We report vast reductions in time requirement, with respect to existing implementations/bounds and equivalent P-value computations. Thus, we propose BiRewire to study statistical properties in genomic datasets, and other data that can be modeled as bipartite networks.. © The Author(s) 2014.",
                "authors": [
                    {
                        "name": "Gobbi A."
                    },
                    {
                        "name": "Iorio F."
                    },
                    {
                        "name": "Dawson K.J."
                    },
                    {
                        "name": "Wedge D.C."
                    },
                    {
                        "name": "Tamborero D."
                    },
                    {
                        "name": "Alexandrov L.B."
                    },
                    {
                        "name": "Lopez-Bigas N."
                    },
                    {
                        "name": "Garnett M.J."
                    },
                    {
                        "name": "Jurman G."
                    },
                    {
                        "name": "Saez-Rodriguez J."
                    }
                ],
                "citationCount": 25,
                "date": "2014-09-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Fast randomization of large genomic datasets while preserving alteration counts"
            },
            "pmcid": "PMC4147926",
            "pmid": "25161255",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool",
        "Library"
    ],
    "topic": [
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ],
    "validated": 1,
    "version": [
        "3.4.0"
    ]
}