{
    "additionDate": "2020-01-14T09:42:27Z",
    "biotoolsCURIE": "biotools:CIE",
    "biotoolsID": "CIE",
    "confidence_flag": "tool",
    "description": "a platform for directional gene set enrichment analysis and inference of active transcriptional regulators.\n\nCausal Inference and Directional Enrichment Methods on Biological Networks.\n\nLaunching Causal Inference Engine...\n\nCIE is a platform for inference of active transcriptional regulators of differential gene expression. CIE provides a user-friendly web-app and an R-package to run inference queries on casual regulatory netowrks. Several regulatory networks are provided in the platform, including a TF-gene intraction network constructed from ChIP-seq and tissue specific gene expression data, a netowrk based on STRING-DB, and curated TF-gene interaction networks such as TRRUST and TRED. The R-package provides functionality for custom networks as well.\n\nCausal Inference Engine: Directional Enrichment Analysis on Biological Networks.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene regulatory network analysis",
                    "uri": "http://edamontology.org/operation_1781"
                },
                {
                    "term": "Gene-set enrichment analysis",
                    "uri": "http://edamontology.org/operation_2436"
                },
                {
                    "term": "Pathway or network prediction",
                    "uri": "http://edamontology.org/operation_3439"
                },
                {
                    "term": "Pathway or network visualisation",
                    "uri": "http://edamontology.org/operation_3083"
                }
            ]
        }
    ],
    "homepage": "https://umbibio.math.umb.edu/cie/app",
    "language": [
        "R"
    ],
    "lastUpdate": "2024-11-24T20:55:41.511160Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/umbibio/CIE-R-Package"
        }
    ],
    "name": "Causal Inference Enrichment (CIE)",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/nar/gkz1046",
            "metadata": {
                "abstract": "Inference of active regulatory mechanisms underlying specific molecular and environmental perturbations is essential for understanding cellular response. The success of inference algorithms relies on the quality and coverage of the underlying network of regulator-gene interactions. Several commercial platforms provide large and manually curated regulatory networks and functionality to perform inference on these networks. Adaptation of such platforms for open-source academic applications has been hindered by the lack of availability of accurate, high-coverage networks of regulatory interactions and integration of efficient causal inference algorithms. In this work, we present CIE, an integrated platform for causal inference of active regulatory mechanisms form differential gene expression data. Using a regularized Gaussian Graphical Model, we construct a transcriptional regulatory network by integrating publicly available ChIP-seq experiments with gene-expression data from tissue-specific RNA-seq experiments. Our GGM approach identifies high confidence transcription factor (TF)-gene interactions and annotates the interactions with information on mode of regulation (activation vs. repression). Benchmarks against manually curated databases of TF-gene interactions show that our method can accurately detect mode of regulation. We demonstrate the ability of our platform to identify active transcriptional regulators by using controlled in vitro overexpression and stem-cell differentiation studies and utilize our method to investigate transcriptional mechanisms of fibroblast phenotypic plasticity.",
                "authors": [
                    {
                        "name": "Farahmand S."
                    },
                    {
                        "name": "MacOska J.A."
                    },
                    {
                        "name": "O'Connor C."
                    },
                    {
                        "name": "Zarringhalam K."
                    }
                ],
                "citationCount": 9,
                "date": "2019-12-16T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "Causal Inference Engine: A platform for directional gene set enrichment analysis and inference of active transcriptional regulators"
            },
            "pmcid": "PMC7145661",
            "pmid": "31701125"
        }
    ],
    "topic": [
        {
            "term": "ChIP-seq",
            "uri": "http://edamontology.org/topic_3169"
        },
        {
            "term": "Gene regulation",
            "uri": "http://edamontology.org/topic_0204"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ],
    "validated": 1
}
