{
    "accessibility": "Open access",
    "additionDate": "2019-08-09T13:14:25Z",
    "biotoolsCURIE": "biotools:El-MAVEN",
    "biotoolsID": "El-MAVEN",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "info@elucidata.io",
            "typeRole": [
                "Support"
            ]
        },
        {
            "email": "elmaven@elucidata.io",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "> HOMEPAGE MISSING! | A Fast, Robust, and User-Friendly Mass Spectrometry Data Processing Engine for Metabolomics | Analysis of large metabolomic datasets is becoming commonplace with the increased realization of the role that metabolites play in biology and pathophysiology. While there are many open-source analysis tools to extract peaks from liquid chromatography-mass spectrometry (LC-MS), gas chromatography-mass spectrometry (GC-MS), and tandem mass spectrometry (LC-MS MS) data, these tools are not very interactive and are suboptimal when a large number of samples are to be analyzed. El-MAVEN is an open-source analysis platform that extends MAVEN and provides fast, powerful, and interactive analysis capabilities especially for datasets containing over 100 samples. The El-MAVEN workflow is easy to use with just four steps from loading data to exporting of the results",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://elucidatainc.github.io/ElMaven/documentation/"
        }
    ],
    "download": [
        {
            "type": "Binaries",
            "url": "https://elucidatainc.github.io/ElMaven/Downloads/"
        },
        {
            "type": "Source code",
            "url": "https://github.com/ElucidataInc/ElMaven/releases"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "homepage": "https://www.ncbi.nlm.nih.gov/pubmed/?term=31119671",
    "lastUpdate": "2020-06-16T10:55:25Z",
    "license": "GPL-2.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/ElucidataInc/ElMaven"
        },
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/ElucidataInc/ElMaven/issues"
        }
    ],
    "maturity": "Mature",
    "name": "El-MAVEN",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "hans",
    "publication": [
        {
            "doi": "10.1007/978-1-4939-9236-2_19",
            "metadata": {
                "abstract": "© Springer Science+Business Media, LLC, part of Springer Nature 2019.Analysis of large metabolomic datasets is becoming commonplace with the increased realization of the role that metabolites play in biology and pathophysiology. While there are many open-source analysis tools to extract peaks from liquid chromatography-mass spectrometry (LC-MS), gas chromatography-mass spectrometry (GC-MS), and tandem mass spectrometry (LC-MS/MS) data, these tools are not very interactive and are suboptimal when a large number of samples are to be analyzed. El-MAVEN is an open-source analysis platform that extends MAVEN and provides fast, powerful, and interactive analysis capabilities especially for datasets containing over 100 samples. The El-MAVEN workflow is easy to use with just four steps from loading data to exporting of the results. Advanced analysis and software techniques such as multiprocessing, machine learning, and reduction of memory leaks are implemented so as to provide a seamless and interactive user experience. Results from El-MAVEN can be exported in a range of formats allowing continued analysis on other platforms. Additionally, El-MAVEN is also fully integrated with Polly™, a cloud-based analysis platform that provides a range of tools for flux analysis and integrative-omics analysis. El-MAVEN is a powerful tool that enables fast and efficient analysis of large metabolomic datasets to accelerate the process of gaining insight from raw data.",
                "authors": [
                    {
                        "name": "Agrawal S."
                    },
                    {
                        "name": "Kumar S."
                    },
                    {
                        "name": "Sehgal R."
                    },
                    {
                        "name": "George S."
                    },
                    {
                        "name": "Gupta R."
                    },
                    {
                        "name": "Poddar S."
                    },
                    {
                        "name": "Jha A."
                    },
                    {
                        "name": "Pathak S."
                    }
                ],
                "date": "2019-01-01T00:00:00Z",
                "journal": "Methods in Molecular Biology",
                "title": "EL-MAVEN: A fast, robust, and user-friendly mass spectrometry data processing engine for metabolomics"
            },
            "pmid": "31119671",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ]
}