{
    "accessibility": [],
    "additionDate": "2017-01-13T13:14:13Z",
    "biotoolsCURIE": "biotools:crisp",
    "biotoolsID": "crisp",
    "collectionID": [],
    "confidence_flag": null,
    "cost": null,
    "credit": [
        {
            "email": "vibansal@ucsd.edu",
            "gridid": null,
            "name": "Vikas Bansal",
            "note": null,
            "orcidid": null,
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": null
        }
    ],
    "description": "Identifies rare and common variants in pooled sequencing data",
    "documentation": [
        {
            "note": null,
            "type": "General",
            "url": "https://bansal-lab.github.io/software/crisp.html"
        }
    ],
    "download": [],
    "editPermission": {
        "authors": [],
        "type": "private"
    },
    "elixirNode": [],
    "elixirPlatform": [],
    "elixir_badge": 0,
    "function": [
        {
            "cmd": null,
            "input": [],
            "note": null,
            "operation": [
                {
                    "term": "Genetic variation analysis",
                    "uri": "http://edamontology.org/operation_3197"
                }
            ],
            "output": []
        }
    ],
    "homepage": "https://bansal-lab.github.io/software/crisp.html",
    "homepage_status": 0,
    "language": [
        "Python",
        "C"
    ],
    "lastUpdate": "2018-12-10T12:58:52Z",
    "license": null,
    "link": [],
    "maturity": null,
    "name": "CRISP",
    "operatingSystem": [],
    "otherID": [],
    "owner": "seqwiki_import",
    "publication": [
        {
            "doi": null,
            "metadata": {
                "abstract": "Motivation: Next-generation sequencing technologies have enabled the sequencing of several human genomes in their entirety. However, the routine resequencing of complete genomes remains infeasible. The massive capacity of next-generation sequencers can be harnessed for sequencing specific genomic regions in hundreds to thousands of individuals. Sequencing-based association studies are currently limited by the low level of multiplexing offered by sequencing platforms. Pooled sequencing represents a costeffective approach for studying rare variants in large populations. To utilize the power of DNA pooling, it is important to accurately identify sequence variants from pooled sequencing data. Detection of rare variants from pooled sequencing represents a different challenge than detection of variants from individual sequencing. Results: We describe a novel statistical approach, CRISP [Comprehensive Read analysis for Identification of Single Nucleotide Polymorphisms (SNPs) from Pooled sequencing] that is able to identify both rare and common variants by using two approaches: (i) comparing the distribution of allele counts across multiple pools using contingency tables and (ii) evaluating the probability of observing multiple non-reference base calls due to sequencing errors alone. Information about the distribution of reads between the forward and reverse strands and the size of the pools is also incorporated within this framework to filter out false variants. Validation of CRISP on two separate pooled sequencing datasets generated using the Illumina Genome Analyzer demonstrates that it can detect 80-85% of SNPs identified using individual sequencing while achieving a low false discovery rate (3-5%). Comparison with previous methods for pooled SNP detection demonstrates the significantly lower false positive and false negative rates for CRISP. Availability: Implementation of this method is available at http://polymorphism.scripps.edu/~vbansal/software/CRISP/. Contact: vbansal@scripps.edu. © The Author(s) 2010. Published by Oxford University Press.",
                "authors": [
                    {
                        "name": "Bansal V."
                    }
                ],
                "citationCount": 110,
                "date": "2010-06-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "A statistical method for the detection of variants from next-generation resequencing of DNA pools"
            },
            "note": null,
            "pmcid": null,
            "pmid": "20529923",
            "type": null,
            "version": null
        }
    ],
    "relation": [],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        }
    ],
    "validated": 1,
    "version": []
}