{"credit":[{"email":"zemin.ning@sanger.ac.uk","name":"Dr Zemin Ning","typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://www.sanger.ac.uk/people/directory/ning-zemin"}],"documentation":[{"type":"GENERAL","url":"http://www.sanger.ac.uk/science/tools/ssahasnp"}],"function":[{"operation":[{"term":"SNP detection","uri":"http://edamontology.org/operation_0484"},{"term":"Read mapping","uri":"http://edamontology.org/operation_3198"}]}],"labels":{"license":"GPL-3.0","operatingSystem":["Linux","Mac"],"toolType":["Command-line tool"],"topic":[{"term":"Sequence analysis","uri":"http://edamontology.org/topic_0080"},{"term":"Genetic variation","uri":"http://edamontology.org/topic_0199"},{"term":"Genomics","uri":"http://edamontology.org/topic_0622"}]},"publication":[{"abstract":"We describe an algorithm, SSAHA (Sequence Search and Alignment by Hashing Algorithm), for performing fast searches on databases containing multiple gigabases of DNA. Sequences in the database are preprocessed by breaking them into consecutive k-tuples of k contiguous bases and then using a hash table to store the position of each occurrence of each k-tuple. Searching for a query sequence in the database is done by obtaining from the hash table the \"hits\" for each k-tuple in the query sequence and then performing a sort on the results. We discuss the effect of the tuple length k on the search speed, memory usage, and sensitivity of the algorithm and present the results of computational experiments which show that SSAHA can be three to four orders of magnitude faster than BLAST or FASTA, while requiring less memory than suffix tree methods. The SSAHA algorithm is used for high-throughput single nucleotide polymorphism (SNP) detection and very large scale sequence assembly. Also, it provides Web-based sequence search facilities for Ensembl projects.","authors":["Ning Z.","Cox A.J.","Mullikin J.C."],"cit_count":697,"doi":"10.1101/gr.194201","journal":"Genome Research","title":"SSAHA: A fast search method for large DNA databases","type":"Primary","year":"2001-11-20"}],"summary":{"biotoolsCURIE":"biotools:ssahasnp","biotoolsID":"ssahasnp","description":"A tool for polymorphism detection. It detects homozygous SNPs and indels by aligning shotgun reads to the finished genome sequence.","homepage":"http://www.sanger.ac.uk/science/tools/ssahasnp","name":"SsahaSNP"}}