{
    "additionDate": "2021-01-18T11:37:11Z",
    "biotoolsCURIE": "biotools:thicknesstool",
    "biotoolsID": "thicknesstool",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "Demetrios_Vavvas@MEEI.HARVARD.EDU",
            "name": "Demetrios G. Vavvas",
            "typeEntity": "Person"
        }
    ],
    "description": "automated ImageJ retinal layer thickness and profile in digital images.\n\nTo develop an automated retina layer thickness measurement tool for the ImageJ platform, to quantitate nuclear layers following the retina contour. We developed the ThicknessTool (TT), an automated thickness measurement plugin for the ImageJ platform. To calibrate TT, we created a calibration dataset of mock binary skeletonized mask images with increasing thickness masks and different rotations. Following, we created a training dataset and performed an agreement analysis of thickness measurements between TT and two masked manual observers. Finally, we tested the performance of TT measurements in a validation dataset of retinal detachment images. In the calibration dataset, there were no differences in layer thickness between measured and known thickness masks, with an overall coefficient of variation of 0.00%",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/DanielMaidana/ThicknessTool",
    "lastUpdate": "2021-02-27T09:20:45Z",
    "license": "GPL-3.0",
    "name": "ThicknessTool",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1038/S41598-020-75501-Y",
            "metadata": {
                "abstract": "© 2020, The Author(s).To develop an automated retina layer thickness measurement tool for the ImageJ platform, to quantitate nuclear layers following the retina contour. We developed the ThicknessTool (TT), an automated thickness measurement plugin for the ImageJ platform. To calibrate TT, we created a calibration dataset of mock binary skeletonized mask images with increasing thickness masks and different rotations. Following, we created a training dataset and performed an agreement analysis of thickness measurements between TT and two masked manual observers. Finally, we tested the performance of TT measurements in a validation dataset of retinal detachment images. In the calibration dataset, there were no differences in layer thickness between measured and known thickness masks, with an overall coefficient of variation of 0.00%. Training dataset measurements of immunofluorescence retina nuclear layers disclosed no significant differences between TT and any observer’s average outer nuclear layer (ONL) (p = 0.998), inner nuclear layer (INL) (p = 0.807), and ONL/INL ratio (p = 0.944) measurements. Agreement analysis showed that bias between TT vs. observers’ mean was lower than between any observers’ mean against each other in the ONL (0.77 ± 0.34 µm vs 3.25 ± 0.33 µm) and INL (1.59 ± 0.28 µm vs 2.82 ± 0.36 µm). Validation dataset showed that TT can detect significant and true ONL thinning (p = 0.006), more sensitive than manual measurement capabilities (p = 0.069). ThicknessTool can measure retina nuclear layers thickness in a fast, accurate, and precise manner with multi-platform capabilities. In addition, the TT can be customized to user preferences and is freely available to download.",
                "authors": [
                    {
                        "name": "Caminal-Mitjana J.M."
                    },
                    {
                        "name": "Joseph D."
                    },
                    {
                        "name": "Kosmidou C."
                    },
                    {
                        "name": "Maidana D.E."
                    },
                    {
                        "name": "Miller J.W."
                    },
                    {
                        "name": "Notomi S."
                    },
                    {
                        "name": "Ueta T."
                    },
                    {
                        "name": "Vavvas D.G."
                    },
                    {
                        "name": "Zhou T."
                    }
                ],
                "citationCount": 1,
                "date": "2020-12-01T00:00:00Z",
                "journal": "Scientific Reports",
                "title": "ThicknessTool: automated ImageJ retinal layer thickness and profile in digital images"
            },
            "pmcid": "PMC7595229",
            "pmid": "33116161"
        }
    ],
    "topic": [
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Computer science",
            "uri": "http://edamontology.org/topic_3316"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        }
    ]
}
