
{
    "credit": [
        {
            "email": "lihaipeng@picb.ac.cn",
            "name": "LI Haipeng",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://www.picb.ac.cn/evolgen/"
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://www.picb.ac.cn/evolgen/softwares/download/MFDM_readMe_1.1.txt"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Phylogenetic tree analysis (natural selection)",
                    "uri": "http://edamontology.org/operation_0554"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "R"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "DNA polymorphism",
                "uri": "http://edamontology.org/topic_2885"
            },
            {
                "term": "Genetics",
                "uri": "http://edamontology.org/topic_3053"
            },
            {
                "term": "Evolutionary biology",
                "uri": "http://edamontology.org/topic_3299"
            },
            {
                "term": "Population genetics",
                "uri": "http://edamontology.org/topic_3056"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/mfdm-detect-recent-positive-selection-reliably-in-natural-populations.html"
        }
    ],
    "publication": [
        {
            "abstract": "It has been a long-standing interest in evolutionary biology to search for the traces of recent positive Darwinian selection in organisms. However, such efforts have been severely hindered by the confounding signatures of demography. As a consequence, neutrality tests often lead to false inference of positive selection because they detect the deviation from the standard neutral model. Here, using the maximum frequency of derived mutations (MFDM) to examine the unbalanceness of the tree of a locus, I propose a statistical test that is analytically free from the confounding effects of varying population size and has a high statistical power (up to 90.5%) to detect recent positive selection. When compared with five well-known neutrality tests for detecting selection (i.e., Tajima's D test, Fu and Li's D test, Fay and Wu's H test, the E test, and the joint DH test), the MFDM test is indeed the only one free from the confounding impacts of bottlenecks and size expansions. Simulations based on wide-range parameters demonstrated that the MFDM test is robust to background selection, population subdivision, and admixture (including hidden population structure). Moreover, when two high-frequency mutations are introduced, the MFDM test is robust to the misinference of derived and ancestral variants of segregating sites due to multiple hits. Finally, the sensitivity of the MFDM test in detecting balancing selection is also discussed. In summary, it is demonstrated that summary statistics based on tree topology can be used to detect selection, and this work provides a reliable method that can distinguish selection from demography even when DNA polymorphism data from only one locus is available. © 2010 The Author.",
            "authors": [
                "Li H."
            ],
            "cit_count": 52,
            "journal": "Molecular Biology and Evolution",
            "pmid": "20709734",
            "title": "A new test for detecting recent positive selection that is free from the confounding impacts of demography",
            "year": "2011-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:mfdm",
        "biotoolsID": "mfdm",
        "description": "Designed to reliably detect recent positive selection in a varying size population, even if you only have polymorphism data from a single locus (i.e. a very short piece of DNA).",
        "homepage": "http://www.picb.ac.cn/evolgen/softwares/index.html",
        "name": "MFDM"
    }
}