{
    "accessibility": "Open access",
    "additionDate": "2018-09-19T14:11:20Z",
    "biotoolsCURIE": "biotools:genlib",
    "biotoolsID": "genlib",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "heloise.gauvin@umontreal.ca",
            "name": "Héloïse Gauvin",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "name": "Marie-Hélène Roy-Gagnon"
        },
        {
            "name": "Mohan Rakesh"
        }
    ],
    "description": "GENLIB is an R package that can be used to analyze genealogical data.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://cran.r-project.org/web/packages/GENLIB/GENLIB.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Probabilistic sequence generation",
                    "uri": "http://edamontology.org/operation_3481"
                }
            ]
        }
    ],
    "homepage": "https://cran.r-project.org/web/packages/GENLIB/index.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2024-11-24T14:50:34.563163Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/R-GENLIB/GENLIB"
        }
    ],
    "name": "GENLIB",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "daniel_stefan",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btad136",
            "metadata": {
                "abstract": "Summary: Founder populations with deep genealogical data are well suited for investigating genetic variants contributing to diseases. Here, we present a major update of the genealogical analysis R package GENLIB, centered around a new function which can simulate the transmission of haplotypes from founders to probands along very large and complex user-specified genealogies. Availability and implementation: The latest update of the GENLIB package (v1.1.9) contains the new gen.simuHaplo() function and is available on the CRAN repository and from https://github.com/R-GENLIB/GENLIB. Examples can be accessed at https://github.com/R-GENLIB/simuhaplo_functions.",
                "authors": [
                    {
                        "name": "Burkett K.M."
                    },
                    {
                        "name": "Freeman E.E."
                    },
                    {
                        "name": "Laprise C."
                    },
                    {
                        "name": "Rakesh M."
                    },
                    {
                        "name": "Roy-Gagnon M.-H."
                    },
                    {
                        "name": "Vezina H."
                    }
                ],
                "date": "2023-03-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "GENLIB: new function to simulate haplotype transmission in large complex genealogies"
            },
            "pmcid": "PMC10049784",
            "pmid": "36929931"
        },
        {
            "doi": "10.1186/s12859-015-0581-5",
            "metadata": {
                "abstract": "Background: Founder populations have an important role in the study of genetic diseases. Access to detailed genealogical records is often one of their advantages. These genealogical data provide unique information for researchers in evolutionary and population genetics, demography and genetic epidemiology. However, analyzing large genealogical datasets requires specialized methods and software. The GENLIB software was developed to study the large genealogies of the French Canadian population of Quebec, Canada. These genealogies are accessible through the BALSAC database, which contains over 3 million records covering the whole province of Quebec over four centuries. Using this resource, extended pedigrees of up to 17 generations can be constructed from a sample of present-day individuals. Results: We have extended and implemented GENLIB as a package in the R environment for statistical computing and graphics, thus allowing optimal flexibility for users. The GENLIB package includes basic functions to manage genealogical data allowing, for example, extraction of a part of a genealogy or selection of specific individuals. There are also many functions providing information to describe the size and complexity of genealogies as well as functions to compute standard measures such as kinship, inbreeding and genetic contribution. GENLIB also includes functions for gene-dropping simulations. The goal of this paper is to present the full functionalities of GENLIB. We used a sample of 140 individuals from the province of Quebec (Canada) to demonstrate GENLIB's functions. Ascending genealogies for these individuals were reconstructed using BALSAC, yielding a large pedigree of 41,523 individuals. Using GENLIB's functions, we provide a detailed description of these genealogical data in terms of completeness, genetic contribution of founders, relatedness, inbreeding and the overall complexity of the genealogical tree. We also present gene-dropping simulations based on the whole genealogy to investigate identical-by-descent sharing of alleles and chromosomal segments of different lengths and estimate probabilities of identical-by-descent sharing. Conclusions: The R package GENLIB provides a user friendly and flexible environment to analyze extensive genealogical data, allowing an efficient and easy integration of different types of data, analytical methods and additional developments and making this tool ideal for genealogical analysis.",
                "authors": [
                    {
                        "name": "Gauvin H."
                    },
                    {
                        "name": "Labuda D."
                    },
                    {
                        "name": "Lavoie E.-M."
                    },
                    {
                        "name": "Lefebvre J.-F."
                    },
                    {
                        "name": "Moreau C."
                    },
                    {
                        "name": "Roy-Gagnon M.-H."
                    },
                    {
                        "name": "Vezina H."
                    }
                ],
                "citationCount": 14,
                "date": "2015-12-12T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "GENLIB: An R package for the analysis of genealogical data"
            },
            "pmcid": "PMC4431039",
            "pmid": "25971991",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool",
        "Script"
    ],
    "topic": [
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        },
        {
            "term": "Population genetics",
            "uri": "http://edamontology.org/topic_3056"
        }
    ],
    "validated": 1,
    "version": [
        "1.0.6"
    ]
}
