{"credit":[{"typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://qge.fhcrc.org/contact.php"}],"documentation":[{"type":"GENERAL","url":"http://qge.fhcrc.org/MAGprediction/"}],"function":[{"operation":[{"term":"Sequence feature detection","uri":"http://edamontology.org/operation_0253"}]}],"labels":{"operatingSystem":["Linux","Windows"],"toolType":["Desktop application"],"topic":[{"term":"DNA polymorphism","uri":"http://edamontology.org/topic_2885"},{"term":"Genetics","uri":"http://edamontology.org/topic_3053"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/magprediction-gene-allele-prediction-unphased-snp-data.html"}],"publication":[{"abstract":"Recent advances in genotyping technologies have enabled genomewide association studies (GWAS) of many complex traits including autoimmune disease, infectious disease, cancer and heart disease. To facilitate interpretations and establish biological basis, it could be advantageous to identify alleles of functional genes, beyond just single nucleotide polymorphisms (SNPs) within or nearby genes. Leslie et al. ([2008] Am J Hum Genet 82:48-56) have proposed an Identity-by-Decent method (IBD-based) for predicting human leukocyte antigen (HLA) alleles (multiallelic and highly polymorphic) with SNP data, and predictions have achieved a satisfactory accuracy on the order of 97%. Building upon their success, we introduce a complementary method for predicting highly polymorphic alleles using unphased SNP data as the training data set. Due to its generality and flexibility, the new method is readily applicable to large population studies. Applying it to HLA genes in a cohort of 630 healthy individuals as a training set, we constructed predictive models for HLA-A, B, C, DRB1 and DQB1. Then, we performed a validation study with another cohort of 630 healthy individuals, and the predictive models achieved predictive accuracies for HLA alleles defined at intermediate or high resolution ranging as high as (100%, 97%) for HLA-A, (98%, 96%) for B, (98%, 98%) for C, (97%, 96%) for DRB1 and (98%, 95%) for DQB1, respectively. These preliminary results suggest the feasibility of predicting other polymorphic genetic alleles, since HLA loci are almost certainly among most polymorphic genes. © 2010 Wiley-Liss, Inc.","authors":["Li S.","Wang H.","Smith A.","Zhang B.","Zhang X.C.","Schoch G.","Geraghty D.","Hansen J.A.","Zhao L.P."],"cit_count":17,"journal":"Genetic Epidemiology","pmid":"21254215","title":"Predicting multiallelic genes using unphased and flanking single nucleotide polymorphisms","year":"2011-02-01"}],"summary":{"biotoolsCURIE":"biotools:magprediction","biotoolsID":"magprediction","description":"Software which was developed for predicting highly polymorphic gene alleles using unphased SNP data.","homepage":"http://qge.fhcrc.org/MAGprediction/","name":"MAGprediction"}}