{
    "additionDate": "2019-11-14T18:23:14Z",
    "biotoolsCURIE": "biotools:explAIner",
    "biotoolsID": "explAIner",
    "confidence_flag": "tool",
    "description": "A Visual Analytics Framework for Interactive and Explainable Machine Learning | The framework for explainable AI and interactive machine learning. Making XAI accessible | The recent abundance of artificial intelligence and the resulting spread of black-box models in critical domains has lead to an increasing demand for explainability. The field of eXplainable Artificial Intelligence tackles this challenge by providing ways to interpret the decisions of such models. Which, in turn, resulted in a variety of different explaining techniques, all having various dependencies and providing highly diverse outputs | Besides the variety of XAI methods, there also is a variety of user-groups with different interests and requirements. They need tailored access to XAI methods that suit their needs and support them in their daily workflow | Our XAI framework structures the process of XAI",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Deisotoping",
                    "uri": "http://edamontology.org/operation_3629"
                }
            ]
        }
    ],
    "homepage": "http://explainer.ai/",
    "lastUpdate": "2020-12-28T15:29:32Z",
    "link": [
        {
            "note": "TensorBoard for explAIner",
            "type": [
                "Other"
            ],
            "url": "https://explainer.ai/system/explainer/"
        }
    ],
    "name": "explAIner",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1109/TVCG.2019.2934629",
            "metadata": {
                "abstract": "© 2020 IEEE.We propose a framework for interactive and explainable machine learning that enables users to (1) understand machine learning models; (2) diagnose model limitations using different explainable AI methods; as well as (3) refine and optimize the models. Our framework combines an iterative XAI pipeline with eight global monitoring and steering mechanisms, including quality monitoring, provenance tracking, model comparison, and trust building. To operationalize the framework, we present explAIner, a visual analytics system for interactive and explainable machine learning that instantiates all phases of the suggested pipeline within the commonly used TensorBoard environment. We performed a user-study with nine participants across different expertise levels to examine their perception of our workflow and to collect suggestions to fill the gap between our system and framework. The evaluation confirms that our tightly integrated system leads to an informed machine learning process while disclosing opportunities for further extensions.",
                "authors": [
                    {
                        "name": "Spinner T."
                    },
                    {
                        "name": "Schlegel U."
                    },
                    {
                        "name": "Schafer H."
                    },
                    {
                        "name": "El-Assady M."
                    }
                ],
                "citationCount": 30,
                "date": "2020-01-01T00:00:00Z",
                "journal": "IEEE Transactions on Visualization and Computer Graphics",
                "title": "ExplAIner: A Visual Analytics Framework for Interactive and Explainable Machine Learning"
            },
            "pmid": "31442998"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ],
    "validated": 1
}