{
    "additionDate": "2017-08-03T18:48:29Z",
    "biotoolsCURIE": "biotools:loqum",
    "biotoolsID": "loqum",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://compbio.case.edu/loqum/"
        }
    ],
    "description": "Assigns reliable mapping quality scores to mappings of Illumina reads returned by an alignment tool.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://compbio.case.edu/loqum/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Mapping",
                    "uri": "http://edamontology.org/operation_2429"
                }
            ]
        }
    ],
    "homepage": "http://compbio.case.edu/loqum/",
    "language": [
        "R",
        "Python"
    ],
    "lastUpdate": "2018-12-10T12:58:55Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/loqum-logistic-regression-tool-for-calibrating-the-quality-of-short-read-mappings.html"
        }
    ],
    "name": "LoQuM",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Motivation: Several software tools specialize in the alignment of short next-generation sequencing reads to a reference sequence. Some of these tools report a mapping quality score for each alignment-in principle, this quality score tells researchers the likelihood that the alignment is correct. However, the reported mapping quality often correlates weakly with actual accuracy and the qualities of many mappings are underestimated, encouraging the researchers to discard correct mappings. Further, these low-quality mappings tend to correlate with variations in the genome (both single nucleotide and structural), and such mappings are important in accurately identifying genomic variants. Approach: We develop a machine learning tool, LoQuM (LOgistic regression tool for calibrating the Quality of short read mappings, to assign reliable mapping quality scores to mappings of Illumina reads returned by any alignment tool. LoQuM uses statistics on the read (base quality scores reported by the sequencer) and the alignment (number of matches, mismatches and deletions, mapping quality score returned by the alignment tool, if available, and number of mappings) as features for classification and uses simulated reads to learn a logistic regression model that relates these features to actual mapping quality. Results: We test the predictions of LoQuM on an independent dataset generated by the ART short read simulation software and observe that LoQuM can 'resurrect' many mappings that are assigned zero quality scores by the alignment tools and are therefore likely to be discarded by researchers. We also observe that the recalibration of mapping quality scores greatly enhances the precision of called single nucleotide polymorphisms. © The Author(s) 2012. Published by Oxford University Press.",
                "authors": [
                    {
                        "name": "Ruffalo M."
                    },
                    {
                        "name": "Koyuturk M."
                    },
                    {
                        "name": "Ray S."
                    },
                    {
                        "name": "LaFramboise T."
                    }
                ],
                "citationCount": 20,
                "date": "2012-09-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Accurate estimation of short read mapping quality for next-generation genome sequencing"
            },
            "pmid": "22962451"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        }
    ],
    "validated": 1
}