{
    "additionDate": "2018-04-29T10:20:37Z",
    "biotoolsCURIE": "biotools:cobrapy",
    "biotoolsID": "cobrapy",
    "credit": [
        {
            "name": "openCOBRA",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://github.com/opencobra"
        }
    ],
    "description": "COnstraints-Based Reconstruction and Analysis for Python.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://cobrapy.readthedocs.io/en/stable/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Metabolic network modelling",
                    "uri": "http://edamontology.org/operation_3660"
                }
            ]
        }
    ],
    "homepage": "https://github.com/opencobra/cobrapy",
    "language": [
        "Python"
    ],
    "lastUpdate": "2018-12-10T12:58:57Z",
    "license": "GPL-3.0",
    "name": "COBRApy",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1186/1752-0509-7-74",
            "metadata": {
                "abstract": "Background: COnstraint-Based Reconstruction and Analysis (COBRA) methods are widely used for genome-scale modeling of metabolic networks in both prokaryotes and eukaryotes. Due to the successes with metabolism, there is an increasing effort to apply COBRA methods to reconstruct and analyze integrated models of cellular processes. The COBRA Toolbox for MATLAB is a leading software package for genome-scale analysis of metabolism; however, it was not designed to elegantly capture the complexity inherent in integrated biological networks and lacks an integration framework for the multiomics data used in systems biology. The openCOBRA Project is a community effort to promote constraints-based research through the distribution of freely available software.Results: Here, we describe COBRA for Python (COBRApy), a Python package that provides support for basic COBRA methods. COBRApy is designed in an object-oriented fashion that facilitates the representation of the complex biological processes of metabolism and gene expression. COBRApy does not require MATLAB to function; however, it includes an interface to the COBRA Toolbox for MATLAB to facilitate use of legacy codes. For improved performance, COBRApy includes parallel processing support for computationally intensive processes.Conclusion: COBRApy is an object-oriented framework designed to meet the computational challenges associated with the next generation of stoichiometric constraint-based models and high-density omics data sets. © 2013 Ebrahim et al.; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Ebrahim A."
                    },
                    {
                        "name": "Lerman J.A."
                    },
                    {
                        "name": "Palsson B.O."
                    },
                    {
                        "name": "Hyduke D.R."
                    }
                ],
                "citationCount": 275,
                "date": "2013-08-08T00:00:00Z",
                "journal": "BMC Systems Biology",
                "title": "COBRApy: COnstraints-Based Reconstruction and Analysis for Python"
            },
            "pmcid": "PMC3751080",
            "pmid": "23927696"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ],
    "validated": 1
}