{
    "accessibility": "Open access",
    "additionDate": "2023-03-29T19:17:51.885404Z",
    "biotoolsCURIE": "biotools:clonaltree_b_cell",
    "biotoolsID": "clonaltree_b_cell",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Anne de Septenville"
        },
        {
            "name": "Frederic Davi"
        },
        {
            "name": "Juliana Silva Bernardes"
        },
        {
            "name": "Lucile Jeusset"
        },
        {
            "name": "Nika Abdollahi"
        }
    ],
    "description": "Reconstructing the evolutionary history of a B cell lineage with minimum spanning tree and genotype abundances.",
    "download": [
        {
            "type": "Source code",
            "url": "https://github.com/julibinho/ClonalTree/tree/main/Data"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Ancestral reconstruction",
                    "uri": "http://edamontology.org/operation_3745"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Phylogenetic inference (parsimony methods)",
                    "uri": "http://edamontology.org/operation_0545"
                },
                {
                    "term": "Phylogenetic reconstruction",
                    "uri": "http://edamontology.org/operation_3478"
                },
                {
                    "term": "Sequence trimming",
                    "uri": "http://edamontology.org/operation_3192"
                }
            ]
        }
    ],
    "homepage": "http://github.com/julibinho/ClonalTree",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T14:50:26.159009Z",
    "license": "GPL-3.0",
    "name": "ClonalTree",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1186/s12859-022-05112-z",
            "metadata": {
                "abstract": "B cell receptor (BCR) genes exposed to an antigen undergo somatic hypermutations and Darwinian antigen selection, generating a large BCR-antibody diversity. This process, known as B cell affinity maturation, increases antibody affinity, forming a specific B cell lineage that includes the unmutated ancestor and mutated variants. In a B cell lineage, cells with a higher antigen affinity will undergo clonal expansion, while those with a lower affinity will not proliferate and probably be eliminated. Therefore, cellular (genotype) abundance provides a valuable perspective on the ongoing evolutionary process. Phylogenetic tree inference is often used to reconstruct B cell lineage trees and represents the evolutionary dynamic of BCR affinity maturation. However, such methods should process B-cell population data derived from experimental sampling that might contain different cellular abundances. There are a few phylogenetic methods for tracing the evolutionary events occurring in B cell lineages; best-performing solutions are time-demanding and restricted to analysing a reduced number of sequences, while time-efficient methods do not consider cellular abundances. We propose ClonalTree, a low-complexity and accurate approach to construct B-cell lineage trees that incorporates genotype abundances into minimum spanning tree (MST) algorithms. Using both simulated and experimental data, we demonstrate that ClonalTree outperforms MST-based algorithms and achieves a comparable performance to a method that explores tree-generating space exhaustively. Furthermore, ClonalTree has a lower running time, being more convenient for building B-cell lineage trees from high-throughput BCR sequencing data, mainly in biomedical applications, where a lower computational time is appreciable. It is hundreds to thousands of times faster than exhaustive approaches, enabling the analysis of a large set of sequences within minutes or seconds and without loss of accuracy. The source code is freely available at github.com/julibinho/ClonalTree.",
                "authors": [
                    {
                        "name": "Abdollahi N."
                    },
                    {
                        "name": "Bernardes J.S."
                    },
                    {
                        "name": "Davi F."
                    },
                    {
                        "name": "Jeusset L."
                    },
                    {
                        "name": "de Septenville A."
                    }
                ],
                "citationCount": 8,
                "date": "2023-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Reconstructing B cell lineage trees with minimum spanning tree and genotype abundances"
            },
            "pmcid": "PMC9972711",
            "pmid": "36849917"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Immunoproteins and antigens",
            "uri": "http://edamontology.org/topic_2830"
        },
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ]
}
