{
    "name": "PopPUNK", 
    "description": "Fast k-mer distance estimation enabled by mash to calculate core and accessory distances between all pairs of isolates of bacteria in a collection. By clustering these distances into ‘within-strain’ and ‘between-strain’ distances a network of within-strain comparisons can be constructed.", 
    "homepage": "https://github.com/johnlees/PopPUNK", 
    "biotoolsID": "poppunk", 
    "biotoolsCURIE": "biotools:poppunk", 
    "version": [], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_0291", 
                    "term": "Sequence clustering"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Command-line tool"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_2269", 
            "term": "Statistics and probability"
        }, 
        {
            "uri": "http://edamontology.org/topic_3056", 
            "term": "Population genetics"
        }
    ], 
    "operatingSystem": [
        "Linux"
    ], 
    "language": [
        "Python"
    ], 
    "license": "Apache-2.0", 
    "collectionID": [], 
    "maturity": "Mature", 
    "cost": "Free of charge", 
    "accessibility": [
        "Open access"
    ], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [
        {
            "url": "https://github.com/johnlees/PopPUNK/issues", 
            "type": "Issue tracker", 
            "note": null
        }
    ], 
    "download": [
        {
            "url": "https://github.com/johnlees/PopPUNK", 
            "type": "Source code", 
            "note": null, 
            "version": null
        }
    ], 
    "documentation": [
        {
            "url": "https://poppunk.readthedocs.io/en/latest/", 
            "type": "General", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": "10.1101/gr.241455.118", 
            "pmid": null, 
            "pmcid": null, 
            "type": "Primary", 
            "version": null, 
            "metadata": {
                "title": "Fast and flexible bacterial genomic epidemiology with PopPUNK.", 
                "abstract": "© 2019 Lees et al. The routine use of genomics for disease surveillance provides the opportunity for high-resolution bacterial epidemiology. Current whole-genome clustering and multilocus typing approaches do not fully exploit core and accessory genomic variation, and they cannot both automatically identify, and subsequently expand, clusters of significantly similar isolates in large data sets spanning entire species. Here, we describe PopPUNK (Population Partitioning Using Nucleotide K-mers), a software implementing scalable and expandable annotation- and alignment-free methods for population analysis and clustering. Variable-length k-mer comparisons are used to distinguish isolates' divergence in shared sequence and gene content, which we demonstrate to be accurate over multiple orders of magnitude using data from both simulations and genomic collections representing 10 taxonomically widespread species. Connections between closely related isolates of the same strain are robustly identified, despite interspecies variation in the pairwise distance distributions that reflects species' diverse evolutionary patterns. PopPUNK can process 10 3 -10 4 genomes in a single batch, with minimal memory use and runtimes up to 200-fold faster than existing model-based methods. Clusters of strains remain consistent as new batches of genomes are added, which is achieved without needing to reanalyze all genomes de novo. This facilitates real-time surveillance with consistent cluster naming between studies and allows for outbreak detection using hundreds of genomes in minutes. Interactive visualization and online publication is streamlined through the automatic output of results to multiple platforms. PopPUNK has been designed as a flexible platform that addresses important issues with currently used whole-genome clustering and typing methods, and has potential uses across bacterial genetics and public health research.", 
                "date": "2019-02-01T00:00:00Z", 
                "citationCount": 4, 
                "authors": [
                    {
                        "name": "Lees J.A."
                    }, 
                    {
                        "name": "Harris S.R."
                    }, 
                    {
                        "name": "Tonkin-Hill G."
                    }, 
                    {
                        "name": "Gladstone R.A."
                    }, 
                    {
                        "name": "Lo S.W."
                    }, 
                    {
                        "name": "Weiser J.N."
                    }, 
                    {
                        "name": "Corander J."
                    }, 
                    {
                        "name": "Bentley S.D."
                    }, 
                    {
                        "name": "Croucher N.J."
                    }
                ], 
                "journal": "Genome Research"
            }
        }
    ], 
    "credit": [
        {
            "name": "John Lees", 
            "email": "john@johnlees.me", 
            "url": null, 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "mbs_import", 
    "additionDate": "2019-01-30T08:48:02Z", 
    "lastUpdate": "2019-07-23T14:57:32Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 0, 
    "homepage_status": 0, 
    "elixir_badge": 0
}