{
    "additionDate": "2021-01-18T08:49:02Z",
    "biotoolsCURIE": "biotools:cancertsp",
    "biotoolsID": "cancertsp",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "raghava@iiitd.ac.in",
            "name": "Gajendra P. S. Raghava",
            "orcidid": "https://orcid.org/0000-0002-8902-2876",
            "typeEntity": "Person"
        }
    ],
    "description": "CancerTSP is a web-bench designed for stage prediction of Papillary Thyroid Carcinoma (PTC) using RNA expression data (derived from RNA-seq experiments in the form of RNA-Seq FPKM values). Primarily Early v/s Late stage prediction module predicts stage of PTC tissue sample. Further Cancer v/s Normal prediction module predicts whether tissue sample is cancerous or normal. Analysis module allows the user to analyze data regarding expression of an RNA transcript in Early or Late stage of PTC.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "http://webs.iiitd.edu.in/raghava/cancertsp/",
    "lastUpdate": "2021-02-07T12:40:33Z",
    "name": "CancerTSP",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PONE.0231629",
            "metadata": {
                "abstract": "© 2020 Bhalla et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Introduction Recently, the rise in the incidences of thyroid cancer worldwide renders it to be the sixth most common cancer among women. Commonly, Fine Needle Aspiration biopsy predominantly facilitates the diagnosis of the nature of thyroid nodules. However, it is inconsiderable in determining the tumor's state, i.e., benign or malignant. This study aims to identify the key RNA transcripts that can segregate the early and late-stage samples of Thyroid Carcinoma (THCA) using RNA expression profiles. Materials and methods In this study, we used the THCA RNA-Seq dataset of The Cancer Genome Atlas, consisting of 500 cancer and 58 normal (adjacent non-tumorous) samples obtained from the Genomics Data Commons (GDC) data portal. This dataset was dissected to identify key RNA expression features using various feature selection techniques. Subsequently, samples were classified based on selected features employing different machine learning algorithms. Results Single gene ranking based on the Area Under the Receiver Operating Characteristics (AUROC) curve identified the DCN transcript that can classify the early-stage samples from late-stage samples with 0.66 AUROC. To further improve the performance, we identified a panel of 36 RNA transcripts that achieved F1 score of 0.75 with 0.73 AUROC (95% CI: 0.62-0.84) on the validation dataset. Moreover, prediction models based on 18-features from this panel correctly predicted 75% of the samples of the external validation dataset. In addition, the multiclass model classified normal, early, and late-stage samples with AUROC of 0.95 (95% CI: 0.84-1), 0.76 (95% CI: 0.66-0.85) and 0.72 (95% CI: 0.61-0.83) on the validation dataset. Besides, a five protein-coding transcripts panel was also recognized, which segregated cancer and normal samples in the validation dataset with F1 score of 0.97 and 0.99 AUROC (95% CI: 0.91-1). Conclusion We identified 36 important RNA transcripts whose expression segregated early and latestage samples with reasonable accuracy. The models and dataset used in this study are available from the webserver CancerTSP (http://webs.iiitd.edu.in/raghava/cancertsp/).",
                "authors": [
                    {
                        "name": "Bhalla S."
                    },
                    {
                        "name": "Kaur H."
                    },
                    {
                        "name": "Kaur R."
                    },
                    {
                        "name": "Raghava G.P.S."
                    },
                    {
                        "name": "Sharma S."
                    }
                ],
                "citationCount": 3,
                "date": "2020-04-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "Expression based biomarkers and models to classify early and late-stage samples of Papillary Thyroid Carcinoma"
            },
            "pmcid": "PMC7179925",
            "pmid": "32324757"
        }
    ],
    "topic": [
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ]
}
