{
    "accessibility": "Open access",
    "additionDate": "2022-10-01T20:20:59.916820Z",
    "biotoolsCURIE": "biotools:microbiomegwas",
    "biotoolsID": "microbiomegwas",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "jianxin.shi@nih.gov",
            "name": "Jianxin Shi",
            "typeEntity": "Person"
        },
        {
            "name": "Christian C. Abnet"
        },
        {
            "name": "James J. Goedert"
        },
        {
            "name": "Maria Teresa Landi"
        }
    ],
    "description": "MicrobiomeGWAS is a software package for identifying host genetic variants associated with micorbiome distance matrix or beta-diversity. For each SNP, microbiome GWAS tests the main effect or the SNP-environment interaction.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                },
                {
                    "term": "SNP detection",
                    "uri": "http://edamontology.org/operation_0484"
                }
            ]
        }
    ],
    "homepage": "https://github.com/lsncibb/microbiomeGWAS",
    "language": [
        "C",
        "R"
    ],
    "lastUpdate": "2022-10-01T20:20:59.919233Z",
    "license": "GPL-2.0",
    "name": "microbiomeGWAS",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.3390/GENES13071224",
            "metadata": {
                "abstract": "© 2022 by the authors.The microbiome is the collection of all microbial genes and can be investigated by sequencing highly variable regions of 16S ribosomal RNA (rRNA) genes. Evidence suggests that environmental factors and host genetics may interact to impact human microbiome composition. Identifying host genetic variants associated with human microbiome composition not only provides clues for characterizing microbiome variation but also helps to elucidate biological mechanisms of genetic associations, prioritize genetic variants, and improve genetic risk prediction. Since a microbiota functions as a community, it is best characterized by β diversity; that is, a pairwise distance matrix. We develop a statistical framework and a computationally efficient software package, microbiomeGWAS, for identifying host genetic variants associated with microbiome β diversity with or without interacting with an environmental factor. We show that the score statistics have positive skewness and kurtosis due to the dependent nature of the pairwise data, which makes p-value approximations based on asymptotic distributions unacceptably liberal. By correcting for skewness and kurtosis, we develop accurate p-value approximations, whose accuracy was verified by extensive simulations. We exemplify our methods by analyzing a set of 147 genotyped subjects with 16S rRNA microbiome profiles from non-malignant lung tissues. Correcting for skewness and kurtosis eliminated the dramatic deviation in the quantile–quantile plots. We provided preliminary evidence that six established lung cancer risk SNPs were collectively associated with microbiome composition for both unweighted (p = 0.0032) and weighted (p = 0.011) UniFrac distance matrices. In summary, our methods will facilitate analyzing large-scale genome-wide association studies of the human microbiome.",
                "authors": [
                    {
                        "name": "Abnet C.C."
                    },
                    {
                        "name": "Goedert J.J."
                    },
                    {
                        "name": "Hua X."
                    },
                    {
                        "name": "Landi M.T."
                    },
                    {
                        "name": "Shi J."
                    },
                    {
                        "name": "Song L."
                    },
                    {
                        "name": "Vogtmann E."
                    },
                    {
                        "name": "Yu G."
                    }
                ],
                "date": "2022-07-01T00:00:00Z",
                "journal": "Genes",
                "title": "MicrobiomeGWAS: A Tool for Identifying Host Genetic Variants Associated with Microbiome Composition"
            },
            "pmcid": "PMC9317577",
            "pmid": "35886007"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "GWAS study",
            "uri": "http://edamontology.org/topic_3517"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Microbial ecology",
            "uri": "http://edamontology.org/topic_3697"
        }
    ],
    "validated": 1
}
