{"credit":[{"email":"waldispu@lix.polytechnique.fr","name":"Jérôme Waldispühl","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"http://bioinformatics.bc.edu/clotelab/transFold/instructions.html"}],"function":[{"operation":[{"term":"Protein super-secondary structure prediction","uri":"http://edamontology.org/operation_0268"},{"term":"Transmembrane protein analysis","uri":"http://edamontology.org/operation_0270"},{"term":"Transmembrane protein prediction","uri":"http://edamontology.org/operation_0269"},{"term":"Protein secondary structure prediction","uri":"http://edamontology.org/operation_0267"},{"term":"Protein structure prediction","uri":"http://edamontology.org/operation_0474"}]}],"labels":{"operatingSystem":["Linux","Windows","Mac"],"toolType":["Web application"],"topic":[{"term":"Protein secondary structure","uri":"http://edamontology.org/topic_3542"},{"term":"Protein folds and structural domains","uri":"http://edamontology.org/topic_0736"},{"term":"Membrane and lipoproteins","uri":"http://edamontology.org/topic_0820"},{"term":"Structure prediction","uri":"http://edamontology.org/topic_0082"},{"term":"Proteins","uri":"http://edamontology.org/topic_0078"}]},"publication":[{"abstract":"Transmembrane β-barrel (TMB) proteins are embedded in the outer membrane of Gram-negative bacteria, mitochondria and chloroplasts. The cellular location and functional diversity of β-barrel outer membrane proteins makes them an important protein class. At the present time, very few non-homologous TMB structures have been determined by X-ray diffraction because of the experimental difficulty encountered in crystallizing transmembrane (TM) proteins. The transFold web server uses pairwise inter-strand residue statistical potentials derived from globular (non-outer-membrane) proteins to predict the supersecondary structure of TMB. Unlike all previous approaches, transFold does notuse machine learning methods such as hidden Markov models or neural networks; instead, transFold employs multi-tape S-attribute grammars to describe all potential conformations, and then applies dynamic programming to determine the global minimum energy supersecondary structure. The transFold web server not only predicts secondary structure and TMB topology, but is the only method which additionally predicts the side-chain orientation of transmembrane β-strand residues, inter-strand residue contacts and TM β-strand inclination with respect to the membrane. The program transFold currently outperforms all other methods for accuracy of β-barrel structure prediction. © The Author 2006. Published by Oxford University Press. All rights reserved.","authors":["Waldispuhl J.","Berger B.","Clote P.","Steyaert J.-M."],"cit_count":25,"journal":"Nucleic Acids Research","pmid":"16844989","title":"transFold: A web server for predicting the structureand residue contacts of transmembrane beta-barrels","year":"2006-01-01"}],"summary":{"biotoolsCURIE":"biotools:transfold","biotoolsID":"transfold","description":"transFold predicts the super-secondary structure of transmembrane beta-barrel (TMB) proteins including side-chain orientation and topology of transmembrane segments.","homepage":"http://bioinformatics.bc.edu/clotelab/transFold","name":"transFold"}}