{
    "accessibility": "Open access",
    "additionDate": "2021-05-28T06:36:41.903365",
    "biotoolsCURIE": "biotools:glycohunter",
    "biotoolsID": "glycohunter",
    "description": "An Open-Source Software for the Detection and Relative Quantification of INLIGHT-Labeled N-Linked Glycans.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                },
                {
                    "term": "Peak detection",
                    "uri": "http://edamontology.org/operation_3215"
                }
            ]
        }
    ],
    "homepage": "https://glycohunter.wordpress.ncsu.edu/downloads/",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2021-05-28T06:36:41.904691Z",
    "name": "GlycoHunter",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1021/ACS.JPROTEOME.0C00840",
            "metadata": {
                "abstract": "© 2021 American Chemical Society.Glycans are responsible for many biological activities; however, their structures are incredibly diverse and complex, often rendering the field of glycomics unsolvable by a single analytical technique. The development of multiple chemical derivatization strategies and bioinformatic software is responsible for some of the greatest analytical gains in the field of glycomics. The INLIGHT strategy is a chemical derivatization technique using hydrazide chemistry to derivatize the reducing end of N-linked glycans and incorporates either a natural (NAT, 12C6) or a stable-isotope label (SIL, 13C6) to carry out relative quantification. Here we present GlycoHunter, a user-friendly software created in MATLAB that enables researchers to accurately and efficiently process MS1 glycomics data where a NAT and SIL pair is generated for relative quantification, including but not limited to, INLIGHT. GlycoHunter accepts the commonly used data file formats imzML and mzXML and effectively identifies all peak pairs associated with NAT- and SIL-labeled N-linked glycans using MS1 data. It also includes the ability to tailor the search parameters and export the results for further analysis using Skyline or Excel.",
                "authors": [
                    {
                        "name": "Kalmar J.G."
                    },
                    {
                        "name": "Garrard K.P."
                    },
                    {
                        "name": "Muddiman D.C."
                    }
                ],
                "date": "2021-04-02T00:00:00Z",
                "journal": "Journal of Proteome Research",
                "title": "GlycoHunter: An Open-Source Software for the Detection and Relative Quantification of INLIGHT-Labeled N-Linked Glycans"
            },
            "pmid": "33417767"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Biochemistry",
            "uri": "http://edamontology.org/topic_3292"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        },
        {
            "term": "Bioinformatics",
            "uri": "http://edamontology.org/topic_0091"
        }
    ]
}