{
    "additionDate": "2018-07-17T14:01:20Z",
    "biotoolsCURIE": "biotools:pyviko",
    "biotoolsID": "pyviko",
    "credit": [
        {
            "email": "louist@upenn.edu",
            "name": "Louis J. Taylor",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Design gene knockouts in complex viruses with overlapping genes automatically.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/louiejtaylor/pyViKO"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Nucleic acid design",
                    "uri": "http://edamontology.org/operation_3095"
                }
            ]
        }
    ],
    "homepage": "https://github.com/louiejtaylor/pyViKO",
    "language": [
        "Python"
    ],
    "lastUpdate": "2018-12-10T12:59:00Z",
    "license": "MIT",
    "name": "Pyviko",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1186/s12866-016-0920-3",
            "metadata": {
                "abstract": "© 2017 The Author(s).Background: Gene knockouts are a common tool used to study gene function in various organisms. However, designing gene knockouts is complicated in viruses, which frequently contain sequences that code for multiple overlapping genes. Designing mutants that can be traced by the creation of new or elimination of existing restriction sites further compounds the difficulty in experimental design of knockouts of overlapping genes. While software is available to rapidly identify restriction sites in a given nucleotide sequence, no existing software addresses experimental design of mutations involving multiple overlapping amino acid sequences in generating gene knockouts. Results: Pyviko performed well on a test set of over 240,000 gene pairs collected from viral genomes deposited in the National Center for Biotechnology Information Nucleotide database, identifying a point mutation which added a premature stop codon within the first 20 codons of the target gene in 93.2% of all tested gene-overprinted gene pairs. This shows that Pyviko can be used successfully in a wide variety of contexts to facilitate the molecular cloning and study of viral overprinted genes. Conclusions: Pyviko is an extensible and intuitive Python tool for designing knockouts of overlapping genes. Freely available as both a Python package and a web-based interface ( http://louiejtaylor.github.io/pyViKO/ ), Pyviko simplifies the experimental design of gene knockouts in complex viruses with overlapping genes.",
                "authors": [
                    {
                        "name": "Strebel K."
                    },
                    {
                        "name": "Taylor L.J."
                    }
                ],
                "citationCount": 2,
                "date": "2017-01-07T00:00:00Z",
                "journal": "BMC Microbiology",
                "title": "Pyviko: an automated Python tool to design gene knockouts in complex viruses with overlapping genes"
            },
            "pmcid": "PMC5219722",
            "pmid": "28061810"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Medicines research and development",
            "uri": "http://edamontology.org/topic_3376"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "Virology",
            "uri": "http://edamontology.org/topic_0781"
        }
    ],
    "validated": 1
}
