{
    "additionDate": "2017-08-03T18:51:18Z",
    "biotoolsCURIE": "biotools:methylaction",
    "biotoolsID": "methylaction",
    "credit": [
        {
            "email": "contact@jeffbio.com",
            "name": "Jeffrey Bhasin",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://github.com/jeffbhasin"
        }
    ],
    "description": "R package for detecting differentially methylated regions (DMRs) from enrichment-based techniques for sequencing DNA methlyation genome-wide.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://www.jeffbio.com/methylaction/docs/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Whole genome methylation analysis",
                    "uri": "http://edamontology.org/operation_3206"
                }
            ]
        }
    ],
    "homepage": "http://jeffbhasin.github.io/methylaction/",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-10T12:58:50Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/methylaction-detecting-differentially-methylated-regions-dmrs-that-distinguish-biological-and-disease-subtypes.html"
        }
    ],
    "name": "MethylAction",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "© The Author(s) 2015. Published by Oxford University Press on behalf of Nucleic Acids Research.DNA methylation differences capture substantial information about the molecular and gene-regulatory states among biological subtypes. Enrichment-based next generation sequencing methods such as MBD-isolated genome sequencing (MiGS) and MeDIP-seq are appealing for studying DNA methylation genome-wide in order to distinguish between biological subtypes. However, current analytic tools do not provide optimal features for analyzing three-group or larger study designs. MethylAction addresses this need by detecting all possible patterns of statistically significant hyper- and hypomethylation in comparisons involving any number of groups. Crucially, significance is established at the level of differentially methylated regions (DMRs), and bootstrapping determines false discovery rates (FDRs) associated with each pattern. We demonstrate this functionality in a four-group comparison among benign prostate and three clinical subtypes of prostate cancer and show that the bootstrap FDRs are highly useful in selecting the most robust patterns of DMRs. Compared to existing tools that are limited to two-group comparisons, MethylAction detects more DMRs with strong differential methylation measurements confirmed by whole genome bisulfite sequencing and offers a better balance between precision and recall in cross-cohort comparisons. MethylAction is available as an R package at http://jeffbhasin.github.io/methylaction.",
                "authors": [
                    {
                        "name": "Bhasin J.M."
                    },
                    {
                        "name": "Hu B."
                    },
                    {
                        "name": "Ting A.H."
                    }
                ],
                "citationCount": 11,
                "date": "2016-01-08T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "MethylAction: Detecting differentially methylated regions that distinguish biological subtypes"
            },
            "pmid": "26673711"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        }
    ],
    "validated": 1
}