
{
    "credit": [
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Python"
        ],
        "topic": [
            {
                "term": "Neurobiology",
                "uri": "http://edamontology.org/topic_3304"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© 2019 The AuthorsThe Spike Pattern Detection and Evaluation (SPADE) analysis is a method to find reoccurring spike patterns in parallel spike train data, and to determine their statistical significance. Here we introduce an extension of the original statistical testing procedure which explicitly accounts for the temporal duration of the patterns. The extension improves the performance in the presence of patterns with different durations, as here demonstrated by application to various synthetic data. We further introduce an implementation of SPADE in form of a sub-module of the Python library Elephant (ELEctroPHysiological ANalysis Toolkit). The code is made publicly available on GitHub, together with detailed documentation, tutorials, and the results presented here.",
            "authors": [
                "Stella A.",
                "Quaglio P.",
                "Torre E.",
                "Grun S."
            ],
            "cit_count": 1,
            "doi": "10.1016/J.BIOSYSTEMS.2019.104022",
            "journal": "BioSystems",
            "pmid": "31449837",
            "title": "3d-SPADE: Significance evaluation of spatio-temporal patterns of various temporal extents",
            "year": "2019-11-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:3d-SPADE",
        "biotoolsID": "3d-SPADE",
        "description": "> CORRECT NAME OF TOOL COULD ALSO BE 'SPADE' | Significance evaluation of spatio-temporal patterns of various temporal extents | Spike Pattern Detection and Evaluation — Elephant 0.6.4 documentation | SPADE - Spike Pattern Detection and Evaluation¶ | SPADE is the combination of a mining technique and multiple statistical tests to detect and assess the statistical significance of repeated occurrences of spike sequences (spatio-temporal patterns, STP) | Given a list of Neo Spiketrain objects, assumed to be recorded in parallel, the SPADE analysis can be applied as demonstrated in this short toy example of 10 artificial spike trains of exhibiting fully synchronous events of order 10 | This modules relies on the implementation of the fp-growth algorithm contained in the file fim.so which can be found here (http: www.borgelt.net pyfim.html) and should be available in the spade_src folder (elephant spade_src )",
        "homepage": "https://elephant.readthedocs.io/en/latest/reference/spade.html",
        "name": "3d-SPADE"
    }
}