{
    "additionDate": "2020-01-14T20:05:22Z",
    "biotoolsCURIE": "biotools:HiPPO",
    "biotoolsID": "HiPPO",
    "confidence_flag": "tool",
    "description": "Two Bioinformatics Tools to Support Analysis of Mass Cytometry Data.\n\nHigh-dimensional mass cytometry (Cytometry by Time-Of-Flight; CyTOF) is a multiparametric single-cell approach that allows for more than 40 parameters to be evaluated simultaneously, opening the possibility to dissect cellular heterogeneity and elucidate functional interactions between different cell types. However, the complexity of these data makes analysis and interpretation daunting. We created High-throughput Population Profiler (HiPPO), a tool that reduces the complexity of the CyTOF data and allows homogeneous clusters of cells to be visualized in an intuitive manner. Each subpopulation is mapped to the Population Analysis Database (PANDA), an open-source, manually curated database containing protein expression profiles for selected markers of primary cells, allowing for cell type abundance in the analyzed samples to be monitored.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "http://www.hippopanda.org/hippo.php",
    "lastUpdate": "2020-12-10T08:50:11Z",
    "name": "HiPPO",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1089/CMB.2019.0384",
            "metadata": {
                "abstract": "© Copyright 2020, Mary Ann Liebert, Inc., publishers 2020.High-dimensional mass cytometry (Cytometry by Time-Of-Flight; CyTOF) is a multiparametric single-cell approach that allows for more than 40 parameters to be evaluated simultaneously, opening the possibility to dissect cellular heterogeneity and elucidate functional interactions between different cell types. However, the complexity of these data makes analysis and interpretation daunting. We created High-throughput Population Profiler (HiPPO), a tool that reduces the complexity of the CyTOF data and allows homogeneous clusters of cells to be visualized in an intuitive manner. Each subpopulation is mapped to the Population Analysis Database (PANDA), an open-source, manually curated database containing protein expression profiles for selected markers of primary cells, allowing for cell type abundance in the analyzed samples to be monitored. Custom cell definitions can be submitted for targeted identifications. All cell clusters, regardless of their annotation status, are available for further analyses. HiPPO also conducts nonparametric tests to determine whether differences in protein expression levels between conditions are significant. HiPPO strikes a balance between diagnostic power and computational burden. Its minimal computational footprint allows for subpopulations in a heterogeneous sample to be identified and quantified quickly.",
                "authors": [
                    {
                        "name": "Cesareni G."
                    },
                    {
                        "name": "Chelala C."
                    },
                    {
                        "name": "Ferrentino F."
                    },
                    {
                        "name": "Gadaleta E."
                    },
                    {
                        "name": "Pirro S."
                    },
                    {
                        "name": "Spada F."
                    },
                    {
                        "name": "Thorn G.J."
                    }
                ],
                "date": "2020-08-01T00:00:00Z",
                "journal": "Journal of Computational Biology",
                "title": "HiPPO and PANDA: Two Bioinformatics Tools to Support Analysis of Mass Cytometry Data"
            },
            "pmid": "31855463"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Database management",
            "uri": "http://edamontology.org/topic_3489"
        },
        {
            "term": "Immunoproteins and antigens",
            "uri": "http://edamontology.org/topic_2830"
        },
        {
            "term": "Protein expression",
            "uri": "http://edamontology.org/topic_0108"
        }
    ],
    "validated": 1
}
