{
    "additionDate": "2019-11-14T18:10:21Z",
    "biotoolsCURIE": "biotools:CRUMBLER",
    "biotoolsID": "CRUMBLER",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "tamar.crum@mail.missouri.edu",
            "name": "Tamar E. Crum",
            "orcidid": "https://orcid.org/0000-0003-2326-0078",
            "typeEntity": "Person"
        },
        {
            "email": "taylorjerr@missouri.edu",
            "name": "Jeremy F. Taylor",
            "typeEntity": "Person"
        }
    ],
    "description": "A tool for the prediction of ancestry in cattle | Added an avenue for data that plink does not have a \"species ID\" for. In this case users, will specify \"NA\" as the plink_species_ID in their input file. It is now required to specify chromosome number for the data in the input | CRUMBLER has now been successfully ran in Pigs, following these updates",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Formatting",
                    "uri": "http://edamontology.org/operation_0335"
                }
            ]
        }
    ],
    "homepage": "https://github.com/tamarcrum/CRUMBLER",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-12-17T09:05:36Z",
    "name": "CRUMBLER",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PONE.0221471",
            "metadata": {
                "abstract": "© 2019 Crum et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.In many beef and some dairy production systems, crossbreeding is used to take advantage of breed complementarity and heterosis. Admixed animals are frequently identified by their coat color and body conformation phenotypes, however, without pedigree information it is not possible to identify the expected breed composition of an admixed animal and in the presence of selection, the actual composition may differ from expectation. As the roles of DNA and genotype data become more pervasive in animal agriculture, a systematic method for estimating the breed composition (the proportions of an animal’s genome originating from ancestral pure breeds) has utility for a variety of downstream analyses including the estimation of genomic breeding values for crossbred animals, the estimation of quantitative trait locus effects, and heterosis and heterosis retention in advanced generation composite animals. Currently, there is no automated or semi-automated ancestry estimation platform for cattle and the objective of this study was to evaluate the utility of extant public software for ancestry estimation and determine the effects of reference population size and composition and number of utilized single nucleotide polymorphism loci on ancestry estimation. We also sought to develop an analysis pipeline that would simplify this process for members of the livestock genomics research community. We developed and tested a tool, “CRUMBLER”, to estimate the global ancestry of cattle using ADMIXTURE and SNPweights based on a defined reference panel. CRUMBLER, was developed and evaluated in cattle, but is a species agnostic pipeline that facilitates the streamlined estimation of breed composition for individuals with potentially complex ancestries using publicly available global ancestry software and a specified reference population SNP data-set. We developed the reference panel from a large cattle genotype data set and breed association pedigree information using iterative analyses to identify purebred individuals that were representative of each breed. We also evaluated the numbers of markers necessary for breed composition estimation and simulated genotypes for advanced generation composite animals to evaluate the precision of the developed tool. The developed CRUMBLER pipeline extracts a specified subset of genotypes that is common to all current commercially available genotyping platforms, processes these into the file formats required for the analysis software, and predicts admixture proportions using the specified reference population allele frequencies.",
                "authors": [
                    {
                        "name": "Crum T.E."
                    },
                    {
                        "name": "Schnabel R.D."
                    },
                    {
                        "name": "Decker J.E."
                    },
                    {
                        "name": "Regitano L.C.A."
                    },
                    {
                        "name": "Taylor J.F."
                    }
                ],
                "citationCount": 4,
                "date": "2019-08-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "Crumbler: A tool for the prediction of ancestry in cattle"
            },
            "pmcid": "PMC6709893",
            "pmid": "31449539"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Agricultural science",
            "uri": "http://edamontology.org/topic_3810"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        }
    ],
    "validated": 1
}