{
    "accessibility": "Open access",
    "additionDate": "2022-12-29T19:01:42.367195Z",
    "biotoolsCURIE": "biotools:isnodi-lsgt",
    "biotoolsID": "isnodi-lsgt",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Bin Liu"
        },
        {
            "name": "Wenxiang Zhang"
        }
    ],
    "description": "identifying snoRNA-disease associations based on local similarity constraint and global topological constraint.",
    "editPermission": {
        "type": "private"
    },
    "homepage": "http://bliulab.net/iSnoDi-LSGT/",
    "lastUpdate": "2024-11-24T15:15:02.137488Z",
    "name": "iSnoDi-LSGT",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1261/rna.079325.122",
            "metadata": {
                "abstract": "Growing evidence proves that small nucleolar RNAs (snoRNAs) have important functions in various biological processes, the malfunction of which leads to the emergence and development of complex diseases. However, identifying snoRNA-disease associations is an ongoing challenging task due to the considerable time- and money-consuming biological experiments. Therefore, it is urgent to design efficient and economical methods for the identification of snoRNA-disease associations. In this regard, we propose a computational method named iSnoDi-LSGT, which utilizes snoRNA sequence similarity and disease similarity as local similarity constraints. The iSnoDi-LSGT predictor further employs network embedding technology to extract topological features of snoRNAs and diseases, based on which snoRNA topological similarity and disease topological similarity are calculated as global topological constraints. To the best of our knowledge, the iSnoDi-LSGT is the first computational method for snoRNA-disease association identification. The experimental results indicate that the iSnoDi-LSGT predictor can effectively predict unknown snoRNA-disease associations. The web server of the iSnoDi-LSGT predictor is freely available at http://bliulab.net/iSnoDi-LSGT.",
                "authors": [
                    {
                        "name": "Bin L.I.U."
                    },
                    {
                        "name": "Zhang W."
                    }
                ],
                "citationCount": 9,
                "date": "2022-12-01T00:00:00Z",
                "journal": "RNA",
                "title": "iSnoDi-LSGT: identifying snoRNA-disease associations based on local similarity constraints and global topological constraints"
            },
            "pmcid": "PMC9670808",
            "pmid": "36192132"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Laboratory techniques",
            "uri": "http://edamontology.org/topic_3361"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        }
    ],
    "validated": 1
}
