{
    "additionDate": "2020-01-14T19:31:07Z",
    "biotoolsCURIE": "biotools:Episo",
    "biotoolsID": "Episo",
    "confidence_flag": "tool",
    "description": "quantitative estimation of RNA 5-methylcytosine at isoform level by high-throughput sequencing of RNA treated with bisulfite.\n\nEpiso-quantify Epitranscriptomal RNA m5c at isoform level.\n\nEpiso is a probabilistic model to quantify Epitranscriptomal RNA m5C at the transcript isoform level. Episo consists of three tools, named mapper, quant and Bisulfitefq, for mapping, quantifying, and simulating RNA-BisSeq data, respectively. Episo needs a working version of Perl and it is run from the command line. Meanwhile, Bowtie, Tophat and Cufflinks need to be installed on your computer. First you need to download a transcript annotation file from the Ensembl or NCBI websites. Episo supports the reference trancriptom sequence files in FastA format, allowed file extensions are either .fa or .fasta. The details see the document Episo_User_Guide.pdf.\n\nThis pakage is for estimating m5c level by using Kallisto in Episo",
    "download": [
        {
            "type": "Source code",
            "url": "https://github.com/liujunfengtop/Episo/tree/master/Episo_Kallisto"
        }
    ],
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Bisulfite mapping",
                    "uri": "http://edamontology.org/operation_3186"
                },
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                },
                {
                    "term": "PCR primer design",
                    "uri": "http://edamontology.org/operation_0308"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                }
            ]
        }
    ],
    "homepage": "https://github.com/liujunfengtop/Episo",
    "language": [
        "C",
        "Perl"
    ],
    "lastUpdate": "2020-12-28T12:00:09Z",
    "license": "BSD-2-Clause",
    "name": "Episo",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ900",
            "metadata": {
                "abstract": "© 2019 The Author(s). Published by Oxford University Press.Motivation: RNA 5-methylcytosine (m5C) is a type of post-transcriptional modification that may be involved in numerous biological processes and tumorigenesis. RNA m5C can be profiled at single-nucleotide resolution by high-throughput sequencing of RNA treated with bisulfite (RNA-BisSeq). However, the exploration of transcriptome-wide profile and potential function of m5C in splicing remains to be elucidated due to lack of isoform level m5C quantification tool. Results: We developed a computational package to quantify Epitranscriptomal RNA m5C at the transcript isoform level (named Episo). Episo consists of three tools: mapper, quant and Bisulfitefq, for mapping, quantifying and simulating RNA-BisSeq data, respectively. The high accuracy of Episo was validated using an improved m5C-specific methylated RNA immunoprecipitation (meRIP) protocol, as well as a set of in silico experiments. By applying Episo to public human and mouse RNA-BisSeq data, we found that the RNA m5C is not evenly distributed among the transcript isoforms, implying the m5C may subject to be regulated at isoform level.",
                "authors": [
                    {
                        "name": "An Z."
                    },
                    {
                        "name": "Li F."
                    },
                    {
                        "name": "Li J."
                    },
                    {
                        "name": "Liu J."
                    },
                    {
                        "name": "Luo J."
                    },
                    {
                        "name": "Zhang Z."
                    }
                ],
                "citationCount": 3,
                "date": "2020-04-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Episo: Quantitative estimation of RNA 5-methylcytosine at isoform level by high-throughput sequencing of RNA treated with bisulfite"
            },
            "pmid": "31794005"
        }
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Methylated DNA immunoprecipitation",
            "uri": "http://edamontology.org/topic_3674"
        },
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        },
        {
            "term": "RNA immunoprecipitation",
            "uri": "http://edamontology.org/topic_3794"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ],
    "validated": 1
}
