{
    "accessibility": [],
    "additionDate": "2017-08-03T18:38:11Z",
    "biotoolsCURIE": "biotools:cccp",
    "biotoolsID": "cccp",
    "collectionID": [
        "Proteomics"
    ],
    "confidence_flag": null,
    "cost": null,
    "credit": [
        {
            "email": "gevorg.grigoryan@dartmouth.edu",
            "gridid": null,
            "name": "G. Grigoryan",
            "note": null,
            "orcidid": null,
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.grigoryanlab.org/"
        }
    ],
    "description": "Coiled-Coil Crick Parameterization is a programs for fitting Crick parameters to coiled-coil structures and generations of ideal structures from parameters.",
    "documentation": [
        {
            "note": null,
            "type": "General",
            "url": "http://www.grigoryanlab.org/cccp/sourceForDownload/"
        }
    ],
    "download": [],
    "editPermission": {
        "authors": [
            "proteomics.bio.tools"
        ],
        "type": "group"
    },
    "elixirNode": [],
    "elixirPlatform": [],
    "elixir_badge": 0,
    "function": [
        {
            "cmd": null,
            "input": [],
            "note": null,
            "operation": [
                {
                    "term": "Protein sequence analysis",
                    "uri": "http://edamontology.org/operation_2479"
                }
            ],
            "output": []
        }
    ],
    "homepage": "http://www.grigoryanlab.org/cccp/",
    "homepage_status": 0,
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2019-03-26T08:13:08Z",
    "license": null,
    "link": [
        {
            "note": null,
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/cccp-coiled-coil-crick-parameterization.html"
        }
    ],
    "maturity": null,
    "name": "CCCP",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "otherID": [],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": null,
            "metadata": {
                "abstract": "Because the space of folded protein structures is highly degenerate, with recurring secondary and tertiary motifs, methods for representing protein structure in terms of collective physically relevant coordinates are of great interest. By collapsing structural diversity to a handful of parameters, such methods can be used to delineate the space of designable structures (i.e., conformations that can be stabilized with a large number of sequences)-a crucial task for de novo protein design. We first demonstrate this on natural α-helical coiled coils using the Crick parameterization. We show that over 95% of known coiled-coil structures are within A1-Å Cα root mean square deviation of a Crick-ideal backbone. Derived parameters show that natural geometric space of coiled coils is highly restricted and can be represented by \"allowed\" conformations amidst a potential continuum of conformers. Allowed structures have (1) restricted axial offsets between helices, which differ starkly between parallel and anti-parallel structures; (2) preferred superhelical radii, which depend linearly on the oligomerization state; (3) pronounced radius-dependent a- and d-position amino acid propensities; and (4) discrete angles of rotation of helices about their axes, which are surprisingly independent of oligomerization state or orientation. In all, we estimate the space of designable coiled-coil structures to be reduced at least 160-fold relative to the space of geometrically feasible structures. To extend the benefits of structural parameterization to other systems, we developed a general mathematical framework for parameterizing arbitrary helical structures, which reduces to the Crick parameterization as a special case. The method is successfully validated on a set of non-coiled-coil helical bundles, frequent in channels and transporter proteins, which show significant helix bending but not supercoiling. Programs for coiled-coil parameter fitting and structure generation are provided via a web interface at http://www. gevorggrigoryan.com/cccp/, and code for generalized helical parameterization is available upon request. © 2010 Elsevier Ltd. All rights reserved.",
                "authors": [
                    {
                        "name": "Grigoryan G."
                    },
                    {
                        "name": "Degrado W.F."
                    }
                ],
                "citationCount": 98,
                "date": "2011-01-01T00:00:00Z",
                "journal": "Journal of Molecular Biology",
                "title": "Probing designability via a generalized model of helical bundle geometry"
            },
            "note": null,
            "pmcid": null,
            "pmid": "20932976",
            "type": null,
            "version": null
        }
    ],
    "relation": [],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Protein structure analysis",
            "uri": "http://edamontology.org/topic_2814"
        }
    ],
    "validated": 0,
    "version": []
}