{
    "accessibility": "Open access",
    "additionDate": "2022-03-21T08:38:04.879625Z",
    "biotoolsCURIE": "biotools:fastcodeml",
    "biotoolsID": "fastcodeml",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "nicolas.salamin@unil.ch",
            "name": "Nicolas Salamin",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "FastCodeML is a collection of optimization strategies for fast detection of positive selection on phylogenetic trees.",
    "editPermission": {
        "type": "private"
    },
    "homepage": "https://gitlab.sib.swiss/phylo/fastcodeml",
    "language": [
        "C++"
    ],
    "lastUpdate": "2022-03-21T11:25:54.133447Z",
    "license": "Other",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://gitlab.sib.swiss/phylo/fastcodeml/-/issues"
        }
    ],
    "name": "FastCodeML",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btt760",
            "metadata": {
                "abstract": "Motivation: The detection of positive selection is widely used to study gene and genome evolution, but its application remains limited by the high computational cost of existing implementations. We present a series of computational optimizations for more efficient estimation of the likelihood function on large-scale phylogenetic problems. We illustrate our approach using the branch-site model of codon evolution.Results: We introduce novel optimization techniques that substantially outperform both CodeML from the PAML package and our previously optimized sequential version SlimCodeML. These techniques can also be applied to other likelihood-based phylogeny software. Our implementation scales well for large numbers of codons and/or species. It can therefore analyse substantially larger datasets than CodeML. We evaluated FastCodeML on different platforms and measured average sequential speedups of FastCodeML (single-threaded) versus CodeML of up to 5.8, average speedups of FastCodeML (multi-threaded) versus CodeML on a single node (shared memory) of up to 36.9 for 12 CPU cores, and average speedups of the distributed FastCodeML versus CodeML of up to 170.9 on eight nodes (96 CPU cores in total). © 2014 The Author.",
                "authors": [
                    {
                        "name": "Pacher C."
                    },
                    {
                        "name": "Robinson-Rechavi M."
                    },
                    {
                        "name": "Salamin N."
                    },
                    {
                        "name": "Schabauer H."
                    },
                    {
                        "name": "Stamatakis A."
                    },
                    {
                        "name": "Stockinger H."
                    },
                    {
                        "name": "Valle M."
                    }
                ],
                "citationCount": 16,
                "date": "2014-01-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Optimization strategies for fast detection of positive selection on phylogenetic trees"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        }
    ]
}
