{
    "additionDate": "2019-11-14T20:10:36Z",
    "biotoolsCURIE": "biotools:GTA",
    "biotoolsID": "GTA",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "olga.zhaxybayeva@dartmouth.edu",
            "name": "Olga Zhaxybayeva",
            "orcidid": "https://orcid.org/0000-0002-1809-3909",
            "typeEntity": "Person"
        }
    ],
    "description": "GTA_Hunter is a 'support-vector machine' (SVM) classifier that distinguishes gene transfer agent (GTA) genes from their viral homologs | The classifier was developed to detect GTA genes that are homologous to 11 of the genes that encode the GTA in Rhodobacter capsulatus (RcGTA) (see Kogay et al, 2019). However, the classifier can be trained to detect other RcGTA genes, other GTAs, or even other virus-like elements, as long as there is training data available and the two classes have distinct amino acid composition",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                },
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                }
            ]
        }
    ],
    "homepage": "https://github.com/ecg-lab/GTA-Hunter-v1",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-12-07T08:32:37.716266Z",
    "license": "MIT",
    "name": "GTA",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/GBE/EVZ206",
            "metadata": {
                "abstract": "© 2019 The Author(s) 2019. Published by Oxford University Press on behalf of the Society for Molecular Biology and Evolution.Many of the sequenced bacterial and archaeal genomes encode regions of viral provenance. Yet, not all of these regions encode bona fide viruses. Gene transfer agents (GTAs) are thought to be former viruses that are now maintained in genomes of some bacteria and archaea and are hypothesized to enable exchange of DNA within bacterial populations. In Alphaproteobacteria, genes homologous to the \"head-tail\" gene cluster that encodes structural components of the Rhodobacter capsulatus GTA (RcGTA) are found in many taxa, even if they are only distantly related to Rhodobacter capsulatus. Yet, in most genomes available in GenBank RcGTA-like genes have annotations of typical viral proteins, and therefore are not easily distinguished from their viral homologs without additional analyses. Here, we report a \"support vector machine\" classifier that quickly and accurately distinguishes RcGTA-like genes from their viral homologs by capturing the differences in the amino acid composition of the encoded proteins. Our open-source classifier is implemented in Python and can be used to scan homologs of the RcGTA genes in newly sequenced genomes. The classifier can also be trained to identify other types of GTAs, or even to detect other elements of viral ancestry. Using the classifier trained on a manually curated set of homologous viruses and GTAs, we detected RcGTA-like \"head-tail\" gene clusters in 57.5% of the 1,423 examined alphaproteobacterial genomes. We also demonstrated that more than half of the in silico prophage predictions are instead likely to be GTAs, suggesting that in many alphaproteobacterial genomes the RcGTA-like elements remain unrecognized.",
                "authors": [
                    {
                        "name": "Kogay R."
                    },
                    {
                        "name": "Neely T.B."
                    },
                    {
                        "name": "Birnbaum D.P."
                    },
                    {
                        "name": "Hankel C.R."
                    },
                    {
                        "name": "Shakya M."
                    },
                    {
                        "name": "Zhaxybayeva O."
                    },
                    {
                        "name": "Delaye L."
                    }
                ],
                "citationCount": 1,
                "date": "2019-10-01T00:00:00Z",
                "journal": "Genome Biology and Evolution",
                "title": "Machine-Learning Classification Suggests That Many Alphaproteobacterial Prophages May Instead Be Gene Transfer Agents"
            },
            "pmcid": "PMC6821227",
            "pmid": "31560374"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Gene and protein families",
            "uri": "http://edamontology.org/topic_0623"
        },
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        }
    ]
}