{
    "additionDate": "2021-01-18T12:11:47Z",
    "biotoolsCURIE": "biotools:deeptfactor",
    "biotoolsID": "deeptfactor",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "leesy@kaist.ac.kr",
            "name": "Sang Yup Lee",
            "typeEntity": "Person"
        }
    ],
    "description": "DeepTFactor is a deep learning-based tool that predicts whether a protein in question is a transcription factor. DeepTFactor uses a convolutional neural network to extract features of a protein. It showed high performance in predicting TFs of both eukaryotic and prokaryotic origins,",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "RNA-binding protein prediction",
                    "uri": "http://edamontology.org/operation_3901"
                },
                {
                    "term": "DNA-binding protein prediction",
                    "uri": "http://edamontology.org/operation_3900"
                },
                {
                    "term": "Fold recognition",
                    "uri": "http://edamontology.org/operation_0303"
                },
                {
                    "term": "Binding site prediction",
                    "uri": "http://edamontology.org/operation_2575"
                },
                {
                    "term": "Peak calling",
                    "uri": "http://edamontology.org/operation_3222"
                }
            ]
        }
    ],
    "homepage": "https://bitbucket.org/kaistsystemsbiology/deeptfactor",
    "lastUpdate": "2021-02-27T15:29:22Z",
    "name": "DeepTFactor",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1073/PNAS.2021171118",
            "metadata": {
                "abstract": "© 2021 National Academy of Sciences. All rights reserved.A transcription factor (TF) is a sequence-specific DNA-binding protein that modulates the transcription of a set of particular genes, and thus regulates gene expression in the cell. TFs have commonly been predicted by analyzing sequence homology with the DNA-binding domains of TFs already characterized. Thus, TFs that do not show homologies with the reported ones are difficult to predict. Here we report the development of a deep learning-based tool, DeepTFactor, that predicts whether a protein in question is a TF. DeepTFactor uses a convolutional neural network to extract features of a protein. It showed high performance in predicting TFs of both eukaryotic and prokaryotic origins, resulting in F1 scores of 0.8154 and 0.8000, respectively. Analysis of the gradients of prediction score with respect to input suggested that DeepTFactor detects DNA-binding domains and other latent features for TF prediction. DeepTFactor predicted 332 candidate TFs in Escherichia coli K-12 MG1655. Among them, 84 candidate TFs belong to the y-ome, which is a collection of genes that lack experimental evidence of function. We experimentally validated the results of DeepTFactor prediction by further characterizing genome-wide binding sites of three predicted TFs, YqhC, YiaU, and YahB. Furthermore, we made available the list of 4,674,808 TFs predicted from 73,873,012 protein sequences in 48,346 genomes. DeepTFactor will serve as a useful tool for predicting TFs, which is necessary for understanding the regulatory systems of organisms of interest. We provide DeepTFactor as a stand-alone program, available at https://bitbucket.org/kaistsystemsbiology/deeptfactor.",
                "authors": [
                    {
                        "name": "Kim G.B."
                    },
                    {
                        "name": "Gao Y."
                    },
                    {
                        "name": "Palsson B.O."
                    },
                    {
                        "name": "Lee S.Y."
                    }
                ],
                "citationCount": 1,
                "date": "2021-01-12T00:00:00Z",
                "journal": "Proceedings of the National Academy of Sciences of the United States of America",
                "title": "DeepTFactor: A deep learning-based tool for the prediction of transcription factors"
            },
            "pmid": "33372147"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "ChIP-seq",
            "uri": "http://edamontology.org/topic_3169"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        }
    ]
}