{
    "accessibility": "Open access",
    "additionDate": "2019-06-23T16:20:29Z",
    "biotoolsCURIE": "biotools:QHOT",
    "biotoolsID": "QHOT",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "chkao@stat.sinica.edu.tw",
            "name": "Chen-Hung Kao",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.stat.sinica.edu.tw/chkao/"
        }
    ],
    "description": "Statistical procedure for genome-wide detection of QTL hotspots using public databases.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://www.stat.sinica.edu.tw/chkao/RQTL/Usage_of_R_code_functions.(QHOT).docx"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Genetic mapping",
                    "uri": "http://edamontology.org/operation_0282"
                },
                {
                    "term": "Gene expression QTL analysis",
                    "uri": "http://edamontology.org/operation_3232"
                }
            ]
        }
    ],
    "homepage": "http://www.stat.sinica.edu.tw/chkao/RQTL/download.htm",
    "language": [
        "R"
    ],
    "lastUpdate": "2020-06-16T10:55:23Z",
    "maturity": "Mature",
    "name": "QHOT",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "Ruta",
    "publication": [
        {
            "doi": "10.1534/g3.118.200922",
            "metadata": {
                "abstract": "© 2019 Chen et al.Genome-wide detection of quantitative trait loci (QTL) hotspots underlying variation in many molecular and phenotypic traits has been a key step in various biological studies since the QTL hotspots are highly informative and can be linked to the genes for the quantitative traits. Several statistical methods have been proposed to detect QTL hotspots. These hotspot detection methods rely heavily on permutation tests performed on summarized QTL data or individual-level data (with genotypes and phenotypes) from the genetical genomics experiments. In this article, we propose a statistical procedure for QTL hotspot detection by using the summarized QTL (interval) data collected in public web-accessible databases. First, a simple statistical method based on the uniform distribution is derived to convert the QTL interval data into the expected QTL frequency (EQF) matrix. And then, to account for the correlation structure among traits, the QTL for correlated traits are grouped together into the same categories to form a reduced EQF matrix. Furthermore, a permutation algorithm on the EQF elements or on the QTL intervals is developed to compute a sliding scale of EQF thresholds, ranging from strict to liberal, for assessing the significance of QTL hotspots. With grouping, much stricter thresholds can be obtained to avoid the detection of spurious hotspots. Real example analysis and simulation study are carried out to illustrate our procedure, evaluate the performances and compare with other methods. It shows that our procedure can control the genomewide error rates at the target levels, provide appropriate thresholds for correlated data and is comparable to the methods using individual-level data in hotspot detection. Depending on the thresholds used, more than 100 hotspots are detected in GRAMENE rice database. We also perform a genome-wide comparative analysis of the detected hotspots and the known genes collected in the Rice Q-TARO database. The comparative analysis reveals that the hotspots and genes are conformable in the sense that they co-localize closely and are functionally related to relevant traits. Our statistical procedure can provide a framework for exploring the networks among QTL hotspots, genes and quantitative traits in biological studies. The R codes that produce both numerical and graphical outputs of QTL hotspot detection in the genome are available on the worldwide web http://www.stat.sinica.edu.tw/chkao/.",
                "authors": [
                    {
                        "name": "Yang M.-H."
                    },
                    {
                        "name": "Wu D.-H."
                    },
                    {
                        "name": "Kao C.-H."
                    }
                ],
                "citationCount": 2,
                "date": "2019-02-01T00:00:00Z",
                "journal": "G3: Genes, Genomes, Genetics",
                "title": "A statistical procedure for genome-wide detection of QTL hotspots using public databases with application to rice"
            },
            "pmcid": "PMC6385979",
            "pmid": "30541929",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "GWAS study",
            "uri": "http://edamontology.org/topic_3517"
        }
    ],
    "validated": 1
}