{
    "additionDate": "2017-08-20T14:57:28Z",
    "biotoolsCURIE": "biotools:admixture",
    "biotoolsID": "admixture",
    "collectionID": [
        "Animal and Crop Genomics"
    ],
    "credit": [
        {
            "email": "dalexander@ucla.edu",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Maximum likelihood estimation of individual ancestries from multilocus SNP genotype datasets. It uses the same statistical model as STRUCTURE but calculates estimates using a fast numerical optimization algorithm.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://software.genetics.ucla.edu/admixture/admixture-manual.pdf"
        }
    ],
    "editPermission": {
        "authors": [
            "animalandcropgenomics"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genetic variation analysis",
                    "uri": "http://edamontology.org/operation_3197"
                }
            ]
        }
    ],
    "homepage": "http://software.genetics.ucla.edu/admixture/",
    "lastUpdate": "2020-01-19T17:47:47Z",
    "license": "Not licensed",
    "name": "Admixture",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "admin",
    "publication": [
        {
            "doi": "10.1101/gr.094052.109",
            "metadata": {
                "abstract": "Population stratification has long been recognized as a confounding factor in genetic association studies. Estimated ancestries, derived from multi-locus genotype data, can be used to perform a statistical correction for population stratification. One popular technique for estimation of ancestry is the model-based approach embodied by the widely applied program structure. Another approach, implemented in the program EIGENSTRAT, relies on Principal Component Analysis rather than model-based estimation and does not directly deliver admixture fractions. EIGENSTRAT has gained in popularity in part owing to its remarkable speed in comparison to structure. We present a new algorithm and a program, ADMIXTURE, for model-based estimation of ancestry in unrelated individuals. ADMIXTURE adopts the likelihood model embedded in structure. However, ADMIXTURE runs considerably faster, solving problems in minutes that take structure hours. In many of our experiments, we have found that ADMIXTURE is almost as fast as EIGENSTRAT. The runtime improvements of ADMIXTURE rely on a fast block relaxation scheme using sequential quadratic programming for block updates, coupled with a novel quasi-Newton acceleration of convergence. Our algorithm also runs faster and with greater accuracy than the implementation of an Expectation-Maximization (EM) algorithm incorporated in the program FRAPPE. Our simulations show that ADMIXTURE's maximum likelihood estimates of the underlying admixture coefficients and ancestral allele frequencies are as accurate as structure's Bayesian estimates. On real-world data sets, ADMIXTURE's estimates are directly comparable to those from structure and EIGENSTRAT. Taken together, our results show that ADMIXTURE's computational speed opens up the possibility of using a much larger set of markers in model-based ancestry estimation and that its estimates are suitable for use in correcting for population stratification in association studies. © 2009 by Cold Spring Harbor Laboratory Press.",
                "authors": [
                    {
                        "name": "Alexander D.H."
                    },
                    {
                        "name": "Novembre J."
                    },
                    {
                        "name": "Lange K."
                    }
                ],
                "citationCount": 2214,
                "date": "2009-09-01T00:00:00Z",
                "journal": "Genome Research",
                "title": "Fast model-based estimation of ancestry in unrelated individuals"
            },
            "pmcid": "PMC2752134",
            "pmid": "19648217",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Population genetics",
            "uri": "http://edamontology.org/topic_3056"
        }
    ],
    "validated": 1
}