{
    "name": "MultiPSQ", 
    "description": "MultiPSQ expedites the analysis and evaluation of multiplex-pyrograms, generated from multiplex pyrosequencing", 
    "homepage": "https://sourceforge.net/projects/multipsq/", 
    "biotoolsID": "multipsq", 
    "biotoolsCURIE": "biotools:multipsq", 
    "version": [], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_3222", 
                    "term": "Peak calling"
                }, 
                {
                    "uri": "http://edamontology.org/operation_2929", 
                    "term": "Protein fragment weight comparison"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Desktop application"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_3293", 
            "term": "Phylogenetics"
        }, 
        {
            "uri": "http://edamontology.org/topic_3305", 
            "term": "Public health and epidemiology"
        }, 
        {
            "uri": "http://edamontology.org/topic_3301", 
            "term": "Microbiology"
        }
    ], 
    "operatingSystem": [
        "Linux", 
        "Windows"
    ], 
    "language": [
        "C++"
    ], 
    "license": "LGPL-3.0", 
    "collectionID": [], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [], 
    "download": [], 
    "documentation": [
        {
            "url": "https://sourceforge.net/p/multipsq/wiki/Home/", 
            "type": "General", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": null, 
            "pmid": "23555882", 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "MultiPSQ: A Software Solution for the Analysis of Diagnostic n-Plexed Pyrosequencing Reactions", 
                "abstract": "Background: Pyrosequencing can be applied for Single-Nucleotide-Polymorphism (SNP)-based pathogen typing or for providing sequence information of short DNA stretches. However, for some pathogens molecular typing cannot be performed relying on a single SNP or short sequence stretch, necessitating the consideration of several genomic regions. A promising rapid approach is the simultaneous application of multiple sequencing primers, called multiplex pyrosequencing. These primers generate a fingerprint-pyrogram which is constituted by the sum of all individual pyrograms originating from each primer used. Methods: To improve pyrosequencing-based pathogen typing, we have developed the software tool MultiPSQ that expedites the analysis and evaluation of multiplex-pyrograms. As a proof of concept, a multiplex pyrosequencing assay for the typing of orthopoxviruses was developed to analyse clinical samples diagnosed in the German Consultant Laboratory for Poxviruses. Results: The software tool MultiPSQ enabled the analysis of multiplex-pyrograms originating from various pyrosequencing primers. Thus several target regions can be used for pathogen typing based on pyrosequencing. As shown with a proof of concept assay, SNPs present in different orthopoxvirus strains could be identified correctly with two primers by MultiPSQ. Conclusions: Software currently available is restricted to a fixed number of SNPs and sequencing primers, severely limiting the usefulness of this technique. In contrast, our novel software MultiPSQ allows analysis of data from multiplex pyrosequencing assays that contain any number of sequencing primers covering any number of polymorphisms. © 2013 Dabrowski et al.", 
                "date": "2013-03-26T00:00:00Z", 
                "citationCount": 4, 
                "authors": [
                    {
                        "name": "Dabrowski P.W."
                    }, 
                    {
                        "name": "Schroder K."
                    }, 
                    {
                        "name": "Nitsche A."
                    }
                ], 
                "journal": "PLoS ONE"
            }
        }
    ], 
    "credit": [
        {
            "name": "Piotr Wojtek Dabrowski", 
            "email": "dabrowskiw@rki.de", 
            "url": null, 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "seqwiki_import", 
    "additionDate": "2017-01-13T13:15:34Z", 
    "lastUpdate": "2018-12-10T12:58:56Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 1, 
    "homepage_status": 0, 
    "elixir_badge": 0
}