{
    "additionDate": "2021-03-19T08:40:12Z",
    "biotoolsCURIE": "biotools:msound",
    "biotoolsID": "msound",
    "confidence_flag": "tool",
    "description": "An Open Source Toolbox for Modeling Acoustic Wave Propagation in Heterogeneous Media.\n\nmSOUND is an open-source toolbox written in MATLAB.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Modelling and simulation",
                    "uri": "http://edamontology.org/operation_2426"
                }
            ]
        }
    ],
    "homepage": "https://m-sound.github.io/mSOUND/home",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2021-05-07T06:39:15Z",
    "name": "mSOUND",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1109/TUFFC.2021.3051729",
            "metadata": {
                "abstract": "© 1986-2012 IEEE.mSOUND is an open-source toolbox written in MATLAB. This toolbox is intended for modeling linear/ nonlinear acoustic wave propagation in media (primarily biological tissues) with arbitrary heterogeneities, in which, the speed of sound, density, attenuation coefficient, power-law exponent, and nonlinear coefficient are all spatially varying functions. The computational model is an iterative one-way model based on a mixed domain method. In this article, a general guideline is given along with three representative examples to illustrate how to set up simulations using mSOUND. The first example uses the transient mixed-domain method (TMDM) forward projection to compute the transient acoustic field for a given source defined on a plane. The second example uses the frequency-specific mixed-domain method (FSMDM) forward projection to rapidly obtain the pressure distribution directly at the frequencies of interest, assuming linear or weakly nonlinear wave propagation. The third example demonstrates how to use TMDM backward projection to reconstruct the initial acoustic pressure field to facilitate photoacoustic tomography (PAT). mSOUND (https://m-sound.github.io/mSOUND/home) is designed to be complementary to existing ultrasound modeling toolboxes and is expected to be useful for a wide range of applications in medical ultrasound including treatment planning, PAT, transducer design, and characterization.",
                "authors": [
                    {
                        "name": "Gu J."
                    },
                    {
                        "name": "Jing Y."
                    }
                ],
                "date": "2021-05-01T00:00:00Z",
                "journal": "IEEE Transactions on Ultrasonics, Ferroelectrics, and Frequency Control",
                "title": "MSOUND: An Open Source Toolbox for Modeling Acoustic Wave Propagation in Heterogeneous Media"
            },
            "pmid": "33444136"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "Echography",
            "uri": "http://edamontology.org/topic_3954"
        },
        {
            "term": "Tomography",
            "uri": "http://edamontology.org/topic_3452"
        }
    ]
}