{
    "name": "Arabidopsis eFP Browser", 
    "description": "An \"\"Electronic Fluorescent Pictograph\"\" browser for exploring and analyzing large-scale biological data sets (using example of Arabidopsis). Explores microarray and other data for hypothesis generation. eFP Browser engine paints data from large-scale data sets onto pictographic representations of the experimental samples used to generate the data sets.", 
    "homepage": "http://bar.utoronto.ca/efp_arabidopsis/cgi-bin/efpWeb.cgi", 
    "biotoolsID": "arabidopsis_efp_browser", 
    "biotoolsCURIE": "biotools:arabidopsis_efp_browser", 
    "version": [], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_3429", 
                    "term": "Generation"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Database portal"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_3518", 
            "term": "Microarray experiment"
        }, 
        {
            "uri": "http://edamontology.org/topic_3277", 
            "term": "Sample collections"
        }
    ], 
    "operatingSystem": [
        "Linux", 
        "Windows", 
        "Mac"
    ], 
    "language": [], 
    "license": null, 
    "collectionID": [], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [], 
    "download": [], 
    "documentation": [], 
    "publication": [
        {
            "doi": null, 
            "pmid": "17684564", 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "An \"electronic fluorescent pictograph\" Browser for exploring and analyzing large-scale biological data sets", 
                "abstract": "Background. The exploration of microarray data and data from other high-throughput projects for hypothesis generation has become a vital aspect of post-genomic research. For the non-bioinformatics specialist, however, many of the currently available tools provide overwhelming amounts of data that are presented in a non-intuitive way. Methodology/Principal Findings. In order to facilitate the interpretation and analysis of microarray data and data from other Jarge-scale data sets, we have developed a tool, which we have dubbed the electronic Fluorescent Pictograph - or eFP - Browser, available at http://www.bar.utoronto.ca/, for exploring microarray and other data for hypothesis generation. This eFP Browser engine paints data from large-scale data sets onto pictographic representations of the experimental samples used to generate the data sets. We give examples of using the tool to present Arabidopsis gene expression data from the AtGenExpress Consortium (Arabidopsis eFP Browser), data for subcellular localization of Arabidopsis proteins (Cell eFP Browser), and mouse tissue atlas microarray data (Mouse eFP Browser). Conclusions/Significance. The eFP Browser software is easily adaptable to microarray or other large-scale data sets from any organism and thus should prove useful to a wide community for visualizing and interpreting these data sets for hypothesis generation. © 2007 Winter et al.", 
                "date": "2007-08-08T00:00:00Z", 
                "citationCount": 1248, 
                "authors": [
                    {
                        "name": "Winter D."
                    }, 
                    {
                        "name": "Vinegar B."
                    }, 
                    {
                        "name": "Nahal H."
                    }, 
                    {
                        "name": "Ammar R."
                    }, 
                    {
                        "name": "Wilson G.V."
                    }, 
                    {
                        "name": "Provart N.J."
                    }
                ], 
                "journal": "PLoS ONE"
            }
        }
    ], 
    "credit": [
        {
            "name": "Nicholas Provart", 
            "email": "nicholas.provart@utoronto.ca", 
            "url": null, 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "ELIXIR-EE", 
    "additionDate": "2017-03-30T21:27:49Z", 
    "lastUpdate": "2018-12-10T12:58:57Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 1, 
    "homepage_status": 0, 
    "elixir_badge": 0
}