{"credit":[{"email":"gary.bader@utoronto.ca","name":"Gary Bader","typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://baderlab.org/GaryBader"}],"documentation":[{"type":"GENERAL","url":"http://baderlab.org/Software/MCODE"},{"url":"http://baderlab.org/Software/MCODE/UsersManual"}],"function":[{"operation":[{"term":"Protein interaction network analysis","uri":"http://edamontology.org/operation_0276"},{"term":"Pathway or network visualisation","uri":"http://edamontology.org/operation_3083"},{"term":"Protein interaction network comparison","uri":"http://edamontology.org/operation_0277"},{"term":"Protein interaction prediction","uri":"http://edamontology.org/operation_2492"},{"term":"Pathway or network prediction","uri":"http://edamontology.org/operation_3439"}]}],"labels":{"collectionID":["Proteomics"],"language":["Java"],"operatingSystem":["Linux","Windows","Mac"],"toolType":["Desktop application"],"topic":[{"term":"Protein interactions","uri":"http://edamontology.org/topic_0128"},{"term":"Molecular interactions, pathways and networks","uri":"http://edamontology.org/topic_0602"},{"term":"Protein interaction experiment","uri":"http://edamontology.org/topic_3557"},{"term":"Proteomics","uri":"http://edamontology.org/topic_0121"},{"term":"Proteins","uri":"http://edamontology.org/topic_0078"}]},"publication":[{"abstract":"Background: Recent advances in proteomics technologies such as two-hybrid, phage display and mass spectrometry have enabled us to create a detailed map of biomolecular interaction networks. Initial mapping efforts have already produced a wealth of data. As the size of the interaction set increases, databases and computational methods will be required to store, visualize and analyze the information in order to effectively aid in knowledge discovery. Results: This paper describes a novel graph theoretic clustering algorithm, \"Molecular Complex Detectio\" (MCODE), that detects densely connected regions in large protein-protein interaction networks that may represent molecular complexes. The method is based on vertex weighting by local neighborhood density and outward traversal from a locally dense seed protein to isolate the dense regions according to given parameters. The algorithm has the advantage over other graph clustering methods of having a directed mode that allows fine-tuning of clusters of interest without considering the rest of the network and allows examination of cluster interconnectivity, which is relevant for protein networks. Protein interaction and complex information from the yeast Saccharomyces cerevisiae was used for evaluation. Conclusion: Dense regions of protein interaction networks can be found, based solely on connectivity data, many of which correspond to known protein complexes. The algorithm is not affected by a known high rate of false positives in data from high-throughput interaction techniques. © 2003 Bader and Hogue; licensee BioMed Central Ltd.","authors":["Bader G.D.","Hogue C.W.V."],"cit_count":1884,"journal":"BMC Bioinformatics","pmid":"12525261","title":"An automated method for finding molecular complexes in large protein interaction networks","year":"2003-01-13"}],"summary":{"biotoolsCURIE":"biotools:mcode","biotoolsID":"mcode","description":"A Cytoscape plugin that finds clusters in different types of networks. An automated method for finding molecular complexes in large protein interaction networks.","homepage":"http://baderlab.org/Software/MCODE","name":"MCODE"}}