{
    "additionDate": "2021-01-18T10:11:14Z",
    "biotoolsCURIE": "biotools:linearpartition",
    "biotoolsID": "linearpartition",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "liang.huang.sh@gmail.com",
            "name": "Liang Huang",
            "typeEntity": "Person"
        }
    ],
    "description": "Linear-time approximation of RNA folding partition function and base-pairing probabilities.\n\nLinearPartition: Linear-Time Approximation of RNA Folding Partition Function and Base Pairing Probabilities.\n\nThis repository contains the C++ source code for the LinearPartition project, the first linear-time partition function and base pair probabilities calculation algorithm/software for RNA secondary structures.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "RNA secondary structure prediction",
                    "uri": "http://edamontology.org/operation_0278"
                },
                {
                    "term": "RNA structure prediction",
                    "uri": "http://edamontology.org/operation_2441"
                },
                {
                    "term": "Protein structure prediction",
                    "uri": "http://edamontology.org/operation_0474"
                }
            ]
        }
    ],
    "homepage": "http://linearfold.org/partition",
    "language": [
        "C++",
        "Python"
    ],
    "lastUpdate": "2021-02-16T08:52:06Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "http://github.com/LinearFold/LinearPartition"
        }
    ],
    "name": "LinearPartition",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAA460",
            "metadata": {
                "abstract": "© 2020 Oxford University Press. All rights reserved.Motivation: RNA secondary structure prediction is widely used to understand RNA function. Recently, there has been a shift away from the classical minimum free energy methods to partition function-based methods that account for folding ensembles and can therefore estimate structure and base pair probabilities. However, the classical partition function algorithm scales cubically with sequence length, and is therefore prohibitively slow for long sequences. This slowness is even more severe than cubic-time free energy minimization due to a substantially larger constant factor in runtime. Results: Inspired by the success of our recent LinearFold algorithm that predicts the approximate minimum free energy structure in linear time, we design a similar linear-time heuristic algorithm, LinearPartition, to approximate the partition function and base-pairing probabilities, which is shown to be orders of magnitude faster than Vienna RNAfold and CONTRAfold (e.g. 2.5 days versus 1.3 min on a sequence with length 32 753 nt). More interestingly, the resulting base-pairing probabilities are even better correlated with the ground-truth structures. LinearPartition also leads to a small accuracy improvement when used for downstream structure prediction on families with the longest length sequences (16S and 23S rRNAs), as well as a substantial improvement on long-distance base pairs (500 nt apart).",
                "authors": [
                    {
                        "name": "Zhang H."
                    },
                    {
                        "name": "Zhang L."
                    },
                    {
                        "name": "Mathews D.H."
                    },
                    {
                        "name": "Huang L."
                    }
                ],
                "date": "2020-01-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "LinearPartition: Linear-time approximation of RNA folding partition function and base-pairing probabilities"
            },
            "pmcid": "PMC7355276",
            "pmid": "32657379"
        }
    ],
    "toolType": [
        "Command-line tool",
        "Web service"
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        }
    ]
}