{
    "accessibility": "Open access",
    "additionDate": "2022-09-02T07:02:45.146852Z",
    "biotoolsCURIE": "biotools:artifact3-d",
    "biotoolsID": "artifact3-d",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "leore.grosman@mail.huji.ac.il",
            "name": "Leore Grosman",
            "orcidid": "https://orcid.org/0000-0002-6976-6202",
            "typeEntity": "Person"
        },
        {
            "name": "Nir Dick"
        }
    ],
    "description": "Artifact3-D offers a suite of functions for analysing 3D scans of archaeological artifacts. These functions are repeatable, objective, precise, and customizable.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://sourceforge.net/projects/artifact3-d/",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2022-09-02T07:02:45.150196Z",
    "license": "MIT",
    "name": "Artifact3-D",
    "operatingSystem": [
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PONE.0268401",
            "metadata": {
                "abstract": "© 2022 Grosman et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.The study of artifacts is fundamental to archaeological research. The features of individual artifacts are recorded, analyzed, and compared within and between contextual assemblages. Here we present and make available for academic-use Artifact3-D, a new software package comprised of a suite of analysis and documentation procedures for archaeological artifacts. We introduce it here, alongside real archaeological case studies to demonstrate its utility. Artifact3-D equips its users with a range of computational functions for accurate measurements, including orthogonal distances, surface area, volume, CoM, edge angles, asymmetry, and scar attributes. Metrics and figures for each of these measurements are easily exported for the purposes of further analysis and illustration. We test these functions on a range of real archaeological case studies pertaining to tool functionality, technological organization, manufacturing traditions, knapping techniques, and knapper skill. Here we focus on lithic artifacts, but the Artifact3-D software can be used on any artifact type to address the needs of modern archaeology. Computational methods are increasingly becoming entwined in the excavation, documentation, analysis, database creation, and publication of archaeological research. Artifact3-D offers functions to address every stage of this workflow. It equips the user with the requisite toolkit for archaeological research that is accurate, objective, repeatable and efficient. This program will help archaeological research deal with the abundant material found during excavations and will open new horizons in research trajectories.",
                "authors": [
                    {
                        "name": "Dag I."
                    },
                    {
                        "name": "Dick N."
                    },
                    {
                        "name": "Goldgeier H."
                    },
                    {
                        "name": "Grosman L."
                    },
                    {
                        "name": "Harush O."
                    },
                    {
                        "name": "Herzlinger G."
                    },
                    {
                        "name": "Muller A."
                    },
                    {
                        "name": "Nebenhaus K."
                    },
                    {
                        "name": "Valetta F."
                    },
                    {
                        "name": "Yashuv T."
                    }
                ],
                "date": "2022-06-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "Artifact3-D: New software for accurate, objective and efficient 3D analysis and documentation of archaeological artifacts"
            },
            "pmcid": "PMC9202890",
            "pmid": "35709137"
        }
    ],
    "toolType": [
        "Desktop application",
        "Suite"
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ]
}
