{
    "additionDate": "2021-01-18T07:28:06Z",
    "biotoolsCURIE": "biotools:deephit",
    "biotoolsID": "deephit",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "jyryu@krict.re.kr",
            "name": "Jae Yong Ryu",
            "typeEntity": "Person"
        },
        {
            "email": "ksoh@krict.re.kr",
            "name": "Kwang-Seok Oh",
            "typeEntity": "Person"
        }
    ],
    "description": "DeepHIT is a deep learning framework for prediction of hERG-induced cardiotoxicity.",
    "editPermission": {
        "type": "private"
    },
    "homepage": "https://bitbucket.org/krictai/deephit",
    "lastUpdate": "2021-02-27T14:02:59Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://bitbucket.org/krictai/chemtrans"
        }
    ],
    "name": "DeepHIT",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAA075",
            "metadata": {
                "abstract": "© 2020 The Author(s). Published by Oxford University Press. All rights reserved.Motivation: Blockade of the human ether-a-go-go-related gene (hERG) channel by small compounds causes a prolonged QT interval that can lead to severe cardiotoxicity and is a major cause of the many failures in drug development. Thus, evaluating the hERG-blocking activity of small compounds is important for successful drug development. To this end, various computational prediction tools have been developed, but their prediction performances in terms of sensitivity and negative predictive value (NPV) need to be improved to reduce false negative predictions. Results: We propose a computational framework, DeepHIT, which predicts hERG blockers and non-blockers for input compounds. For the development of DeepHIT, we generated a large-scale gold-standard dataset, which includes 6632 hERG blockers and 7808 hERG non-blockers. DeepHIT is designed to contain three deep learning models to improve sensitivity and NPV, which, in turn, produce fewer false negative predictions. DeepHIT outperforms currently available tools in terms of accuracy (0.773), MCC (0.476), sensitivity (0.833) and NPV (0.643) on an external test dataset. We also developed an in silico chemical transformation module that generates virtual compounds from a seed compound, based on the known chemical transformation patterns. As a proof-of-concept study, we identified novel urotensin II receptor (UT) antagonists without hERG-blocking activity derived from a seed compound of a previously reported UT antagonist (KR-36676) with a strong hERG-blocking activity. In summary, DeepHIT will serve as a useful tool to predict hERG-induced cardiotoxicity of small compounds in the early stages of drug discovery and development.",
                "authors": [
                    {
                        "name": "Ryu J.Y."
                    },
                    {
                        "name": "Lee M.Y."
                    },
                    {
                        "name": "Lee J.H."
                    },
                    {
                        "name": "Lee B.H."
                    },
                    {
                        "name": "Oh K.-S."
                    }
                ],
                "citationCount": 6,
                "date": "2020-05-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "DeepHIT: A deep learning framework for prediction of hERG-induced cardiotoxicity"
            },
            "pmid": "32022860"
        }
    ],
    "topic": [
        {
            "term": "Drug discovery",
            "uri": "http://edamontology.org/topic_3336"
        },
        {
            "term": "Drug development",
            "uri": "http://edamontology.org/topic_3373"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}