
{
    "credit": [
        {
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://www.computationalbiology.it/"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Search",
                    "uri": "http://edamontology.org/operation_2421"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Detection",
                    "uri": "http://edamontology.org/operation_2423"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Protein sequence analysis",
                    "uri": "http://edamontology.org/operation_2479"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Java"
        ],
        "operatingSystem": [
            "Linux",
            "Windows"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Proteins",
                "uri": "http://edamontology.org/topic_0078"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/assist-active-site-similarity-search-tool.html"
        }
    ],
    "publication": [
        {
            "abstract": "Motivation: Structural genomics initiatives are increasingly leading to the determination of the 3D structure of target proteins whose catalytic function is not known. The aim of this work was that of developing a novel versatile tool for searching structural similarity, which allows to predict the catalytic function, if any, of these proteins.Results: The algorithm implemented by the tool is based on local structural comparison to find the largest subset of similar residues between an input protein and known functional sites. The method uses a geometric hashing approach where information related to residue pairs from the input structures is stored in a hash table and then is quickly retrieved during the comparison step. Tests on proteins belonging to different functional classes, done using the Catalytic Site Atlas entries as targets, indicate that the algorithm is able to identify the correct functional class of the input protein in the vast majority of the cases. © 2013 The Author 2013. Published by Oxford University Press. All rights reserved.",
            "authors": [
                "Caprari S.",
                "Toti D.",
                "Viet Hung L.",
                "Di Stefano M.",
                "Polticelli F."
            ],
            "cit_count": 7,
            "doi": "10.1093/bioinformatics/btt664",
            "journal": "Bioinformatics",
            "title": "ASSIST: A fast versatile local structural comparison tool",
            "type": "Primary",
            "year": "2014-04-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:assist_active",
        "biotoolsID": "assist_active",
        "description": "ASSIST is an application for the detection of catalytic sites in unknown function proteins.",
        "homepage": "http://www.computationalbiology.it/software.html",
        "name": "ASSIST v1- Active Site Similarity Search Tool"
    }
}