{
    "additionDate": "2021-01-18T09:26:45Z",
    "biotoolsCURIE": "biotools:capsnet-ssp",
    "biotoolsID": "capsnet-ssp",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "liying@jlu.edu.cn",
            "name": "Ying Li",
            "orcidid": "https://orcid.org/0000-0002-7804-149X",
            "typeEntity": "Person"
        }
    ],
    "description": "CapsNet-SSP is a multilane capsule network for predicting human saliva-secretory proteins. Compared with disease biomarkers in blood and urine, biomarkers in saliva have distinct advantages, as they can be examined with convenient clinical tests and through noninvasive sample collection.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                },
                {
                    "term": "Protein feature detection",
                    "uri": "http://edamontology.org/operation_3092"
                },
                {
                    "term": "Protein identification",
                    "uri": "http://edamontology.org/operation_3767"
                }
            ]
        }
    ],
    "homepage": "http://www.csbg-jlu.info/CapsNet-SSP/",
    "lastUpdate": "2021-02-07T13:16:14Z",
    "name": "CapsNet-SSP",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1186/S12859-020-03579-2",
            "metadata": {
                "abstract": "© 2020 The Author(s).Background: Compared with disease biomarkers in blood and urine, biomarkers in saliva have distinct advantages in clinical tests, as they can be conveniently examined through noninvasive sample collection. Therefore, identifying human saliva-secretory proteins and further detecting protein biomarkers in saliva have significant value in clinical medicine. There are only a few methods for predicting saliva-secretory proteins based on conventional machine learning algorithms, and all are highly dependent on annotated protein features. Unlike conventional machine learning algorithms, deep learning algorithms can automatically learn feature representations from input data and thus hold promise for predicting saliva-secretory proteins. Results: We present a novel end-to-end deep learning model based on multilane capsule network (CapsNet) with differently sized convolution kernels to identify saliva-secretory proteins only from sequence information. The proposed model CapsNet-SSP outperforms existing methods based on conventional machine learning algorithms. Furthermore, the model performs better than other state-of-the-art deep learning architectures mostly used to analyze biological sequences. In addition, we further validate the effectiveness of CapsNet-SSP by comparison with human saliva-secretory proteins from existing studies and known salivary protein biomarkers of cancer. Conclusions: The main contributions of this study are as follows: (1) an end-to-end model based on CapsNet is proposed to identify saliva-secretory proteins from the sequence information; (2) the proposed model achieves better performance and outperforms existing models; and (3) the saliva-secretory proteins predicted by our model are statistically significant compared with existing cancer biomarkers in saliva. In addition, a web server of CapsNet-SSP is developed for saliva-secretory protein identification, and it can be accessed at the following URL: http://www.csbg-jlu.info/CapsNet-SSP/. We believe that our model and web server will be useful for biomedical researchers who are interested in finding salivary protein biomarkers, especially when they have identified candidate proteins for analyzing diseased tissues near or distal to salivary glands using transcriptome or proteomics.",
                "authors": [
                    {
                        "name": "Cao H."
                    },
                    {
                        "name": "Du W."
                    },
                    {
                        "name": "Li G."
                    },
                    {
                        "name": "Li Y."
                    },
                    {
                        "name": "Pang R."
                    },
                    {
                        "name": "Sun Y."
                    }
                ],
                "citationCount": 3,
                "date": "2020-06-09T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "CapsNet-SSP: Multilane capsule network for predicting human saliva-secretory proteins"
            },
            "pmcid": "PMC7285745",
            "pmid": "32517646"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        }
    ]
}
