{
    "accessibility": "Open access",
    "additionDate": "2021-11-28T14:23:51.965292Z",
    "biotoolsCURIE": "biotools:glycangui",
    "biotoolsID": "glycangui",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "hatang@indiana.edu",
            "name": "Haixu Tang",
            "typeEntity": "Person"
        }
    ],
    "description": "Automated Glycan Annotation and Quantification Using Glucose Unit Index.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Peak detection",
                    "uri": "http://edamontology.org/operation_3215"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Retention time prediction",
                    "uri": "http://edamontology.org/operation_3633"
                }
            ]
        }
    ],
    "homepage": "https://github.com/ruizhang84/GlycanGUIApp",
    "language": [
        "C#"
    ],
    "lastUpdate": "2021-11-28T14:23:51.967922Z",
    "license": "GPL-3.0",
    "name": "GlycanGUI",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.3389/FCHEM.2021.707382",
            "metadata": {
                "abstract": "© Copyright © 2021 Zhang, Peng, Gautam, Huang, Mechref and Tang.The retention time provides critical information for glycan annotation and quantification from the Liquid Chromatography Mass Spectrometry (LC-MS) data. However, the variation of the precise retention time of glycans is highly dependent on the experimental conditions such as the specific separating columns, MS instruments and/or the buffer used. This variation hampers the exploitation of retention time for the glycan annotation from LC-MS data, especially when inter-laboratory data are compared. To incorporate the retention time of glycan across experiments, Glucose Unit Index (GUI) can be computed using the dextrin ladder as internal standard. The retention time of glycans are then calibrated with respect to glucose units derived from dextrin ladders. Despite the successful application of the GUI approach, the manual calibration process is quite tedious and often error prone. In this work, we present a standalone software tool GlycanGUI, with a graphic user interface to automatically carry out the GUI-based glycan annotation/quantification and subsequent data analysis. When tested on experimental data, GlycanGUI reported accurate GUI values compared with manual calibration, and thus is ready to be used for automated glycan annotation and quantification using GUI.",
                "authors": [
                    {
                        "name": "Gautam S."
                    },
                    {
                        "name": "Huang Y."
                    },
                    {
                        "name": "Mechref Y."
                    },
                    {
                        "name": "Peng W."
                    },
                    {
                        "name": "Tang H."
                    },
                    {
                        "name": "Zhang R."
                    }
                ],
                "date": "2021-06-15T00:00:00Z",
                "journal": "Frontiers in Chemistry",
                "title": "GlycanGUI: Automated Glycan Annotation and Quantification Using Glucose Unit Index"
            },
            "pmcid": "PMC8239159",
            "pmid": "34211962"
        }
    ],
    "topic": [
        {
            "term": "Protein modifications",
            "uri": "http://edamontology.org/topic_0601"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        }
    ]
}
