{"collectionID": [], "accessibility": [], "topic": [{"term": "SNP", "uri": "http://edamontology.org/topic_2885"}, {"term": "Genetics", "uri": "http://edamontology.org/topic_3053"}, {"term": "Linkage", "uri": "http://edamontology.org/topic_0102"}], "owner": "mbs_import", "cost": null, "relation": [], "download": [], "validated": 1, "publication": [{"doi": "10.1186/1471-2105-10-216", "note": null, "version": null, "pmid": null, "type": "Primary", "pmcid": null, "metadata": {"title": "Linked region detection using high-density SNP genotype data via the minimum recombinant model of pedigree haplotype inference", "abstract": "Background: With the rapid development of high-throughput genotyping technologies, efficient methods for identifying linked regions using high-density SNP genotype data have become more and more important. Recently, a deterministic method that works very well on SNP genotyping data has been developed (Lin et al. Bioinformatics 2008, 24(1): 86-93). However, that program can only work on a limited number of family structures. In particular, the results (if any) will be poor when the genotype data for the whole chromosome of one of the parents in a nuclear family is missing. Results: We have developed a software package (LIden) for identifying linked regions using high-density SNP genotype data. We focus on handling the case where the genotype data for the whole chromosome of one of the parents in a nuclear family is missing. We use the minimum recombinant model for haplotype inference in pedigrees. Several local optimization algorithms are used to infer the haplotype of each individual and determine the linked regions based on the inferred haplotype data. We have developed a more flexible method to combine nuclear families to further refine (reduce the length of) the linked regions. Conclusion: Our new package (LIden) is efficient software for linked region detection using high-density SNP genotype data. LIden can handle some important cases where the existing programs do not work well. In particular, the new package can handle many cases where the genotype data of one of the two parents is missing for the entire chromosome. The running time of the program is O(mn), where m is the number of members in the family and n is the number of SNP sites in the chromosome. LIden is specifically suitable for handling big sized families. This research also demonstrates another practical use of the minimum recombinant model for haplotype inference in pedigrees. © 2009 Wang et al; licensee BioMed Central Ltd.", "citationCount": 5, "authors": [{"name": "Wang L."}, {"name": "Wang Z."}, {"name": "Yang W."}], "date": "2009-07-15T00:00:00Z", "journal": "BMC Bioinformatics"}}], "homepage_status": 0, "credit": [{"typeRole": ["Primary contact"], "name": null, "url": "http://www.cs.cityu.edu.hk/~lwang/", "gridid": null, "note": null, "orcidid": null, "typeEntity": "Person", "email": null}], "biotoolsCURIE": "biotools:liden", "elixirPlatform": [], "elixirNode": [], "version": [], "elixir_badge": 0, "homepage": "http://www.cs.cityu.edu.hk/~lwang/software/Link/index.htm", "function": [{"note": null, "input": [], "operation": [{"term": "Linkage analysis", "uri": "http://edamontology.org/operation_0283"}], "cmd": null, "output": []}], "lastUpdate": "2018-12-10T12:58:57Z", "otherID": [], "description": "LIden determines allele sharing status among family members using high-density SNP data. It takes SNP genotype data, pedigree structure and physical-locus-file as input, and outputs allele sharing graphical display files and linked regions", "toolType": ["Command-line tool"], "editPermission": {"type": "private", "authors": []}, "language": ["Java"], "link": [{"url": "http://www.mybiosoftware.com/liden-linkage-analysis-software.html", "note": null, "type": "Software catalogue"}], "biotoolsID": "liden", "additionDate": "2017-12-18T00:08:14Z", "name": "LIden", "license": null, "documentation": [], "maturity": null, "confidence_flag": null, "operatingSystem": ["Windows"]}