{
    "accessibility": "Open access (with restrictions)",
    "additionDate": "2021-05-05T10:53:19Z",
    "biotoolsCURIE": "biotools:covid19-transmission-model",
    "biotoolsID": "covid19-transmission-model",
    "collectionID": [
        "MATLAB",
        "File Exchange",
        "COVID-19"
    ],
    "cost": "Free of charge (with restrictions)",
    "credit": [
        {
            "email": "erik.cuevas@cucei.udg.mx",
            "name": "Erik Cuevas",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://www.mathworks.com/matlabcentral/profile/2841735-erik"
        }
    ],
    "description": "Agent-based Transmission model of COVID-19",
    "download": [
        {
            "type": "Screenshot",
            "url": "https://www.mathworks.com//matlabcentral/mlc-downloads/downloads/a17135f5-febe-41ed-a409-294d42dd613f/cecaad93-e0a9-4529-887e-5e9be06b4e0e/images/screenshot.jpg"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Modelling and simulation",
                    "uri": "http://edamontology.org/operation_2426"
                }
            ]
        }
    ],
    "homepage": "https://awww.mathworks.com/matlabcentral/fileexchange/75733-transmission-model-of-covid-19",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2021-05-14T10:46:50Z",
    "name": "COVID-19 Transmission model",
    "operatingSystem": [
        "Windows",
        "Linux",
        "Mac"
    ],
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1016/j.compbiomed.2020.103827",
            "metadata": {
                "abstract": "© 2020 Elsevier LtdThe rapid spread of the coronavirus disease (COVID-19) has become a global threat affecting almost all countries in the world. As countries reach the infection peak, it is planned to return a new normal under different coexistence conditions in order to reduce the economic effects produced by the total or partial closure of companies, universities, shops, etc. Under such circumstances, the use of mathematical models to evaluate the transmission risk of COVID-19 in various facilities represents an important tool in assisting authorities to make informed decisions. On the other hand, agent-based modeling is a relatively new approach to model complex systems composed of agents whose behavior is described using simple rules. Different from classical mathematical models (which consider a homogenous population), agent-based approaches model individuals with distinct characteristics and provide more realistic results. In this paper, an agent-based model to evaluate the COVID-19 transmission risks in facilities is presented. The proposed scheme has been designed to simulate the spatiotemporal transmission process. In the model, simulated agents make decisions depending on the programmed rules. Such rules correspond to spatial patterns and infection conditions under which agents interact to characterize the transmission process. The model also includes an individual profile for each agent, which defines its main social characteristics and health conditions used during its interactions. In general, this profile partially determines the behavior of the agent during its interactions with other individuals. Several hypothetical scenarios have been considered to show the performance of the proposed model. Experimental results have demonstrated that the simulations provide useful information to produce strategies for reducing the transmission risks of COVID-19 within the facilities.",
                "authors": [
                    {
                        "name": "Cuevas E."
                    }
                ],
                "citationCount": 31,
                "date": "2020-06-01T00:00:00Z",
                "journal": "Computers in Biology and Medicine",
                "title": "An agent-based model to evaluate the COVID-19 transmission risks in facilities"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Public health and epidemiology",
            "uri": "http://edamontology.org/topic_3305"
        },
        {
            "term": "Biomedical science",
            "uri": "http://edamontology.org/topic_3344"
        },
        {
            "term": "Infectious disease",
            "uri": "http://edamontology.org/topic_3324"
        },
        {
            "term": "Biology",
            "uri": "http://edamontology.org/topic_3070"
        }
    ],
    "version": [
        "1.0.0"
    ]
}