{
    "additionDate": "2020-01-09T18:26:27Z",
    "biotoolsCURIE": "biotools:Phobos_freeze",
    "biotoolsID": "Phobos_freeze",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "felippe.amorim@bioqmed.ufrj.br",
            "name": "Felippe E. Amorim",
            "typeEntity": "Person"
        }
    ],
    "description": "Phobos is a software for the automated analysis of freezing behavior in rodents. Unlike other programs, it uses manual quantification of a short video to calibrate parameters for optimal freezing detection. Phobos works with 3 user interfaces (UIs) for this purpose. The main user UI is where the user loads videos for quantification, defines an output folder and creates the .xls file with the results. The Video Parameters UI is where the user defines the beginning and end times for freezing detection in the videos and crops the image to restrict the analysis to a specific area. Finally, the Manual Quantification UI is used to manually quantify freezing in a video, which will then be used as a reference for the calibration process.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Validation",
                    "uri": "http://edamontology.org/operation_2428"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Felippe-espinelli/Phobos",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2021-01-09T14:56:57Z",
    "license": "BSD-3-Clause",
    "name": "Phobos",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.3389/FNBEH.2019.00205",
            "metadata": {
                "abstract": "© Copyright © 2019 Amorim, Moulin and Amaral.Freezing behavior is commonly used as a measure of associative fear memory. It can be measured by a trained observer, but this task is time-consuming and subject to variation. Commercially available software packages can also be used to quantify freezing; however, they can be expensive and usually require various parameters to be adjusted by the researcher, leading to additional work and variability in results. With this in mind, we developed Phobos, a freely available, self-calibrating software that measures freezing in a set of videos using a brief manual quantification performed by the user to automatically adjust parameters. To optimize the software, we used four different video sets with different features in order to determine the most relevant parameters, the amount of videos needed for calibration and the minimum criteria to consider it reliable. The results of four different users were compared in order to test intra- and interobserver variability in manual and automated freezing scores. Our results suggest that Phobos can be an inexpensive, simple and reliable tool for measurement of fear-related behavior, with intra- and interuser variability similar to that obtained with manual scoring.",
                "authors": [
                    {
                        "name": "Amorim F.E."
                    },
                    {
                        "name": "Moulin T.C."
                    },
                    {
                        "name": "Amaral O.B."
                    }
                ],
                "citationCount": 2,
                "date": "2019-09-13T00:00:00Z",
                "journal": "Frontiers in Behavioral Neuroscience",
                "title": "A Freely Available, Self-Calibrating Software for Automatic Measurement of Freezing Behavior"
            },
            "pmcid": "PMC6753174",
            "pmid": "31572139"
        }
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Zoology",
            "uri": "http://edamontology.org/topic_3500"
        },
        {
            "term": "Literature and language",
            "uri": "http://edamontology.org/topic_3068"
        }
    ],
    "validated": 1
}