
{
    "credit": [
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Over-representation analysis",
                    "uri": "http://edamontology.org/operation_3501"
                },
                {
                    "term": "Text mining",
                    "uri": "http://edamontology.org/operation_0306"
                },
                {
                    "term": "Protein interaction network analysis",
                    "uri": "http://edamontology.org/operation_0276"
                }
            ]
        }
    ],
    "labels": {
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Molecular interactions, pathways and networks",
                "uri": "http://edamontology.org/topic_0602"
            },
            {
                "term": "Literature and language",
                "uri": "http://edamontology.org/topic_3068"
            },
            {
                "term": "Medicine",
                "uri": "http://edamontology.org/topic_3303"
            },
            {
                "term": "Protein interactions",
                "uri": "http://edamontology.org/topic_0128"
            },
            {
                "term": "Natural language processing",
                "uri": "http://edamontology.org/topic_0218"
            }
        ]
    },
    "publication": [
        {
            "abstract": "iHOP provides fast, accurate, comprehensive, and up-to-date summary information on more than 80 000 biological molecules by automatically extracting key sentences from millions of PubMed documents. Its intuitive user interface and navigation scheme have made iHOP extremely successful among biologists, counting more than 500 000 visits per month (iHOP access statistics: http://www. ihop-net.org/UniPub/iHOP/info/logs/). Here we describe a public programmatic API that enables the integration of main iHOP functionalities in bioinformatic programs and workflows. © 2007 The Author(s).",
            "authors": [
                "Fernandez J.M.",
                "Hoffmann R.",
                "Valencia A."
            ],
            "cit_count": 72,
            "journal": "Nucleic Acids Research",
            "pmid": "17485473",
            "title": "IHOP web services",
            "year": "2007-07-01"
        },
        {
            "abstract": "",
            "authors": [
                "Hoffmann R.",
                "Valencia A."
            ],
            "cit_count": 362,
            "journal": "Nature Genetics",
            "pmid": "15226743",
            "title": "A gene network for navigating the literature [2]",
            "year": "2004-07-01"
        },
        {
            "abstract": "Motivation: The World Wide Web has profoundly changed the way in which we access information. Searching the internet is easy and fast, but more importantly, the interconnection of related contents makes it intuitive and closer to the associative organization of human memory. However, the information retrieval tools currently available to researchers in biology and medicine lag far behind the possibilities that the layman has come to expect from the internet. Results: By using genes and proteins as hyperlinks between sentences and abstracts, the information in PubMed can be converted into one navigable resource. iHOP (Information Hyperlinked over Proteins) is an online service that provides this gene-guided network as a natural way of accessing millions of PubMed abstracts and brings all the advantages of the internet to scientific literature research. Navigating across interrelated sentences within this network is closer to human intuition than the use of conventional keyword searches and allows for stepwise and controlled acquisition of information. Moreover, this literature network can be superimposed upon experimental interaction data to facilitate the simultaneous analysis of novel and existing knowledge. The network presented in iHOP currently contains5 million sentences and 40 000 genes from Homo sapiens, Mus musculus, Drosophila melanogaster, Caenorhabditis elegans, Danio rerio, Arabidopsis thaliana, Saccharomyces cerevisiae and Escherichia coli. © The Author 2005. Published by Oxford University Press. All rights reserved.",
            "authors": [
                "Hoffmann R.",
                "Valencia A."
            ],
            "cit_count": 171,
            "journal": "Bioinformatics",
            "pmid": "16204114",
            "title": "Implementing the iHOP concept for navigation of biomedical literature",
            "year": "2005-09-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:ihop",
        "biotoolsID": "ihop",
        "description": "It allows researchers to explore a network of gene and protein interactions based on published scientific literature. For each gene search, it reports sentences from abstracts associating it with other genes, links out to full abstracts, and reports experimental evidence for the interactions, if available. You can also select sentences to create and visualize your own gene model.",
        "homepage": "http://www.ihop-net.org/UniPub/iHOP/",
        "name": "iHOP"
    }
}