
{
    "credit": [
        {
            "name": "Chun-Wei Tung",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "https://www.nature.com/articles/s41598-018-28361-6/email/correspondent/c1/new"
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "https://chun-weitung.gitbooks.io/chemdis/content/"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Pathway or network analysis",
                    "uri": "http://edamontology.org/operation_2497"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Protein interactions",
                "uri": "http://edamontology.org/topic_0128"
            },
            {
                "term": "Pharmacology",
                "uri": "http://edamontology.org/topic_0202"
            },
            {
                "term": "Simulation experiment",
                "uri": "http://edamontology.org/topic_3524"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© 2018 The Author(s). The assessment of bioactivity and toxicity for mixtures remains a challenging work. Although several computational models have been developed to accelerate the evaluation of chemical-chemical interaction, a specific biological endpoint should be defined before applying the models that usually relies on clinical and experimental data. The development of computational methods is desirable for identifying potential biological endpoints of mixture interactions. To facilitate the identification of potential effects of mixture interactions, a novel online system named ChemDIS-Mixture is proposed to analyze the shared target proteins, and common enriched functions, pathways, and diseases affected by multiple chemicals. Venn diagram tools have been implemented for easy analysis and visualization of interaction targets and effects. Case studies have been provided to demonstrate the capability of ChemDIS-Mixture for identifying potential effects of mixture interactions in clinical studies. ChemDIS-Mixture provides useful functions for the identification of potential effects of coexposure to multiple chemicals. ChemDIS-Mixture is freely accessible at http://cwtung.kmu.edu.tw/chemdis/mixture.",
            "authors": [
                "Tung C.-W.",
                "Wang C.-C.",
                "Wang S.-S.",
                "Lin P."
            ],
            "cit_count": 1,
            "doi": "10.1038/s41598-018-28361-6",
            "journal": "Scientific Reports",
            "title": "ChemDIS-Mixture: An online tool for analyzing potential interaction effects of chemical mixtures",
            "year": "2018-12-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:chemdis-mixture",
        "biotoolsID": "chemdis-mixture",
        "description": "Analyzing potential interaction effects of chemical mixtures.",
        "homepage": "https://cwtung.kmu.edu.tw/chemdis/mixture",
        "name": "ChemDIS-Mixture"
    }
}