{
    "additionDate": "2021-01-18T10:37:50Z",
    "biotoolsCURIE": "biotools:coronavr",
    "biotoolsID": "coronavr",
    "collectionID": [
        "COVID-19"
    ],
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "manojk@imtech.res.in",
            "name": "Manoj Kumar",
            "typeEntity": "Person"
        }
    ],
    "description": "CoronaVR is a Computational Resource and Analysis of Epitopes and Therapeutics for Severe Acute Respiratory Syndrome Coronavirus-2. It is a comprehensive web resource for SARS-CoV-2 study.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Epitope mapping",
                    "uri": "http://edamontology.org/operation_0416"
                },
                {
                    "term": "PCR primer design",
                    "uri": "http://edamontology.org/operation_0308"
                },
                {
                    "term": "Peptide immunogenicity prediction",
                    "uri": "http://edamontology.org/operation_0252"
                }
            ]
        }
    ],
    "homepage": "http://bioinfo.imtech.res.in/manojk/coronavr/",
    "lastUpdate": "2021-02-17T15:55:20Z",
    "name": "CoronaVR",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.3389/FMICB.2020.01858",
            "metadata": {
                "abstract": "© Copyright © 2020 Gupta, Khan, Choudhury, Mukhopadhyay, Sakshi, Rastogi, Thakur, Kumari, Kaur, Shalu, Saini, Sapehia, Barkha, Patel, Bhamare and Kumar.In December 2019, the Chinese city of Wuhan was the center of origin of a pneumonia-like disease outbreak with an unknown causative pathogen. The CDC, China, managed to track the source of infection to a novel coronavirus (2019-nCoV; SARS-CoV-2) that shares approximately 79.6% of its genome with SARS-CoV. The World Health Organization (WHO) initially declared COVID-19 as a Public Health Emergency of International Concern (PHEIC) and later characterized it as a global pandemic on March 11, 2020. Due to the novel nature of this virus, there is an urgent need for vaccines and therapeutics to control the spread of SARS-CoV-2 and its associated disease, COVID-19. Global efforts are underway to circumvent its further spread and treat COVID-19 patients through experimental vaccine formulations and therapeutic interventions, respectively. In the absence of any effective therapeutics, we have devised h bioinformatics-based approaches to accelerate global efforts in the fight against SARS-CoV-2 and to assist researchers in the initial phase of vaccine and therapeutics development. In this study, we have performed comprehensive meta-analyses and developed an integrative resource, “CoronaVR” (http://bioinfo.imtech.res.in/manojk/coronavr/). Predominantly, we identified potential epitope-based vaccine candidates, siRNA-based therapeutic regimens, and diagnostic primers. The resource is categorized into the main sections “Genomes,” “Epitopes,” “Therapeutics,” and Primers.” The genome section harbors different components, viz, genomes, a genome browser, phylogenetic analysis, codon usage, glycosylation sites, and structural analysis. Under the umbrella of epitopes, sub-divisions, namely cross-protective epitopes, B-cell (linear/discontinuous), T-cell (CD4+/CD8+), CTL, and MHC binders, are presented. The therapeutics section has different sub-sections like siRNA, miRNAs, and sgRNAs. Further, experimentally confirmed and designed diagnostic primers are earmarked in the primers section. Our study provided a set of shortlisted B-cell and T-cell (CD4+ and CD8+) epitopes that can be experimentally tested for their incorporation in vaccine formulations. The list of selected primers can be used in testing kits to identify SARS-CoV-2, while the recommended siRNAs, sgRNAs, and miRNAs can be used in therapeutic regimens. We foresee that this resource will help in advancing the research against coronaviruses.",
                "authors": [
                    {
                        "name": "Barkha"
                    },
                    {
                        "name": "Bhamare K.T."
                    },
                    {
                        "name": "Choudhury S."
                    },
                    {
                        "name": "Gupta A.K."
                    },
                    {
                        "name": "Kaur M."
                    },
                    {
                        "name": "Khan M.S."
                    },
                    {
                        "name": "Kumar M."
                    },
                    {
                        "name": "Kumari P."
                    },
                    {
                        "name": "Mukhopadhyay A."
                    },
                    {
                        "name": "Patel P.K."
                    },
                    {
                        "name": "Rastogi A."
                    },
                    {
                        "name": "Saini C."
                    },
                    {
                        "name": "Sakshi"
                    },
                    {
                        "name": "Sapehia V."
                    },
                    {
                        "name": "Shalu"
                    },
                    {
                        "name": "Thakur A."
                    }
                ],
                "citationCount": 9,
                "date": "2020-07-31T00:00:00Z",
                "journal": "Frontiers in Microbiology",
                "title": "CoronaVR: A Computational Resource and Analysis of Epitopes and Therapeutics for Severe Acute Respiratory Syndrome Coronavirus-2"
            },
            "pmcid": "PMC7412965",
            "pmid": "32849449"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Immunogenetics",
            "uri": "http://edamontology.org/topic_3930"
        },
        {
            "term": "Immunoinformatics",
            "uri": "http://edamontology.org/topic_3948"
        },
        {
            "term": "Immunoproteins and antigens",
            "uri": "http://edamontology.org/topic_2830"
        },
        {
            "term": "Probes and primers",
            "uri": "http://edamontology.org/topic_0632"
        }
    ]
}
