{
    "additionDate": "2016-03-21T10:45:29Z",
    "biotoolsCURIE": "biotools:pol3scan",
    "biotoolsID": "pol3scan",
    "credit": [
        {
            "name": "ELIXIR-ITA-PARMA",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        },
        {
            "name": "Prof. Riccardo Percudani",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.unipr.it/ugov/person/17868"
        }
    ],
    "description": "Identification of Polymerase III-transcribed elements in genomic sequences.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/Percud/Pol3scan"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "note": "indentification of Polymerase III-transcribed elements in genomic sequences",
            "operation": [
                {
                    "term": "Nucleic acid feature detection",
                    "uri": "http://edamontology.org/operation_0415"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Percud/Pol3scan.git",
    "lastUpdate": "2024-11-25T14:23:37.253422Z",
    "name": "Pol3scan",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "ELIXIR-ITA-PARMA",
    "publication": [
        {
            "doi": "10.1093/nar/22.7.1247",
            "metadata": {
                "abstract": "A linear method for the search of eukaryotic nuclear tRNA genes in DNA databases is described. Based on a modified version of the general weight matrix procedure, our algorithm relies on the recognition of two intragenlc control regions known as A and B boxes, a transcription termination signal, and on the evaluation of the spacing between these elements. The scanning of the eukaryotic nuclear DNA database using this search algorithm correctly identified 933 of the 940 known tRNA genes (0.74% of false negatives). Thirty new potential tRNA genes were identified, and the transcriptional activity of two of them was directly verified by in vitro transcription. The total false positive rate of the algorithm was 0.014%. Structurally unusual tRNA genes, like those coding for selenocysteine tRNAs, could also be recognized using a set of rules concerning their specific properties, and one human gene coding for such tRNA was identified. Some of the newly identified tRNA genes were found in rather uncommon genomic positions: 2 in centromerlc regions and 3 within introns. Furthermore, the presence of extragenically located B boxes in tRNA genes from various organisms could be detected through a specific subroutine of the standard search program. © 1994 Oxford University Press.",
                "authors": [
                    {
                        "name": "Bolchi A."
                    },
                    {
                        "name": "Conterio F."
                    },
                    {
                        "name": "Dieci G."
                    },
                    {
                        "name": "Ottonello S."
                    },
                    {
                        "name": "Pavesi A."
                    }
                ],
                "citationCount": 89,
                "date": "1994-04-11T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "Identification of new eukaryotic tRNA genes in genomic DNA databases by a multistep weight matrix anaylsis of transcriptional control regions"
            },
            "pmcid": "PMC523650",
            "pmid": "8165140",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Sequence sites, features and motifs",
            "uri": "http://edamontology.org/topic_0160"
        }
    ],
    "validated": 1,
    "version": [
        "1"
    ]
}
