{
    "additionDate": "2020-01-09T17:30:12Z",
    "biotoolsCURIE": "biotools:iRNA-m7G",
    "biotoolsID": "iRNA-m7G",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "chenweiimu@gmail.com",
            "name": "Wei Chen",
            "typeEntity": "Person"
        },
        {
            "email": "hlin@uestc.edu.cn",
            "name": "Hao Lin",
            "typeEntity": "Person"
        }
    ],
    "description": "Identifying N7-methylguanosine Sites by Fusing Multiple Features.\n\nN7-methylguanosine (m7G) is an essential RNA modification and participates in a series of biological processes. However, our knowledge about its biological functions is very limited. In order to reveal its new functions, it is necessary to develop various methods to identify m7G sites. Since experimental methods to detect m7G sites are still expensive, we proposed the first computational method, called iRNA-m7G, to detect m7G sites in Homo Sapiens. iRNA-m7G is developed by fusing multiple features, i.e., nucleotide property & frequency, pseudo dinucleotide composition, and secondary structure composition. The framework of iRNA-m7G is shown as following",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "RNA secondary structure alignment",
                    "uri": "http://edamontology.org/operation_0502"
                },
                {
                    "term": "RNA secondary structure prediction",
                    "uri": "http://edamontology.org/operation_0278"
                },
                {
                    "term": "Structure visualisation",
                    "uri": "http://edamontology.org/operation_0570"
                }
            ]
        }
    ],
    "homepage": "http://lin-group.cn/server/iRNA-m7G/",
    "lastUpdate": "2020-12-14T13:21:27Z",
    "name": "iRNA-m7G",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1016/J.OMTN.2019.08.022",
            "metadata": {
                "abstract": "© 2019 The AuthorsAs an essential post-transcriptional modification, N7-methylguanosine (m7G) regulates nearly every step of the life cycle of mRNA. Accurate identification of the m7G site in the transcriptome will provide insights into its biological functions and mechanisms. Although the m7G-methylated RNA immunoprecipitation sequencing (MeRIP-seq) method has been proposed in this regard, it is still cost-ineffective for detecting the m7G site. Therefore, it is urgent to develop new methods to identify the m7G site. In this work, we developed the first computational predictor called iRNA-m7G to identify m7G sites in the human transcriptome. The feature fusion strategy was used to integrate both sequence- and structure-based features. In the jackknife test, iRNA-m7G obtained an accuracy of 89.88%. The superiority of iRNA-m7G for identifying m7G sites was also demonstrated by comparing with other methods. We hope that iRNA-m7G can become a useful tool to identify m7G sites. A user-friendly web server for iRNA-m7G is freely accessible at http://lin-group.cn/server/iRNA-m7G/.",
                "authors": [
                    {
                        "name": "Chen W."
                    },
                    {
                        "name": "Feng P."
                    },
                    {
                        "name": "Lin H."
                    },
                    {
                        "name": "Lv H."
                    },
                    {
                        "name": "Song X."
                    }
                ],
                "citationCount": 35,
                "date": "2019-12-06T00:00:00Z",
                "journal": "Molecular Therapy - Nucleic Acids",
                "title": "iRNA-m7G: Identifying N7-methylguanosine Sites by Fusing Multiple Features"
            },
            "pmcid": "PMC6796804",
            "pmid": "31581051"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ],
    "validated": 1
}
