{
    "additionDate": "2021-01-18T06:59:17Z",
    "biotoolsCURIE": "biotools:aidd",
    "biotoolsID": "aidd",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "opiontki@kent.edu",
            "name": "Helen Piontkivska",
            "typeEntity": "Person"
        }
    ],
    "description": "Automated Isoform Diversity Detector (AIDD) is pipeline for investigating transcriptome diversity of RNA-seq data. AIDD incorporates open source tools into a static virtualbox to ensure reproducability in RNA-seq analysis. AIDD explores editome by mapping both ADAR and APOBEC editing sites on a global and local level and produces publication ready visualization of ADAR editing landscapes.",
    "download": [
        {
            "type": "Source code",
            "url": "https://github.com/RNAdetective/AIDD/tree/master/AIDD_supplFiles.ST1-8_and_SF1"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Editing",
                    "uri": "http://edamontology.org/operation_3096"
                },
                {
                    "term": "RNA-Seq analysis",
                    "uri": "http://edamontology.org/operation_3680"
                },
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                }
            ]
        }
    ],
    "homepage": "https://github.com/RNAdetective/AIDD",
    "language": [
        "Shell",
        "R"
    ],
    "lastUpdate": "2021-01-21T15:18:41Z",
    "name": "AIDD",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1101/2020.01.22.915348"
        },
        {
            "doi": "10.1186/s12859-020-03888-6",
            "metadata": {
                "abstract": "© 2020, The Author(s).Background: As the number of RNA-seq datasets that become available to explore transcriptome diversity increases, so does the need for easy-to-use comprehensive computational workflows. Many available tools facilitate analyses of one of the two major mechanisms of transcriptome diversity, namely, differential expression of isoforms due to alternative splicing, while the second major mechanism—RNA editing due to post-transcriptional changes of individual nucleotides—remains under-appreciated. Both these mechanisms play an essential role in physiological and diseases processes, including cancer and neurological disorders. However, elucidation of RNA editing events at transcriptome-wide level requires increasingly complex computational tools, in turn resulting in a steep entrance barrier for labs who are interested in high-throughput variant calling applications on a large scale but lack the manpower and/or computational expertise. Results: Here we present an easy-to-use, fully automated, computational pipeline (Automated Isoform Diversity Detector, AIDD) that contains open source tools for various tasks needed to map transcriptome diversity, including RNA editing events. To facilitate reproducibility and avoid system dependencies, the pipeline is contained within a pre-configured VirtualBox environment. The analytical tasks and format conversions are accomplished via a set of automated scripts that enable the user to go from a set of raw data, such as fastq files, to publication-ready results and figures in one step. A publicly available dataset of Zika virus-infected neural progenitor cells is used to illustrate AIDD’s capabilities. Conclusions: AIDD pipeline offers a user-friendly interface for comprehensive and reproducible RNA-seq analyses. Among unique features of AIDD are its ability to infer RNA editing patterns, including ADAR editing, and inclusion of Guttman scale patterns for time series analysis of such editing landscapes. AIDD-based results show importance of diversity of ADAR isoforms, key RNA editing enzymes linked with the innate immune system and viral infections. These findings offer insights into the potential role of ADAR editing dysregulation in the disease mechanisms, including those of congenital Zika syndrome. Because of its automated all-inclusive features, AIDD pipeline enables even a novice user to easily explore common mechanisms of transcriptome diversity, including RNA editing landscapes.",
                "authors": [
                    {
                        "name": "Plonski N.-M."
                    },
                    {
                        "name": "Johnson E."
                    },
                    {
                        "name": "Frederick M."
                    },
                    {
                        "name": "Mercer H."
                    },
                    {
                        "name": "Fraizer G."
                    },
                    {
                        "name": "Meindl R."
                    },
                    {
                        "name": "Casadesus G."
                    },
                    {
                        "name": "Piontkivska H."
                    }
                ],
                "date": "2020-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Automated Isoform Diversity Detector (AIDD): a pipeline for investigating transcriptome diversity of RNA-seq data"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Workflow"
    ],
    "topic": [
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        },
        {
            "term": "Neurology",
            "uri": "http://edamontology.org/topic_3334"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        }
    ],
    "validated": 1
}