{
    "additionDate": "2017-08-03T18:49:09Z",
    "biotoolsCURIE": "biotools:mdpfinder",
    "biotoolsID": "mdpfinder",
    "credit": [
        {
            "email": "zsh@amss.ac.cn",
            "name": "Shihua Zhang's Lab",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://page.amss.ac.cn/shihua.zhang/"
        }
    ],
    "description": "Package for identifying driver pathways promoting cancer proliferation and filtering out the unfunctional and passenger ones.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://page.amss.ac.cn/shihua.zhang/software.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Pathway or network prediction",
                    "uri": "http://edamontology.org/operation_3439"
                }
            ]
        }
    ],
    "homepage": "http://page.amss.ac.cn/shihua.zhang/software.html",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2018-12-10T12:58:51Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/mdpfinder-mutated-driver-pathway-finder.html"
        }
    ],
    "name": "MDPFinder",
    "operatingSystem": [
        "Linux",
        "Windows"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Motivation: The first step for clinical diagnostics, prognostics and targeted therapeutics of cancer is to comprehensively understand its molecular mechanisms. Large-scale cancer genomics projects are providing a large volume of data about genomic, epigenomic and gene expression aberrations in multiple cancer types. One of the remaining challenges is to identify driver mutations, driver genes and driver pathways promoting cancer proliferation and filter out the unfunctional and passenger ones.Results: In this study, we propose two methods to solve the so-called maximum weight submatrix problem, which is designed to de novo identify mutated driver pathways from mutation data in cancer. The first one is an exact method that can be helpful for assessing other approximate or/and heuristic algorithms. The second one is a stochastic and flexible method that can be employed to incorporate other types of information to improve the first method. Particularly, we propose an integrative model to combine mutation and expression data. We first apply our methods onto simulated data to show their efficiency. We further apply the proposed methods onto several real biological datasets, such as the mutation profiles of 74 head and neck squamous cell carcinomas samples, 90 glioblastoma tumor samples and 313 ovarian carcinoma samples. The gene expression profiles were also considered for the later two data. The results show that our integrative model can identify more biologically relevant gene sets. We have implemented all these methods and made a package called mutated driver pathway finder, which can be easily used for other researchers. © 2012 The Author.",
                "authors": [
                    {
                        "name": "Zhao J."
                    },
                    {
                        "name": "Zhang S."
                    },
                    {
                        "name": "Wu L.-Y."
                    },
                    {
                        "name": "Zhang X.-S."
                    }
                ],
                "citationCount": 106,
                "date": "2012-11-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Efficient methods for identifying mutated driver pathways in cancer"
            },
            "pmid": "22982574"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Systems biology",
            "uri": "http://edamontology.org/topic_2259"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ],
    "validated": 1
}