{
    "additionDate": "2017-02-10T14:14:22Z",
    "biotoolsCURIE": "biotools:dnamate",
    "biotoolsID": "dnamate",
    "credit": [
        {
            "email": "fmelo@bio.puc.cl",
            "name": "Francisco Melo Ledermann",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "dnaMATE calculates a consensus melting temperature (Tm) for any given short DNA sequence (16-30 nts) based on three independent thermodynamic data tables.   Stand-alone version available, list of other melting temperature calculation servers also provided.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://melolab.org/dnaMATE/about.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Nucleic acid thermodynamic property calculation",
                    "uri": "http://edamontology.org/operation_0455"
                }
            ]
        }
    ],
    "homepage": "http://melolab.org/dnaMATE/",
    "lastUpdate": "2018-12-10T12:58:56Z",
    "name": "dnaMATE",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "An accurate and robust large-scale melting temperature prediction server for short DNA sequences is dispatched. The server calculates a consensus melting temperature value using the nearest-neighbor model based on three independent thermodynamic data tables. The consensus method gives an accurate prediction of melting temperature, as it has been recently demonstrated in a benchmark performed using all available experimental data for DNA sequences within the length range of 16-30 nt. This constitutes the first web server that has been implemented to perform a large-scale calculation of melting temperatures in real time (up to 5000 DNA sequences can be submitted in a single run). The expected accuracy of calculations carried out by this server in the range of 50-600 mM monovalent salt concentration is that 89% of the melting temperature predictions will have an error or deviation of <5°C from experimental data. The server can be freely accessed at http:// dna.bio.puc.cl/tm.html. The standalone executable versions of this software for LINUX, Macintosh and Windows platforms are also freely available at the same web site. Detailed further information supporting this server is available at the same web site referenced above. © 2005 Oxford University Press.",
                "authors": [
                    {
                        "name": "Melo F."
                    },
                    {
                        "name": "Norambuena T."
                    },
                    {
                        "name": "Panjkovich A."
                    }
                ],
                "citationCount": 16,
                "date": "2005-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "dnaMATE: A consensus melting temperature prediction server for short DNA sequences"
            },
            "pmid": "15980538"
        },
        {
            "metadata": {
                "abstract": "Motivation: The overall performance of several molecular biology techniques involving DNA/DNA hybridization depends on the accurate prediction of the experimental value of a critical parameter: the melting temperature Tm. Till date, many computer software programs based on different methods and/or parameterizations are available for the theoretical estimation of the experimental Tm value of any given short oligonucleotide sequence. However, in most cases, large and significant differences in the estimations of Tm were obtained while using different methods. Thus, it is difficult to decide which Tm value is the accurate one. In addition, it seems that most people who use these methods are unaware about the limitations, which are well described in the literature but not stated properly or restricted the inputs of most of the web servers and standalone software programs that implement them. Results: A quantitative comparison on the similarities and differences among some of the published DNA/DNA Tm calculation methods is reported. The comparison was carried out for a large set of short oligonucleotide sequences ranging from 16 to 30 nt long, which span the whole range of CG-content. The results showed that significant differences were observed in all the methods, which in some cases depend on the oligonucleotide length and CG-content in a non-trivial manner. Based on these results, the regions of consensus and disagreement for the methods in the oligonucleotide feature space were reported. Owing to the lack of sufficient experimental data, a fair and complete assessment of accuracy for the different methods is not yet possible. Inspite of this limitation, a consensus Tm with minimal error probability was calculated by averaging the values obtained from two or more methods that exhibit similar behavior to each particular combination of oligonucleotide length and CG-content class. Using a total of 348 DNA sequences in the size range between 16mer and 30mer, for which the experimental Tm data are available, we demonstrated that the consensus Tm is a robust and accurate measure. It is expected that the results of this work would be constituted as a useful set of guidelines to be followed for the successful experimental implementation of various molecular biology techniques, such as quantitative PCR, multiplex PCR and the design of optimal DNA microarrays. © The Author 2004. Published by Oxford University Press. All rights reserved.",
                "authors": [
                    {
                        "name": "Melo F."
                    },
                    {
                        "name": "Panjkovich A."
                    }
                ],
                "citationCount": 64,
                "date": "2005-03-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Comparison of different melting temperature calculation methods for short DNA sequences"
            },
            "pmid": "15501913"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Nucleic acid structure analysis",
            "uri": "http://edamontology.org/topic_0097"
        }
    ],
    "validated": 1
}
