{
    "additionDate": "2021-12-13T12:46:20.226979Z",
    "biotoolsCURIE": "biotools:vcf2caps",
    "biotoolsID": "vcf2caps",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "marek.szklarczyk@urk.edu.pl",
            "name": "Marek Szklarczyk",
            "orcidid": "https://orcid.org/0000-0003-1925-8178",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "VCF2CAPS is a VCF file analysis tool for CAPS marker development. The software facilitates the conversion of a large number of single nucleotide polymorphisms (SNPs), multiple nucleotide polymorphisms (MNPs) and insertion/deletion (indel) polymorphisms detected by SNP calling tools, e.g. SAMtools, Platypus or FreeBayes, into CAPS markers.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "SNP detection",
                    "uri": "http://edamontology.org/operation_0484"
                },
                {
                    "term": "Indel detection",
                    "uri": "http://edamontology.org/operation_0452"
                },
                {
                    "term": "PCR primer design",
                    "uri": "http://edamontology.org/operation_0308"
                },
                {
                    "term": "Genetic mapping",
                    "uri": "http://edamontology.org/operation_0282"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Aviatore/vcf2caps",
    "language": [
        "Perl"
    ],
    "lastUpdate": "2021-12-13T12:46:20.229709Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/Aviatore/vcf2caps/issues"
        }
    ],
    "name": "VCF2CAPS",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PCBI.1008980",
            "metadata": {
                "abstract": "© 2021 Wesołowski et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Next-generation sequencing (NGS) is a powerful tool for massive detection of DNA sequence variants such as single nucleotide polymorphisms (SNPs), multi-nucleotide polymorphisms (MNPs) and insertions/deletions (indels). For routine screening of numerous samples, these variants are often converted into cleaved amplified polymorphic sequence (CAPS) markers which are based on the presence versus absence of restriction sites within PCR products. Current computational tools for SNP to CAPS conversion are limited and usually infeasible to use for large datasets as those generated with NGS. Moreover, there is no available tool for massive conversion of MNPs and indels into CAPS markers. Here, we present VCF2CAPS–a new software for identification of restriction endonucleases that recognize SNP/MNP/indel-containing sequences from NGS experiments. Additionally, the program contains filtration utilities not available in other SNP to CAPS converters–selection of markers with a single polymorphic cut site within a user-specified sequence length, and selection of markers that differentiate up to three user-defined groups of individuals from the analyzed population. Performance of VCF2CAPS was tested on a thoroughly analyzed dataset from a genotyping-by-sequencing (GBS) experiment. A selection of CAPS markers picked by the program was subjected to experimental verification. CAPS markers, also referred to as PCR-RFLPs, belong to basic tools exploited in plant, animal and human genetics. Our new software–VCF2CAPS–fills the gap in the current inventory of genetic software by high-throughput CAPS marker design from next-generation sequencing (NGS) data. The program should be of interest to geneticists involved in molecular diagnostics. In this paper we show a successful exemplary application of VCF2CAPS and we believe that its usefulness is guaranteed by the growing availability of NGS services.",
                "authors": [
                    {
                        "name": "Wesolowski W."
                    },
                    {
                        "name": "Domnicz B."
                    },
                    {
                        "name": "Augustynowicz J."
                    },
                    {
                        "name": "Szklarczyk M."
                    }
                ],
                "date": "2021-05-20T00:00:00Z",
                "journal": "PLoS Computational Biology",
                "title": "VCF2CAPS–A high-throughput CAPS marker design from VCF files and its test-use on a genotyping-by-sequencing (GBS) dataset"
            },
            "pmid": "34014924",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "PCR experiment",
            "uri": "http://edamontology.org/topic_3519"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        }
    ]
}