{
    "additionDate": "2019-11-06T11:29:56Z",
    "biotoolsCURIE": "biotools:KisSplice",
    "biotoolsID": "KisSplice",
    "description": "KisSplice is a software that enables to analyse RNA-seq data with or without a reference genome.",
    "editPermission": {
        "authors": [
            "alexcorm"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Transcriptome assembly",
                    "uri": "http://edamontology.org/operation_3258"
                },
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                }
            ]
        }
    ],
    "homepage": "http://kissplice.prabi.fr",
    "lastUpdate": "2024-11-24T15:18:29.063425Z",
    "name": "KisSplice",
    "owner": "jison",
    "publication": [
        {
            "doi": "10.1186/1471-2105-13-s6-s5",
            "metadata": {
                "abstract": "Background: In this paper, we address the problem of identifying and quantifying polymorphisms in RNA-seq data when no reference genome is available, without assembling the full transcripts. Based on the fundamental idea that each polymorphism corresponds to a recognisable pattern in a De Bruijn graph constructed from the RNA-seq reads, we propose a general model for all polymorphisms in such graphs. We then introduce an exact algorithm, called KISSPLICE, to extract alternative splicing events. Results: We show that KISSPLICE enables to identify more correct events than general purpose transcriptome assemblers. Additionally, on a 71 M reads dataset from human brain and liver tissues, KISSPLICE identified 3497 alternative splicing events, out of which 56% are not present in the annotations, which confirms recent estimates showing that the complexity of alternative splicing has been largely underestimated so far. Conclusions: We propose new models and algorithms for the detection of polymorphism in RNA-seq data. This opens the way to a new kind of studies on large HTS RNA-seq datasets, where the focus is not the global reconstruction of full-length transcripts, but local assembly of polymorphic regions. KISSPLICE is available for download at http://alcovna.genouest.org/kissplice/. © 2012 Sacomoto et al.",
                "authors": [
                    {
                        "name": "Antoniou P."
                    },
                    {
                        "name": "Chikhi R."
                    },
                    {
                        "name": "Kielbassa J."
                    },
                    {
                        "name": "Lacroix V."
                    },
                    {
                        "name": "Peterlongo P."
                    },
                    {
                        "name": "Sacomoto G.A.T."
                    },
                    {
                        "name": "Sagot M.F."
                    },
                    {
                        "name": "Uricaru R."
                    }
                ],
                "citationCount": 82,
                "date": "2012-04-19T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Kissplice: De-novo calling alternative splicing events from RNA-seq data"
            },
            "pmcid": "PMC3358658",
            "pmid": "22537044"
        }
    ],
    "topic": [
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ],
    "validated": 1
}
