{
    "additionDate": "2018-08-03T15:08:35Z",
    "biotoolsCURIE": "biotools:braintown",
    "biotoolsID": "braintown",
    "credit": [
        {
            "email": "Michael.Smirnov@mpfi.org",
            "name": "Michael S. Smirnov",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Analysis and automatic identification of dendritic spines using machine learning.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                }
            ]
        }
    ],
    "homepage": "https://github.com/mikeusru/Braintown",
    "lastUpdate": "2018-12-10T12:59:00Z",
    "name": "Braintown",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1371/journal.pone.0199589",
            "metadata": {
                "abstract": "© 2018 Smirnov et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Synaptic plasticity, the cellular basis for learning and memory, is mediated by a complex biochemical network of signaling proteins. These proteins are compartmentalized in dendritic spines, the tiny, bulbous, post-synaptic structures found on neuronal dendrites. The ability to screen a high number of molecular targets for their effect on dendritic spine structural plasticity will require a high-throughput imaging system capable of stimulating and monitoring hundreds of dendritic spines in various conditions. For this purpose, we present a program capable of automatically identifying dendritic spines in live, fluorescent tissue. Our software relies on a machine learning approach to minimize any need for parameter tuning from the user. Custom thresholding and binarization functions serve to “clean” fluorescent images, and a neural network is trained using features based on the relative shape of the spine perimeter and its corresponding dendritic backbone. Our algorithm is rapid, flexible, has over 90% accuracy in spine detection, and bundled with our user-friendly, open-source, MATLAB-based software package for spine analysis.",
                "authors": [
                    {
                        "name": "Smirnov M.S."
                    },
                    {
                        "name": "Garrett T.R."
                    },
                    {
                        "name": "Yasuda R."
                    }
                ],
                "citationCount": 2,
                "date": "2018-07-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "An open-source tool for analysis and automatic identification of dendritic spines using machine learning"
            },
            "pmcid": "PMC6033424",
            "pmid": "29975722"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Biological imaging",
            "uri": "http://edamontology.org/topic_3383"
        }
    ],
    "validated": 1
}