{
    "additionDate": "2018-05-08T15:39:27Z",
    "biotoolsCURIE": "biotools:ematchsite",
    "biotoolsID": "ematchsite",
    "credit": [
        {
            "email": "michal@brylinski.org",
            "name": "Brylinski M.",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Sequence Order-Independent Structure Alignments of Ligand Binding Pockets in Protein Models.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://brylinski.cct.lsu.edu/content/ematchsite-manual"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Local structure alignment",
                    "uri": "http://edamontology.org/operation_0509"
                }
            ]
        }
    ],
    "homepage": "http://brylinski.cct.lsu.edu/ematchsite",
    "homepage_status": 1,
    "language": [
        "C++"
    ],
    "lastUpdate": "2018-12-10T12:58:58Z",
    "name": "eMatchSite",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PCBI.1003829",
            "metadata": {
                "abstract": "© 2014 Michal Brylinski.Detecting similarities between ligand binding sites in the absence of global homology between target proteins has been recognized as one of the critical components of modern drug discovery. Local binding site alignments can be constructed using sequence order-independent techniques, however, to achieve a high accuracy, many current algorithms for binding site comparison require high-quality experimental protein structures, preferably in the bound conformational state. This, in turn, complicates proteome scale applications, where only various quality structure models are available for the majority of gene products. To improve the state-of-the-art, we developed eMatchSite, a new method for constructing sequence order-independent alignments of ligand binding sites in protein models. Large-scale benchmarking calculations using adenine-binding pockets in crystal structures demonstrate that eMatchSite generates accurate alignments for almost three times more protein pairs than SOIPPA. More importantly, eMatchSite offers a high tolerance to structural distortions in ligand binding regions in protein models. For example, the percentage of correctly aligned pairs of adenine-binding sites in weakly homologous protein models is only 4–9% lower than those aligned using crystal structures. This represents a significant improvement over other algorithms, e.g. the performance of eMatchSite in recognizing similar binding sites is 6% and 13% higher than that of SiteEngine using high- and moderate-quality protein models, respectively. Constructing biologically correct alignments using predicted ligand binding sites in protein models opens up the possibility to investigate drug-protein interaction networks for complete proteomes with prospective systems-level applications in polypharmacology and rational drug repositioning. eMatchSite is freely available to the academic community as a web-server and a stand-alone software distribution at http://www.brylinski.org/ematchsite.",
                "authors": [
                    {
                        "name": "Brylinski M."
                    }
                ],
                "citationCount": 20,
                "date": "2014-01-01T00:00:00Z",
                "journal": "PLoS Computational Biology",
                "title": "eMatchSite: Sequence Order-Independent Structure Alignments of Ligand Binding Pockets in Protein Models"
            },
            "pmcid": "PMC4168975",
            "pmid": "25232727"
        }
    ],
    "toolType": [
        "Command-line tool",
        "Web application"
    ],
    "topic": [
        {
            "term": "Molecular modelling",
            "uri": "http://edamontology.org/topic_2275"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "Structure analysis",
            "uri": "http://edamontology.org/topic_0081"
        }
    ],
    "validated": 1
}