{
    "additionDate": "2021-03-19T08:30:35Z",
    "biotoolsCURIE": "biotools:dadia",
    "biotoolsID": "dadia",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "thuan@chem.ubc.ca",
            "name": "Tao Huan",
            "orcidid": "https://orcid.org/0000-0001-6295-2435",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "DaDIA is a LC-MS feature extraction and annotation workflow in R.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Feature extraction",
                    "uri": "http://edamontology.org/operation_3937"
                },
                {
                    "term": "Natural product identification",
                    "uri": "http://edamontology.org/operation_3803"
                },
                {
                    "term": "Validation",
                    "uri": "http://edamontology.org/operation_2428"
                },
                {
                    "term": "Peak detection",
                    "uri": "http://edamontology.org/operation_3215"
                },
                {
                    "term": "Retention time prediction",
                    "uri": "http://edamontology.org/operation_3633"
                }
            ]
        }
    ],
    "homepage": "https://github.com/HuanLab/DaDIA.git",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-05-05T08:49:34Z",
    "name": "DaDIA",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1021/ACS.ANALCHEM.0C05022",
            "metadata": {
                "abstract": "© 2021 American Chemical Society.Existing data acquisition modes such as full-scan, data-dependent (DDA), and data-independent acquisition (DIA) often present limited capabilities in capturing metabolic information in liquid chromatography-mass spectrometry (LC-MS)-based metabolomics. In this work, we proposed a novel metabolomic data acquisition workflow that combines DDA and DIA analyses to achieve better metabolomic data quality, including enhanced metabolome coverage, tandem mass spectrometry (MS2) coverage, and MS2 quality. This workflow, named data-dependent-assisted data-independent acquisition (DaDIA), performs untargeted metabolomic analysis of individual biological samples using DIA mode and the pooled quality control (QC) samples using DDA mode. This combination takes advantage of the high-feature number and MS2 spectral coverage of the DIA data and the high MS2 spectral quality of the DDA data. To analyze the heterogeneous DDA and DIA data, we further developed a computational program, DaDIA.R, to automatically extract metabolic features and perform streamlined metabolite annotation of DaDIA data set. Using human urine samples, we demonstrated that the DaDIA workflow delivers remarkably improved data quality when compared to conventional DDA or DIA metabolomics. In particular, both the number of detected features and annotated metabolites were greatly increased. Further biological demonstration using a leukemia metabolomics study also proved that the DaDIA workflow can efficiently detect and annotate around 4 times more significant metabolites than DDA workflow with broad MS2 coverage and high MS2 spectral quality for downstream statistical analysis and biological interpretation. Overall, this work represents a critical development of data acquisition mode in untargeted metabolomics, which can greatly benefit untargeted metabolomics for a wide range of biological applications.",
                "authors": [
                    {
                        "name": "Guo J."
                    },
                    {
                        "name": "Shen S."
                    },
                    {
                        "name": "Xing S."
                    },
                    {
                        "name": "Huan T."
                    }
                ],
                "citationCount": 2,
                "date": "2021-02-02T00:00:00Z",
                "journal": "Analytical Chemistry",
                "title": "DaDIA: Hybridizing Data-Dependent and Data-Independent Acquisition Modes for Generating High-Quality Metabolomic Data"
            },
            "pmid": "33465307"
        }
    ],
    "toolType": [
        "Workflow"
    ],
    "topic": [
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        }
    ]
}