{
    "additionDate": "2018-07-21T10:51:56Z",
    "biotoolsCURIE": "biotools:metabolomicstools",
    "biotoolsID": "metabolomicstools",
    "credit": [
        {
            "email": "christoph.steinbeck@uni-jena.de",
            "name": "Christoph Steinbeck",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Freely-available software tools for metabolomics analysis.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/RASpicer/MetabolomicsTools"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                }
            ]
        }
    ],
    "homepage": "https://github.com/RASpicer/MetabolomicsTools",
    "lastUpdate": "2018-12-10T12:59:00Z",
    "name": "MetabolomicsTools",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1007/s11306-017-1242-7",
            "metadata": {
                "abstract": "© 2017, The Author(s).Introduction: The field of metabolomics has expanded greatly over the past two decades, both as an experimental science with applications in many areas, as well as in regards to data standards and bioinformatics software tools. The diversity of experimental designs and instrumental technologies used for metabolomics has led to the need for distinct data analysis methods and the development of many software tools. Objectives: To compile a comprehensive list of the most widely used freely available software and tools that are used primarily in metabolomics. Methods: The most widely used tools were selected for inclusion in the review by either ≥ 50 citations on Web of Science (as of 08/09/16) or the use of the tool being reported in the recent Metabolomics Society survey. Tools were then categorised by the type of instrumental data (i.e. LC–MS, GC–MS or NMR) and the functionality (i.e. pre- and post-processing, statistical analysis, workflow and other functions) they are designed for. Results: A comprehensive list of the most used tools was compiled. Each tool is discussed within the context of its application domain and in relation to comparable tools of the same domain. An extended list including additional tools is available at https://github.com/RASpicer/MetabolomicsTools which is classified and searchable via a simple controlled vocabulary. Conclusion: This review presents the most widely used tools for metabolomics analysis, categorised based on their main functionality. As future work, we suggest a direct comparison of tools’ abilities to perform specific data analysis tasks e.g. peak picking.",
                "authors": [
                    {
                        "name": "Canueto D."
                    },
                    {
                        "name": "Moreno P."
                    },
                    {
                        "name": "Salek R.M."
                    },
                    {
                        "name": "Spicer R."
                    },
                    {
                        "name": "Steinbeck C."
                    }
                ],
                "citationCount": 104,
                "date": "2017-09-01T00:00:00Z",
                "journal": "Metabolomics",
                "title": "Navigating freely-available software tools for metabolomics analysis"
            },
            "pmcid": "PMC5550549",
            "pmid": "28890673"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Endocrinology and metabolism",
            "uri": "http://edamontology.org/topic_3407"
        },
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        }
    ],
    "validated": 1
}
