{
    "accessibility": "Open access",
    "additionDate": "2021-12-07T00:01:51.667467Z",
    "biotoolsCURIE": "biotools:howru",
    "biotoolsID": "howru",
    "collectionID": [
        "COVID-19"
    ],
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "kassthomas4@gmail.com",
            "name": "Kathleen A. S. Thomas",
            "orcidid": "https://orcid.org/0000-0001-8189-5042",
            "typeEntity": "Person"
        },
        {
            "name": "Agatha T. Fryday"
        },
        {
            "name": "Bernadine F. O’Brien"
        },
        {
            "name": "Ellen C. Robinson"
        }
    ],
    "description": "Developing an Innovative System of Open and Flexible, Patient-Family-Centered, Virtual Visiting in ICU During the COVID-19 Pandemic.",
    "editPermission": {
        "type": "private"
    },
    "homepage": "https://www.taleka.com/howru/",
    "lastUpdate": "2021-12-07T00:02:03.823154Z",
    "name": "HowRU",
    "operatingSystem": [
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1177/08850666211030845",
            "metadata": {
                "abstract": "© The Author(s) 2021.Few challenges of the COVID-19 pandemic strike at the very core of our humanity as the inability of family to sit at the bedside of their loved ones when battling for their lives in the ICU. Virtual visiting is one tool to help deal with this challenge. When introducing virtual visiting into our ICU, we identified 5 criteria for a sustainable system that aligned with patient-family-centered care: virtual visiting needed to (1) simulate open and flexible visiting; (2) be able to accommodate differences in family size, dynamics, and cultural practices; (3) utilize a video conferencing platform that is private and secure; (4) be easy to use and not require special teams to facilitate meetings; and (5) not increase the workload of ICU staff. There is a growing body of literature demonstrating a global movement toward virtual visiting in ICU, however there are no publications that describe a system which meet all 5 of our criteria. Importantly, there are no papers describing systems of virtual visiting which mimic open and flexible family presence at the bedside. We were unable to find any off-the-shelf video conferencing platforms that met all our criteria. To come up with a solution, a multidisciplinary team of ICU staff partnered with healthcare technology adoption consultants and two technology companies to develop an innovative system called HowRU. HowRU uses the video conferencing platform Webex with the integration of some newly designed software that automates many of the laborious and complex processes. HowRU is a cloud based, supported, and simplified system that closely simulates open and flexible visiting while ensuring patient and family privacy, dignity, and security. We have demonstrated the transferability of HowRU by implanting it into a second ICU. HowRU is now commercially available internationally. We hope HowRU will improve patient-family-centered care in ICU.",
                "authors": [
                    {
                        "name": "Chadwick A."
                    },
                    {
                        "name": "Davey-Quinn A.P."
                    },
                    {
                        "name": "Fleming K.J."
                    },
                    {
                        "name": "Fryday A.T."
                    },
                    {
                        "name": "Hales M.J.L."
                    },
                    {
                        "name": "Karipidis S."
                    },
                    {
                        "name": "O'Brien B.F."
                    },
                    {
                        "name": "Robinson E.C."
                    },
                    {
                        "name": "Thomas K.A.S."
                    }
                ],
                "date": "2021-10-01T00:00:00Z",
                "journal": "Journal of Intensive Care Medicine",
                "title": "Developing an Innovative System of Open and Flexible, Patient-Family-Centered, Virtual Visiting in ICU During the COVID-19 Pandemic: A Collaboration of Staff, Patients, Families, and Technology Companies"
            },
            "pmcid": "PMC8311505",
            "pmid": "34291683"
        }
    ],
    "topic": [
        {
            "term": "Critical care medicine",
            "uri": "http://edamontology.org/topic_3403"
        },
        {
            "term": "Data security",
            "uri": "http://edamontology.org/topic_3263"
        },
        {
            "term": "Literature and language",
            "uri": "http://edamontology.org/topic_3068"
        },
        {
            "term": "Physics",
            "uri": "http://edamontology.org/topic_3318"
        }
    ],
    "validated": 1
}
