{"credit":[{"email":"reptar.adm@ekmd.huji.ac.il","name":"RepTar Admin","typeEntity":"Person","typeRoles":["Primary contact"]}],"function":[{"operation":[{"term":"microRNA detection","uri":"http://edamontology.org/operation_0463"},{"term":"Protein subcellular localisation prediction","uri":"http://edamontology.org/operation_2489"},{"term":"Protein binding site prediction","uri":"http://edamontology.org/operation_2575"},{"term":"Query and retrieval","uri":"http://edamontology.org/operation_0224"}]}],"labels":{"toolType":["Database portal"],"topic":[{"term":"Functional, regulatory and non-coding RNA","uri":"http://edamontology.org/topic_0659"},{"term":"Small molecules","uri":"http://edamontology.org/topic_0154"},{"term":"Sequence sites, features and motifs","uri":"http://edamontology.org/topic_0160"}]},"publication":[{"abstract":"Computational identification of putative microRNA (miRNA) targets is an important step towards elucidating miRNA functions. Several miRNA target-prediction algorithms have been developed followed by publicly available databases of these predictions. Here we present a new database offering miRNA target predictions of several binding types, identified by our recently developed modular algorithm RepTar. RepTar is based on identification of repetitive elements in 30-UTRs and is independent of both evolutionary conservation and conventional binding patterns (i.e. Watson-Crick pairing of 'seed' regions). The modularity of RepTar enables the prediction of targets with conventional seed sites as well as rarer targets with non-conventional sites, such as sites with seed wobbles (G-U pairing in the seed region), 30-compensatory sites and the newly discovered centered sites. Furthermore, RepTar's independence of conservation enables the prediction of cellular targets of the less evolutionarily conserved viral miRNAs. Thus, the RepTar database contains genome-wide predictions of human and mouse miRNAs as well as predictions of cellular targets of human and mouse viral miRNAs. These predictions are presented in a user-friendly database, which allows browsing through the putative sites as well as conducting simple and advanced queries including data intersections of various types. The RepTar database is available at http:// reptar.ekmd.huji.ac.il. © The Author(s) 2010.","authors":["Elefant N.","Berger A.","Shein H.","Hofree M.","Margalit H.","Altuvia Y."],"cit_count":35,"journal":"Nucleic Acids Research","pmid":"21149264","title":"RepTar: A database of predicted cellular targets of host and viral miRNAs","year":"2011-01-01"}],"summary":{"biotoolsCURIE":"biotools:reptar","biotoolsID":"reptar","description":"RepTar is a database of miRNA target predictions, based on the RepTar algorithm that is independent of evolutionary conservation considerations and is not limited to seed pairing sites.","homepage":"http://reptar.ekmd.huji.ac.il","name":"RepTar"}}