{
    "accessibility": "Open access",
    "additionDate": "2024-01-12T09:02:35.781350Z",
    "biotoolsCURIE": "biotools:jnplots",
    "biotoolsID": "jnplots",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "ken.toyama@mail.utoronto.ca",
            "name": "Ken S. Toyama",
            "typeEntity": "Person"
        }
    ],
    "description": "R package to visualize outputs from the Johnson-Neyman technique for categorical and continuous moderators, including options for phylogenetic regressions.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Phylogenetic analysis",
                    "uri": "http://edamontology.org/operation_0324"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://cran.r-project.org/web/packages/JNplots/",
    "language": [
        "R"
    ],
    "lastUpdate": "2024-01-12T09:02:35.783954Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/kenstoyama/JNplots"
        }
    ],
    "name": "JNplots",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1007/s10682-023-10281-1",
            "metadata": {
                "abstract": "The analysis of two-way interactions in linear models is common in the fields of ecology and evolution, being often present in allometric, macroevolutionary, and experimental studies, among others. However, the interpretation of significant interactions can be incomplete when limited to the examination of model coefficients and significance tests. The Johnson–Neyman technique represents a step forward in the interpretation of significant two-way interactions, allowing the user to examine how changes in the moderator variable, it being categorical or continuous, affect the significance of the relationship between the dependent variable and the predictor. Despite its implementation in several software since its initial development, the available options to perform the method lack certain functionality aspects, including the visualization of regions of non-significance when the moderator is categorical, the implementation of phylogenetic corrections, and more intuitive graphical outputs. Here I present the R package JNplots, which aims to fill gaps left by previous software regarding the calculation and visualization of regions of non-significance when fitting two-way interaction models. JNplots includes two basic functions which allow the user to investigate different types of interaction models, including cases where the moderator variable is categorical or continuous. The user can also specify whether the model to explore should be phylogenetically informed and choose a particular phylogenetic correlation structure to be used. Finally, the functions of JNplots produce plots that are largely customizable and allow a more intuitive interpretation of the interaction term. Here I provide a walkthrough on the use of JNplots using three different examples based on empirical data, each representing a different common scenario in which the package can be useful. Additionally, I present the different customization options for the graphical outputs of JNplots.",
                "authors": [
                    {
                        "name": "Toyama K.S."
                    }
                ],
                "date": "2023-01-01T00:00:00Z",
                "journal": "Evolutionary Ecology",
                "title": "J Nplots: an R package to visualize outputs from the Johnson–Neyman technique for categorical and continuous moderators, including options for phylogenetic regressions"
            }
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Ecology",
            "uri": "http://edamontology.org/topic_0610"
        },
        {
            "term": "Literature and language",
            "uri": "http://edamontology.org/topic_3068"
        },
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        }
    ]
}
