{"credit":[{"email":"sdurinck@gmail.com","name":"Steffen Durinck","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"url":"http://bioconductor.org/packages/release/bioc/html/GenomeGraphs.html"}],"download":[{"type":"Source code","url":"http://bioconductor/packages/release/bioc/src/contrib/GenomeGraphs_1.34.0.tar.gz"}],"function":[{"operation":[{"term":"Genome visualisation","uri":"http://edamontology.org/operation_3208"}]}],"labels":{"collectionID":["BioConductor"],"language":["R"],"license":"Artistic-2.0","operatingSystem":["Linux","Windows","Mac"],"toolType":["Command-line tool","Library"],"topic":[{"term":"Genomics","uri":"http://edamontology.org/topic_0622"}]},"publication":[{"abstract":"BACKGROUND: Biological studies involve a growing number of distinct high-throughput experiments to characterize samples of interest. There is a lack of methods to visualize these different genomic datasets in a versatile manner. In addition, genomic data analysis requires integrated visualization of experimental data along with constantly changing genomic annotation and statistical analyses. RESULTS: We developed GenomeGraphs, as an add-on software package for the statistical programming environment R, to facilitate integrated visualization of genomic datasets. GenomeGraphs uses the biomaRt package to perform on-line annotation queries to Ensembl and translates these to gene/transcript structures in viewports of the grid graphics package. This allows genomic annotation to be plotted together with experimental data. GenomeGraphs can also be used to plot custom annotation tracks in combination with different experimental data types together in one plot using the same genomic coordinate system. CONCLUSION: GenomeGraphs is a flexible and extensible software package which can be used to visualize a multitude of genomic datasets within the statistical programming environment R.","authors":["Durinck S.","Bullard J.","Spellman P.T.","Dudoit S."],"cit_count":43,"doi":"10.1186/1471-2105-10-2","journal":"BMC bioinformatics","title":"GenomeGraphs: integrated genomic data visualization with R.","type":"Primary","year":"2009-01-01"}],"summary":{"biotoolsCURIE":"biotools:genomegraphs","biotoolsID":"genomegraphs","description":"Genomic data analyses requires integrated visualization of known genomic information and new experimental data. This tool uses the biomaRt package to perform live annotation queries to Ensembl and translates this to e.g. gene/transcript structures in viewports of the grid graphics package. Genomic information is plotted together with your data. Plot different data types such as array CGH, gene expression, sequencing and other data, together in one plot using the same genome coordinate system.","homepage":"http://bioconductor.org/packages/release/bioc/html/GenomeGraphs.html","name":"GenomeGraphs","version":["1.34.0"]}}