{
    "accessibility": "Open access",
    "additionDate": "2022-03-28T07:10:59.539982Z",
    "biotoolsCURIE": "biotools:adabmdca",
    "biotoolsID": "adabmdca",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "anna.muntoni@polito.it",
            "name": "Anna Paola Muntoni",
            "orcidid": "https://orcid.org/0000-0003-3937-3763",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Adaptive Boltzmann machine learning for Potts models of biological data (adabmDCA)  This is an implementation of the Boltzmann machine learning to infer several maximum-entropy statistical models of Potts or Ising variables given a set of observables. More precisely, it infers the couplings and the fields of a set of generalized Direct Coupling Analysis (DCA) models given a Multiple Sequence Alignment (MSA) of protein or RNA sequences. It is also possible to infer an Ising model from a set of spin configurations. The learning is performed via a gradient ascent of the likelihood of the data in which the model observables are computed via a Markov Chain Monte Carlo (MCMC) sampling.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/anna-pa-m/adabmDCA/blob/master/docs/documentation.md"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Principal component visualisation",
                    "uri": "http://edamontology.org/operation_2939"
                },
                {
                    "term": "Protein modelling",
                    "uri": "http://edamontology.org/operation_0477"
                },
                {
                    "term": "Residue contact prediction",
                    "uri": "http://edamontology.org/operation_0272"
                },
                {
                    "term": "Statistical inference",
                    "uri": "http://edamontology.org/operation_3658"
                }
            ]
        }
    ],
    "homepage": "https://github.com/anna-pa-m/adabmDCA",
    "language": [
        "C++"
    ],
    "lastUpdate": "2022-03-28T07:10:59.542559Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/anna-pa-m/adabmDCA/issues"
        }
    ],
    "name": "adabmDCA",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1186/S12859-021-04441-9",
            "metadata": {
                "abstract": "© 2021, The Author(s).Background: Boltzmann machines are energy-based models that have been shown to provide an accurate statistical description of domains of evolutionary-related protein and RNA families. They are parametrized in terms of local biases accounting for residue conservation, and pairwise terms to model epistatic coevolution between residues. From the model parameters, it is possible to extract an accurate prediction of the three-dimensional contact map of the target domain. More recently, the accuracy of these models has been also assessed in terms of their ability in predicting mutational effects and generating in silico functional sequences. Results: Our adaptive implementation of Boltzmann machine learning, adabmDCA, can be generally applied to both protein and RNA families and accomplishes several learning set-ups, depending on the complexity of the input data and on the user requirements. The code is fully available at https://github.com/anna-pa-m/adabmDCA. As an example, we have performed the learning of three Boltzmann machines modeling the Kunitz and Beta-lactamase2 protein domains and TPP-riboswitch RNA domain. Conclusions: The models learned by adabmDCA are comparable to those obtained by state-of-the-art techniques for this task, in terms of the quality of the inferred contact map as well as of the synthetically generated sequences. In addition, the code implements both equilibrium and out-of-equilibrium learning, which allows for an accurate and lossless training when the equilibrium one is prohibitive in terms of computational time, and allows for pruning irrelevant parameters using an information-based criterion.",
                "authors": [
                    {
                        "name": "Muntoni A.P."
                    },
                    {
                        "name": "Pagnani A."
                    },
                    {
                        "name": "Weigt M."
                    },
                    {
                        "name": "Zamponi F."
                    }
                ],
                "date": "2021-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "adabmDCA: adaptive Boltzmann machine learning for biological sequences"
            },
            "pmcid": "PMC8555268",
            "pmid": "34715775",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ]
}
