{
    "additionDate": "2015-10-07T17:32:04Z",
    "biotoolsCURIE": "biotools:refseq",
    "biotoolsID": "refseq",
    "collectionID": [
        "DRCAT"
    ],
    "credit": [
        {
            "name": "DRCAT",
            "typeEntity": "Project",
            "typeRole": [
                "Documentor"
            ]
        },
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.ncbi.nlm.nih.gov/projects/RefSeq/update.cgi"
        }
    ],
    "description": "A comprehensive, integrated, non-redundant, well-annotated set of sequences, including genomic DNA, transcripts, and proteins. Provides a stable reference for genome annotation, gene identification and characterization, mutation and polymorphism analysis (especially RefSeqGene records), expression studies, and comparative analyses.",
    "documentation": [
        {
            "type": "General",
            "url": "http://www.ncbi.nlm.nih.gov/refseq/about/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Protein identifier",
                        "uri": "http://edamontology.org/data_0989"
                    }
                }
            ],
            "operation": [
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Sequence record",
                        "uri": "http://edamontology.org/data_0849"
                    },
                    "format": [
                        {
                            "term": "HTML",
                            "uri": "http://edamontology.org/format_2331"
                        }
                    ]
                }
            ]
        }
    ],
    "homepage": "http://www.ncbi.nlm.nih.gov/RefSeq/",
    "lastUpdate": "2018-12-10T12:58:49Z",
    "name": "NCBI reference sequences",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "DRCAT",
    "publication": [
        {
            "doi": "10.1093/nar/gkr1079",
            "metadata": {
                "abstract": "The National Center for Biotechnology Information (NCBI) Reference Sequence (RefSeq) database is a collection of genomic, transcript and protein sequence records. These records are selected and curated from public sequence archives and represent a significant reduction in redundancy compared to the volume of data archived by the International Nucleotide Sequence Database Collaboration. The database includes over 16 000 organisms, 2.4 × 10 6 genomic records, 13 × 10 6proteins and 2 × 10 6 RNA records spanning prokaryotes, eukaryotes and viruses (RefSeq release 49, September 2011). The RefSeq database is maintained by a combined approach of automated analyses, collaboration and manual curation to generate an up-to-date representation of the sequence, its features, names and cross-links to related sources of information. We report here on recent growth, the status of curating the human RefSeq data set, more extensive feature annotation and current policy for eukaryotic genome annotation via the NCBI annotation pipeline. More information about the resource is available online (see http://www.ncbi.nlm.nih. gov/RefSeq/).",
                "authors": [
                    {
                        "name": "Pruitt K.D."
                    },
                    {
                        "name": "Tatusova T."
                    },
                    {
                        "name": "Brown G.R."
                    },
                    {
                        "name": "Maglott D.R."
                    }
                ],
                "citationCount": 681,
                "date": "2012-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "NCBI Reference Sequences (RefSeq): Current status, new features and genome annotation policy"
            },
            "type": "Primary"
        },
        {
            "doi": "10.1093/nar/gkl842",
            "metadata": {
                "abstract": "NCBI's reference sequence (RefSeq) database (http://www.ncbi.nlm.nih.gov/ RefSeq/) is a curated non-redundant collection of sequences representing genomes, transcripts and proteins. The database includes 3774 organisms spanning prokaryotes, eukaryotes and viruses, and has records for 2 879 860 proteins (RefSeq release 19). RefSeq records integrate information from multiple sources, when additional data are available from those sources and therefore represent a current description of the sequence and its features. Annotations include coding regions, conserved domains, tRNAs, sequence tagged sites (STS), variation, references, gene and protein product names, and database cross-references. Sequence is reviewed and features are added using a combined approach of collaboration and other input from the scientific community, prediction, propagation from GenBank and curation by NCBI staff. The format of all RefSeq records is validated, and an increasing number of tests are being applied to evaluate the quality of sequence and annotation, especially in the context of complete genomic sequence. © 2007 Oxford University Press.",
                "authors": [
                    {
                        "name": "Pruitt K.D."
                    },
                    {
                        "name": "Tatusova T."
                    },
                    {
                        "name": "Maglott D.R."
                    }
                ],
                "citationCount": 1520,
                "date": "2007-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "NCBI reference sequences (RefSeq): A curated non-redundant sequence database of genomes, transcripts and proteins"
            },
            "type": "Other"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "Comparative genomics",
            "uri": "http://edamontology.org/topic_0797"
        }
    ],
    "validated": 1
}