{
    "additionDate": "2015-10-07T17:32:04Z",
    "biotoolsCURIE": "biotools:refseq",
    "biotoolsID": "refseq",
    "collectionID": [
        "DRCAT"
    ],
    "credit": [
        {
            "name": "DRCAT",
            "typeEntity": "Project",
            "typeRole": [
                "Documentor"
            ]
        },
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.ncbi.nlm.nih.gov/projects/RefSeq/update.cgi"
        }
    ],
    "description": "A comprehensive, integrated, non-redundant, well-annotated set of sequences, including genomic DNA, transcripts, and proteins. Provides a stable reference for genome annotation, gene identification and characterization, mutation and polymorphism analysis (especially RefSeqGene records), expression studies, and comparative analyses.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://www.ncbi.nlm.nih.gov/refseq/about/"
        }
    ],
    "editPermission": {
        "authors": [
            "sergitobara"
        ],
        "type": "group"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Protein identifier",
                        "uri": "http://edamontology.org/data_0989"
                    }
                }
            ],
            "operation": [
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Sequence record",
                        "uri": "http://edamontology.org/data_0849"
                    },
                    "format": [
                        {
                            "term": "HTML",
                            "uri": "http://edamontology.org/format_2331"
                        }
                    ]
                }
            ]
        }
    ],
    "homepage": "http://www.ncbi.nlm.nih.gov/RefSeq/",
    "lastUpdate": "2022-06-21T13:24:03.635559Z",
    "name": "NCBI reference sequences",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "otherID": [
        {
            "type": "rrid",
            "value": "RRID:SCR_003496"
        }
    ],
    "owner": "DRCAT",
    "publication": [
        {
            "doi": "10.1093/nar/gku1207",
            "metadata": {
                "abstract": "Recent technological innovations have ignited an explosion in virus genome sequencing that promises to fundamentally alter our understanding of viral biology and profoundly impact public health policy. Yet, any potential benefits from the billowing cloud of next generation sequence data hinge upon well implemented reference resources that facilitate the identification of sequences, aid in the assembly of sequence reads and provide reference annotation sources. The NCBI Viral Genomes Resource is a reference resource designed to bring order to this sequence shockwave and improve usability of viral sequence data. The resource can be accessed at http://www.ncbi.nlm.nih.gov/genome/viruses/and catalogs all publicly available virus genome sequences and curates reference genome sequences. As the number of genome sequences has grown, so too have the difficulties in annotating and maintaining reference sequences. The rapid expansion of the viral sequence universe has forced a recalibration of the data model to better provide extant sequence representation and enhanced reference sequence products to serve the needs of the various viral communities. This, in turn, has placed increased emphasis on leveraging the knowledge of individual scientific communities to identify important viral sequences and develop well annotated reference virus genome sets.",
                "authors": [
                    {
                        "name": "Ako-Adjei D."
                    },
                    {
                        "name": "Bao Y."
                    },
                    {
                        "name": "Blinkova O."
                    },
                    {
                        "name": "Brister J.R."
                    }
                ],
                "citationCount": 291,
                "date": "2015-01-28T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "NCBI viral Genomes resource"
            },
            "pmcid": "PMC4383986",
            "pmid": "25428358"
        },
        {
            "doi": "10.1093/nar/gkv1189",
            "metadata": {
                "abstract": "The RefSeq project at the National Center for Biotechnology Information (NCBI) maintains and curates a publicly available database of annotated genomic, transcript, and protein sequence records (http://www.ncbi.nlm.nih.gov/refseq/). The RefSeq project leverages the data submitted to the International Nucleotide Sequence Database Collaboration (INSDC) against a combination of computation, manual curation, and collaboration to produce a standard set of stable, non-redundant reference sequences. The RefSeq project augments these reference sequences with current knowledge including publications, functional features and informative nomenclature. The database currently represents sequences from more than 55 000 organisms (>4800 viruses, >40 000 prokaryotes and >10 000 eukaryotes; RefSeq release 71), ranging from a single record to complete genomes. This paper summarizes the current status of the viral, prokaryotic, and eukaryotic branches of the RefSeq project, reports on improvements to data access and details efforts to further expand the taxonomic representation of the collection. We also highlight diverse functional curation initiatives that support multiple uses of RefSeq data including taxonomic validation, genome annotation, comparative genomics, and clinical testing. We summarize our approach to utilizing available RNA-Seq and other data types in our manual curation process for vertebrate, plant, and other species, and describe a new direction for prokaryotic genomes and protein name management.",
                "authors": [
                    {
                        "name": "Ako-Adjei D."
                    },
                    {
                        "name": "Astashyn A."
                    },
                    {
                        "name": "Badretdin A."
                    },
                    {
                        "name": "Bao Y."
                    },
                    {
                        "name": "Blinkova O."
                    },
                    {
                        "name": "Brister J.R."
                    },
                    {
                        "name": "Brover V."
                    },
                    {
                        "name": "Chetvernin V."
                    },
                    {
                        "name": "Choi J."
                    },
                    {
                        "name": "Ciufo S."
                    },
                    {
                        "name": "Cox E."
                    },
                    {
                        "name": "DiCuccio M."
                    },
                    {
                        "name": "Ermolaeva O."
                    },
                    {
                        "name": "Farrell C.M."
                    },
                    {
                        "name": "Goldfarb T."
                    },
                    {
                        "name": "Gupta T."
                    },
                    {
                        "name": "Haddad D."
                    },
                    {
                        "name": "Haft D."
                    },
                    {
                        "name": "Hatcher E."
                    },
                    {
                        "name": "Hlavina W."
                    },
                    {
                        "name": "Joardar V.S."
                    },
                    {
                        "name": "Kimchi A."
                    },
                    {
                        "name": "Kitts P."
                    },
                    {
                        "name": "Kodali V.K."
                    },
                    {
                        "name": "Landrum M.J."
                    },
                    {
                        "name": "Li W."
                    },
                    {
                        "name": "Maglott D."
                    },
                    {
                        "name": "Masterson P."
                    },
                    {
                        "name": "McGarvey K.M."
                    },
                    {
                        "name": "McVeigh R."
                    },
                    {
                        "name": "Murphy M.R."
                    },
                    {
                        "name": "Murphy T.D."
                    },
                    {
                        "name": "O'Leary N.A."
                    },
                    {
                        "name": "O'Neill K."
                    },
                    {
                        "name": "Pruitt K.D."
                    },
                    {
                        "name": "Pujar S."
                    },
                    {
                        "name": "Rajput B."
                    },
                    {
                        "name": "Rangwala S.H."
                    },
                    {
                        "name": "Rausch D."
                    },
                    {
                        "name": "Riddick L.D."
                    },
                    {
                        "name": "Robbertse B."
                    },
                    {
                        "name": "Schoch C."
                    },
                    {
                        "name": "Shkeda A."
                    },
                    {
                        "name": "Smith-White B."
                    },
                    {
                        "name": "Storz S.S."
                    },
                    {
                        "name": "Sun H."
                    },
                    {
                        "name": "Tatusova T."
                    },
                    {
                        "name": "Thibaud-Nissen F."
                    },
                    {
                        "name": "Tolstoy I."
                    },
                    {
                        "name": "Tully R.E."
                    },
                    {
                        "name": "Vatsan A.R."
                    },
                    {
                        "name": "Wallin C."
                    },
                    {
                        "name": "Webb D."
                    },
                    {
                        "name": "Wright M.W."
                    },
                    {
                        "name": "Wu W."
                    }
                ],
                "citationCount": 2224,
                "date": "2016-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "Reference sequence (RefSeq) database at NCBI: Current status, taxonomic expansion, and functional annotation"
            },
            "pmcid": "PMC4702849",
            "pmid": "26553804"
        },
        {
            "doi": "10.1093/nar/gkw569",
            "metadata": {
                "abstract": "© 2016 Published by Oxford University Press on behalf of Nucleic Acids Research 2016. This work is written by (a) US Government employee(s) and is in the public domain in the US.Recent technological advances have opened unprecedented opportunities for large-scale sequencing and analysis of populations of pathogenic species in disease outbreaks, as well as for large-scale diversity studies aimed at expanding our knowledge across the whole domain of prokaryotes. To meet the challenge of timely interpretation of structure, function and meaning of this vast genetic information, a comprehensive approach to automatic genome annotation is critically needed. In collaboration with Georgia Tech, NCBI has developed a new approach to genome annotation that combines alignment based methods with methods of predicting protein-coding and RNA genes and other functional elements directly from sequence. A new gene finding tool, GeneMarkS+, uses the combined evidence of protein and RNA placement by homology as an initial map of annotation to generate and modify ab initio gene predictions across the whole genome. Thus, the new NCBI's Prokaryotic Genome Annotation Pipeline (PGAP) relies more on sequence similarity when confident comparative data are available, while it relies more on statistical predictions in the absence of external evidence. The pipeline provides a framework for generation and analysis of annotation on the full breadth of prokaryotic taxonomy. For additional information on PGAP see https://www.ncbi.nlm.nih.gov/genome/annotation-prok/ and the NCBI Handbook, https://www.ncbi.nlm.nih.gov/books/NBK174280/.",
                "authors": [
                    {
                        "name": "Badretdin A."
                    },
                    {
                        "name": "Borodovsky M."
                    },
                    {
                        "name": "Chetvernin V."
                    },
                    {
                        "name": "Dicuccio M."
                    },
                    {
                        "name": "Lomsadze A."
                    },
                    {
                        "name": "Nawrocki E.P."
                    },
                    {
                        "name": "Ostell J."
                    },
                    {
                        "name": "Pruitt K.D."
                    },
                    {
                        "name": "Tatusova T."
                    },
                    {
                        "name": "Zaslavsky L."
                    }
                ],
                "citationCount": 2768,
                "date": "2016-08-19T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "NCBI prokaryotic genome annotation pipeline"
            },
            "pmcid": "PMC5001611",
            "pmid": "27342282"
        },
        {
            "doi": "10.1093/nar/gkl842",
            "metadata": {
                "abstract": "NCBI's reference sequence (RefSeq) database (http://www.ncbi.nlm.nih.gov/ RefSeq/) is a curated non-redundant collection of sequences representing genomes, transcripts and proteins. The database includes 3774 organisms spanning prokaryotes, eukaryotes and viruses, and has records for 2 879 860 proteins (RefSeq release 19). RefSeq records integrate information from multiple sources, when additional data are available from those sources and therefore represent a current description of the sequence and its features. Annotations include coding regions, conserved domains, tRNAs, sequence tagged sites (STS), variation, references, gene and protein product names, and database cross-references. Sequence is reviewed and features are added using a combined approach of collaboration and other input from the scientific community, prediction, propagation from GenBank and curation by NCBI staff. The format of all RefSeq records is validated, and an increasing number of tests are being applied to evaluate the quality of sequence and annotation, especially in the context of complete genomic sequence. © 2007 Oxford University Press.",
                "authors": [
                    {
                        "name": "Maglott D.R."
                    },
                    {
                        "name": "Pruitt K.D."
                    },
                    {
                        "name": "Tatusova T."
                    }
                ],
                "citationCount": 1999,
                "date": "2007-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "NCBI reference sequences (RefSeq): A curated non-redundant sequence database of genomes, transcripts and proteins"
            },
            "type": [
                "Other"
            ]
        },
        {
            "doi": "10.1093/nar/gkr1079",
            "metadata": {
                "abstract": "The National Center for Biotechnology Information (NCBI) Reference Sequence (RefSeq) database is a collection of genomic, transcript and protein sequence records. These records are selected and curated from public sequence archives and represent a significant reduction in redundancy compared to the volume of data archived by the International Nucleotide Sequence Database Collaboration. The database includes over 16 000 organisms, 2.4 × 10 6 genomic records, 13 × 10 6proteins and 2 × 10 6 RNA records spanning prokaryotes, eukaryotes and viruses (RefSeq release 49, September 2011). The RefSeq database is maintained by a combined approach of automated analyses, collaboration and manual curation to generate an up-to-date representation of the sequence, its features, names and cross-links to related sources of information. We report here on recent growth, the status of curating the human RefSeq data set, more extensive feature annotation and current policy for eukaryotic genome annotation via the NCBI annotation pipeline. More information about the resource is available online (see http://www.ncbi.nlm.nih. gov/RefSeq/).",
                "authors": [
                    {
                        "name": "Brown G.R."
                    },
                    {
                        "name": "Maglott D.R."
                    },
                    {
                        "name": "Pruitt K.D."
                    },
                    {
                        "name": "Tatusova T."
                    }
                ],
                "citationCount": 842,
                "date": "2012-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "NCBI Reference Sequences (RefSeq): Current status, new features and genome annotation policy"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Comparative genomics",
            "uri": "http://edamontology.org/topic_0797"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        }
    ],
    "validated": 1
}
