{
    "additionDate": "2021-01-18T08:31:33Z",
    "biotoolsCURIE": "biotools:musitedeep",
    "biotoolsID": "musitedeep",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "xudong@missouri.edu",
            "name": "Dong Xu",
            "orcidid": "https://orcid.org/0000-0002-4809-0514",
            "typeEntity": "Person"
        }
    ],
    "description": "A deep-learning based webserver for protein post-translational modification site prediction and visualization.\n\nMusiteDeep is a deep-learning based webserver for protein post-translational modification site (PTM) prediction and visualization.\n\nThe MusiteDeep web server is available at http://www.musite.net. This repository contains the stand-alone tools in python to run MusiteDeep on a local machine:.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "PTM site prediction",
                    "uri": "http://edamontology.org/operation_0417"
                },
                {
                    "term": "PTM localisation",
                    "uri": "http://edamontology.org/operation_3755"
                },
                {
                    "term": "Nucleic acid feature detection",
                    "uri": "http://edamontology.org/operation_0415"
                },
                {
                    "term": "Side chain modelling",
                    "uri": "http://edamontology.org/operation_0480"
                }
            ]
        }
    ],
    "homepage": "https://www.musite.net",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-03-02T08:23:37Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/duolinwang/MusiteDeep_web"
        }
    ],
    "name": "MusiteDeep",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1093/NAR/GKAA275",
            "metadata": {
                "abstract": "© The Author(s) 2020. Published by Oxford University Press on behalf of Nucleic Acids Research.MusiteDeep is an online resource providing a deep-learning framework for protein post-translational modification (PTM) site prediction and visualization. The predictor only uses protein sequences as input and no complex features are needed, which results in a real-time prediction for a large number of proteins. It takes less than three minutes to predict for 1000 sequences per PTM type. The output is presented at the amino acid level for the user-selected PTM types. The framework has been benchmarked and has demonstrated competitive performance in PTM site predictions by other researchers. In this webserver, we updated the previous framework by utilizing more advanced ensemble techniques, and providing prediction and visualization for multiple PTMs simultaneously for users to analyze potential PTM cross-talks directly. Besides prediction, users can interactively review the predicted PTM sites in the context of known PTM annotations and protein 3D structures through homology-based search. In addition, the server maintains a local database providing pre-processed PTM annotations from Uniport/Swiss-Prot for users to download. This database will be updated every three months. The MusiteDeep server is available at https://www.musite.net. The stand-alone tools for locally using MusiteDeep are available at https://github.com/duolinwang/MusiteDeep web.",
                "authors": [
                    {
                        "name": "Wang D."
                    },
                    {
                        "name": "Liu D."
                    },
                    {
                        "name": "Yuchi J."
                    },
                    {
                        "name": "He F."
                    },
                    {
                        "name": "Jiang Y."
                    },
                    {
                        "name": "Cai S."
                    },
                    {
                        "name": "Li J."
                    },
                    {
                        "name": "Xu D."
                    }
                ],
                "citationCount": 6,
                "date": "2021-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "MusiteDeep: A deep-learning based webserver for protein post-translational modification site prediction and visualization"
            },
            "pmcid": "PMC7319475",
            "pmid": "32324217"
        }
    ],
    "toolType": [
        "Command-line tool",
        "Web application"
    ],
    "topic": [
        {
            "term": "Protein modifications",
            "uri": "http://edamontology.org/topic_0601"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        }
    ]
}