{
    "additionDate": "2021-01-18T12:35:51Z",
    "biotoolsCURIE": "biotools:necom",
    "biotoolsID": "necom",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "Joshua.Chan@colostate.edu",
            "name": "Tianwei Tan",
            "typeEntity": "Person"
        },
        {
            "email": "twtan@mail.buct.edu.cn",
            "name": "S H Joshua Chan",
            "typeEntity": "Person"
        }
    ],
    "description": "Predicting Nash equilibria for microbial metabolic interactions.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Metabolic network modelling",
                    "uri": "http://edamontology.org/operation_3660"
                },
                {
                    "term": "Metabolic pathway prediction",
                    "uri": "http://edamontology.org/operation_3929"
                },
                {
                    "term": "Modelling and simulation",
                    "uri": "http://edamontology.org/operation_2426"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Jingyi-Cai/NECom.git",
    "language": [
        "C++",
        "MATLAB"
    ],
    "lastUpdate": "2021-03-08T13:11:48Z",
    "name": "NECom",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAA1014",
            "metadata": {
                "abstract": "© The Author(s) 2020. Published by Oxford University Press. All rights reserved. For permissions, please e-mail: journals.permissions@oup.comMotivation: Microbial metabolic interactions impact ecosystems, human health and biotechnology profoundly. However, their determination remains elusive, invoking an urgent need for predictive models seamlessly integrating metabolism with evolutionary principles that shape community interactions. Results: Inspired by the evolutionary game theory, we formulated a bi-level optimization framework termed NECom for which any feasible solutions are Nash equilibria of microbial community metabolic models with/without an outer-level (community) objective function. Distinct from discrete matrix games, NECom models the continuous interdependent strategy space of metabolic fluxes. We showed that NECom successfully predicted several classical games in the context of metabolic interactions that were falsely or incompletely predicted by existing methods, including prisoner's dilemma, snowdrift and cooperation. The improved capability originates from the novel formulation to prevent 'forced altruism' hidden in previous static algorithms while allowing for sensing all potential metabolite exchanges to determine evolutionarily favorable interactions between members, a feature missing in dynamic methods. The results provided insights into why mutualism is favorable despite seemingly costly cross-feeding metabolites and demonstrated similarities and differences between games in the continuous metabolic flux space and matrix games. NECom was then applied to a reported algae-yeast co-culture system that shares typical cross-feeding features of lichen, a model system of mutualism. 488 growth conditions corresponding to 3221 experimental data points were simulated. Without training any parameters using the data, NECom is more predictive of species' growth rates given uptake rates compared with flux balance analysis with an overall 63.5% and 81.7% reduction in root-mean-square error for the two species respectively.",
                "authors": [
                    {
                        "name": "Cai J."
                    },
                    {
                        "name": "Chan S.H.J."
                    },
                    {
                        "name": "Tan T."
                    }
                ],
                "citationCount": 1,
                "date": "2020-12-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Predicting Nash equilibria for microbial metabolic interactions"
            },
            "pmid": "33315094"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Biotechnology",
            "uri": "http://edamontology.org/topic_3297"
        },
        {
            "term": "Endocrinology and metabolism",
            "uri": "http://edamontology.org/topic_3407"
        },
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
