{
    "additionDate": "2021-01-18T08:32:03Z",
    "biotoolsCURIE": "biotools:pub2tools2020__gomcl",
    "biotoolsID": "pub2tools2020__gomcl",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "maheshid@lsu.edu",
            "name": "Maheshi Dassanayake",
            "orcidid": "https://orcid.org/0000-0003-3123-3731",
            "typeEntity": "Person"
        }
    ],
    "description": "A toolkit to cluster, evaluate, and extract non-redundant associations of Gene Ontology-based functions.\n\nGOMCL is a tool to cluster and extract summarized associations of Gene Ontology based functions in omics data. It clusters GO terms using MCL based on overlapping ratios, OC (Overlap coefficient) or JC (Jaccard coefficient). The resulting clusters can be further analyzed and separated into sub-clusters using a second script, GOMCL-sub. This tool helps researchers to reduce time spent on manual curation of large lists of GO terms and minimize biases introduced by shared GO terms in data interpretation.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Gene-set enrichment analysis",
                    "uri": "http://edamontology.org/operation_2436"
                }
            ]
        }
    ],
    "homepage": "http://www.lsugenomics.org",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-01-25T08:57:38Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/Guannan-Wang/GOMCL"
        }
    ],
    "name": "GOMCL",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1186/S12859-020-3447-4",
            "metadata": {
                "abstract": "© 2020 The Author(s).Background: Functional enrichment of genes and pathways based on Gene Ontology (GO) has been widely used to describe the results of various -omics analyses. GO terms statistically overrepresented within a set of a large number of genes are typically used to describe the main functional attributes of the gene set. However, these lists of overrepresented GO terms are often too large and contains redundant overlapping GO terms hindering informative functional interpretations. Results: We developed GOMCL to reduce redundancy and summarize lists of GO terms effectively and informatively. This lightweight python toolkit efficiently identifies clusters within a list of GO terms using the Markov Clustering (MCL) algorithm, based on the overlap of gene members between GO terms. GOMCL facilitates biological interpretation of a large number of GO terms by condensing them into GO clusters representing non-overlapping functional themes. It enables visualizing GO clusters as a heatmap, networks based on either overlap of members or hierarchy among GO terms, and tables with depth and cluster information for each GO term. Each GO cluster generated by GOMCL can be evaluated and further divided into non-overlapping sub-clusters using the GOMCL-sub module. The outputs from both GOMCL and GOMCL-sub can be imported to Cytoscape for additional visualization effects. Conclusions: GOMCL is a convenient toolkit to cluster, evaluate, and extract non-redundant associations of Gene Ontology-based functions. GOMCL helps researchers to reduce time spent on manual curation of large lists of GO terms, minimize biases introduced by redundant GO terms in data interpretation, and batch processing of multiple GO enrichment datasets. A user guide, a test dataset, and the source code of GOMCL are available at https://github.com/Guannan-Wang/GOMCL and www.lsugenomics.org.",
                "authors": [
                    {
                        "name": "Wang G."
                    },
                    {
                        "name": "Oh D.-H."
                    },
                    {
                        "name": "Dassanayake M."
                    }
                ],
                "citationCount": 4,
                "date": "2020-04-10T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "GOMCL: A toolkit to cluster, evaluate, and extract non-redundant associations of Gene Ontology-based functions"
            },
            "pmcid": "PMC7146957",
            "pmid": "32272889"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Ontology and terminology",
            "uri": "http://edamontology.org/topic_0089"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ]
}