{
    "additionDate": "2021-01-18T11:25:33Z",
    "biotoolsCURIE": "biotools:phewas-me",
    "biotoolsID": "phewas-me",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "n.strayer@vanderbilt.edu",
            "name": "Nick Strayer",
            "typeEntity": "Person"
        },
        {
            "email": "yaomin.xu@vumc.org",
            "name": "Yaomin Xu",
            "typeEntity": "Person"
        }
    ],
    "description": "PheWAS me is a web-app for interactive exploration of multimorbidity patterns in PheWAS.\n\nElectronic health records (EHRs) linked with a DNA biobank provide unprecedented opportunities for biomedical research in precision medicine.\n\nShould multiple-comparisons adjustment be done on P-Values of phewas results file?.\n\nSupplied are snps that have been preloaded.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                },
                {
                    "term": "Parsing",
                    "uri": "http://edamontology.org/operation_1812"
                }
            ]
        }
    ],
    "homepage": "https://prod.tbilab.org/phewas_me/",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-01-23T14:59:06Z",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "https://prod.tbilab.org/phewas_me_info/"
        }
    ],
    "name": "PheWAS-ME",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAA870",
            "metadata": {
                "abstract": "© The Author(s) 2020. Published by Oxford University Press. All rights reserved. For permissions, please e-mail: journals.permissions@oup.com.SUMMARY: Electronic health records (EHRs) linked with a DNA biobank provide unprecedented opportunities for biomedical research in precision medicine. The Phenome-wide association study (PheWAS) is a widely used technique for the evaluation of relationships between genetic variants and a large collection of clinical phenotypes recorded in EHRs. PheWAS analyses are typically presented as static tables and charts of summary statistics obtained from statistical tests of association between a genetic variant and individual phenotypes. Comorbidities are common and typically lead to complex, multivariate gene-disease association signals that are challenging to interpret. Discovering and interrogating multimorbidity patterns and their influence in PheWAS is difficult and time-consuming. We present PheWAS-ME: an interactive dashboard to visualize individual-level genotype and phenotype data side-by-side with PheWAS analysis results, allowing researchers to explore multimorbidity patterns and their associations with a genetic variant of interest. We expect this application to enrich PheWAS analyses by illuminating clinical multimorbidity patterns present in the data. AVAILABILITY AND IMPLEMENTATION: A demo PheWAS-ME application is publicly available at https://prod.tbilab.org/phewas_me/. Sample datasets are provided for exploration with the option to upload custom PheWAS results and corresponding individual-level data. Online versions of the appendices are available at https://prod.tbilab.org/phewas_me_info/. The source code is available as an R package on GitHub (https://github.com/tbilab/multimorbidity_explorer). SUPPLEMENTARY INFORMATION: Supplementary data are available at Bioinformatics online.",
                "authors": [
                    {
                        "name": "Strayer N."
                    },
                    {
                        "name": "Shirey-Rice J.K."
                    },
                    {
                        "name": "Shyr Y."
                    },
                    {
                        "name": "Denny J.C."
                    },
                    {
                        "name": "Pulley J.M."
                    },
                    {
                        "name": "Xu Y."
                    }
                ],
                "citationCount": 1,
                "date": "2021-07-19T00:00:00Z",
                "journal": "Bioinformatics (Oxford, England)",
                "title": "PheWAS-ME: a web-app for interactive exploration of multimorbidity patterns in PheWAS"
            },
            "pmid": "33051675"
        }
    ],
    "topic": [
        {
            "term": "Biobank",
            "uri": "http://edamontology.org/topic_3337"
        },
        {
            "term": "Phenomics",
            "uri": "http://edamontology.org/topic_3298"
        },
        {
            "term": "Personalised medicine",
            "uri": "http://edamontology.org/topic_3577"
        },
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Infectious disease",
            "uri": "http://edamontology.org/topic_3324"
        }
    ],
    "validated": 1
}