
{
    "credit": [
        {
            "email": "epxing@cs.cmu.edu",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://www.sailing.cs.cmu.edu/main/?page_id=462"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Pathway or network prediction",
                    "uri": "http://edamontology.org/operation_3439"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "C++"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Genetic variation",
                "uri": "http://edamontology.org/topic_0199"
            },
            {
                "term": "Genetics",
                "uri": "http://edamontology.org/topic_3053"
            },
            {
                "term": "Pathology",
                "uri": "http://edamontology.org/topic_0634"
            },
            {
                "term": "Machine learning",
                "uri": "http://edamontology.org/topic_3474"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://www.mybiosoftware.com/gflasso-association-analysis-searches-genetic-variation.html"
        }
    ],
    "publication": [
        {
            "abstract": "Motivation: Many complex disease syndromes such as asthma consist of a large number of highly related, rather than independent, clinical phenotypes, raising a new technical challenge in identifying genetic variations associated simultaneously with correlated traits. Although a causal genetic variation may influence a group of highly correlated traits jointly, most of the previous association analyses considered each phenotype separately, or combined results from a set of single-phenotype analyses. Results: We propose a new statistical framework called graph-guided fused lasso to address this issue in a principled way. Our approach represents the dependency structure among the quantitative traits explicitly as a network, and leverages this trait network to encode structured regularizations in a multivariate regression model over the genotypes and traits, so that the genetic markers that jointly influence subgroups of highly correlated traits can be detected with high sensitivity and specificity. While most of the traditional methods examined each phenotype independently, our approach analyzes all of the traits jointly in a single statistical method to discover the genetic markers that perturb a subset of correlated triats jointly rather than a single trait. Using simulated datasets based on the HapMap consortium data and an asthma dataset, we compare the performance of our method with the single-marker analysis, and other sparse regression methods that do not use any structural information in the traits. Our results show that there is a significant advantage in detecting the true causal single nucleotide polymorphisms when we incorporate the correlation pattern in traits using our proposed methods. © 2009 The Author(s).",
            "authors": [
                "Kim S.",
                "Sohn K.-A.",
                "Xing E.P."
            ],
            "cit_count": 75,
            "journal": "Bioinformatics",
            "pmid": "19477989",
            "title": "A multivariate regression approach to association analysis of a quantitative trait network",
            "year": "2009-06-09"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:gflasso",
        "biotoolsID": "gflasso",
        "description": "Software for association analysis that searches for genetic variations influencing a group of correlated traits.",
        "homepage": "http://www.sailing.cs.cmu.edu/main/?page_id=462",
        "name": "GFlasso"
    }
}