{
    "additionDate": "2021-11-29T12:47:06.825457Z",
    "biotoolsCURIE": "biotools:scnet-genes",
    "biotoolsID": "scnet-genes",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "cantini@bio.ens.psl.eu",
            "name": "Laura Cantini",
            "typeEntity": "Person"
        }
    ],
    "description": "scNET is a tool for evaluating the reproducibility of single-cell gene regulatory network inference algorithms. Here three single-cell network inference algorithms is benchamrk based on their reproducibility, i.e. their ability to infer similar networks once applied to two independent datasets from the same biological condition.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                },
                {
                    "term": "Transcriptome assembly",
                    "uri": "http://edamontology.org/operation_3258"
                },
                {
                    "term": "Expression correlation analysis",
                    "uri": "http://edamontology.org/operation_3463"
                }
            ]
        }
    ],
    "homepage": "https://github.com/ComputationalSystemsBiology/scNET",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-11-29T12:47:06.827915Z",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/ComputationalSystemsBiology/scNET/issues"
        }
    ],
    "name": "scNET",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.3389/FGENE.2021.617282",
            "metadata": {
                "abstract": "© Copyright © 2021 Kang, Thieffry and Cantini.Networks are powerful tools to represent and investigate biological systems. The development of algorithms inferring regulatory interactions from functional genomics data has been an active area of research. With the advent of single-cell RNA-seq data (scRNA-seq), numerous methods specifically designed to take advantage of single-cell datasets have been proposed. However, published benchmarks on single-cell network inference are mostly based on simulated data. Once applied to real data, these benchmarks take into account only a small set of genes and only compare the inferred networks with an imposed ground-truth. Here, we benchmark six single-cell network inference methods based on their reproducibility, i.e., their ability to infer similar networks when applied to two independent datasets for the same biological condition. We tested each of these methods on real data from three biological conditions: human retina, T-cells in colorectal cancer, and human hematopoiesis. Once taking into account networks with up to 100,000 links, GENIE3 results to be the most reproducible algorithm and, together with GRNBoost2, show higher intersection with ground-truth biological interactions. These results are independent from the single-cell sequencing platform, the cell type annotation system and the number of cells constituting the dataset. Finally, GRNBoost2 and CLR show more reproducible performance once a more stringent thresholding is applied to the networks (1,000–100 links). In order to ensure the reproducibility and ease extensions of this benchmark study, we implemented all the analyses in scNET, a Jupyter notebook available at https://github.com/ComputationalSystemsBiology/scNET.",
                "authors": [
                    {
                        "name": "Kang Y."
                    },
                    {
                        "name": "Thieffry D."
                    },
                    {
                        "name": "Cantini L."
                    }
                ],
                "date": "2021-03-22T00:00:00Z",
                "journal": "Frontiers in Genetics",
                "title": "Evaluating the Reproducibility of Single-Cell Gene Regulatory Network Inference Algorithms"
            },
            "pmcid": "PMC8019823",
            "pmid": "33828580"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        }
    ]
}