{
    "additionDate": "2017-08-20T15:59:09Z",
    "biotoolsCURIE": "biotools:structure",
    "biotoolsID": "structure",
    "collectionID": [
        "Animal and Crop Genomics"
    ],
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://groups.google.com/forum/#!forum/structure-software"
        }
    ],
    "description": "The program structureis a free software package for using multi-locus genotype data to investigate population structure. Its uses include inferring the presence of distinct populations, assigning individuals to populations, studying hybrid zones, identifying migrants and admixed individuals, and estimating population allele frequencies in situations where many individuals are migrants or admixed.",
    "documentation": [
        {
            "note": "Documentation can be found in archived download.",
            "type": [
                "User manual"
            ],
            "url": "http://web.stanford.edu/group/pritchardlab/structure_software/release_versions/v2.3.4/html/structure.html"
        }
    ],
    "editPermission": {
        "authors": [
            "animalandcropgenomics",
            "nicolo.cultrera"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genetic variation analysis",
                    "uri": "http://edamontology.org/operation_3197"
                }
            ]
        }
    ],
    "homepage": "http://web.stanford.edu/group/pritchardlab/structure.html",
    "language": [
        "C",
        "Java"
    ],
    "lastUpdate": "2020-05-06T14:57:58Z",
    "license": "Not licensed",
    "name": "Structure",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "nicolo.cultrera",
    "publication": [
        {
            "metadata": {
                "abstract": "We describe a model-based clustering method for using multilocus genotype data to infer population structure and assign individuals to populations. We assume a model in which there are K populations (where K may be unknown), each of which is characterized by a set of allele frequencies at each locus. Individuals in the sample are assigned (probabilistically) to populations, or jointly to two or more populations if their genotypes indicate that they are admixed. Our model does not assume a particular mutation process, and it can be applied to most of the commonly used genetic markers, provided that they are not closely linked. Applications of our method include demonstrating the presence of population structure, assigning individuals to populations, studying hybrid zones, and identifying migrants and admixed individuals. We show that the method can produce highly accurate assignments using modest numbers of loci - e.g., seven microsatellite loci in an example using genotype data from an endangered bird species. The software used for this article is available from http://www.stats.ox.ac.uk/~pritch/home.html.",
                "authors": [
                    {
                        "name": "Donnelly P."
                    },
                    {
                        "name": "Pritchard J.K."
                    },
                    {
                        "name": "Stephens M."
                    }
                ],
                "citationCount": 22803,
                "date": "2000-06-01T00:00:00Z",
                "journal": "Genetics",
                "title": "Inference of population structure using multilocus genotype data"
            },
            "pmcid": "PMC1461096",
            "pmid": "10835412",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Population genetics",
            "uri": "http://edamontology.org/topic_3056"
        }
    ],
    "validated": 1
}
