{
    "additionDate": "2020-01-14T19:44:57Z",
    "biotoolsCURIE": "biotools:Ped-sim",
    "biotoolsID": "Ped-sim",
    "confidence_flag": "tool",
    "description": "Crossover interference and sex-specific genetic maps shape identical by descent sharing in close relatives.\n\nProgram to simulate pedigree structures. The method can use sex-specific genetic maps and randomly assigns the sex of each parent (or uses user-specified sexes) when using such maps.\n\n./ped-sim -d <in.def> -m <map file> -o <out_prefix> --intf <filename>.\n\nThe above both produce three output files: [out_prefix].seg containing IBD segments, [out_prefix].fam, a PLINK format fam file with all simulated relatives, and [out_prefix].log, a log of what Ped-sim printed to stdout.\n\nSample ids for simulated individuals",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genetic mapping",
                    "uri": "http://edamontology.org/operation_0282"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Imputation",
                    "uri": "http://edamontology.org/operation_3557"
                },
                {
                    "term": "Physical mapping",
                    "uri": "http://edamontology.org/operation_2944"
                }
            ]
        }
    ],
    "homepage": "https://github.com/williamslab/ped-sim",
    "language": [
        "C++"
    ],
    "lastUpdate": "2021-01-05T10:38:53Z",
    "license": "GPL-3.0",
    "name": "Ped-sim",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PGEN.1007979",
            "metadata": {
                "abstract": "© 2019 Caballero et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Simulations of close relatives and identical by descent (IBD) segments are common in genetic studies, yet most past efforts have utilized sex averaged genetic maps and ignored crossover interference, thus omitting features known to affect the breakpoints of IBD segments. We developed Ped-sim, a method for simulating relatives that can utilize either sex-specific or sex averaged genetic maps and also either a model of crossover interference or the traditional Poisson model for inter-crossover distances. To characterize the impact of previously ignored mechanisms, we simulated data for all four combinations of these factors. We found that modeling crossover interference decreases the standard deviation of pairwise IBD proportions by 10.4% on average in full siblings through second cousins. By contrast, sex-specific maps increase this standard deviation by 4.2% on average, and also impact the number of segments relatives share. Most notably, using sex-specific maps, the number of segments half-siblings share is bimodal; and when combined with interference modeling, the probability that sixth cousins have non-zero IBD sharing ranges from 9.0 to 13.1%, depending on the sexes of the individuals through which they are related. We present new analytical results for the distributions of IBD segments under these models and show they match results from simulations. Finally, we compared IBD sharing rates between simulated and real relatives and find that the combination of sex-specific maps and interference modeling most accurately captures IBD rates in real data. Ped-sim is open source and available from https://github.com/williamslab/ ped-sim.",
                "authors": [
                    {
                        "name": "Blangero J."
                    },
                    {
                        "name": "Caballero M."
                    },
                    {
                        "name": "Carmi S."
                    },
                    {
                        "name": "Curran J.E."
                    },
                    {
                        "name": "Duggirala R."
                    },
                    {
                        "name": "Dyer T.D."
                    },
                    {
                        "name": "Lehman D.M."
                    },
                    {
                        "name": "Qiao Y."
                    },
                    {
                        "name": "Sannerud J."
                    },
                    {
                        "name": "Seidman D.N."
                    },
                    {
                        "name": "Williams A.L."
                    }
                ],
                "citationCount": 7,
                "date": "2019-01-01T00:00:00Z",
                "journal": "PLoS Genetics",
                "title": "Crossover interference and sex-specific genetic maps shape identical by descent sharing in close relatives"
            },
            "pmid": "31860654"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        },
        {
            "term": "Physics",
            "uri": "http://edamontology.org/topic_3318"
        }
    ],
    "validated": 1
}
