{
    "accessibility": "Open access",
    "additionDate": "2019-02-14T08:17:30Z",
    "biotoolsCURIE": "biotools:VarGenius",
    "biotoolsID": "VarGenius",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "f.musacchia@tigem.it",
            "name": "ELIXIR-ITA-TELETHON",
            "orcidid": "https://orcid.org/0000-0001-9440-1080",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "VarGenius is a platform for analysis of variants from DNA sequencing data. Currently it can be used for WES and Panels. Starting from fastq files it can execute the GATK Best Practices pipeline doing both single calling and joint calling. Then it executes Annovar for variant annotation and generates a readable output in tabular and XLS format. All the data extracted from the samples (variants, genotypes, etc..) are uploaded into a Postgres database which can be used for further downstream analyses.",
    "documentation": [
        {
            "type": [
                "Installation instructions"
            ],
            "url": "https://github.com/frankMusacchia/VarGenius/tree/master/GUIDE"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "https://github.com/frankMusacchia/VarGenius",
            "version": "1.0"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "elixirNode": [
        "Italy"
    ],
    "elixirPlatform": [
        "Tools"
    ],
    "homepage": "https://github.com/frankMusacchia/VarGenius",
    "language": [
        "R",
        "Perl"
    ],
    "lastUpdate": "2020-06-16T10:55:26Z",
    "link": [
        {
            "type": [
                "Helpdesk"
            ],
            "url": "https://groups.google.com/forum/#!forum/VarGenius"
        }
    ],
    "maturity": "Mature",
    "name": "VarGenius",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "FrankMusacchia",
    "publication": [
        {
            "doi": "10.1186/s12859-018-2532-4",
            "pmcid": "PMC6291943",
            "pmid": "30541431",
            "type": [
                "Primary"
            ],
            "version": "1.0"
        },
        {
            "doi": "10.1186/s12859-018-2532-4",
            "metadata": {
                "abstract": "© 2018 The Author(s).Background: Targeted resequencing has become the most used and cost-effective approach for identifying causative mutations of Mendelian diseases both for diagnostics and research purposes. Due to very rapid technological progress, NGS laboratories are expanding their capabilities to address the increasing number of analyses. Several open source tools are available to build a generic variant calling pipeline, but a tool able to simultaneously execute multiple analyses, organize, and categorize the samples is still missing. Results: Here we describe VarGenius, a Linux based command line software able to execute customizable pipelines for the analysis of multiple targeted resequencing data using parallel computing. VarGenius provides a database to store the output of the analysis (calling quality statistics, variant annotations, internal allelic variant frequencies) and sample information (personal data, genotypes, phenotypes). VarGenius can also perform the \"joint analysis\" of hundreds of samples with a single command, drastically reducing the time for the configuration and execution of the analysis. VarGenius executes the standard pipeline of the Genome Analysis Tool-Kit (GATK) best practices (GBP) for germinal variant calling, annotates the variants using Annovar, and generates a user-friendly output displaying the results through a web page. VarGenius has been tested on a parallel computing cluster with 52 machines with 120GB of RAM each. Under this configuration, a 50 M whole exome sequencing (WES) analysis for a family was executed in about 7h (trio or quartet); a joint analysis of 30 WES in about 24 h and the parallel analysis of 34 single samples from a 1 M panel in about 2 h. Conclusions: We developed VarGenius, a \"master\" tool that faces the increasing demand of heterogeneous NGS analyses and allows maximum flexibility for downstream analyses. It paves the way to a different kind of analysis, centered on cohorts rather than on singleton. Patient and variant information are stored into the database and any output file can be accessed programmatically. VarGenius can be used for routine analyses by biomedical researchers with basic Linux skills providing additional flexibility for computational biologists to develop their own algorithms for the comparison and analysis of data. The software is freely available at: https://github.com/frankMusacchia/VarGenius",
                "authors": [
                    {
                        "name": "Musacchia F."
                    },
                    {
                        "name": "Ciolfi A."
                    },
                    {
                        "name": "Mutarelli M."
                    },
                    {
                        "name": "Bruselles A."
                    },
                    {
                        "name": "Castello R."
                    },
                    {
                        "name": "Pinelli M."
                    },
                    {
                        "name": "Basu S."
                    },
                    {
                        "name": "Banfi S."
                    },
                    {
                        "name": "Casari G."
                    },
                    {
                        "name": "Tartaglia M."
                    },
                    {
                        "name": "Nigro V."
                    },
                    {
                        "name": "Torella A."
                    },
                    {
                        "name": "Esposito G."
                    },
                    {
                        "name": "Cappuccio G."
                    },
                    {
                        "name": "Mancano G."
                    },
                    {
                        "name": "Maitz S."
                    },
                    {
                        "name": "Brunetti-Pierri N."
                    },
                    {
                        "name": "Parenti G."
                    },
                    {
                        "name": "Selicorni A."
                    }
                ],
                "citationCount": 1,
                "date": "2018-12-12T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "VarGenius executes cohort-level DNA-seq variant calling and annotation and allows to manage the resulting data through a PostgreSQL database"
            },
            "type": [
                "Benchmarking study"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "DNA mutation",
            "uri": "http://edamontology.org/topic_2533"
        }
    ],
    "version": [
        "1.0"
    ]
}