{
    "additionDate": "2019-11-14T18:35:14Z",
    "biotoolsCURIE": "biotools:eScreening",
    "biotoolsID": "eScreening",
    "confidence_flag": "medium",
    "credit": [
        {
            "email": "james.pittman@va.gov",
            "name": "James O. E. Pittman",
            "orcidid": "https://orcid.org/0000-0001-9155-2983",
            "typeEntity": "Person"
        }
    ],
    "description": "> MEDIUM CONFIDENCE! | > HOMEPAGE MISSING! | Implementing eScreening technology in four VA clinics | BACKGROUND:Technology-based self-assessment (TB-SA) benefits patients and providers and has shown feasibility, ease of use, efficiency, and cost savings. A promising TB-SA, the VA eScreening program, has shown promise for the efficient and effective collection of mental and physical health information. To assist adoption of eScreening by healthcare providers, we assessed technology-related as well as individual- and system-level factors that might influence the implementation of eScreening in four diverse VA clinics. METHODS:This was a mixed-method, pre-post, quasi-experimental study originally designed as a quality improvement project. The clinics were selected to represent a range of environments that could potentially benefit from TB-SA and that made use of the variety eScreening functions",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://www.ncbi.nlm.nih.gov/pubmed/?term=31462280",
    "lastUpdate": "2019-11-14T18:35:14Z",
    "name": "eScreening",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12913-019-4436-Z",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Technology-based self-assessment (TB-SA) benefits patients and providers and has shown feasibility, ease of use, efficiency, and cost savings. A promising TB-SA, the VA eScreening program, has shown promise for the efficient and effective collection of mental and physical health information. To assist adoption of eScreening by healthcare providers, we assessed technology-related as well as individual- and system-level factors that might influence the implementation of eScreening in four diverse VA clinics. Methods: This was a mixed-method, pre-post, quasi-experimental study originally designed as a quality improvement project. The clinics were selected to represent a range of environments that could potentially benefit from TB-SA and that made use of the variety eScreening functions. Because of limited resources, the implementation strategy consisted of staff education, training, and technical support as needed. Data was collected using pre- and post-implementation interviews or focus groups of leadership and clinical staff, eScreening usage data, and post-implementation surveys. Data was gathered on: 1) usability of eScreening; 2) knowledge about and acceptability and 3) facilitators and barriers to the successful implementation of eScreening. Results: Overall, staff feedback about eScreening was positive. Knowledge about eScreening ranged widely between the clinics. Nearly all staff felt eScreening would fit well into their clinical setting at pre-implementation; however some felt it was a poor fit with emergent cases and older adults at post-implementation. Lack of adequate personnel support and perceived leadership support were barriers to implementation. Adequate training and technical assistance were cited as important facilitators. One clinic fully implemented eScreening, two partially implemented, and one clinic did not implement eScreening as part of normal practice after 6 months as measured by usage data and self-report. Organizational engagement survey scores were higher among clinics with full or partial implementation and low in the clinic that did not implement. Conclusions: Despite some added work load for some staff and perceived lack of leadership support, eScreening was at least partially implemented in three clinics. The technology itself posed no barriers in any of the settings. An implementation strategy that accounts for increased work burden and includes accountability may help in future eScreening implementation efforts. Note. This abstract was previously published (e.g., Annals of Behavioral Medicine 53: S1-S842, 2019).",
                "authors": [
                    {
                        "name": "Pittman J.O.E."
                    },
                    {
                        "name": "Afari N."
                    },
                    {
                        "name": "Floto E."
                    },
                    {
                        "name": "Almklov E."
                    },
                    {
                        "name": "Conner S."
                    },
                    {
                        "name": "Rabin B."
                    },
                    {
                        "name": "Lindamer L."
                    }
                ],
                "citationCount": 1,
                "date": "2019-08-28T00:00:00Z",
                "journal": "BMC Health Services Research",
                "title": "Implementing eScreening technology in four VA clinics: A mixed-method study"
            },
            "pmcid": "PMC6712612",
            "pmid": "31462280"
        }
    ],
    "topic": [
        {
            "term": "Psychiatry",
            "uri": "http://edamontology.org/topic_3419"
        },
        {
            "term": "Preclinical and clinical studies",
            "uri": "http://edamontology.org/topic_3379"
        },
        {
            "term": "Quality affairs",
            "uri": "http://edamontology.org/topic_3393"
        }
    ]
}