{"credit":[],"function":[{"operation":[{"term":"Clustering","uri":"http://edamontology.org/operation_3432"},{"term":"Visualisation","uri":"http://edamontology.org/operation_0337"}]}],"labels":{"language":["C++","Python"],"topic":[{"term":"Protein interactions","uri":"http://edamontology.org/topic_0128"},{"term":"Protein expression","uri":"http://edamontology.org/topic_0108"},{"term":"Machine learning","uri":"http://edamontology.org/topic_3474"}]},"link":[{"type":"REPOSITORY","url":"https://github.com/schulzchristian/vieclus"}],"publication":[{"abstract":"© Springer Science+Business Media, LLC, part of Springer Nature 2020.This paper serves as a user guide to the Vienna graph clustering framework. We review our general memetic algorithm, VieClus, to tackle the graph clustering problem. A key component of our contribution are natural recombine operators that employ ensemble clusterings as well as multi-level techniques. Lastly, we combine these techniques with a scalable communication protocol, producing a system that is able to compute high-quality solutions in a short amount of time. After giving a description of the algorithms employed, we establish the connection of the graph clustering problem to protein–protein interaction networks and moreover give a description on how the software can be used, what file formats are expected, and how this can be used to find functional groups in protein–protein interaction networks.","authors":["Biedermann S.","Henzinger M.","Schulz C.","Schuster B."],"cit_count":0,"doi":"10.1007/978-1-4939-9873-9_16","journal":"Methods in Molecular Biology","pmid":"31583641","title":"Vienna graph clustering","year":"2020-01-01"}],"summary":{"biotoolsCURIE":"biotools:VieClus","biotoolsID":"VieClus","description":"Vienna Graph Clustering.\n\nThe graph clustering framework VieClus -- Vienna Graph Clustering.\n\nThe main project page of to open source framework VieClus -- Vienna Graph Clustering.\n\nThis is the release of our memetic algorithm, VieClus (Vienna Graph Clustering), to tackle the graph clustering problem. A key component of our contribution are natural recombine operators that employ ensemble clusterings as well as multi-level techniques. In our experimental evaluation, we show that our algorithm successfully improves or reproduces all entries of the 10th DIMACS implementation challenge under consideration in a small amount of time. In fact, for most of the small instances, we can improve the old benchmark result in less than a minute. Moreover, while the previous best result for different instances has been computed by a variety of solvers, our algorithm can now be used as a single tool to compute the result.\n\nVieClus - Vienna Graph Clustering is a memetic algorithm","homepage":"http://vieclus.taa.univie.ac.at/","name":"VieClus"}}