{
    "additionDate": "2019-11-14T18:12:46Z",
    "biotoolsCURIE": "biotools:XAEM",
    "biotoolsID": "XAEM",
    "confidence_flag": "tool",
    "description": "Alternating EM algorithm for a bilinear model in isoform quantification from RNA-seq data | Wiki for programs and pipelines for sequencing data analysis | 3. XAEM: step by step instruction and explanation | Annotation reference: XAEM requires a fasta file of transcript sequences and a gtf file of transcript annotation. XAEM supports all kinds of reference and annotation for any species. In the XAEM paper, we use the UCSC hg19 annotation:",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                },
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                },
                {
                    "term": "RNA-Seq quantification",
                    "uri": "http://edamontology.org/operation_3800"
                }
            ]
        }
    ],
    "homepage": "https://github.com/WenjiangDeng/XAEM",
    "lastUpdate": "2024-11-24T20:50:33.021397Z",
    "name": "XAEM",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btz640",
            "metadata": {
                "abstract": "Motivation: Estimation of isoform-level gene expression from RNA-seq data depends on simplifying assumptions, such as uniform read distribution, that are easily violated in real data. Such violations typically lead to biased estimates. Most existing methods provide bias correction step(s), which is based on biological considerations-such as GC content-and applied in single samples separately. The main problem is that not all biases are known. Results: We have developed a novel method called XAEM based on a more flexible and robust statistical model. Existing methods are essentially based on a linear model Xβ, where the design matrix X is known and is computed based on the simplifying assumptions. In contrast XAEM considers Xβ as a bilinear model with both X and β unknown. Joint estimation of X and β is made possible by a simultaneous analysis of multi-sample RNA-seq data. Compared to existing methods, XAEM automatically performs empirical correction of potentially unknown biases. We use an alternating expectation-maximization (AEM) algorithm, alternating between estimation of X and β. For speed XAEM utilizes quasi-mapping for read alignment, thus leading to a fast algorithm. Overall XAEM performs favorably compared to recent advanced methods. For simulated datasets, XAEM obtains higher accuracy for multiple-isoform genes. In a differential-expression analysis of a real single-cell RNA-seq dataset, XAEM achieves substantially better rediscovery rates in independent validation sets.",
                "authors": [
                    {
                        "name": "Deng W."
                    },
                    {
                        "name": "Kalari K.R."
                    },
                    {
                        "name": "Mou T."
                    },
                    {
                        "name": "Niu N."
                    },
                    {
                        "name": "Pawitan Y."
                    },
                    {
                        "name": "Vu T.N."
                    },
                    {
                        "name": "Wang L."
                    }
                ],
                "citationCount": 12,
                "date": "2020-02-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Alternating em algorithm for a bilinear model in isoform quantification from RNA-seq data"
            },
            "pmcid": "PMC9883676",
            "pmid": "31400221"
        }
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ],
    "validated": 1
}
