{
    "additionDate": "2021-01-18T10:33:29Z",
    "biotoolsCURIE": "biotools:aplcms",
    "biotoolsID": "aplcms",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "yutianwei@cuhk.edu.cn",
            "name": "Tianwei Yu",
            "typeEntity": "Person"
        }
    ],
    "description": "The R package apLCMS is designed for the processing of LC/MS based metabolomics data. It starts with a group of LC/MS files in the same folder, and generates a table with features in the rows and intensities in the columns.\nThere are two major routes of data analysis. The first, which we call unsupervised analysis, doesn't use existing knowledge. It detects peaks de novo from the data based on the data itself. The second, which we call hybrid analysis, combines de novo peak detection with existing knowledge. The existing knowledge can come from two sources - known metabolites and historically detected features from the same machinery.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Peak detection",
                    "uri": "http://edamontology.org/operation_3215"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://mypage.cuhk.edu.cn/academics/yutianwei/apLCMS/",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-01-24T18:47:19Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/tianwei-yu/apLCMS"
        }
    ],
    "name": "apLCMS",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1038/S41598-020-70850-0",
            "metadata": {
                "abstract": "© 2020, The Author(s).With the growth of metabolomics research, more and more studies are conducted on large numbers of samples. Due to technical limitations of the Liquid Chromatography–Mass Spectrometry (LC/MS) platform, samples often need to be processed in multiple batches. Across different batches, we often observe differences in data characteristics. In this work, we specifically focus on data generated in multiple batches on the same LC/MS machinery. Traditional preprocessing methods treat all samples as a single group. Such practice can result in errors in the alignment of peaks, which cannot be corrected by post hoc application of batch effect correction methods. In this work, we developed a new approach that address the batch effect issue in the preprocessing stage, resulting in better peak detection, alignment and quantification. It can be combined with down-stream batch effect correction methods to further correct for between-batch intensity differences. The method is implemented in the existing workflow of the apLCMS platform. Analyzing data with multiple batches, both generated from standardized quality control (QC) plasma samples and from real biological studies, the new method resulted in feature tables with better consistency, as well as better down-stream analysis results. The method can be a useful addition to the tools available for large studies involving multiple batches. The method is available as part of the apLCMS package. Download link and instructions are at https://mypage.cuhk.edu.cn/academics/yutianwei/apLCMS/.",
                "authors": [
                    {
                        "name": "Liu Q."
                    },
                    {
                        "name": "Walker D."
                    },
                    {
                        "name": "Uppal K."
                    },
                    {
                        "name": "Liu Z."
                    },
                    {
                        "name": "Ma C."
                    },
                    {
                        "name": "Tran V.L."
                    },
                    {
                        "name": "Li S."
                    },
                    {
                        "name": "Jones D.P."
                    },
                    {
                        "name": "Yu T."
                    }
                ],
                "citationCount": 3,
                "date": "2020-12-01T00:00:00Z",
                "journal": "Scientific Reports",
                "title": "Addressing the batch effect issue for LC/MS metabolomics data in data preprocessing"
            },
            "pmcid": "PMC7431853",
            "pmid": "32807888"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Endocrinology and metabolism",
            "uri": "http://edamontology.org/topic_3407"
        }
    ],
    "validated": 1
}