{
    "accessibility": "Open access",
    "additionDate": "2022-11-09T17:30:10.565087Z",
    "biotoolsCURIE": "biotools:medicdeeplabv3",
    "biotoolsID": "medicdeeplabv3",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Juan Miguel Valverde"
        },
        {
            "name": "Jussi Tohka"
        }
    ],
    "description": "MedicDeepLabv3plus is a convolutional neural network based on DeepLabv3+ implemented in Python and Pytorch to extract the brain mask and the contralateral hemisphere of rodent MRI brain scans with lesions.",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://github.com/jmlipman/MedicDeepLabv3Plus",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-11-09T17:30:10.567635Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://zenodo.org/record/4943765"
        }
    ],
    "name": "MedicDeepLabv3+",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1007/S12021-022-09607-1",
            "metadata": {
                "abstract": "© 2022, The Author(s).We present MedicDeepLabv3+, a convolutional neural network that is the first completely automatic method to segment cerebral hemispheres in magnetic resonance (MR) volumes of rats with ischemic lesions. MedicDeepLabv3+ improves the state-of-the-art DeepLabv3+ with an advanced decoder, incorporating spatial attention layers and additional skip connections that, as we show in our experiments, lead to more precise segmentations. MedicDeepLabv3+ requires no MR image preprocessing, such as bias-field correction or registration to a template, produces segmentations in less than a second, and its GPU memory requirements can be adjusted based on the available resources. We optimized MedicDeepLabv3+ and six other state-of-the-art convolutional neural networks (DeepLabv3+, UNet, HighRes3DNet, V-Net, VoxResNet, Demon) on a heterogeneous training set comprised by MR volumes from 11 cohorts acquired at different lesion stages. Then, we evaluated the trained models and two approaches specifically designed for rodent MRI skull stripping (RATS and RBET) on a large dataset of 655 MR rat brain volumes. In our experiments, MedicDeepLabv3+ outperformed the other methods, yielding an average Dice coefficient of 0.952 and 0.944 in the brain and contralateral hemisphere regions. Additionally, we show that despite limiting the GPU memory and the training data, our MedicDeepLabv3+ also provided satisfactory segmentations. In conclusion, our method, publicly available at https://github.com/jmlipman/MedicDeepLabv3Plus, yielded excellent results in multiple scenarios, demonstrating its capability to reduce human workload in rat neuroimaging studies.",
                "authors": [
                    {
                        "name": "De Feo R."
                    },
                    {
                        "name": "Shatillo A."
                    },
                    {
                        "name": "Tohka J."
                    },
                    {
                        "name": "Valverde J.M."
                    }
                ],
                "date": "2022-01-01T00:00:00Z",
                "journal": "Neuroinformatics",
                "title": "Automatic Cerebral Hemisphere Segmentation in Rat MRI with Ischemic Lesions via Attention-based Convolutional Neural Networks"
            },
            "pmid": "36178571"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        }
    ]
}
