{
    "additionDate": "2015-05-20T11:32:54Z",
    "biotoolsCURIE": "biotools:conet",
    "biotoolsID": "conet",
    "credit": [
        {
            "name": "Karoline Faust",
            "typeEntity": "Person",
            "typeRole": [
                "Developer"
            ]
        },
        {
            "name": "Gipsi Lima-Mendez",
            "typeRole": [
                "Contributor"
            ]
        },
        {
            "name": "Jean-Sebastien Lerat",
            "typeRole": [
                "Contributor"
            ]
        },
        {
            "name": "VUB",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        },
        {
            "name": "KU Leuven",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        },
        {
            "name": "VIB",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        },
        {
            "name": "vib-kuleuven.be",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        },
        {
            "email": "karoline.faust@vib-kuleuven.be",
            "name": "Karoline Faust",
            "typeRole": [
                "Support"
            ],
            "url": "http://www.raeslab.org"
        },
        {
            "email": "karoline.faust@vib-kuleuven.be",
            "name": "Karoline Faust",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.raeslab.org"
        }
    ],
    "description": "Tool that detects significant non-random patterns of co-occurrence (copresence and mutual exclusion) in incidence and abundance data.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://psbweb05.psb.ugent.be/conet/documentation.php"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://psbweb05.psb.ugent.be/conet/documents/CoNetDoc.pdf"
        },
        {
            "type": "Binaries",
            "url": "http://psbweb05.psb.ugent.be/conet/documents/CoNetDoc.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "note": "CoNet is a similarity-based network inference tool.",
            "operation": [
                {
                    "term": "Pathway or network prediction",
                    "uri": "http://edamontology.org/operation_3439"
                }
            ]
        }
    ],
    "homepage": "http://www.raeslab.org/software/conet.html",
    "language": [
        "Java"
    ],
    "lastUpdate": "2019-01-09T15:42:52Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "http://psbweb05.psb.ugent.be/conet/documents/CoNetDoc.pdf"
        }
    ],
    "maturity": "Mature",
    "name": "CoNet",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "karoline.faust@vib-kuleuven.be",
    "publication": [
        {
            "doi": "10.1371/journal.pcbi.1002606",
            "metadata": {
                "abstract": "The healthy microbiota show remarkable variability within and among individuals. In addition to external exposures, ecological relationships (both oppositional and symbiotic) between microbial inhabitants are important contributors to this variation. It is thus of interest to assess what relationships might exist among microbes and determine their underlying reasons. The initial Human Microbiome Project (HMP) cohort, comprising 239 individuals and 18 different microbial habitats, provides an unprecedented resource to detect, catalog, and analyze such relationships. Here, we applied an ensemble method based on multiple similarity measures in combination with generalized boosted linear models (GBLMs) to taxonomic marker (16S rRNA gene) profiles of this cohort, resulting in a global network of 3,005 significant co-occurrence and co-exclusion relationships between 197 clades occurring throughout the human microbiome. This network revealed strong niche specialization, with most microbial associations occurring within body sites and a number of accompanying inter-body site relationships. Microbial communities within the oropharynx grouped into three distinct habitats, which themselves showed no direct influence on the composition of the gut microbiota. Conversely, niches such as the vagina demonstrated little to no decomposition into region-specific interactions. Diverse mechanisms underlay individual interactions, with some such as the co-exclusion of Porphyromonaceae family members and Streptococcus in the subgingival plaque supported by known biochemical dependencies. These differences varied among broad phylogenetic groups as well, with the Bacilli and Fusobacteria, for example, both enriched for exclusion of taxa from other clades. Comparing phylogenetic versus functional similarities among bacteria, we show that dominant commensal taxa (such as Prevotellaceae and Bacteroides in the gut) often compete, while potential pathogens (e.g. Treponema and Prevotella in the dental plaque) are more likely to co-occur in complementary niches. This approach thus serves to open new opportunities for future targeted mechanistic studies of the microbial ecology of the human microbiome. © 2012 Faust et al.",
                "authors": [
                    {
                        "name": "Faust K."
                    },
                    {
                        "name": "Sathirapongsasuti J.F."
                    },
                    {
                        "name": "Izard J."
                    },
                    {
                        "name": "Segata N."
                    },
                    {
                        "name": "Gevers D."
                    },
                    {
                        "name": "Raes J."
                    },
                    {
                        "name": "Huttenhower C."
                    }
                ],
                "citationCount": 651,
                "date": "2012-07-01T00:00:00Z",
                "journal": "PLoS Computational Biology",
                "title": "Microbial co-occurrence relationships in the Human Microbiome"
            },
            "pmcid": "PMC3395616",
            "pmid": "22807668",
            "type": [
                "Primary"
            ]
        },
        {
            "metadata": {
                "abstract": "Metagenomics and 16S pyrosequencing have enabled the study of ecosystem structure and dynamics to great depth and accuracy. Co-occurrence and correlation patterns found in these data sets are increasingly used for the prediction of species interactions in environments ranging from the oceans to the human microbiome. In addition, parallelized co-culture assays and combinatorial labelling experiments allow high-throughput discovery of cooperative and competitive relationships between species. In this Review, we describe how these techniques are opening the way towards global ecosystem network prediction and the development of ecosystem-wide dynamic models. © 2012 Macmillan Publishers Limited. All rights reserved.",
                "authors": [
                    {
                        "name": "Faust K."
                    },
                    {
                        "name": "Raes J."
                    }
                ],
                "citationCount": 555,
                "date": "2012-08-01T00:00:00Z",
                "journal": "Nature Reviews Microbiology",
                "title": "Microbial interactions: From networks to models"
            },
            "pmid": "22796884",
            "type": [
                "Other"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Systems biology",
            "uri": "http://edamontology.org/topic_2259"
        }
    ],
    "validated": 1,
    "version": [
        "1"
    ]
}