{
    "additionDate": "2017-01-13T13:14:11Z",
    "biotoolsCURIE": "biotools:copyseq",
    "biotoolsID": "copyseq",
    "description": "A computataional approuch for the inference of copy-number genotypes from personal genome sequencing data.",
    "editPermission": {
        "authors": [
            "ELIXIR-EE"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genetic variation analysis",
                    "uri": "http://edamontology.org/operation_3197"
                },
                {
                    "term": "Statistical calculation",
                    "uri": "http://edamontology.org/operation_2238"
                },
                {
                    "term": "Copy number estimation",
                    "uri": "http://edamontology.org/operation_3233"
                }
            ]
        }
    ],
    "homepage": "http://www.embl.de/%7Ekorbel/CopySeq/",
    "homepage_status": 1,
    "language": [
        "R",
        "Java"
    ],
    "lastUpdate": "2018-12-10T12:58:49Z",
    "maturity": "Mature",
    "name": "CopySeq",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "seqwiki_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Copy-number variations (CNVs) are widespread in the human genome, but comprehensive assignments of integer locus copy-numbers (i.e., copy-number genotypes) that, for example, enable discrimination of homozygous from heterozygous CNVs, have remained challenging. Here we present CopySeq, a novel computational approach with an underlying statistical framework that analyzes the depth-of-coverage of high-throughput DNA sequencing reads, and can incorporate paired-end and breakpoint junction analysis based CNV-analysis approaches, to infer locus copy-number genotypes. We benchmarked CopySeq by genotyping 500 chromosome 1 CNV regions in 150 personal genomes sequenced at low-coverage. The assessed copy-number genotypes were highly concordant with our performed qPCR experiments (Pearson correlation coefficient 0.94), and with the published results of two microarray platforms (95-99% concordance). We further demonstrated the utility of CopySeq for analyzing gene regions enriched for segmental duplications by comprehensively inferring copy-number genotypes in the CNV-enriched >800 olfactory receptor (OR) human gene and pseudogene loci. CopySeq revealed that OR loci display an extensive range of locus copy-numbers across individuals, with zero to two copies in some OR loci, and two to nine copies in others. Among genetic variants affecting OR loci we identified deleterious variants including CNVs and SNPs affecting ~15% and~20% of the human OR gene repertoire, respectively, implying that genetic variants with a possible impact on smell perception are widespread. Finally, we found that for several OR loci the reference genome appears to represent a minor-frequency variant, implying a necessary revision of the OR repertoire for future functional studies. CopySeq can ascertain genomic structural variation in specific gene families as well as at a genome-wide scale, where it may enable the quantitative evaluation of CNVs in genome-wide association studies involving high-throughput sequencing. © 2010 Waszak et al.",
                "authors": [
                    {
                        "name": "Waszak S.M."
                    },
                    {
                        "name": "Hasin Y."
                    },
                    {
                        "name": "Zichner T."
                    },
                    {
                        "name": "Olender T."
                    },
                    {
                        "name": "Keydar I."
                    },
                    {
                        "name": "Khen M."
                    },
                    {
                        "name": "Stutz A.M."
                    },
                    {
                        "name": "Schlattl A."
                    },
                    {
                        "name": "Lancet D."
                    },
                    {
                        "name": "Korbel J.O."
                    }
                ],
                "citationCount": 45,
                "date": "2010-11-01T00:00:00Z",
                "journal": "PLoS Computational Biology",
                "title": "Systematic inference of copy-number genotypes from personal genome sequencing data reveals extensive olfactory receptor gene content diversity"
            },
            "pmid": "21085617"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "DNA structural variation",
            "uri": "http://edamontology.org/topic_3175"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Personalised medicine",
            "uri": "http://edamontology.org/topic_3577"
        },
        {
            "term": "Human genetics",
            "uri": "http://edamontology.org/topic_3574"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        }
    ],
    "validated": 1
}