
{
    "credit": [
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                },
                {
                    "term": "Mapping",
                    "uri": "http://edamontology.org/operation_2429"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Python"
        ],
        "topic": [
            {
                "term": "Molecular biology",
                "uri": "http://edamontology.org/topic_3047"
            },
            {
                "term": "Cell biology",
                "uri": "http://edamontology.org/topic_2229"
            },
            {
                "term": "Mapping",
                "uri": "http://edamontology.org/topic_0102"
            }
        ]
    },
    "publication": [
        {
            "abstract": "We present a Bayesian framework for inferring spatio-temporal maps of diffusivity and potential fields from recorded trajectories of single molecules inside living cells. The framework naturally lets us regularise the high-dimensional inference problem using prior distributions in order to obtain robust results. To overcome the computational complexity of inferring thousands of map parameters from large single particle tracking datasets, we developed a stochastic optimisation method based on local mini-batches and parsimonious gradient calculation. We quantified the gain in convergence speed on numerical simulations, and we demonstrated for the first time temporal regularisation and aligned values of the inferred potential fields across multiple time segments. As a proof-of-concept, we mapped the dynamics of HIV-1 Gag proteins involved in the formation of virus-like particles (VLPs) on the plasma membrane of live T cells at high spatial and temporal resolutions. We focused on transient aggregation events lasting only on tenth of the time required for full VLP formation. The framework and optimisation methods are implemented in the TRamWAy open-source software platform for analysing single biomolecule dynamics.",
            "authors": [
                "Laurent F.",
                "Floderer C.",
                "Favard C.",
                "Muriaux D.",
                "Masson J.-B.",
                "Vestergaard C.L."
            ],
            "cit_count": 0,
            "doi": "10.1088/1478-3975/AB5167",
            "journal": "Physical biology",
            "pmid": "31765328",
            "title": "Mapping spatio-temporal dynamics of single biomolecules in living cells",
            "year": "2019-11-25"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:TRamWAy",
        "biotoolsID": "TRamWAy",
        "description": "Mapping spatio-temporal dynamics of single biomolecules in living cells.\n\nTRamWAy helps analyzing single molecule dynamics. It infers the diffusivity, drift, force and potential energy across space and time",
        "homepage": "http://github.com/DecBayComp/TRamWAy",
        "name": "TRamWAy"
    }
}