
{
    "credit": [
        {
            "email": "bushman@mail.med.upenn.edu",
            "name": "Frederic D. Bushman",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "https://github.com/BushmanLab/INSPIIRED/blob/master/README.md"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Genetic variation analysis",
                    "uri": "http://edamontology.org/operation_3197"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "R"
        ],
        "license": "GPL-3.0",
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Suite"
        ],
        "topic": [
            {
                "term": "Genomics",
                "uri": "http://edamontology.org/topic_0622"
            },
            {
                "term": "Epigenetics",
                "uri": "http://edamontology.org/topic_3295"
            },
            {
                "term": "DNA replication and recombination",
                "uri": "http://edamontology.org/topic_3127"
            }
        ]
    },
    "link": [
        {
            "type": "Issue tracker",
            "url": "https://github.com/BushmanLab/INSPIIRED/issues"
        }
    ],
    "publication": [
        {
            "abstract": "© 2017 The AuthorsAnalysis of sites of newly integrated DNA in cellular genomes is important to several fields, but methods for analyzing and visualizing these datasets are still under development. Here, we describe tools for data analysis and visualization that take as input integration site data from our INSPIIRED pipeline. Paired-end sequencing allows inference of the numbers of transduced cells as well as the distributions of integration sites in target genomes. We present interactive heatmaps that allow comparison of distributions of integration sites to genomic features and that support numerous user-defined statistical tests. To summarize integration site data from human gene therapy samples, we developed a reproducible report format that catalogs sample population structure, longitudinal dynamics, and integration frequency near cancer-associated genes. We also introduce a novel summary statistic, the UC50 (unique cell progenitors contributing the most expanded 50% of progeny cell clones), which provides a single number summarizing possible clonal expansion. Using these tools, we characterize ongoing longitudinal characterization of a patient from the first trial to treat severe combined immunodeficiency-X1 (SCID-X1), showing successful reconstitution for 15 years accompanied by persistence of a cell clone with an integration site near the cancer-associated gene CCND2. Software is available at https://github.com/BushmanLab/INSPIIRED.",
            "authors": [
                "Berry C.C.",
                "Nobles C.",
                "Six E.",
                "Wu Y.",
                "Malani N.",
                "Sherman E.",
                "Dryga A.",
                "Everett J.K.",
                "Male F.",
                "Bailey A.",
                "Bittinger K.",
                "Drake M.J.",
                "Caccavelli L.",
                "Bates P.",
                "Hacein-Bey-Abina S.",
                "Cavazzana M.",
                "Bushman F.D."
            ],
            "cit_count": 5,
            "doi": "10.1016/j.omtm.2016.11.003",
            "journal": "Molecular Therapy - Methods and Clinical Development",
            "title": "INSPIIRED: Quantification and Visualization Tools for Analyzing Integration Site Distributions",
            "type": "Primary",
            "year": "2017-03-17"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:inspiired",
        "biotoolsID": "inspiired",
        "description": "INSPIIRED is a software suite designed to study viral integration sites and the longitudinal outcomes of gene therapy patients.",
        "homepage": "https://github.com/BushmanLab/INSPIIRED",
        "name": "INSPIIRED"
    }
}