{
    "additionDate": "2017-01-17T14:51:25Z",
    "biotoolsCURIE": "biotools:vems",
    "biotoolsID": "vems",
    "collectionID": [
        "ms-utils",
        "Proteomics"
    ],
    "credit": [
        {
            "email": "webmaster@ms-utils.org",
            "typeEntity": "Person",
            "typeRole": [
                "Documentor"
            ],
            "url": "http://ms-utils.org"
        }
    ],
    "description": "Platform for protein identification and characterization.",
    "editPermission": {
        "authors": [
            "proteomics.bio.tools"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Blind peptide database search",
                    "uri": "http://edamontology.org/operation_3647"
                }
            ]
        }
    ],
    "homepage": "http://portugene.com/vems.html",
    "lastUpdate": "2019-03-26T08:42:12Z",
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://ms-utils.org"
        }
    ],
    "name": "VEMS",
    "owner": "msutils_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Protein and peptide mass analysis and amino acid sequencing by mass spectrometry is widely used for identification and annotation of post-translational modifications (PTMs) in proteins. Modification-specific mass increments, neutral losses or diagnostic fragment ions in peptide mass spectra provide direct evidence for the presence of post-translational modifications, such as phosphorylation, acetylation, methylation or glycosylation. However, the commonly used database search engines are not always practical for exhaustive searches for multiple modifications and concomitant missed proteolytic cleavage sites in large-scale proteomic datasets, since the search space is dramatically expanded. We present a formal definition of the problem of searching databases with tandem mass spectra of peptides that are partially (sub-stoichiometrically) modified. In addition, an improved search algorithm and peptide scoring scheme that includes modification specific ion information from MS/MS spectra was implemented and tested using the Virtual Expert Mass Spectrometrist (VEMS) software. A set of 2825 peptide MS/MS spectra were searched with 16 variable modifications and 6 missed cleavages. The scoring scheme returned a large set of post-translationally modified peptides including precise information on modification type and position. The scoring scheme was able to extract and distinguish the near-isobaric modifications of trimethylation and acetylation of lysine residues based on the presence and absence of diagnostic neutral losses and immonium ions. In addition, the VEMS software contains a range of new features for analysis of mass spectrometry data obtained in large-scale proteomic experiments. © 2005 American Chemical Society.",
                "authors": [
                    {
                        "name": "Matthiesen R."
                    },
                    {
                        "name": "Trelle M.B."
                    },
                    {
                        "name": "Hojrup P."
                    },
                    {
                        "name": "Bunkenborg J."
                    },
                    {
                        "name": "Jensen O.N."
                    }
                ],
                "citationCount": 103,
                "date": "2005-11-01T00:00:00Z",
                "journal": "Journal of Proteome Research",
                "title": "VEMS 3.0: Algorithms and computational tools for tandem mass spectrometry based identification of post-translational modifications in proteins"
            },
            "pmid": "16335983"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        }
    ]
}