{"credit":[{"name":"Contact Form","typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://supfam.org/SUPERFAMILY/feedback.html"}],"documentation":[{"type":"GENERAL","url":"http://supfam.org/SUPERFAMILY/sitemap.html#documentation"}],"function":[{"operation":[{"term":"Protein super-secondary structure prediction","uri":"http://edamontology.org/operation_0268"},{"term":"Protein fold recognition","uri":"http://edamontology.org/operation_0303"},{"term":"Protein structure assignment","uri":"http://edamontology.org/operation_0320"},{"term":"Structure classification","uri":"http://edamontology.org/operation_2996"}]}],"labels":{"operatingSystem":["Linux","Windows","Mac"],"toolType":["Database portal"],"topic":[{"term":"Protein folds and structural domains","uri":"http://edamontology.org/topic_0736"},{"term":"Ontology and terminology","uri":"http://edamontology.org/topic_0089"},{"term":"Genotype and phenotype","uri":"http://edamontology.org/topic_0625"},{"term":"Metagenomics","uri":"http://edamontology.org/topic_3174"},{"term":"Gene and protein families","uri":"http://edamontology.org/topic_0623"}]},"publication":[{"abstract":"The SUPERFAMILY resource provides protein domain assignments at the structural classification of protein (SCOP) superfamily level for over 1400 completely sequenced genomes, over 120 metagenomes and other gene collections such as UniProt. All models and assignments are available to browse and download at http://supfam.org. A new hidden Markov model library based on SCOP 1.75 has been created and a previously ignored class of SCOP, coiled coils, is now included. Our scoring component now uses HMMER3, which is in orders of magnitude faster and produces superior results. A cloud-based pipeline was implemented and is publicly available at Amazon web services elastic computer cloud. The SUPERFAMILY reference tree of life has been improved allowing the user to highlight a chosen superfamily, family or domain architecture on the tree of life. The most significant advance in SUPERFAMILY is that now it contains a domain-based gene ontology (GO) at the superfamily and family levels. A new methodology was developed to ensure a high quality GO annotation. The new methodology is general purpose and has been used to produce domainbased phenotypic ontologies in addition to GO. © The Author(s) 2010.","authors":["De Lima Morais D.A.","Fang H.","Rackham O.J.L.","Wilson D.","Pethica R.","Chothia C.","Gough J."],"cit_count":91,"journal":"Nucleic Acids Research","pmid":"21062816","title":"SUPERFAMILY 1.75 including a domain-centric gene ontology method","year":"2011-01-01"}],"summary":{"biotoolsCURIE":"biotools:superfamily","biotoolsID":"superfamily","description":"It provides protein domain assignments at the structural classification of protein superfamily level for completely sequenced genomes, metagenomes and other gene collections such as UniProt. Our scoring component now uses HMMER3. A cloud-based pipeline was implemented and is publicly available. The SUPERFAMILY reference tree of life has been improved allowing the user to highlight a chosen superfamily, family or domain architecture on the tree of life.","homepage":"http://supfam.org","name":"SUPERFAMILY"}}