{
    "additionDate": "2018-04-29T11:01:16Z",
    "biotoolsCURIE": "biotools:metamis",
    "biotoolsID": "metamis",
    "credit": [
        {
            "name": "Support",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://sourceforge.net/u/tzunwen/profile/"
        }
    ],
    "description": "Metagenomic microbial interaction simulator based on microbial community profiles.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://sourceforge.net/projects/metamis/files/MetaMIS_v1/MetaMIS_User_Guide.pdf/download"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Metabolic network modelling",
                    "uri": "http://edamontology.org/operation_3660"
                },
                {
                    "term": "Network simulation",
                    "uri": "http://edamontology.org/operation_3562"
                }
            ]
        }
    ],
    "homepage": "https://sourceforge.net/projects/metamis/",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2018-12-10T12:58:57Z",
    "name": "MetaMIS",
    "operatingSystem": [
        "Mac",
        "Windows"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1186/S12859-016-1359-0",
            "metadata": {
                "abstract": "© 2016 The Author(s).Background: The complexity and dynamics of microbial communities are major factors in the ecology of a system. With the NGS technique, metagenomics data provides a new way to explore microbial interactions. Lotka-Volterra models, which have been widely used to infer animal interactions in dynamic systems, have recently been applied to the analysis of metagenomic data. Results: In this paper, we present the Lotka-Volterra model based tool, the Metagenomic Microbial Interacticon Simulator (MetaMIS), which is designed to analyze the time series data of microbial community profiles. MetaMIS first infers underlying microbial interactions from abundance tables for operational taxonomic units (OTUs) and then interprets interaction networks using the Lotka-Volterra model. We also embed a Bray-Curtis dissimilarity method in MetaMIS in order to evaluate the similarity to biological reality. MetaMIS is designed to tolerate a high level of missing data, and can estimate interaction information without the influence of rare microbes. For each interaction network, MetaMIS systematically examines interaction patterns (such as mutualism or competition) and refines the biotic role within microbes. As a case study, we collect a human male fecal microbiome and show that Micrococcaceae, a relatively low abundance OTU, is highly connected with 13 dominant OTUs and seems to play a critical role. MetaMIS is able to organize multiple interaction networks into a consensus network for comparative studies; thus we as a case study have also identified a consensus interaction network between female and male fecal microbiomes. Conclusions: MetaMIS provides an efficient and user-friendly platform that may reveal new insights into metagenomics data. MetaMIS is freely available at: https://sourceforge.net/projects/metamis/.",
                "authors": [
                    {
                        "name": "Pao Y.-Y."
                    },
                    {
                        "name": "Shaw G.T.-W."
                    },
                    {
                        "name": "Wang D."
                    }
                ],
                "citationCount": 35,
                "date": "2016-11-25T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "MetaMIS: A metagenomic microbial interaction simulator based on microbial community profiles"
            },
            "pmcid": "PMC5124289",
            "pmid": "27887570"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "Microbiology",
            "uri": "http://edamontology.org/topic_3301"
        },
        {
            "term": "Population genetics",
            "uri": "http://edamontology.org/topic_3056"
        },
        {
            "term": "Simulation experiment",
            "uri": "http://edamontology.org/topic_3524"
        }
    ],
    "validated": 1
}
