{
    "additionDate": "2021-01-18T11:36:26Z",
    "biotoolsCURIE": "biotools:m2gmda",
    "biotoolsID": "m2gmda",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "liubailong@cumt.edu.cn",
            "name": "Bailong Liu",
            "orcidid": "https://orcid.org/0000-0001-5112-7720",
            "typeEntity": "Person"
        },
        {
            "email": "zwli@cumt.edu.cn",
            "name": "Zhengwei Li",
            "typeEntity": "Person"
        }
    ],
    "description": "Predicting MiRNA-disease associations by multiple meta-paths fusion graph embedding model.\n\nPredicting MiRNA-disease Associations by Multiple Meta-paths Fusion Graph Embedding Model（M2GMDA）.\n\n(1)M2GMDA.py：gereating meta-paths from the dataset of miRNA-disease associations,disease semantic similarity, miRNA functional similarity. all the result is saved in the folds named \"5.mid result\" and \"6.meta path\", which need to be created by yourselves.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "miRNA target prediction",
                    "uri": "http://edamontology.org/operation_0463"
                },
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                },
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                }
            ]
        }
    ],
    "homepage": "https://github.com/dangdangzhang/M2GMDA",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-02-19T08:15:50Z",
    "name": "M2GMDA",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1186/S12859-020-03765-2",
            "metadata": {
                "abstract": "© 2020, The Author(s).Background: Many studies prove that miRNAs have significant roles in diagnosing and treating complex human diseases. However, conventional biological experiments are too costly and time-consuming to identify unconfirmed miRNA-disease associations. Thus, computational models predicting unidentified miRNA-disease pairs in an efficient way are becoming promising research topics. Although existing methods have performed well to reveal unidentified miRNA-disease associations, more work is still needed to improve prediction performance. Results: In this work, we present a novel multiple meta-paths fusion graph embedding model to predict unidentified miRNA-disease associations (M2GMDA). Our method takes full advantage of the complex structure and rich semantic information of miRNA-disease interactions in a self-learning way. First, a miRNA-disease heterogeneous network was derived from verified miRNA-disease pairs, miRNA similarity and disease similarity.All meta-path instances connecting miRNAs with diseases were extracted to describe intrinsic information about miRNA-disease interactions. Then, we developed a graph embedding model to predict miRNA-disease associations. The model is composed of linear transformations of miRNAs and diseases, the means encoder of a single meta-path instance, the attention-aware encoder of meta-path type and attention-aware multiple meta-path fusion. We innovatively integrated meta-path instances, meta-path based neighbours, intermediate nodes in meta-paths and more information to strengthen the prediction in our model. In particular, distinct contributions of different meta-path instances and meta-path types were combined with attention mechanisms. The data sets and source code that support the findings of this study are available at https://github.com/dangdangzhang/M2GMDA. Conclusions: M2GMDA achieved AUCs of 0.9323 and 0.9182 in global leave-one-out cross validation and fivefold cross validation with HDMM V2.0. The results showed that our method outperforms other prediction methods. Three kinds of case studies with lung neoplasms, breast neoplasms, prostate neoplasms, pancreatic neoplasms, lymphoma and colorectal neoplasms demonstrated that 47, 50, 49, 48, 50 and 50 out of the top 50 candidate miRNAs predicted by M2GMDA were validated by biological experiments. Therefore, it further confirms the prediction performance of our method.",
                "authors": [
                    {
                        "name": "Zhang L."
                    },
                    {
                        "name": "Liu B."
                    },
                    {
                        "name": "Li Z."
                    },
                    {
                        "name": "Zhu X."
                    },
                    {
                        "name": "Liang Z."
                    },
                    {
                        "name": "An J."
                    }
                ],
                "date": "2020-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Predicting MiRNA-disease associations by multiple meta-paths fusion graph embedding model"
            },
            "pmcid": "PMC7579830",
            "pmid": "33087064"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Cardiology",
            "uri": "http://edamontology.org/topic_3335"
        }
    ]
}