{
    "additionDate": "2021-01-18T09:30:43Z",
    "biotoolsCURIE": "biotools:impmd",
    "biotoolsID": "impmd",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "xuyan@ustb.edu.cn",
            "name": "Yan Xu",
            "typeEntity": "Person"
        }
    ],
    "description": "An Integrated Method for Predicting Potential Associations Between miRNAs and Diseases.\n\n<h4>Background< h4>With the rapid development of biological research, microRNAs (miRNAs) have increasingly attracted worldwide attention. The increasing biological studies and scientific experiments have proven that miRNAs are related to the occurrence and development of a large number of key biological processes which cause complex human diseases. Thus, identifying the association between miRNAs and disease is helpful to diagnose the diseases. Although some studies have found considerable associations between miRNAs and diseases, there are still a lot of associations that need to be identified. Experimental methods to uncover miRNA-disease associations are time-consuming and expensive",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "miRNA target prediction",
                    "uri": "http://edamontology.org/operation_0463"
                },
                {
                    "term": "miRNA expression analysis",
                    "uri": "http://edamontology.org/operation_3792"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Sunmile/IMPMD",
    "language": [
        "C",
        "C++",
        "Java",
        "Python"
    ],
    "lastUpdate": "2021-02-04T07:48:33Z",
    "name": "IMPMD",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.2174/1389202920666191023090215",
            "metadata": {
                "abstract": "© 2019 Bentham Science Publishers.Background: With the rapid development of biological research, microRNAs (miRNAs) have increasingly attracted worldwide attention. The increasing biological studies and scientific experiments have proven that miRNAs are related to the occurrence and development of a large number of key biological processes which cause complex human diseases. Thus, identifying the association between miR-NAs and disease is helpful to diagnose the diseases. Although some studies have found considerable associations between miRNAs and diseases, there are still a lot of associations that need to be identified. Experimental methods to uncover miRNA-disease associations are time-consuming and expensive. Therefore, effective computational methods are urgently needed to predict new associations. Methodology: In this work, we propose an integrated method for predicting potential associations between miRNAs and diseases (IMPMD). The enhanced similarity for miRNAs is obtained by combination of functional similarity, gaussian similarity and Jaccard similarity. To diseases, it is obtained by combination of semantic similarity, gaussian similarity and Jaccard similarity. Then, we use these two enhanced similarities to construct the features and calculate cumulative score to choose robust features. Finally, the general linear regression is applied to assign weights for Support Vector Machine, K-Nearest Neighbor and Logistic Regression algorithms. Results: IMPMD obtains AUC of 0.9386 in 10-fold cross-validation, which is better than most of the previous models. To further evaluate our model, we implement IMPMD on two types of case studies for lung cancer and breast cancer. 49 (Lung Cancer) and 50 (Breast Cancer) out of the top 50 related miRNAs are validated by experimental discoveries. Conclusion: We built a software named IMPMD which can be freely downloaded from https:// github.com/Sunmile/IMPMD.",
                "authors": [
                    {
                        "name": "Wu M."
                    },
                    {
                        "name": "Yang Y."
                    },
                    {
                        "name": "Wang H."
                    },
                    {
                        "name": "Ding J."
                    },
                    {
                        "name": "Zhu H."
                    },
                    {
                        "name": "Xu Y."
                    }
                ],
                "date": "2019-01-01T00:00:00Z",
                "journal": "Current Genomics",
                "title": "IMPMD: An integrated method for predicting potential associations between miRNAs and diseases"
            },
            "pmcid": "PMC7290057",
            "pmid": "32581646"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Cardiology",
            "uri": "http://edamontology.org/topic_3335"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ]
}