{
    "additionDate": "2020-01-09T17:45:11Z",
    "biotoolsCURIE": "biotools:CPlantBox",
    "biotoolsID": "CPlantBox",
    "confidence_flag": "tool",
    "description": "whole plant modelling framework for the simulation of water and carbon related processes.\n\nOutput of CPlantBox-PiafMunch coupling.\n\nSimulation output of CPlantBox-PiafMunch coupling. Example 2-4",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Modelling and simulation",
                    "uri": "http://edamontology.org/operation_2426"
                },
                {
                    "term": "Phasing",
                    "uri": "http://edamontology.org/operation_3454"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Plant-Root-Soil-Interactions-Modelling/CPlantBox/",
    "language": [
        "C++",
        "Python"
    ],
    "lastUpdate": "2020-12-16T18:49:08Z",
    "license": "GPL-3.0",
    "link": [
        {
            "note": "Model parameters",
            "type": [
                "Other"
            ],
            "url": "http://doi.org/10.6084/m9.figshare.9785396"
        },
        {
            "type": [
                "Repository"
            ],
            "url": "https://doi.org/10.5281/zenodo.3518068"
        }
    ],
    "name": "CPlantBox",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1101/810507"
        },
        {
            "doi": "10.1093/insilicoplants/diaa001",
            "metadata": {
                "abstract": "© 2020 The Author(s).The interaction between carbon and flows within the vasculature is at the centre of most growth and developmental processes. Understanding how these fluxes influence each other, and how they respond to heterogeneous environmental conditions, is important to answer diverse questions in agricultural and natural ecosystem sciences. However, due to the high complexity of the plant-environment system, specific tools are needed to perform such quantitative analyses. Here, we present CPlantBox, a whole-plant modelling framework based on the root system model CRootBox. CPlantBox is capable of simulating the growth and development of a variety of plant architectures (root and shoot). In addition, the flexibility of CPlantBox enables its coupling with external modelling tools. Here, we connected the model to an existing mechanistic model of water and carbon flows in the plant, PiafMunch. The usefulness of the CPlantBox modelling framework is exemplified in five case studies. Firstly, we illustrate the range of plant structures that can be simulated using CPlantBox. In the second example, we simulated diurnal carbon and water flows, which corroborates published experimental data. In the third case study, we simulated impacts of heterogeneous environment on carbon and water flows. Finally, we showed that our modelling framework can be used to fit phloem pressure and flow speed to (published) experimental data. The CPlantBox modelling framework is open source, highly accessible and flexible. Its aim is to provide a quantitative framework for the understanding of plant-environment interaction.",
                "authors": [
                    {
                        "name": "Lacointe A."
                    },
                    {
                        "name": "Leitner D."
                    },
                    {
                        "name": "Lobet G."
                    },
                    {
                        "name": "Schnepf A."
                    },
                    {
                        "name": "Vanderborght J."
                    },
                    {
                        "name": "Vereecken H."
                    },
                    {
                        "name": "Zhou X.-R."
                    }
                ],
                "citationCount": 6,
                "date": "2020-01-01T00:00:00Z",
                "journal": "In Silico Plants",
                "title": "CPlantBox, a whole-plant modelling framework for the simulation of water- And carbon-related processes"
            }
        }
    ],
    "topic": [
        {
            "term": "Agricultural science",
            "uri": "http://edamontology.org/topic_3810"
        },
        {
            "term": "Environmental science",
            "uri": "http://edamontology.org/topic_3855"
        },
        {
            "term": "Physiology",
            "uri": "http://edamontology.org/topic_3300"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        }
    ],
    "validated": 1
}
