{"credit":[{"email":"qin.ma@sdstate.edu","name":"Qin Ma, Ph.D","typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://csbl.bmb.uga.edu/~maqin/"}],"documentation":[{"type":"GENERAL","url":"http://csbl.bmb.uga.edu/~maqin/motif_finding/faq.html"}],"function":[{"operation":[{"term":"Regulatory element prediction","uri":"http://edamontology.org/operation_0438"}]}],"labels":{"operatingSystem":["Linux"],"toolType":["Command-line tool","Web application"],"topic":[{"term":"Sequence analysis","uri":"http://edamontology.org/topic_0080"},{"term":"DNA","uri":"http://edamontology.org/topic_0654"},{"term":"Transcription factors and regulatory sites","uri":"http://edamontology.org/topic_0749"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/bobro-0-1-identifying-cis-regulatory-motifs-prokaryotes.html"}],"publication":[{"abstract":"Motivation: We present an integrated toolkit, BoBro2.0, for prediction and analysis of cis-regulatory motifs. This toolkit can (i) reliably identify statistically significant cis-regulatory motifs at a genome scale; (ii) accurately scan for all motif instances of a query motif in specified genomic regions using a novel method for P-value estimation; (iii) provide highly reliable comparisons and clustering of identified motifs, which takes into consideration the weak signals from the flanking regions of the motifs; and (iv) analyze co-occurring motifs in the regulatory regions.Results: We have carried out systematic comparisons between motif predictions using BoBro2.0 and the MEME package. The comparison results on Escherichia coli K12 genome and the human genome show that BoBro2.0 can identify the statistically significant motifs at a genome scale more efficiently, identify motif instances more accurately and get more reliable motif clusters than MEME. In addition, BoBro2.0 provides correlational analyses among the identified motifs to facilitate the inference of joint regulation relationships of transcription factors. © The Author 2013.","authors":["Ma Q.","Liu B.","Zhou C.","Yin Y.","Li G.","Xu Y."],"cit_count":14,"journal":"Bioinformatics","pmid":"23846744","title":"An integrated toolkit for accurate prediction and analysis of cis-regulatory motifs at a genome scale","year":"2013-09-15"}],"summary":{"biotoolsCURIE":"biotools:bobro","biotoolsID":"bobro","description":"BOTTLENECK BROKEN TOOL is a software  for prediction of cis-regulatory motifs in a given set of promoter sequences.","homepage":"http://csbl.bmb.uga.edu/~maqin/motif_finding/","name":"BoBro"}}