{
    "additionDate": "2020-01-14T20:04:08Z",
    "biotoolsCURIE": "biotools:3DChrom",
    "biotoolsID": "3DChrom",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "zheng.wang@miami.edu",
            "name": "Zheng Wang",
            "typeEntity": "Person"
        }
    ],
    "description": "3DChrom is a web application for reconstructing three-dimensional structures of chromatins and TADs using Hi-C data and multidimensional scaling.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://dna.cs.miami.edu/3DChrom/help.html"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://dna.cs.miami.edu/3DChrom/data/3DChrom.tar.gz"
        }
    ],
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein structure assignment",
                    "uri": "http://edamontology.org/operation_0320"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                }
            ]
        }
    ],
    "homepage": "http://dna.cs.miami.edu/3DChrom/",
    "language": [
        "C++"
    ],
    "lastUpdate": "2021-01-09T16:31:13Z",
    "name": "3DChrom",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12859-019-3083-Z",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Topologically associating domains (TADs) are genomic regions with varying lengths. The interactions within TADs are more frequent than those between different TADs. TADs or sub-TADs are considered the structural and functional units of the mammalian genomes. Although TADs are important for understanding how genomes function, we have limited knowledge about their 3D structural properties. Results: In this study, we designed and benchmarked three metrics for capturing the three-dimensional and two-dimensional structural signatures of TADs, which can help better understand TADs' structural properties and the relationships between structural properties and genetic and epigenetic features. The first metric for capturing 3D structural properties is radius of gyration, which in this study is used to measure the spatial compactness of TADs. The mass value of each DNA bead in a 3D structure is novelly defined as one or more genetic or epigenetic feature(s). The second metric is folding degree. The last metric is exponent parameter, which is used to capture the 2D structural properties based on TADs' Hi-C contact matrices. In general, we observed significant correlations between the three metrics and the genetic and epigenetic features. We made the same observations when using H3K4me3, transcription start sites, and RNA polymerase II to represent the mass value in the modified radius-of-gyration metric. Moreover, we have found that the TADs in the clusters of depleted chromatin states apparently correspond to smaller exponent parameters and larger radius of gyrations. In addition, a new objective function of multidimensional scaling for modelling chromatin or TADs 3D structures was designed and benchmarked, which can handle the DNA bead-pairs with zero Hi-C contact values. Conclusions: The web server for reconstructing chromatin 3D structures using multiple different objective functions and the related source code are publicly available at http://dna.cs.miami.edu/3DChrom/.",
                "authors": [
                    {
                        "name": "Liu T."
                    },
                    {
                        "name": "Wang Z."
                    }
                ],
                "citationCount": 1,
                "date": "2019-12-02T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Exploring the 2D and 3D structural properties of topologically associating domains"
            },
            "pmcid": "PMC6886161",
            "pmid": "31787081"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        },
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        }
    ],
    "validated": 1
}