{
    "additionDate": "2019-11-14T18:25:07Z",
    "biotoolsCURIE": "biotools:guidetomeasure-OT",
    "biotoolsID": "guidetomeasure-OT",
    "confidence_flag": "medium",
    "description": "> MEDIUM CONFIDENCE! | > HOMEPAGE MISSING! | A mobile 3D application to improve the accuracy, consistency, and efficiency of clinician-led home-based falls-risk assessments | BACKGROUND:A key falls prevention intervention delivered within occupational therapy is the home environment falls-risk assessment process. This involves the clinician visiting the patient's home and using a 2D paper-based measurement guidance booklet to ensure that all measurements are taken and recorded accurately. However, 30% of all assistive devices installed within the home are abandoned by patients, in part as a result of the inaccurate measurements being recorded as part of the home environment falls-risk assessment process. In the absence of more appropriate and effective guidance, high levels of device abandonment are likely to persist",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://www.ncbi.nlm.nih.gov/pubmed/?term=31445277",
    "lastUpdate": "2019-11-14T18:25:07Z",
    "name": "guidetomeasure-OT",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1016/J.IJMEDINF.2019.07.004",
            "metadata": {
                "abstract": "© 2019 The AuthorsBackground: A key falls prevention intervention delivered within occupational therapy is the home environment falls-risk assessment process. This involves the clinician visiting the patient's home and using a 2D paper-based measurement guidance booklet to ensure that all measurements are taken and recorded accurately. However, 30% of all assistive devices installed within the home are abandoned by patients, in part as a result of the inaccurate measurements being recorded as part of the home environment falls-risk assessment process. In the absence of more appropriate and effective guidance, high levels of device abandonment are likely to persist. Aim: This study presents guidetomeasure-OT, a mobile 3D measurement guidance application designed to support occupational therapists in carrying out home environment falls-risk assessments. Furthermore, this study aims to empirically evaluate the performance of guidetomeasure-OT compared with an equivalent paper-based measurement guidance booklet. Methods: Thirty-five occupational therapists took part in this within-subjects repeated measures study, delivered within a living lab setting. Participants carried out the home environment falls-risk assessment process under two counterbalanced treatment conditions; using 3D guidetomeasure-OT; and using a 2D paper-based guide. Systems Usability Scale questionnaires and semi-structured interviews were completed at the end of both task. A comparative statistical analysis explored performance relating to measurement accuracy, measurement accuracy consistency, task completion time, and overall system usability, learnability, and effectiveness of guidance. Interview transcripts were analysed using inductive and deductive thematic analysis, the latter was informed by the Unified Theory of Acceptance and Use of Technology model. Results: The guidetomeasure-OT application significantly outperformed the 2D paper-based guidance in terms task efficiency (p < 0.001), learnability (p < 0.001), system usability (p < 0.001), effectiveness of guidance (p = 0.001). Regarding accuracy, in absolute terms, guidetomeasure-OT produced lower mean error differences for 11 out of 12 items and performed significantly better for six out of 12 items (p = < 0.05). In terms of SUS, guidetomeasure-OT scored 83.7 compared with 70.4 achieved by the booklet. Five high-level themes emerged from interviews: Performance Expectancy, Effort Expectancy, Social Influence, Clinical Benefits, and Augmentation of Clinical Practice. Participants reported that guidetomeasure-OT delivered clearer measurement guidance that was more realistic, intuitive, precise and usable than the paper-based equivalent. Audio instructions and animated prompts were seen as being helpful in reducing the learning overhead required to comprehend measurement guidance and maintain awareness of task progression. Conclusions: This study reveals that guidetomeasure-OT enables occupational therapists to carry out significantly more accurate and efficient home environment falls-risk assessments, whilst also providing a measurement guide tool that is considered more usable compared with the paper-based measurement guide that is currently used by clinicians in practice. These results are significant as they indicate that mobile 3D visualisation technologies can be effectively deployed to improve clinical practice, particularly within the home environment falls-risk assessment context. Furthermore, the empirical findings constitute overcoming the challenges associated with the digitisation of health care and delivery of new innovative and enabling technological solutions that health providers and policy makers so urgently need to ease the ever-increasing burden on existing public resources. Future work will focus on the development and empirical evaluation of a mobile 3D application for patient self-assessment and automated assistive equipment prescription. Furthermore, broader User Experience aspects of the application design and the interaction mechanisms that are made available to the user could be considered so as to minimize the effect of cognitive overloading and optimise user performance.",
                "authors": [
                    {
                        "name": "Hamm J."
                    },
                    {
                        "name": "Money A."
                    }
                ],
                "date": "2019-09-01T00:00:00Z",
                "journal": "International Journal of Medical Informatics",
                "title": "Guidetomeasure-OT: A mobile 3D application to improve the accuracy, consistency, and efficiency of clinician-led home-based falls-risk assessments"
            },
            "pmid": "31445277"
        }
    ],
    "topic": [
        {
            "term": "Medical informatics",
            "uri": "http://edamontology.org/topic_3063"
        },
        {
            "term": "Geriatric medicine",
            "uri": "http://edamontology.org/topic_3399"
        },
        {
            "term": "Musculoskeletal medicine",
            "uri": "http://edamontology.org/topic_3416"
        }
    ]
}