{
    "accessibility": [
        "Open access"
    ],
    "additionDate": "2017-01-13T13:15:51Z",
    "biotoolsCURIE": "biotools:phredphrapconsed",
    "biotoolsID": "phredphrapconsed",
    "cost": "Free of charge",
    "description": "The phred software reads DNA sequencing trace files, calls bases, and assigns a quality value to each called base.  Phrap is a program for assembling shotgun DNA sequence data. Cross_match is a general purpose utility for comparing any two DNA sequence sets using a 'banded' version of swat. Consed/Autofinish is a tool for viewing, editing, and finishing sequence assemblies created with phrap.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://www.phrap.org/phredphrapconsed.html"
        },
        {
            "type": [
                "Installation instructions"
            ],
            "url": "http://www.phrap.org/consed/consed.html#howToGet"
        }
    ],
    "editPermission": {
        "authors": [
            "ELIXIR-EE"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence alignment",
                    "uri": "http://edamontology.org/operation_0292"
                },
                {
                    "term": "Sequence database search",
                    "uri": "http://edamontology.org/operation_0338"
                },
                {
                    "term": "Base-calling",
                    "uri": "http://edamontology.org/operation_3185"
                },
                {
                    "term": "Sequence assembly",
                    "uri": "http://edamontology.org/operation_0310"
                }
            ]
        }
    ],
    "homepage": "http://www.phrap.org/phredphrapconsed.html",
    "language": [
        "C"
    ],
    "lastUpdate": "2019-07-22T17:47:08Z",
    "license": "Other",
    "maturity": "Mature",
    "name": "Phred Phrap Consed Cross match",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "seqwiki_import",
    "publication": [
        {
            "doi": "10.1101/gr.8.3.195",
            "metadata": {
                "abstract": "Sequencing of large clones or small genomes is generally done by the shotgun approach. This has two phases: (1) a shotgun phase in which a number of reads are generated from random subclones and assembled into contigs, followed by (2) a directed, or finishing phase in which the assembly is inspected for correctness and for various kinds of data anomalies (such as contaminant reads, unremoved vector sequence, and chimeric or deleted reads), additional data are collected to close gaps and resolve low quality regions, and editing is performed to correct assembly or base-calling errors. Finishing is currently a bottleneck in large-scale sequencing efforts, and throughput gains will depend both on reducing the need for human intervention and making it as efficient as possible. We have developed a finishing tool, consed, which attempts to implement these principles. A distinguishing feature relative to other programs is the use of error probabilities from our programs phred and phrap as an objective criterion to guide the entire finishing process. More information is available at http://www.genome.washington.edu/consed/consed.html.",
                "authors": [
                    {
                        "name": "Gordon D."
                    },
                    {
                        "name": "Abajian C."
                    },
                    {
                        "name": "Green P."
                    }
                ],
                "citationCount": 2708,
                "date": "1998-01-01T00:00:00Z",
                "journal": "Genome Research",
                "title": "Consed: A graphical tool for sequence finishing"
            },
            "type": [
                "Primary"
            ]
        },
        {
            "doi": "10.1101/gr.171401",
            "metadata": {
                "abstract": "Currently, the genome sequencing community is producing shotgun sequence data at a very high rate, but finishing (collecting additional directed sequence data to close gaps and improve the quality of the data) is not matching that rate. One reason for the difference is that shotgun sequencing is highly automated but finishing is not: Most finishing decisions, such as which directed reads to obtain and which specialized sequencing techniques to use, are made by people. If finishing rates are to increase to match shotgun sequencing rates, most finishing decisions also must be automated. The Autofinish computer program (which is part of the Consed computer software package) does this by automatically choosing finishing reads. Autofinish is able to suggest most finishing reads required for completion of each sequencing project, greatly reducing the amount of human attention needed. Autofinish sometimes completely finishes the project, with no human decisions required. It cannot solve the most complex problems, so we recommend that Autofinish be allowed to suggest reads for the first three rounds of finishing, and if the project still is not finished completely, a human finisher complete the work. We compared this Autofinish-Hybrid method of finishing against a human finisher in five different projects with a variety of shotgun depths by finishing each project twice-once with each method. This comparison shows that the Autofinish-Hybrid method saves many hours over a human finisher alone, while using roughly the same number and type of reads and closing gaps at roughly the same rate. Autofinish currently is in production use at several large sequencing centers. It is designed to be adaptable to the finishing strategy of the lab-it can finish using some or all of the following: resequencing reads, reverses, custom primer walks on either subclone templates or whole clone templates, PCR, or minilibraries. Autofinish has been used for finishing cDNA, genomic clones, and whole bacterial genomes (see http://www.phrap.org).",
                "authors": [
                    {
                        "name": "Gordon D."
                    },
                    {
                        "name": "Desmarais C."
                    },
                    {
                        "name": "Green P."
                    }
                ],
                "citationCount": 289,
                "date": "2001-05-02T00:00:00Z",
                "journal": "Genome Research",
                "title": "Automated finishing with autofinish"
            },
            "type": [
                "Primary"
            ]
        },
        {
            "doi": "10.1101/gr.8.3.186",
            "metadata": {
                "abstract": "Elimination of the data processing bottleneck in high-throughput sequencing will require both improved accuracy of data processing software and reliable measures of that accuracy. We have developed and implemented in our base-calling program phred the ability to estimate a probability of error for each base-call, as a function of certain parameters computed from the trace data. These error probabilities are shown here to be valid (correspond to actual error rates) and to have high power to discriminate correct base-calls from incorrect ones, for read data collected under several different chemistries and electrophoretic conditions. They play a critical role in our assembly program phrap and our finishing program consed.",
                "authors": [
                    {
                        "name": "Ewing B."
                    },
                    {
                        "name": "Green P."
                    }
                ],
                "citationCount": 4125,
                "date": "1998-01-01T00:00:00Z",
                "journal": "Genome Research",
                "title": "Base-calling of automated sequencer traces using phred. II. Error probabilities"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Suite"
    ],
    "topic": [
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ]
}