{
    "additionDate": "2020-01-14T20:20:45Z",
    "biotoolsCURIE": "biotools:reproduce",
    "biotoolsID": "reproduce",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "xzhousph@umich.edu",
            "name": "Xiang Zhou",
            "orcidid": "https://orcid.org/0000-0002-4331-7599",
            "typeEntity": "Person"
        }
    ],
    "description": "Comparison of Dimensionality Reduction Methods for Single Cell RNAseq Analysis.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Principal component visualisation",
                    "uri": "http://edamontology.org/operation_2939"
                },
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "RNA-Seq analysis",
                    "uri": "http://edamontology.org/operation_3680"
                }
            ]
        }
    ],
    "homepage": "http://www.xzlab.org/reproduce.html",
    "lastUpdate": "2021-01-15T19:15:05Z",
    "name": "reproduce",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S13059-019-1898-6",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Dimensionality reduction is an indispensable analytic component for many areas of single-cell RNA sequencing (scRNA-seq) data analysis. Proper dimensionality reduction can allow for effective noise removal and facilitate many downstream analyses that include cell clustering and lineage reconstruction. Unfortunately, despite the critical importance of dimensionality reduction in scRNA-seq analysis and the vast number of dimensionality reduction methods developed for scRNA-seq studies, few comprehensive comparison studies have been performed to evaluate the effectiveness of different dimensionality reduction methods in scRNA-seq. Results: We aim to fill this critical knowledge gap by providing a comparative evaluation of a variety of commonly used dimensionality reduction methods for scRNA-seq studies. Specifically, we compare 18 different dimensionality reduction methods on 30 publicly available scRNA-seq datasets that cover a range of sequencing techniques and sample sizes. We evaluate the performance of different dimensionality reduction methods for neighborhood preserving in terms of their ability to recover features of the original expression matrix, and for cell clustering and lineage reconstruction in terms of their accuracy and robustness. We also evaluate the computational scalability of different dimensionality reduction methods by recording their computational cost. Conclusions: Based on the comprehensive evaluation results, we provide important guidelines for choosing dimensionality reduction methods for scRNA-seq data analysis. We also provide all analysis scripts used in the present study at www.xzlab.org/reproduce.html.",
                "authors": [
                    {
                        "name": "Sun S."
                    },
                    {
                        "name": "Zhu J."
                    },
                    {
                        "name": "Ma Y."
                    },
                    {
                        "name": "Zhou X."
                    }
                ],
                "citationCount": 34,
                "date": "2019-12-10T00:00:00Z",
                "journal": "Genome Biology",
                "title": "Accuracy, robustness and scalability of dimensionality reduction methods for single-cell RNA-seq analysis"
            },
            "pmcid": "PMC6902413",
            "pmid": "31823809"
        }
    ],
    "topic": [
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        }
    ],
    "validated": 1
}