{
    "additionDate": "2018-05-22T21:08:22Z",
    "biotoolsCURIE": "biotools:medyan",
    "biotoolsID": "medyan",
    "credit": [
        {
            "email": "jkomiano@umd.edu",
            "name": "James Komianos",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Mechanochemical Simulations of Contraction and Polarity Alignment in Actomyosin Networks.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://www.medyan.org/documentation.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Molecular dynamics",
                    "uri": "http://edamontology.org/operation_2476"
                }
            ]
        }
    ],
    "homepage": "http://www.medyan.org/",
    "language": [
        "C++"
    ],
    "lastUpdate": "2018-12-10T12:58:58Z",
    "name": "MEDYAN",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PCBI.1004877",
            "metadata": {
                "abstract": "© 2016 Popov et al.Active matter systems, and in particular the cell cytoskeleton, exhibit complex mechanochemical dynamics that are still not well understood. While prior computational models of cytoskeletal dynamics have lead to many conceptual insights, an important niche still needs to be filled with a high-resolution structural modeling framework, which includes a minimally-complete set of cytoskeletal chemistries, stochastically treats reaction and diffusion processes in three spatial dimensions, accurately and efficiently describes mechanical deformations of the filamentous network under stresses generated by molecular motors, and deeply couples mechanics and chemistry at high spatial resolution. To address this need, we propose a novel reactive coarse-grained force field, as well as a publicly available software package, named the Mechanochemical Dynamics of Active Networks (MEDYAN), for simulating active network evolution and dynamics (available at www.medyan.org). This model can be used to study the non-linear, far from equilibrium processes in active matter systems, in particular, comprised of interacting semi-flexible polymers embedded in a solution with complex reaction-diffusion processes. In this work, we applied MEDYAN to investigate a contractile actomyosin network consisting of actin filaments, alpha-actinin cross-linking proteins, and non-muscle myosin IIA mini-filaments. We found that these systems undergo a switch-like transition in simulations from a random network to ordered, bundled structures when cross-linker concentration is increased above a threshold value, inducing contraction driven by myosin II mini-filaments. Our simulations also show how myosin II mini-filaments, in tandem with cross-linkers, can produce a range of actin filament polarity distributions and alignment, which is crucially dependent on the rate of actin filament turnover and the actin filament’s resulting super-diffusive behavior in the actomyosin-cross-linker system. We discuss the biological implications of these findings for the arc formation in lamellipodium-to-lamellum architectural remodeling. Lastly, our simulations produce force-dependent accumulation of myosin II, which is thought to be responsible for their mechanosensation ability, also spontaneously generating myosin II concentration gradients in the solution phase of the simulation volume.",
                "authors": [
                    {
                        "name": "Popov K."
                    },
                    {
                        "name": "Komianos J."
                    },
                    {
                        "name": "Papoian G.A."
                    }
                ],
                "citationCount": 26,
                "date": "2016-04-01T00:00:00Z",
                "journal": "PLoS Computational Biology",
                "title": "MEDYAN: Mechanochemical Simulations of Contraction and Polarity Alignment in Actomyosin Networks"
            },
            "pmcid": "PMC4847874",
            "pmid": "27120189"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Molecular dynamics",
            "uri": "http://edamontology.org/topic_0176"
        }
    ],
    "validated": 1
}