
{
    "credit": [
        {
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://medicine.yale.edu/ysph/about/contact/index.aspx"
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://c2s2.yale.edu/software/TARV/"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Variant classification",
                    "uri": "http://edamontology.org/operation_3225"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "R"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Library"
        ],
        "topic": [
            {
                "term": "Genetic variation",
                "uri": "http://edamontology.org/topic_0199"
            },
            {
                "term": "Genetics",
                "uri": "http://edamontology.org/topic_3053"
            },
            {
                "term": "Pathology",
                "uri": "http://edamontology.org/topic_0634"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/tarv-tree-based-analysis-of-rare-variants.html"
        }
    ],
    "publication": [
        {
            "abstract": "© 2014 Wiley Periodicals, Inc. Since the development of next generation sequencing (NGS) technology, researchers have been extending their efforts on genome-wide association studies (GWAS) from common variants to rare variants to find the missing inheritance. Although various statistical methods have been proposed to analyze rare variants data, they generally face difficulties for complex disease models involving multiple genes. In this paper, we propose a tree-based analysis of rare variants (TARV) that adopts a nonparametric disease model and is capable of exploring gene-gene interactions. We found that TARV outperforms the sequence kernel association test (SKAT) in most of our simulation scenarios, and by notable margins in some cases. By applying TARV to the study of addiction: genetics and environment (SAGE) data, we successfully detected gene CTNNA2 and its 43 specific variants that increase the risk of alcoholism in women, with an odds ratio (OR) of 1.94. This gene has not been detected in the SAGE data. Post hoc literature search also supports the role of CTNNA2 as a likely risk gene for alcohol addiction. In addition, we also detected a plausible protective gene CNTNAP2, whose 97 rare variants can reduce the risk of alcoholism in women, with an OR of 0.55. These findings suggest that TARV can be effective in dissecting genetic variants for complex diseases using rare variants data.",
            "authors": [
                "Song C.",
                "Zhang H."
            ],
            "cit_count": 4,
            "journal": "Genetic Epidemiology",
            "pmid": "25041903",
            "title": "TARV: Tree-based Analysis of Rare Variants Identifying Risk Modifying Variants in CTNNA2 and CNTNAP2 for Alcohol Addiction",
            "year": "2014-09-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:tarv",
        "biotoolsID": "tarv",
        "description": "A tree-based method to explore the association between rare variants and complex diseases, and find potential genetic and environmental factors and their interactions.",
        "homepage": "http://c2s2.yale.edu/software/TARV/",
        "name": "TARV"
    }
}