{"credit":[{"name":"Contact Form","typeEntity":"Person","typeRoles":["Primary contact"],"url":"https://www.broadinstitute.org/contact"}],"function":[{"operation":[{"term":"De-novo assembly","uri":"http://edamontology.org/operation_0524"},{"term":"Sequence assembly","uri":"http://edamontology.org/operation_0310"}]}],"labels":{"maturity":"Mature","operatingSystem":["Linux","Windows","Mac"],"toolType":["Command-line tool"],"topic":[{"term":"Sequence assembly","uri":"http://edamontology.org/topic_0196"}]},"publication":[{"abstract":"New DNA sequencing technologies deliver data at dramatically lower costs but demand new analytical methods to take full advantage of the very short reads that they produce. We provide an initial, theoretical solution to the challenge of de novo assembly from whole-genome shotgun \"microreads.\" For 11 genomes of sizes up to 39 Mb, we generated high-quality assemblies from 80x coverage by paired 30-base simulated reads modeled after real Illumina-Solexa reads. The bacterial genomes of Campylobacter jejuni and Escherichia coli assemble optimally, yielding single perfect contigs, and larger genomes yield assemblies that are highly connected and accurate. Assemblies are presented in a graph form that retains intrinsic ambiguities such as those arising from polymorphism, thereby providing information that has been absent from previous genome assemblies. For both C. jejuni and E. coli, this assembly graph is a single edge encompassing the entire genome. Larger genomes produce more complicated graphs, but the vast majority of the bases in their assemblies are present in long edges that are nearly always perfect. We describe a general method for genome assembly that can be applied to all types of DNA sequence data, not only short read data, but also conventional sequence reads. ©2008 by Cold Spring Harbor Laboratory Press.","authors":["Butler J.","MacCallum I.","Kleber M.","Shlyakhter I.A.","Belmonte M.K.","Lander E.S.","Nusbaum C.","Jaffe D.B."],"cit_count":514,"journal":"Genome Research","pmid":"18340039","title":"ALLPATHS: De novo assembly of whole-genome shotgun microreads","year":"2008-05-01"}],"summary":{"biotoolsCURIE":"biotools:allpaths","biotoolsID":"allpaths","description":"De novo assembly of whole-genome shotgun microreads.","homepage":"https://www.broadinstitute.org/computational-rd/computational-research-and-development","name":"ALLPATHS"}}