
{
    "credit": [
        {
            "email": "alekseyz@ipst.umd.edu",
            "name": "Zimin A.V.",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence merging",
                    "uri": "http://edamontology.org/operation_0232"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Perl"
        ],
        "operatingSystem": [
            "Linux"
        ],
        "toolType": [
            "Suite"
        ],
        "topic": [
            {
                "term": "Sequence assembly",
                "uri": "http://edamontology.org/topic_0196"
            }
        ]
    },
    "publication": [
        {
            "abstract": "Motivation: Many genomes are sequenced by a collaboration of several centers, and then each center produces an assembly using their own assembly software. The collaborators then pick the draft assembly that they judge to be the best and the information contained in the other assemblies is usually not used. Methods: We have developed a technique that we call assembly reconciliation that can merge draft genome assemblies. It takes one draft assembly, detects apparent errors, and, when possible, patches the problem areas using pieces from alternative draft assemblies. It also closes gaps in places where one of the alternative assemblies has spanned the gap correctly. Results: Using the Assembly Reconciliation technique, we produced reconciled assemblies of six Drosophila species in collaboration with Agencourt Bioscience and The J. Craig Venter Institute. These assemblies are now the official (CAF1) assemblies used for analysis. We also produced a reconciled assembly of Rhesus Macaque genome, and this assembly is available from our website http://www.genome.umd.edu. © 2007 The Author(s).",
            "authors": [
                "Zimin A.V.",
                "Smith D.R.",
                "Sutton G.",
                "Yorke J.A."
            ],
            "cit_count": 42,
            "journal": "Bioinformatics",
            "pmid": "18057021",
            "title": "Assembly reconciliation",
            "year": "2008-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:reconciliator",
        "biotoolsID": "reconciliator",
        "description": "The tool for merging assemblies",
        "homepage": "http://terpconnect.umd.edu/~ALEKSEYZ/PhrapUMDV2/",
        "name": "Reconciliator"
    }
}