{
    "additionDate": "2018-08-05T00:24:56Z",
    "biotoolsCURIE": "biotools:tomominer",
    "biotoolsID": "tomominer",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://web.cmb.usc.edu/people/alber/Contacts.html"
        }
    ],
    "description": "Large-scale subtomogram classification, template matching, subtomogram averaging, and alignment. Also provides a pre-configured TomoMinerCloud computing service permitting users without sufficient computing resources instant access to TomoMiners high-performance features.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://web.cmb.usc.edu/people/alber/Software/tomominer/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Pairwise structure alignment",
                    "uri": "http://edamontology.org/operation_0503"
                }
            ]
        }
    ],
    "homepage": "http://web.cmb.usc.edu/people/alber/Software/tomominer/",
    "language": [
        "C++",
        "Python"
    ],
    "lastUpdate": "2021-05-05T10:52:49Z",
    "license": "Unlicense",
    "name": "TomoMiner",
    "operatingSystem": [
        "Linux"
    ],
    "otherID": [
        {
            "type": "rrid",
            "value": "RRID:SCR_015045"
        }
    ],
    "owner": "daniel_stefan",
    "publication": [
        {
            "doi": "10.1016/j.str.2017.04.016",
            "metadata": {
                "abstract": "© 2017 Elsevier LtdCryo-electron tomography (cryo-ET) captures the 3D electron density distribution of macromolecular complexes in close to native state. With the rapid advance of cryo-ET acquisition technologies, it is possible to generate large numbers (>100,000) of subtomograms, each containing a macromolecular complex. Often, these subtomograms represent a heterogeneous sample due to variations in the structure and composition of a complex in situ form or because particles are a mixture of different complexes. In this case subtomograms must be classified. However, classification of large numbers of subtomograms is a time-intensive task and often a limiting bottleneck. This paper introduces an open source software platform, TomoMiner, for large-scale subtomogram classification, template matching, subtomogram averaging, and alignment. Its scalable and robust parallel processing allows efficient classification of tens to hundreds of thousands of subtomograms. In addition, TomoMiner provides a pre-configured TomoMinerCloud computing service permitting users without sufficient computing resources instant access to TomoMiners high-performance features.",
                "authors": [
                    {
                        "name": "Alber F."
                    },
                    {
                        "name": "Frazier Z."
                    },
                    {
                        "name": "Xu M."
                    }
                ],
                "citationCount": 9,
                "date": "2017-06-06T00:00:00Z",
                "journal": "Structure",
                "title": "TomoMiner and TomoMinerCloud: A Software Platform for Large-Scale Subtomogram Structural Analysis"
            },
            "pmcid": "PMC5567730",
            "pmid": "28552576",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Tomography",
            "uri": "http://edamontology.org/topic_3452"
        }
    ],
    "validated": 1
}
