{
    "additionDate": "2021-01-18T11:24:25Z",
    "biotoolsCURIE": "biotools:rankcorr",
    "biotoolsID": "rankcorr",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "ahsvargo@umich.edu",
            "name": "Alexander H. S. Vargo",
            "orcidid": "https://orcid.org/0000-0001-5930-8841",
            "typeEntity": "Person"
        }
    ],
    "description": "A rank-based marker selection method for high throughput scRNA-seq data.\n\nA marker selection method for scRNA-seq data based on rank correlation. See the notebook RankCorr-example.ipynb for a full walkthough of how to run the method; an outline is presented below.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Dimensionality reduction",
                    "uri": "http://edamontology.org/operation_3935"
                },
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                },
                {
                    "term": "Imputation",
                    "uri": "http://edamontology.org/operation_3557"
                }
            ]
        }
    ],
    "homepage": "https://github.com/ahsv/RankCorr",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-02-03T14:14:22Z",
    "name": "RANKCORR",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1186/S12859-020-03641-Z",
            "metadata": {
                "abstract": "© 2020, The Author(s).Background: High throughput microfluidic protocols in single cell RNA sequencing (scRNA-seq) collect mRNA counts from up to one million individual cells in a single experiment; this enables high resolution studies of rare cell types and cell development pathways. Determining small sets of genetic markers that can identify specific cell populations is thus one of the major objectives of computational analysis of mRNA counts data. Many tools have been developed for marker selection on single cell data; most of them, however, are based on complex statistical models and handle the multi-class case in an ad-hoc manner. Results: We introduce RankCorr, a fast method with strong mathematical underpinnings that performs multi-class marker selection in an informed manner. RankCorr proceeds by ranking the mRNA counts data before linearly separating the ranked data using a small number of genes. The step of ranking is intuitively natural for scRNA-seq data and provides a non-parametric method for analyzing count data. In addition, we present several performance measures for evaluating the quality of a set of markers when there is no known ground truth. Using these metrics, we compare the performance of RankCorr to a variety of other marker selection methods on an assortment of experimental and synthetic data sets that range in size from several thousand to one million cells. Conclusions: According to the metrics introduced in this work, RankCorr is consistently one of most optimal marker selection methods on scRNA-seq data. Most methods show similar overall performance, however; thus, the speed of the algorithm is the most important consideration for large data sets (and comparing the markers selected by several methods can be fruitful). RankCorr is fast enough to easily handle the largest data sets and, as such, it is a useful tool to add into computational pipelines when dealing with high throughput scRNA-seq data. RankCorr software is available for download at https://github.com/ahsv/RankCorrwith extensive documentation.",
                "authors": [
                    {
                        "name": "Gilbert A.C."
                    },
                    {
                        "name": "Vargo A.H.S."
                    }
                ],
                "date": "2020-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "A rank-based marker selection method for high throughput scRNA-seq data"
            },
            "pmcid": "PMC7585212",
            "pmid": "33097004"
        }
    ],
    "topic": [
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Mathematics",
            "uri": "http://edamontology.org/topic_3315"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ]
}
