{"credit":[{"name":"SIB Swiss Institute of Bioinformatics","typeEntity":"Institute","typeRoles":["Provider"]},{"email":"mering@imls.uzh.ch","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"url":"https://string-db.org/cgi/help.pl?UserId=HOoD3zcgKHoG&sessionId=GdEmIEtx8KZ6"}],"function":[{"operation":[{"term":"Protein interaction network analysis","uri":"http://edamontology.org/operation_0276"}]}],"labels":{"collectionID":["Proteomics"],"elixirNode":["Switzerland"],"elixirPlatform":["Data"],"operatingSystem":["Linux","Windows","Mac"],"toolType":["Database portal"],"topic":[{"term":"Proteomics","uri":"http://edamontology.org/topic_0121"},{"term":"Protein interactions","uri":"http://edamontology.org/topic_0128"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://expasy.org"}],"publication":[{"abstract":"© The Author(s) 2014.The many functional partnerships and interactions that occur between proteins are at the core of cellular processing and their systematic characterization helps to provide context in molecular systems biology. However, known and predicted interactions are scattered over multiple resources, and the available data exhibit notable differences in terms of quality and completeness. The STRING database (http://string-db.org) aims to provide a critical assessment and integration of protein-protein interactions, including direct (physical) as well as indirect (functional) associations. The new version 10.0 of STRING covers more than 2000 organisms, which has necessitated novel, scalable algorithms for transferring interaction information between organisms. For this purpose, we have introduced hierarchical and self-consistent orthology annotations for all interacting proteins, grouping the proteins into families at various levels of phylogenetic resolution. Further improvements in version 10.0 include a completely redesigned prediction pipeline for inferring protein-protein associations from co-expression data, an API interface for the R computing environment and improved statistical analysis for enrichment tests in user-provided networks.","authors":["Szklarczyk D.","Franceschini A.","Wyder S.","Forslund K.","Heller D.","Huerta-Cepas J.","Simonovic M.","Roth A.","Santos A.","Tsafou K.P.","Kuhn M.","Bork P.","Jensen L.J.","Von Mering C."],"cit_count":2753,"doi":"10.1093/nar/gku1003","journal":"Nucleic Acids Research","title":"STRING v10: Protein-protein interaction networks, integrated over the tree of life","type":"Primary","year":"2015-01-28"}],"summary":{"biotoolsCURIE":"biotools:string","biotoolsID":"string","description":"A database of known and predicted protein-protein interactions. The database contains information from numerous sources, including experimental repositories, computational prediction methods and public text collections. STRING is regularly updated and gives a comprehensive view on protein-protein interactions currently available.","homepage":"http://string-db.org/","name":"STRING"}}