{
    "additionDate": "2021-01-18T09:34:07Z",
    "biotoolsCURIE": "biotools:scigans",
    "biotoolsID": "scigans",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "yungang.xu@uth.tmc.edu",
            "name": "Yungang Xu",
            "orcidid": "https://orcid.org/0000-0002-9834-3006",
            "typeEntity": "Person"
        },
        {
            "name": "Jiajia Liu",
            "typeEntity": "Person"
        },
        {
            "email": "xiaobo.zhou@uth.tmc.edu",
            "name": "Xiaobo Zhou",
            "orcidid": "https://orcid.org/0000-0001-7191-6495",
            "typeEntity": "Person"
        }
    ],
    "description": "single-cell RNA-seq imputation using generative adversarial networks.\n\nGenerative adversarial networks for single-cell RNA-seq imputation.\n\nThe data and codes for reproducing all Figures and Tables in the manuscript of scIGANs.\n\nscIGANs is a computational tool for single-cell RNA-seq imputation and denoise using Generative Adversarial Networks (GANs). Build on PyTorch, scIGNAs enables GPU acceleration inaddition to CPU computing as long as the GPUs are available.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Imputation",
                    "uri": "http://edamontology.org/operation_3557"
                },
                {
                    "term": "Expression profile clustering",
                    "uri": "http://edamontology.org/operation_0313"
                },
                {
                    "term": "RNA-Seq quantification",
                    "uri": "http://edamontology.org/operation_3800"
                }
            ]
        }
    ],
    "homepage": "https://github.com/xuyungang/scIGANs",
    "language": [
        "Python",
        "Shell",
        "R"
    ],
    "lastUpdate": "2021-02-13T14:12:34Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/xuyungang/scIGANs_Reproducibility"
        }
    ],
    "name": "scIGANs",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1093/NAR/GKAA506",
            "metadata": {
                "abstract": "© 2020 The Author(s) 2020. Published by Oxford University Press on behalf of Nucleic Acids Research.Single-cell RNA-sequencing (scRNA-seq) enables the characterization of transcriptomic profiles at the single-cell resolution with increasingly high throughput. However, it suffers from many sources of technical noises, including insufficient mRNA molecules that lead to excess false zero values, termed dropouts. Computational approaches have been proposed to recover the biologically meaningful expression by borrowing information from similar cells in the observed dataset. However, these methods suffer from oversmoothing and removal of natural cell-to-cell stochasticity in gene expression. Here, we propose the generative adversarial networks (GANs) for scRNA-seq imputation (scIGANs), which uses generated cells rather than observed cells to avoid these limitations and balances the performance between major and rare cell populations. Evaluations based on a variety of simulated and real scRNA-seq datasets show that scIGANs is effective for dropout imputation and enhances various downstream analysis. ScIGANs is robust to small datasets that have very few genes with low expression and/or cell-to-cell variance. ScIGANs works equally well on datasets from different scRNA-seq protocols and is scalable to datasets with over 100 000 cells. We demonstrated in many ways with compelling evidence that scIGANs is not only an application of GANs in omics data but also represents a competing imputation method for the scRNA-seq data.",
                "authors": [
                    {
                        "name": "Xu Y."
                    },
                    {
                        "name": "Zhang Z."
                    },
                    {
                        "name": "You L."
                    },
                    {
                        "name": "Liu J."
                    },
                    {
                        "name": "Fan Z."
                    },
                    {
                        "name": "Zhou X."
                    }
                ],
                "citationCount": 2,
                "date": "2020-09-04T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "scIGANs: single-cell RNA-seq imputation using generative adversarial networks"
            },
            "pmcid": "PMC7470961",
            "pmid": "32588900"
        }
    ],
    "topic": [
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "Exome sequencing",
            "uri": "http://edamontology.org/topic_3676"
        }
    ]
}