{
    "accessibility": "Open access",
    "additionDate": "2022-07-20T04:55:23.901146Z",
    "biotoolsCURIE": "biotools:claffinity",
    "biotoolsID": "claffinity",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "manfred.auer@ed.ac.uk",
            "name": "Manfred Auer",
            "orcidid": "https://orcid.org/0000-0001-8920-3522",
            "typeEntity": "Person"
        },
        {
            "email": "s.shave@ed.ac.uk",
            "name": "Steven Shave",
            "orcidid": "https://orcid.org/0000-0001-6996-3663",
            "typeEntity": "Person"
        }
    ],
    "description": "A tool for investigating the impact of labelled ligand affinity in competition experiments.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Virtual screening",
                    "uri": "http://edamontology.org/operation_3938"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://github.com/stevenshave/competition-label-affinity",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T15:54:26.286000Z",
    "license": "MIT",
    "name": "CLAffinity",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1021/acs.jcim.2c00285",
            "metadata": {
                "abstract": "A simplistic assumption in setting up a competition assay is that a low affinity labeled ligand can be more easily displaced from a target protein than a high affinity ligand, which in turn produces a more sensitive assay. An often-cited paper correctly rallies against this assumption and recommends the use of the highest affinity ligand available for experiments aiming to determine competitive inhibitor affinities. However, we have noted this advice being applied incorrectly to competition-based primary screens where the goal is optimum assay sensitivity, enabling a clear yes/no binding determination for even low affinity interactions. The published advice only applies to secondary, confirmatory assays intended for accurate affinity determination of primary screening hits. We demonstrate that using very high affinity ligands in competition-based primary screening can lead to reduced assay sensitivity and, ultimately, the discarding of potentially valuable active compounds. We build on techniques developed in our PyBindingCurve software for a mechanistic understanding of complex biological interaction systems, developing the “CLAffinity tool” for simulating competition experiments using protein, ligand, and inhibitor concentrations common to drug screening campaigns. CLAffinity reveals optimum labeled ligand affinity ranges based on assay parameters, rather than general rules to optimize assay sensitivity. We provide the open source CLAffinity software toolset to carry out assay simulations and a video summarizing key findings to aid in understanding, along with a simple lookup table allowing identification of optimal dynamic ranges for competition-based primary screens. The application of our freely available software and lookup tables will lead to the consistent creation of more performant competition-based primary screens identifying valuable hit compounds, particularly for difficult targets.",
                "authors": [
                    {
                        "name": "Auer M."
                    },
                    {
                        "name": "Pham N.T."
                    },
                    {
                        "name": "Shave S."
                    }
                ],
                "citationCount": 1,
                "date": "2022-05-23T00:00:00Z",
                "journal": "Journal of Chemical Information and Modeling",
                "title": "CLAffinity: A Software Tool for Identification of Optimum Ligand Affinity for Competition-Based Primary Screens"
            },
            "pmcid": "PMC9131445",
            "pmid": "35442032"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Compound libraries and screening",
            "uri": "http://edamontology.org/topic_3343"
        },
        {
            "term": "Immunoproteins and antigens",
            "uri": "http://edamontology.org/topic_2830"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ],
    "validated": 1
}
