{
    "additionDate": "2018-06-11T19:25:07Z",
    "biotoolsCURIE": "biotools:k-branches",
    "biotoolsID": "k-branches",
    "credit": [
        {
            "email": "fabian.theis@helmholtz-muenchen.de",
            "name": "Fabian Theis",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Model-based branching point detection in single-cell data by K-branches clustering.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/theislab/kbranches"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Functional clustering",
                    "uri": "http://edamontology.org/operation_3459"
                },
                {
                    "term": "RNA-Seq analysis",
                    "uri": "http://edamontology.org/operation_3680"
                }
            ]
        }
    ],
    "homepage": "https://github.com/theislab/kbranches",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-10T12:58:59Z",
    "name": "K-Branches",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btx325",
            "metadata": {
                "abstract": "© The Author 2017. Published by Oxford University Press.Motivation The identification of heterogeneities in cell populations by utilizing single-cell technologies such as single-cell RNA-Seq, enables inference of cellular development and lineage trees. Several methods have been proposed for such inference from high-dimensional single-cell data. They typically assign each cell to a branch in a differentiation trajectory. However, they commonly assume specific geometries such as tree-like developmental hierarchies and lack statistically sound methods to decide on the number of branching events. Results We present K-Branches, a solution to the above problem by locally fitting half-lines to single-cell data, introducing a clustering algorithm similar to K-Means. These halflines are proxies for branches in the differentiation trajectory of cells. We propose a modified version of the GAP statistic for model selection, in order to decide on the number of lines that best describe the data locally. In this manner, we identify the location and number of subgroups of cells that are associated with branching events and full differentiation, respectively. We evaluate the performance of our method on single-cell RNA-Seq data describing the differentiation of myeloid progenitors during hematopoiesis, single-cell qPCR data of mouse blastocyst development, single-cell qPCR data of human myeloid monocytic leukemia and artificial data. Availability and implementation An R implementation of K-Branches is freely available at https://github.com/theislab/kbranches. Contact fabian.theis@helmholtz-muenchen.de Supplementary informationSupplementary dataare available at Bioinformatics online.",
                "authors": [
                    {
                        "name": "Chlis N.K."
                    },
                    {
                        "name": "Wolf F.A."
                    },
                    {
                        "name": "Theis F.J."
                    }
                ],
                "citationCount": 5,
                "date": "2017-10-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Model-based branching point detection in single-cell data by K-branches clustering"
            }
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "RNA-seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ],
    "validated": 1
}