{
    "additionDate": "2020-01-14T20:04:22Z",
    "biotoolsCURIE": "biotools:VNA",
    "biotoolsID": "VNA",
    "confidence_flag": "tool",
    "description": "Vascular Network Analysis (VNA) is a novel analysis protocol based on freely available or commonly used software to generate vascular data from μCT scans.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Pathway or network analysis",
                    "uri": "http://edamontology.org/operation_2497"
                },
                {
                    "term": "Validation",
                    "uri": "http://edamontology.org/operation_2428"
                }
            ]
        }
    ],
    "homepage": "http://github.com/McBrideGagyiLab/VNA",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2021-01-16T18:05:49Z",
    "license": "GPL-3.0",
    "name": "VNA",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1002/JOR.24568",
            "metadata": {
                "abstract": "© 2019 Orthopaedic Research Society. Published by Wiley Periodicals, Inc.The dependence on angiogenesis for bone repair makes accurate measuring of vascular networks of great importance to orthopedic researchers. A three-dimensional imaging modality like microcomputed tomography (µCT) would better capture these networks than histology. There are commercially available programs to analyze vessel networks in three dimensions, but these may be too costly for laboratories. Alternatively, µCT trabecular software could be used but may not be appropriate. The goal of this project was to develop a vascular network analysis protocol based on freely or commonly available software and compare its performance to that of a µCT trabecular analysis software. The protocol developed, called vascular network analysis or VNA, relies on two modules in Fiji ImageJ and a custom MATLAB program. We validated the software and compared it to a µCT trabecular analysis program (MicroCT) using in silico models of increasing complexity and differing homogeneity. In general, VNA outcomes were significantly different from true values, but most were within an acceptable percent error (<10%). VNA and MicroCT performed almost identically for volume but significantly differently for average vessel diameter. For the homogenous models, the average diameters differed only slightly but were starkly different for the heterogeneous models. In the most heterogeneous system, the MicroCT software overestimated average diameter by about 650% from true. VNA was within 1% of true for the same model. In conclusion, we have developed a program to analyze vascular networks from MicroCT scans which is easily accessible, insensitive to network homogeneity, and of higher accuracy compared to a µCT trabecular analysis software.",
                "authors": [
                    {
                        "name": "Hall A.F."
                    },
                    {
                        "name": "McBride-Gagyi S."
                    },
                    {
                        "name": "Peters J."
                    },
                    {
                        "name": "Schuelke M."
                    },
                    {
                        "name": "Vest L."
                    },
                    {
                        "name": "Zustiak S.P."
                    }
                ],
                "date": "2020-06-01T00:00:00Z",
                "journal": "Journal of Orthopaedic Research",
                "title": "MicroCT vascular network analysis program: Development, validation, and comparison to manufacturer software"
            },
            "pmid": "31840849"
        }
    ],
    "topic": [
        {
            "term": "Musculoskeletal medicine",
            "uri": "http://edamontology.org/topic_3416"
        },
        {
            "term": "Tomography",
            "uri": "http://edamontology.org/topic_3452"
        }
    ],
    "validated": 1
}
