
{
    "credit": [
        {
            "email": "laura.furlong@upf.edu",
            "name": "Laura Furlong",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "https://bitbucket.org/ibi_group/comorbidity"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Pathogenicity prediction",
                    "uri": "http://edamontology.org/operation_3461"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "R"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Library"
        ],
        "topic": [
            {
                "term": "Pathology",
                "uri": "http://edamontology.org/topic_0634"
            },
            {
                "term": "Molecular medicine",
                "uri": "http://edamontology.org/topic_3388"
            },
            {
                "term": "Medicines research and development",
                "uri": "http://edamontology.org/topic_3376"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© The Author(s) 2018. Published by Oxford University Press.Motivation: The study of comorbidities is a major priority due to their impact on life expectancy, quality of life and healthcare cost. The availability of electronic health records (EHRs) for data mining offers the opportunity to discover disease associations and comorbidity patterns from the clinical history of patients gathered during routine medical care. This opens the need for analytical tools for detection of disease comorbidities, including the investigation of their underlying genetic basis. Results: We present comoRbidity, an R package aimed at providing a systematic and comprehensive analysis of disease comorbidities from both the clinical and molecular perspectives. comoRbidity leverages from (i) user provided clinical data from EHR databases (the clinical comorbidity analysis) and (ii) genotype-phenotype information of the diseases under study (the molecular comorbidity analysis) for a comprehensive analysis of disease comorbidities. The clinical comorbidity analysis enables identifying significant disease comorbidities from clinical data, including sex and age stratification and temporal directionality analyses, while the molecular comorbidity analysis supports the generation of hypothesis on the underlying mechanisms of the disease comorbidities by exploring shared genes among disorders. The open-source comoRbidity package is a software tool aimed at expediting the integrative analysis of disease comorbidities by incorporating several analytical and visualization functions.",
            "authors": [
                "Gutierrez-Sacristan A.",
                "Bravo A.",
                "Giannoula A.",
                "Mayer M.A.",
                "Sanz F.",
                "Furlong L.I."
            ],
            "cit_count": 1,
            "doi": "10.1093/bioinformatics/bty315",
            "journal": "Bioinformatics",
            "title": "comoRbidity: An R package for the systematic analysis of disease comorbidities",
            "year": "2018-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:comorbidity",
        "biotoolsID": "comorbidity",
        "description": "Systematic analysis of disease comorbidities.",
        "homepage": "https://bitbucket.org/ibi_group/comorbidity",
        "name": "comoRbidity"
    }
}