{
    "additionDate": "2017-02-10T14:14:49Z",
    "biotoolsCURIE": "biotools:asian",
    "biotoolsID": "asian",
    "description": "Server for inferring regulatory networks from gene expression profiles that combines cluster analysis, regression analysis, and graphical Gaussian modeling.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                },
                {
                    "term": "Gene expression profile clustering",
                    "uri": "http://edamontology.org/operation_0313"
                },
                {
                    "term": "Gene expression profiling",
                    "uri": "http://edamontology.org/operation_0314"
                },
                {
                    "term": "Gene regulatory network analysis",
                    "uri": "http://edamontology.org/operation_1781"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "http://eureka.cbrc.jp/asian/",
    "homepage_status": 1,
    "lastUpdate": "2018-12-10T12:58:39Z",
    "name": "ASIAN",
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "Motivation: Gene expression profile data are rapidly accumulating due to advances in microarray techniques. The abundant data are analyzed by clustering procedures to extract the useful information about the genes inherent in the data. In the clustering analyses, the systematic determination of the boundaries of gene clusters, instead of by visual inspection and biological knowledge, still remains challenging. Results: We propose a statistical procedure to estimate the number of clusters in the hierarchical clustering of the expression profiles. Following the hierarchical clustering, the statistical property of the profiles at the node in the dendrogram is evaluated by a statistics-based value: the variance inflation factor in the multiple regression analysis. The evaluation leads to an automatic determination of the cluster boundaries without any additional analyses and any biological knowledge of the measured genes. The performance of the present procedure is demonstrated on the profiles of 2467 yeast genes, with very promising results.",
                "authors": [
                    {
                        "name": "Horimoto K."
                    },
                    {
                        "name": "Toh H."
                    }
                ],
                "citationCount": 45,
                "date": "2002-01-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Statistical estimation of cluster boundaries in gene expression profile data"
            },
            "pmid": "11751222"
        },
        {
            "metadata": {
                "abstract": "Motivation: Recent advances in DNA microarray technologies have made it possible to measure the expression levels of thousands of genes simultaneously under different conditions. The data obtained by microarray analyses are called expression profile data. One type of important information underlying the expression profile data is the 'genetic network,' that is, the regulatory network among genes. Graphical Gaussian Modeling (GGM) is a widely utilized method to infer or test relationships among a plural of variables. Results: In this study, we developed a method combining the cluster analysis with GGM for the inference of the genetic network from the expression profile data. The expression profile data of 2467 Saccharomyces cerevisiae genes measured under 79 different conditions (Eisen et al., Proc. Natl Acad. Sci. USA, 95, 14 683-14 868, 1998) were used for this study. At first, the 2467 genes were classified into 34 clusters by a cluster analysis, as a preprocessing for GGM. Then, the expression levels of the genes in each cluster were averaged for each condition. The averaged expression profile data of 34 clusters were subjected to GGM, and a partial correlation coefficient matrix was obtained as a model of the genetic network of S. cerevisiae. The accuracy of the inferred network was examined by the agreement of our results with the cumulative results of experimental studies.",
                "authors": [
                    {
                        "name": "Horimoto K."
                    },
                    {
                        "name": "Toh H."
                    }
                ],
                "citationCount": 151,
                "date": "2002-01-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Inference of a genetic network by a combined approach of cluster analysis and graphical Gaussian modeling"
            },
            "pmid": "11847076"
        },
        {
            "metadata": {
                "abstract": "Summary: We constructed a website for inferring a network by applying the graphical Gaussian model, from a large amount of data, including redundant information. The available tools on the website are based on a system, named ASIAN (Automatic System for Inferring A Network), in combination with the two methods in our previous papers, which were designed to analyze gene expression profiles on a genomic scale. One of the remarkable features of the website is its ability to infer a network, concomitant with hierarchical clustering and the following estimation of cluster boundaries. © Oxford University Press 2004; all rights reserved.",
                "authors": [
                    {
                        "name": "Aburatani S."
                    },
                    {
                        "name": "Fumoto M."
                    },
                    {
                        "name": "Goto K."
                    },
                    {
                        "name": "Horimoto K."
                    },
                    {
                        "name": "Imaizumi A."
                    },
                    {
                        "name": "Murakami H."
                    },
                    {
                        "name": "Saito S."
                    },
                    {
                        "name": "Sato M."
                    },
                    {
                        "name": "Sugaya N."
                    },
                    {
                        "name": "Toh H."
                    }
                ],
                "citationCount": 13,
                "date": "2004-11-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "ASIAN: A website for network inference"
            },
            "pmid": "15130931"
        },
        {
            "metadata": {
                "abstract": "The standard workflow in gene expression profile analysis to identify gene function is the clustering by various metrics and techniques, and the following analyses, such as sequence analyses of upstream regions. A further challenging analysis is the inference of a gene regulatory network, and some computational methods have been intensively developed to deduce the gene regulatory network. Here, we describe our web server for inferring a framework of regulatory networks from a large number of gene expression profiles, based on graphical Gaussian modeling (GGM) in combination with hierarchical clustering (http:// eureka.ims.u-tokyo.ac.jp/asian). GGM is based on a simple mathematical structure, which is the calculation of the inverse of the correlation coefficient matrix between variables, and therefore, our server can analyze a wide variety of data within a reasonable computational time. The server allows users to input the expression profiles, and it outputs the dendrogram of genes by several hierarchical clustering techniques, the cluster number estimated by a stopping rule for hierarchical clustering and the network between the clusters by GGM, with the respective graphical presentations. Thus, the ASIAN (Automatic System for Inferring A Network) web server provides an initial basis for inferring regulatory relationships, in that the clustering serves as the first step toward identifying the gene function. © 2005 Oxford University Press.",
                "authors": [
                    {
                        "name": "Aburatani S."
                    },
                    {
                        "name": "Goto K."
                    },
                    {
                        "name": "Horimoto K."
                    },
                    {
                        "name": "Saito S."
                    },
                    {
                        "name": "Toh H."
                    }
                ],
                "citationCount": 20,
                "date": "2005-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "ASIAN: A web server for inferring a regulatory network framework from gene expression profiles"
            },
            "pmid": "15980557"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Gene and protein families",
            "uri": "http://edamontology.org/topic_0623"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Gene regulation",
            "uri": "http://edamontology.org/topic_0204"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ],
    "validated": 1
}
