
{
    "credit": [
        {
            "email": "yxi@bcm.edu",
            "name": "Y. Xi",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Read mapping",
                    "uri": "http://edamontology.org/operation_3198"
                },
                {
                    "term": "Bisulfite mapping",
                    "uri": "http://edamontology.org/operation_3186"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "C++"
        ],
        "license": "GPL-3.0",
        "operatingSystem": [
            "Linux"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Epigenetics",
                "uri": "http://edamontology.org/topic_3295"
            }
        ]
    },
    "publication": [
        {
            "abstract": "Background: Bisulfite sequencing is a powerful technique to study DNA cytosine methylation. Bisulfite treatment followed by PCR amplification specifically converts unmethylated cytosines to thymine. Coupled with next generation sequencing technology, it is able to detect the methylation status of every cytosine in the genome. However, mapping high-throughput bisulfite reads to the reference genome remains a great challenge due to the increased searching space, reduced complexity of bisulfite sequence, asymmetric cytosine to thymine alignments, and multiple CpG heterogeneous methylation. Results: We developed an efficient bisulfite reads mapping algorithm BSMAP to address the above issues. BSMAP combines genome hashing and bitwise masking to achieve fast and accurate bisulfite mapping. Compared with existing bisulfite mapping approaches, BSMAP is faster, more sensitive and more flexible. Conclusion: BSMAP is the first general-purpose bisulfite mapping software. It is able to map high-throughput bisulfite reads at whole genome level with feasible memory and CPU usage. It is freely available under GPL v3 license at http://code.google.com/p/bsmap/. © 2009 Xi and Li; licensee BioMed Central Ltd.",
            "authors": [
                "Xi Y.",
                "Li W."
            ],
            "cit_count": 349,
            "journal": "BMC Bioinformatics",
            "pmid": "19635165",
            "title": "BSMAP: Whole genome bisulfite sequence MAPping program",
            "year": "2009-07-27"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:bsmap",
        "biotoolsID": "bsmap",
        "description": "short reads mapping software for bisulfite sequencing",
        "homepage": "https://code.google.com/archive/p/bsmap/",
        "name": "BSMAP"
    }
}