{
    "additionDate": "2017-09-19T09:31:54Z",
    "biotoolsCURIE": "biotools:diana-lncbase",
    "biotoolsID": "diana-lncbase",
    "credit": [
        {
            "email": "artemis.hatzigeorgiou@gmail.com",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.microrna.gr"
        }
    ],
    "description": "Incorporates an extensive collection of miRNA:lncRNA interactions. The database includes more than 70,000 low and high-throughput, (in)direct miRNA:lncRNA experimentally supported interactions, derived from manually curated publications and the analysis of 153 AGO CLIP-Seq libraries. LncBase v2 hosts in silico predicted miRNA targets on lncRNAs, identified with the DIANA-microT algorithm.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://carolina.imis.athena-innovation.gr/diana_tools/web/index.php?r=site%2Fabout"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Annotation",
                    "uri": "http://edamontology.org/operation_0226"
                }
            ]
        }
    ],
    "homepage": "http://www.microrna.gr/LncBase/",
    "lastUpdate": "2019-03-12T13:29:15Z",
    "name": "DIANA-LNCBase",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "dianalab",
    "publication": [
        {
            "doi": "10.1093/nar/gkv1270",
            "metadata": {
                "abstract": "© The Author(s) 2015.MicroRNAs (miRNAs) are short non-coding RNAs (ncRNAs) that act as post-transcriptional regulators of coding gene expression. Long non-coding RNAs (lncRNAs) have been recently reported to interact with miRNAs. The sponge-like function of lncRNAs introduces an extra layer of complexity in the miRNA interactome. DIANA-LncBase v1 provided a database of experimentally supported and in silico predicted miRNA Recognition Elements (MREs) on lncRNAs. The second version of LncBase (www.microrna.gr/LncBase) presents an extensive collection of miRNA:lncRNA interactions. The significantly enhanced database includes more than 70 000 low and high-throughput, (in)direct miRNA:lncRNA experimentally supported interactions, derived from manually curated publications and the analysis of 153 AGO CLIP-Seq libraries. The new experimental module presents a 14-fold increase compared to the previous release. LncBase v2 hosts in silico predicted miRNA targets on lncRNAs, identified with the DIANA-microT algorithm. The relevant module provides millions of predicted miRNA binding sites, accompanied with detailed metadata and MRE conservation metrics. LncBase v2 caters information regarding cell type specific miRNA:lncRNA regulation and enables users to easily identify interactions in 66 different cell types, spanning 36 tissues for human and mouse. Database entries are also supported by accurate lncRNA expression information, derived from the analysis of more than 6 billion RNA-Seq reads.",
                "authors": [
                    {
                        "name": "Paraskevopoulou M.D."
                    },
                    {
                        "name": "Vlachos I.S."
                    },
                    {
                        "name": "Karagkouni D."
                    },
                    {
                        "name": "Georgakilas G."
                    },
                    {
                        "name": "Kanellos I."
                    },
                    {
                        "name": "Vergoulis T."
                    },
                    {
                        "name": "Zagganas K."
                    },
                    {
                        "name": "Tsanakas P."
                    },
                    {
                        "name": "Floros E."
                    },
                    {
                        "name": "Dalamagas T."
                    },
                    {
                        "name": "Hatzigeorgiou A.G."
                    }
                ],
                "citationCount": 173,
                "date": "2016-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "DIANA-LncBase v2: Indexing microRNA targets on non-coding transcripts"
            },
            "pmcid": "PMC4702897",
            "pmid": "26612864",
            "type": [
                "Primary"
            ]
        },
        {
            "doi": "10.1093/nar/gks1246",
            "metadata": {
                "abstract": "Recently, the attention of the research community has been focused on long non-coding RNAs (IncRNAs) and their physiological/pathological implications. As the number of experiments increase in a rapid rate and transcriptional units are better annotated, databases indexing IncRNA properties and function gradually become essential tools to this process. Aim of DIANA-LncBase (www. microrna.gr/LncBase) is to reinforce researchers' attempts and unravel microRNA (miRNA)-IncRNA putative functional interactions. This study provides, for the first time, a comprehensive annotation of miRNA targets on IncRNAs. DIANA-LncBase hosts transcriptome-wide experimentally verified and computationally predicted miRNA recognition elements (MREs) on human and mouse IncRNAs. The analysis performed includes an integration of most of the available IncRNA resources, relevant high-throughput HITS-CLIP and PAR-CLIP experimental data as well as state-of-the-art in silico target predictions. The experimentally supported entries available in DIANA-LncBase correspond to >5000 interactions, while the computationally predicted interactions exceed 10 million. DIANA-LncBase hosts detailed information for each miRNA-IncRNA pair, such as external links, graphic plots of transcripts' genomic location, representation of the binding sites, IncRNA tissue expression as well as MREs conservation and prediction scores. © The Author(s) 2012.",
                "authors": [
                    {
                        "name": "Paraskevopoulou M.D."
                    },
                    {
                        "name": "Georgakilas G."
                    },
                    {
                        "name": "Kostoulas N."
                    },
                    {
                        "name": "Reczko M."
                    },
                    {
                        "name": "Maragkakis M."
                    },
                    {
                        "name": "Dalamagas T.M."
                    },
                    {
                        "name": "Hatzigeorgiou A.G."
                    }
                ],
                "citationCount": 223,
                "date": "2013-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "DIANA-LncBase: Experimentally verified and computationally predicted microRNA targets on long non-coding RNAs"
            },
            "pmcid": "PMC3531175",
            "pmid": "23193281",
            "type": [
                "Other"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Gene regulation",
            "uri": "http://edamontology.org/topic_0204"
        }
    ]
}