
{
    "credit": [
        {
            "name": "Feedback Form",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://feedback.wishartlab.com/?site=CS23D"
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://www.cs23d.ca/documentation.html"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Protein structure prediction",
                    "uri": "http://edamontology.org/operation_0474"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Java",
            "C++",
            "Perl",
            "Python",
            "C"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "NMR",
                "uri": "http://edamontology.org/topic_0593"
            },
            {
                "term": "Molecular modelling",
                "uri": "http://edamontology.org/topic_2275"
            },
            {
                "term": "Protein structure analysis",
                "uri": "http://edamontology.org/topic_2814"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/cs23d-2-0-protein-structure-generation-nmr-chemical-shifts-sequence-data.html"
        }
    ],
    "publication": [
        {
            "abstract": "CS23D (chemical shift to 3D structure) is a web server for rapidly generating accurate 3D protein structures using only assigned nuclear magnetic resonance (NMR) chemical shifts and sequence data as input. Unlike conventional NMR methods, CS23D requires no NOE and/or J-coupling data to perform its calculations. CS23D accepts chemical shift files in either SHIFTY or BMRB formats, and produces a set of PDB coordinates for the protein in about 10-15 min. CS23D uses a pipeline of several preexisting programs or servers to calculate the actual protein structure. Depending on the sequence similarity (or lack thereof) CS23D uses either (i) maximal subfragment assembly (a form of homology modeling), (ii) chemical shift threading or (iii) shift-aided de novo structure prediction (via Rosetta) followed by chemical shift refinement to generate and/or refine protein coordinates. Tests conducted on more than 100 proteins from the BioMagResBank indicate that CS23D converges (i.e. finds a solution) for >95% of protein queries. These chemical shift generated structures were found to be within 0.2-2.8 A RMSD of the NMR structure generated using conventional NOE-base NMR methods or conventional X-ray methods. The performance of CS23D is dependent on the completeness of the chemical shift assignments and the similarity of the query protein to known 3D folds. CS23D is accessible at http://www.cs23d.ca.",
            "authors": [
                "Wishart D.S.",
                "Arndt D.",
                "Berjanskii M.",
                "Tang P.",
                "Zhou J.",
                "Lin G."
            ],
            "cit_count": 159,
            "journal": "Nucleic acids research",
            "pmid": "18515350",
            "title": "CS23D: a web server for rapid protein structure generation using NMR chemical shifts and sequence data.",
            "year": "2008-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:cs23d",
        "biotoolsID": "cs23d",
        "description": "Chemical Shift to 3D Structure is a web server for rapidly generating accurate 3D protein structures using only assigned NMR chemical shifts as input.",
        "homepage": "http://www.cs23d.ca",
        "name": "CS23D"
    }
}