{
    "additionDate": "2021-01-18T09:09:23Z",
    "biotoolsCURIE": "biotools:simsurvey",
    "biotoolsID": "simsurvey",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "Paul.Regular@dfo-mpo.gc.ca",
            "name": "Paul M. Regular",
            "orcidid": "https://orcid.org/0000-0003-0318-2615",
            "typeEntity": "Person"
        }
    ],
    "description": "An R package for comparing the design and analysis of surveys by simulating spatially-correlated populations.\n\nThe SimSurvey package has been designed to facilitate simulations of sample surveys of spatially-correlated age-structured populations.\n\nTest Surveys by Simulating Spatially-Correlated Populations.\n\nThe SimSurvey package has been designed to facilitate simulations of sample surveys of spatially-correlated age-structured populations.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Modelling and simulation",
                    "uri": "http://edamontology.org/operation_2426"
                },
                {
                    "term": "Pathway analysis",
                    "uri": "http://edamontology.org/operation_3928"
                },
                {
                    "term": "Simulation analysis",
                    "uri": "http://edamontology.org/operation_0244"
                }
            ]
        }
    ],
    "homepage": "https://paulregular.github.io/SimSurvey/",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-02-18T17:51:11Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/PaulRegular/SimSurvey"
        }
    ],
    "name": "SimSurvey",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PONE.0232822",
            "metadata": {
                "abstract": "© 2020 Regular et al.Populations often show complex spatial and temporal dynamics, creating challenges in designing and implementing effective surveys. Inappropriate sampling designs can potentially lead to both under-sampling (reducing precision) and over-sampling (through the extensive and potentially expensive sampling of correlated metrics). These issues can be difficult to identify and avoid in sample surveys of fish populations as they tend to be costly and comprised of multiple levels of sampling. Population estimates are therefore affected by each level of sampling as well as the pathway taken to analyze such data. Though simulations are a useful tool for exploring the efficacy of specific sampling strategies and statistical methods, there are a limited number of tools that facilitate the simulation testing of a range of sampling and analytical pathways for multi-stage survey data. Here we introduce the R package SimSurvey, which has been designed to simplify the process of simulating surveys of age-structured and spatially-distributed populations. The package allows the user to simulate age-structured populations that vary in space and time and explore the efficacy of a range of built-in or user-defined sampling protocols to reproduce the population parameters of the known population. SimSurvey also includes a function for estimating the stratified mean and variance of the population from the simulated survey data. We demonstrate the use of this package using a case study and show that it can reveal unexpected sources of bias and be used to explore design-based solutions to such problems. In summary, Sim- Survey can serve as a convenient, accessible and flexible platform for simulating a wide range of sampling strategies for fish stocks and other populations that show complex structuring. Various statistical approaches can then be applied to the results to test the efficacy of different analytical approaches.",
                "authors": [
                    {
                        "name": "Babyn J."
                    },
                    {
                        "name": "Healey B."
                    },
                    {
                        "name": "Lewis K.P."
                    },
                    {
                        "name": "Mowbray F."
                    },
                    {
                        "name": "Regular P.M."
                    },
                    {
                        "name": "Robertson G.J."
                    }
                ],
                "citationCount": 1,
                "date": "2020-05-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "SimSurvey: An R package for comparing the design and analysis of surveys by simulating spatially-correlated populations"
            },
            "pmcid": "PMC7213729",
            "pmid": "32392233"
        }
    ],
    "topic": [
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Sample collections",
            "uri": "http://edamontology.org/topic_3277"
        },
        {
            "term": "Zoology",
            "uri": "http://edamontology.org/topic_3500"
        }
    ]
}
