{
    "additionDate": "2021-01-18T09:31:29Z",
    "biotoolsCURIE": "biotools:reploc",
    "biotoolsID": "reploc",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "mchen@zju.edu.cn",
            "name": "Ming Chen",
            "typeEntity": "Person"
        }
    ],
    "description": "Sequence repetitiveness quantification and de novo repeat detection by weighted k-mer coverage.\n\nRepLoc Sequence repetitiveness quantification and de novo repeat detection.\n\nWe developed a software named Repeat Locator (RepLoc), which quantifies the sequence repetitiveness based on weighted k-mer coverage. The repetitiveness map (Rmap) generated by RepLoc can be used to determine all repetitive sequences in the genome. The potential applications of this method include: de novo repeat detection (both common repeats and segmental duplications), genome structure and genome mappability analysis, etc.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "de Novo sequencing",
                    "uri": "http://edamontology.org/operation_3644"
                },
                {
                    "term": "Repeat sequence detection",
                    "uri": "http://edamontology.org/operation_0379"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "k-mer counting",
                    "uri": "http://edamontology.org/operation_3472"
                },
                {
                    "term": "De-novo assembly",
                    "uri": "http://edamontology.org/operation_0524"
                }
            ]
        }
    ],
    "homepage": "http://bis.zju.edu.cn/reploc",
    "lastUpdate": "2021-02-06T13:16:43Z",
    "name": "RepLoc",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1093/BIB/BBAA086",
            "metadata": {
                "abstract": "© The Author(s) 2020. Published by Oxford University Press. All rights reserved. For Permissions, please email: journals.permissions@oup.com.DNA repeats are abundant in eukaryotic genomes and have been proved to play a vital role in genome evolution and regulation. A large number of approaches have been proposed to identify various repeats in the genome. Some de novo repeat identification tools can efficiently generate sequence repetitive scores based on k-mer counting for repeat detection. However, we noticed that these tools can still be improved in terms of repetitive score calculation, sensitivity to segmental duplications and detection specificity. Therefore, here, we present a new computational approach named Repeat Locator (RepLoc), which is based on weighted k-mer coverage to quantify the genome sequence repetitiveness and locate the repetitive sequences. According to the repetitiveness map of the human genome generated by RepLoc, we found that there may be relationships between sequence repetitiveness and genome structures. A comprehensive benchmark shows that RepLoc is a more efficient k-mer counting based tool for de novo repeat detection. The RepLoc software is freely available at http://bis.zju.edu.cn/reploc.",
                "authors": [
                    {
                        "name": "Feng C."
                    },
                    {
                        "name": "Dai M."
                    },
                    {
                        "name": "Liu Y."
                    },
                    {
                        "name": "Chen M."
                    }
                ],
                "date": "2021-05-20T00:00:00Z",
                "journal": "Briefings in bioinformatics",
                "title": "Sequence repetitiveness quantification and de novo repeat detection by weighted k-mer coverage"
            },
            "pmid": "32591772"
        }
    ],
    "topic": [
        {
            "term": "Sequence composition, complexity and repeats",
            "uri": "http://edamontology.org/topic_0157"
        },
        {
            "term": "Whole genome sequencing",
            "uri": "http://edamontology.org/topic_3673"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ]
}