{
    "accessibility": "Open access",
    "additionDate": "2022-12-27T16:03:28.805995Z",
    "biotoolsCURIE": "biotools:lagat",
    "biotoolsID": "lagat",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "xrliu@xmu.edu.cn",
            "name": "Xiangrong Liu",
            "orcidid": "https://orcid.org/0000-0001-9885-1978",
            "typeEntity": "Person"
        },
        {
            "name": "Pengyu Luo",
            "orcidid": "https://orcid.org/0000-0002-2300-6355"
        },
        {
            "name": "Shuting Jin",
            "orcidid": "https://orcid.org/0000-0002-8113-9367"
        },
        {
            "name": "Yue Hong",
            "orcidid": "https://orcid.org/0000-0002-6601-278X"
        }
    ],
    "description": "Link-aware Graph Attention Network for Drug-Drug Interaction Prediction.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                },
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                },
                {
                    "term": "Pathway analysis",
                    "uri": "http://edamontology.org/operation_3928"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Azra3lzz/LaGAT",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T15:15:29.823669Z",
    "license": "Not licensed",
    "name": "LaGAT",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btac682",
            "metadata": {
                "abstract": "Motivation: Drug-drug interaction (DDI) prediction is a challenging problem in pharmacology and clinical applications. With the increasing availability of large biomedical databases, large-scale biological knowledge graphs containing drug information have been widely used for DDI prediction. However, large knowledge graphs inevitably suffer from data noise problems, which limit the performance and interpretability of models based on the knowledge graph. Recent studies attempt to improve models by introducing inductive bias through an attention mechanism. However, they all only depend on the topology of entity nodes independently to generate fixed attention pathways, without considering the semantic diversity of entity nodes in different drug pair links. This makes it difficult for models to select more meaningful nodes to overcome data quality limitations and make more interpretable predictions. Results: To address this issue, we propose a Link-aware Graph Attention method for DDI prediction, called LaGAT, which is able to generate different attention pathways for drug entities based on different drug pair links. For a drug pair link, the LaGAT uses the embedding representation of one of the drugs as a query vector to calculate the attention weights, thereby selecting the appropriate topological neighbor nodes to obtain the semantic information of the other drug. We separately conduct experiments on binary and multi-class classification and visualize the attention pathways generated by the model. The results prove that LaGAT can better capture semantic relationships and achieves remarkably superior performance over both the classical and state-of-the-art models on DDI prediction. Availabilityand implementation: The source code and data are available at https://github.com/Azra3lzz/LaGAT.",
                "authors": [
                    {
                        "name": "Hong Y."
                    },
                    {
                        "name": "Jin S."
                    },
                    {
                        "name": "Liu X."
                    },
                    {
                        "name": "Luo P."
                    }
                ],
                "citationCount": 24,
                "date": "2022-12-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "LaGAT: Link-aware graph attention network for drug-drug interaction prediction"
            },
            "pmcid": "PMC9750103",
            "pmid": "36271850"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Drug metabolism",
            "uri": "http://edamontology.org/topic_3375"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Pharmacology",
            "uri": "http://edamontology.org/topic_0202"
        }
    ],
    "validated": 1
}
