
{
    "credit": [
        {
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://www.hca-vision.com/AboutUs.html"
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://www.hca-vision.com/products_subcell.html"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Windows"
        ],
        "toolType": [
            "Desktop application"
        ],
        "topic": [
            {
                "term": "Drug discovery",
                "uri": "http://edamontology.org/topic_3336"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://www.mybiosoftware.com/hca-vision-2-1-6-analysis-cell-images.html"
        }
    ],
    "publication": [
        {
            "abstract": "Automating the analysis of neurons in culture represents a key aspect of the search for neuroactive compounds. A number of commercial neurite analysis software packages tend to measure some basic features such as total neurite length and number of branching points. However, with only these measurements, some differences between neurite morphologies that are clear to a human observer cannot be identified. The authors have developed a suite of image analysis tools that will allow researchers to produce quality analyses at primary screening rates. The suite provides sensitive and information-rich measurements of neurons and neurites. It can discriminate subtle changes in complex neurite arborization even when neurons and neurites are dense. This allows users to selectively screen for compounds triggering different types of neurite outgrowth behavior. In mixed cell populations, neurons can be filtered and separated from other brain cell types so that neurite analysis can be performed only on neurons. It supports batch processing with a built-in database to store the batch-processing results, a batch result viewer, and an ad hoc query builder for users to retrieve features of interest. The suite of tools has been deployed into a software package called HCA-Vision. The free version of the software package is available at http://www.hca-vision.com. © 2010 Society for Laboratory Automation and Screening.",
            "authors": [
                "Wang D.",
                "Lagerstrom R.",
                "Sun C.",
                "Bishof L.",
                "Valotton P.",
                "Gotte M."
            ],
            "cit_count": 31,
            "doi": "10.1177/1087057110382894",
            "journal": "Journal of Biomolecular Screening",
            "pmid": "20855562",
            "title": "HCA-Vision: Automated neurite outgrowth analysis",
            "type": "Primary",
            "year": "2010-10-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:hca-vision",
        "biotoolsID": "hca-vision",
        "description": "HCA-Vision is an automated image analysis software package developed by CSIRO that rapidly and reproducibly measures and reports on important cell features for drug discovery.",
        "homepage": "http://www.hca-vision.com/",
        "name": "HCA-Vision",
        "version": [
            "2.1.6"
        ]
    }
}