{
    "additionDate": "2019-11-14T18:44:29Z",
    "biotoolsCURIE": "biotools:OliveR",
    "biotoolsID": "OliveR",
    "confidence_flag": "very low",
    "credit": [
        {
            "email": "acicatelli@unisa.it",
            "name": "Angela Cicatelli",
            "orcidid": "https://orcid.org/0000-0001-6996-3495",
            "typeEntity": "Person"
        }
    ],
    "description": "> VERY_LOW CONFIDENCE! | > CORRECT NAME OF TOOL COULD ALSO BE 'titled', 'morphometric', 'olive', 'EVOOs' | High Biodiversity Arises from the Analyses of Morphometric, Biochemical and Genetic Data in Ancient Olive Trees of South of Italy | Multivariate analysis of data and geographic display of results | OliveR is an R package containing a shiny application that provides a vast series of statistical tools for exploring and analyzing both quantitative (such as morphometric or biochemical) and genetic data that can be associated to geographical coordinates. Through the use of shapefiles, the application allows visualizing both data and results of a statistical analysis directly on a geographical basis",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Principal component visualisation",
                    "uri": "http://edamontology.org/operation_2939"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                }
            ]
        }
    ],
    "homepage": "https://github.com/nicocriscuolo/OliveR",
    "language": [
        "R"
    ],
    "lastUpdate": "2019-11-14T18:44:29Z",
    "license": "GPL-2.0",
    "name": "OliveR",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.3390/PLANTS8090297",
            "metadata": {
                "abstract": "© 2019 by the authors. Licensee MDPI, Basel, Switzerland.Morphometric, biochemical and genetic analyses were conducted on Olea europaea L. of Campania, an area of Southern Italy highly suited to the cultivation of olive trees and the production of extra virgin olive oil (EVOO). We aimed to characterize the distribution of morphological, biochemical and genetic diversity in this area and to develop a practical tool to aid traceability of oils. Phenotypes were characterized using morphometric data of drupes and leaves; biochemical and genetic diversity were assessed on the basis of the fatty acid composition of the EVOOs and with microsatellite markers, respectively. We provide an open-source tool as a novel R package titled ‘OliveR’, useful in performing multivariate data analysis using a point and click interactive approach. These analyses highlight a clear correlation among the morphological, biochemical and genetic profiles of samples with four collection sites, and confirm that Southern Italy represents a wide reservoir of phenotypic and genetic variability.",
                "authors": [
                    {
                        "name": "Criscuolo N."
                    },
                    {
                        "name": "Guarino F."
                    },
                    {
                        "name": "Angelini C."
                    },
                    {
                        "name": "Castiglione S."
                    },
                    {
                        "name": "Caruso T."
                    },
                    {
                        "name": "Cicatelli A."
                    }
                ],
                "citationCount": 1,
                "date": "2019-09-01T00:00:00Z",
                "journal": "Plants",
                "title": "High biodiversity arises from the analyses of morphometric, biochemical and genetic data in ancient olive trees of South of Italy"
            },
            "pmcid": "PMC6783963",
            "pmid": "31443503"
        }
    ],
    "topic": [
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Biodiversity",
            "uri": "http://edamontology.org/topic_3050"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        }
    ]
}