{
    "additionDate": "2018-07-31T15:04:01Z",
    "biotoolsCURIE": "biotools:equaltdrl",
    "biotoolsID": "equaltdrl",
    "credit": [
        {
            "email": "thartmann@informatik.uni-leipzig.de",
            "name": "Tom Hartmann",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "It is a tool for illustrating all equivalent parsimonious tandem duplication random loss (TDRL) rearrangement scenarios between two given mitochondrial gene orders where at least one of the gene orders can be rearranged into the other one by one TDRL rearrangement.",
    "documentation": [
        {
            "type": "General",
            "url": "http://pacosy.informatik.uni-leipzig.de/270-0-Downloads.html"
        }
    ],
    "download": [
        {
            "type": "Software package",
            "url": "http://pacosy.informatik.uni-leipzig.de/files/111/equaltdrl.tar.gz"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Analysis",
                    "uri": "http://edamontology.org/operation_2945"
                }
            ]
        }
    ],
    "homepage": "http://pacosy.informatik.uni-leipzig.de/269-0-EqualTdrl.html",
    "language": [
        "R",
        "C++"
    ],
    "lastUpdate": "2018-12-10T12:59:00Z",
    "name": "EqualTDRL",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "shadi.m",
    "publication": [
        {
            "doi": "10.1186/s12859-018-2170-x",
            "metadata": {
                "abstract": "© 2018 The Author(s). Background: To study the differences between two unichromosomal circular genomes, e.g., mitochondrial genomes, under the tandem duplication random loss (TDRL) rearrangement it is important to consider the whole set of potential TDRL rearrangement events that could have taken place. The reason is that for two given circular gene orders there can exist different TDRL rearrangements that transform one of the gene orders into the other. Hence, a TDRL event cannot always be reconstructed only from the knowledge of the circular gene order before a TDRL event and the circular gene order after it. Results: We present the program EqualTDRL that computes and illustrates the complete set of TDRLs for pairs of circular gene orders that differ by only one TDRL. EqualTDRL considers the circularity of the given genomes and certain restrictions on the TDRL rearrangements. Examples for the latter are sequences of genes that have to be conserved during a TDRL or pairs of genes that frame intergenic regions which might represent remnants of duplicated genes. Additionally, EqualTDRL allows to determine the set of TDRLs that are minimum with respect to the number of duplicated genes. Conclusion: EqualTDRL supports scientists to study the complete set of TDRLs that possibly could have taken place in the evolution of mitochondrial genomes. EqualTDRL is implemented in C++ using the ggplot2 package of the open source programming language R and is freely available from http://pacosy.informatik.uni-leipzig.de/equaltdrl.",
                "authors": [
                    {
                        "name": "Hartmann T."
                    },
                    {
                        "name": "Bernt M."
                    },
                    {
                        "name": "Middendorf M."
                    }
                ],
                "date": "2018-05-30T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "EqualTDRL: Illustrating equivalent tandem duplication random loss rearrangements"
            },
            "type": "Primary"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "DNA replication and recombination",
            "uri": "http://edamontology.org/topic_3127"
        }
    ],
    "validated": 1
}