{
    "additionDate": "2020-01-14T09:41:47Z",
    "biotoolsCURIE": "biotools:AJIA",
    "biotoolsID": "AJIA",
    "confidence_flag": "tool",
    "description": "Jointly integrating VCF-based variants and OWL-based biomedical ontologies in MongoDB.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                }
            ]
        }
    ],
    "homepage": "https://github.com/lyotvincent/AJIA",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-01-14T15:16:10Z",
    "name": "AJIA",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1109/TCBB.2019.2951137",
            "metadata": {
                "abstract": "The development of the next-generation sequencing (NGS) technologies has led to massive amounts of VCF (Variant Call Format) files, which have been the standard formats developed with 1000 Genomes Project. At the same time, with the widespread use of biomedical ontologies in the biomedical community, more and more applications have accepted the Web Ontology Language (OWL) as the dominant data format for the specifications of biomedical ontology descriptions, leading to the rapid growth of OWL-based biomedical ontology scale. In this paper, we seek to explore an effective method for the management of VCF-based genetic variants and OWL-based biological ontologies using the MongoDB database. Considering many current applications (such as the short genetic variations database dbSNP, etc.) are transitioning to the new design by using JSON (JavaScript Object Notation) to support future massive data expansion and interchanges. We firstly propose a series of rules for the mapping from VCF and OWL files to JSON files, and then present rule-based algorithms for transforming VCF-based genetic variants and OWL-based biological ontologies into JSON objects. On this basis, we introduce effective approaches of integrating the mapped JSON files in MongoDB. Finally, we complement this work with a set of experiments to show the performance of our proposed approaches. The source code of the proposed approaches could be freely available at https://github.com/lyotvincent/AJIA.",
                "authors": [
                    {
                        "name": "Liu J."
                    },
                    {
                        "name": "Qu Z."
                    },
                    {
                        "name": "Su S."
                    },
                    {
                        "name": "Sun J."
                    },
                    {
                        "name": "Yang M."
                    },
                    {
                        "name": "Zhang L."
                    }
                ],
                "citationCount": 1,
                "date": "2020-09-01T00:00:00Z",
                "journal": "IEEE/ACM transactions on computational biology and bioinformatics",
                "title": "Jointly Integrating VCF-Based Variants and OWL-Based Biomedical Ontologies in MongoDB"
            },
            "pmid": "31689201"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Ontology and terminology",
            "uri": "http://edamontology.org/topic_0089"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ],
    "validated": 1
}
