{
    "additionDate": "2018-08-24T10:05:39Z",
    "biotoolsCURIE": "biotools:metagenesense",
    "biotoolsID": "metagenesense",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://github.com/pgp-pasteur-fr/MetaGenSense/issues"
        }
    ],
    "description": "Managing and analytical bioinformatics framework that is engineered to run dedicated Galaxy workflows for the detection and eventually classification of pathogens.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Taxonomic classification",
                    "uri": "http://edamontology.org/operation_3460"
                },
                {
                    "term": "Sequence assembly",
                    "uri": "http://edamontology.org/operation_0310"
                },
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                }
            ]
        }
    ],
    "homepage": "https://github.com/pgp-pasteur-fr/MetaGenSense",
    "language": [
        "JavaScript",
        "Python"
    ],
    "lastUpdate": "2018-12-10T12:59:01Z",
    "license": "GPL-2.0",
    "name": "MetaGeneSense",
    "owner": "aotamendi.1",
    "publication": [
        {
            "doi": "10.12688/F1000RESEARCH.6139.3",
            "metadata": {
                "abstract": "© 2016 Correia D et al.The detection and characterization of emerging infectious agents has been a continuing public health concern. High Throughput Sequencing (HTS) or Next-Generation Sequencing (NGS) technologies have proven to be promising approaches for efficient and unbiased detection of pathogens in complex biological samples, providing access to comprehensive analyses. As NGS approaches typically yield millions of putatively representative reads per sample, efficient data management and visualization resources have become mandatory. Most usually, those resources are implemented through a dedicated Laboratory Information Management System (LIMS), solely to provide perspective regarding the available information. We developed an easily deployable web-interface, facilitating management and bioinformatics analysis of metagenomics data-samples. It was engineered to run associated and dedicated Galaxy workflows for the detection and eventually classification of pathogens. The web application allows easy interaction with existing Galaxy metagenomic workflows, facilitates the organization, exploration and aggregation of the most relevant sample-specific sequences among millions of genomic sequences, allowing them to determine their relative abundance, and associate them to the most closely related organism or pathogen. The user-friendly Django-Based interface, associates the users& input data and its metadata through a bio-IT provided set of resources (a Galaxy instance, and both sufficient storage and grid computing power). Galaxy is used to handle and analyze the user&s input data from loading, indexing, mapping, assembly and DB-searches. Interaction between our application and Galaxy is ensured by the BioBlend library, which gives API-based access to Galaxy&s main features. Metadata about samples, runs, as well as the workflow results are stored in the LIMS. For metagenomic classification and exploration purposes, we show, as a proof of concept, that integration of intuitive exploratory tools, like Krona for representation of taxonomic classification, can be achieved very easily. In the trend of Galaxy, the interface enables the sharing of scientific results to fellow team members.",
                "authors": [
                    {
                        "name": "Correia D."
                    },
                    {
                        "name": "Doppelt-Azeroual O."
                    },
                    {
                        "name": "Denis J.-B."
                    },
                    {
                        "name": "Vandenbogaert M."
                    },
                    {
                        "name": "Caro V."
                    }
                ],
                "date": "2016-01-01T00:00:00Z",
                "journal": "F1000Research",
                "title": "MetaGenSense: A web-application for analysis and exploration of high throughput sequencing metagenomic data"
            },
            "pmcid": "PMC5405795",
            "pmid": "28451381"
        }
    ],
    "toolType": [
        "Web application",
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ],
    "validated": 1
}