{
    "additionDate": "2021-01-18T06:58:30Z",
    "biotoolsCURIE": "biotools:dynavenn",
    "biotoolsID": "dynavenn",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "andreas.keller@ccb.uni-saarland.de",
            "name": "Andreas Keller",
            "typeEntity": "Person"
        }
    ],
    "description": "DynaVenn is a tool for creating Venn diagrams. It can be used to determine the most significant overlap between subsets of two or three sorted (gene) lists. This approach avoids the arbitrary selection of a fixed threshold for the length of the sets.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sorting",
                    "uri": "http://edamontology.org/operation_3802"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                },
                {
                    "term": "Statistical calculation",
                    "uri": "http://edamontology.org/operation_2238"
                }
            ]
        }
    ],
    "homepage": "http://www.ccb.uni-saarland.de/dynavenn",
    "lastUpdate": "2021-03-03T20:59:26Z",
    "name": "DynaVenn",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1186/S12859-019-3320-5",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: In many research disciplines, ordered lists are compared. One example is to compare a subset of all significant genes or proteins in a primary study to those in a replication study. Often, the top of the lists are compared using Venn diagrams, ore more precisely Euler diagrams (set diagrams showing logical relations between a finite collection of different sets). If different cohort sizes, different techniques or algorithms for evaluation were applied, a direct comparison of significant genes with a fixed threshold can however be misleading and approaches comparing lists would be more appropriate. Results: We developed DynaVenn, a web-based tool that incrementally creates all possible subsets from two or three ordered lists and computes for each combination a p-value for the overlap. Respectively, dynamic Venn diagrams are generated as graphical representations. Additionally an animation is generated showing how the most significant overlap is reached by backtracking. We demonstrate the improved performance of DynaVenn over an arbitrary cut-off approach on an Alzheimer's Disease biomarker set. Conclusion: DynaVenn combines the calculation of the most significant overlap of different cohorts with an intuitive visualization of the results. It is freely available as a web service at http://www.ccb.uni-saarland.de/dynavenn.",
                "authors": [
                    {
                        "name": "Amand J."
                    },
                    {
                        "name": "Fehlmann T."
                    },
                    {
                        "name": "Backes C."
                    },
                    {
                        "name": "Keller A."
                    }
                ],
                "citationCount": 2,
                "date": "2019-12-30T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "DynaVenn: Web-based computation of the most significant overlap between ordered sets"
            },
            "pmcid": "PMC6937821",
            "pmid": "31888436"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Zoology",
            "uri": "http://edamontology.org/topic_3500"
        },
        {
            "term": "ChIP-seq",
            "uri": "http://edamontology.org/topic_3169"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ]
}