{
    "additionDate": "2021-01-20T10:56:01Z",
    "biotoolsCURIE": "biotools:symmap",
    "biotoolsID": "symmap",
    "collectionID": [
        "Rare Disease"
    ],
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "xzzhou@bjtu.edu.cn",
            "name": "Xuezhong Zhou",
            "typeEntity": "Person"
        },
        {
            "name": "Yi Zhao",
            "typeEntity": "Person"
        },
        {
            "name": "Jianxin Chen",
            "typeEntity": "Person"
        }
    ],
    "description": "An integrative database of traditional Chinese medicine enhanced by symptom mapping.\n\nSymMap integrates traditional Chinese medicine (TCM) with modern medicine (MM) through both internal molecular mechanism and external symptom mapping.\n\nIt contains 499 herbs registered in the Chinese pharmacopoeia with 19,595 ingredients, and 1,717 corresponding symptoms used in traditional Chinese medicine (TCM symtptom). Those TCM symptoms were rigorously mapped to 961 symptom terms used in modern medicine (MM symptom). Furthermore, SymMap collected associated targets (gene) and diseases for these herbs, either by symptom-disease associations, or by ingredient-target relationships. In total, 4,302 targets and 5,235 diseases were included in SymMap.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Filtering",
                    "uri": "http://edamontology.org/operation_3695"
                },
                {
                    "term": "Relation extraction",
                    "uri": "http://edamontology.org/operation_3625"
                },
                {
                    "term": "Mapping",
                    "uri": "http://edamontology.org/operation_2429"
                },
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                }
            ]
        }
    ],
    "homepage": "http://www.symmap.org/",
    "lastUpdate": "2021-05-21T06:12:36.211881Z",
    "name": "SymMap",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1093/NAR/GKY1021",
            "metadata": {
                "abstract": "© 2018 The Author(s).Recently, the pharmaceutical industry has heavily emphasized phenotypic drug discovery (PDD), which relies primarily on knowledge about phenotype changes associated with diseases. Traditional Chinese medicine (TCM) provides a massive amount of information on natural products and the clinical symptoms they are used to treat, which are the observable disease phenotypes that are crucial for clinical diagnosis and treatment. Curating knowledge of TCM symptoms and their relationships to herbs and diseases will provide both candidate leads and screening directions for evidence-based PDD programs. Therefore, we present SymMap, an integrative database of traditional Chinese medicine enhanced by symptom mapping. We manually curated 1717 TCM symptoms and related them to 499 herbs and 961 symptoms used in modern medicine based on a committee of 17 leading experts practicing TCM. Next, we collected 5235 diseases associated with these symptoms, 19 595 herbal constituents (ingredients) and 4302 target genes, and built a large heterogeneous network containing all of these components. Thus, SymMap integrates TCM with modern medicine in common aspects at both the phenotypic and molecular levels. Furthermore, we inferred all pairwise relationships among SymMap components using statistical tests to give pharmaceutical scientists the ability to rank and filter promising results to guide drug discovery. The SymMap database can be accessed at http://www.symmap.org/ and https://www.bioinfo.org/symmap.",
                "authors": [
                    {
                        "name": "Wu Y."
                    },
                    {
                        "name": "Zhang F."
                    },
                    {
                        "name": "Yang K."
                    },
                    {
                        "name": "Fang S."
                    },
                    {
                        "name": "Bu D."
                    },
                    {
                        "name": "Li H."
                    },
                    {
                        "name": "Sun L."
                    },
                    {
                        "name": "Hu H."
                    },
                    {
                        "name": "Gao K."
                    },
                    {
                        "name": "Wang W."
                    },
                    {
                        "name": "Zhou X."
                    },
                    {
                        "name": "Zhao Y."
                    },
                    {
                        "name": "Chen J."
                    }
                ],
                "citationCount": 70,
                "date": "2019-01-08T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "SymMap: An integrative database of traditional Chinese medicine enhanced by symptom mapping"
            },
            "pmcid": "PMC6323958",
            "pmid": "30380087"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Medicine",
            "uri": "http://edamontology.org/topic_3303"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Drug discovery",
            "uri": "http://edamontology.org/topic_3336"
        },
        {
            "term": "Pharmacology",
            "uri": "http://edamontology.org/topic_0202"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Rare diseases",
            "uri": "http://edamontology.org/topic_3325"
        }
    ]
}