{
    "additionDate": "2017-12-18T00:06:24Z",
    "biotoolsCURIE": "biotools:fstval",
    "biotoolsID": "fstval",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://bioinfo.mju.ac.kr/fstval"
        }
    ],
    "description": "FSTVAL is an open access web tool to manage bulk flanking sequence tags (FSTs).FSTVAL automatically evaluates the FSTs and finds the best mapping positions of the FST against a known genome sequence.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://bioinfo.mju.ac.kr/fstval/help/fstval/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Mapping",
                    "uri": "http://edamontology.org/operation_2429"
                }
            ]
        }
    ],
    "homepage": "http://bioinfo.mju.ac.kr/fstval/",
    "lastUpdate": "2019-01-09T15:33:38Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/fstval-flanking-sequence-tag-validator.html"
        }
    ],
    "name": "FSTVAL",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1186/1746-4811-8-19",
            "metadata": {
                "abstract": "Background: Information about a transgene locus is one of the major concerns in transgenic research because expression of the transgene or a gene interrupted by the integration event could be affected. Thus, the flanking sequences obtained from transgenic plants need to be analyzed in terms of genomic context, such as genic and intergenic regions. This process may consist of several steps: 1) elimination of a vector sequence from the flanking sequence, 2) finding the locations in the target genome, and 3) statistics of the integration sites. These steps could be automated for flanking sequences from several dozens of transgenic plants generated in an ordinary targeted gene expression strategy. It would be indispensable in a genome-wide mutagenesis screen using T-DNA or transposons because these projects often generate several thousands of transgenic lines and just as many loci of the transgene among the transgenic plants.Results: We present an open access web tool, flanking sequence tags validator (FSTVAL), to manage bulk flanking sequence tags (FSTs). FSTVAL automatically evaluates the FSTs and finds the best mapping positions of the FST against a known genome sequence. The statistics, in terms of genic and intergenic regions, are presented as a table, a distribution map, and a frequency graph along the chromosomes. Currently, 17 plant genome sequences, including Arabidopsis thaliana, Oryza sativa, and Glycine max, are available as reference genomes. We evaluated the utility and accuracy of the tool with 5,144 rice FSTs. The whole process, from uploading the sequences to generating tables of insertions, required a few minutes, with less than 4 clicks in the web environment.Conclusions: Run for 1 year and tested over 1,000 times, we have confirmed FSTVAL efficiently handles bulk FSTs. FSTVAL is freely available without login at http://bioinfo.mju.ac.kr/fstval/. © 2012 Kim et al.; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Kim J.S."
                    },
                    {
                        "name": "Kim J."
                    },
                    {
                        "name": "Lee T.-H."
                    },
                    {
                        "name": "Jun K.M."
                    },
                    {
                        "name": "Kim T.H."
                    },
                    {
                        "name": "Kim Y.-H."
                    },
                    {
                        "name": "Park H.-M."
                    },
                    {
                        "name": "Jeon J.-S."
                    },
                    {
                        "name": "An G."
                    },
                    {
                        "name": "Yoon U.-H."
                    },
                    {
                        "name": "Nahm B.H."
                    },
                    {
                        "name": "Kim Y.-K."
                    }
                ],
                "citationCount": 12,
                "date": "2012-06-18T00:00:00Z",
                "journal": "Plant Methods",
                "title": "FSTVAL: A new web tool to validate bulk flanking sequence tags"
            },
            "pmcid": "PMC3439307",
            "pmid": "22709793",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        }
    ],
    "validated": 1
}