{
    "accessibility": "Open access",
    "additionDate": "2019-08-09T13:23:24Z",
    "biotoolsCURIE": "biotools:BMSS",
    "biotoolsID": "BMSS",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "engbiobmss.help@gmail.com",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Automated BioModel Selection System for gene circuit designs, supports bio-model automated fitting and selection processes, providing a means to efficiently derive the best model candidate that could capture the transient (time-series) dynamic profiles of a bio-part or device using characterization data.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://github.com/EngBioNUS/BMSSlib/blob/master/BMSS_User_Manual.pdf"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "https://github.com/EngBioNUS/BMSSlib/releases"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Modelling and simulation",
                    "uri": "http://edamontology.org/operation_2426"
                }
            ]
        }
    ],
    "homepage": "http://www.bioeng.nus.edu.sg/engbio/software.html",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-06-16T10:55:25Z",
    "license": "Apache-2.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/EngBioNUS/BMSSlib"
        },
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/EngBioNUS/BMSSlib/issues"
        }
    ],
    "maturity": "Mature",
    "name": "BMSS",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "hans",
    "publication": [
        {
            "doi": "10.1021/ACSSYNBIO.8B00523",
            "metadata": {
                "abstract": "© 2019 American Chemical Society.Constructing a complex functional gene circuit composed of different modular biological parts to achieve the desired performance remains challenging without a proper understanding of how the individual module behaves. To address this, mathematical models serve as an important tool toward better interpretation by quantifying the performance of the overall gene circuit, providing insights, and guiding the experimental designs. As different gene circuits might require exclusively different mathematical representations in the form of ordinary differential equations to capture their transient dynamic behaviors, a recurring challenge in model development is the selection of the appropriate model. Here, we developed an automated biomodel selection system (BMSS) which includes a library of pre-established models with intuitive or unintuitive features derived from a vast array of expression profiles. Selection of models is built upon the Akaike information criteria (AIC). We tested the automated platform using characterization data of routinely used inducible systems, constitutive expression systems, and several different logic gate systems (NOT, AND, and OR gates). The BMSS achieved a good agreement for all the different characterization data sets and managed to select the most appropriate model accordingly. To enable exchange and reproducibility of gene circuit design models, the BMSS platform also generates Synthetic Biology Open Language (SBOL)-compliant gene circuit diagrams and Systems Biology Markup Language (SBML) output files. All aspects of the algorithm were programmed in a modular manner to ease the efforts on model extensions or customizations by users. Taken together, the BMSS which is implemented in Python supports users in deriving the best mathematical model candidate in a fast, efficient, and automated way using part/circuit characterization data.",
                "authors": [
                    {
                        "name": "Yeoh J.W."
                    },
                    {
                        "name": "Ng K.B.I."
                    },
                    {
                        "name": "Teh A.Y."
                    },
                    {
                        "name": "Zhang J."
                    },
                    {
                        "name": "Chee W.K.D."
                    },
                    {
                        "name": "Poh C.L."
                    }
                ],
                "date": "2019-07-19T00:00:00Z",
                "journal": "ACS Synthetic Biology",
                "title": "An Automated Biomodel Selection System (BMSS) for Gene Circuit Designs"
            },
            "pmid": "31035759",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Mathematics",
            "uri": "http://edamontology.org/topic_3315"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ]
}