{
    "additionDate": "2018-05-31T14:59:04Z",
    "biotoolsCURIE": "biotools:isocket",
    "biotoolsID": "isocket",
    "credit": [
        {
            "email": "heal.jw@gmail.com",
            "name": "Jack W Heal",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "d.n.woolfson@bristol.ac.uk",
            "name": "Derek N Woolfson",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Interactive analysis of side-chain packing within proteins to identify coiled coils automatically and with considerable user control.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/woolfson-group/isocket"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein structure assignment",
                    "uri": "http://edamontology.org/operation_0320"
                }
            ]
        }
    ],
    "homepage": "https://github.com/woolfson-group/isocket",
    "language": [
        "Python"
    ],
    "lastUpdate": "2018-12-10T12:58:59Z",
    "name": "iSOCKET",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/bty347",
            "metadata": {
                "abstract": "© The Author(s) 2018. Motivation: To understand protein structure, folding and function fully and to design proteins de novo reliably, we must learn from natural protein structures that have been characterized experimentally. The number of protein structures available is large and growing exponentially, which makes this task challenging. Indeed, computational resources are becoming increasingly important for classifying and analyzing this resource. Here, we use tools from graph theory to define an Atlas classification scheme for automatically categorizing certain protein substructures. Results: Focusing on the a-helical coiled coils, which are ubiquitous protein-structure and protein- protein interaction motifs, we present a suite of computational resources designed for analyzing these assemblies. iSOCKET enables interactive analysis of side-chain packing within proteins to identify coiled coils automatically and with considerable user control. Applying a graph theory-based Atlas classification scheme to structures identified by iSOCKET gives the Atlas of Coiled Coils, a fully automated, updated overview of extant coiled coils. The utility of this approach is illustrated with the first formal classification of an emerging subclass of coiled coils called a-helical barrels. Furthermore, in the Atlas, the known coiled-coil universe is presented alongside a partial enumeration of the 'dark matter' of coiled-coil structures; i.e. those coiled-coil architectures that are theoretically possible but have not been observed to date, and thus present defined targets for protein design.",
                "authors": [
                    {
                        "name": "Heal J.W."
                    },
                    {
                        "name": "Bartlett G.J."
                    },
                    {
                        "name": "Wood C.W."
                    },
                    {
                        "name": "Thomson A.R."
                    },
                    {
                        "name": "Woolfson D.N."
                    }
                ],
                "date": "2018-10-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Applying graph theory to protein structures: An Atlas of coiled coils"
            }
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        },
        {
            "term": "Protein structure analysis",
            "uri": "http://edamontology.org/topic_2814"
        },
        {
            "term": "Protein sites, features and motifs",
            "uri": "http://edamontology.org/topic_3510"
        }
    ],
    "validated": 1,
    "version": [
        "0.3.1"
    ]
}