{
    "additionDate": "2024-07-18T12:00:54.038788Z",
    "biotoolsCURIE": "biotools:plant_lncpipe",
    "biotoolsID": "plant_lncpipe",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "jianfeng.mao@umu.se",
            "name": "Jian-Feng Mao",
            "orcidid": "https://orcid.org/0000-0001-9735-8516",
            "typeEntity": "Person"
        }
    ],
    "description": "Computational pipeline providing significant improvement in plant lncRNA identification.",
    "editPermission": {
        "type": "private"
    },
    "homepage": "https://github.com/xuechantian/Plant-LncRNA-pipline",
    "language": [
        "R"
    ],
    "lastUpdate": "2024-11-24T13:50:36.517946Z",
    "name": "Plant-LncPipe",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/hr/uhae041",
            "metadata": {
                "abstract": "Long non-coding RNAs (lncRNAs) play essential roles in various biological processes, such as chromatin remodeling, post-transcriptional regulation, and epigenetic modifications. Despite their critical functions in regulating plant growth, root development, and seed dormancy, the identification of plant lncRNAs remains a challenge due to the scarcity of specific and extensively tested identification methods. Most mainstream machine learning-based methods used for plant lncRNA identification were initially developed using human or other animal datasets, and their accuracy and effectiveness in predicting plant lncRNAs have not been fully evaluated or exploited. To overcome this limitation, we retrained several models, including CPAT, PLEK, and LncFinder, using plant datasets and compared their performance with mainstream lncRNA prediction tools such as CPC2, CNCI, RNAplonc, and LncADeep. Retraining these models significantly improved their performance, and two of the retrained models, LncFinder-plant and CPAT-plant, alongside their ensemble, emerged as the most suitable tools for plant lncRNA identification. This underscores the importance of model retraining in tackling the challenges associated with plant lncRNA identification. Finally, we developed a pipeline (Plant-LncPipe) that incorporates an ensemble of the two best-performing models and covers the entire data analysis process, including reads mapping, transcript assembly, lncRNA identification, classification, and origin, for the efficient identification of lncRNAs in plants. The pipeline, Plant-LncPipe, is available at: https://github.com/xuechantian/Plant-LncRNA-pipline.",
                "authors": [
                    {
                        "name": "Bao Y.-T."
                    },
                    {
                        "name": "Chen Z.-Y."
                    },
                    {
                        "name": "Jia K.-H."
                    },
                    {
                        "name": "Li Z.-C."
                    },
                    {
                        "name": "Ma H.-Y."
                    },
                    {
                        "name": "Mao J.-F."
                    },
                    {
                        "name": "Nie S."
                    },
                    {
                        "name": "Shi T.-L."
                    },
                    {
                        "name": "Tian X.-C."
                    },
                    {
                        "name": "Yan X.-M."
                    },
                    {
                        "name": "Zhao W."
                    }
                ],
                "date": "2024-04-01T00:00:00Z",
                "journal": "Horticulture Research",
                "title": "Plant-LncPipe: a computational pipeline providing significant improvement in plant lncRNA identification"
            },
            "pmcid": "PMC11024640",
            "pmid": "38638682"
        }
    ],
    "toolType": [
        "Workflow"
    ],
    "topic": [
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        },
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ]
}
