{
    "additionDate": "2019-11-14T20:10:32Z",
    "biotoolsCURIE": "biotools:violence_youth_violence_bullying_perpetration",
    "biotoolsID": "violence_youth_violence_bullying_perpetration",
    "confidence_flag": "very low",
    "credit": [
        {
            "email": "alison.culyba@chp.edu",
            "name": "Alison J. Culyba",
            "typeEntity": "Person"
        }
    ],
    "description": "> VERY_LOW CONFIDENCE! | > HOMEPAGE MISSING! | > CORRECT NAME OF TOOL COULD ALSO BE 'sexual violence youth violence bullying', 'violence youth violence bullying', 'sexual violence youth violence', 'violence youth violence' | Co-occurrence of Violence-Related Risk and Protective Behaviors and Adult Support Among Male Youth in Urban Neighborhoods | Importance:Male youth in lower-resource neighborhoods bear a disproportionate burden of violence involvement, but little is known about clusters of specific violence-related behaviors to inform cross-cutting interventions that address multiple forms of violence. Objective:To examine associations between adult support and patterns of violence and risk or protective behavior co-occurrence among male youths in urban neighborhoods. Design, Setting, and Participants:Cross-sectional analysis of baseline and end-of-program data from a recently completed cluster-randomized sexual violence prevention trial across 20 lower-resource neighborhoods",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "https://www.ncbi.nlm.nih.gov/pubmed/?term=31517967",
    "lastUpdate": "2019-11-14T20:10:32Z",
    "name": "violence youth violence bullying perpetration",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1001/JAMANETWORKOPEN.2019.11375",
            "metadata": {
                "abstract": "Importance: Male youth in lower-resource neighborhoods bear a disproportionate burden of violence involvement, but little is known about clusters of specific violence-related behaviors to inform cross-cutting interventions that address multiple forms of violence. Objective: To examine associations between adult support and patterns of violence and risk or protective behavior co-occurrence among male youths in urban neighborhoods. Design, Setting, and Participants: Cross-sectional analysis of baseline and end-of-program data from a recently completed cluster-randomized sexual violence prevention trial across 20 lower-resource neighborhoods. Participants were male youths, aged 13 to 19 years, enrolled at youth-serving community agencies in Pittsburgh, Pennsylvania, from July 27, 2015, to June 5, 2017. Data were analyzed from July 1, 2018, to February 28, 2019. Exposures: Social support and natural mentoring, as defined by validated survey measures. Main Outcomes and Measures: Validated survey measures (youth violence, bullying, sexual and dating violence, history of exposure to violence and related adversities, substance use, school engagement, and future orientation) were assessed for detailed co-occurrence patterns using hierarchical clustering, dendrograms, and heatmaps across prespecified domains. Wilcoxon rank sum tests and logistic regression models examined associations between adult support and violence involvement. Results: Among 866 participants, the mean (SD) age was 15.5 (1.6) years and 632 participants (77.5%) identified as African American. All 866 participants completed baseline surveys and 577 completed end-of-program surveys. Seven clusters of risk and protective behaviors emerged: (1) school engagement; (2) career and future aspirations; (3) substance use and bullying exposure; (4) exposure to violence and related adversities, sexual violence exposure, peer delinquency, and gang involvement; (5) sexual violence, youth violence, and bullying perpetration; (6) dating abuse perpetration; and (7) physical or sexual partner violence perpetration. The strongest association cluster occurred among sexual violence perpetration behaviors. Youth with high social support engaged in significantly fewer of the 40 prespecified risk behaviors (high social support median [interquartile range], 8 [5-12] behaviors vs low social support median [interquartile range], 10 [6-14] behaviors; mean difference, 1.64 behaviors; 95% CI, 0.63-2.64 behaviors; P = .004). High social support and natural mentoring were both inversely associated with gang involvement (social support: odds ratio [OR], 0.39; 95% CI, 0.22-0.71; and natural mentoring: OR, 0.44; 95% CI, 0.25-0.76) and sexual violence exposure (social support: OR, 0.39; 95% CI, 0.24-0.64; and natural mentoring: OR, 0.61; 95% CI, 0.39-0.98). Conclusions and Relevance: These findings suggest that co-occurrence of risk and protective behaviors differ significantly among youth with vs without adult support. Violence prevention interventions designed to leverage adult support should address broader co-occurrence patterns.",
                "authors": [
                    {
                        "name": "Culyba A.J."
                    },
                    {
                        "name": "Miller E."
                    },
                    {
                        "name": "Albert S.M."
                    },
                    {
                        "name": "Abebe K.Z."
                    }
                ],
                "date": "2019-09-04T00:00:00Z",
                "journal": "JAMA network open",
                "title": "Co-occurrence of Violence-Related Risk and Protective Behaviors and Adult Support Among Male Youth in Urban Neighborhoods"
            },
            "pmcid": "PMC6745057",
            "pmid": "31517967"
        }
    ],
    "topic": [
        {
            "term": "Trauma medicine",
            "uri": "http://edamontology.org/topic_3414"
        },
        {
            "term": "Geriatric medicine",
            "uri": "http://edamontology.org/topic_3399"
        },
        {
            "term": "Public health and epidemiology",
            "uri": "http://edamontology.org/topic_3305"
        }
    ]
}