{
    "accessibility": "Open access",
    "additionDate": "2022-09-05T13:55:03.784513Z",
    "biotoolsCURIE": "biotools:capt",
    "biotoolsID": "capt",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "georges.hattab@uni-marburg.de",
            "name": "Georges Hattab",
            "typeEntity": "Person"
        },
        {
            "name": "Gizem Kaya"
        }
    ],
    "description": "An interactive web tool to provide taxonomic context for a given phylogenetic tree.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Phylogenetic inference",
                    "uri": "http://edamontology.org/operation_0323"
                },
                {
                    "term": "Phylogenetic tree comparison",
                    "uri": "http://edamontology.org/operation_0325"
                },
                {
                    "term": "Phylogenetic tree editing",
                    "uri": "http://edamontology.org/operation_0326"
                },
                {
                    "term": "Phylogenetic tree topology analysis",
                    "uri": "http://edamontology.org/operation_0551"
                },
                {
                    "term": "Phylogenetic tree visualisation",
                    "uri": "http://edamontology.org/operation_0567"
                }
            ]
        }
    ],
    "homepage": "https://github.com/ghattab/CAPT",
    "language": [
        "JavaScript"
    ],
    "lastUpdate": "2022-09-05T13:55:03.786939Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "https://capt.mathematik.uni-marburg.de/"
        }
    ],
    "name": "CAPT",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.3389/FGENE.2022.891240",
            "metadata": {
                "abstract": "Copyright © 2022 Kaya, Ezekannagha, Heider and Hattab.Sustained efforts in next-generation sequencing technologies are changing the field of taxonomy. The increase in the number of resolved genomes has made the traditional taxonomy of species antiquated. With phylogeny-based methods, taxonomies are being updated and refined. Although such methods bridge the gap between phylogeny and taxonomy, phylogeny-based taxonomy currently lacks interactive visualization approaches. Motivated by enriching and increasing the consistency of evolutionary and taxonomic studies alike, we propose Context-Aware Phylogenetic Trees (CAPT) as an interactive web tool to support users in exploration- and validation-based tasks. To complement phylogenetic information with phylogeny-based taxonomy, we offer linking two interactive visualizations which compose two simultaneous views: the phylogenetic tree view and the taxonomic icicle view. Thanks to its space-filling properties, the icicle visualization follows the intuition behind taxonomies where different hierarchical rankings with equal number of child elements can be represented with same-sized rectangular areas. In other words, it provides partitions of different sizes depending on the number of elements they contain. The icicle view integrates seven taxonomic rankings: domain, phylum, class, order, family, genus, and species. CAPT enriches the clades in the phylogenetic tree view with context from the genomic data and supports interactive techniques such as linking and brushing to highlight correspondence between the two views. Four different use cases, extracted from the Genome Taxonomy DataBase, were employed to create four scenarios using our approach. CAPT was successfully used to explore the phylogenetic trees as well as the taxonomic data by providing context and using the interaction techniques. This tool is essential to increase the accuracy of categorization of newly identified species and validate updated taxonomies. The source code and data are freely available at https://github.com/ghattab/CAPT.",
                "authors": [
                    {
                        "name": "Ezekannagha C."
                    },
                    {
                        "name": "Hattab G."
                    },
                    {
                        "name": "Heider D."
                    },
                    {
                        "name": "Kaya G."
                    }
                ],
                "date": "2022-05-18T00:00:00Z",
                "journal": "Frontiers in Genetics",
                "title": "Context-Aware Phylogenetic Trees for Phylogeny-Based Taxonomy Visualization"
            },
            "pmcid": "PMC9158481",
            "pmid": "35664339"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Cladistics",
            "uri": "http://edamontology.org/topic_3944"
        },
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        },
        {
            "term": "RNA immunoprecipitation",
            "uri": "http://edamontology.org/topic_3794"
        },
        {
            "term": "Taxonomy",
            "uri": "http://edamontology.org/topic_0637"
        }
    ]
}
