
{
    "credit": [
        {
            "name": "Joan Segura",
            "typeEntity": "Person",
            "typeRoles": [
                "Developer"
            ],
            "url": "http://biocomp.cnb.csic.es/"
        },
        {
            "email": "jr.macias@cnb.csic.es",
            "name": "Jose R. Macias",
            "typeEntity": "Person",
            "typeRoles": [
                "Maintainer"
            ],
            "url": "http://3dbionotes.cnb.csic.es"
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://3diana.cnb.csic.es/3DIANA/help.html"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Protein interaction analysis",
                    "uri": "http://edamontology.org/operation_2949"
                },
                {
                    "term": "Protein quaternary structure prediction",
                    "uri": "http://edamontology.org/operation_3350"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Molecular modelling",
                "uri": "http://edamontology.org/topic_2275"
            },
            {
                "term": "Protein interactions",
                "uri": "http://edamontology.org/topic_0128"
            },
            {
                "term": "Bioinformatics",
                "uri": "http://edamontology.org/topic_0091"
            },
            {
                "term": "Molecular interactions, pathways and networks",
                "uri": "http://edamontology.org/topic_0602"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://www.mybiosoftware.com/3diana-a-toolbox-for-quaternary-structure-modeling.html"
        }
    ],
    "publication": [
        {
            "abstract": "© 2016 The Authors. Electron microscopy (EM) is experiencing a revolution with the advent of a new generation of Direct Electron Detectors, enabling a broad range of large and flexible structures to be resolved well below 1 nm resolution. Although EM techniques are evolving to the point of directly obtaining structural data at near-atomic resolution, for many molecules the attainable resolution might not be enough to propose high-resolution structural models. However, accessing information on atomic coordinates is a necessary step toward a deeper understanding of the molecular mechanisms that allow proteins to perform specific tasks. For that reason, methods for the integration of EM three-dimensional maps with x-ray and NMR structural data are being developed, a modeling task that is normally referred to as fitting, resulting in the so called hybrid models. In this work, we present a novel application - 3DIANA - specially targeted to those cases in which the EM map resolution is medium or low and additional experimental structural information is scarce or even lacking. In this way, 3DIANA statistically evaluates proposed/potential contacts between protein domains, presents a complete catalog of both structurally resolved and predicted interacting regions involving these domains and, finally, suggests structural templates to model the interaction between them. The evaluation of the proposed interactions is computed with DIMERO, a new method that scores physical binding sites based on the topology of protein interaction networks, which has recently shown the capability to increase by 200% the number of domain-domain interactions predicted in interactomes as compared to previous approaches. The new application displays the information at a sequence and structural level and is accessible through a web browser or as a Chimera plugin at http://3diana.cnb.csic.es.",
            "authors": [
                "Segura J.",
                "Sanchez-Garcia R.",
                "Tabas-Madrid D.",
                "Cuenca-Alba J.",
                "Sorzano C.O.S.",
                "Carazo J.M."
            ],
            "cit_count": 7,
            "journal": "Biophysical Journal",
            "pmid": "26772592",
            "title": "3DIANA: 3D Domain Interaction Analysis: A Toolbox for Quaternary Structure Modeling",
            "year": "2016-02-23"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:3diana",
        "biotoolsID": "3diana",
        "description": "3DIANA (3D Domain Interaction Analysis) is a web based environment designed to integrate bioinformatics-like information for the analysis of protein interactions and quaternary structure modellling",
        "homepage": "http://3diana.cnb.csic.es/",
        "name": "3DIANA"
    }
}