{
    "additionDate": "2022-10-10T08:47:59.862252Z",
    "biotoolsCURIE": "biotools:plifepred",
    "biotoolsID": "plifepred",
    "credit": [
        {
            "name": "Dr Gajendra P.S. Raghava",
            "url": "https://webs.iiitd.edu.in/raghava/plifepred/index.php"
        }
    ],
    "description": "Design half life of peptides in blood",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://webs.iiitd.edu.in/raghava/plifepred/index.php"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Analysis",
                    "uri": "http://edamontology.org/operation_2945"
                }
            ]
        }
    ],
    "homepage": "https://webs.iiitd.edu.in/raghava/plifepred/index.php",
    "lastUpdate": "2022-10-10T08:48:05.651545Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "https://webs.iiitd.edu.in/raghava/plifepred/index.php"
        }
    ],
    "name": "plifepred",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "raghavagps",
    "publication": [
        {
            "doi": "10.1371/journal.pone.0196829",
            "metadata": {
                "abstract": "© 2018 Mathur et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.This paper describes a web server developed for designing therapeutic peptides with desired half-life in blood. In this study, we used 163 natural and 98 modified peptides whose half-life has been determined experimentally in mammalian blood, for developing in silico models. Firstly, models have been developed on 261 peptides containing natural and modified residues, using different chemical descriptors. The best model using 43 PaDEL descriptors got a maximum correlation of 0.692 between the predicted and the actual half-life peptides. Secondly, models were developed on 163 natural peptides using amino acid composition feature of peptides and achieved a maximum correlation of 0.643. Thirdly, models were developed on 163 natural peptides using chemical descriptors and attained a maximum correlation of 0.743 using 45 selected PaDEL descriptors. In order to assist researchers in the prediction and designing of half-life of peptides, the models developed have been integrated into PlifePred web server (http://webs.iiitd.edu.in//raghava/plifepred/).",
                "authors": [
                    {
                        "name": "Agrawal P."
                    },
                    {
                        "name": "Mathur D."
                    },
                    {
                        "name": "Mehta A."
                    },
                    {
                        "name": "Raghava G.P.S."
                    },
                    {
                        "name": "Singh S."
                    }
                ],
                "citationCount": 39,
                "date": "2018-06-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "In silico approaches for predicting the half-life of natural and modified peptides in blood"
            }
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Computational biology",
            "uri": "http://edamontology.org/topic_3307"
        }
    ]
}
