{
    "additionDate": "2019-11-14T19:55:05Z",
    "biotoolsCURIE": "biotools:distanced",
    "biotoolsID": "distanced",
    "confidence_flag": "tool",
    "description": "Accurate estimation of microbial sequence diversity with Distanced | Distanced is a bioinformatics tool that estimates diversity of microbes. Specifically, it estimates the diversity of ribosomal DNA sequences within microbial communities. Estimating diversity of microbes is a challenge because errors in sequence create false sequences and inflate diversity. Distanced overcomes this problem by correcting values of mean pairwise distance, a measure of within-sample diversity, for the expected increase after sequencing | Distanced requires a set a DNA sequence reads in fastq format. A set of reference sequences in fasta format is optional. If reference sequences are provided, Distanced will report the actual diversity of the DNA sequences, providing a check on accuracy",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence trimming",
                    "uri": "http://edamontology.org/operation_3192"
                },
                {
                    "term": "Sequence distance matrix generation",
                    "uri": "http://edamontology.org/operation_0289"
                },
                {
                    "term": "Primer removal",
                    "uri": "http://edamontology.org/operation_3237"
                }
            ]
        }
    ],
    "homepage": "https://github.com/thackmann/Distanced",
    "language": [
        "R",
        "C++"
    ],
    "lastUpdate": "2020-12-02T16:58:21.237972Z",
    "name": "Distanced",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ668",
            "metadata": {
                "abstract": "© 2019 The Author(s). Published by Oxford University Press. All rights reserved.Motivation: Microbes are the most diverse organisms on the planet. Deep sequencing of ribosomal DNA (rDNA) suggests thousands of different microbes may be present in a single sample. However, errors in sequencing have made any estimate of within-sample (alpha) diversity uncertain. Results: We developed a tool to estimate alpha diversity of rDNA sequences from microbes (and other sequences). Our tool, Distanced, calculates how different (distant) sequences would be without sequencing errors. It does this using a Bayesian approach. Using this approach, Distanced accurately estimated alpha diversity of rDNA sequences from bacteria and fungi. It had lower root mean square prediction error (RMSPE) than when using no tool (leaving sequencing errors uncorrected). It was also accurate with non-microbial sequences (antibody mRNA). State-of-the-art tools (DADA2 and Deblur) were far less accurate. They often had higher RMSPE than when using no tool. Distanced thus represents an improvement over existing tools. Distanced will be useful to several disciplines, given microbial diversity affects everything from human health to ecosystem function.",
                "authors": [
                    {
                        "name": "Hackmann T.J."
                    }
                ],
                "date": "2020-02-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Accurate estimation of microbial sequence diversity with Distanced"
            },
            "pmid": "31504180"
        }
    ],
    "topic": [
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Probes and primers",
            "uri": "http://edamontology.org/topic_0632"
        },
        {
            "term": "Microbial ecology",
            "uri": "http://edamontology.org/topic_3697"
        }
    ]
}