{
    "additionDate": "2021-01-18T09:02:44Z",
    "biotoolsCURIE": "biotools:cvcdap",
    "biotoolsID": "cvcdap",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "jijiafu@hsc.pku.edu.cn",
            "name": "Jiafu Ji",
            "orcidid": "https://orcid.org/0000-0001-6878-5543",
            "typeEntity": "Person"
        },
        {
            "email": "wujm@bjmu.edu.cn",
            "name": "Jianmin Wu",
            "orcidid": "https://orcid.org/0000-0002-8876-128X",
            "typeEntity": "Person"
        }
    ],
    "description": "CVCDAP (Cancer Virtual Cohort Discovery Analysis Platform) a web-based platform to deliver an interactive and customizable toolbox off the shelf for cohort-level analysis of TCGA and CPTAC public datasets, as well as user uploaded datasets. CVCDAP allows flexible selection of patients sharing common molecular and/or clinical characteristics across multiple studies as a virtual cohort, and provides dozens of built-in customizable tools for seamless genomic, transcriptomic, proteomic and clinical analysis of a single virtual cohort, as well as, to compare two virtual cohorts with relevance.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                },
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://omics.bjcancer.org/cvcdap/",
    "lastUpdate": "2021-02-18T18:48:40Z",
    "name": "CVCDAP",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/NAR/GKAA423",
            "metadata": {
                "abstract": "© 2020 Oxford University Press. All rights reserved.accumulation of an overwhelming amount of cancer-related data, which provides an unprecedented resource to interrogate diverse questions. While certain existing web servers are valuable and widely used, analysis and visualization functions with regard to re-investigation of these data at cohort level are not adequately addressed. Here, we present CVCDAP, a web-based platform to deliver an interactive and customizable toolbox off the shelf for cohort-level analysis of TCGA and CPTAC public datasets, as well as user uploaded datasets. CVCDAP allows flexible selection of patients sharing common molecular and/or clinical characteristics acrossmultiple studies as a virtual cohort, and provides dozens of built-in customizable tools for seamless genomic, transcriptomic, proteomic and clinical analysis of a single virtual cohort, as well as, to compare two virtual cohorts with relevance. The flexibility and analytic competence of CVCDAP empower experimental and clinical researchers to identify new molecular mechanisms and develop potential therapeutic approaches, by building and analyzing virtual cohorts for their subject of interests. We demonstrate that CVCDAP can conveniently reproduce published findings and reveal novel insights by two applications. The CVCDAP web server is freely available at https://omics.bjcancer.org/cvcdap/.",
                "authors": [
                    {
                        "name": "Cai M."
                    },
                    {
                        "name": "Du Y."
                    },
                    {
                        "name": "Guan X."
                    },
                    {
                        "name": "Ji J."
                    },
                    {
                        "name": "Wu J."
                    },
                    {
                        "name": "Yang E."
                    }
                ],
                "citationCount": 4,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "CVCDAP: An integrated platform for molecular and clinical analysis of cancer virtual cohorts"
            },
            "pmcid": "PMC7439093",
            "pmid": "32449936"
        }
    ],
    "toolType": [
        "Bioinformatics portal"
    ],
    "topic": [
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Preclinical and clinical studies",
            "uri": "http://edamontology.org/topic_3379"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ]
}
