{
    "accessibility": "Open access",
    "additionDate": "2023-01-28T11:33:39.723315Z",
    "biotoolsCURIE": "biotools:espaloma",
    "biotoolsID": "espaloma",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "John D. Chodera",
            "orcidid": "https://orcid.org/0000-0003-0542-119X",
            "typeEntity": "Person"
        },
        {
            "name": "Yuanqing Wang",
            "orcidid": "https://orcid.org/0000-0003-4403-2015",
            "typeEntity": "Person"
        }
    ],
    "description": "End-to-end differentiable construction of molecular mechanics force fields.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Forcefield parameterisation",
                    "uri": "http://edamontology.org/operation_3893"
                },
                {
                    "term": "Molecular dynamics",
                    "uri": "http://edamontology.org/operation_2476"
                },
                {
                    "term": "Virtual screening",
                    "uri": "http://edamontology.org/operation_3938"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://github.com/choderalab/espaloma",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T15:07:30.485563Z",
    "license": "MIT",
    "name": "espaloma",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1039/d2sc02739a",
            "metadata": {
                "abstract": "Molecular mechanics (MM) potentials have long been a workhorse of computational chemistry. Leveraging accuracy and speed, these functional forms find use in a wide variety of applications in biomolecular modeling and drug discovery, from rapid virtual screening to detailed free energy calculations. Traditionally, MM potentials have relied on human-curated, inflexible, and poorly extensible discrete chemical perception rules (atom types) for applying parameters to small molecules or biopolymers, making it difficult to optimize both types and parameters to fit quantum chemical or physical property data. Here, we propose an alternative approach that uses graph neural networks to perceive chemical environments, producing continuous atom embeddings from which valence and nonbonded parameters can be predicted using invariance-preserving layers. Since all stages are built from smooth neural functions, the entire process—spanning chemical perception to parameter assignment—is modular and end-to-end differentiable with respect to model parameters, allowing new force fields to be easily constructed, extended, and applied to arbitrary molecules. We show that this approach is not only sufficiently expressive to reproduce legacy atom types, but that it can learn to accurately reproduce and extend existing molecular mechanics force fields. Trained with arbitrary loss functions, it can construct entirely new force fields self-consistently applicable to both biopolymers and small molecules directly from quantum chemical calculations, with superior fidelity than traditional atom or parameter typing schemes. When adapted to simultaneously fit partial charge models, espaloma delivers high-quality partial atomic charges orders of magnitude faster than current best-practices with low inaccuracy. When trained on the same quantum chemical small molecule dataset used to parameterize the Open Force Field (“Parsley”) openff-1.2.0 small molecule force field augmented with a peptide dataset, the resulting espaloma model shows superior accuracy vis-á-vis experiments in computing relative alchemical free energy calculations for a popular benchmark. This approach is implemented in the free and open source package espaloma, available at https://github.com/choderalab/espaloma.",
                "authors": [
                    {
                        "name": "Bruce Macdonald H.E."
                    },
                    {
                        "name": "Chodera J.D."
                    },
                    {
                        "name": "Fass J."
                    },
                    {
                        "name": "Henry M."
                    },
                    {
                        "name": "Herr J.E."
                    },
                    {
                        "name": "Kaminow B."
                    },
                    {
                        "name": "Pulido I."
                    },
                    {
                        "name": "Rufa D."
                    },
                    {
                        "name": "Takaba K."
                    },
                    {
                        "name": "Wang Y."
                    },
                    {
                        "name": "Zhang I."
                    }
                ],
                "citationCount": 29,
                "date": "2022-09-08T00:00:00Z",
                "journal": "Chemical Science",
                "title": "End-to-end differentiable construction of molecular mechanics force fields"
            },
            "pmcid": "PMC9600499",
            "pmid": "36349096"
        }
    ],
    "toolType": [
        "Library",
        "Script"
    ],
    "topic": [
        {
            "term": "Chemistry",
            "uri": "http://edamontology.org/topic_3314"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Molecular biology",
            "uri": "http://edamontology.org/topic_3047"
        },
        {
            "term": "Physics",
            "uri": "http://edamontology.org/topic_3318"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
