{"credit":[{"email":"arek@ebi.ac.uk","name":"Arek Kasprzyk","typeEntity":"Person","typeRoles":["Primary contact"]}],"function":[{"operation":[{"term":"Data retrieval","uri":"http://edamontology.org/operation_2422"},{"term":"Filtering","uri":"http://edamontology.org/operation_3695"},{"term":"Query and retrieval","uri":"http://edamontology.org/operation_0224"},{"term":"Formatting","uri":"http://edamontology.org/operation_0335"}]}],"labels":{"language":["SQL"],"operatingSystem":["Linux","Windows","Mac"],"toolType":["Web application"],"topic":[{"term":"Gene transcripts","uri":"http://edamontology.org/topic_3512"},{"term":"Data integration and warehousing","uri":"http://edamontology.org/topic_3366"},{"term":"Database management","uri":"http://edamontology.org/topic_3489"},{"term":"Molecular interactions, pathways and networks","uri":"http://edamontology.org/topic_0602"},{"term":"Pathology","uri":"http://edamontology.org/topic_0634"}]},"publication":[{"abstract":"The EnsMart system (www.ensembl.org/EnsMart) provides a generic data warehousing solution for fast and flexible querying of large biological data sets and integration with third-party data and tools. The system consists of a query-optimized database and interactive, user-friendly interfaces. EnsMart has been applied to Ensembl, where it extends its genomic browser capabilities, facilitating rapid retrieval of customized data sets. A wide variety of complex queries, on various types of annotations, for numerous species are supported. These can be applied to many research problems, ranging from SNP selection for candidate gene screening, through cross-species evolutionary comparisons, to microarray annotation. Users can group and refine biological data according to many criteria, including cross-species analyses, disease links, sequence variations, and expression patterns. Both tabulated list data and biological sequence output can be generated dynamically, in HTML, text, Microsoft Excel, and compressed formats. A wide range of sequence types, Such as cDNA, peptides, coding regions, UTRs, and exons, with additional upstream and downstream regions, can be retrieved. The EnsMart database can be accessed via a public Web site, or through a Java application suite. Both implementations and the database are freely available for local installation, and can be extended or adapted to 'non-Ensembl' data sets.","authors":["Kasprzk A.","Keefe D.","Smedley D.","London D.","Spooner W.","Melsopp C.","Hammond M.","Rocca-Serra P.","Cox T.","Birney E."],"cit_count":320,"journal":"Genome Research","pmid":"14707178","title":"EnsMart: A generic system for fast and flexible access to biological data","year":"2004-01-01"}],"summary":{"biotoolsCURIE":"biotools:martview","biotoolsID":"martview","description":"Tool for data retrieval and data mining that integrates data from Ensembl. Through the web interface it allows you to apply a series of filters to create custom datasets which can be converted to several useful output formats.","homepage":"http://www.biomart.org/biomart/martview/","name":"MartView"}}