{"credit":[{"email":"kcoombes@mdanderson.org","name":"Kevin R. Coombes","typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://bioinformatics.mdanderson.org/index.html"}],"documentation":[{"url":"http://bioinformatics.mdanderson.org/Software/OOMPA/Current/oompaBase-manual.pdf"}],"function":[{"operation":[{"term":"Analysis","uri":"http://edamontology.org/operation_2945"}]}],"labels":{"collectionID":["Proteomics"],"language":["R"],"operatingSystem":["Linux","Windows","Mac"],"toolType":["Command-line tool"],"topic":[{"term":"Proteomics","uri":"http://edamontology.org/topic_0121"},{"term":"Microarray experiment","uri":"http://edamontology.org/topic_3518"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/oompa-2-12-object-oriented-microarray-proteomic-analysis.html"}],"publication":[{"abstract":"© The Author 2014. Published by Oxford University Press. All rights reserved. Motivation: High-throughput reverse-phase protein array (RPPA) technology allows for the parallel measurement of protein expression levels in approximately 1000 samples. However, the many steps required in the complex protocol (sample lysate preparation, slide printing, hybridization, washing and amplified detection) may create substantial variability in data quality. We are not aware of any other quality control algorithm that is tuned to the special characteristics of RPPAs. Results: We have developed a novel classifier for quality control of RPPA experiments using a generalized linear model and logistic function. The outcome of the classifier, ranging from 0 to 1, is defined as the probability that a slide is of good quality. After training, we tested the classifier using two independent validation datasets. We conclude that the classifier can distinguish RPPA slides of good quality from those of poor quality sufficiently well such that normalization schemes, protein expression patterns and advanced biological analyses will not be drastically impacted by erroneous measurements or systematic variations. Availability and implementation: The classifier, implemented in the \"SuperCurve\" R package, can be freely downloaded at http://bioinformatics.mdanderson.org/main/OOMPA:Overview or http://r-forge.r-project.org/projects/supercurve/. The data used to develop and validate the classifier are available at http://bioinformatics.mdanderson.org/MOAR.","authors":["Ju Z.","Liu W.","Roebuck P.L.","Siwak D.R.","Zhang N.","Lu Y.","Davies M.A.","Akbani R.","Weinstein J.N.","Mills G.B.","Coombes K.R."],"cit_count":10,"journal":"Bioinformatics","pmid":"25380958","title":"Development of a robust classifier for quality control of reverse-phase protein arrays","year":"2015-03-15"}],"summary":{"biotoolsCURIE":"biotools:oompa","biotoolsID":"oompa","description":"Object-oriented microarray and proteomics analysis library implemented in R using S4 classes and compatible with BioConductor.","homepage":"http://bioinformatics.mdanderson.org/main/OOMPA:Overview","name":"OOMPA"}}