{
    "additionDate": "2023-02-09T14:14:54.062031Z",
    "biotoolsCURIE": "biotools:alveolus_analysis",
    "biotoolsID": "alveolus_analysis",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "pbelvitc@uic.edu",
            "name": "Patrick Belvitch",
            "orcidid": "https://orcid.org/0000-0002-2404-8346",
            "typeEntity": "Person"
        }
    ],
    "description": "A web browser-based tool to analyze lung intravital microscopy.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Feature extraction",
                    "uri": "http://edamontology.org/operation_3937"
                },
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://github.com/uic-evl/AlveolusAnalysis",
    "language": [
        "JavaScript",
        "Python"
    ],
    "lastUpdate": "2024-11-24T15:04:17.532833Z",
    "license": "Other",
    "name": "Alveolus Analysis",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1186/s12890-022-02274-7",
            "metadata": {
                "abstract": "Background: Acute lung injury and the acute respiratory distress syndrome are characterized by pulmonary inflammation, reduced endothelial barrier integrity and filling of the alveolar space with protein rich edema fluid and infiltrating leukocytes. Animal models are critical to uncovering the pathologic mechanisms of this devastating syndrome. Intravital imaging of the intact lung via two-photon intravital microscopy has proven a valuable method to investigate lung injury in small rodent models through characterization of inflammatory cells and vascular changes in real time. However, respiratory motion complicates the analysis of these time series images and requires selective data extraction to stabilize the image. Consequently, analysis of individual alveoli may not provide a complete picture of the integrated mechanical, vascular and inflammatory processes occurring simultaneously in the intact lung. To address these challenges, we developed a web browser-based visualization application named Alveolus Analysis to process, analyze and graphically display intravital lung microscopy data. Results: The designed tool takes raw temporal image data as input, performs image preprocessing and feature extraction offline, and visualizes the extracted information in a web browser-based interface. The interface allows users to explore multiple experiments in three panels corresponding to different levels of detail: summary statistics of alveolar/neutrophil behavior, characterization of alveolar dynamics including lung edema and inflammatory cells at specific time points, and cross-experiment analysis. We performed a case study on the utility of the visualization with two members or our research team and they found the tool useful because of its ability to preprocess data consistently and visualize information in a digestible and informative format. Conclusions: Application of our software tool, Alveolus Analysis, to intravital lung microscopy data has the potential to enhance the information gained from these experiments and provide new insights into the pathologic mechanisms of inflammatory lung injury.",
                "authors": [
                    {
                        "name": "Belvitch P."
                    },
                    {
                        "name": "Burks A.T."
                    },
                    {
                        "name": "Dong Y."
                    },
                    {
                        "name": "Dudek S.M."
                    },
                    {
                        "name": "Elisabeta Marai G."
                    },
                    {
                        "name": "Htwe Y.M."
                    },
                    {
                        "name": "Politowicz A.L."
                    }
                ],
                "citationCount": 1,
                "date": "2022-12-01T00:00:00Z",
                "journal": "BMC Pulmonary Medicine",
                "title": "Alveolus analysis: a web browser-based tool to analyze lung intravital microscopy"
            },
            "pmcid": "PMC9759058",
            "pmid": "36528564"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Zoology",
            "uri": "http://edamontology.org/topic_3500"
        }
    ]
}
