
{
    "credit": [
        {
            "name": "Tatsuhiko Tsunoda",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "https://www.nature.com/articles/s41598-018-23978-z/email/correspondent/c2/new"
        },
        {
            "name": "Daichi Shigemizu",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "https://www.nature.com/articles/s41598-018-23978-z/email/correspondent/c1/new"
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "https://github.com/NCGG-MGC/IMSindel"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Indel detection",
                    "uri": "http://edamontology.org/operation_0452"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Ruby"
        ],
        "license": "CC-BY-4.0",
        "operatingSystem": [
            "Linux",
            "Mac"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Sequence assembly",
                "uri": "http://edamontology.org/topic_0196"
            },
            {
                "term": "Mapping",
                "uri": "http://edamontology.org/topic_0102"
            },
            {
                "term": "Sequence analysis",
                "uri": "http://edamontology.org/topic_0080"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© 2018 The Author(s). Insertions and deletions (indels) have been implicated in dozens of human diseases through the radical alteration of gene function by short frameshift indels as well as long indels. However, the accurate detection of these indels from next-generation sequencing data is still challenging. This is particularly true for intermediate-size indels (≥50 bp), due to the short DNA sequencing reads. Here, we developed a new method that predicts intermediate-size indels using BWA soft-clipped fragments (unmatched fragments in partially mapped reads) and unmapped reads. We report the performance comparison of our method, GATK, PINDEL and ScanIndel, using whole exome sequencing data from the same samples. False positive and false negative counts were determined through Sanger sequencing of all predicted indels across these four methods. The harmonic mean of the recall and precision, F-measure, was used to measure the performance of each method. Our method achieved the highest F-measure of 0.84 in one sample, compared to 0.56 for GATK, 0.52 for PINDEL and 0.46 for ScanIndel. Similar results were obtained in additional samples, demonstrating that our method was superior to the other methods for detecting intermediate-size indels. We believe that this methodology will contribute to the discovery of intermediate-size indels associated with human disease.",
            "authors": [
                "Shigemizu D.",
                "Miya F.",
                "Akiyama S.",
                "Okuda S.",
                "Boroevich K.A.",
                "Fujimoto A.",
                "Nakagawa H.",
                "Ozaki K.",
                "Niida S.",
                "Kanemura Y.",
                "Okamoto N.",
                "Saitoh S.",
                "Kato M.",
                "Yamasaki M.",
                "Matsunaga T.",
                "Mutai H.",
                "Kosaki K.",
                "Tsunoda T."
            ],
            "cit_count": 0,
            "doi": "10.1038/s41598-018-23978-z",
            "journal": "Scientific Reports",
            "title": "IMSindel: An accurate intermediate-size indel detection tool incorporating de novo assembly and gapped global-local alignment with split read analysis",
            "year": "2018-12-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:imsindel",
        "biotoolsID": "imsindel",
        "description": "An accurate intermediate-size indel detection tool incorporating de novo assembly and gapped global-local alignment with split read analysis.",
        "homepage": "https://github.com/NCGG-MGC/IMSindel",
        "name": "IMSindel"
    }
}