{
    "additionDate": "2018-07-03T16:01:53Z",
    "biotoolsCURIE": "biotools:profed",
    "biotoolsID": "profed",
    "credit": [
        {
            "email": "jenny.potratz@ukmuenster.de",
            "name": "Jenny Potratz",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Profile filtering of expression data.",
    "documentation": [
        {
            "type": [
                "Other"
            ],
            "url": "http://ebi056.uni-muenster.de:3838/profed/#tab-3022-5"
        },
        {
            "type": [
                "General"
            ],
            "url": "http://ebi056.uni-muenster.de:3838/profed/#tab-3022-1"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                }
            ]
        }
    ],
    "homepage": "http://ebi056.uni-muenster.de:3838/profed/",
    "language": [
        "R",
        "Python"
    ],
    "lastUpdate": "2018-12-10T12:58:59Z",
    "name": "ProFED",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "migle_sur",
    "publication": [
        {
            "doi": "10.1371/journal.pone.0191570",
            "metadata": {
                "abstract": "© 2018 Schaefer et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.In the search for novel therapeutic targets, RNA interference screening has become a valuable tool. High-throughput technologies are now broadly accessible but their assay development from baseline remains resource-intensive and challenging. Focusing on this assay development process, we here describe a target discovery screen using pooled shRNA libraries and next-generation sequencing (NGS) deconvolution in a cell line model of Ewing sarcoma. In a strategy designed for comparative and synthetic lethal studies, we screened for targets specific to the A673 Ewing sarcoma cell line. Methods, results and pitfalls are described for the entire multi-step screening procedure, from lentiviral shRNA delivery to bioinformatics analysis, illustrating a complete model workflow. We demonstrate that successful studies are feasible from the first assay performance and independent of specialized screening units. Furthermore, we show that a resource-saving screen depth of 100-fold average shRNA representation can suffice to generate reproducible target hits despite heterogeneity in the derived datasets. Because statistical analysis methods are debatable for such datasets, we created ProFED, an analysis package designed to facilitate descriptive data analysis and hit calling using an aim-oriented profile filtering approach. In its versatile design, this open-source online tool provides fast and easy analysis of shRNA and other count-based datasets to complement other analytical algorithms.",
                "authors": [
                    {
                        "name": "Schaefer C."
                    },
                    {
                        "name": "Mallela N."
                    },
                    {
                        "name": "Seggewiss J."
                    },
                    {
                        "name": "Lechtape B."
                    },
                    {
                        "name": "Omran H."
                    },
                    {
                        "name": "Dirksen U."
                    },
                    {
                        "name": "Korsching E."
                    },
                    {
                        "name": "Potratz J."
                    }
                ],
                "citationCount": 7,
                "date": "2018-01-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "Target discovery screens using pooled shRNA libraries and next-generation sequencing: A model workflow and analytical algorithm"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "Protein expression",
            "uri": "http://edamontology.org/topic_0108"
        },
        {
            "term": "RNA-seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Drug discovery",
            "uri": "http://edamontology.org/topic_3336"
        }
    ],
    "validated": 1
}