{
    "additionDate": "2017-08-03T18:48:20Z",
    "biotoolsCURIE": "biotools:laj",
    "biotoolsID": "laj",
    "credit": [
        {
            "email": "cathy+bmb@bx.psu.edu",
            "name": "Cathy Riemer",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://bmb.psu.edu/directory/crr2"
        }
    ],
    "description": "Tool for viewing and manipulating the output from pairwise alignment programs such as blastz. It can display interactive dotplot, pip, and text representations of the alignments, a diagram showing the locations of exons and repeats, and annotation links to other web sites containing additional information about particular regions.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://globin.cse.psu.edu/dist/laj/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Pairwise sequence alignment",
                    "uri": "http://edamontology.org/operation_0491"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Data handling",
                    "uri": "http://edamontology.org/operation_2409"
                }
            ]
        }
    ],
    "homepage": "http://globin.cse.psu.edu/dist/laj/",
    "language": [
        "Java"
    ],
    "lastUpdate": "2018-12-10T12:58:55Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/laj-070222-alignment-viewer.html"
        }
    ],
    "name": "Laj",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Chromosome 7q22 has been the focus of many cytogenetic and molecular studies aimed at delineating regions commonly deleted in myeloid leukemias and myelodysplastic syndromes. We have compared a gene-dense, GC-rich sub-region of 7q22 with the orthologous region on mouse chromosome 5. A physical map of 640 kb of genomic DNA from mouse chromosome 5 was derived from a series of overlapping bacterial artificial chromosomes. A 296 kb segment from the physical map, spanning Ache to Tfr2, was compared with 267 kb of human sequence. We identified a conserved linkage of 12 genes including an open reading frame flanked by Ache and Asr2, a novel cation-chloride cotransporter interacting protein Cip1, Ephb4, Zan and Perq1. While some of these genes have been previously described, in each case we present new data derived from our comparative sequence analysis. Adjacent unfinished sequence data from the mouse contains an orthologous block of 10 additional genes including three novel cDNA sequences that we subsequently mapped to human 7q22. Methods for displaying comparative genomic information, including unfinished sequence data, are becoming increasingly important. We supplement our printed comparative analysis with a new, Web-based program called Laj (local alignments with java). Laj provides interactive access to archived pairwise sequence alignments via the WWW. It displays synchronized views of a dot-plot, a percent identity plot, a nucleotide-level local alignment and a variety of relevant annotations. Our mouse-human comparison can be viewed at http://web.uvic.ca/∼bioweb/laj.html. Laj is available at http://bio.cse.psu.edu/, along with online documentation and additional examples of annotated genomic regions.",
                "authors": [
                    {
                        "name": "Wilson M.D."
                    },
                    {
                        "name": "Riemer C."
                    },
                    {
                        "name": "Martindale D.W."
                    },
                    {
                        "name": "Schnupf P."
                    },
                    {
                        "name": "Boright A.P."
                    },
                    {
                        "name": "Cheung T.L."
                    },
                    {
                        "name": "Hardy D.M."
                    },
                    {
                        "name": "Schwartz S."
                    },
                    {
                        "name": "Scherer S.W."
                    },
                    {
                        "name": "Tsui L.-C."
                    },
                    {
                        "name": "Miller W."
                    },
                    {
                        "name": "Koop B.F."
                    }
                ],
                "citationCount": 42,
                "date": "2001-03-15T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "Comparative analysis of the gene-dense ACHE/TFR2 region on human chromosome 7q22 with the orthologous region on mouse chromosome 5"
            },
            "pmid": "11239002"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Nucleic acids",
            "uri": "http://edamontology.org/topic_0077"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        }
    ],
    "validated": 1
}