{
    "accessibility": "Open access (with restrictions)",
    "additionDate": "2021-01-18T12:30:13Z",
    "biotoolsCURIE": "biotools:ibmd",
    "biotoolsID": "ibmd",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "smj@plen.ku.dk",
            "name": "Signe M. Jensen",
            "typeEntity": "Person"
        }
    ],
    "description": "An R package for benchmark dose estimation.\n\nThe benchmark dose (BMD) methodology is used to derive a hazard characterization measure for risk assessment in toxicology or ecotoxicology. The present paper's objective is to introduce the R extension package bmd, which facilitates the estimation of BMD and the benchmark dose lower limit for a wide range of dose-response models via the popular package drc. It allows using the most current statistical methods for BMD estimation, including model averaging. The package bmd can be used for BMD estimation for binomial, continuous, and count data in a simple set up or from complex hierarchical designs and is introduced using four examples. While there are other stand-alone software solutions available to estimate BMDs, the package bmd facilitates easy estimation within the established and flexible statistical environment R.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://shiny-efsa.openanalytics.eu/app/bmd",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-03-18T09:26:42Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/DoseResponse/bmd"
        }
    ],
    "name": "ibmd",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.7717/PEERJ.10557",
            "metadata": {
                "abstract": "© 2020 PeerJ Inc.. All rights reserved.The benchmark dose (BMD) methodology is used to derive a hazard characterization measure for risk assessment in toxicology or ecotoxicology. The present paper's objective is to introduce the R extension package bmd, which facilitates the estimation of BMD and the benchmark dose lower limit for a wide range of dose-response models via the popular package drc. It allows using the most current statistical methods for BMD estimation, including model averaging. The package bmd can be used for BMD estimation for binomial, continuous, and count data in a simple set up or from complex hierarchical designs and is introduced using four examples. While there are other stand-alone software solutions available to estimate BMDs, the package bmd facilitates easy estimation within the established and flexible statistical environment R. It allows the rapid implementation of available, novel, and future statistical methods and the integration of other statistical analyses.",
                "authors": [
                    {
                        "name": "Cedergreen N."
                    },
                    {
                        "name": "Jensen S.M."
                    },
                    {
                        "name": "Kluxen F.M."
                    },
                    {
                        "name": "Ritz C."
                    },
                    {
                        "name": "Streibig J.C."
                    }
                ],
                "citationCount": 2,
                "date": "2020-12-17T00:00:00Z",
                "journal": "PeerJ",
                "title": "bmd: An R package for benchmark dose estimation"
            },
            "pmcid": "PMC7750002",
            "pmid": "33362981"
        }
    ],
    "toolType": [
        "Command-line tool",
        "Web application"
    ],
    "topic": [
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        },
        {
            "term": "Toxicology",
            "uri": "http://edamontology.org/topic_2840"
        }
    ]
}
