{
    "accessibility": "Open access",
    "additionDate": "2022-06-13T09:49:24.034713Z",
    "biotoolsCURIE": "biotools:dsgat",
    "biotoolsID": "dsgat",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "juanzi_1982_49@126.com",
            "name": "Lin Wang",
            "typeEntity": "Person"
        },
        {
            "email": "linwang@tust.edu.cn",
            "name": "Wenjuan Zhang",
            "typeEntity": "Person"
        }
    ],
    "description": "A tool for predicting frequencies of drug side effects by graph attention networks.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                },
                {
                    "term": "Scatter plot plotting",
                    "uri": "http://edamontology.org/operation_2940"
                }
            ]
        }
    ],
    "homepage": "https://github.com/xxy45/DSGAT",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-06-13T09:49:24.038395Z",
    "license": "Not licensed",
    "name": "DSGAT",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1093/BIB/BBAB586",
            "metadata": {
                "abstract": "© 2022 The Author(s) 2022. Published by Oxford University Press. All rights reserved. For Permissions, please email: journals.permissions@oup.com.A critical issue of drug risk-benefit evaluation is to determine the frequencies of drug side effects. Randomized controlled trail is the conventional method for obtaining the frequencies of side effects, while it is laborious and slow. Therefore, it is necessary to guide the trail by computational methods. Existing methods for predicting the frequencies of drug side effects focus on modeling drug-side effect interaction graph. The inherent disadvantage of these approaches is that their performance is closely linked to the density of interactions but which is highly sparse. More importantly, for a cold start drug that does not appear in the training data, such methods cannot learn the preference embedding of the drug because there is no link to the drug in the interaction graph. In this work, we propose a new method for predicting the frequencies of drug side effects, DSGAT, by using the drug molecular graph instead of the commonly used interaction graph. This leads to the ability to learn embeddings for cold start drugs with graph attention networks. The proposed novel loss function, i.e. weighted $\\varepsilon$-insensitive loss function, could alleviate the sparsity problem. Experimental results on one benchmark dataset demonstrate that DSGAT yields significant improvement for cold start drugs and outperforms the state-of-the-art performance in the warm start scenario. Source code and datasets are available at https://github.com/xxy45/DSGAT.",
                "authors": [
                    {
                        "name": "Li B."
                    },
                    {
                        "name": "Liu Y."
                    },
                    {
                        "name": "Wang L."
                    },
                    {
                        "name": "Wang Y."
                    },
                    {
                        "name": "Xu X."
                    },
                    {
                        "name": "Yue L."
                    },
                    {
                        "name": "Zhang W."
                    }
                ],
                "date": "2022-03-01T00:00:00Z",
                "journal": "Briefings in Bioinformatics",
                "title": "DSGAT: Predicting frequencies of drug side effects by graph attention networks"
            },
            "pmid": "35043189"
        }
    ],
    "toolType": [
        "Workbench"
    ],
    "topic": [
        {
            "term": "Drug discovery",
            "uri": "http://edamontology.org/topic_3336"
        },
        {
            "term": "Drug metabolism",
            "uri": "http://edamontology.org/topic_3375"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ],
    "validated": 1
}
