{
    "additionDate": "2020-01-09T18:11:48Z",
    "biotoolsCURIE": "biotools:DeepSymNet",
    "biotoolsID": "DeepSymNet",
    "confidence_flag": "medium",
    "credit": [
        {
            "email": "luca.giancardo@uth.tmc.edu",
            "name": "Luca Giancardo",
            "typeEntity": "Person"
        }
    ],
    "description": "Quantifying Neurodegenerative Progression With DeepSymNet.\n\nA data-driven method based that identifies longitudinal changes in 3D structural MRI data without relying on prior brain regions of interest, an atlas, or non-linear registration pipelines.\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'Quantifying Neurodegenerative Progression DeepSymNet', 'ADNI'",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "https://gitlab.com/lgianca/longitudinal-deepsymnet",
    "lastUpdate": "2020-01-09T18:11:48Z",
    "name": "DeepSymNet",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.3389/FNINS.2019.01053",
            "metadata": {
                "abstract": "© Copyright © 2019 Pena, Barman, Suescun, Jiang, Schiess, Giancardo and the Alzheimer's Disease Neuroimaging Initiative.Alzheimer's disease (AD) is the most common neurodegenerative disorder worldwide and is one of the leading sources of morbidity and mortality in the aging population. There is a long preclinical period followed by mild cognitive impairment (MCI). Clinical diagnosis and the rate of decline is variable. Progression monitoring remains a challenge in AD, and it is imperative to create better tools to quantify this progression. Brain magnetic resonance imaging (MRI) is commonly used for patient assessment. However, current approaches for analysis require strong a priori assumptions about regions of interest used and complex preprocessing pipelines including computationally expensive non-linear registrations and iterative surface deformations. These preprocessing steps are composed of many stacked processing layers. Any error or bias in an upstream layer will be propagated throughout the pipeline. Failures or biases in the non-linear subject registration and the subjective choice of atlases of specific regions are common in medical neuroimaging analysis and may hinder the translation of many approaches to the clinical practice. Here we propose a data-driven method based on an extension of a deep learning architecture, DeepSymNet, that identifies longitudinal changes without relying on prior brain regions of interest, an atlas, or non-linear registration steps. Our approach is trained end-to-end and learns how a patient's brain structure dynamically changes between two-time points directly from the raw voxels. We compare our approach with Freesurfer longitudinal pipelines and voxel-based methods using the Alzheimer's Disease Neuroimaging Initiative (ADNI) database. Our model can identify AD progression with comparable results to existing Freesurfer longitudinal pipelines without the need of predefined regions of interest, non-rigid registration algorithms, or iterative surface deformation at a fraction of the processing time. When compared to other voxel-based methods which share some of the same benefits, our model showed a statistically significant performance improvement. Additionally, we show that our model can differentiate between healthy subjects and patients with MCI. The model's decision was investigated using the epsilon layer-wise propagation algorithm. We found that the predictions were driven by the pallidum, putamen, and the superior temporal gyrus. Our novel longitudinal based, deep learning approach has the potential to diagnose patients earlier and enable new computational tools to monitor neurodegeneration in clinical practice.",
                "authors": [
                    {
                        "name": "Pena D."
                    },
                    {
                        "name": "Barman A."
                    },
                    {
                        "name": "Suescun J."
                    },
                    {
                        "name": "Jiang X."
                    },
                    {
                        "name": "Schiess M.C."
                    },
                    {
                        "name": "Giancardo L."
                    }
                ],
                "citationCount": 1,
                "date": "2019-10-04T00:00:00Z",
                "journal": "Frontiers in Neuroscience",
                "title": "Quantifying Neurodegenerative Progression With DeepSymNet, an End-to-End Data-Driven Approach"
            },
            "pmcid": "PMC6788344",
            "pmid": "31636533"
        }
    ],
    "topic": [
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        },
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        },
        {
            "term": "Personalised medicine",
            "uri": "http://edamontology.org/topic_3577"
        }
    ]
}