{
    "additionDate": "2020-01-09T17:42:28Z",
    "biotoolsCURIE": "biotools:PIRATE",
    "biotoolsID": "PIRATE",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "s.bayliss@bath.ac.uk",
            "name": "Sion C Bayliss",
            "orcidid": "https://orcid.org/0000-0002-5997-2002",
            "typeEntity": "Person"
        }
    ],
    "description": "PIRATE is a fast and scalable pangenomics toolbox for clustering diverged orthologues in bacteria.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                },
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "Splitting",
                    "uri": "http://edamontology.org/operation_3359"
                }
            ]
        }
    ],
    "homepage": "https://github.com/SionBayliss/PIRATE",
    "language": [
        "Perl"
    ],
    "lastUpdate": "2021-01-10T13:45:29Z",
    "license": "GPL-3.0",
    "name": "PIRATE",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/GIGASCIENCE/GIZ119",
            "metadata": {
                "abstract": "© 2019 The Author(s) 2019. Published by Oxford University Press.Cataloguing the distribution of genes within natural bacterial populations is essential for understanding evolutionary processes and the genetic basis of adaptation. Advances in whole genome sequencing technologies have led to a vast expansion in the amount of bacterial genomes deposited in public databases. There is a pressing need for software solutions which are able to cluster, catalogue and characterise genes, or other features, in increasingly large genomic datasets. Results: Here we present a pangenomics toolbox, PIRATE (Pangenome Iterative Refinement and Threshold Evaluation), which identifies and classifies orthologous gene families in bacterial pangenomes over a wide range of sequence similarity thresholds. PIRATE builds upon recent scalable software developments to allow for the rapid interrogation of thousands of isolates. PIRATE clusters genes (or other annotated features) over a wide range of amino acid or nucleotide identity thresholds and uses the clustering information to rapidly identify paralogous gene families and putative fission/fusion events. Furthermore, PIRATE orders the pangenome using a directed graph, provides a measure of allelic variation, and estimates sequence divergence for each gene family. Conclusions: We demonstrate that PIRATE scales linearly with both number of samples and computation resources, allowing for analysis of large genomic datasets, and compares favorably to other popular tools. PIRATE provides a robust framework for analysing bacterial pangenomes, from largely clonal to panmictic species.",
                "authors": [
                    {
                        "name": "Bayliss S.C."
                    },
                    {
                        "name": "Thorpe H.A."
                    },
                    {
                        "name": "Coyle N.M."
                    },
                    {
                        "name": "Sheppard S.K."
                    },
                    {
                        "name": "Feil E.J."
                    }
                ],
                "citationCount": 18,
                "date": "2019-10-01T00:00:00Z",
                "journal": "GigaScience",
                "title": "PIRATE: A fast and scalable pangenomics toolbox for clustering diverged orthologues in bacteria"
            },
            "pmcid": "PMC6785682",
            "pmid": "31598686"
        }
    ],
    "topic": [
        {
            "term": "Gene and protein families",
            "uri": "http://edamontology.org/topic_0623"
        },
        {
            "term": "Gene structure",
            "uri": "http://edamontology.org/topic_0114"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ],
    "validated": 1
}