{
    "additionDate": "2024-07-18T11:37:44.121753Z",
    "biotoolsCURIE": "biotools:rbprokcnn",
    "biotoolsID": "rbprokcnn",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "prabina.meher@icar.gov.in",
            "name": "Prabina Kumar Meher",
            "typeEntity": "Person"
        }
    ],
    "description": "Deep learning on appropriate contextual evolutionary information for RNA binding protein discovery in prokaryotes.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "RNA binding site prediction",
                    "uri": "http://edamontology.org/operation_3902"
                },
                {
                    "term": "RNA-binding protein prediction",
                    "uri": "http://edamontology.org/operation_3901"
                }
            ]
        }
    ],
    "homepage": "https://iasri-sg.icar.gov.in/rbprokcnn/",
    "lastUpdate": "2024-07-18T11:37:44.124023Z",
    "name": "RBProkCNN",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1016/j.csbj.2024.04.034",
            "metadata": {
                "abstract": "RNA-binding proteins (RBPs) are central to key functions such as post-transcriptional regulation, mRNA stability, and adaptation to varied environmental conditions in prokaryotes. While the majority of research has concentrated on eukaryotic RBPs, recent developments underscore the crucial involvement of prokaryotic RBPs. Although computational methods have emerged in recent years to identify RBPs, they have fallen short in accurately identifying prokaryotic RBPs due to their generic nature. To bridge this gap, we introduce RBProkCNN, a novel machine learning-driven computational model meticulously designed for the accurate prediction of prokaryotic RBPs. The prediction process involves the utilization of eight shallow learning algorithms and four deep learning models, incorporating PSSM-based evolutionary features. By leveraging a convolutional neural network (CNN) and evolutionarily significant features selected through extreme gradient boosting variable importance measure, RBProkCNN achieved the highest accuracy in five-fold cross-validation, yielding 98.04% auROC and 98.19% auPRC. Furthermore, RBProkCNN demonstrated robust performance with an independent dataset, showcasing a commendable 95.77% auROC and 95.78% auPRC. Noteworthy is its superior predictive accuracy when compared to several state-of-the-art existing models. RBProkCNN is available as an online prediction tool (https://iasri-sg.icar.gov.in/rbprokcnn/), offering free access to interested users. This tool represents a substantial contribution, enriching the array of resources available for the accurate and efficient prediction of prokaryotic RBPs.",
                "authors": [
                    {
                        "name": "Das R."
                    },
                    {
                        "name": "Gupta A."
                    },
                    {
                        "name": "Meher P.K."
                    },
                    {
                        "name": "Naha S."
                    },
                    {
                        "name": "Parsad R."
                    },
                    {
                        "name": "Pradhan U.K."
                    }
                ],
                "citationCount": 2,
                "date": "2024-12-01T00:00:00Z",
                "journal": "Computational and Structural Biotechnology Journal",
                "title": "RBProkCNN: Deep learning on appropriate contextual evolutionary information for RNA binding protein discovery in prokaryotes"
            },
            "pmcid": "PMC11039349",
            "pmid": "38660008"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        }
    ]
}
