{
    "additionDate": "2018-08-24T13:43:27Z",
    "biotoolsCURIE": "biotools:ambit-smirks",
    "biotoolsID": "ambit-smirks",
    "credit": [
        {
            "name": "Support",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://ambit.sourceforge.net/support.html"
        }
    ],
    "description": "Software module for reaction representation, reaction search and structure transformation.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://ambit.sourceforge.net/install_ambitrest.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Pathway or network analysis",
                    "uri": "http://edamontology.org/operation_2497"
                }
            ]
        }
    ],
    "homepage": "http://ambit.sourceforge.net/smirks/",
    "language": [
        "Java"
    ],
    "lastUpdate": "2018-12-10T12:59:01Z",
    "license": "Apache-2.0",
    "name": "Ambit-SMIRKS",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1186/s13321-018-0295-6",
            "metadata": {
                "abstract": "© 2018, The Author(s). Ambit-SMIRKS is an open source software, enabling structure transformation via the SMIRKS language and implemented as an extension of Ambit-SMARTS. As part of the Ambit project it builds on top of The Chemistry Development Kit (The CDK). Ambit-SMIRKS provides the following functionalities: parsing of SMIRKS linear notations into internal reaction (transformation) representations based on The CDK objects, application of the stored reactions against target (reactant) molecules for actual transformation of the target chemical objects, reaction searching, stereo information handling, product post-processing, etc. The transformations can be applied on various sites of the reactant molecule in several modes: single, non-overlapping, non-identical, non-homomorphic or externally specified list of sites utilizing efficient substructure searching algorithm. Ambit-SMIRKS handles the molecules stereo information and supports basic chemical stereo elements implemented in The CDK library. The full SMARTS logical expressions syntax for reactions specification is supported, including recursive SMARTS expressions as well as additional syntax extensions. Since its initial development for the purpose of metabolite generation within Toxtree, the Ambit-SMIRKS module was used in various chemoinformatics projects, both developed by the authors of the package and by external teams. We show several use cases of the Ambit-SMIRKS software including standardization of large chemical databases and pathway transformation database and prediction. Ambit-SMIRKS is distributed as a Java library under LGPL license. More information on use cases and applications, including download links is available at http://ambit.sourceforge.net/smirks.",
                "authors": [
                    {
                        "name": "Kochev N."
                    },
                    {
                        "name": "Avramova S."
                    },
                    {
                        "name": "Jeliazkova N."
                    }
                ],
                "date": "2018-12-01T00:00:00Z",
                "journal": "Journal of Cheminformatics",
                "title": "Ambit-SMIRKS: a software module for reaction representation, reaction search and structure transformation"
            }
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Cheminformatics",
            "uri": "http://edamontology.org/topic_2258"
        },
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        },
        {
            "term": "Protein structure analysis",
            "uri": "http://edamontology.org/topic_2814"
        },
        {
            "term": "Enzymes",
            "uri": "http://edamontology.org/topic_0821"
        }
    ],
    "validated": 1
}