{
    "additionDate": "2017-08-03T18:53:43Z",
    "biotoolsCURIE": "biotools:pcadapt",
    "biotoolsID": "pcadapt",
    "credit": [
        {
            "email": "michael.blum@univ-grenoble-alpes.fr",
            "name": "Michael Blum",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://membres-timc.imag.fr/Nicolas.Duforet-Frebourg/"
        }
    ],
    "description": "Software to detect footprints of local adaptation in population genetics data set.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://membres-timc.imag.fr/Michael.Blum/PCAdapt.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence analysis",
                    "uri": "http://edamontology.org/operation_2403"
                }
            ]
        }
    ],
    "homepage": "http://membres-timc.imag.fr/Nicolas.Duforet-Frebourg/PCAdapt.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-10T12:58:51Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/pcadapt-201306-detect-genes-targetted-selection.html"
        }
    ],
    "name": "PCAdapt",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "There is a considerable impetus in population genomics to pinpoint loci involved in local adaptation. A powerful approach to find genomic regions subject to local adaptation is to genotype numerous molecular markers and look for outlier loci. One of the most common approaches for selection scans is based on statistics that measure population differentiation such as FST. However, there are important caveats with approaches related to FST because they require grouping individuals into populations and they additionally assume a particular model of population structure. Here, we implement a more flexible individual-based approach based on Bayesian factor models. Factor models capture population structure with latent variables called factors, which can describe clustering of individuals into populations or isolation-by-distance patterns. Using hierarchical Bayesian modeling, we both infer population structure and identify outlier loci that are candidates for local adaptation. In order to identify outlier loci, the hierarchical factormodel searches for loci that are atypically related to population structure as measured by the latent factors. In a model of population divergence, we show that it can achieve a 2-fold or more reduction of false discovery rate compared with the software BayeScan or with an FST approach. We show that our software can handle large data sets by analyzing the single nucleotide polymorphisms of the Human Genome Diversity Project. The Bayesian factor model is implemented in the open-source PCAdapt software. © The Author 2014.",
                "authors": [
                    {
                        "name": "Duforet-Frebourg N."
                    },
                    {
                        "name": "Bazin E."
                    },
                    {
                        "name": "Blum M.G.B."
                    }
                ],
                "citationCount": 66,
                "date": "2014-01-01T00:00:00Z",
                "journal": "Molecular Biology and Evolution",
                "title": "Genome scans for detecting footprints of local adaptation using a Bayesian factor model"
            },
            "pmid": "24899666"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Population genetics",
            "uri": "http://edamontology.org/topic_3056"
        },
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Evolutionary biology",
            "uri": "http://edamontology.org/topic_3299"
        }
    ],
    "validated": 1
}