{
    "additionDate": "2015-03-05T12:53:39Z",
    "biotoolsCURIE": "biotools:consurf-db",
    "biotoolsID": "consurf-db",
    "collectionID": [
        "Instruct"
    ],
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Instruct",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        },
        {
            "email": "ccisb@stfc.ac.uk",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "A tool provides evolutionary conservation profiles for proteins of known structure in the PDB.",
    "documentation": [
        {
            "type": "General",
            "url": "http://bental.tau.ac.il/new_ConSurfDB/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "note": "ConSurf-DB provides evolutionary conservation profiles for proteins of known structure in the PDB. Amino acid sequences similar to each sequence in the PDB were collected and multiply aligned using CSI-BLAST and MAFFT, respectively. The evolutionary conservation of each amino acid position in the alignment was calculated using the Rate4Site algorithm, implemented in the ConSurf web-server. The algorithm takes explicitly into account the phylogenetic relations between the aligned proteins and the stochastic nature of the evolutionary process. Rate4Site assigns a conservation level for each residue using an empirical Bayesian inference. Visual inspection of the conservation patterns on the 3-dimensional structure often enables the identification of key residues that comprise the functionally-important regions of the protein. ConSurf-DB differs from ConSurf in that ConSurf-DB provides pre-calculated conservation profiles, while ConSurf enables considerable flexibility in setting the para",
            "operation": [
                {
                    "term": "Protein sequence analysis",
                    "uri": "http://edamontology.org/operation_2479"
                }
            ]
        }
    ],
    "homepage": "http://bental.tau.ac.il/new_ConSurfDB/",
    "lastUpdate": "2018-12-10T12:58:50Z",
    "name": "ConSurf-DB",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "Instruct",
    "publication": [
        {
            "doi": "10.1002/ijch.201200096",
            "metadata": {
                "abstract": "Many mutations disappear from the population because they impair protein function and/or stability. Thus, amino acid positions that are essential for proper function evolve more slowly than others, or in other words, the slow evolutionary rate of a position reflects its importance. ConSurf (http://consurf.tau.ac.il), reviewed in this manuscript, exploits this to reveal key amino acid positions that are important for maintaining the native conformation(s) of the protein and its function, be it binding, catalysis, transport, etc. Given the sequence or 3D structure of the query protein as input, a search for similar sequences is conducted and the sequences are aligned. The multiple sequence alignment is subsequently used to calculate the evolutionary rates of each amino acid site, using Bayesian or maximum-likelihood algorithms. Both algorithms take into account the evolutionary relationships between the sequences, reflected in phylogenetic trees, to alleviate problems due to uneven (biased) sampling in sequence space. This is particularly important when the number of sequences is low. The ConSurf-DB, a new release of which is presented here, provides precalculated ConSurf conservation analysis of nearly all available structures in the Protein DataBank (PDB). The usefulness of ConSurf for the study of individual proteins and mutations, as well as a range of large-scale, genome-wide applications, is reviewed. Copyright © 2013 WILEY-VCH Verlag GmbH & Co. KGaA, Weinheim.",
                "authors": [
                    {
                        "name": "Celniker G."
                    },
                    {
                        "name": "Nimrod G."
                    },
                    {
                        "name": "Ashkenazy H."
                    },
                    {
                        "name": "Glaser F."
                    },
                    {
                        "name": "Martz E."
                    },
                    {
                        "name": "Mayrose I."
                    },
                    {
                        "name": "Pupko T."
                    },
                    {
                        "name": "Ben-Tal N."
                    }
                ],
                "citationCount": 175,
                "date": "2013-04-01T00:00:00Z",
                "journal": "Israel Journal of Chemistry",
                "title": "ConSurf: Using evolutionary data to raise testable hypotheses about protein function"
            },
            "type": "Primary"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Structural biology",
            "uri": "http://edamontology.org/topic_1317"
        },
        {
            "term": "Molecular modelling",
            "uri": "http://edamontology.org/topic_2275"
        }
    ],
    "validated": 1
}