
{
    "credit": [
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Information extraction",
                    "uri": "http://edamontology.org/operation_3907"
                }
            ]
        }
    ],
    "labels": {
        "topic": [
            {
                "term": "Medicine",
                "uri": "http://edamontology.org/topic_3303"
            },
            {
                "term": "Literature and language",
                "uri": "http://edamontology.org/topic_3068"
            },
            {
                "term": "Database management",
                "uri": "http://edamontology.org/topic_3489"
            },
            {
                "term": "Biology",
                "uri": "http://edamontology.org/topic_3070"
            }
        ]
    },
    "publication": [
        {
            "abstract": "Literature databases (i.e., PubMed, Scopus, and Web of Science) differ in terms of their coverage, focus, and the tool they provide. PubMed focuses mainly on life sciences and biomedical disciplines, whereas Scopus and Web of Science are multidisciplinary. The protocol described in the current study was used to search for publications from Jordanian authors in the years 2013-2017. In this protocol, how to use each database to conduct this type of search is explained in detail. A Scopus search resulted in the highest number of documents (11,444 documents), followed by a Web of Science search (10,943 documents). PubMed resulted in a smaller number of documents due to its narrower scope and coverage (4,363 documents). The results also show a yearly trend in: (1) the number of publications, (2) the disciplines that have the most publications, (3) the countries of collaboration, and (4) the number of open access publications. In contrast, PubMed has a sophisticated keyword optimization service (i.e., Medical Subject Heading, or MeSH), while both Scopus and Web of Science provide search analysis tools that can produce representative figures. Finally, the features of each database are explained in detail and several indices that can be extracted using the search results are provided. This study provides a base for using literature databases for bibliometric analysis.",
            "authors": [
                "AlRyalat S.A.S.",
                "Malkawi L.W.",
                "Momani S.M."
            ],
            "cit_count": 2,
            "doi": "10.3791/58494",
            "journal": "Journal of visualized experiments : JoVE",
            "pmid": "31710021",
            "title": "Comparing Bibliometric Analysis Using PubMed, Scopus, and Web of Science Databases",
            "year": "2019-10-24"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:Scopus",
        "biotoolsID": "Scopus",
        "description": "Comparing Bibliometric Analysis Using PubMed, Scopus, and Web of Science Databases.\n\nElsevier’s Scopus, the largest abstract and citation database of peer-reviewed literature. Search and access research from the science, technology, medicine, social sciences and arts and humanities fields",
        "homepage": "http://www.scopus.com",
        "name": "Scopus"
    }
}