{
    "accessibility": "Open access",
    "additionDate": "2019-08-03T14:26:50Z",
    "biotoolsCURIE": "biotools:ODAE",
    "biotoolsID": "ODAE",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "yongqunh@med.umich.edu",
            "name": "Oliver He",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Ontology-based systematic representation and analysis of drug adverse events and its usage in study of adverse events given different patient age and disease conditions.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/ODAE-ontology/ODAE/blob/master/README.md"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                },
                {
                    "term": "Named-entity and concept recognition",
                    "uri": "http://edamontology.org/operation_3280"
                },
                {
                    "term": "Ontology visualisation",
                    "uri": "http://edamontology.org/operation_3559"
                }
            ]
        }
    ],
    "homepage": "https://github.com/ODAE-ontology/ODAE",
    "lastUpdate": "2020-06-16T10:55:24Z",
    "license": "Unlicense",
    "link": [
        {
            "note": "BioPortal depository",
            "type": [
                "Other"
            ],
            "url": "http://bioportal.bioontology.org/ontologies/ODAE"
        },
        {
            "note": "Ontobee depository",
            "type": [
                "Other"
            ],
            "url": "http://www.ontobee.org/ontology/ODAE"
        },
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/ODAE-ontology/ODAE/issues"
        }
    ],
    "maturity": "Emerging",
    "name": "ODAE",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Ruta",
    "publication": [
        {
            "doi": "10.1186/s12859-019-2729-1",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Drug adverse events (AEs), or called adverse drug events (ADEs), are ranked one of the leading causes of mortality. The Ontology of Adverse Events (OAE) has been widely used for adverse event AE representation, standardization, and analysis. OAE-based ADE-specific ontologies, including ODNAE for drug-associated neuropathy-inducing AEs and OCVDAE for cardiovascular drug AEs, have also been developed and used. However, these ADE-specific ontologies do not consider the effects of other factors (e.g., age and drug-treated disease) on the outcomes of ADEs. With more ontological studies of ADEs, it is also critical to develop a general purpose ontology for representing ADEs for various types of drugs. Results: Our survey of FDA drug package insert documents and other resources for 224 neuropathy-inducing drugs discovered that many drugs (e.g., sirolimus and linezolid) cause different AEs given patients' age or the diseases treated by the drugs. To logically represent the complex relations among drug, drug ingredient and mechanism of action, AE, age, disease, and other related factors, an ontology design pattern was developed and applied to generate a community-driven open-source Ontology of Drug Adverse Events (ODAE). The ODAE development follows the OBO Foundry ontology development principles (e.g., openness and collaboration). Built on a generalizable ODAE design pattern and extending the OAE and NDF-RT ontology, ODAE has represented various AEs associated with the over 200 neuropathy-inducing drugs given different age and disease conditions. ODAE is now deposited in the Ontobee for browsing and queries. As a demonstration of usage, a SPARQL query of the ODAE knowledge base was developed to identify all the drugs having the mechanisms of ion channel interactions, the diseases treated with the drugs, and AEs after the treatment in adult patients. AE-specific drug class effects were also explored using ODAE and SPARQL. Conclusion: ODAE provides a general representation of ADEs given different conditions and can be used for querying scientific questions. ODAE is also a robust knowledge base and platform for semantic and logic representation and study of ADEs of more drugs in the future.",
                "authors": [
                    {
                        "name": "Garg N."
                    },
                    {
                        "name": "He Y."
                    },
                    {
                        "name": "Nysak S."
                    },
                    {
                        "name": "Ong E."
                    },
                    {
                        "name": "Ye X."
                    },
                    {
                        "name": "Yu H."
                    },
                    {
                        "name": "Zhang X."
                    }
                ],
                "citationCount": 1,
                "date": "2019-05-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "ODAE: Ontology-based systematic representation and analysis of drug adverse events and its usage in study of adverse events given different patient age and disease conditions"
            },
            "pmcid": "PMC6509876",
            "pmid": "31074377",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Ontology"
    ],
    "topic": [
        {
            "term": "Geriatric medicine",
            "uri": "http://edamontology.org/topic_3399"
        },
        {
            "term": "Medicinal chemistry",
            "uri": "http://edamontology.org/topic_0209"
        },
        {
            "term": "Ontology and terminology",
            "uri": "http://edamontology.org/topic_0089"
        }
    ],
    "validated": 1
}
