{"credit":[],"function":[{"operation":[{"term":"Transcription factor binding site prediction","uri":"http://edamontology.org/operation_0445"},{"term":"Transcriptional regulatory element prediction","uri":"http://edamontology.org/operation_0438"},{"term":"Regulatory element prediction","uri":"http://edamontology.org/operation_0438"},{"term":"Promoter prediction","uri":"http://edamontology.org/operation_0440"}]}],"labels":{"toolType":["Web application"],"topic":[{"term":"Transcription factors and regulatory sites","uri":"http://edamontology.org/topic_0749"},{"term":"Gene expression","uri":"http://edamontology.org/topic_0203"},{"term":"Gene regulation","uri":"http://edamontology.org/topic_0204"},{"term":"Workflows","uri":"http://edamontology.org/topic_0769"},{"term":"Gene transcripts","uri":"http://edamontology.org/topic_3512"}]},"publication":[{"abstract":"Given the recent explosion of publications that employ microarray technology to monitor genomewide expression and that correlate these expression changes to biological processes or to disease states, the determination of the transcriptional regulation of these co-expressed genes is the next major step toward deciphering the genetic network governing the pathway or disease under study. Although computational approaches have been proposed for this purpose, there is no integrated and user-friendly software application that allows experimental biologists to tackle this problem in higher eukaryotes. We have previously reported a systematic, statistical model of mammalian transcriptional regulatory sequence analysis. We have now made crucial extensions to this model and have developed a comprehensive, user-friendly web application suite termed the Promoter Analysis Pipeline (PAP). PAP is available at: http:// bioinformatics.wustl.edu/webTools/portalModule/PromoterSearch.do. © 2007 The Author(s).","authors":["Chang L.-W.","Fontaine B.R.","Stormo G.D.","Nagarajan R."],"cit_count":22,"journal":"Nucleic Acids Research","pmid":"17517777","title":"PAP: A comprehensive workbench for mammalian transcriptional regulatory sequence analysis","year":"2007-07-01"},{"abstract":"An important aspect of understanding a biological pathway is to delineate the transcriptional regulatory mechanisms of the genes involved. Two important tasks are often encountered when studying transcription regulation, i.e., (1) the identification of common transcriptional regulators of a set of coexpressed genes; (2) the identification of genes that are regulated by one or several transcription factors. In this study, a systematic and statistical approach was taken to accomplish these tasks by establishing an integrated model considering all of the promoters and characterized transcription factors (TFs) in the genome. A promoter analysis pipeline (PAP) was developed to implement this approach. PAP was tested using coregulated gene clusters collected from the literature. In most test cases, PAP identified the transcription regulators of the input genes accurately. When compared with chromatin immunoprecipitation experiment data, PAP's predictions are consistent with the experimental observations. When PAP was used to analyze one published expression-profiling data set and two novel coregulated gene sets, PAP was able to generate biologically meaningful hypotheses. Therefore, by taking a systematic approach of considering all promoters and characterized TFs in our model, we were able to make more reliable predictions about the regulation of gene expression in mammalian organisms. ©2006 by Cold Spring Harbor Laboratory Press.","authors":["Chang L.-W.","Nagarajan R.","Magee J.A.","Milbrandt J.","Stormo G.D."],"cit_count":58,"journal":"Genome Research","pmid":"16449500","title":"A systematic model to predict transcriptional regulatory mechanisms based on overrepresentation of transcription factor binding profiles","year":"2006-03-01"}],"summary":{"biotoolsCURIE":"biotools:pap","biotoolsID":"pap","description":"Identify potential transcriptional regulators for sets of co-expressed genes and identify potential regulatory targets of transcription factors.","homepage":"http://bioinformatics.wustl.edu/webTools/portalModule/PromoterSearch.do","name":"PAP"}}