{
    "accessibility": "Open access",
    "additionDate": "2020-01-14T19:47:37Z",
    "biotoolsCURIE": "biotools:impute.me",
    "biotoolsID": "impute.me",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "description": "An open source, non-profit tool for using data from DTC genetic testing to calculate and interpret polygenic risk scores.\n\nThis is the code behind the www.impute.me site. It contains algorithms for imputing personal genomes, as well as a range of custom-made analysis for genetics-based disease and health.\n\nNon-profit web-based engine that will analyze common direct-to-consumer genetic data such as 23andme and ancestry-com. Provides cutting edge- trait and disease genetic scores, based on advanced polygenic risk scoring.\n\nAdvanced analysis of your DNA: Beyond one SNP at the time",
    "editPermission": {
        "type": "private"
    },
    "elixirNode": [
        "Denmark"
    ],
    "function": [
        {
            "cmd": "docker exec -it <dockerid> R -e \"prepare_individual_genome('/home/ubuntu/data/yourgenomefile.zip')\"",
            "input": [
                {
                    "data": {
                        "term": "Raw microarray data",
                        "uri": "http://edamontology.org/data_3110"
                    },
                    "format": [
                        {
                            "term": "plain text format (unformatted)",
                            "uri": "http://edamontology.org/format_1964"
                        },
                        {
                            "term": "VCF",
                            "uri": "http://edamontology.org/format_3016"
                        }
                    ]
                }
            ],
            "note": "Run polygenic risk scoring algorithm on personal genetics data",
            "operation": [
                {
                    "term": "Imputation",
                    "uri": "http://edamontology.org/operation_3557"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Genetic variation analysis",
                    "uri": "http://edamontology.org/operation_3197"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Z-value",
                        "uri": "http://edamontology.org/data_1668"
                    },
                    "format": [
                        {
                            "term": "JSON",
                            "uri": "http://edamontology.org/format_3464"
                        },
                        {
                            "term": "GEN",
                            "uri": "http://edamontology.org/format_3812"
                        }
                    ]
                }
            ]
        }
    ],
    "homepage": "http://Impute.me",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-03-15T18:33:52Z",
    "license": "LGPL-3.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/lassefolkersen/impute-me"
        },
        {
            "type": [
                "Service"
            ],
            "url": "https://hub.docker.com/repository/docker/lassefolkersen/impute-me"
        }
    ],
    "maturity": "Mature",
    "name": "impute.me",
    "owner": "lassefolkersen",
    "publication": [
        {
            "doi": "10.3389/fgene.2020.00578",
            "metadata": {
                "abstract": "© Copyright © 2020 Folkersen, Pain, Ingason, Werge, Lewis and Austin.To date, interpretation of genomic information has focused on single variants conferring disease risk, but most disorders of major public concern have a polygenic architecture. Polygenic risk scores (PRSs) give a single measure of disease liability by summarizing disease risk across hundreds of thousands of genetic variants. They can be calculated in any genome-wide genotype data-source, using a prediction model based on genome-wide summary statistics from external studies. As genome-wide association studies increase in power, the predictive ability for disease risk will also increase. Although PRSs are unlikely ever to be fully diagnostic, they may give valuable medical information for risk stratification, prognosis, or treatment response prediction. Public engagement is therefore becoming important on the potential use and acceptability of PRSs. However, the current public perception of genetics is that it provides “yes/no” answers about the presence/absence of a condition, or the potential for developing a condition, which in not the case for common, complex disorders with polygenic architecture. Meanwhile, unregulated third-party applications are being developed to satisfy consumer demand for information on the impact of lower-risk variants on common diseases that are highly polygenic. Often, applications report results from single-nucleotide polymorphisms (SNPs) and disregard effect size, which is highly inappropriate for common, complex disorders where everybody carries risk variants. Tools are therefore needed to communicate our understanding of genetic vulnerability as a continuous trait, where a genetic liability confers risk for disease. Impute.me is one such tool, whose focus is on education and information on common, complex disorders with polygenetic architecture. Its research-focused open-source website allows users to upload consumer genetics data to obtain PRSs, with results reported on a population-level normal distribution. Diseases can only be browsed by International Classification of Diseases, 10th Revision (ICD-10) chapter–location or alphabetically, thus prompting the user to consider genetic risk scores in a medical context of relevance to the individual. Here, we present an overview of the implementation of the impute.me site, along with analysis of typical usage patterns, which may advance public perception of genomic risk and precision medicine.",
                "authors": [
                    {
                        "name": "Folkersen L."
                    },
                    {
                        "name": "Pain O."
                    },
                    {
                        "name": "Ingason A."
                    },
                    {
                        "name": "Werge T."
                    },
                    {
                        "name": "Lewis C.M."
                    },
                    {
                        "name": "Austin J."
                    }
                ],
                "citationCount": 6,
                "date": "2020-06-30T00:00:00Z",
                "journal": "Frontiers in Genetics",
                "title": "Impute.me: An Open-Source, Non-profit Tool for Using Data From Direct-to-Consumer Genetic Testing to Calculate and Interpret Polygenic Risk Scores"
            },
            "pmid": "32714365",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application",
        "Desktop application"
    ],
    "topic": [
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Personalised medicine",
            "uri": "http://edamontology.org/topic_3577"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "GWAS study",
            "uri": "http://edamontology.org/topic_3517"
        }
    ],
    "validated": 1
}