{
    "additionDate": "2017-08-20T17:23:32Z",
    "biotoolsCURIE": "biotools:seqassist",
    "biotoolsID": "seqassist",
    "collectionID": [
        "Animal and Crop Genomics"
    ],
    "credit": [
        {
            "email": "yan.peng@eagles.usm.edu",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Valuable “assistant” to a broad range of investigators who conduct genome re-sequencing, RNA-Seq, or de novo genome sequencing and assembly experiments. It takes NGS-generated FASTQ files as the input, employs the BWA-MEM aligner for sequence alignment, and aims to provide a quick overview and basic statistics of NGS data.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://orca.st.usm.edu/cbbl/seqassist/userManual.html"
        }
    ],
    "editPermission": {
        "authors": [
            "animalandcropgenomics"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data handling",
                    "uri": "http://edamontology.org/operation_2409"
                },
                {
                    "term": "Statistical calculation",
                    "uri": "http://edamontology.org/operation_2238"
                }
            ]
        }
    ],
    "homepage": "http://orca.st.usm.edu/cbbl/seqassist/",
    "language": [
        "Perl"
    ],
    "lastUpdate": "2019-09-04T08:38:30Z",
    "license": "Other",
    "name": "seqassist",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "admin",
    "publication": [
        {
            "doi": "10.1186/1471-2105-15-S11-S10",
            "metadata": {
                "abstract": "© 2014 Peng et al.; licensee BioMed Central Ltd.Background: While next-generation sequencing (NGS) technologies are rapidly advancing, an area that lags behind is the development of efficient and user-friendly tools for preliminary analysis of massive NGS data. As an effort to fill this gap to keep up with the fast pace of technological advancement and to accelerate data-to-results turnaround, we developed a novel software package named SeqAssist (\"Sequencing Assistant\" or SA). Results: SeqAssist takes NGS-generated FASTQ files as the input, employs the BWA-MEM aligner for sequence alignment, and aims to provide a quick overview and basic statistics of NGS data. It consists of three separate workflows: (1) the SA_RunStats workflow generates basic statistics about an NGS dataset, including numbers of raw, cleaned, redundant and unique reads, redundancy rate, and a list of unique sequences with length and read count; (2) the SA_Run2Ref workflow estimates the breadth, depth and evenness of genome-wide coverage of the NGS dataset at a nucleotide resolution; and (3) the SA_Run2Run workflow compares two NGS datasets to determine the redundancy (overlapping rate) between the two NGS runs. Statistics produced by SeqAssist or derived from SeqAssist output files are designed to inform the user: whether, what percentage, how many times and how evenly a genomic locus (i.e., gene, scaffold, chromosome or genome) is covered by sequencing reads, how redundant the sequencing reads are in a single run or between two runs. These statistics can guide the user in evaluating the quality of a DNA library prepared for RNA-Seq or genome (re-)sequencing and in deciding the number of sequencing runs required for the library. We have tested SeqAssist using a synthetic dataset and demonstrated its main features using multiple NGS datasets generated from genome re-sequencing experiments. Conclusions: SeqAssist is a useful and informative tool that can serve as a valuable \"assistant\" to a broad range of investigators who conduct genome re-sequencing, RNA-Seq, or de novo genome sequencing and assembly experiments.",
                "authors": [
                    {
                        "name": "Peng Y."
                    },
                    {
                        "name": "Maxwell A.S."
                    },
                    {
                        "name": "Barker N.D."
                    },
                    {
                        "name": "Laird J.G."
                    },
                    {
                        "name": "Kennedy A.J."
                    },
                    {
                        "name": "Wang N."
                    },
                    {
                        "name": "Zhang C."
                    },
                    {
                        "name": "Gong P."
                    }
                ],
                "citationCount": 4,
                "date": "2014-10-21T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "SeqAssist: A novel toolkit for preliminary analysis of next-generation sequencing data"
            },
            "pmcid": "PMC4251038",
            "pmid": "25349885",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Data quality management",
            "uri": "http://edamontology.org/topic_3572"
        }
    ],
    "validated": 1
}