{
    "additionDate": "2017-02-14T09:36:37Z",
    "biotoolsCURIE": "biotools:sroogle",
    "biotoolsID": "sroogle",
    "credit": [
        {
            "email": "Schragas@post.tau.ac.il",
            "name": "SROOGLE Support",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "SROOGLE is a webserver that makes splicing signal sequence and scoring data available to the biologist in an integrated, visual and user friendly format.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://sroogle.tau.ac.il/help.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Formatting",
                    "uri": "http://edamontology.org/operation_0335"
                },
                {
                    "term": "Sequence merging",
                    "uri": "http://edamontology.org/operation_0232"
                }
            ]
        }
    ],
    "homepage": "http://sroogle.tau.ac.il",
    "language": [
        "JavaScript"
    ],
    "lastUpdate": "2018-12-10T12:58:53Z",
    "name": "SROOGLE",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "Exons are typically only 140 nt in length and are surrounded by intronic oceans that are thousands of nucleotides long. Four core splicing signals, aided by splicing-regulatory sequences (SRSs), direct the splicing machinery to the exon/intron junctions. Many different algorithms have been developed to identify and score the four splicing signals and thousands of putative SRSs have been identified, both computationally and experimentally. Here we describe SROOGLE, a webserver that makes splicing signal sequence and scoring data available to the biologist in an integrated, visual, easily interpretable, and user-friendly format. SROOGLE's input consists of the sequence of an exon and flanking introns. The graphic browser output displays the four core splicing signals with scores based on nine different algorithms and highlights sequences belonging to 13 different groups of SRSs. The interface also offers the ability to examine the effect of point mutations at any given position, as well a range of additional metrics and statistical measures regarding each potential signal. SROOGLE is available at http://sroogle.tau.ac.il, and may also be downloaded as a desktop version.",
                "authors": [
                    {
                        "name": "Ast G."
                    },
                    {
                        "name": "Hall E."
                    },
                    {
                        "name": "Schwartz S."
                    }
                ],
                "citationCount": 64,
                "date": "2009-08-04T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "SROOGLE: Webserver for integrative, user-friendly visualization of splicing signals"
            },
            "pmid": "19429896"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "RNA splicing",
            "uri": "http://edamontology.org/topic_3320"
        }
    ],
    "validated": 1
}
