{
    "additionDate": "2024-04-08T08:36:33.495950Z",
    "biotoolsCURIE": "biotools:ecl_3.0",
    "biotoolsID": "ecl_3.0",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "eeyu@ust.hk",
            "name": "Weichuan Yu",
            "typeEntity": "Person"
        }
    ],
    "description": "Sensitive peptide identification tool for cross-linking mass spectrometry data analysis.",
    "documentation": [
        {
            "type": [
                "Training material"
            ],
            "url": "https://youtu.be/PpZgbi8V2xI"
        }
    ],
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Peptide identification",
                    "uri": "http://edamontology.org/operation_3631"
                },
                {
                    "term": "Protein identification",
                    "uri": "http://edamontology.org/operation_3767"
                },
                {
                    "term": "Spectrum calculation",
                    "uri": "http://edamontology.org/operation_3860"
                }
            ]
        }
    ],
    "homepage": "https://github.com/yuweichuan/ECL-PF",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-04-08T08:36:33.498745Z",
    "license": "MIT",
    "name": "ECL 3.0",
    "operatingSystem": [
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12859-023-05473-Z",
            "metadata": {
                "abstract": "Background: Cross-linking mass spectrometry (XL-MS) is a powerful technique for detecting protein–protein interactions (PPIs) and modeling protein structures in a high-throughput manner. In XL-MS experiments, proteins are cross-linked by a chemical reagent (namely cross-linker), fragmented, and then fed into a tandem mass spectrum (MS/MS). Cross-linkers are either cleavable or non-cleavable, and each type requires distinct data analysis tools. However, both types of cross-linkers suffer from imbalanced fragmentation efficiency, resulting in a large number of unidentifiable spectra that hinder the discovery of PPIs and protein conformations. To address this challenge, researchers have sought to improve the sensitivity of XL-MS through invention of novel cross-linking reagents, optimization of sample preparation protocols, and development of data analysis algorithms. One promising approach to developing new data analysis methods is to apply a protein feedback mechanism in the analysis. It has significantly improved the sensitivity of analysis methods in the cleavable cross-linking data. The application of the protein feedback mechanism to the analysis of non-cleavable cross-linking data is expected to have an even greater impact because the majority of XL-MS experiments currently employs non-cleavable cross-linkers. Results: In this study, we applied the protein feedback mechanism to the analysis of both non-cleavable and cleavable cross-linking data and observed a substantial improvement in cross-link spectrum matches (CSMs) compared to conventional methods. Furthermore, we developed a new software program, ECL 3.0, that integrates two algorithms and includes a user-friendly graphical interface to facilitate wider applications of this new program. Conclusions: ECL 3.0 source code is available at https://github.com/yuweichuan/ECL-PF.git . A quick tutorial is available at https://youtu.be/PpZgbi8V2xI .",
                "authors": [
                    {
                        "name": "Dai S."
                    },
                    {
                        "name": "Lai S."
                    },
                    {
                        "name": "Li N."
                    },
                    {
                        "name": "Lin Y."
                    },
                    {
                        "name": "Yu W."
                    },
                    {
                        "name": "Zhang X."
                    },
                    {
                        "name": "Zhou C."
                    }
                ],
                "date": "2023-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "ECL 3.0: a sensitive peptide identification tool for cross-linking mass spectrometry data analysis"
            },
            "pmcid": "PMC10510197",
            "pmid": "37730532"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Protein interaction experiment",
            "uri": "http://edamontology.org/topic_3957"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
