{
    "additionDate": "2019-11-14T18:10:39Z",
    "biotoolsCURIE": "biotools:EnteroBase",
    "biotoolsID": "EnteroBase",
    "confidence_flag": "tool",
    "description": "Global genomic population structure of Clostridioides difficile",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "De-novo assembly",
                    "uri": "http://edamontology.org/operation_0524"
                },
                {
                    "term": "Scaffolding",
                    "uri": "http://edamontology.org/operation_3216"
                },
                {
                    "term": "Multilocus sequence typing",
                    "uri": "http://edamontology.org/operation_3840"
                }
            ]
        }
    ],
    "homepage": "http://enterobase.warwick.ac.uk",
    "lastUpdate": "2020-12-25T14:36:05Z",
    "name": "EnteroBase",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1101/727230"
        },
        {
            "doi": "10.1099/mgen.0.000410",
            "metadata": {
                "abstract": "© 2020 The Authors.Clostridioides difficile is the primary infectious cause of antibiotic-associated diarrhea. Local transmissions and international outbreaks of this pathogen have been previously elucidated by bacterial whole-genome sequencing, but comparative genomic analyses at the global scale were hampered by the lack of specific bioinformatic tools. Here we introduce a publicly accessible database within EnteroBase (http://​enterobase.​warwick.​ac.​uk) that automatically retrieves and assembles C. difficile short-reads from the public domain, and calls alleles for core-genome multilocus sequence typing (cgMLST). We demonstrate that comparable levels of resolution and precision are attained by EnteroBase cgMLST and single-nucleotide polymorphism analysis. EnteroBase currently contains 18254 quality-controlled C. difficile genomes, which have been assigned to hierarchical sets of single-linkage clusters by cgMLST distances. This hierarchical clustering is used to identify and name populations of C. difficile at all epidemiological levels, from recent transmission chains through to epidemic and endemic strains. Moreover, it puts newly collected isolates into phylogenetic and epidemiological context by identifying related strains among all previously published genome data. For example, HC2 clusters (i.e. chains of genomes with pairwise distances of up to two cgMLST alleles) were statistically associated with specific hospitals (P<10−4) or single wards (P=0.01) within hospitals, indicating they represented local transmission clusters. We also detected several HC2 clusters spanning more than one hospital that by retrospective epidemiological analysis were confirmed to be associated with inter-hospital patient transfers. In contrast, clustering at level HC150 correlated with k-mer-based classification and was largely compatible with PCR ribotyping, thus enabling comparisons to earlier surveillance data. EnteroBase enables contextual interpretation of a growing collection of assembled, quality-controlled C. difficile genome sequences and their associated metadata. Hierarchical clustering rapidly identifies database entries that are related at multiple levels of genetic distance, facilitating communication among researchers, clinicians and public-health officials who are combatting disease caused by C. difficile.",
                "authors": [
                    {
                        "name": "Frentrup M."
                    },
                    {
                        "name": "Zhou Z."
                    },
                    {
                        "name": "Steglich M."
                    },
                    {
                        "name": "Meier-Kolthoff J.P."
                    },
                    {
                        "name": "Goker M."
                    },
                    {
                        "name": "Riedel T."
                    },
                    {
                        "name": "Bunk B."
                    },
                    {
                        "name": "Sproer C."
                    },
                    {
                        "name": "Overmann J."
                    },
                    {
                        "name": "Blaschitz M."
                    },
                    {
                        "name": "Indra A."
                    },
                    {
                        "name": "von Muller L."
                    },
                    {
                        "name": "Kohl T.A."
                    },
                    {
                        "name": "Niemann S."
                    },
                    {
                        "name": "Seyboldt C."
                    },
                    {
                        "name": "Klawonn F."
                    },
                    {
                        "name": "Kumar N."
                    },
                    {
                        "name": "Lawley T.D."
                    },
                    {
                        "name": "Garcia-Fernandez S."
                    },
                    {
                        "name": "Canton R."
                    },
                    {
                        "name": "Del Campo R."
                    },
                    {
                        "name": "Zimmermann O."
                    },
                    {
                        "name": "Gross U."
                    },
                    {
                        "name": "Achtman M."
                    },
                    {
                        "name": "Nubel U."
                    }
                ],
                "citationCount": 3,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Microbial Genomics",
                "title": "A publicly accessible database for clostridioides difficile genome sequences supports tracing of transmission chains and epidemics"
            }
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Public health and epidemiology",
            "uri": "http://edamontology.org/topic_3305"
        },
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        },
        {
            "term": "Population genomics",
            "uri": "http://edamontology.org/topic_3796"
        }
    ],
    "validated": 1
}