{
    "accessibility": "Open access",
    "additionDate": "2019-02-18T16:16:47Z",
    "biotoolsCURIE": "biotools:Docker4Circ",
    "biotoolsID": "Docker4Circ",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "beccuti@di.unito.it",
            "name": "Marco Beccuti",
            "note": "Assistant professor at University of Turin.",
            "orcidid": "https://orcid.org/0000-0001-6125-9460",
            "typeEntity": "Person",
            "typeRole": [
                "Maintainer"
            ],
            "url": "http://www.di.unito.it/~beccuti/"
        },
        {
            "email": "fcordero@di.unito.it",
            "name": "Francesca Cordero",
            "note": "Assistant professor at University of Turin.",
            "orcidid": "https://orcid.org/0000-0002-3143-3330",
            "typeEntity": "Person",
            "url": "http://www.di.unito.it/~fcordero/"
        },
        {
            "email": "raffaele.calogero@unito.it",
            "name": "Raffaele Calogero",
            "note": "Professor at University of Turin.",
            "typeEntity": "Person",
            "typeRole": [
                "Maintainer"
            ]
        },
        {
            "name": "ELIXIR-ITA-TORINO",
            "typeEntity": "Project",
            "typeRole": [
                "Support"
            ]
        }
    ],
    "description": "It is  a new work-flow designed for a comprehensive analysis of circRNAs composed of: the circRNAs prediction, their classification and annotation using public databases, the back-splicing sequence reconstruction, the internal alternative structure definition, the alignment-free circRNAs quantification from RNA-Seq reads, and their differential expression analysis.\nDocker4Circ was specifically designed for making easier and more accessible circRNA analysis thanks to its containerization and an available user-friendly Java GUI Interface. Furthermore, Docker4Circ ensures a reproducible analysis because all its tasks were embedded into an docker image following guideline provided by Reproducible\nBioinformatics Project (RBP, http://reproducible-bioinformatics.org/).",
    "editPermission": {
        "authors": [
            "rcaloger"
        ],
        "type": "group"
    },
    "elixirNode": [
        "Italy"
    ],
    "homepage": "https://github.com/kendomaniac/docker4seq",
    "language": [
        "C++",
        "R"
    ],
    "lastUpdate": "2021-03-01T19:36:47Z",
    "license": "GPL-3.0",
    "maturity": "Mature",
    "name": "Docker4Circ",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "beccuti",
    "publication": [
        {
            "doi": "10.3390/IJMS21010293",
            "metadata": {
                "abstract": "© 2019 by the authors. Licensee MDPI, Basel, Switzerland.Recent improvements in cost-effectiveness of high-throughput technologies has allowed RNA sequencing of total transcriptomes suitable for evaluating the expression and regulation of circRNAs, a relatively novel class of transcript isoforms with suggested roles in transcriptional and post-transcriptional gene expression regulation, as well as their possible use as biomarkers, due to their deregulation in various human diseases. A limited number of integrated workflows exists for prediction, characterization, and differential expression analysis of circRNAs, none of them complying with computational reproducibility requirements. We developed Docker4Circ for the complete analysis of circRNAs from RNA-Seq data. Docker4Circ runs a comprehensive analysis of circRNAs in human and model organisms, including: circRNAs prediction; classification and annotation using six public databases; back-splice sequence reconstruction; internal alternative splicing of circularizing exons; alignment-free circRNAs quantification from RNA-Seq reads; and differential expression analysis. Docker4Circ makes circRNAs analysis easier and more accessible thanks to: (i) its R interface; (ii) encapsulation of computational tasks into docker images; (iii) user-friendly Java GUI Interface availability; and (iv) no need of advanced bash scripting skills for correct use. Furthermore, Docker4Circ ensures a reproducible analysis since all its tasks are embedded into a docker image following the guidelines provided by Reproducible Bioinformatics Project.",
                "authors": [
                    {
                        "name": "Beccuti M."
                    },
                    {
                        "name": "Calogero R.A."
                    },
                    {
                        "name": "Cordero F."
                    },
                    {
                        "name": "De Bortoli M."
                    },
                    {
                        "name": "De Intinis C."
                    },
                    {
                        "name": "Ferrero G."
                    },
                    {
                        "name": "Licheri N."
                    },
                    {
                        "name": "Miano V."
                    },
                    {
                        "name": "Tarrero L.C."
                    }
                ],
                "citationCount": 5,
                "date": "2020-01-01T00:00:00Z",
                "journal": "International Journal of Molecular Sciences",
                "title": "Docker4circ: A framework for the reproducible characterization of circRNAs from RNA-seq data"
            },
            "pmcid": "PMC6982331",
            "pmid": "31906249"
        }
    ],
    "toolType": [
        "Workflow"
    ],
    "topic": [
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        }
    ],
    "validated": 1,
    "version": [
        "version 1"
    ]
}
