{
    "additionDate": "2015-01-22T11:35:46Z",
    "biotoolsCURIE": "biotools:angeldust",
    "biotoolsID": "angeldust",
    "credit": [
        {
            "name": "ELIXIR-ITA-MILANO",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        },
        {
            "email": "david.horner@unimi.it",
            "name": "David Horner",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Database of Streptocarpus rexii transcriptome.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://159.149.160.53:81/locus/tutorial"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence visualisation",
                    "uri": "http://edamontology.org/operation_0564"
                },
                {
                    "term": "Sequence annotation",
                    "uri": "http://edamontology.org/operation_0361"
                },
                {
                    "term": "Sequence assembly",
                    "uri": "http://edamontology.org/operation_0310"
                }
            ]
        }
    ],
    "homepage": "http://www.beaconlab.it/angeldust",
    "lastUpdate": "2018-12-10T12:58:50Z",
    "license": "GPL-3.0",
    "maturity": "Mature",
    "name": "Angeldust",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "ELIXIR-ITA-MILANO",
    "publication": [
        {
            "doi": "10.1371/journal.pone.0080961",
            "metadata": {
                "abstract": "De novo transcriptome characterization from Next Generation Sequencing data has become an important approach in the study of non-model plants. Despite notable advances in the assembly of short reads, the clustering of transcripts into unigene-like (locus-specific) clusters remains a somewhat neglected subject. Indeed, closely related paralogous transcripts are often merged into single clusters by current approaches. Here, a novel heuristic method for locus-specific clustering is compared to that implemented in the de novo assembler Oases, using the same initial transcript collections, derived from Arabidopsis thaliana and the developmental model Streptocarpus rexii. We show that the proposed approach improves cluster specificity in the A. thaliana dataset for which the reference genome is available. Furthermore, for the S. rexii data our filtered transcript collection matches a larger number of distinct annotated loci in reference genomes than the Oases set, while containing a reduced overall number of loci. A detailed discussion of advantages and limitations of our approach in processing de novo transcriptome reconstructions is presented. The proposed method should be widely applicable to other organisms, irrespective of the transcript assembly method employed. The S. rexii transcriptome is available as a sophisticated and augmented publicly available online database. Copyright: © 2013 Chiara et al.",
                "authors": [
                    {
                        "name": "Chiara M."
                    },
                    {
                        "name": "Horner D.S."
                    },
                    {
                        "name": "Spada A."
                    }
                ],
                "citationCount": 17,
                "date": "2013-12-06T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "De novo assembly of the transcriptome of the non-model plant Streptocarpus rexii employing a novel heuristic to recover locus-specific transcript clusters"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ],
    "validated": 1
}