{
    "additionDate": "2017-08-03T19:03:56Z",
    "biotoolsCURIE": "biotools:vntrfinder",
    "biotoolsID": "vntrfinder",
    "credit": [
        {
            "email": "codushlaine@gmail.com",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://sites.google.com/a/codushlaine.com/colm-o-dushlaine/home"
        }
    ],
    "description": "The program enables the detection of sequence length variation between arrays of inter-specific or intra-specific tandem repeats. In the absence of comparable sequences to explore observed variation, predictions are provided describing which tandem repeats are more likely to be variable, to help guide and focus further experimental evaluation.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://sites.google.com/a/codushlaine.com/colm-o-dushlaine/Data"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Repeat sequence detection",
                    "uri": "http://edamontology.org/operation_0379"
                }
            ]
        }
    ],
    "homepage": "https://sites.google.com/a/codushlaine.com/colm-o-dushlaine/Data",
    "language": [
        "Perl"
    ],
    "lastUpdate": "2018-12-10T12:58:49Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/vntrfinder-v1-variable-number-tandem-repeats-finder.html"
        }
    ],
    "name": "VNTRfinder",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Background: Tandem repeat arrays showing variation between sequences within a population, between strains or across species may have functional effects. The increasing availability of genomic sequence data makes routine description of observed variation possible, creating a need for tools to describe such variability. Results: We present a set of programs that facilitate the identification of tandem repeats showing variation across multiple sequences or genomes, and the prediction of potentially polymorphic tandem repeats. The VNTRfinder (Variable Number of Tandem Repeats finder) program enables the detection of sequence length variation between arrays of inter-specific or intra-specific tandem repeats. In the absence of comparable sequences to explore observed variation, predictions are provided describing which tandem repeats are more likely to be variable, to help guide and focus further experimental evaluation. Conclusion: These tools represent a resource for researchers interested in tandem repeats in nucleotide sequences that are most likely to be of clinical and evolutionary interest. The tools are available at http:// bioinformatics.rcsi.ie/vntrfinder/. Downloadable versions for UNIX/LINUX and WINDOWS which permit the consideration of longer and more numerous sequences are also available. © 2006 O'Dushlaine and Shields; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "O'Dushlaine C.T."
                    },
                    {
                        "name": "Shields D.C."
                    }
                ],
                "citationCount": 8,
                "date": "2006-11-15T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "Tools for the identification of variable and potentially variable tandem repeats"
            },
            "pmid": "17107618"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Sequence composition, complexity and repeats",
            "uri": "http://edamontology.org/topic_0157"
        }
    ],
    "validated": 1
}