{
    "additionDate": "2018-05-25T08:20:28Z",
    "biotoolsCURIE": "biotools:gwama",
    "biotoolsID": "gwama",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Reedik Mägi",
            "orcidid": "http://orcid.org/0000-0002-2964-6011",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://www.geenivaramu.ee/en/tools/gwama-contact"
        }
    ],
    "description": "Genome-Wide Association Meta Analysis software performs meta-analysis of the results of GWA studies of binary or quantitative phenotypes. Fixed- and random-effect meta-analyses are performed for both directly genotyped and imputed SNPs using estimates of the allelic odds ratio and 95% confidence interval for binary traits, and estimates of the allelic effect size and standard error for quantitative phenotypes.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Statistical calculation",
                    "uri": "http://edamontology.org/operation_2238"
                }
            ]
        }
    ],
    "homepage": "https://www.geenivaramu.ee/en/tools/gwama",
    "lastUpdate": "2018-12-29T14:44:45Z",
    "license": "BSD-3-Clause",
    "maturity": "Mature",
    "name": "GWAMA",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "Dybian",
    "publication": [
        {
            "doi": "10.1186/1471-2105-11-288",
            "metadata": {
                "abstract": "Background: Despite the recent success of genome-wide association studies in identifying novel loci contributing effects to complex human traits, such as type 2 diabetes and obesity, much of the genetic component of variation in these phenotypes remains unexplained. One way to improving power to detect further novel loci is through meta-analysis of studies from the same population, increasing the sample size over any individual study. Although statistical software analysis packages incorporate routines for meta-analysis, they are ill equipped to meet the challenges of the scale and complexity of data generated in genome-wide association studies.Results: We have developed flexible, open-source software for the meta-analysis of genome-wide association studies. The software incorporates a variety of error trapping facilities, and provides a range of meta-analysis summary statistics. The software is distributed with scripts that allow simple formatting of files containing the results of each association study and generate graphical summaries of genome-wide meta-analysis results.Conclusions: The GWAMA (Genome-Wide Association Meta-Analysis) software has been developed to perform meta-analysis of summary statistics generated from genome-wide association studies of dichotomous phenotypes or quantitative traits. Software with source files, documentation and example data files are freely available online at http://www.well.ox.ac.uk/GWAMA. © 2010 Mägi and Morris; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Magi R."
                    },
                    {
                        "name": "Morris A.P."
                    }
                ],
                "citationCount": 283,
                "date": "2010-05-28T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "GWAMA: Software for genome-wide association meta-analysis"
            },
            "pmcid": "PMC2893603",
            "pmid": "20509871",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Quantitative genetics",
            "uri": "http://edamontology.org/topic_3055"
        }
    ],
    "validated": 1,
    "version": [
        "2.2.2"
    ]
}