{
    "additionDate": "2018-05-29T19:09:13Z",
    "biotoolsCURIE": "biotools:nep",
    "biotoolsID": "nep",
    "credit": [
        {
            "email": "chuangg@mail.nih.gov",
            "name": "Support",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Epitope prediction based on antibody neutralization of viral strains with diverse sequences.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://bioinformatics.niaid.nih.gov/nep/usage/NEPServer_help_page.htm"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein feature detection",
                    "uri": "http://edamontology.org/operation_3092"
                }
            ]
        }
    ],
    "homepage": "https://bioinformatics.niaid.nih.gov/nep/#home",
    "lastUpdate": "2018-12-10T12:58:59Z",
    "name": "NEP",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1093/NAR/GKU318",
            "metadata": {
                "abstract": "Delineation of the antigenic site, or epitope, recognized by an antibody can provide clues about functional vulnerabilities and resistance mechanisms, and can therefore guide antibody optimization and epitope-based vaccine design. Previously, we developed an algorithm for antibody-epitope prediction based on antibody neutralization of viral strains with diverse sequences and validated the algorithm on a set of broadly neutralizing HIV-1 antibodies. Here we describe the implementation of this algorithm, NEP (Neutralization-based Epitope Prediction), as a web-based server. The users must supply as input: (i) an alignment of antigen sequences of diverse viral strains; (ii) neutralization data for the antibody of interest against the same set of antigen sequences; and (iii) (optional) a structure of the unbound antigen, for enhanced prediction accuracy. The prediction results can be downloaded or viewed interactively on the antigen structure (if supplied) from the web browser using a JSmol applet. Since neutralization experiments are typically performed as one of the first steps in the characterization of an antibody to determine its breadth and potency, the NEP server can be used to predict antibody-epitope information at no additional experimental costs. NEP can be accessed on the internet at http://exon.niaid.nih.gov/nep. © 2014 Published by Oxford University Press on behalf of Nucleic Acids Research 2014. This work is written by (a) US Government employee(s) and is in the public domain in the US.",
                "authors": [
                    {
                        "name": "Chuang G.-Y."
                    },
                    {
                        "name": "Liou D."
                    },
                    {
                        "name": "Kwong P.D."
                    },
                    {
                        "name": "Georgiev I.S."
                    }
                ],
                "citationCount": 10,
                "date": "2014-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "NEP: Web server for epitope prediction based on antibody neutralization of viral strains with diverse sequences"
            },
            "pmcid": "PMC4086065",
            "pmid": "24782517"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Drug discovery",
            "uri": "http://edamontology.org/topic_3336"
        },
        {
            "term": "Medicines research and development",
            "uri": "http://edamontology.org/topic_3376"
        },
        {
            "term": "Biotechnology",
            "uri": "http://edamontology.org/topic_3297"
        },
        {
            "term": "Immunoproteins, genes and antigens",
            "uri": "http://edamontology.org/topic_2830"
        }
    ],
    "validated": 1
}