
{
    "credit": [
        {
            "email": "heshunmin@gmail.com",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://www.regulatoryrna.org/software/piRNA/piRNA_target_mRNA/index.php#inst"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Prediction and recognition",
                    "uri": "http://edamontology.org/operation_2423"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Functional, regulatory and non-coding RNA",
                "uri": "http://edamontology.org/topic_0659"
            },
            {
                "term": "RNA",
                "uri": "http://edamontology.org/topic_0099"
            },
            {
                "term": "Machine learning",
                "uri": "http://edamontology.org/topic_3474"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/pirnapre-pirna-targets-on-mrnas-in-mouse.html"
        }
    ],
    "publication": [
        {
            "abstract": "© 2015 The Author. All rights reserved. Motivation: PIWI-interacting RNAs (piRNAs) are a class of small non-coding RNAs that are highly abundant in the germline. One important role of piRNAs is to defend genome integrity by guiding PIWI proteins to silence transposable elements (TEs), which have a high potential to cause deleterious effects on their host. The mechanism of piRNA-mediated post-transcriptional silencing was also observed to affect mRNAs, suggesting that piRNAs might play a broad role in gene expression regulation. However, there has been no systematic report with regard to how many protein-coding genes might be targeted and regulated by piRNAs. Results: We trained a support vector machine classifier based on a combination of Miwi CLIP-Seq-derived features and position-derived features to predict the potential targets of piRNAs on mRNAs in the mouse. Reanalysis of a published microarray dataset suggested that the expression level of the 2587 protein-coding genes predicted as piRNA targets showed significant upregulation as a whole after abolishing the slicer activity of Miwi, supporting the conclusion that they are subject to piRNA-mediated regulation.",
            "authors": [
                "Yuan J.",
                "Zhang P.",
                "Cui Y.",
                "Wang J.",
                "Skogerbo G.",
                "Huang D.-W.",
                "Chen R.",
                "He S."
            ],
            "cit_count": 4,
            "journal": "Bioinformatics",
            "pmid": "26677964",
            "title": "Computational identification of piRNA targets on mouse mRNAs",
            "year": "2016-04-15"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:pirnapre",
        "biotoolsID": "pirnapre",
        "description": "SVM classifier based on a combination of Miwi CLIP-Seq derived features and position derived features to predict potential targets of piRNAs on mRNAs.",
        "homepage": "http://www.regulatoryrna.org/software/piRNA/piRNA_target_mRNA/index.php",
        "name": "pirnaPre"
    }
}