
{
    "credit": [
        {
            "email": "EditorPhosphoSite@cellsignal.com",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "https://www.phosphosite.org/staticUsingPhosphosite.action"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Post-translation modification site prediction",
                    "uri": "http://edamontology.org/operation_0417"
                },
                {
                    "term": "PTM localisation",
                    "uri": "http://edamontology.org/operation_3755"
                },
                {
                    "term": "PTM identification",
                    "uri": "http://edamontology.org/operation_3645"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Database portal"
        ],
        "topic": [
            {
                "term": "Protein modifications",
                "uri": "http://edamontology.org/topic_0601"
            },
            {
                "term": "Experimental design and studies",
                "uri": "http://edamontology.org/topic_3678"
            },
            {
                "term": "Systems biology",
                "uri": "http://edamontology.org/topic_2259"
            },
            {
                "term": "Biology",
                "uri": "http://edamontology.org/topic_3070"
            },
            {
                "term": "Proteins",
                "uri": "http://edamontology.org/topic_0078"
            }
        ]
    },
    "publication": [
        {
            "abstract": "PhosphoSitePlus (http://www.phosphosite.org) is an open, comprehensive, manually curated and interactive resource for studying experimentally observed post-translational modifications, primarily of human and mouse proteins. It encompasses 1 30 000 non-redundant modification sites, primarily phosphorylation, ubiquitinylation and acetylation. The interface is designed for clarity and ease of navigation. From the home page, users can launch simple or complex searches and browse high-throughput data sets by disease, tissue or cell line. Searches can be restricted by specific treatments, protein types, domains, cellular components, disease, cell types, cell lines, tissue and sequences or motifs. A few clicks of the mouse will take users to substrate pages or protein pages with sites, sequences, domain diagrams and molecular visualization of side-chains known to be modified; to site pages with information about how the modified site relates to the functions of specific proteins and cellular processes and to curated information pages summarizing the details from one record. PyMOL and Chimera scripts that colorize reactive groups on residues that are modified can be downloaded. Features designed to facilitate proteomic analyses include downloads of modification sites, kinase-substrate data sets, sequence logo generators, a Cytoscape plugin and BioPAX download to enable pathway visualization of the kinase-substrate interactions in PhosphoSitePlus®. © The Author(s) 2011. Published by Oxford University Press.",
            "authors": [
                "Hornbeck P.V.",
                "Kornhauser J.M.",
                "Tkachev S.",
                "Zhang B.",
                "Skrzypek E.",
                "Murray B.",
                "Latham V.",
                "Sullivan M."
            ],
            "cit_count": 844,
            "journal": "Nucleic Acids Research",
            "pmid": "22135298",
            "title": "PhosphoSitePlus: A comprehensive resource for investigating the structure and function of experimentally determined post-translational modifications in man and mouse",
            "year": "2012-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:phosphositeplus",
        "biotoolsID": "phosphositeplus",
        "description": "Online systems biology resource providing comprehensive info and tools to study protein post-translational modification in man and mouse.",
        "homepage": "https://www.phosphosite.org",
        "name": "PhosphoSitePlus"
    }
}