{"credit":[{"name":"Contact form","typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://ctd.mdibl.org/help/contact.go;jsessionid=C268D9DF2CE71C9986EA4C2D103D54D4"}],"documentation":[{"type":"GENERAL","url":"http://ctd.mdibl.org/help/;jsessionid=36B57F3336DDAD90324A8A536EB17EE0"},{"url":"http://ctd.mdibl.org/help/tutorials.jsp"}],"function":[{"operation":[{"term":"Chemical class enrichment","uri":"http://edamontology.org/operation_3502"},{"term":"Gene prediction","uri":"http://edamontology.org/operation_2454"},{"term":"Gene-set enrichment analysis","uri":"http://edamontology.org/operation_2436"},{"term":"Gene expression profiling","uri":"http://edamontology.org/operation_0314"},{"term":"Pathway or network prediction","uri":"http://edamontology.org/operation_3439"}]}],"labels":{"operatingSystem":["Linux","Windows","Mac"],"toolType":["Database portal"],"topic":[{"term":"Molecular interactions, pathways and networks","uri":"http://edamontology.org/topic_0602"},{"term":"Pathology","uri":"http://edamontology.org/topic_0634"},{"term":"Ontology and terminology","uri":"http://edamontology.org/topic_0089"}]},"publication":[{"abstract":"The Comparative Toxicogenomics Database (CTD) is a public resource that promotes understanding about the interaction of environmental chemicals with gene products, and their effects on human health. Biocurators at CTD manually curate a triad of chemical-gene, chemical-disease and gene-disease relationships from the literature. These core data are then integrated to construct chemical-gene-disease networks and to predict many novel relationships using different types of associated data. Since 2009, we dramatically increased the content of CTD to 1.4 million chemical-gene-disease data points and added many features, statistical analyses and analytical tools, including GeneComps and ChemComps (to find comparable genes and chemicals that share toxicogenomic profiles), enriched Gene Ontology terms associated with chemicals, statistically ranked chemical-disease inferences, Venn diagram tools to discover overlapping and unique attributes of any set of chemicals, genes or disease, and enhanced gene pathway data content, among other features. Together, this wealth of expanded chemical-gene-disease data continues to help users generate testable hypotheses about the molecular mechanisms of environmental diseases. CTD is freely available at http://ctd.mdibl.org. © The Author(s) 2010.","authors":["Davis A.P.","King B.L.","Mockus S.","Murphy C.G.","Saraceni-Richards C.","Rosenstein M.","Wiegers T.","Mattingly C.J."],"cit_count":162,"journal":"Nucleic Acids Research","pmid":"20864448","title":"The comparative toxicogenomics database: Update 2011","year":"2011-01-01"}],"summary":{"biotoolsCURIE":"biotools:ctd","biotoolsID":"ctd","description":"Curated database about the interaction of environmental chemicals with gene products, and their effects on human health. New features include statistical analyses and analytical tools, including GeneComps and ChemComps, enriched Gene Ontology terms associated with chemicals, statistically ranked chemical-disease inferences, Venn diagram tools to discover overlapping and unique attributes of any set of chemicals, genes or disease, and enhanced gene pathway data content, among other features.","homepage":"http://ctd.mdibl.org","name":"The Comparative Toxicogenomics Database (CTD)"}}