{
    "additionDate": "2017-03-30T21:27:34Z",
    "biotoolsCURIE": "biotools:ctd",
    "biotoolsID": "ctd",
    "credit": [
        {
            "name": "Contact form",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://ctd.mdibl.org/help/contact.go;jsessionid=C268D9DF2CE71C9986EA4C2D103D54D4"
        }
    ],
    "description": "Curated database about the interaction of environmental chemicals with gene products, and their effects on human health. New features include statistical analyses and analytical tools, including GeneComps and ChemComps, enriched Gene Ontology terms associated with chemicals, statistically ranked chemical-disease inferences, Venn diagram tools to discover overlapping and unique attributes of any set of chemicals, genes or disease, and enhanced gene pathway data content, among other features.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://ctd.mdibl.org/help/;jsessionid=36B57F3336DDAD90324A8A536EB17EE0"
        },
        {
            "type": [
                "User manual"
            ],
            "url": "http://ctd.mdibl.org/help/tutorials.jsp"
        }
    ],
    "editPermission": {
        "authors": [
            "apdavis"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Chemical class enrichment",
                    "uri": "http://edamontology.org/operation_3502"
                },
                {
                    "term": "Gene prediction",
                    "uri": "http://edamontology.org/operation_2454"
                },
                {
                    "term": "Gene-set enrichment analysis",
                    "uri": "http://edamontology.org/operation_2436"
                },
                {
                    "term": "Gene expression profiling",
                    "uri": "http://edamontology.org/operation_0314"
                },
                {
                    "term": "Pathway or network prediction",
                    "uri": "http://edamontology.org/operation_3439"
                }
            ]
        }
    ],
    "homepage": "http://ctd.mdibl.org",
    "lastUpdate": "2021-02-18T18:01:27Z",
    "name": "The Comparative Toxicogenomics Database (CTD)",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "apdavis",
    "publication": [
        {
            "metadata": {
                "abstract": "The Comparative Toxicogenomics Database (CTD) is a public resource that promotes understanding about the interaction of environmental chemicals with gene products, and their effects on human health. Biocurators at CTD manually curate a triad of chemical-gene, chemical-disease and gene-disease relationships from the literature. These core data are then integrated to construct chemical-gene-disease networks and to predict many novel relationships using different types of associated data. Since 2009, we dramatically increased the content of CTD to 1.4 million chemical-gene-disease data points and added many features, statistical analyses and analytical tools, including GeneComps and ChemComps (to find comparable genes and chemicals that share toxicogenomic profiles), enriched Gene Ontology terms associated with chemicals, statistically ranked chemical-disease inferences, Venn diagram tools to discover overlapping and unique attributes of any set of chemicals, genes or disease, and enhanced gene pathway data content, among other features. Together, this wealth of expanded chemical-gene-disease data continues to help users generate testable hypotheses about the molecular mechanisms of environmental diseases. CTD is freely available at http://ctd.mdibl.org. © The Author(s) 2010.",
                "authors": [
                    {
                        "name": "Davis A.P."
                    },
                    {
                        "name": "King B.L."
                    },
                    {
                        "name": "Mockus S."
                    },
                    {
                        "name": "Murphy C.G."
                    },
                    {
                        "name": "Saraceni-Richards C."
                    },
                    {
                        "name": "Rosenstein M."
                    },
                    {
                        "name": "Wiegers T."
                    },
                    {
                        "name": "Mattingly C.J."
                    }
                ],
                "citationCount": 195,
                "date": "2011-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "The comparative toxicogenomics database: Update 2011"
            },
            "pmid": "20864448"
        },
        {
            "doi": "10.1093/nar/gkaa891",
            "metadata": {
                "abstract": "© 2021 The Author(s) 2020. Published by Oxford University Press on behalf of Nucleic Acids Research.The public Comparative Toxicogenomics Database (CTD; http://ctdbase.org/) is an innovative digital ecosystem that relates toxicological information for chemicals, genes, phenotypes, diseases, and exposures to advance understanding about human health. Literature-based, manually curated interactions are integrated to create a knowledgebase that harmonizes cross-species heterogeneous data for chemical exposures and their biological repercussions. In this biennial update, we report a 20% increase in CTD curated content and now provide 45 million toxicogenomic relationships for over 16 300 chemicals, 51 300 genes, 5500 phenotypes, 7200 diseases and 163 000 exposure events, from 600 comparative species. Furthermore, we increase the functionality of chemical-phenotype content with new data-tabs on CTD Disease pages (to help fill in knowledge gaps for environmental health) and new phenotype search parameters (for Batch Query and Venn analysis tools). As well, we introduce new CTD Anatomy pages that allow users to uniquely explore and analyze chemical-phenotype interactions from an anatomical perspective. Finally, we have enhanced CTD Chemical pages with new literature-based chemical synonyms (to improve querying) and added 1600 amino acid-based compounds (to increase chemical landscape). Together, these updates continue to augment CTD as a powerful resource for generating testable hypotheses about the etiologies and molecular mechanisms underlying environmentally influenced diseases.",
                "authors": [
                    {
                        "name": "Davis A.P."
                    },
                    {
                        "name": "Grondin C.J."
                    },
                    {
                        "name": "Johnson R.J."
                    },
                    {
                        "name": "Sciaky D."
                    },
                    {
                        "name": "Wiegers J."
                    },
                    {
                        "name": "Wiegers T.C."
                    },
                    {
                        "name": "Mattingly C.J."
                    }
                ],
                "citationCount": 32,
                "date": "2021-01-08T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "Comparative Toxicogenomics Database (CTD): Update 2021"
            },
            "pmid": "33068428"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Ontology and terminology",
            "uri": "http://edamontology.org/topic_0089"
        }
    ],
    "validated": 1
}