{
    "additionDate": "2021-01-18T08:34:04Z",
    "biotoolsCURIE": "biotools:cytomap",
    "biotoolsID": "cytomap",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "gernermy@uw.edu",
            "name": "Michael Y. Gerner",
            "typeEntity": "Person"
        }
    ],
    "description": "CytoMAP is a Spatial Analysis Toolbox Reveals Features of Myeloid Cell Organization in Lymphoid Tissues. CytoMAP is a histo-cytometric multidimensional analysis pipeline, which incorporates data clustering, positional correlation, dimensionality reduction, and 2D 3D region reconstruction to identify localized cellular networks and reveal features of tissue organization",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Dimensionality reduction",
                    "uri": "http://edamontology.org/operation_3935"
                },
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                }
            ]
        }
    ],
    "homepage": "https://gitlab.com/gernerlab/cytomap",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2021-02-22T14:00:39Z",
    "license": "MIT",
    "name": "CytoMAP",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1016/J.CELREP.2020.107523",
            "metadata": {
                "abstract": "© 2020 The Author(s)Recently developed approaches for highly multiplexed imaging have revealed complex patterns of cellular positioning and cell-cell interactions with important roles in both cellular- and tissue-level physiology. However, tools to quantitatively study cellular patterning and tissue architecture are currently lacking. Here, we develop a spatial analysis toolbox, the histo-cytometric multidimensional analysis pipeline (CytoMAP), which incorporates data clustering, positional correlation, dimensionality reduction, and 2D/3D region reconstruction to identify localized cellular networks and reveal features of tissue organization. We apply CytoMAP to study the microanatomy of innate immune subsets in murine lymph nodes (LNs) and reveal mutually exclusive segregation of migratory dendritic cells (DCs), regionalized compartmentalization of SIRPα− dermal DCs, and preferential association of resident DCs with select LN vasculature. The findings provide insights into the organization of myeloid cells in LNs and demonstrate that CytoMAP is a comprehensive analytics toolbox for revealing features of tissue organization in imaging datasets. © 2020 The Author(s)Stoltzfus et al. present CytoMAP, a spatial analytics platform that incorporates diverse statistical and visualization modules for analysis of cellular positioning, cell-cell interactions, global tissue structure, and heterogeneity of tissue microenvironments. Exploration of myeloid cell localization in lymph nodes reveals fundamental positional relationships between dendritic cell subsets and local vasculature.",
                "authors": [
                    {
                        "name": "Stoltzfus C.R."
                    },
                    {
                        "name": "Filipek J."
                    },
                    {
                        "name": "Gern B.H."
                    },
                    {
                        "name": "Olin B.E."
                    },
                    {
                        "name": "Leal J.M."
                    },
                    {
                        "name": "Wu Y."
                    },
                    {
                        "name": "Lyons-Cohen M.R."
                    },
                    {
                        "name": "Huang J.Y."
                    },
                    {
                        "name": "Paz-Stoltzfus C.L."
                    },
                    {
                        "name": "Plumlee C.R."
                    },
                    {
                        "name": "Poschinger T."
                    },
                    {
                        "name": "Urdahl K.B."
                    },
                    {
                        "name": "Perro M."
                    },
                    {
                        "name": "Gerner M.Y."
                    }
                ],
                "citationCount": 6,
                "date": "2020-04-21T00:00:00Z",
                "journal": "Cell Reports",
                "title": "CytoMAP: A Spatial Analysis Toolbox Reveals Features of Myeloid Cell Organization in Lymphoid Tissues"
            },
            "pmcid": "PMC7233132",
            "pmid": "32320656"
        }
    ],
    "toolType": [
        "Suite",
        "Workflow"
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Physiology",
            "uri": "http://edamontology.org/topic_3300"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Cytometry",
            "uri": "http://edamontology.org/topic_3934"
        }
    ]
}