{
    "additionDate": "2021-01-18T07:59:08Z",
    "biotoolsCURIE": "biotools:logojs",
    "biotoolsID": "logojs",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "zhiping.weng@umassmed.edu",
            "name": "Zhiping Weng",
            "typeEntity": "Person"
        }
    ],
    "description": "A Javascript package for creating sequence logos and embedding them in web applications.\n\nEmbeddable, customizable, and interactive sequence logos, all in Javascript.\n\nCreate Logos: paste or upload data in common formats.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Editing",
                    "uri": "http://edamontology.org/operation_3096"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "http://logojs.wenglab.org",
    "language": [
        "JavaScript"
    ],
    "lastUpdate": "2021-02-17T07:38:10Z",
    "name": "LogoJS",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAA192",
            "metadata": {
                "abstract": "© 2020 The Author(s) 2020. Published by Oxford University Press. All rights reserved. For permissions, please e-mail: journals.permissions@oup.com.Sequence logos were introduced nearly 30 years ago as a human-readable format for representing consensus sequences, and they remain widely used. As new experimental and computational techniques have developed, logos have been extended: extra symbols represent covalent modifications to nucleotides, logos with multiple letters at each position illustrate models with multi-nucleotide features and symbols extending below the x-axis may represent a binding energy penalty for a residue or a negative weight output from a neural network. Web-based visualization tools for genomic data are increasingly taking advantage of modern web technology to offer dynamic, interactive figures to users, but support for sequence logos remains limited. Here, we present LogoJS, a Javascript package for rendering customizable, interactive, vector-graphic sequence logos and embedding them in web applications. LogoJS supports all the aforementioned logo extensions and is bundled with a companion web application for creating and sharing logos. Contact: zhiping.weng@umassmed.edu",
                "authors": [
                    {
                        "name": "Pratt H."
                    },
                    {
                        "name": "Weng Z."
                    }
                ],
                "citationCount": 1,
                "date": "2020-06-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "LogoJS: A Javascript package for creating sequence logos and embedding them in web applications"
            },
            "pmcid": "PMC7267833",
            "pmid": "32181813"
        }
    ],
    "toolType": [
        "Web service"
    ],
    "topic": [
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        }
    ]
}
