{
    "additionDate": "2021-01-18T10:58:05Z",
    "biotoolsCURIE": "biotools:ssndesign",
    "biotoolsID": "ssndesign",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "arp320@uowmail.edu.au",
            "name": "Alan R. Pearse",
            "orcidid": "https://orcid.org/0000-0002-4133-8548",
            "typeEntity": "Person"
        }
    ],
    "description": "R package for pseudo-Bayesian optimal and adaptive sampling designs on stream networks.\n\nStreams and rivers are biodiverse and provide valuable ecosystem services. Maintaining these ecosystems is an important task, so organisations often monitor the status and trends in stream condition and biodiversity using field sampling and, more recently, autonomous in-situ sensors. However, data collection is often costly, so effective and efficient survey designs are crucial to maximise information while minimising costs. Geostatistics and optimal and adaptive design theory can be used to optimise the placement of sampling sites in freshwater studies and aquatic monitoring programs. Geostatistical modelling and experimental design on stream networks pose statistical challenges due to the branching structure of the network, flow connectivity and directionality, and differences in flow volume",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                }
            ]
        }
    ],
    "homepage": "https://github.com/apear9/SSNdesign",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-02-21T15:59:06Z",
    "name": "SSNdesign",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PONE.0238422",
            "metadata": {
                "abstract": "© 2020 Public Library of Science. All rights reserved.Streams and rivers are biodiverse and provide valuable ecosystem services. Maintaining these ecosystems is an important task, so organisations often monitor the status and trends in stream condition and biodiversity using field sampling and, more recently, autonomous in-situ sensors. However, data collection is often costly, so effective and efficient survey designs are crucial to maximise information while minimising costs. Geostatistics and optimal and adaptive design theory can be used to optimise the placement of sampling sites in freshwater studies and aquatic monitoring programs. Geostatistical modelling and experimental design on stream networks pose statistical challenges due to the branching structure of the network, flow connectivity and directionality, and differences in flow volume. Geostatistical models for stream network data and their unique features already exist. Some basic theory for experimental design in stream environments has also previously been described. However, open source software that makes these design methods available for aquatic scientists does not yet exist. To address this need, we present SSNdesign, an R package for solving optimal and adaptive design problems on stream networks that integrates with existing open-source software. We demonstrate the mathematical foundations of our approach, and illustrate the functionality of SSNdesign using two case studies involving real data from Queensland, Australia. In both case studies we demonstrate that the optimal or adaptive designs outperform random and spatially balanced survey designs implemented in existing open-source software packages. The SSNdesign package has the potential to boost the efficiency of freshwater monitoring efforts and provide much-needed information for freshwater conservation and management.",
                "authors": [
                    {
                        "name": "Pearse A.R."
                    },
                    {
                        "name": "McGree J.M."
                    },
                    {
                        "name": "Som N.A."
                    },
                    {
                        "name": "Leigh C."
                    },
                    {
                        "name": "Maxwell P."
                    },
                    {
                        "name": "Ver Hoef J.M."
                    },
                    {
                        "name": "Peterson E.E."
                    }
                ],
                "date": "2020-09-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "SSNdesign-An R package for pseudo- Bayesian optimal and adaptive sampling designs on stream networks"
            },
            "pmcid": "PMC7508409",
            "pmid": "32960894"
        }
    ],
    "topic": [
        {
            "term": "Biodiversity",
            "uri": "http://edamontology.org/topic_3050"
        },
        {
            "term": "Freshwater biology",
            "uri": "http://edamontology.org/topic_3573"
        },
        {
            "term": "Experimental design and studies",
            "uri": "http://edamontology.org/topic_3678"
        },
        {
            "term": "Mathematics",
            "uri": "http://edamontology.org/topic_3315"
        }
    ]
}