{
    "additionDate": "2017-08-03T19:03:10Z",
    "biotoolsCURIE": "biotools:tav4sb",
    "biotoolsID": "tav4sb",
    "credit": [
        {
            "email": "tav4sb@mimuw.edu.pl",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://groups.google.com/group/tav4sb"
        }
    ],
    "description": "This project is a simple grid environment providing a set of Web service (WS) operations, together with bundling them workflows, prepared for the Taverna Workbench. Target application area is the System Biology field, in particular, analysis of kinetic models of biological systems.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://bioputer.mimuw.edu.pl/tav4sb/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Enzyme kinetics calculation",
                    "uri": "http://edamontology.org/operation_0334"
                },
                {
                    "term": "Pathway or network analysis",
                    "uri": "http://edamontology.org/operation_2497"
                }
            ]
        }
    ],
    "homepage": "http://bioputer.mimuw.edu.pl/tav4sb/",
    "language": [
        "C",
        "Java"
    ],
    "lastUpdate": "2018-12-10T12:58:51Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/tav4sb-0-2-2-web-service-operations-analysis-kinetic-models-biological-systems.html"
        }
    ],
    "name": "Tav4SB",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Background: Progress in the modeling of biological systems strongly relies on the availability of specialized computer-aided tools. To that end, the Taverna Workbench eases integration of software tools for life science research and provides a common workflow-based framework for computational experiments in Biology.Results: The Taverna services for Systems Biology (Tav4SB) project provides a set of new Web service operations, which extend the functionality of the Taverna Workbench in a domain of systems biology. Tav4SB operations allow you to perform numerical simulations or model checking of, respectively, deterministic or stochastic semantics of biological models. On top of this functionality, Tav4SB enables the construction of high-level experiments. As an illustration of possibilities offered by our project we apply the multi-parameter sensitivity analysis. To visualize the results of model analysis a flexible plotting operation is provided as well. Tav4SB operations are executed in a simple grid environment, integrating heterogeneous software such as Mathematica, PRISM and SBML ODE Solver. The user guide, contact information, full documentation of available Web service operations, workflows and other additional resources can be found at the Tav4SB project's Web page: http://bioputer.mimuw.edu.pl/tav4sb/.Conclusions: The Tav4SB Web service provides a set of integrated tools in the domain for which Web-based applications are still not as widely available as for other areas of computational biology. Moreover, we extend the dedicated hardware base for computationally expensive task of simulating cellular models. Finally, we promote the standardization of models and experiments as well as accessibility and usability of remote services. © 2012 Rybiński et al; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Banasik P."
                    },
                    {
                        "name": "Gambin A."
                    },
                    {
                        "name": "Lasota S."
                    },
                    {
                        "name": "Lula M."
                    },
                    {
                        "name": "Rybinski M."
                    }
                ],
                "citationCount": 2,
                "date": "2012-04-05T00:00:00Z",
                "journal": "BMC Systems Biology",
                "title": "Tav4SB: integrating tools for analysis of kinetic models of biological systems"
            },
            "pmid": "22480273"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Biology",
            "uri": "http://edamontology.org/topic_3070"
        },
        {
            "term": "Drug metabolism",
            "uri": "http://edamontology.org/topic_3375"
        },
        {
            "term": "Systems biology",
            "uri": "http://edamontology.org/topic_2259"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ],
    "validated": 1
}
