{
    "additionDate": "2020-01-14T19:59:06Z",
    "biotoolsCURIE": "biotools:GEDFN",
    "biotoolsID": "GEDFN",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "xpjiang@mail.ccnu.edu.cn",
            "name": "Xingpeng Jiang",
            "typeEntity": "Person"
        }
    ],
    "description": "Graph Embedding Deep Learning Guides Microbial Biomarkers' Identification.\n\ngraph embedding deep learning guide microbial biomarkers' identification.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Pathway or network prediction",
                    "uri": "http://edamontology.org/operation_3439"
                },
                {
                    "term": "Scatter plot plotting",
                    "uri": "http://edamontology.org/operation_2940"
                }
            ]
        }
    ],
    "homepage": "https://github.com/MicroAVA/GEDFN.git",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-01-14T08:48:13Z",
    "name": "GEDFN",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.3389/FGENE.2019.01182",
            "metadata": {
                "abstract": "© Copyright © 2019 Zhu, Jiang, Zhu, Pan and He.The microbiome-wide association studies are to figure out the relationship between microorganisms and humans, with the goal of discovering relevant biomarkers to guide disease diagnosis. However, the microbiome data is complex, with high noise and dimensions. Traditional machine learning methods are limited by the models' representation ability and cannot learn complex patterns from the data. Recently, deep learning has been widely applied to fields ranging from text processing to image recognition due to its efficient flexibility and high capacity. But the deep learning models must be trained with enough data in order to achieve good performance, which is impractical in reality. In addition, deep learning is considered as black box and hard to interpret. These factors make deep learning not widely used in microbiome-wide association studies. In this work, we construct a sparse microbial interaction network and embed this graph into deep model to alleviate the risk of overfitting and improve the performance. Further, we explore a Graph Embedding Deep Feedforward Network (GEDFN) to conduct feature selection and guide meaningful microbial markers' identification. Based on the experimental results, we verify the feasibility of combining the microbial graph model with the deep learning model, and demonstrate the feasibility of applying deep learning and feature selection on microbial data. Our main contributions are: firstly, we utilize different methods to construct a variety of microbial interaction networks and combine the network via graph embedding deep learning. Secondly, we introduce a feature selection method based on graph embedding and validate the biological meaning of microbial markers. The code is available at https://github.com/MicroAVA/GEDFN.git.",
                "authors": [
                    {
                        "name": "Zhu Q."
                    },
                    {
                        "name": "Jiang X."
                    },
                    {
                        "name": "Zhu Q."
                    },
                    {
                        "name": "Pan M."
                    },
                    {
                        "name": "He T."
                    }
                ],
                "citationCount": 2,
                "date": "2019-11-22T00:00:00Z",
                "journal": "Frontiers in Genetics",
                "title": "Graph Embedding Deep Learning Guides Microbial Biomarkers' Identification"
            },
            "pmcid": "PMC6883002",
            "pmid": "31824573"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Microbial ecology",
            "uri": "http://edamontology.org/topic_3697"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        }
    ],
    "validated": 1
}