{
    "additionDate": "2021-03-19T09:05:27Z",
    "biotoolsCURIE": "biotools:isomir",
    "biotoolsID": "isomir",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "andreiaamaral@fmv.ulisboa.pt",
            "name": "Andreia J. Amaral",
            "orcidid": "https://orcid.org/0000-0003-0958-5570",
            "typeEntity": "Person"
        }
    ],
    "description": "A system for analyzing small-RNA-seq data in an integrative and user-friendly manner.\n\nThe IsomiR Window project is a user-friendly tool that enables biologists to perform the analysis of small-RNA-seq data, uncovering the complexity of miRNA biogenesis.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "RNA-Seq quantification",
                    "uri": "http://edamontology.org/operation_3800"
                },
                {
                    "term": "Sequence trimming",
                    "uri": "http://edamontology.org/operation_3192"
                },
                {
                    "term": "miRNA expression analysis",
                    "uri": "http://edamontology.org/operation_3792"
                },
                {
                    "term": "miRNA target prediction",
                    "uri": "http://edamontology.org/operation_0463"
                }
            ]
        }
    ],
    "homepage": "https://isomir.fc.ul.pt/",
    "lastUpdate": "2021-04-05T08:13:23Z",
    "name": "IsomiR",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1186/S12859-021-03955-6",
            "metadata": {
                "abstract": "© 2021, The Author(s).Background: IsomiRs are miRNA variants that vary in length and/or sequence when compared to their canonical forms. These variants display differences in length and/or sequence, including additions or deletions of one or more nucleotides (nts) at the 5′ and/or 3′ end, internal editings or untemplated 3′ end additions. Most available tools for small RNA-seq data analysis do not allow the identification of isomiRs and often require advanced knowledge of bioinformatics. To overcome this, we have developed IsomiR Window, a platform that supports the systematic identification, quantification and functional exploration of isomiR expression in small RNA-seq datasets, accessible to users with no computational skills. Methods: IsomiR Window enables the discovery of isomiRs and identification of all annotated non-coding RNAs in RNA-seq datasets from animals and plants. It comprises two main components: the IsomiR Window pipeline for data processing; and the IsomiR Window Browser interface. It integrates over ten third-party softwares for the analysis of small-RNA-seq data and holds a new algorithm that allows the detection of all possible types of isomiRs. These include 3′ and 5′end isomiRs, 3′ end tailings, isomiRs with single nucleotide polymorphisms (SNPs) or potential RNA editings, as well as all possible fuzzy combinations. IsomiR Window includes all required databases for analysis and annotation, and is freely distributed as a Linux virtual machine, including all required software. Results: IsomiR Window processes several datasets in an automated manner, without restrictions of input file size. It generates high quality interactive figures and tables which can be exported into different formats. The performance of isomiR detection and quantification was assessed using simulated small-RNA-seq data. For correctly mapped reads, it identified different types of isomiRs with high confidence and 100% accuracy. The analysis of a small RNA-seq data from Basal Cell Carcinomas (BCCs) using isomiR Window confirmed that miR-183-5p is up-regulated in Nodular BCCs, but revealed that this effect was predominantly due to a novel 5′end variant. This variant displays a different seed region motif and 1756 isoform-exclusive mRNA targets that are significantly associated with disease pathways, underscoring the biological relevance of isomiR-focused analysis. IsomiR Window is available at https://isomir.fc.ul.pt/.",
                "authors": [
                    {
                        "name": "Amaral A.J."
                    },
                    {
                        "name": "Carmo M.B."
                    },
                    {
                        "name": "Ferreira A."
                    },
                    {
                        "name": "Ferreira B."
                    },
                    {
                        "name": "Gama-Carvalho M."
                    },
                    {
                        "name": "Vasconcelos A.M."
                    },
                    {
                        "name": "Viegas I."
                    }
                ],
                "date": "2021-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "IsomiR_Window: a system for analyzing small-RNA-seq data in an integrative and user-friendly manner"
            },
            "pmcid": "PMC7852101",
            "pmid": "33522913"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ]
}
