{
    "accessibility": "Open access",
    "additionDate": "2024-02-05T15:16:19.598987Z",
    "biotoolsCURIE": "biotools:dbpmod",
    "biotoolsID": "dbpmod",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "prabina.meher@icar.gov.in",
            "name": "Prabina K Meher",
            "typeEntity": "Person"
        },
        {
            "name": "Upendra K Pradhan",
            "typeEntity": "Person"
        }
    ],
    "description": "Supervised learning model for computational recognition of DNA-binding proteins in model organisms.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "DNA-binding protein prediction",
                    "uri": "http://edamontology.org/operation_3900"
                },
                {
                    "term": "Protein modelling",
                    "uri": "http://edamontology.org/operation_0477"
                }
            ]
        }
    ],
    "homepage": "https://iasri-sg.icar.gov.in/dbpmod/",
    "lastUpdate": "2024-11-24T14:17:48.723061Z",
    "name": "DBPMod",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/bfgp/elad039",
            "metadata": {
                "abstract": "DNA-binding proteins (DBPs) play critical roles in many biological processes, including gene expression, DNA replication, recombination and repair. Understanding the molecular mechanisms underlying these processes depends on the precise identification of DBPs. In recent times, several computational methods have been developed to identify DBPs. However, because of the generic nature of the models, these models are unable to identify species-specific DBPs with higher accuracy. Therefore, a species-specific computational model is needed to predict species-specific DBPs. In this paper, we introduce the computational DBPMod method, which makes use of a machine learning approach to identify species-specific DBPs. For prediction, both shallow learning algorithms and deep learning models were used, with shallow learning models achieving higher accuracy. Additionally, the evolutionary features outperformed sequence-derived features in terms of accuracy. Five model organisms, including Caenorhabditis elegans, Drosophila melanogaster, Escherichia coli, Homo sapiens and Mus musculus, were used to assess the performance of DBPMod. Five-fold cross-validation and independent test set analyses were used to evaluate the prediction accuracy in terms of area under receiver operating characteristic curve (auROC) and area under precision-recall curve (auPRC), which was found to be ~89-92% and ~89-95%, respectively. The comparative results demonstrate that the DBPMod outperforms 12 current state-of-the-art computational approaches in identifying the DBPs for all five model organisms. We further developed the web server of DBPMod to make it easier for researchers to detect DBPs and is publicly available at https://iasri-sg.icar.gov.in/dbpmod/. DBPMod is expected to be an invaluable tool for discovering DBPs, supplementing the current experimental and computational methods.",
                "authors": [
                    {
                        "name": "Agarwal A."
                    },
                    {
                        "name": "Gupta A."
                    },
                    {
                        "name": "Meher P.K."
                    },
                    {
                        "name": "Naha S."
                    },
                    {
                        "name": "Parsad R."
                    },
                    {
                        "name": "Pradhan U.K."
                    },
                    {
                        "name": "Sharma N.K."
                    }
                ],
                "citationCount": 4,
                "date": "2024-07-01T00:00:00Z",
                "journal": "Briefings in Functional Genomics",
                "title": "DBPMod: A supervised learning model for computational recognition of DNA-binding proteins in model organisms"
            },
            "pmid": "37651627"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        }
    ]
}
