{
    "additionDate": "2021-01-18T07:11:36Z",
    "biotoolsCURIE": "biotools:osbrca",
    "biotoolsID": "osbrca",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "xqguo@henu.edu.cn",
            "name": "Xiangqian Guo",
            "typeEntity": "Person"
        }
    ],
    "description": "A Web Server for Breast Cancer Prognostic Biomarker Investigation With Massive Data From Tens of Cohorts.\n\nPotential prognostic mRNA biomarkers are exploited to assist in the clinical management and treatment of breast cancer, which is the first life-threatening tumor in women worldwide. However, it is technically challenging for untrained researchers to process high dimensional profiling data to screen and validate the potential prognostic values of genes of interests in multiple cohorts. Our aim is to develop an easy-to-use web server to facilitate the screening, developing, and evaluating of prognostic biomarkers in breast cancers",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                },
                {
                    "term": "Incident curve plotting",
                    "uri": "http://edamontology.org/operation_3503"
                },
                {
                    "term": "Validation",
                    "uri": "http://edamontology.org/operation_2428"
                }
            ]
        }
    ],
    "homepage": "http://bioinfo.henu.edu.cn/BRCA/BRCAList.jsp",
    "lastUpdate": "2021-03-15T09:37:08Z",
    "name": "OSbrca",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.3389/FONC.2019.01349",
            "metadata": {
                "abstract": "© Copyright © 2019 Yan, Wang, Sun, Ban, Lu, Dang, Xie, Zhang, Li, Zhu and Guo.Potential prognostic mRNA biomarkers are exploited to assist in the clinical management and treatment of breast cancer, which is the first life-threatening tumor in women worldwide. However, it is technically challenging for untrained researchers to process high dimensional profiling data to screen and validate the potential prognostic values of genes of interests in multiple cohorts. Our aim is to develop an easy-to-use web server to facilitate the screening, developing, and evaluating of prognostic biomarkers in breast cancers. Herein, we collected more than 7,400 cases of breast cancer with gene expression profiles and clinical follow-up information from The Cancer Genome Atlas and Gene Expression Omnibus data, and built an Online consensus Survival analysis web server for Breast Cancers, abbreviated OSbrca, to generate the Kaplan–Meier survival plot with a hazard ratio and log rank P-value for given genes in an interactive way. To examine the performance of OSbrca, the prognostic potency of 128 previously published biomarkers of breast cancer was reassessed in OSbrca. In conclusion, it is highly valuable for biologists and clinicians to perform the preliminary assessment and validation of novel or putative prognostic biomarkers for breast cancers. OSbrca could be accessed at http://bioinfo.henu.edu.cn/BRCA/BRCAList.jsp.",
                "authors": [
                    {
                        "name": "Ban B."
                    },
                    {
                        "name": "Dang Y."
                    },
                    {
                        "name": "Guo X."
                    },
                    {
                        "name": "Li Y."
                    },
                    {
                        "name": "Lu Z."
                    },
                    {
                        "name": "Sun X."
                    },
                    {
                        "name": "Wang Q."
                    },
                    {
                        "name": "Xie L."
                    },
                    {
                        "name": "Yan Z."
                    },
                    {
                        "name": "Zhang L."
                    },
                    {
                        "name": "Zhu W."
                    }
                ],
                "citationCount": 9,
                "date": "2019-12-20T00:00:00Z",
                "journal": "Frontiers in Oncology",
                "title": "OSbrca: A Web Server for Breast Cancer Prognostic Biomarker Investigation With Massive Data From Tens of Cohorts"
            },
            "pmcid": "PMC6932997",
            "pmid": "31921624"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        }
    ]
}
