{
    "accessibility": "Open access",
    "additionDate": "2024-05-06T09:44:15.356939Z",
    "biotoolsCURIE": "biotools:migrene",
    "biotoolsID": "migrene",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "gholamreza.bidhkori@kcl.ac.uk",
            "name": "Gholamreza Bidkhori",
            "typeEntity": "Person"
        },
        {
            "email": "saeed.shoaie@kcl.ac.uk",
            "name": "Saeed Shoaie",
            "typeEntity": "Person"
        }
    ],
    "description": "The toolbox for microbial and individualized GEMs, reactobiome and community network modelling.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Metabolic network modelling",
                    "uri": "http://edamontology.org/operation_3660"
                },
                {
                    "term": "Metabolic pathway prediction",
                    "uri": "http://edamontology.org/operation_3929"
                }
            ]
        }
    ],
    "homepage": "https://github.com/sysbiomelab/MIGRENE",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2024-11-24T14:01:24.773162Z",
    "name": "MIGRENE",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.3390/metabo14030132",
            "metadata": {
                "abstract": "Understanding microbial metabolism is crucial for evaluating shifts in human host–microbiome interactions during periods of health and disease. However, the primary hurdle in the realm of constraint-based modeling and genome-scale metabolic models (GEMs) pertaining to host–microbiome interactions lays in the efficient utilization of metagenomic data for constructing GEMs that encompass unexplored and uncharacterized genomes. Challenges persist in effectively employing metagenomic data to address individualized microbial metabolisms to investigate host–microbiome interactions. To tackle this issue, we have created a computational framework designed for personalized microbiome metabolisms. This framework takes into account factors such as microbiome composition, metagenomic species profiles and microbial gene catalogues. Subsequently, it generates GEMs at the microbial level and individualized microbiome metabolisms, including reaction richness, reaction abundance, reactobiome, individualized reaction set enrichment (iRSE), and community models. Using the toolbox, our findings revealed a significant reduction in both reaction richness and GEM richness in individuals with liver cirrhosis. The study highlighted a potential link between the gut microbiota and liver cirrhosis, i.e., increased level of LPS, ammonia production and tyrosine metabolism on liver cirrhosis, emphasizing the importance of microbiome-related factors in liver health.",
                "authors": [
                    {
                        "name": "Bidkhori G."
                    },
                    {
                        "name": "Shoaie S."
                    }
                ],
                "citationCount": 4,
                "date": "2024-03-01T00:00:00Z",
                "journal": "Metabolites",
                "title": "MIGRENE: The Toolbox for Microbial and Individualized GEMs, Reactobiome and Community Network Modelling"
            },
            "pmcid": "PMC10972203",
            "pmid": "38535292"
        }
    ],
    "toolType": [
        "Workflow"
    ],
    "topic": [
        {
            "term": "Endocrinology and metabolism",
            "uri": "http://edamontology.org/topic_3407"
        },
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "Microbial ecology",
            "uri": "http://edamontology.org/topic_3697"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ]
}
