
{
    "credit": [
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Metabolic network modelling",
                    "uri": "http://edamontology.org/operation_3660"
                },
                {
                    "term": "Haplotype mapping",
                    "uri": "http://edamontology.org/operation_0487"
                },
                {
                    "term": "Ancestral reconstruction",
                    "uri": "http://edamontology.org/operation_3745"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "C++",
            "Python"
        ],
        "license": "Apache-2.0",
        "topic": [
            {
                "term": "Machine learning",
                "uri": "http://edamontology.org/topic_3474"
            },
            {
                "term": "Tomography",
                "uri": "http://edamontology.org/topic_3452"
            },
            {
                "term": "Medical imaging",
                "uri": "http://edamontology.org/topic_3384"
            }
        ]
    },
    "link": [
        {
            "type": "REPOSITORY",
            "url": "https://github.com/csyben/PYRO-NN-Layers"
        }
    ],
    "publication": [
        {
            "abstract": "© 2019 The Authors. Medical Physics published by Wiley Periodicals, Inc. on behalf of American Association of Physicists in MedicinePurpose: Recently, several attempts were conducted to transfer deep learning to medical image reconstruction. An increasingly number of publications follow the concept of embedding the computed tomography (CT) reconstruction as a known operator into a neural network. However, most of the approaches presented lack an efficient CT reconstruction framework fully integrated into deep learning environments. As a result, many approaches use workarounds for mathematically unambiguously solvable problems. Methods: PYRO-NN is a generalized framework to embed known operators into the prevalent deep learning framework Tensorflow. The current status includes state-of-the-art parallel-, fan-, and cone-beam projectors, and back-projectors accelerated with CUDA provided as Tensorflow layers. On top, the framework provides a high-level Python API to conduct FBP and iterative reconstruction experiments with data from real CT systems. Results: The framework provides all necessary algorithms and tools to design end-to-end neural network pipelines with integrated CT reconstruction algorithms. The high-level Python API allows a simple use of the layers as known from Tensorflow. All algorithms and tools are referenced to a scientific publication and are compared to existing non-deep learning reconstruction frameworks. To demonstrate the capabilities of the layers, the framework comes with baseline experiments, which are described in the supplementary material. The framework is available as open-source software under the Apache 2.0 licence at https://github.com/csyben/PYRO-NN. Conclusions: PYRO-NN comes with the prevalent deep learning framework Tensorflow and allows to setup end-to-end trainable neural networks in the medical image reconstruction context. We believe that the framework will be a step toward reproducible research and give the medical physics community a toolkit to elevate medical image reconstruction with new deep learning techniques.",
            "authors": [
                "Syben C.",
                "Michen M.",
                "Stimpel B.",
                "Seitz S.",
                "Ploner S.",
                "Maier A.K."
            ],
            "cit_count": 0,
            "doi": "10.1002/MP.13753",
            "journal": "Medical Physics",
            "pmid": "31389023",
            "title": "Technical Note: PYRO-NN: Python reconstruction operators in neural networks",
            "year": "2019-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:PYRO-NN",
        "biotoolsID": "PYRO-NN",
        "description": "> CORRECT NAME OF TOOL COULD ALSO BE 'CONCLUSIONS:PYRO-NN', 'METHODS:PYRO-NN' | Python reconstruction operators in neural networks | Python Reconstruction Operators in Neural Networks. High level python API for PYRO-NN-Layers | Implementation of reconstruction operators in CUDA for Tensorflow for the PYRO-NN Framework | Python Reconstruction Operators in Machine Learning (PYRO-NN-Layers) brings state-of-the-art reconstruction algorithms to neural networks integrated into Tensorflow. This repository contains the actual Layer implementation as CUDA kernels and the necessary C++ information control classes according to the Tensorflow API | At this point the geometry is fully setup and can be used to create projections and reconstructions",
        "homepage": "https://github.com/csyben/PYRO-NN",
        "name": "PYRO-NN"
    }
}