{
    "additionDate": "2021-10-04T08:53:39.689505Z",
    "biotoolsCURIE": "biotools:jorg",
    "biotoolsID": "jorg",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "aparkin@lbl.gov",
            "name": "Adam P. Arkin",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Jorg is a method for achieving complete microbial genomes and improving bins from metagenomics data. This is a method to help circularize genomes from shotgun metagenomics data. It is MAG circularization method.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "De-novo assembly",
                    "uri": "http://edamontology.org/operation_0524"
                },
                {
                    "term": "Genome assembly",
                    "uri": "http://edamontology.org/operation_0525"
                },
                {
                    "term": "Read binning",
                    "uri": "http://edamontology.org/operation_3798"
                },
                {
                    "term": "Scaffolding",
                    "uri": "http://edamontology.org/operation_3216"
                },
                {
                    "term": "Sequence trimming",
                    "uri": "http://edamontology.org/operation_3192"
                }
            ]
        }
    ],
    "homepage": "https://github.com/lmlui/Jorg",
    "language": [
        "Shell"
    ],
    "lastUpdate": "2024-11-24T20:18:31.828124Z",
    "license": "GPL-3.0",
    "name": "Jorg",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1371/journal.pcbi.1008972",
            "metadata": {
                "abstract": "Metagenomics facilitates the study of the genetic information from uncultured microbes and complex microbial communities. Assembling complete genomes from metagenomics data is difficult because most samples have high organismal complexity and strain diversity. Some studies have attempted to extract complete bacterial, archaeal, and viral genomes and often focus on species with circular genomes so they can help confirm completeness with circularity. However, less than 100 circularized bacterial and archaeal genomes have been assembled and published from metagenomics data despite the thousands of datasets that are available. Circularized genomes are important for (1) building a reference collection as scaffolds for future assemblies, (2) providing complete gene content of a genome, (3) confirming little or no contamination of a genome, (4) studying the genomic context and synteny of genes, and (5) linking protein coding genes to ribosomal RNA genes to aid metabolic inference in 16S rRNA gene sequencing studies. We developed a semi-automated method called Jorg to help circularize small bacterial, archaeal, and viral genomes using iterative assembly, binning, and read mapping. In addition, this method exposes potential misassemblies from k-mer based assemblies. We chose species of the Candidate Phyla Radiation (CPR) to focus our initial efforts because they have small genomes and are only known to have one ribosomal RNA operon. In addition to 34 circular CPR genomes, we present one circular Margulisbacteria genome, one circular Chloroflexi genome, and two circular megaphage genomes from 19 public and published datasets. We demonstrate findings that would likely be difficult without circularizing genomes, including that ribosomal genes are likely not operonic in the majority of CPR, and that some CPR harbor diverged forms of RNase P RNA. Code and a tutorial for this method is available at https://github.com/lmlui/ Jorg and is available on the DOE Systems Biology KnowledgeBase as a beta app.",
                "authors": [
                    {
                        "name": "Arkin A.P."
                    },
                    {
                        "name": "Lui L.M."
                    },
                    {
                        "name": "Nielsen T.N."
                    }
                ],
                "citationCount": 22,
                "date": "2021-05-01T00:00:00Z",
                "journal": "PLoS Computational Biology",
                "title": "A method for achieving complete microbial genomes and improving bins from metagenomics data"
            },
            "pmcid": "PMC8172020",
            "pmid": "33961626",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Gene structure",
            "uri": "http://edamontology.org/topic_0114"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        }
    ]
}
