{
    "additionDate": "2020-01-14T20:17:09Z",
    "biotoolsCURIE": "biotools:AutoEncoder",
    "biotoolsID": "AutoEncoder",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "aidong@virginia.edu",
            "name": "Aidong Zhang",
            "typeEntity": "Person"
        }
    ],
    "description": "Integrate multi-omics data with biological interaction networks using Multi-view Factorization AutoEncoder (MAE).",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Pathway or network prediction",
                    "uri": "http://edamontology.org/operation_3439"
                },
                {
                    "term": "Protein interaction prediction",
                    "uri": "http://edamontology.org/operation_2492"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "https://github.com/BeautyOfWeb/Multiview-AutoEncoder",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-01-14T16:10:43Z",
    "license": "MIT",
    "name": "AutoEncoder",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12864-019-6285-X",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Comprehensive molecular profiling of various cancers and other diseases has generated vast amounts of multi-omics data. Each type of-omics data corresponds to one feature space, such as gene expression, miRNA expression, DNA methylation, etc. Integrating multi-omics data can link different layers of molecular feature spaces and is crucial to elucidate molecular pathways underlying various diseases. Machine learning approaches to mining multi-omics data hold great promises in uncovering intricate relationships among molecular features. However, due to the \"big p, small n\" problem (i.e., small sample sizes with high-dimensional features), training a large-scale generalizable deep learning model with multi-omics data alone is very challenging. Results: We developed a method called Multi-view Factorization AutoEncoder (MAE) with network constraints that can seamlessly integrate multi-omics data and domain knowledge such as molecular interaction networks. Our method learns feature and patient embeddings simultaneously with deep representation learning. Both feature representations and patient representations are subject to certain constraints specified as regularization terms in the training objective. By incorporating domain knowledge into the training objective, we implicitly introduced a good inductive bias into the machine learning model, which helps improve model generalizability. We performed extensive experiments on the TCGA datasets and demonstrated the power of integrating multi-omics data and biological interaction networks using our proposed method for predicting target clinical variables. Conclusions: To alleviate the overfitting problem in deep learning on multi-omics data with the \"big p, small n\" problem, it is helpful to incorporate biological domain knowledge into the model as inductive biases. It is very promising to design machine learning models that facilitate the seamless integration of large-scale multi-omics data and biomedical domain knowledge for uncovering intricate relationships among molecular features and clinical features.",
                "authors": [
                    {
                        "name": "Ma T."
                    },
                    {
                        "name": "Zhang A."
                    }
                ],
                "citationCount": 12,
                "date": "2019-12-20T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "Integrate multi-omics data with biological interaction networks using Multi-view Factorization AutoEncoder (MAE)"
            },
            "pmcid": "PMC6923820",
            "pmid": "31856727"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        },
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ],
    "validated": 1
}
