{"credit":[{"name":"Division of Cancer Epidemiology and Genetics (DCEG), NCI","typeEntity":"Person","typeRoles":["Primary contact"],"url":"https://dceg.cancer.gov/about/contact-dceg"},{"email":"zhangh12@mail.nih.gov","name":"Han Zhang","typeEntity":"Person","typeRoles":["Primary contact"]},{"email":"yuk@mail.nih.gov","name":"Kai Yu","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"https://cran.r-project.org/web/packages/ARTP2/"},{"type":"GENERAL","url":"https://github.com/zhangh12/ARTP2"}],"download":[{"url":"https://dceg.cancer.gov/tools/analysis/artp/ARTP2_0.9.28.tar.gz"}],"function":[{"operation":[{"term":"Pathway or network analysis","uri":"http://edamontology.org/operation_2497"}]}],"labels":{"operatingSystem":["Linux","Windows","Mac"],"toolType":["Library","Web application"],"topic":[{"term":"Genetics","uri":"http://edamontology.org/topic_3053"},{"term":"GWAS study","uri":"http://edamontology.org/topic_3517"},{"term":"DNA polymorphism","uri":"http://edamontology.org/topic_2885"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/artp-2-0-2-gene-pathway-p-values-computed-adaptive-rank-truncated-product.html"},{"type":"OTHER","url":"https://analysistools.nci.nih.gov/pathway/"},{"type":"REPOSITORY","url":"https://github.com/zhangh12/ARTP2"}],"publication":[{"abstract":"Genome-wide association studies (GWAS) focus on relatively few highly significant loci, whereas less attention is given to other genotyped markers. Using pathway analysis to study existing GWAS data may shed light on relevant biological processes and illuminate new candidate genes. We applied a pathway-based approach to the breast cancer GWAS data of the National Cancer Institute (NCI) Cancer Genetic Markers of Susceptibility project that includes 1,145 cases and 1,142 controls. Pathways were retrieved from three databases: KEGG, BioCarta, and NCI Protein Interaction Database. Genes were represented by their most strongly associated SNP, and an enrichment score reflecting the overrepresentation of gene-based association signals in each pathway was calculated by using a weighted Kolmogorov-Smirnov procedure. Finally, hierarchical clustering was used to identify pathways with overlapping genes, and clusters with an excess of association signals were determined by the adaptive rank-truncated product (ARTP) method. A total of 421 pathways containing 3,962 genes was included in our study. Of these, three pathways (syndecan-1-mediated signaling, signaling of hepatocyte growth factor receptor, and growth hormone signaling) were highly enriched with association signals [PES < 0.001, false discovery rate (FDR) = 0.118]. Our clustering analysis revealed that pathways containing key components of the RAS/RAF/mitogen-activated protein kinase canonical signaling cascade were significantly more likely to have an excess of association signals than expected by chance (PARTP = 0.0051, FDR = 0.07). These results suggest that genetic alterations associated with these three pathways and one canonical signaling cascade may contribute to breast cancer susceptibility. ©2010 AACR.","authors":["Menashe I.","Maeder D.","Garcia-Closas M.","Figueroa J.D.","Bhattacharjee S.","Rotunno M.","Kraft P.","Hunter D.J.","Chanock S.J.","Rosenberg P.S.","Chatterjee N."],"cit_count":79,"journal":"Cancer Research","pmid":"20460509","title":"Pathway analysis of breast cancer genome-wide association study highlights three pathways and one canonical signaling cascade","year":"2010-06-01"}],"summary":{"biotoolsCURIE":"biotools:artp2","biotoolsID":"artp2","description":"Adaptive Rank Truncated Product is an R package for analyzing pre-defined genetic pathway based on a genetic association study.","homepage":"http://dceg.cancer.gov/tools/analysis/artp","name":"ARTP2"}}