{
    "additionDate": "2017-08-03T18:46:59Z",
    "biotoolsCURIE": "biotools:indel-seq-gen",
    "biotoolsID": "indel-seq-gen",
    "credit": [
        {
            "email": "corystrope@gmail.com",
            "name": "Cory L. Strope",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://bioinfolab.unl.edu/~cstrope/"
        }
    ],
    "description": "Biological sequence simulation program that simulates highly divergent DNA sequences and protein superfamilies. This is accomplished through the addition of subsequence length constraints and lineage- and site-specific evolution.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://bioinfolab.unl.edu/~cstrope/iSG/iSGv2_manual.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Modelling and simulation",
                    "uri": "http://edamontology.org/operation_2426"
                }
            ]
        }
    ],
    "homepage": "http://bioinfolab.unl.edu/~cstrope/iSG/",
    "language": [
        "C++"
    ],
    "lastUpdate": "2018-12-10T12:58:56Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/indel-seq-gen-2-1-03-simulates-highly-divergent-dna-sequences-protein-superfamilies.html"
        }
    ],
    "name": "indel-Seq-Gen",
    "operatingSystem": [
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Sequence simulation is an important tool in validating biological hypotheses as well as testing various bioinformatics and molecular evolutionary methods. Hypothesis testing relies on the representational ability of the sequence simulation method. Simple hypotheses are testable through simulation of random, homogeneously evolving sequence sets. However, testing complex hypotheses, for example, local similarities, requires simulation of sequence evolution under heterogeneous models. To this end, we previously introduced indel-Seq-Gen version 1.0 (iSGv1.0; indel, insertion/deletion). iSGv1.0 allowed heterogeneous protein evolution and motif conservation as well as insertion and deletion constraints in subsequences. Despite these advances, for complex hypothesis testing, neither iSGv1.0 nor other currently available sequence simulation methods is sufficient. indel-Seq-Gen version 2.0 (iSGv2.0) aims at simulating evolution of highly divergent DNA sequences and protein superfamilies. iSGv2.0 improves upon iSGv1.0 through the addition of lineage-specific evolution, motif conservation using PROSITE-like regular expressions, indel tracking, subsequence-length constraints, as well as coding and noncoding DNA evolution. Furthermore, we formalize the sequence representation used for iSGv2.0 and uncover a flaw in the modeling of indels used in current state of the art methods, which biases simulation results for hypotheses involving indels. We fix this flaw in iSGv2.0 by using a novel discrete stepping procedure. Finally, we present an example simulation of the calycin-superfamily sequences and compare the performance of iSGv2.0 with iSGv1.0 and random model of sequence evolution.",
                "authors": [
                    {
                        "name": "Abel K."
                    },
                    {
                        "name": "Moriyama E.N."
                    },
                    {
                        "name": "Scott S.D."
                    },
                    {
                        "name": "Strope C.L."
                    }
                ],
                "citationCount": 40,
                "date": "2009-11-01T00:00:00Z",
                "journal": "Molecular Biology and Evolution",
                "title": "Biological sequence simulation for testing complex evolutionary hypotheses: Indel-seq-gen version 2.0"
            },
            "pmid": "19651852"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Evolutionary biology",
            "uri": "http://edamontology.org/topic_3299"
        },
        {
            "term": "Nucleic acids",
            "uri": "http://edamontology.org/topic_0077"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        }
    ],
    "validated": 1
}
