{
    "additionDate": "2021-01-18T08:41:48Z",
    "biotoolsCURIE": "biotools:ppigremlin",
    "biotoolsID": "ppigremlin",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "felippe.queiroz@ufv.br",
            "name": "Felippe C. Queiroz",
            "typeEntity": "Person"
        }
    ],
    "description": "a graph mining based detection of conserved structural arrangements in protein-protein interfaces.\n\nThis document describes how run ppiGReMLIN. ppiGReMLIN is a scalable graph based strategy which models.\n\nprotein-protein interfaces as graphs.\n\nBackground: Protein-protein interactions (PPIs) are fundamental in many biological processes and understanding these interactions is key for a myriad of applications including drug development, peptide design and identification of drug targets.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein interaction prediction",
                    "uri": "http://edamontology.org/operation_2492"
                },
                {
                    "term": "Protein-protein binding site prediction",
                    "uri": "http://edamontology.org/operation_2464"
                },
                {
                    "term": "Protein-protein docking",
                    "uri": "http://edamontology.org/operation_3899"
                }
            ]
        }
    ],
    "homepage": "https://ppigremlin.github.io/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-01-27T16:17:40Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/ppigremlin/ppiGremlin"
        }
    ],
    "name": "ppiGReMLIN",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1186/S12859-020-3474-1",
            "metadata": {
                "abstract": "© 2020 The Author(s).Background: Protein-protein interactions (PPIs) are fundamental in many biological processes and understanding these interactions is key for a myriad of applications including drug development, peptide design and identification of drug targets. The biological data deluge demands efficient and scalable methods to characterize and understand protein-protein interfaces. In this paper, we present ppiGReMLIN, a graph based strategy to infer interaction patterns in a set of protein-protein complexes. Our method combines an unsupervised learning strategy with frequent subgraph mining in order to detect conserved structural arrangements (patterns) based on the physicochemical properties of atoms on protein interfaces. To assess the ability of ppiGReMLIN to point out relevant conserved substructures on protein-protein interfaces, we compared our results to experimentally determined patterns that are key for protein-protein interactions in 2 datasets of complexes, Serine-protease and BCL-2. Results: PpiGReMLIN was able to detect, in an automatic fashion, conserved structural arrangements that represent highly conserved interactions at the specificity binding pocket of trypsin and trypsin-like proteins from Serine-protease dataset. Also, for the BCL-2 dataset, our method pointed out conserved arrangements that include critical residue interactions within the conserved motif LXXXXD, pivotal to the binding specificity of BH3 domains of pro-apoptotic BCL-2 proteins towards apoptotic suppressors. Quantitatively, ppiGReMLIN was able to find all of the most relevant residues described in literature for our datasets, showing precision of at least 69% up to 100% and recall of 100%. Conclusions: PpiGReMLIN was able to find highly conserved structures on the interfaces of protein-protein complexes, with minimum support value of 60%, in datasets of similar proteins. We showed that the patterns automatically detected on protein interfaces by our method are in agreement with interaction patterns described in the literature.",
                "authors": [
                    {
                        "name": "Comarela G.V."
                    },
                    {
                        "name": "Oliveira M.G.A."
                    },
                    {
                        "name": "Queiroz F.C."
                    },
                    {
                        "name": "Silveira S.A."
                    },
                    {
                        "name": "Vargas A.M.P."
                    }
                ],
                "citationCount": 1,
                "date": "2020-04-15T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "PpiGReMLIN: A graph mining based detection of conserved structural arrangements in protein-protein interfaces"
            },
            "pmcid": "PMC7158050",
            "pmid": "32293241"
        }
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Protein folding, stability and design",
            "uri": "http://edamontology.org/topic_0130"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "Sequence sites, features and motifs",
            "uri": "http://edamontology.org/topic_0160"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
