
{
    "credit": [
        {
            "email": "msingh@cs.princeton.edu",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Motif search",
                    "uri": "http://edamontology.org/operation_0239"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Search",
                    "uri": "http://edamontology.org/operation_2421"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "DNA binding sites",
                "uri": "http://edamontology.org/topic_3125"
            },
            {
                "term": "DNA",
                "uri": "http://edamontology.org/topic_0654"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://www.mybiosoftware.com/motifsearch-200502-search-for-dna-binding-sites.html"
        }
    ],
    "publication": [
        {
            "abstract": "Motivation: An important step in unravelling the transcriptional regulatory network of an organism is to identify, for each transcription factor, all of its DNA binding sites. Several approaches are commonly used in searching for a transcription factor's binding sites, including consensus sequences and position-specific scoring matrices. In addition, methods that compute the average number of nucleotide matches between a putative site and all known sites can be employed. Such basic approaches can all be naturally extended by incorporating pairwise nucleotide dependencies and per-position information content. In this paper, we evaluate the effectiveness of these basic approaches and their extensions in finding binding sites for a transcription factor of interest without erroneously identifying other genomic sequences. Results: In cross-validation testing on a dataset of Escherichia coli transcription factors and their binding sites, we show that there are statistically significant differences in how well various methods identify transcription factor binding sites. The use of per-position information content improves the performance of all basic approaches. Furthermore, including local pairwise nucleotide dependencies within binding site models results in statistically significant performance improvements for approaches based on nucleotide matches. Based on our analysis, the best results when searching for DNA binding sites of a particular transcription factor are obtained by methods that incorporate both information content and local pairwise correlations. © Oxford University Press 2004; all rights reserved.",
            "authors": [
                "Osada R.",
                "Zaslavsky E.",
                "Singh M."
            ],
            "cit_count": 57,
            "doi": "10.1093/bioinformatics/bth438",
            "journal": "Bioinformatics",
            "title": "Comparative analysis of methods for representing and searching for transcription factor binding sites",
            "type": "Primary",
            "year": "2004-12-12"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:motifsearch",
        "biotoolsID": "motifsearch",
        "description": "Motif Search allows you to specify several different criteria when searching for sites, such as a p-value or an approximate false-positive rate given a set of negative examples.",
        "homepage": "http://compbio.cs.princeton.edu/bindsites/",
        "name": "MotifSearch",
        "version": [
            "200502"
        ]
    }
}