{"collectionID": [], "accessibility": [], "topic": [{"term": "Molecular modelling", "uri": "http://edamontology.org/topic_2275"}, {"term": "Molecular interactions, pathways and networks", "uri": "http://edamontology.org/topic_0602"}, {"term": "Protein interactions", "uri": "http://edamontology.org/topic_0128"}, {"term": "Physics", "uri": "http://edamontology.org/topic_3318"}], "owner": "ELIXIR-EE", "cost": null, "relation": [], "download": [], "validated": 1, "publication": [{"doi": null, "note": null, "version": null, "pmid": "22669908", "type": null, "pmcid": null, "metadata": {"title": "Quantum.Ligand.Dock: Protein-ligand docking with quantum entanglement refinement on a GPU system", "abstract": "Quantum.Ligand.Dock (protein-ligand docking with graphic processing unit (GPU) quantum entanglement refinement on a GPU system) is an original modern method for in silico prediction of protein-ligand interactions via high-performance docking code. The main flavour of our approach is a combination of fast search with a special account for overlooked physical interactions. On the one hand, we take care of self-consistency and proton equilibria mutual effects of docking partners. On the other hand, Quantum.Ligand.Dock is the the only docking server offering such a subtle supplement to protein docking algorithms as quantum entanglement contributions. The motivation for development and proposition of the method to the community hinges upon two arguments-the fundamental importance of quantum entanglement contribution in molecular interaction and the realistic possibility to implement it by the availability of supercomputing power. The implementation of sophisticated quantum methods is made possible by parallelization at several bottlenecks on a GPU supercomputer. The high-performance implementation will be of use for large-scale virtual screening projects, structural bioinformatics, systems biology and fundamental research in understanding protein-ligand recognition. The design of the interface is focused on feasibility and ease of use. Protein and ligand molecule structures are supposed to be submitted as atomic coordinate files in PDB format. A customization section is offered for addition of user-specified charges, extra ionogenic groups with intrinsic pKa values or fixed ions. Final predicted complexes are ranked according to obtained scores and provided in PDB format as well as interactive visualization in a molecular viewer. Quantum.Ligand.Dock server can be accessed at http://87.116.85.141/LigandDock. html. © 2012 The Author(s).", "citationCount": 11, "authors": [{"name": "Kantardjiev A.A."}], "date": "2012-07-01T00:00:00Z", "journal": "Nucleic Acids Research"}}], "homepage_status": 1, "credit": [], "biotoolsCURIE": "biotools:quantum.ligand.dock", "elixirPlatform": [], "elixirNode": [], "version": [], "elixir_badge": 0, "homepage": "http://87.116.85.141/LigandDock.html", "function": [{"note": null, "input": [], "operation": [{"term": "Protein structural motif recognition", "uri": "http://edamontology.org/operation_0245"}, {"term": "Protein interaction prediction", "uri": "http://edamontology.org/operation_2492"}, {"term": "Molecular docking", "uri": "http://edamontology.org/operation_0478"}, {"term": "Protein-ligand docking", "uri": "http://edamontology.org/operation_0482"}], "cmd": null, "output": []}], "lastUpdate": "2018-12-10T12:58:40Z", "otherID": [], "description": "Tool for consistent and fast ligand-protein docking, taking into account self-consistency of electrostatic interactions and ionization equilibria.", "toolType": ["Web application"], "editPermission": {"type": "private", "authors": []}, "language": [], "link": [], "biotoolsID": "quantum.ligand.dock", "additionDate": "2017-03-25T16:30:03Z", "name": "Quantum.Ligand.Dock", "license": null, "documentation": [], "maturity": null, "confidence_flag": null, "operatingSystem": []}