{
    "additionDate": "2021-01-18T09:50:00Z",
    "biotoolsCURIE": "biotools:foldrec-c2c",
    "biotoolsID": "foldrec-c2c",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "bliu@bliulab.net",
            "name": "Bin Liu",
            "typeEntity": "Person"
        }
    ],
    "description": "FoldRec-C2C is a tool for protein fold recognition by combining cluster-to-cluster model and protein similarity network.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Fold recognition",
                    "uri": "http://edamontology.org/operation_0303"
                },
                {
                    "term": "Protein folding analysis",
                    "uri": "http://edamontology.org/operation_2415"
                },
                {
                    "term": "Protein structure prediction",
                    "uri": "http://edamontology.org/operation_0474"
                }
            ]
        }
    ],
    "homepage": "http://bliulab.net/FoldRec-C2C/download",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-03-11T10:39:17Z",
    "name": "FoldRec-C2C",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/BIB/BBAA144",
            "metadata": {
                "abstract": "© The Author(s) 2020. Published by Oxford University Press. All rights reserved. For Permissions, please email: journals.permissions@oup.com.As a key for studying the protein structures, protein fold recognition is playing an important role in predicting the protein structures associated with COVID-19 and other important structures. However, the existing computational predictors only focus on the protein pairwise similarity or the similarity between two groups of proteins from 2-folds. However, the homology relationship among proteins is in a hierarchical structure. The global protein similarity network will contribute to the performance improvement. In this study, we proposed a predictor called FoldRec-C2C to globally incorporate the interactions among proteins into the prediction. For the FoldRec-C2C predictor, protein fold recognition problem is treated as an information retrieval task in nature language processing. The initial ranking results were generated by a surprised ranking algorithm Learning to Rank, and then three re-ranking algorithms were performed on the ranking lists to adjust the results globally based on the protein similarity network, including seq-to-seq model, seq-to-cluster model and cluster-to-cluster model (C2C). When tested on a widely used and rigorous benchmark dataset LINDAHL dataset, FoldRec-C2C outperforms other 34 state-of-the-art methods in this field. The source code and data of FoldRec-C2C can be downloaded from http://bliulab.net/FoldRec-C2C/download.",
                "authors": [
                    {
                        "name": "Liu B."
                    },
                    {
                        "name": "Shao J."
                    },
                    {
                        "name": "Yan K."
                    }
                ],
                "citationCount": 12,
                "date": "2021-05-20T00:00:00Z",
                "journal": "Briefings in bioinformatics",
                "title": "FoldRec-C2C: protein fold recognition by combining cluster-to-cluster model and protein similarity network"
            },
            "pmcid": "PMC7454262",
            "pmid": "32685972"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Protein folding, stability and design",
            "uri": "http://edamontology.org/topic_0130"
        },
        {
            "term": "Protein folds and structural domains",
            "uri": "http://edamontology.org/topic_0736"
        },
        {
            "term": "Protein targeting and localisation",
            "uri": "http://edamontology.org/topic_0140"
        },
        {
            "term": "Structure prediction",
            "uri": "http://edamontology.org/topic_0082"
        }
    ]
}
