{
    "additionDate": "2017-08-03T18:53:53Z",
    "biotoolsCURIE": "biotools:pdiviz",
    "biotoolsID": "pdiviz",
    "credit": [
        {
            "email": "aschueller@bio.puc.cl",
            "name": "Andreas Schüller",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://melolab.org/mbl/"
        }
    ],
    "description": "Plugin for the PyMOL molecular visualization system that is specifically designed to visualize protein-DNA interfaces in three dimensions. PDIviz detects the interface of protein-DNA complexes by calculating the buried surface area directly in PyMOL.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://melolab.org/mbl/wp-content/uploads/2015/02/PDIviz-guide-12.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Structure visualisation",
                    "uri": "http://edamontology.org/operation_0570"
                }
            ]
        }
    ],
    "homepage": "http://melolab.org/mbl/pdiviz",
    "language": [
        "Python"
    ],
    "lastUpdate": "2018-12-10T12:58:51Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/pdiviz-visualization-of-protein-dna-binding-interfaces.html"
        }
    ],
    "name": "PDIviz",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "© 2015 The Author 2015. Published by Oxford University Press.Specific recognition of DNA by proteins is a crucial step of many biological processes. PDIviz is a plugin for the PyMOL molecular visualization system that analyzes protein-DNA binding interfaces by comparing the solvent accessible surface area of the complex against the free protein and free DNA. The plugin provides three distinct three-dimensional visualization modes to highlight interactions with DNA bases and backbone, major and minor groove, and with atoms of different pharmacophoric type (hydrogen bond donors/acceptors, hydrophobic and thymine methyl). Each mode comes in three styles to focus the visual analysis on the protein or DNA side of the interface, or on the nucleotide sequence. PDIviz allows for the generation of publication quality images, all calculated data can be written to disk, and a command line interface is provided for automating tasks. The plugin may be helpful for the detailed identification of regions involved in DNA base and shape readout, and can be particularly useful in rapidly pinpointing the overall mode of interaction. Availability and implementation: Freely available at http://melolab.org/pdiviz/ as a PyMOL plugin. Tested with incentive, educational, and open source versions of PyMOL on Windows, Mac and Linux systems.",
                "authors": [
                    {
                        "name": "Ribeiro J."
                    },
                    {
                        "name": "Melo F."
                    },
                    {
                        "name": "Schuller A."
                    }
                ],
                "citationCount": 12,
                "date": "2015-01-19T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "PDIviz: Analysis and visualization of protein-DNA binding interfaces"
            },
            "pmid": "25886981"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Molecular modelling",
            "uri": "http://edamontology.org/topic_2275"
        },
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ],
    "validated": 1
}