{"credit":[{"email":"jonathan@chgr.mc.vanderbilt.edu","name":"Jonathan L. Haines","typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://ritchielab.psu.edu/"}],"documentation":[{"type":"GENERAL","url":"http://ritchielab.psu.edu/software/paris-download"}],"function":[{"operation":[{"term":"Pathway or network analysis","uri":"http://edamontology.org/operation_2497"}]}],"labels":{"language":["C++"],"operatingSystem":["Linux"],"toolType":["Command-line tool"],"topic":[{"term":"Genetics","uri":"http://edamontology.org/topic_3053"},{"term":"Genomics","uri":"http://edamontology.org/topic_0622"},{"term":"Molecular interactions, pathways and networks","uri":"http://edamontology.org/topic_0602"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/paris-1-1-0-pathway-analysis-randomization-incorporating-structure.html"}],"publication":[{"abstract":"Genome Wide Association Studies (GWAS) are a standard approach for large-scale common variation characterization and for identification of single loci predisposing to disease. However, due to issues of moderate sample sizes and particularly multiple testing correction, many variants of smaller effect size are not detected within a single allele analysis framework. Thus, small main effects and potential epistatic effects are not consistently observed in GWAS using standard analytical approaches that consider only single SNP alleles. Here, we propose unique methodology that aggregates variants of interest (for example, genes in a biological pathway) using GWAS results. Multiple testing and type I error concerns are minimized using empirical genomic randomization to estimate significance. Randomization corrects for common pathway-based analysis biases, such as SNP coverage and density, linkage disequilibrium, gene size and pathway size. Pathway Analysis by Randomization Incorporating Structure (PARIS) applies this randomization and in doing so directly accounts for linkage disequilibrium effects. PARIS is independent of association analysis method and is thus applicable to GWAS datasets of all study designs. Using the KEGG database as an example, we apply PARIS to the publicly available Autism Genetic Resource Exchange GWAS dataset, revealing pathways with a significant enrichment of positive association results. © 2011 Springer-Verlag.","authors":["Yaspan B.L.","Bush W.S.","Torstenson E.S.","Ma D.","Pericak-Vance M.A.","Ritchie M.D.","Sutcliffe J.S.","Haines J.L."],"cit_count":45,"journal":"Human Genetics","pmid":"21279722","title":"Genetic analysis of biological pathway data through genomic randomization","year":"2011-05-01"}],"summary":{"biotoolsCURIE":"biotools:paris","biotoolsID":"paris","description":"Independent of association analysis method and is thus applicable to GWAS datasets of all study designs.","homepage":"http://ritchielab.psu.edu/software/paris-download","name":"PARIS"}}