{
    "additionDate": "2018-05-05T09:53:54Z",
    "biotoolsCURIE": "biotools:mem-adsvm",
    "biotoolsID": "mem-adsvm",
    "collectionID": [
        "Proteomics"
    ],
    "credit": [
        {
            "email": "shibiao.wan@connect.polyu.hk",
            "name": "Shibiao Wan",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "enmwmak@polyu.edu.hk",
            "name": "Man-Wai Mak",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "A two-layer multi-label predictor for identifying multi-functional types of membrane proteins.",
    "documentation": [
        {
            "type": "General",
            "url": "http://bioinfo.eie.polyu.edu.hk/MemADSVMServer/instructions.html"
        }
    ],
    "editPermission": {
        "authors": [
            "proteomics.bio.tools"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein function prediction",
                    "uri": "http://edamontology.org/operation_1777"
                }
            ]
        }
    ],
    "homepage": "http://bioinfo.eie.polyu.edu.hk/MemADSVMServer/",
    "lastUpdate": "2019-03-26T08:23:42Z",
    "name": "Mem-ADSVM",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1016/J.JTBI.2016.03.013",
            "metadata": {
                "abstract": "© 2016 Elsevier Ltd.Identifying membrane proteins and their multi-functional types is an indispensable yet challenging topic in proteomics and bioinformatics. However, most of the existing membrane-protein predictors have the following problems: (1) they do not predict whether a given protein is a membrane protein or not, (2) they are limited to predicting membrane proteins with single-label functional types but ignore those with multi-functional types; and (3) there is still much room for improvement for their performance. To address these problems, this paper proposes a two-layer multi-label predictor, namely Mem-ADSVM, which can identify membrane proteins (Layer I) and their multi-functional types (Layer II). Specifically, given a query protein, its associated gene ontology (GO) information is retrieved by searching a compact GO-term database with its homologous accession number. Subsequently, the GO information is classified by a binary support vector machine (SVM) classifier to determine whether it is a membrane protein or not. If yes, it will be further classified by a multi-label multi-class SVM classifier equipped with an adaptive-decision (AD) scheme to determine to which functional type(s) it belongs. Experimental results show that Mem-ADSVM significantly outperforms state-of-the-art predictors in terms of identifying both membrane proteins and their multi-functional types. This paper also suggests that the two-layer prediction architecture is better than the one-layer for prediction performance. For reader's convenience, the Mem-ADSVM server is available online at http://bioinfo.eie.polyu.edu.hk/MemADSVMServer/.",
                "authors": [
                    {
                        "name": "Wan S."
                    },
                    {
                        "name": "Mak M.-W."
                    },
                    {
                        "name": "Kung S.-Y."
                    }
                ],
                "citationCount": 14,
                "date": "2016-06-07T00:00:00Z",
                "journal": "Journal of Theoretical Biology",
                "title": "Mem-ADSVM: A two-layer multi-label predictor for identifying multi-functional types of membrane proteins"
            },
            "pmid": "27000774"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Membrane and lipoproteins",
            "uri": "http://edamontology.org/topic_0820"
        },
        {
            "term": "Function analysis",
            "uri": "http://edamontology.org/topic_1775"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        }
    ]
}