{
    "additionDate": "2021-10-27T19:54:27.927617Z",
    "biotoolsCURIE": "biotools:co-correcting",
    "biotoolsID": "co-correcting",
    "confidence_flag": "tool",
    "credit": [
        {
            "name": "Jiarun Liu",
            "url": "https://github.com/JiarunLiu"
        }
    ],
    "description": "Noise-tolerant Medical Image Classification via mutual Label Correction.",
    "editPermission": {
        "type": "private"
    },
    "homepage": "https://github.com/JiarunLiu/Co-Correcting",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-10-27T19:54:44.605474Z",
    "license": "Apache-2.0",
    "name": "Co-Correcting",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1109/TMI.2021.3091178",
            "metadata": {
                "abstract": "IEEEWith the development of deep learning, medical image classification has been significantly improved. However, deep learning requires massive data with labels. While labeling the samples by human experts is expensive and time-consuming, collecting labels from crowd-sourcing suffers from the noises which may degenerate the accuracy of classifiers. Therefore, approaches that can effectively handle label noises are highly desired. Unfortunately, recent progress on handling label noise in deep learning has gone largely unnoticed by the medical image. To fill the gap, this paper proposes a noise-tolerant medical image classification framework named Co-Correcting, which significantly improves classification accuracy and obtains more accurate labels through dual-network mutual learning, label probability estimation, and curriculum label correcting. On two representative medical image datasets and the MNIST dataset, we test six latest Learning-with-Noisy-Labels methods and conduct comparative studies. The experiments show that Co-Correcting achieves the best accuracy and generalization under different noise ratios in various tasks. Our project can be found at: https://github.com/JiarunLiu/Co-Correcting.",
                "authors": [
                    {
                        "name": "Li R."
                    },
                    {
                        "name": "Liu J."
                    },
                    {
                        "name": "Sun C."
                    }
                ],
                "date": "2021-01-01T00:00:00Z",
                "journal": "IEEE Transactions on Medical Imaging",
                "title": "Co-Correcting: Noise-tolerant Medical Image Classification via mutual Label Correction"
            },
            "pmid": "34152981"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ],
    "validated": 1
}
