{"credit":[{"email":"rob.lavigne@kuleuven.be","name":"Rob Lavigne","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"https://www.biw.kuleuven.be/logt/PHIRE.htm"}],"function":[{"operation":[{"term":"Transcriptional regulatory element prediction","uri":"http://edamontology.org/operation_0438"}]}],"labels":{"language":["Visual Basic"],"operatingSystem":["Linux","Windows","Mac"],"toolType":["Web application"],"topic":[{"term":"Gene regulation","uri":"http://edamontology.org/topic_0204"},{"term":"Genomics","uri":"http://edamontology.org/topic_0622"},{"term":"Sequencing","uri":"http://edamontology.org/topic_3168"},{"term":"Protein interaction experiment","uri":"http://edamontology.org/topic_3557"},{"term":"Sequence analysis","uri":"http://edamontology.org/topic_0080"}]},"publication":[{"abstract":"Motivation: In silico genome analysis of bacteriophage genomes focuses mainly on gene discovery and functional assignment. The search for regulatory elements contained within these genome sequences is often based on prior knowledge of other genomic elements or on learning algorithms of experimentally determined data, potentially leading to a biased prediction output. The PHage In silico Regulatory Elements (PHIRE) program is a standalone program in Visual Basic. It performs an algorithmic string-based search on bacteriophage genome sequences to uncover and extract subsequence alignments hinting at regulatory elements contained within these genomes, in a deterministic manner without any prior experimental or predictive knowledge. Results: The PHIRE program was tested on known phage genomes with experimentally verified regulatory elements. PHIRE was able to extract phage regulatory sequences correctly for bacteriophages T7, T3, φ YeO3-12 and λ, based solely on the genome sequence. For 11 bacteriophages, new predictions of conserved phage-specific putative regulatory elements were made, further corroborating this approach. © Oxford University Press 2004; all rights reserved.","authors":["Lavigne R.","Sun W.D.","Volckaert G."],"cit_count":53,"journal":"Bioinformatics","pmid":"15033869","title":"PHIRE, a deterministic approach to reveal regulatory elements in bacteriophage genomes","year":"2004-03-22"}],"summary":{"biotoolsCURIE":"biotools:phire","biotoolsID":"phire","description":"Phage In silico Regulatory Elements (PHIRE) is a standalone program in Visual Basic which performs a string-based search on bacteriophage genome sequences discovering and extracting blocks displaying sequence similarity corresponding to conserved regulatory elements contained within these genomes.","homepage":"http://www.biw.kuleuven.be/logt/PHIRE.htm","name":"PHIRE"}}