{
    "accessibility": "Open access",
    "additionDate": "2022-02-17T12:44:02.614447Z",
    "biotoolsCURIE": "biotools:mechanalyze",
    "biotoolsID": "mechanalyze",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "christoph.meinert@qut.edu.au",
            "name": "Christoph Meinert"
        },
        {
            "name": "Dominik Schneidereit"
        },
        {
            "name": "Nathalie Bock"
        },
        {
            "name": "Oliver Friedrich"
        },
        {
            "name": "Dietmar W. Hutmacher",
            "orcidid": "https://orcid.org/0000-0001-5678-2134"
        },
        {
            "name": "Melanie Kahl",
            "orcidid": "https://orcid.org/0000-0003-4669-7969"
        }
    ],
    "description": "An algorithm for standardization and automation of compression test analysis.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/MelanieKahl/MechAnalyze",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2022-02-17T12:44:02.617080Z",
    "license": "Not licensed",
    "name": "MechAnalyze",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1089/TEN.TEC.2021.0170",
            "metadata": {
                "abstract": "© 2021, Mary Ann Liebert, Inc., publishers.The mechanical properties of hydrogels, as well as native and engineered tissues are key parameters frequently assessed in biomaterial science and tissue engineering research. However, a lack of standardized methods and user-independent data analysis has impacted the research community for many decades and contributes to poor reproducibility and comparability of datasets, representing a significant issue often neglected in publications. In this study, we provide a software package, MechAnalyze, facilitating the standardized and automated analysis of force-displacement data generated in unconfined compression tests. Using comparative studies of datasets analyzed manually and with MechAnalyze, we demonstrate that the software reliably determines the compressive moduli, failure stress and failure strain of hydrogels, as well as engineered and native tissues, while providing an intuitive user interface that requires minimal user input. MechAnalyze provides a fast and user-independent data analysis method and advances process standardization, reproducibility, and comparability of data for the mechanical characterization of biomaterials as well as native and engineered tissues. Mechanical properties of hydrogels are crucial parameters in the development of new materials for tissue engineering. However, manual assessment is tedious, not standardized and suffers under user-to-user bias. Hence, the here presented stand-alone software package provides analysis and statistics of force-displacement and material geometry data to determine the compressive moduli, failure stress, and failure strain in a standardized, robust, and automated fashion. MechAnalyze will substantially support biomechanical testing of hydrogels as well as engineered and native tissues and will thus, be of appreciable value to a broad target group in regenerative medicine, tissue engineering, but also life sciences and biomedicine.",
                "authors": [
                    {
                        "name": "Bock N."
                    },
                    {
                        "name": "Friedrich O."
                    },
                    {
                        "name": "Hutmacher D.W."
                    },
                    {
                        "name": "Kahl M."
                    },
                    {
                        "name": "Meinert C."
                    },
                    {
                        "name": "Schneidereit D."
                    }
                ],
                "citationCount": 2,
                "date": "2021-10-01T00:00:00Z",
                "journal": "Tissue Engineering - Part C: Methods",
                "title": "MechAnalyze: An Algorithm for Standardization and Automation of Compression Test Analysis"
            },
            "pmid": "34541882"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Biomaterials",
            "uri": "http://edamontology.org/topic_3368"
        },
        {
            "term": "Software engineering",
            "uri": "http://edamontology.org/topic_3372"
        }
    ],
    "validated": 1
}
