
{
    "credit": [
        {
            "email": "prism_support-group@ku.edu.tr",
            "name": "Support",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://wiki.c2b2.columbia.edu/honiglab_public/index.php/Main_Page"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Protein sequence analysis",
                    "uri": "http://edamontology.org/operation_2479"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Structure analysis",
                    "uri": "http://edamontology.org/operation_2480"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Proteins",
                "uri": "http://edamontology.org/topic_0078"
            },
            {
                "term": "Structure analysis",
                "uri": "http://edamontology.org/topic_0081"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://www.mybiosoftware.com/prism-protein-informatics-system-modeling.html"
        }
    ],
    "publication": [
        {
            "abstract": "PriSM (Protein Informatics System for Modeling) is a protein analysis and modeling system in which informatics, alignment, modeling, and assessment modules are integrated in a computational environment where protein analysis and modeling protocols can be designed and assessed interactively. It can then be used automatically and repetitively in response to a variety of protein analysis and modeling problems. PRISM was used to predict a single model for each of the 43 targets in the CASP3 experiment. In this paper, we present results for 13 target sequences, which we consider to be comparative modeling targets with clearly related structural templates. We emphasize the problem of aligning a target sequence to a template structure with various alignment methods. When more than one alignment method and/or parameter set are applied, the final alignment is chosen on the basis of a model ranking system also used in PrISM's fold recognition module. Advanced sequence- template alignment procedures in PriSM are useful in some cases when standard pairwise dynamic programming algorithm fail to make any reasonable global alignment. The same procedures, however, failed in other cases, corresponding to remotely related query-template pairs that involved extensive insertions and deletions.",
            "authors": [
                "Yang A.-S.",
                "Honig B."
            ],
            "cit_count": 50,
            "journal": "Proteins: Structure, Function and Genetics",
            "pmid": "10526354",
            "title": "Sequence to structure alignment in comparative modeling using PrISM",
            "year": "1999-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:prism",
        "biotoolsID": "prism",
        "description": "PrISM (Protein Informatics System for Modeling) is an integrated computational system where computational tools are implemented for protein sequence and structure analysis and modeling.",
        "homepage": "http://wiki.c2b2.columbia.edu/honiglab_public/index.php/Software:PrISM",
        "name": "PrISM"
    }
}