{
    "accessibility": "Open access",
    "additionDate": "2020-01-14T09:37:05Z",
    "biotoolsCURIE": "biotools:KrakenUniq",
    "biotoolsID": "KrakenUniq",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "bhurwitz@email.arizona.edu",
            "name": "Bonnie L. Hurwitz",
            "orcidid": "https://orcid.org/0000-0001-8699-957X",
            "typeEntity": "Person"
        }
    ],
    "description": "Identification and quantitation of clinically relevant microbes in patient samples.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Validation",
                    "uri": "http://edamontology.org/operation_2428"
                },
                {
                    "term": "Taxonomic classification",
                    "uri": "http://edamontology.org/operation_3460"
                },
                {
                    "term": "k-mer counting",
                    "uri": "http://edamontology.org/operation_3472"
                }
            ]
        }
    ],
    "homepage": "https://github.com/hurwitzlab/krakenuniq",
    "language": [
        "Shell",
        "Python"
    ],
    "lastUpdate": "2021-01-14T08:25:10Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/hurwitzlab/krakenuniq/blob/master/scripts/run.sh"
        }
    ],
    "name": "KrakenUniq",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PCBI.1006863",
            "metadata": {
                "abstract": "© 2019 Watts et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Infections are a serious health concern worldwide, particularly in vulnerable populations such as the immunocompromised, elderly, and young. Advances in metagenomic sequencing availability, speed, and decreased cost offer the opportunity to supplement or even replace culture-based identification of pathogens with DNA sequence-based diagnostics. Adopting metagenomic analysis for clinical use requires that all aspects of the workflow are optimized and tested, including data analysis and computational time and resources. We tested the accuracy, sensitivity, and resource requirements of three top metagenomic taxonomic classifiers that use fast k-mer based algorithms: Centrifuge, CLARK, and KrakenUniq. Binary mixtures of bacteria showed all three reliably identified organisms down to 1% relative abundance, while only the relative abundance estimates of Centrifuge and CLARK were accurate. All three classifiers identified the organisms present in their default databases from a mock bacterial community of 20 organisms, but only Centrifuge had no false positives. In addition, Centrifuge required far less computational resources and time for analysis. Centrifuge analysis of metagenomes obtained from samples of VAP, infected DFUs, and FN showed Centrifuge identified pathogenic bacteria and one virus that were corroborated by culture or a clinical PCR assay. Importantly, in both diabetic foot ulcer patients, metagenomic sequencing identified pathogens 4-6 weeks before culture. Finally, we show that Centrifuge results were minimally affected by elimination of time-consuming read quality control and host screening steps.",
                "authors": [
                    {
                        "name": "Watts G.S."
                    },
                    {
                        "name": "Thornton J.E."
                    },
                    {
                        "name": "Youens-Clark K."
                    },
                    {
                        "name": "Ponsero A.J."
                    },
                    {
                        "name": "Slepian M.J."
                    },
                    {
                        "name": "Menashi E."
                    },
                    {
                        "name": "Hu C."
                    },
                    {
                        "name": "Deng W."
                    },
                    {
                        "name": "Armstrong D.G."
                    },
                    {
                        "name": "Reed S."
                    },
                    {
                        "name": "Cranmer L.D."
                    },
                    {
                        "name": "Hurwitz B.L."
                    }
                ],
                "citationCount": 6,
                "date": "2019-01-01T00:00:00Z",
                "journal": "PLoS Computational Biology",
                "title": "Identification and quantitation of clinically relevant microbes in patient samples: Comparison of three k-mer based classifiers for speed, accuracy, and sensitivity"
            },
            "pmcid": "PMC6897419",
            "pmid": "31756192"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "Metagenomic sequencing",
            "uri": "http://edamontology.org/topic_3837"
        },
        {
            "term": "Whole genome sequencing",
            "uri": "http://edamontology.org/topic_3673"
        },
        {
            "term": "Infectious disease",
            "uri": "http://edamontology.org/topic_3324"
        },
        {
            "term": "Taxonomy",
            "uri": "http://edamontology.org/topic_0637"
        }
    ],
    "validated": 1
}