{
    "additionDate": "2021-06-14T13:12:15Z",
    "biotoolsCURIE": "biotools:abstcal",
    "biotoolsID": "abstcal",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "ycui1@mdanderson.org",
            "name": "Yong Cui",
            "typeEntity": "Person"
        }
    ],
    "description": "abstcal is a a Python package to calculate abstinence results using the timeline followback interview data.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                },
                {
                    "term": "Imputation",
                    "uri": "http://edamontology.org/operation_3557"
                }
            ]
        }
    ],
    "homepage": "https://github.com/ycui1-mda/abstcal",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T20:20:41.299105Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/ycui1-mda/abstcal/issues"
        },
        {
            "type": [
                "Repository"
            ],
            "url": "https://pypi.org/project/abstcal/"
        }
    ],
    "name": "abstcal",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/ntr/ntab083",
            "metadata": {
                "abstract": "Introduction: In smoking cessation clinical trials, timeline followback (TLFB) interviews are widely used to track daily cigarette consumption. However, there are no standard tools for calculating abstinence based on TLFB data. Individual research groups have to develop their own calculation tools, which is not only time- A nd resource-consuming but might also lead to variability in the data processing and calculation procedures. Aims and Methods: To address these issues, we developed a novel open-source Python package named abstcal to calculate abstinence using TLFB data. This package provides data verification, duplicate and outlier detection, missing-data imputation, integration of biochemical verification data, and calculation of a variety of definitions of abstinence, including continuous, point-prevalence, and prolonged abstinence. Results: We verified the accuracy of the calculator using data derived from a clinical smoking cessation study. To improve the package's accessibility, we have made it available as a free web app. Conclusions: The abstcal package is a reliable abstinence calculator with open-source access, providing a shared validated online tool to the addiction research field. We expect that this open-source abstinence calculation tool will improve the rigor and reproducibility of smoking and addiction research by standardizing TLFB-based abstinence calculation. Implications: Abstinence calculation is an essential task in any smoking intervention study. However, there have not been standard open-source tools available to the researchers. This commentary describes a Python-based package called abstcal that can calculate abstinence from TLFB data, a common methodology to collect smoking consumption data in research settings. The package supports the calculation of point-prevalence, prolonged, and continuous abstinence. Importantly, the package has a web app interface that allows researchers to use the tool without any coding experience. This tool will facilitate smoking research by providing a standardized and easy-to-use abstinence calculation tool.",
                "authors": [
                    {
                        "name": "Cinciripini P.M."
                    },
                    {
                        "name": "Cui Y."
                    },
                    {
                        "name": "Minnix J.A."
                    },
                    {
                        "name": "Robinson J.D."
                    },
                    {
                        "name": "Rymer R.E."
                    }
                ],
                "date": "2022-01-01T00:00:00Z",
                "journal": "Nicotine and Tobacco Research",
                "title": "Python Package abstcal: An Open-Source Tool for Calculating Abstinence From Timeline Followback Data"
            },
            "pmcid": "PMC8826113",
            "pmid": "33912971"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Preclinical and clinical studies",
            "uri": "http://edamontology.org/topic_3379"
        },
        {
            "term": "Public health and epidemiology",
            "uri": "http://edamontology.org/topic_3305"
        }
    ]
}
