{
    "additionDate": "2019-11-14T18:12:37Z",
    "biotoolsCURIE": "biotools:ArtiFuse",
    "biotoolsID": "ArtiFuse",
    "confidence_flag": "tool",
    "description": "Computational validation of fusion gene detection tools without relying on simulated reads | MOTIVATION:Gene fusions are an important class of transcriptional variants that can influence cancer development and can be predicted from RNA sequencing (RNA-seq) data by multiple existing tools. However, real world performance of these tools is unclear due to the lack of known positive and negative events, especially with regard to fusion genes in individual samples. Often simulated reads are used, but these cannot account for all technical biases in RNA-seq data generated from real samples. RESULTS:Here we present ArtiFuse, a novel approach that simulates fusion genes by sequence modification to the genomic reference, and therefore can be applied to any RNA-seq dataset without the need for any simulated reads",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://github.com/TRON-Bioinformatics/ArtiFusion",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-12-02T15:03:17Z",
    "name": "ArtiFuse",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ613",
            "metadata": {
                "abstract": "© 2019 The Author(s) 2019. Published by Oxford University Press. All rights reserved. For permissions, please e-mail: journals.permissions@oup.com.Motivation: Gene fusions are an important class of transcriptional variants that can influence cancer development and can be predicted from RNA sequencing (RNA-seq) data by multiple existing tools. However, the real-world performance of these tools is unclear due to the lack of known positive and negative events, especially with regard to fusion genes in individual samples. Often simulated reads are used, but these cannot account for all technical biases in RNA-seq data generated from real samples. Results: Here, we present ArtiFuse, a novel approach that simulates fusion genes by sequence modification to the genomic reference, and therefore, can be applied to any RNA-seq dataset without the need for any simulated reads. We demonstrate our approach on eight RNA-seq datasets for three fusion gene prediction tools: average recall values peak for all three tools between 0.4 and 0.56 for high-quality and high-coverage datasets. As ArtiFuse affords total control over involved genes and breakpoint position, we also assessed performance with regard to gene-related properties, showing a drop-in recall value for low-expressed genes in high-coverage samples and genes with co-expressed paralogues. Overall tool performance assessed from ArtiFusions is lower compared to previously reported estimates on simulated reads. Due to the use of real RNA-seq datasets, we believe that ArtiFuse provides a more realistic benchmark that can be used to develop more accurate fusion gene prediction tools for application in clinical settings.",
                "authors": [
                    {
                        "name": "Sorn P."
                    },
                    {
                        "name": "Holtstrater C."
                    },
                    {
                        "name": "Lower M."
                    },
                    {
                        "name": "Sahin U."
                    },
                    {
                        "name": "Weber D."
                    }
                ],
                "citationCount": 1,
                "date": "2020-01-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "ArtiFuse-Computational validation of fusion gene detection tools without relying on simulated reads"
            },
            "pmid": "31373612"
        }
    ],
    "topic": [
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        }
    ],
    "validated": 1
}