{
    "accessibility": "Open access",
    "additionDate": "2021-10-15T14:56:23.749712Z",
    "biotoolsCURIE": "biotools:sfmeb",
    "biotoolsID": "sfmeb",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "2160090406@email.szu.edu.cn",
            "name": "Jiadi Zhu",
            "typeEntity": "Person"
        },
        {
            "email": "tiangl@sustech.edu.cn",
            "name": "Guoliang Tian",
            "typeEntity": "Person"
        }
    ],
    "description": "A scaling-free minimum enclosing ball method to detect differentially expressed genes for RNA-seq data.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://bioconductor.org/packages/release/bioc/manuals/MEB/man/MEB.pdf"
        }
    ],
    "download": [
        {
            "type": "Command-line specification",
            "url": "https://bioconductor.org/packages/release/bioc/html/MEB.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Differential gene expression profiling",
                    "uri": "http://edamontology.org/operation_3223"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://bioconductor.org/packages/MEB",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-10-15T14:59:23.023943Z",
    "license": "GPL-2.0",
    "name": "SFMEB",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1186/S12864-021-07790-0",
            "metadata": {
                "abstract": "BACKGROUND: Identifying differentially expressed genes between the same or different species is an urgent demand for biological and medical research. For RNA-seq data, systematic technical effects and different sequencing depths are usually encountered when conducting experiments. Normalization is regarded as an essential step in the discovery of biologically important changes in expression. The present methods usually involve normalization of the data with a scaling factor, followed by detection of significant genes. However, more than one scaling factor may exist because of the complexity of real data. Consequently, methods that normalize data by a single scaling factor may deliver suboptimal performance or may not even work.The development of modern machine learning techniques has provided a new perspective regarding discrimination between differentially expressed (DE) and non-DE genes. However, in reality, the non-DE genes comprise only a small set and may contain housekeeping genes (in same species) or conserved orthologous genes (in different species). Therefore, the process of detecting DE genes can be formulated as a one-class classification problem, where only non-DE genes are observed, while DE genes are completely absent from the training data. RESULTS: In this study, we transform the problem to an outlier detection problem by treating DE genes as outliers, and we propose a scaling-free minimum enclosing ball (SFMEB) method to construct a smallest possible ball to contain the known non-DE genes in a feature space. The genes outside the minimum enclosing ball can then be naturally considered to be DE genes. Compared with the existing methods, the proposed SFMEB method does not require data normalization, which is particularly attractive when the RNA-seq data include more than one scaling factor. Furthermore, the SFMEB method could be easily extended to different species without normalization. CONCLUSIONS: Simulation studies demonstrate that the SFMEB method works well in a wide range of settings, especially when the data are heterogeneous or biological replicates. Analysis of the real data also supports the conclusion that the SFMEB method outperforms other existing competitors. The R package of the proposed method is available at https://bioconductor.org/packages/MEB .",
                "authors": [
                    {
                        "name": "Tian G."
                    },
                    {
                        "name": "Wang J."
                    },
                    {
                        "name": "Yang B."
                    },
                    {
                        "name": "Zhou Y."
                    },
                    {
                        "name": "Zhu J."
                    }
                ],
                "date": "2021-06-26T00:00:00Z",
                "journal": "BMC genomics",
                "title": "A scaling-free minimum enclosing ball method to detect differentially expressed genes for RNA-seq data"
            },
            "pmcid": "PMC8234728",
            "pmid": "34174824"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Exome sequencing",
            "uri": "http://edamontology.org/topic_3676"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ]
}
