{
    "additionDate": "2018-04-21T10:16:00Z",
    "biotoolsCURIE": "biotools:morfeus",
    "biotoolsID": "morfeus",
    "credit": [
        {
            "email": "volkmer@biochem.mpg.de",
            "name": "M Volkmer",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "habermann@biochem.mpg.de",
            "name": "BH Habermann",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Meta-analysis based orthology finder using symmetrical best hits.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://bio.biochem.mpg.de/morfeus/morFeus-helpPages/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence analysis",
                    "uri": "http://edamontology.org/operation_2403"
                }
            ]
        }
    ],
    "homepage": "http://bio.biochem.mpg.de/morfeus/",
    "language": [
        "PHP",
        "Java",
        "Python"
    ],
    "lastUpdate": "2018-12-10T12:58:57Z",
    "name": "morFeus",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1186/1471-2105-15-263",
            "metadata": {
                "abstract": "© 2014 Wagner et al.; licensee BioMed Central Ltd.Background: Searching the orthologs of a given protein or DNA sequence is one of the most important and most commonly used Bioinformatics methods in Biology. Programs like BLAST or the orthology search engine Inparanoid can be used to find orthologs when the similarity between two sequences is sufficiently high. They however fail when the level of conservation is low. The detection of remotely conserved proteins oftentimes involves sophisticated manual intervention that is difficult to automate.Results: Here, we introduce morFeus, a search program to find remotely conserved orthologs. Based on relaxed sequence similarity searches, morFeus selects sequences based on the similarity of their alignments to the query, tests for orthology by iterative reciprocal BLAST searches and calculates a network score for the resulting network of orthologs that is a measure of orthology independent of the E-value. Detecting remotely conserved orthologs of a protein using morFeus thus requires no manual intervention. We demonstrate the performance of morFeus by comparing it to state-of-the-art orthology resources and methods. We provide an example of remotely conserved orthologs, which were experimentally shown to be functionally equivalent in the respective organisms and therefore meet the criteria of the orthology-function conjecture.Conclusions: Based on our results, we conclude that morFeus is a powerful and specific search method for detecting remotely conserved orthologs. morFeus is freely available at http://bio.biochem.mpg.de/morfeus/. Its source code is available from Sourceforge.net (https://sourceforge.net/p/morfeus/).",
                "authors": [
                    {
                        "name": "Wagner I."
                    },
                    {
                        "name": "Volkmer M."
                    },
                    {
                        "name": "Sharan M."
                    },
                    {
                        "name": "Villaveces J.M."
                    },
                    {
                        "name": "Oswald F."
                    },
                    {
                        "name": "Surendranath V."
                    },
                    {
                        "name": "Habermann B.H."
                    }
                ],
                "citationCount": 5,
                "date": "2014-08-06T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "MorFeus: A web-based program to detect remotely conserved orthologs using symmetrical best hits and orthology network scoring"
            },
            "pmcid": "PMC4137093",
            "pmid": "25096057"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Molecular genetics",
            "uri": "http://edamontology.org/topic_3321"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        }
    ],
    "validated": 1
}