{
    "additionDate": "2021-01-18T09:00:15Z",
    "biotoolsCURIE": "biotools:discount",
    "biotoolsID": "discount",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "r.masteling@nioo.knaw.nl",
            "name": "Raul Masteling",
            "orcidid": "https://orcid.org/0000-0002-3875-564X",
            "typeEntity": "Person"
        },
        {
            "email": "j.raaijmakers@nioo.knaw.nl",
            "name": "Jos M. Raaijmakers",
            "typeEntity": "Person"
        }
    ],
    "description": "DISCount Pytorch implementation for seed and radicle detection using the You-Only-Look-Once object detector.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                },
                {
                    "term": "Image annotation",
                    "uri": "http://edamontology.org/operation_3553"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                }
            ]
        }
    ],
    "homepage": "https://gitlab.com/lodewijk-track32/discount_paper",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-03-01T09:24:47Z",
    "license": "MIT",
    "name": "DiSCount",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1186/S13007-020-00602-8",
            "metadata": {
                "abstract": "© 2020 The Author(s).Background: Plant parasitic weeds belonging to the genus Striga are a major threat for food production in Sub-Saharan Africa and Southeast Asia. The parasite's life cycle starts with the induction of seed germination by host plant-derived signals, followed by parasite attachment, infection, outgrowth, flowering, reproduction, seed set and dispersal. Given the small seed size of the parasite (< 200 μm), quantification of the impact of new control measures that interfere with seed germination relies on manual, labour-intensive counting of seed batches under the microscope. Hence, there is a need for high-throughput assays that allow for large-scale screening of compounds or microorganisms that adversely affect Striga seed germination. Results: Here, we introduce DiSCount (Digital Striga Counter): A computer vision tool for automated quantification of total and germinated Striga seed numbers in standard glass fibre filter assays. We developed the software using a machine learning approach trained with a dataset of 98 manually annotated images. Then, we validated and tested the model against a total dataset of 188 manually counted images. The results showed that DiSCount has an average error of 3.38 percentage points per image compared to the manually counted dataset. Most importantly, DiSCount achieves a 100 to 3000-fold speed increase in image analysis when compared to manual analysis, with an inference time of approximately 3 s per image on a single CPU and 0.1 s on a GPU. Conclusions: DiSCount is accurate and efficient in quantifying total and germinated Striga seeds in a standardized germination assay. This automated computer vision tool enables for high-throughput, large-scale screening of chemical compound libraries and biological control agents of this devastating parasitic weed. The complete software and manual are hosted at https://gitlab.com/lodewijk-track32/discount_paper and the archived version is available at Zenodo with the DOI https://doi.org/10.5281/zenodo.3627138. The dataset used for testing is available at Zenodo with the DOI https://doi.org/10.5281/zenodo.3403956.",
                "authors": [
                    {
                        "name": "De Boer W."
                    },
                    {
                        "name": "Dini-Andreote F."
                    },
                    {
                        "name": "Ijsselmuiden J."
                    },
                    {
                        "name": "Masteling R."
                    },
                    {
                        "name": "Raaijmakers J.M."
                    },
                    {
                        "name": "Voorhoeve L."
                    }
                ],
                "citationCount": 5,
                "date": "2020-05-01T00:00:00Z",
                "journal": "Plant Methods",
                "title": "DiSCount: Computer vision for automated quantification of Striga seed germination"
            },
            "pmcid": "PMC7195706",
            "pmid": "32377220"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Compound libraries and screening",
            "uri": "http://edamontology.org/topic_3343"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        }
    ]
}
