{
    "additionDate": "2020-01-14T09:10:53Z",
    "biotoolsCURIE": "biotools:CRISPRitz",
    "biotoolsID": "CRISPRitz",
    "confidence_flag": "tool",
    "description": "A rapid, high-throughput, and variant-aware in silico off-target site identification for CRISPR genome editing.\n\nTool package to perform in-silico CRISPR analysis and assessment.\n\nCRISPRitz is a software package containing 5 different tools dedicated to perform predictive analysis and result assessement on CRISPR/Cas experiments.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Editing",
                    "uri": "http://edamontology.org/operation_3096"
                },
                {
                    "term": "Genome indexing",
                    "uri": "http://edamontology.org/operation_3211"
                },
                {
                    "term": "Phasing",
                    "uri": "http://edamontology.org/operation_3454"
                }
            ]
        }
    ],
    "homepage": "https://github.com/pinellolab/CRISPRitz",
    "language": [
        "C++",
        "Python"
    ],
    "lastUpdate": "2020-12-16T19:33:10Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/InfOmics/CRISPRitz"
        }
    ],
    "name": "CRISPRitz",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ867",
            "metadata": {
                "abstract": "© 2019 The Author(s). Published by Oxford University Press.Motivation: Clustered regularly interspaced short palindromic repeats (CRISPR) technologies allow for facile genomic modification in a site-specific manner. A key step in this process is the in silico design of single guide RNAs to efficiently and specifically target a site of interest. To this end, it is necessary to enumerate all potential offtarget sites within a given genome that could be inadvertently altered by nuclease-mediated cleavage. Currently available software for this task is limited by computational efficiency, variant support or annotation, and assessment of the functional impact of potential off-target effects. Results: To overcome these limitations, we have developed CRISPRitz, a suite of software tools to support the design and analysis of CRISPR/CRISPR-associated (Cas) experiments. Using efficient data structures combined with parallel computation, we offer a rapid, reliable, and exhaustive search mechanism to enumerate a comprehensive list of putative off-target sites. As proof-of-principle, we performed a head-to-head comparison with other available tools on several datasets. This analysis highlighted the unique features and superior computational performance of CRISPRitz including support for genomic searching with DNA/RNA bulges and mismatches of arbitrary size as specified by the user as well as consideration of genetic variants (variant-aware). In addition, graphical reports are offered for coding and non-coding regions that annotate the potential impact of putative off-target sites that lie within regions of functional genomic annotation (e.g. insulator and chromatin accessible sites from the ENCyclopedia Of DNA Elements [ENCODE] project).",
                "authors": [
                    {
                        "name": "Bombieri N."
                    },
                    {
                        "name": "Cancellieri S."
                    },
                    {
                        "name": "Canver M.C."
                    },
                    {
                        "name": "Giugno R."
                    },
                    {
                        "name": "Pinello L."
                    }
                ],
                "citationCount": 6,
                "date": "2020-04-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "CRISPRitz: Rapid, high-throughput and variant-aware in silico off-target site identification for CRISPR genome editing"
            },
            "pmid": "31764961"
        }
    ],
    "topic": [
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Exome sequencing",
            "uri": "http://edamontology.org/topic_3676"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Genetic engineering",
            "uri": "http://edamontology.org/topic_3912"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ],
    "validated": 1
}
