{
    "additionDate": "2020-01-09T17:35:01Z",
    "biotoolsCURIE": "biotools:PhenoModifier",
    "biotoolsID": "PhenoModifier",
    "confidence_flag": "tool",
    "description": "PhenoModifier is a genetic modifier database for elucidating the genetic basis of human phenotypic variation.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Variant classification",
                    "uri": "http://edamontology.org/operation_3225"
                }
            ]
        }
    ],
    "homepage": "https://www.biosino.org/PhenoModifier",
    "lastUpdate": "2021-01-09T13:37:43Z",
    "name": "PhenoModifier",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/NAR/GKZ930",
            "metadata": {
                "abstract": "© 2019 The Author(s). Published by Oxford University Press on behalf of Nucleic Acids Research.From clinical observations to large-scale sequencing studies, the phenotypic impact of genetic modifiers is evident. To better understand the full spectrum of the genetic contribution to human disease, concerted efforts are needed to construct a useful modifier resource for interpreting the information from sequencing data. Here, we present the PhenoModifier (https://www.biosino.org/PhenoModifier), a manually curated database that provides a comprehensive overview of human genetic modifiers. By manually curating over ten thousand published articles, 3078 records of modifier information were entered into the current version of PhenoModifier, related to 288 different disorders, 2126 genetic modifier variants and 843 distinct modifier genes. To help users probe further into the mechanism of their interested modifier genes, we extended the yeast genetic interaction data and yeast quantitative trait loci to the human and we also integrated GWAS data into the PhenoModifier to assist users in evaluating all possible phenotypes associated with a modifier allele. As the first comprehensive resource of human genetic modifiers, PhenoModifier provides a more complete spectrum of genetic factors contributing to human phenotypic variation. The portal has a broad scientific and clinical scope, spanning activities relevant to variant interpretation for research purposes as well as clinical decision making.",
                "authors": [
                    {
                        "name": "Cai X."
                    },
                    {
                        "name": "Guo Y."
                    },
                    {
                        "name": "Jia J."
                    },
                    {
                        "name": "Lan X."
                    },
                    {
                        "name": "Li Y."
                    },
                    {
                        "name": "Liang Q."
                    },
                    {
                        "name": "Sun H."
                    },
                    {
                        "name": "Xie J."
                    },
                    {
                        "name": "Yu G."
                    },
                    {
                        "name": "Zhang G."
                    }
                ],
                "citationCount": 4,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "PhenoModifier: A genetic modifier database for elucidating the genetic basis of human phenotypic variation"
            },
            "pmid": "31642469"
        }
    ],
    "topic": [
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Human genetics",
            "uri": "http://edamontology.org/topic_3574"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        }
    ],
    "validated": 1
}
