{
    "accessibility": "Open access",
    "additionDate": "2022-06-09T08:42:24.383938Z",
    "biotoolsCURIE": "biotools:cainet",
    "biotoolsID": "cainet",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "christof.gebhardt@uni-ulm.de",
            "name": "J. Christof M. Gebhardt",
            "typeEntity": "Person"
        }
    ],
    "description": "Stochastic simulation tool for gene regulatory networks",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Modelling and simulation",
                    "uri": "http://edamontology.org/operation_2426"
                },
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                },
                {
                    "term": "Pathway analysis",
                    "uri": "http://edamontology.org/operation_3928"
                }
            ]
        }
    ],
    "homepage": "https://gitlab.com/GebhardtLab/CaiNet",
    "lastUpdate": "2022-06-09T08:42:24.386646Z",
    "license": "AGPL-3.0",
    "name": "CaiNet",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1186/S12859-021-04541-6",
            "metadata": {
                "abstract": "© 2021, The Author(s).Background: The temporal progression of many fundamental processes in cells and organisms, including homeostasis, differentiation and development, are governed by gene regulatory networks (GRNs). GRNs balance fluctuations in the output of their genes, which trace back to the stochasticity of molecular interactions. Although highly desirable to understand life processes, predicting the temporal progression of gene products within a GRN is challenging when considering stochastic events such as transcription factor–DNA interactions or protein production and degradation. Results: We report a method to simulate and infer GRNs including genes and biochemical reactions at molecular detail. In our approach, we consider each network element to be isolated from other elements during small time intervals, after which we synchronize molecule numbers across all network elements. Thereby, the temporal behaviour of network elements is decoupled and can be treated by local stochastic or deterministic solutions. We demonstrate the working principle of this modular approach with a repressive gene cascade comprising four genes. By considering a deterministic time evolution within each time interval for all elements, our method approaches the solution of the system of deterministic differential equations associated with the GRN. By allowing genes to stochastically switch between on and off states or by considering stochastic production of gene outputs, we are able to include increasing levels of stochastic detail and approximate the solution of a Gillespie simulation. Thereby, CaiNet is able to reproduce noise-induced bi-stability and oscillations in dynamically complex GRNs. Notably, our modular approach further allows for a simple consideration of deterministic delays. We further infer relevant regulatory connections and steady-state parameters of a GRN of up to ten genes from steady-state measurements by identifying each gene of the network with a single perceptron in an artificial neuronal network and using a gradient decent method originally designed to train recurrent neural networks. To facilitate setting up GRNs and using our simulation and inference method, we provide a fast computer-aided interactive network simulation environment, CaiNet. Conclusion: We developed a method to simulate GRNs at molecular detail and to infer the topology and steady-state parameters of GRNs. Our method and associated user-friendly framework CaiNet should prove helpful to analyze or predict the temporal progression of reaction networks or GRNs in cellular and organismic biology. CaiNet is freely available at https://gitlab.com/GebhardtLab/CaiNet.",
                "authors": [
                    {
                        "name": "Gebhardt J.C.M."
                    },
                    {
                        "name": "Hettich J."
                    }
                ],
                "date": "2022-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Periodic synchronization of isolated network elements facilitates simulating and inferring gene regulatory networks including stochastic molecular kinetics"
            },
            "pmcid": "PMC8729106",
            "pmid": "34986805"
        }
    ],
    "toolType": [
        "Workbench"
    ],
    "topic": [
        {
            "term": "Enzymes",
            "uri": "http://edamontology.org/topic_0821"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ],
    "validated": 1
}
