{
    "name": "PITUFO", 
    "description": "Java software to find minimal sets of precursors of target compounds in a metabolic network.", 
    "homepage": "http://sites.google.com/site/pitufosoftware", 
    "biotoolsID": "pitufo", 
    "biotoolsCURIE": "biotools:pitufo", 
    "version": [], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_3439", 
                    "term": "Pathway or network prediction"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Command-line tool"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_2259", 
            "term": "Systems biology"
        }, 
        {
            "uri": "http://edamontology.org/topic_0602", 
            "term": "Molecular interactions, pathways and networks"
        }
    ], 
    "operatingSystem": [
        "Linux", 
        "Windows", 
        "Mac"
    ], 
    "language": [
        "Java"
    ], 
    "license": null, 
    "collectionID": [], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [
        {
            "url": "http://www.mybiosoftware.com/pitufo-find-minimal-sets-precursors-target-compounds-metabolic-network.html", 
            "type": "Registry", 
            "note": null
        }
    ], 
    "download": [], 
    "documentation": [
        {
            "url": "https://sites.google.com/site/pitufosoftware/documentation", 
            "type": "General", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": null, 
            "pmid": "20838465", 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "Graph-based analysis of the metabolic exchanges between two co-resident intracellular symbionts, Baumannia cicadellinicola and Sulcia muelleri, with their insect host, Homalodisca coagulata", 
                "abstract": "Endosymbiotic bacteria from different species can live inside cells of the same eukaryotic organism. Metabolic exchanges occur between host and bacteria but also between different endocytobionts. Since a complete genome annotation is available for both, we built the metabolic network of two endosymbiotic bacteria, Sulcia muelleri and Baumannia cicadellinicola, that live inside specific cells of the sharpshooter Homalodisca coagulata and studied the metabolic exchanges involving transfers of carbon atoms between the three. We automatically determined the set of metabolites potentially exogenously acquired (seeds) for both metabolic networks. We show that the number of seeds needed by both bacteria in the carbon metabolism is extremely reduced. Moreover, only three seeds are common to both metabolic networks, indicating that the complementarity of the two metabolisms is not only manifested in the metabolic capabilities of each bacterium, but also by their different use of the same environment. Furthermore, our results show that the carbon metabolism of S. muelleri may be completely independent of the metabolic network of B. cicadellinicola. On the contrary, the carbon metabolism of the latter appears dependent on the metabolism of S. muelleri, at least for two essential amino acids, threonine and lysine. Next, in order to define which subsets of seeds (precursor sets) are sufficient to produce the metabolites involved in a symbiotic function, we used a graph-based method, PITUFO, that we recently developed. Our results highly refine our knowledge about the complementarity between the metabolisms of the two bacteria and their host. We thus indicate seeds that appear obligatory in the synthesis of metabolites are involved in the symbiotic function. Our results suggest both B. cicadellinicola and S. muelleri may be completely independent of the metabolites provided by the co-resident endocytobiont to produce the carbon backbone of the metabolites provided to the symbiotic system (i:e., thr and lys are only exploited by B. cicadellinicola to produce its proteins). © 2010 Cottret et al.", 
                "date": "2010-09-01T00:00:00Z", 
                "citationCount": 23, 
                "authors": [
                    {
                        "name": "Cottret L."
                    }, 
                    {
                        "name": "Milreu P.V."
                    }, 
                    {
                        "name": "Acuna V."
                    }, 
                    {
                        "name": "Marchetti-Spaccamela A."
                    }, 
                    {
                        "name": "Stougie L."
                    }, 
                    {
                        "name": "Charles H."
                    }, 
                    {
                        "name": "Sagot M.-F."
                    }
                ], 
                "journal": "PLoS Computational Biology"
            }
        }
    ], 
    "credit": [
        {
            "name": null, 
            "email": null, 
            "url": "https://sites.google.com/site/lcottret/", 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "mbs_import", 
    "additionDate": "2017-08-03T18:54:12Z", 
    "lastUpdate": "2018-12-10T12:58:55Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 1, 
    "homepage_status": 0, 
    "elixir_badge": 0
}