{
    "additionDate": "2017-01-13T13:16:55Z",
    "biotoolsCURIE": "biotools:useq",
    "biotoolsID": "useq",
    "credit": [
        {
            "email": "David.Nix@hci.utah.edu",
            "name": "David Nix",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Collection of software tools for for both low and high level analysis of next generation, ultra high throughput signature sequencing data from the Solexa, SOLiD, and 454 platforms. Initial emphasis: chIP-seq and RNA-Seq with FDR estimations",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://useq.sourceforge.net/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequencing quality control",
                    "uri": "http://edamontology.org/operation_3218"
                }
            ]
        }
    ],
    "homepage": "http://useq.sourceforge.net/",
    "language": [
        "Java"
    ],
    "lastUpdate": "2024-11-24T20:27:09.101760Z",
    "license": "BSD-3-Clause",
    "maturity": "Mature",
    "name": "USeq",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "otherID": [
        {
            "type": "rrid",
            "value": "RRID:SCR_004753"
        }
    ],
    "owner": "seqwiki_import",
    "publication": [
        {
            "doi": "10.1186/1471-2105-9-523",
            "metadata": {
                "abstract": "Background: High throughput signature sequencing holds many promises, one of which is the ready identification of in vivo transcription factor binding sites, histone modifications, changes in chromatin structure and patterns of DNA methylation across entire genomes. In these experiments, chromatin immunoprecipitation is used to enrich for particular DNA sequences of interest and signature sequencing is used to map the regions to the genome (ChIP-Seq). Elucidation of these sites of DNA-protein binding/modification are proving instrumental in reconstructing networks of gene regulation and chromatin remodelling that direct development, response to cellular perturbation, and neoplastic transformation. Results: Here we present a package of algorithms and software that makes use of control input data to reduce false positives and estimate confidence in ChIP-Seq peaks. Several different methods were compared using two simulated spike-in datasets. Use of control input data and a normalized difference score were found to more than double the recovery of ChIP-Seq peaks at a 5% false discovery rate (FDR). Moreover, both a binomial p-value/q-value and an empirical FDR were found to predict the true FDR within 2-3 fold and are more reliable estimators of confidence than a global Poisson p-value. These methods were then used to reanalyze Johnson et al.'s neuron-restrictive silencer factor (NRSF) ChIP-Seq data without relying on extensive qPCR validated NRSF sites and the presence of NRSF binding motifs for setting thresholds. Conclusion: The methods developed and tested here show considerable promise for reducing false positives and estimating confidence in ChIP-Seq data without any prior knowledge of the chIP target. They are part of a larger open source package freely available from http://useq.sourceforge.net/. © 2008 Nix et al; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Boucher K.M."
                    },
                    {
                        "name": "Courdy S.J."
                    },
                    {
                        "name": "Nix D.A."
                    }
                ],
                "citationCount": 171,
                "date": "2008-12-05T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Empirical methods for controlling false positives and estimating confidence in ChIP-Seq peaks"
            },
            "pmcid": "PMC2628906",
            "pmid": "19061503"
        }
    ],
    "toolType": [
        "Suite"
    ],
    "topic": [
        {
            "term": "ChIP-seq",
            "uri": "http://edamontology.org/topic_3169"
        },
        {
            "term": "Data quality management",
            "uri": "http://edamontology.org/topic_3572"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ],
    "validated": 1
}
