{
    "additionDate": "2020-01-14T20:04:47Z",
    "biotoolsCURIE": "biotools:SeqDivA",
    "biotoolsID": "SeqDivA",
    "confidence_flag": "tool",
    "description": "Graph Theory-Based Sequence Descriptors as Remote Homology Predictors.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "De-novo assembly",
                    "uri": "http://edamontology.org/operation_0524"
                },
                {
                    "term": "Protein feature detection",
                    "uri": "http://edamontology.org/operation_3092"
                },
                {
                    "term": "k-mer counting",
                    "uri": "http://edamontology.org/operation_3472"
                }
            ]
        }
    ],
    "homepage": "https://github.com/eancedeg/SeqDivA",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T20:48:47.051431Z",
    "license": "GPL-3.0",
    "name": "SeqDivA",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.3390/biom10010026",
            "metadata": {
                "abstract": "Alignment-free (AF) methodologies have increased in popularity in the last decades as alternative tools to alignment-based (AB) algorithms for performing comparative sequence analyses. They have been especially useful to detect remote homologs within the twilight zone of highly diverse gene/protein families and superfamilies. The most popular alignment-free methodologies, as well as their applications to classification problems, have been described in previous reviews. Despite a new set of graph theory-derived sequence/structural descriptors that have been gaining relevance in the detection of remote homology, they have been omitted as AF predictors when the topic is addressed. Here, we first go over the most popular AF approaches used for detecting homology signals within the twilight zone and then bring out the state-of-the-art tools encoding graph theory-derived sequence/structure descriptors and their success for identifying remote homologs. We also highlight the tendency of integrating AF features/measures with the AB ones, either into the same prediction model or by assembling the predictions from different algorithms using voting/weighting strategies, for improving the detection of remote signals. Lastly, we briefly discuss the efforts made to scale up AB and AF features/measures for the comparison of multiple genomes and proteomes. Alongside the achieved experiences in remote homology detection by both the most popular AF tools and other less known ones, we provide our own using the graphical–numerical methodologies, MARCH-INSIDE, TI2BioP, and ProtDCal. We also present a new Python-based tool (SeqDivA) with a friendly graphical user interface (GUI) for delimiting the twilight zone by using several similar criteria.",
                "authors": [
                    {
                        "name": "Aguero-Chapin G."
                    },
                    {
                        "name": "Ancede-Gallardo E."
                    },
                    {
                        "name": "Antunes A."
                    },
                    {
                        "name": "Galpert D."
                    },
                    {
                        "name": "Molina-Ruiz R."
                    },
                    {
                        "name": "Perez-Machado G."
                    },
                    {
                        "name": "de la Riva G.A."
                    }
                ],
                "citationCount": 12,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Biomolecules",
                "title": "Graph theory-based sequence descriptors as remote homology predictors"
            },
            "pmcid": "PMC7022958",
            "pmid": "31878100"
        }
    ],
    "topic": [
        {
            "term": "Bioinformatics",
            "uri": "http://edamontology.org/topic_0091"
        },
        {
            "term": "Gene and protein families",
            "uri": "http://edamontology.org/topic_0623"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Sequence sites, features and motifs",
            "uri": "http://edamontology.org/topic_0160"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ],
    "validated": 1
}
