{
    "additionDate": "2020-01-14T19:36:03Z",
    "biotoolsCURIE": "biotools:Kmasker_plants",
    "biotoolsID": "Kmasker_plants",
    "confidence_flag": "tool",
    "description": "A tool for assessing complex sequence space in plant species.\n\nKmasker - a tool for masking and exploring of sequences from plant species.\n\na versatile tool for masking and exploring of sequences from plant species.\n\nKmasker plants is a tool for the automatic detection of sequence regions with meaningful k-mer characteristics. This can be sequences with highly abundant k-mer patterns (repeats), regions with diverging k-mer patterns between two studied WGS samples or segments with high target specificity.\n\nThe installation instructions are available at: INSTALL.md. There, you find our list of requirements of external tools. Please make sure, that these are in your PATH environemnt if you installed from source. If not please specify them in the 'etc/kmasker.config' file.\n\nKmasker uses an interal repository for reuse of kindex structures.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genome indexing",
                    "uri": "http://edamontology.org/operation_3211"
                },
                {
                    "term": "Genome assembly",
                    "uri": "http://edamontology.org/operation_0525"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Sequence masking",
                    "uri": "http://edamontology.org/operation_0368"
                },
                {
                    "term": "k-mer counting",
                    "uri": "http://edamontology.org/operation_3472"
                }
            ]
        }
    ],
    "homepage": "https://kmasker.ipk-gatersleben.de",
    "language": [
        "R",
        "C++",
        "Perl",
        "Python"
    ],
    "lastUpdate": "2020-12-14T14:21:24Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/tschmutzer/kmasker"
        }
    ],
    "name": "Kmasker plants",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1111/TPJ.14645",
            "metadata": {
                "abstract": "© 2019 The Authors. The Plant Journal published by Society for Experimental Biology and John Wiley & Sons LtdMany plant genomes display high levels of repetitive sequences. The assembly of these complex genomes using short high-throughput sequence reads is still a challenging task. Underestimation or disregard of repeat complexity in these datasets can easily misguide downstream analysis. Detection of repetitive regions by k-mer counting methods has proved to be reliable. Easy-to-use applications utilizing k-mer counting are in high demand, especially in the domain of plants. We present Kmasker plants, a tool that uses k-mer count information as an assistant throughout the analytical workflow of genome data that is provided as a command-line and web-based solution. Beside its core competence to screen and mask repetitive sequences, we have integrated features that enable comparative studies between different cultivars or closely related species and methods that estimate target specificity of guide RNAs for application of site-directed mutagenesis using Cas9 endonuclease. In addition, we have set up a web service for Kmasker plants that maintains pre-computed indices for 10 of the economically most important cultivated plants. Source code for Kmasker plants has been made publically available at https://github.com/tschmutzer/kmasker. The web service is accessible at https://kmasker.ipk-gatersleben.de.",
                "authors": [
                    {
                        "name": "Beier S."
                    },
                    {
                        "name": "Ulpinnis C."
                    },
                    {
                        "name": "Schwalbe M."
                    },
                    {
                        "name": "Munch T."
                    },
                    {
                        "name": "Hoffie R."
                    },
                    {
                        "name": "Koeppel I."
                    },
                    {
                        "name": "Hertig C."
                    },
                    {
                        "name": "Budhagatapalli N."
                    },
                    {
                        "name": "Hiekel S."
                    },
                    {
                        "name": "Pathi K.M."
                    },
                    {
                        "name": "Hensel G."
                    },
                    {
                        "name": "Grosse M."
                    },
                    {
                        "name": "Chamas S."
                    },
                    {
                        "name": "Gerasimova S."
                    },
                    {
                        "name": "Kumlehn J."
                    },
                    {
                        "name": "Scholz U."
                    },
                    {
                        "name": "Schmutzer T."
                    }
                ],
                "citationCount": 3,
                "date": "2020-05-01T00:00:00Z",
                "journal": "Plant Journal",
                "title": "Kmasker plants – a tool for assessing complex sequence space in plant species"
            },
            "pmid": "31823436"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        },
        {
            "term": "Whole genome sequencing",
            "uri": "http://edamontology.org/topic_3673"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        },
        {
            "term": "Genetic engineering",
            "uri": "http://edamontology.org/topic_3912"
        }
    ],
    "validated": 1
}