{
    "additionDate": "2017-12-18T00:14:12Z",
    "biotoolsCURIE": "biotools:wasp",
    "biotoolsID": "wasp",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www4a.biotec.or.th/GI"
        },
        {
            "email": "sissades@biotec.or.th",
            "name": "Sissades Tongsima",
            "orcidid": "http://orcid.org/0000-0002-1491-1839",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Application that designs allele-specific (AS) primers for detecting SNPs and mutations. WASP input can be either key searches (Section A) or SNPs with flanking sequences (Section B).",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "PCR primer design",
                    "uri": "http://edamontology.org/operation_0308"
                }
            ]
        }
    ],
    "homepage": "http://www4a.biotec.or.th/GI/tools/wasp",
    "language": [
        "Ruby"
    ],
    "lastUpdate": "2019-01-17T23:16:53Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/wasp-web-based-allele-specific-pcr-assay-designing-tool.html"
        }
    ],
    "name": "WASP",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1186/1471-2164-8-275",
            "metadata": {
                "abstract": "Background: Allele-specific (AS) Polymerase Chain Reaction is a convenient and inexpensive method for genotyping Single Nucleotide Polymorphisms (SNPs) and mutations. It is applied in many recent studies including population genetics, molecular genetics and pharmacogenomics. Using known AS primer design tools to create primers leads to cumbersome process to inexperience users since information about SNP/mutation must be acquired from public databases prior to the design. Furthermore, most of these tools do not offer the mismatch enhancement to designed primers. The available web applications do not provide user-friendly graphical input interface and intuitive visualization of their primer results. Results: This work presents a web-based AS primer design application called WASP. This tool can efficiently design AS primers for human SNPs as well as mutations. To assist scientists with collecting necessary information about target polymorphisms, this tool provides a local SNP database containing over 10 million SNPs of various populations from public domain databases, namely NCBI dbSNP, HapMap and JSNP respectively. This database is tightly integrated with the tool so that users can perform the design for existing SNPs without going off the site. To guarantee specificity of AS primers, the proposed system incorporates a primer specificity enhancement technique widely used in experiment protocol. In particular, WASP makes use of different destabilizing effects by introducing one deliberate 'mismatch' at the penultimate (second to last of the 3'-end) base of AS primers to improve the resulting AS primers. Furthermore, WASP offers graphical user interface through scalable vector graphic (SVG) draw that allow users to select SNPs and graphically visualize designed primers and their conditions. Conclusion: WASP offers a tool for designing AS primers for both SNPs and mutations. By integrating the database for known SNPs (using gene ID or rs number), this tool facilitates the awkward process of getting flanking sequences and other related information from public SNP databases. It takes into account the underlying destabilizing effect to ensure the effectiveness of designed primers. With user-friendly SVG interface, WASP intuitively presents resulting designed primers, which assist users to export or to make further adjustment to the design. This software can be freely accessed at http://bioinfo.biotec.or.th/WASP. © 2007 Wangkumhang et al; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Wangkumhang P."
                    },
                    {
                        "name": "Chaichoompu K."
                    },
                    {
                        "name": "Ngamphiw C."
                    },
                    {
                        "name": "Ruangrit U."
                    },
                    {
                        "name": "Chanprasert J."
                    },
                    {
                        "name": "Assawamakin A."
                    },
                    {
                        "name": "Tongsima S."
                    }
                ],
                "citationCount": 85,
                "date": "2007-08-14T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "WASP: A Web-based Allele-Specific PCR assay designing tool for detecting SNPs and mutations"
            },
            "pmcid": "PMC1976135",
            "pmid": "17697334",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "PCR experiment",
            "uri": "http://edamontology.org/topic_3519"
        },
        {
            "term": "Probes and primers",
            "uri": "http://edamontology.org/topic_0632"
        },
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        }
    ],
    "validated": 1
}