{
    "accessibility": "Open access",
    "additionDate": "2022-03-21T13:09:53.061380Z",
    "biotoolsCURIE": "biotools:ltr_retriever",
    "biotoolsID": "ltr_retriever",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Ning Jiang",
            "orcidid": "https://orcid.org/0000-0002-2776-6669",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "name": "Shujun Ou",
            "orcidid": "https://orcid.org/0000-0001-5938-7180",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "LTR_retriever is a highly accurate and sensitive program for identification of LTR retrotransposons; The LTR Assembly Index (LAI) is also included in this package.",
    "editPermission": {
        "type": "private"
    },
    "homepage": "https://github.com/oushujun/LTR_retriever",
    "language": [
        "Perl"
    ],
    "lastUpdate": "2022-03-21T13:09:53.063853Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/oushujun/LTR_retriever/issues"
        }
    ],
    "name": "LTR_retriever",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1104/pp.17.01310",
            "metadata": {
                "abstract": "© 2018 American Society of Plant Biologists. All rights reserved.Long terminal repeat retrotransposons (LTR-RTs) are prevalent in plant genomes. The identification of LTR-RTs is critical for achieving high-quality gene annotation. Based on the well-conserved structure, multiple programs were developed for the de novo identification of LTR-RTs; however, these programs are associated with low specificity and high false discovery rates. Here, we report LTR_retriever, a multithreading-empowered Perl program that identifies LTR-RTs and generates high-quality LTR libraries from genomic sequences. LTR_retriever demonstrated significant improvements by achieving high levels of sensitivity (91%), specificity (97%), accuracy (96%), and precision (90%) in rice (Oryza sativa). LTR_retriever is also compatible with long sequencing reads. With 40k self-corrected PacBio reads equivalent to 4.5× genome coverage in Arabidopsis (Arabidopsis thaliana), the constructed LTR library showed excellent sensitivity and specificity. In addition to canonical LTRRTs with 5′-TG.CA-3′ termini, LTR_retriever also identifies noncanonical LTR-RTs (non-TGCA), which have been largely ignored in genome-wide studies. We identified seven types of noncanonical LTRs from 42 out of 50 plant genomes. The majority of noncanonical LTRs are Copia elements, with which the LTR is four times shorter than that of other Copia elements, which may be a result of their target specificity. Strikingly, non-TGCA Copia elements are often located in genic regions and preferentially insert nearby or within genes, indicating their impact on the evolution of genes and their potential as mutagenesis tools.",
                "authors": [
                    {
                        "name": "Jiang N."
                    },
                    {
                        "name": "Ou S."
                    }
                ],
                "citationCount": 175,
                "date": "2018-02-01T00:00:00Z",
                "journal": "Plant Physiology",
                "title": "LTR_retriever: A highly accurate and sensitive program for identification of long terminal repeat retrotransposons"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ]
}
