{
    "additionDate": "2017-08-20T15:39:00Z",
    "biotoolsCURIE": "biotools:emmax",
    "biotoolsID": "emmax",
    "collectionID": [
        "Animal and Crop Genomics"
    ],
    "credit": [
        {
            "email": "h3kang@umich.edu",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Efficient Mixed-Model Association eXpedited is a statistical test for large scale human or model organism association mapping accounting for the sample structure. In addition to the efficiency obtained by the EMMA algorithm, EMMAX takes advantage of the fact that each locus explains only a small fraction of complex traits allowing the avoidance of repetitive variance component estimation procedures.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://genetics.cs.ucla.edu/emmax/install.html"
        }
    ],
    "editPermission": {
        "authors": [
            "animalandcropgenomics"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genetic mapping",
                    "uri": "http://edamontology.org/operation_0282"
                }
            ]
        }
    ],
    "homepage": "http://genetics.cs.ucla.edu/emmax/",
    "language": [
        "C++",
        "C"
    ],
    "lastUpdate": "2020-01-19T17:47:47Z",
    "license": "Not licensed",
    "name": "EMMAX",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "admin",
    "publication": [
        {
            "doi": "10.1038/ng.548",
            "metadata": {
                "abstract": "Although genome-wide association studies (GWASs) have identified numerous loci associated with complex traits, imprecise modeling of the genetic relatedness within study samples may cause substantial inflation of test statistics and possibly spurious associations. Variance component approaches, such as efficient mixed-model association (EMMA), can correct for a wide range of sample structures by explicitly accounting for pairwise relatedness between individuals, using high-density markers to model the phenotype distribution; but such approaches are computationally impractical. We report here a variance component approach implemented in publicly available software, EMMA eXpedited (EMMAX), that reduces the computational time for analyzing large GWAS data sets from years to hours. We apply this method to two human GWAS data sets, performing association analysis for ten quantitative traits from the Northern Finland Birth Cohort and seven common diseases from the Wellcome Trust Case Control Consortium. We find that EMMAX outperforms both principal component analysis and genomic control in correcting for sample structure. © 2010 Nature America, Inc. All rights reserved.",
                "authors": [
                    {
                        "name": "Kang H.M."
                    },
                    {
                        "name": "Sul J.H."
                    },
                    {
                        "name": "Service S.K."
                    },
                    {
                        "name": "Zaitlen N.A."
                    },
                    {
                        "name": "Kong S.-Y."
                    },
                    {
                        "name": "Freimer N.B."
                    },
                    {
                        "name": "Sabatti C."
                    },
                    {
                        "name": "Eskin E."
                    }
                ],
                "citationCount": 1353,
                "date": "2010-04-01T00:00:00Z",
                "journal": "Nature Genetics",
                "title": "Variance component model to account for sample structure in genome-wide association studies"
            },
            "pmcid": "PMC3092069",
            "pmid": "20208533",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "GWAS study",
            "uri": "http://edamontology.org/topic_3517"
        }
    ],
    "validated": 1
}