{
    "additionDate": "2022-06-25T13:23:38.786130Z",
    "biotoolsCURIE": "biotools:e-volve",
    "biotoolsID": "e-volve",
    "collectionID": [
        "COVID-19"
    ],
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "raquelcm@dcc.ufmg.br",
            "name": "Raquel de Melo-Minardi",
            "orcidid": "https://orcid.org/0000-0001-5190-100X",
            "typeEntity": "Person"
        }
    ],
    "description": "Evolve is a Webtool designed to model mutations in the input protein complex using Modeller.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Molecular docking",
                    "uri": "http://edamontology.org/operation_0478"
                },
                {
                    "term": "Side chain modelling",
                    "uri": "http://edamontology.org/operation_0480"
                },
                {
                    "term": "Simulation analysis",
                    "uri": "http://edamontology.org/operation_0244"
                },
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                },
                {
                    "term": "Variant effect prediction",
                    "uri": "http://edamontology.org/operation_0331"
                }
            ]
        }
    ],
    "homepage": "http://bioinfo.dcc.ufmg.br/evolve",
    "lastUpdate": "2024-11-24T16:01:15.700635Z",
    "license": "Not licensed",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "http://bioinfo.dcc.ufmg.br/evolve/results"
        }
    ],
    "name": "E-Volve",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.7717/peerj.13099",
            "metadata": {
                "abstract": "Background: The SARS-CoV-2 pandemic reverberated, posing health and social hygiene obstacles throughout the globe. Mutant lineages of the virus have concerned scientists because of convergent amino acid alterations, mainly on the viral spike protein. Studies have shown that mutants have diminished activity of neutralizing antibodies and enhanced affinity with its human cell receptor, the ACE2 protein. Methods: Hence, for real-time measuring of the impacts caused by variant strains in such complexes, we implemented E-Volve, a tool designed to model a structure with a list of mutations requested by users and return analyses of the variant protein. As a proof of concept, we scrutinized the spike-antibody and spike-ACE2 complexes formed in the variants of concern, B.1.1.7 (Alpha), B.1.351 (Beta), and P.1 (Gamma), by using contact maps depicting the interactions made amid them, along with heat maps to quantify these major interactions. Results: The results found in this study depict the highly frequent interface changes made by the entire set of mutations, mainly conducted by N501Y and E484K. In the spike-Antibody complex, we have noticed alterations concerning electrostatic surface complementarity, breaching essential sites in the P17 and BD-368-2 antibodies. Alongside, the spike-ACE2 complex has presented new hydrophobic bonds. Discussion: Molecular dynamics simulations followed by Poisson-Boltzmann calculations corroborate the higher complementarity to the receptor and lower to the antibodies for the K417T/E484K/N501Y (Gamma) mutant compared to the wild-type strain, as pointed by E-Volve, as well as an intensification of this effect by changes at the protein conformational equilibrium in solution. A local disorder of the loop a1'/β1', as well its possible effects on the affinity to the BD-368-2 antibody were also incorporated to the final conclusions after this analysis. Moreover, E-Volve can depict the main alterations in important biological structures, as shown in the SARSCoV- 2 complexes, marking a major step in the real-time tracking of the virus mutant lineages. E-Volve is available at http://bioinfo.dcc.ufmg.br/evolve.",
                "authors": [
                    {
                        "name": "Bastos L."
                    },
                    {
                        "name": "Dos Santos V.P."
                    },
                    {
                        "name": "Dutra G."
                    },
                    {
                        "name": "Lobo Y.J.G."
                    },
                    {
                        "name": "Maia G."
                    },
                    {
                        "name": "Mariano D."
                    },
                    {
                        "name": "Mendes E."
                    },
                    {
                        "name": "Mendonca J.G."
                    },
                    {
                        "name": "Rocha G."
                    },
                    {
                        "name": "Rodrigues A."
                    },
                    {
                        "name": "Werhli A.V."
                    },
                    {
                        "name": "de Lima L.H.F."
                    },
                    {
                        "name": "de Melo-Minardi R."
                    },
                    {
                        "name": "dos Santos Machado K."
                    }
                ],
                "citationCount": 4,
                "date": "2022-03-22T00:00:00Z",
                "journal": "PeerJ",
                "title": "E-Volve: understanding the impact of mutations in SARS-CoV-2 variants spike protein on antibodies and ACE2 affinity through patterns of chemical interactions at protein interfaces"
            },
            "pmcid": "PMC8953562",
            "pmid": "35341044"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "Protein variants",
            "uri": "http://edamontology.org/topic_3120"
        },
        {
            "term": "Public health and epidemiology",
            "uri": "http://edamontology.org/topic_3305"
        }
    ],
    "validated": 1
}
