{
    "additionDate": "2017-02-10T14:15:38Z",
    "biotoolsCURIE": "biotools:pdb_hydro",
    "biotoolsID": "pdb_hydro",
    "credit": [
        {
            "email": "delarue@pasteur.fr",
            "name": "Marc Delarue",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "PDB_Hydro provides tools for mutating and solvating structures of biological macromolecules like proteins or DNA. It identifies strongly and poorly solvated exposed surfaces of structures in an effort to help identify potential interaction zones.",
    "documentation": [
        {
            "type": "General",
            "url": "http://lorentz.immstr.pasteur.fr/solvate_mutate.php"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Molecular surface calculation",
                    "uri": "http://edamontology.org/operation_0387"
                }
            ]
        }
    ],
    "homepage": "http://lorentz.immstr.pasteur.fr/solvate_mutate.php",
    "lastUpdate": "2018-12-10T12:58:56Z",
    "name": "PDB_Hydro",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "We describe a new way to calculate the electrostatic properties of macromolecules which eliminates the assumption of a constant dielectric value in the solvent region, resulting in a Generalized Poisson-Boltzmann-Langevin equation (GPBLE). We have implemented a web server (http://lorentz.immstr.pasteur.fr/pdb_hydro.php) that both numerically solves this equation and uses the resulting water density profiles to place water molecules at preferred sites of hydration. Surface atoms with high or low hydration preference can be easily displayed using a simple PyMol script, allowing for the tentative prediction of the dimerization interface in homodimeric proteins, or lipid binding regions in membrane proteins. The web site includes options that permit mutations in the sequence as well as reconstruction of missing side chain and/or main chain atoms. These tools are accessible independently from the electrostatics calculation, and can be used for other modeling purposes. We expect this web server to be useful to structural biologists, as the knowledge of solvent density should prove useful to get better fits at low resolution for X-ray diffraction data and to computational biologists, for whom these profiles could improve the calculation of interaction energies in water between ligands and receptors in docking simulations. © The Author 2006. Published by Oxford University Press. All rights reserved.",
                "authors": [
                    {
                        "name": "Azuara C."
                    },
                    {
                        "name": "Lindahl E."
                    },
                    {
                        "name": "Koehl P."
                    },
                    {
                        "name": "Orland H."
                    },
                    {
                        "name": "Delarue M."
                    }
                ],
                "citationCount": 49,
                "date": "2006-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "PDB_Hydro: Incorporating dipolar solvents with variable density in the Poisson-Boltzmann treatment of macromolecule electrostatics"
            },
            "pmid": "16845031"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Protein structural motifs and surfaces",
            "uri": "http://edamontology.org/topic_0166"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        },
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        }
    ],
    "validated": 1
}