{
    "additionDate": "2020-01-14T20:19:59Z",
    "biotoolsCURIE": "biotools:lung",
    "biotoolsID": "lung",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "llopezk@unal.edu.co",
            "name": "Liliana López-Kleine",
            "typeEntity": "Person"
        },
        {
            "email": "rojas-adriana@javeriana.edu.co",
            "name": "Adriana Rojas",
            "typeEntity": "Person"
        }
    ],
    "description": "Joint Transcriptomic Analysis of Lung Cancer and Other Lung Diseases.\n\nKaplan Meier-plotter [Lung cancer].\n\nOur aim was to develop an online Kaplan-Meier plotter which can be used to assess the effect of the genes on breast cancer prognosis.\n\nNotice: Use of undefined constant filterByMrna - assumed 'filterByMrna' in /var/www/kaplanmeier/analysis/index.php on line 94 Breast cancerOvarian cancerLung cancerGastric cancer Notice: Use of undefined constant filterByRnaseq - assumed 'filterByRnaseq' in /var/www/kaplanmeier/analysis/index.php on line 97 Liver cancerPan-cancer Notice: Use of undefined constant filterByMirna - assumed 'filterByMirna' in /var/www/kaplanmeier/analysis/index.php on line 100 Breast cancerLiver cancerPan-cancer Notice: Use of undefined constant filterByProtein - assumed 'filterByProtein' in /var/www/kaplanmeier/analysis/index.php on line 103 Breast cancer.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Expression correlation analysis",
                    "uri": "http://edamontology.org/operation_3463"
                },
                {
                    "term": "Differential gene expression analysis",
                    "uri": "http://edamontology.org/operation_3223"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Weighted correlation network analysis",
                    "uri": "http://edamontology.org/operation_3766"
                }
            ]
        }
    ],
    "homepage": "http://kmplot.com/analysis/index.php?p=service&cancer=lung",
    "language": [
        "R"
    ],
    "lastUpdate": "2020-12-22T13:32:04Z",
    "name": "lung",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.3389/FGENE.2019.01260",
            "metadata": {
                "abstract": "© Copyright © 2019 Otálora-Otálora, Florez, López-Kleine, Canas Arboleda, Grajales Urrego and Rojas.Background: Epidemiological and clinical evidence points cancer comorbidity with pulmonary chronic disease. The acquisition of some hallmarks of cancer by cells affected with lung pathologies as a cell adaptive mechanism to a shear stress, suggests that could be associated with the establishment of tumoral processes. Objective: To propose a bioinformatic pipeline for the identification of all deregulated genes and the transcriptional regulators (TFs) that are coexpressed during lung cancer establishment, and therefore could be important for the acquisition of the hallmarks of cancer. Methods: Ten microarray datasets (six of lung cancer, four of lung diseases) comparing normal and diseases-related lung tissue were selected to identify hub differentiated expressed genes (DEGs) in common between lung pathologies and lung cancer, along with transcriptional regulators through the utilization of specialized libraries from R language. DAVID bioinformatics tool for gene enrichment analyses was used to identify genes with experimental evidence associated to tumoral processes and signaling pathways. Coexpression networks of DEGs and TFs in lung cancer establishment were created with Coexnet library, and a survival analysis of the main hub genes was made. Results: Two hundred ten DEGs were identified in common between lung cancer and other lung diseases related to the acquisition of tumoral characteristics, which are coexpressed in a lung cancer network with TFs, suggesting that could be related to the establishment of the tumoral pathology in lung. The comparison of the coexpression networks of lung cancer and other lung diseases allowed the identification of common connectivity patterns (CCPs) with DEGs and TFs correlated to important tumoral processes and signaling pathways, that haven´t been studied to experimentally validate their role in the early stages of lung cancer. Some of the TFs identified showed a correlation between its expression levels and the survival of lung cancer patients. Conclusion: Our findings indicate that lung diseases share genes with lung cancer which are coexpressed in lung cancer, and might be able to explain the epidemiological observations that point to direct and inverse comorbid associations between some chronic lung diseases and lung cancer and represent a complex transcriptomic scenario.",
                "authors": [
                    {
                        "name": "Otalora-Otalora B.A."
                    },
                    {
                        "name": "Florez M."
                    },
                    {
                        "name": "Lopez-Kleine L."
                    },
                    {
                        "name": "Canas Arboleda A."
                    },
                    {
                        "name": "Grajales Urrego D.M."
                    },
                    {
                        "name": "Rojas A."
                    }
                ],
                "date": "2019-12-06T00:00:00Z",
                "journal": "Frontiers in Genetics",
                "title": "Joint Transcriptomic Analysis of Lung Cancer and Other Lung Diseases"
            },
            "pmcid": "PMC6908522",
            "pmid": "31867044"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        },
        {
            "term": "Public health and epidemiology",
            "uri": "http://edamontology.org/topic_3305"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ],
    "validated": 1
}