{
    "additionDate": "2020-01-14T19:49:15Z",
    "biotoolsCURIE": "biotools:Min3",
    "biotoolsID": "Min3",
    "confidence_flag": "high",
    "description": "Predict microRNA target gene using an improved binding-site representation method and support vector machine.\n\nmicroRNA.org - Targets and Expression.\n\nPredicted microRNA targets & target downregulation scores. Experimentally observed expression patterns.\n\nAugust 2010 Release Last Update: 2010-11-01 [ release notes ].\n\nfuzzy search (\"let-7\" will match \"let-7a\", \"let-7b\", etc.)",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Binding site prediction",
                    "uri": "http://edamontology.org/operation_2575"
                },
                {
                    "term": "miRNA target prediction",
                    "uri": "http://edamontology.org/operation_0463"
                }
            ]
        }
    ],
    "homepage": "http://microRNA.org",
    "lastUpdate": "2020-01-14T19:49:15Z",
    "name": "Min3",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1142/S021972001950032X",
            "metadata": {
                "abstract": "© 2019 World Scientific Publishing Europe Ltd.MicroRNAs are single-stranded noncoding RNAs known to down-regulate target genes at the protein or mRNA level. Computational prediction of targets is essential for elucidating the detailed functions of microRNA. However, prediction specificity and sensitivity of the existing algorithms still need to be improved to generate useful hypotheses for subsequent experimental testing. A new microRNA binding-site representation method was developed, which uses four symbols \"|\", \"\", \"\", and \"|\" (indicating paired, unpaired, insertion, and bulge, respectively) to represent the status of each nucleotide base pair in the microRNA binding site. New features were established with the information of every two adjacent symbols. There are 12 possible combinations and the frequency of each defines a set of novel and useful features. A comprehensive training dataset is constructed for mammalian microRNAs with positive targets obtained from the microRNA target depository in the miRTarbase, while negative targets were derived from pseudo-microRNA bindings. An SVM model was established using the training dataset and a new software called Min3 was developed. Performance of Min3 was assessed with intensively studied examples of miR-155 and miR-92a. Prediction results showed that Min3 can discover 47% of experimental conformed targets on average. The overlapping is above 20% on average when compared with TargetScan and miRanda. Annotations of the public microRNA datasets showed that there is a negative effect (up-regulation) of the Min3 targets for the knock out/down of miR-155 and miR-92a. Six top ranked targets were selected for validation by wet-lab experiments, and five of them showed a regulation effect. The Min3 can be a good alternative to current microRNA target discovery software. This tool is available at https://sourceforge.net/projects/mirt3.",
                "authors": [
                    {
                        "name": "Huang T."
                    },
                    {
                        "name": "Huang X."
                    },
                    {
                        "name": "Yao M."
                    }
                ],
                "date": "2019-10-01T00:00:00Z",
                "journal": "Journal of Bioinformatics and Computational Biology",
                "title": "Min3: Predict microRNA target gene using an improved binding-site representation method and support vector machine"
            },
            "pmid": "31856668"
        }
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        }
    ]
}