{
    "additionDate": "2020-01-09T18:34:18Z",
    "biotoolsCURIE": "biotools:soil_domestication",
    "biotoolsID": "soil_domestication",
    "confidence_flag": "very low",
    "credit": [
        {
            "email": "sundar@ucdavis.edu",
            "name": "Venkatesan Sundaresan",
            "orcidid": "https://orcid.org/0000-0002-4670-0630",
            "typeEntity": "Person"
        }
    ],
    "description": "Soil domestication by rice cultivation results in plant-soil feedback through shifts in soil microbiota.\n\nAnalysis and figures for upcoming manuscript. Updated regularly, until it is not.\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'soil microbiota', 'monoculture', 'monoculture cultivation', 'microbiota'",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://github.com/bulksoil/SoilDomestication",
    "language": [
        "R"
    ],
    "lastUpdate": "2020-01-09T18:34:18Z",
    "license": "GPL-3.0",
    "name": "soil domestication",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S13059-019-1825-X",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Soils are a key component of agricultural productivity, and soil microbiota determine the availability of many essential plant nutrients. Agricultural domestication of soils, that is, the conversion of previously uncultivated soils to a cultivated state, is frequently accompanied by intensive monoculture, especially in the developing world. However, there is limited understanding of how continuous cultivation alters the structure of prokaryotic soil microbiota after soil domestication, including to what extent crop plants impact soil microbiota composition, and how changes in microbiota composition arising from cultivation affect crop performance. Results: We show here that continuous monoculture (> 8 growing seasons) of the major food crop rice under flooded conditions is associated with a pronounced shift in soil bacterial and archaeal microbiota structure towards a more consistent composition, thereby domesticating microbiota of previously uncultivated sites. Aside from the potential effects of agricultural cultivation practices, we provide evidence that rice plants themselves are important drivers of the domestication process, acting through selective enrichment of specific taxa, including methanogenic archaea, in their rhizosphere that differ from those of native plants growing in the same environment. Furthermore, we find that microbiota from soils domesticated by rice cultivation contribute to plant-soil feedback, by imparting a negative effect on rice seedling vigor. Conclusions: Soil domestication through continuous monoculture cultivation of rice results in compositional changes in the soil microbiota, which are in part driven by the rice plants. The consequences include a negative impact on plant performance and increases in greenhouse gas emitting microbes.",
                "authors": [
                    {
                        "name": "Edwards J."
                    },
                    {
                        "name": "Santos-Medellin C."
                    },
                    {
                        "name": "Nguyen B."
                    },
                    {
                        "name": "Kilmer J."
                    },
                    {
                        "name": "Liechty Z."
                    },
                    {
                        "name": "Veliz E."
                    },
                    {
                        "name": "Ni J."
                    },
                    {
                        "name": "Phillips G."
                    },
                    {
                        "name": "Sundaresan V."
                    }
                ],
                "citationCount": 5,
                "date": "2019-10-24T00:00:00Z",
                "journal": "Genome Biology",
                "title": "Soil domestication by rice cultivation results in plant-soil feedback through shifts in soil microbiota"
            },
            "pmcid": "PMC6814045",
            "pmid": "31651356"
        }
    ],
    "topic": [
        {
            "term": "Agricultural science",
            "uri": "http://edamontology.org/topic_3810"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        },
        {
            "term": "Chemistry",
            "uri": "http://edamontology.org/topic_3314"
        }
    ]
}