{
    "additionDate": "2019-11-14T18:36:11Z",
    "biotoolsCURIE": "biotools:AUPA",
    "biotoolsID": "AUPA",
    "confidence_flag": "tool",
    "description": "Design a prototype for automated patient diagnosis in wireless sensor networks | It is indeed necessary to design of an elderly support mobile healthcare and monitoring system on wireless sensor network (WSN) for dynamic monitoring. It comes from the need for maintenance of healthcare among patients and elderly people that leads to the demand on change in traditional monitoring approaches among chronic disease patients and alert on acute events. In this paper, we propose a new automated patient diagnosis called automated patient diagnosis (AUPA) using ATmega microcontrollers over environmental sensors. AUPA monitors and aggregates data from patients through network connected over web server and mobile network. The scheme supports variable data management and route establishment. Data transfer is established using adaptive route discovery and management approaches",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://www.ncbi.nlm.nih.gov/pubmed/?term=31468306",
    "lastUpdate": "2020-12-02T16:15:16Z",
    "name": "AUPA",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1007/S11517-019-02036-4",
            "metadata": {
                "abstract": "© 2019, International Federation for Medical and Biological Engineering.It is indeed necessary to design of an elderly support mobile healthcare and monitoring system on wireless sensor network (WSN) for dynamic monitoring. It comes from the need for maintenance of healthcare among patients and elderly people that leads to the demand on change in traditional monitoring approaches among chronic disease patients and alert on acute events. In this paper, we propose a new automated patient diagnosis called automated patient diagnosis (AUPA) using ATmega microcontrollers over environmental sensors. AUPA monitors and aggregates data from patients through network connected over web server and mobile network. The scheme supports variable data management and route establishment. Data transfer is established using adaptive route discovery and management approaches. AUPA supports minimizing packet loss and delay, handling erroneous data, and providing optimized decision-making for healthcare support. The performance of AUPA’s QoS approach is tested using a set of health-related sensors which gather the patient’s data over variable period of time and send from a source to destination AUPA node. Experimental results show that AUPA outperforms the existing schemes, namely SPIN and LEACH, with minimal signal loss rate and a better neighborhood node selection and link selection. It diminishes the jitter compared to the related algorithms. [Figure not available: see fulltext.].",
                "authors": [
                    {
                        "name": "Ayyanar A."
                    },
                    {
                        "name": "Archana M."
                    },
                    {
                        "name": "Robinson Y.H."
                    },
                    {
                        "name": "Julie E.G."
                    },
                    {
                        "name": "Kumar R."
                    },
                    {
                        "name": "Son L.H."
                    }
                ],
                "citationCount": 4,
                "date": "2019-11-01T00:00:00Z",
                "journal": "Medical and Biological Engineering and Computing",
                "title": "Design a prototype for automated patient diagnosis in wireless sensor networks"
            },
            "pmid": "31468306"
        }
    ],
    "topic": [
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Surgery",
            "uri": "http://edamontology.org/topic_3421"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        }
    ],
    "validated": 1
}