{
    "additionDate": "2015-01-21T13:30:06Z",
    "biotoolsCURIE": "biotools:epd",
    "biotoolsID": "epd",
    "credit": [
        {
            "email": "epd@isb-sib.ch",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "name": "SIB Swiss Institute of Bioinformatics",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        }
    ],
    "description": "An annotated non-redundant collection of eukaryotic POL II promoters, for which the transcription start site has been determined experimentally. Access to promoter sequences is provided by pointers to positions in nucleotide sequence entries. The annotation part of an entry includes description of the initiation site mapping data, cross-references to other databases, and bibliographic references.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://epd.vital-it.ch/documents.php"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "elixirNode": [
        "Switzerland"
    ],
    "elixirPlatform": [
        "Data"
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                }
            ]
        }
    ],
    "homepage": "http://epd.vital-it.ch/",
    "lastUpdate": "2020-12-25T14:46:23Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://expasy.org/"
        }
    ],
    "name": "EPD",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "SIB",
    "publication": [
        {
            "doi": "10.1093/NAR/GKZ1014",
            "metadata": {
                "abstract": "© 2019 The Author(s) 2019. Published by Oxford University Press on behalf of Nucleic Acids Research.The Eukaryotic Promoter Database (EPD), available online at https://epd.epfl.ch, provides accurate transcription start site (TSS) information for promoters of 15 model organisms plus corresponding functional genomics data that can be viewed in a genome browser, queried or analyzed via web interfaces, or exported in standard formats (FASTA, BED, CSV) for subsequent analysis with other tools. Recent work has focused on the improvement of the EPD promoter viewers, which use the UCSC Genome Browser as visualization platform. Thousands of high-resolution tracks for CAGE, ChIP-seq and similar data have been generated and organized into public track hubs. Customized, reproducible promoter views, combining EPD-supplied tracks with native UCSC Genome Browser tracks, can be accessed from the organism summary pages or from individual promoter entries. Moreover, thanks to recent improvements and stabilization of ncRNA gene catalogs, we were able to release promoter collections for certain classes of ncRNAs from human and mouse. Furthermore, we developed automatic computational protocols to assign orphan TSS peaks to downstream genes based on paired-end (RAMPAGE) TSS mapping data, which enabled us to add nearly 9000 new entries to the human promoter collection. Since our last article in this journal, EPD was extended to five more model organisms: rhesus monkey, rat, dog, chicken and Plasmodium falciparum.",
                "authors": [
                    {
                        "name": "Ambrosini G."
                    },
                    {
                        "name": "Bucher P."
                    },
                    {
                        "name": "Dreos R."
                    },
                    {
                        "name": "Groux R."
                    },
                    {
                        "name": "Meylan P."
                    }
                ],
                "citationCount": 2,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "EPD in 2020: Enhanced data visualization and extension to ncRNA promoters"
            },
            "pmcid": "PMC7145694",
            "pmid": "31680159"
        },
        {
            "doi": "10.1093/nar/gkw1069",
            "metadata": {
                "abstract": "© 2016 The Author(s).We present an update of the Eukaryotic Promoter Database EPD (http://epd.vital-it.ch), more specifically on the EPDnew division, which contains comprehensive organisms-specific transcription start site (TSS) collections automatically derived from next generation sequencing (NGS) data. Thanks to the abundant release of new high-throughput transcript mapping data (CAGE, TSS-seq, GRO-cap) the database could be extended to plant and fungal species. We further report on the expansion of the mass genome annotation (MGA) repository containing promoter-relevant chromatin profiling data and on improvements for the EPD entry viewers. Finally, we present a new data access tool, ChIP-Extract, which enables computational biologists to extract diverse types of promoter-associated data in numerical table formats that are readily imported into statistical analysis platforms such as R.",
                "authors": [
                    {
                        "name": "Ambrosini G."
                    },
                    {
                        "name": "Bucher P."
                    },
                    {
                        "name": "Dreos R."
                    },
                    {
                        "name": "Groux R."
                    },
                    {
                        "name": "Perier R.C."
                    }
                ],
                "citationCount": 71,
                "date": "2017-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "The eukaryotic promoter database in its 30th year: Focus on non-vertebrate organisms"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ],
    "validated": 1
}
