{
    "accessibility": "Open access",
    "additionDate": "2023-02-13T20:26:36.931326Z",
    "biotoolsCURIE": "biotools:rv-esa",
    "biotoolsID": "rv-esa",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Honggang Zhang"
        },
        {
            "name": "Jinkai Li"
        },
        {
            "name": "Wai Keung Wong"
        },
        {
            "name": "Xiaoling Luo"
        },
        {
            "name": "Yong Xu"
        },
        {
            "name": "Jingyong Su",
            "orcidid": "https://orcid.org/0000-0003-3216-7027"
        }
    ],
    "description": "A novel computer-aided elastic shape analysis system for retinal vessels in diabetic retinopathy.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Principal component analysis",
                    "uri": "http://edamontology.org/operation_3960"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                }
            ]
        }
    ],
    "homepage": "http://github.com/XiaolingLuo/RV-ESA",
    "language": [
        "C++",
        "MATLAB"
    ],
    "lastUpdate": "2024-11-24T15:01:18.832711Z",
    "license": "Not licensed",
    "name": "RV-ESA",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1016/j.compbiomed.2022.106406",
            "metadata": {
                "abstract": "Diabetic retinopathy (DR), one of the most common and serious complications of diabetes, has become one of the main blindness diseases. The retinal vasculature is the only part of the human circulatory system that allows direct noninvasive visualization of the body's microvasculature, which provides the opportunity to detect the structural and functional changes before DR becomes unable to intervene. For decades, as the fundamental step in computer-assisted analysis of retinopathy, retinal vascular extraction methods have been largely developed. However, further research focusing on retinal vascular analysis is still in its infancy. Meanwhile, due to the complexity of retinal vascular structure, the relationship between vascular geometry and DR has never been concluded. This paper aims to provide a novel computer-aided shape analysis system for retinal vessels. To perform retinal vascular shape analysis, a mathematical geometric representation is firstly generated by utilizing the proposed shape modeling method. Then, several useful statistical tools (e.g. Graph Mean, Graph PCA) are adopted to quantitatively analyze the vascular shape. Besides, in order to visualize the changes in vascular shape in the progression of DR, a geodesic tool is used to display the deformation process for ophthalmologists to observe. The efficacy of this analysis system is demonstrated in the EyePACS dataset and the subsequent visit records of 98 patients from the proprietary dataset. The experimental results show that there is a certain correlation between the variation of retinal vascular shape and DR progression, and the Graph PCA scores of retinal vessels are negatively correlated with DR grades. The code of our RV-ESA system can be publicly available at github.com/XiaolingLuo/RV-ESA.",
                "authors": [
                    {
                        "name": "Li J."
                    },
                    {
                        "name": "Luo X."
                    },
                    {
                        "name": "Su J."
                    },
                    {
                        "name": "Wong W.K."
                    },
                    {
                        "name": "Xu Y."
                    },
                    {
                        "name": "Zhang H."
                    }
                ],
                "citationCount": 3,
                "date": "2023-01-01T00:00:00Z",
                "journal": "Computers in Biology and Medicine",
                "title": "RV-ESA: A novel computer-aided elastic shape analysis system for retinal vessels in diabetic retinopathy"
            },
            "pmid": "36521357"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Human biology",
            "uri": "http://edamontology.org/topic_2815"
        },
        {
            "term": "Mathematics",
            "uri": "http://edamontology.org/topic_3315"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        }
    ]
}
