
{
    "credit": [
        {
            "email": "james.r.collins@aya.yale.edu",
            "name": "James Collins",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "User manual",
            "url": "http://bioconductor.org/packages/release/bioc/html/LOBSTAHS.html"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://bioconductor/packages/release/bioc/src/contrib/LOBSTAHS_1.0.0.tar.gz"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Annotation",
                    "uri": "http://edamontology.org/operation_0226"
                },
                {
                    "term": "Spectral analysis",
                    "uri": "http://edamontology.org/operation_3214"
                }
            ]
        }
    ],
    "labels": {
        "collectionID": [
            "BioConductor"
        ],
        "language": [
            "R"
        ],
        "license": "GPL-3.0",
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Command-line tool",
            "Library"
        ],
        "topic": [
            {
                "term": "Small molecules",
                "uri": "http://edamontology.org/topic_0154"
            },
            {
                "term": "Metabolomics",
                "uri": "http://edamontology.org/topic_3172"
            }
        ]
    },
    "link": [
        {
            "type": "Mirror",
            "url": "http://bioconductor.org/packages/LOBSTAHS"
        }
    ],
    "publication": [
        {
            "abstract": "© 2016 American Chemical Society. Discovery and identification of molecular biomarkers in large LC/MS data sets requires significant automation without loss of accuracy in the compound screening and annotation process. Here, we describe a lipidomics workflow and open-source software package for high-throughput annotation and putative identification of lipid, oxidized lipid, and oxylipin biomarkers in high-mass-accuracy HPLC-MS data. Lipid and oxylipin biomarker screening through adduct hierarchy sequences, or LOBSTAHS, uses orthogonal screening criteria based on adduct ion formation patterns and other properties to identify thousands of compounds while providing the user with a confidence score for each assignment. Assignments are made from one of two customizable databases; the default databases contain 14 068 unique entries. To demonstrate the software's functionality, we screened more than 340 000 mass spectral features from an experiment in which hydrogen peroxide was used to induce oxidative stress in the marine diatom Phaeodactylum tricornutum. LOBSTAHS putatively identified 1969 unique parent compounds in 21 869 features that survived the multistage screening process. While P. tricornutum maintained more than 92% of its core lipidome under oxidative stress, patterns in biomarker distribution and abundance indicated remodeling was both subtle and pervasive. Treatment with 150 μM H2O2 promoted statistically significant carbon-chain elongation across lipid classes, with the strongest elongation accompanying oxidation in moieties of monogalactosyldiacylglycerol, a lipid typically localized to the chloroplast. Oxidative stress also induced a pronounced reallocation of lipidome peak area to triacylglycerols. LOBSTAHS can be used with environmental or experimental data from a variety of systems and is freely available at https://github.com/vanmooylipidomics/LOBSTAHS.",
            "authors": [
                "Collins J.R.",
                "Edwards B.R.",
                "Fredricks H.F.",
                "Van Mooy B.A.S."
            ],
            "cit_count": 22,
            "doi": "10.1021/acs.analchem.6b01260",
            "journal": "Analytical Chemistry",
            "pmid": "27322848",
            "title": "LOBSTAHS: An Adduct-Based Lipidomics Strategy for Discovery and Identification of Oxidative Stress Biomarkers",
            "type": "Primary",
            "year": "2016-07-19"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:lobstahs",
        "biotoolsID": "lobstahs",
        "description": "Multifunction package for screening, annotation, and putative identification of mass spectral features in large, HPLC-MS lipid datasets. In silico data for a wide range of lipids, oxidized lipids, and oxylipins can be generated from user-supplied structural criteria with a database generation function. It applies these databases to assign putative compound identities to features in any high-mass accuracy dataset that has been processed using xcms and CAMERA.",
        "homepage": "http://bioconductor.org/packages/release/bioc/html/LOBSTAHS.html",
        "name": "LOBSTAHS",
        "version": [
            "1.0.0"
        ]
    }
}