{
    "accessibility": "Open access",
    "additionDate": "2019-08-09T13:09:49Z",
    "biotoolsCURIE": "biotools:Census_Travel",
    "biotoolsID": "Census_Travel",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "tim.gottwald@ars.usda.gov",
            "name": "Tim Gottwald",
            "orcidid": "https://orcid.org/0000-0003-0885-8004",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Probabilistic census-travel model to predict introduction sites of exotic plant, animal and human pathogens.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://epi-models.shinyapps.io/Census_Travel/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Virulence prediction",
                    "uri": "http://edamontology.org/operation_3461"
                }
            ]
        }
    ],
    "homepage": "https://epi-models.shinyapps.io/Census_Travel/",
    "lastUpdate": "2020-06-16T10:55:25Z",
    "license": "Unlicense",
    "maturity": "Mature",
    "name": "Census Travel",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "hans",
    "publication": [
        {
            "doi": "10.1098/RSTB.2018.0260",
            "metadata": {
                "abstract": "© 2019 The Authors. Published by the Royal Society under the terms of the Creative Commons Attribution LicenseInternational travel offers an extensive network for new and recurring human-mediated introductions of exotic infectious pathogens and biota, freeing geographical constraints. We present a predictive census-travel model that integrates international travel with endpoint census data and epidemiological characteristics to predict points of introduction. Population demographics, inbound and outbound travel patterns, and quantification of source strength by country are combined to estimate and rank risk of introduction at user-scalable land parcel areas (e.g. state, county, zip code, census tract, gridded landscapes (1 mi2, 5 km2, etc.)). This risk ranking by parcel can be used to develop pathogen surveillance programmes, and has been incorporated in multiple US state/federal surveillance protocols. The census-travel model is versatile and independent of pathosystems, and applies a risk algorithm to generate risk maps for plant, human and animal contagions at different spatial scales. An interactive, user-friendly interface is available online (https://epi-models.shinyapps.io/Census_Travel/) to provide ease-of-use for regulatory agencies for early detection of high-risk exotics. The interface allows users to parametrize and run the model without knowledge of background code and underpinning data. This article is part of the theme issue 'Modelling infectious disease outbreaks in humans, animals and plants: epidemic forecasting and control'. This theme issue is linked with the earlier issue 'Modelling infectious disease outbreaks in humans, animals and plants: approaches and important themes'.",
                "authors": [
                    {
                        "name": "Gottwald T."
                    },
                    {
                        "name": "Luo W."
                    },
                    {
                        "name": "Posny D."
                    },
                    {
                        "name": "Riley T."
                    },
                    {
                        "name": "Louws F."
                    }
                ],
                "citationCount": 6,
                "date": "2019-01-01T00:00:00Z",
                "journal": "Philosophical Transactions of the Royal Society B: Biological Sciences",
                "title": "A probabilistic census-travel model to predict introduction sites of exotic plant, animal and human pathogens"
            },
            "pmcid": "PMC6558561",
            "pmid": "31104596",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Public health and epidemiology",
            "uri": "http://edamontology.org/topic_3305"
        },
        {
            "term": "Infectious disease",
            "uri": "http://edamontology.org/topic_3324"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        }
    ]
}