{
    "accessibility": "Open access",
    "additionDate": "2022-01-23T22:23:44.522112Z",
    "biotoolsCURIE": "biotools:synthmorph",
    "biotoolsID": "synthmorph",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "mhoffmann@mgh.harvard.edu",
            "name": "Malte Hoffmann"
        },
        {
            "name": "Adrian V. Dalca"
        },
        {
            "name": "Benjamin Billot"
        },
        {
            "name": "Bruce Fischl"
        },
        {
            "name": "Douglas N. Greve"
        },
        {
            "name": "Juan Eugenio Iglesias"
        }
    ],
    "description": "SynthMorph is a strategy for learning registration without acquired imaging data, producing powerful networks agnostic to contrast induced by MRI",
    "editPermission": {
        "type": "private"
    },
    "homepage": "https://martinos.org/malte/synthmorph/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-01-23T22:23:44.524637Z",
    "license": "Apache-2.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/voxelmorph/voxelmorph#SynthMorph"
        }
    ],
    "name": "SynthMorph",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1109/TMI.2021.3116879",
            "metadata": {
                "abstract": "AuthorWe introduce a strategy for learning image registration without acquired imaging data, producing powerful networks agnostic to contrast introduced by magnetic resonance imaging (MRI). While classical registration methods accurately estimate the spatial correspondence between images, they solve an optimization problem for every new image pair. Learning-based techniques are fast at test time but limited to registering images with contrasts and geometric content similar to those seen during training. We propose to remove this dependency on training data by leveraging a generative strategy for diverse synthetic label maps and images that exposes networks to a wide range of variability, forcing them to learn more invariant features. This approach results in powerful networks that accurately generalize to a broad array of MRI contrasts. We present extensive experiments with a focus on 3D neuroimaging, showing that this strategy enables robust and accurate registration of arbitrary MRI contrasts even if the target contrast is not seen by the networks during training. We demonstrate registration accuracy surpassing the state of the art both within and across contrasts, using a single model. Critically, training on arbitrary shapes synthesized from noise distributions results in competitive performance, removing the dependency on acquired data of any kind. Additionally, since anatomical label maps are often available for the anatomy of interest, we show that synthesizing images from these dramatically boosts performance, while still avoiding the need for real intensity images. Our code is available at https://w3id.org/synthmorph.",
                "authors": [
                    {
                        "name": "Billot B."
                    },
                    {
                        "name": "Dalca A.V."
                    },
                    {
                        "name": "Fischl B."
                    },
                    {
                        "name": "Greve D.N."
                    },
                    {
                        "name": "Hoffmann M."
                    },
                    {
                        "name": "Iglesias J.E."
                    }
                ],
                "date": "2021-01-01T00:00:00Z",
                "journal": "IEEE Transactions on Medical Imaging",
                "title": "SynthMorph: learning contrast-invariant registration without acquired images"
            },
            "pmid": "34587005"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Anatomy",
            "uri": "http://edamontology.org/topic_3067"
        },
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        }
    ]
}
