{"credit":[{"email":"kray@iicb.res.in","name":"Kunal Ray","typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://www.igdd.iicb.res.in/IGDD/help.aspx"}],"documentation":[{"type":"GENERAL","url":"http://www.igdd.iicb.res.in/IGDD/home.aspx"}],"function":[{"operation":[{"term":"Deposition","uri":"http://edamontology.org/operation_3431"},{"term":"Polymorphism detection","uri":"http://edamontology.org/operation_3202"},{"term":"Protein modelling (mutation)","uri":"http://edamontology.org/operation_0331"},{"term":"Database search","uri":"http://edamontology.org/operation_2421"},{"term":"Genotyping","uri":"http://edamontology.org/operation_3196"}]}],"labels":{"language":["SQL"],"operatingSystem":["Linux","Windows","Mac"],"toolType":["Database portal"],"topic":[{"term":"Genetic variation","uri":"http://edamontology.org/topic_0199"},{"term":"Pathology","uri":"http://edamontology.org/topic_0634"},{"term":"Population genetics","uri":"http://edamontology.org/topic_3056"},{"term":"Genetics","uri":"http://edamontology.org/topic_3053"}]},"publication":[{"abstract":"Indians, representing about one-sixth of the world population, consist of several thousands of endogamous groups with strong potential for excess of recessive diseases. However, no database is available on Indian population with comprehensive information on the diseases common in the country. To address this issue, we present Indian Genetic Disease Database (IGDD) release 1.0 (http://www .igdd.iicb.res.in)-an integrated and curated repository of growing number of mutation data on common genetic diseases afflicting the Indian populations. Currently the database covers 52 diseases with information on 5760 individuals carrying the mutant alleles of causal genes. Information on locus heterogeneity, type of mutation, clinical and biochemical data, geographical location and common mutations are furnished based on published literature. The database is currently designed to work best with Internet Explorer 8 (optimal resolution 1440×900) and it can be searched based on disease of interest, causal gene, type of mutation and geographical location of the patients or carriers. Provisions have been made for deposition of new data and logistics for regular updation of the database. The IGDD web portal, planned to be made freely available, contains user-friendly interfaces and is expected to be highly useful to the geneticists, clinicians, biologists and patient support groups of various genetic diseases. © The Author(s) 2010.","authors":["Pradhan S.","Sengupta M.","Dutta A.","Bhattacharyya K.","Bag S.K.","Dutta C.","Ray K."],"cit_count":13,"journal":"Nucleic Acids Research","pmid":"21037256","title":"Indian genetic disease database","year":"2011-01-01"}],"summary":{"biotoolsCURIE":"biotools:igdd","biotoolsID":"igdd","description":"Integrated and curated repository of mutation data on common genetic diseases afflicting the Indian populations. Information on locus heterogeneity, type of mutation, clinical and biochemical data, geographical location and common mutations are furnished based on published literature. The database can be searched based on disease of interest, causal gene, type of mutation and geographical location of the patients or carriers.","homepage":"http://www.igdd.iicb.res.in","name":"IGDD"}}