{
    "accessibility": "Open access",
    "additionDate": "2019-05-19T08:44:49Z",
    "biotoolsCURIE": "biotools:colordistance",
    "biotoolsID": "colordistance",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "hannahiweller@gmail.com",
            "name": "Hannah Weller",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "R package for quantitative color profiling of digital images with earth mover's distance.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://hiweller.github.io/colordistance/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                },
                {
                    "term": "Read binning",
                    "uri": "http://edamontology.org/operation_3798"
                }
            ]
        }
    ],
    "homepage": "https://cran.r-project.org/package=colordistance",
    "language": [
        "R"
    ],
    "lastUpdate": "2020-06-16T10:55:22Z",
    "license": "GPL-3.0",
    "maturity": "Mature",
    "name": "colordistance",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "Ruta",
    "publication": [
        {
            "doi": "10.7717/peerj.6398",
            "metadata": {
                "abstract": "© 2019 Weller and Westneat.Biological color may be adaptive or incidental, seasonal or permanent, species- or population-specific, or modified for breeding, defense or camouflage. Although color is a hugely informative aspect of biology, quantitative color comparisons are notoriously difficult. Color comparison is limited by categorization methods, with available tools requiring either subjective classifications, or expensive equipment, software, and expertise. We present an R package for processing images of organisms (or other objects) in order to quantify color profiles, gather color trait data, and compare color palettes on the basis of color similarity and amount. The package treats image pixels as 3D coordinates in a “color space,” producing a multidimensional color histogram for each image. Pairwise distances between histograms are computed using earth mover’s distance, a technique borrowed from computer vision, that compares histograms using transportation costs. Users choose a color space, parameters for generating color histograms, and a pairwise comparison method to produce a color distance matrix for a set of images. The package is intended as a more rigorous alternative to subjective, manual digital image analyses, not as a replacement for more advanced techniques that rely on detailed spectrophotometry methods unavailable to many users. Here, we outline the basic functions of colordistance, provide guidelines for the available color spaces and quantification methods, and compare this toolkit with other available methods. The tools presented for quantitative color analysis may be applied to a broad range of questions in biology and other disciplines.",
                "authors": [
                    {
                        "name": "Weller H.I."
                    },
                    {
                        "name": "Westneat M.W."
                    }
                ],
                "citationCount": 13,
                "date": "2019-01-01T00:00:00Z",
                "journal": "PeerJ",
                "title": "Quantitative color profiling of digital images with earth mover’s distance using the R package colordistance"
            },
            "pmcid": "PMC6371918",
            "pmid": "30775177",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        }
    ],
    "validated": 1,
    "version": [
        "1.1.0"
    ]
}