{
    "additionDate": "2015-01-29T15:47:52Z",
    "biotoolsCURIE": "biotools:blast_ebi",
    "biotoolsID": "blast_ebi",
    "collectionID": [
        "BLAST",
        "EBI Tools"
    ],
    "credit": [
        {
            "name": "Web Production",
            "typeEntity": "Person",
            "typeRole": [
                "Developer"
            ]
        },
        {
            "name": "EMBL-EBI",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        },
        {
            "name": "NCBI",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        },
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.ebi.ac.uk/support/"
        },
        {
            "email": "es-request@ebi.ac.uk",
            "name": "Web Production",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Find regions of sequence similarity and alignments between a query sequence and database sequences.",
    "documentation": [
        {
            "type": [
                "Terms of use"
            ],
            "url": "http://www.ebi.ac.uk/about/terms-of-use"
        },
        {
            "type": [
                "General"
            ],
            "url": "http://www.ebi.ac.uk/Tools/sss/ncbiblast/"
        },
        {
            "type": [
                "General"
            ],
            "url": "https://www.ebi.ac.uk/seqdb/confluence/pages/viewpage.action?pageId=68167377"
        }
    ],
    "editPermission": {
        "authors": [
            "biomadeira"
        ],
        "type": "group"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Sequence",
                        "uri": "http://edamontology.org/data_2044"
                    }
                }
            ],
            "operation": [
                {
                    "term": "Sequence similarity search",
                    "uri": "http://edamontology.org/operation_0346"
                },
                {
                    "term": "Sequence alignment",
                    "uri": "http://edamontology.org/operation_0292"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Sequence search results",
                        "uri": "http://edamontology.org/data_0857"
                    }
                }
            ]
        }
    ],
    "homepage": "http://www.ebi.ac.uk/Tools/sss/ncbiblast/",
    "lastUpdate": "2019-07-22T12:32:21Z",
    "link": [
        {
            "type": [
                "Helpdesk"
            ],
            "url": "http://www.ebi.ac.uk/support/"
        }
    ],
    "name": "BLAST (EBI)",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "EMBL-EBI",
    "publication": [
        {
            "doi": "10.1186/1471-2105-10-421",
            "metadata": {
                "abstract": "Background: Sequence similarity searching is a very important bioinformatics task. While Basic Local Alignment Search Tool (BLAST) outperforms exact methods through its use of heuristics, the speed of the current BLAST software is suboptimal for very long queries or database sequences. There are also some shortcomings in the user-interface of the current command-line applications.Results: We describe features and improvements of rewritten BLAST software and introduce new command-line applications. Long query sequences are broken into chunks for processing, in some cases leading to dramatically shorter run times. For long database sequences, it is possible to retrieve only the relevant parts of the sequence, reducing CPU time and memory usage for searches of short queries against databases of contigs or chromosomes. The program can now retrieve masking information for database sequences from the BLAST databases. A new modular software library can now access subject sequence data from arbitrary data sources. We introduce several new features, including strategy files that allow a user to save and reuse their favorite set of options. The strategy files can be uploaded to and downloaded from the NCBI BLAST web site.Conclusion: The new BLAST command-line applications, compared to the current BLAST tools, demonstrate substantial speed improvements for long queries as well as chromosome length database sequences. We have also improved the user interface of the command-line applications. © 2009 Camacho et al; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Camacho C."
                    },
                    {
                        "name": "Coulouris G."
                    },
                    {
                        "name": "Avagyan V."
                    },
                    {
                        "name": "Ma N."
                    },
                    {
                        "name": "Papadopoulos J."
                    },
                    {
                        "name": "Bealer K."
                    },
                    {
                        "name": "Madden T.L."
                    }
                ],
                "citationCount": 6930,
                "date": "2009-12-15T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "BLAST+: Architecture and applications"
            },
            "pmcid": "PMC2803857",
            "pmid": "20003500",
            "type": [
                "Primary"
            ]
        },
        {
            "doi": "10.1093/bioinformatics/btw305",
            "metadata": {
                "abstract": "© 2016 The Author 2016. Published by Oxford University Press.Motivation: Over the last decades, vast numbers of sequences were deposited in public databases. Bioinformatics tools allow homology and consequently functional inference for these sequences. New profile-based homology search tools have been introduced, allowing reliable detection of remote homologs, but have not been systematically benchmarked. To provide such a comparison, which can guide bioinformatics workflows, we extend and apply our previously developed benchmark approach to evaluate the 'next generation' of profile-based approaches, including CS-BLAST, HHSEARCH and PHMMER, in comparison with the non-profile based search tools NCBI-BLAST, USEARCH, UBLAST and FASTA. Method: We generated challenging benchmark datasets based on protein domain architectures within either the PFAM + Clan, SCOP/Superfamily or CATH/Gene3D domain definition schemes. From each dataset, homologous and non-homologous protein pairs were aligned using each tool, and standard performance metrics calculated. We further measured congruence of domain architecture assignments in the three domain databases. Results: CSBLAST and PHMMER had overall highest accuracy. FASTA, UBLAST and USEARCH showed large trade-offs of accuracy for speed optimization. Conclusion: Profile methods are superior at inferring remote homologs but the difference in accuracy between methods is relatively small. PHMMER and CSBLAST stand out with the highest accuracy, yet still at a reasonable computational cost. Additionally, we show that less than 0.1% of Swiss-Prot protein pairs considered homologous by one database are considered non-homologous by another, implying that these classifications represent equivalent underlying biological phenomena, differing mostly in coverage and granularity. Availability and Implementation: Benchmark datasets and all scripts are placed at (http://sonnhammer.org/download/Homology-benchmark).",
                "authors": [
                    {
                        "name": "Saripella G.V."
                    },
                    {
                        "name": "Sonnhammer E.L.L."
                    },
                    {
                        "name": "Forslund K."
                    }
                ],
                "citationCount": 6,
                "date": "2016-09-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Benchmarking the next generation of homology inference tools"
            },
            "pmcid": "PMC5013910",
            "pmid": "27256311",
            "type": [
                "Benchmarking study"
            ]
        }
    ],
    "relation": [
        {
            "biotoolsID": "blast",
            "type": "uses"
        }
    ],
    "toolType": [
        "Web API",
        "Web application",
        "Web service"
    ],
    "topic": [
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        }
    ],
    "validated": 1
}