{
    "additionDate": "2018-05-08T15:32:18Z",
    "biotoolsCURIE": "biotools:clap",
    "biotoolsID": "clap",
    "credit": [
        {
            "email": "ns@mbu.iisc.ernet.in",
            "name": "N. Srinivasan",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "A web-server for automatic classification of proteins with special reference to multi-domain proteins.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://nslab.mbu.iisc.ernet.in/clap/help.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Structure classification",
                    "uri": "http://edamontology.org/operation_2996"
                }
            ]
        }
    ],
    "homepage": "http://nslab.mbu.iisc.ernet.in/clap/",
    "language": [
        "R",
        "Perl",
        "C"
    ],
    "lastUpdate": "2018-12-10T12:58:58Z",
    "name": "CLAP",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1186/1471-2105-15-343",
            "metadata": {
                "abstract": "© 2014 Gnanavel et al.; licensee BioMed Central Ltd.Background: The function of a protein can be deciphered with higher accuracy from its structure than from its amino acid sequence. Due to the huge gap in the available protein sequence and structural space, tools that can generate functionally homogeneous clusters using only the sequence information, hold great importance. For this, traditional alignment-based tools work well in most cases and clustering is performed on the basis of sequence similarity. But, in the case of multi-domain proteins, the alignment quality might be poor due to varied lengths of the proteins, domain shuffling or circular permutations. Multi-domain proteins are ubiquitous in nature, hence alignment-free tools, which overcome the shortcomings of alignment-based protein comparison methods, are required. Further, existing tools classify proteins using only domain-level information and hence miss out on the information encoded in the tethered regions or accessory domains. Our method, on the other hand, takes into account the full-length sequence of a protein, consolidating the complete sequence information to understand a given protein better.Results: Our web-server, CLAP (Classification of Proteins), is one such alignment-free software for automatic classification of protein sequences. It utilizes a pattern-matching algorithm that assigns local matching scores (LMS) to residues that are a part of the matched patterns between two sequences being compared. CLAP works on full-length sequences and does not require prior domain definitions.Pilot studies undertaken previously on protein kinases and immunoglobulins have shown that CLAP yields clusters, which have high functional and domain architectural similarity. Moreover, parsing at a statistically determined cut-off resulted in clusters that corroborated with the sub-family level classification of that particular domain family.Conclusions: CLAP is a useful protein-clustering tool, independent of domain assignment, domain order, sequence length and domain diversity. Our method can be used for any set of protein sequences, yielding functionally relevant clusters with high domain architectural homogeneity. The CLAP web server is freely available for academic use at http://nslab.mbu.iisc.ernet.in/clap/.",
                "authors": [
                    {
                        "name": "Gnanavel M."
                    },
                    {
                        "name": "Mehrotra P."
                    },
                    {
                        "name": "Rakshambikai R."
                    },
                    {
                        "name": "Martin J."
                    },
                    {
                        "name": "Srinivasan N."
                    },
                    {
                        "name": "Bhaskara R.M."
                    }
                ],
                "citationCount": 8,
                "date": "2014-10-04T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "CLAP: A web-server for automatic classification of proteins with special reference to multi-domain proteins"
            },
            "pmcid": "PMC4287353",
            "pmid": "25282152"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Protein folds and structural domains",
            "uri": "http://edamontology.org/topic_0736"
        },
        {
            "term": "Protein structure analysis",
            "uri": "http://edamontology.org/topic_2814"
        },
        {
            "term": "Gene and protein families",
            "uri": "http://edamontology.org/topic_0623"
        }
    ],
    "validated": 1
}