
{
    "credit": [
        {
            "email": "guangchuangyu@gmail.com",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://xxxy.jnu.edu.cn/"
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://bioinformatics.jnu.edu.cn/LXtoo/docs.html"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux"
        ],
        "toolType": [
            "Desktop application"
        ],
        "topic": [
            {
                "term": "Bioinformatics",
                "uri": "http://edamontology.org/topic_0091"
            },
            {
                "term": "Software engineering",
                "uri": "http://edamontology.org/topic_3372"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/lxtoo-v1-live-linux-distribution-bioinformatics-community.html"
        }
    ],
    "publication": [
        {
            "abstract": "Background: Recent advances in high-throughput technologies dramatically increase biological data generation. However, many research groups lack computing facilities and specialists. This is an obstacle that remains to be addressed. Here, we present a Linux distribution, LXtoo, to provide a flexible computing platform for bioinformatics analysis. Findings: Unlike most of the existing live Linux distributions for bioinformatics limiting their usage to sequence analysis and protein structure prediction, LXtoo incorporates a comprehensive collection of bioinformatics software, including data mining tools for microarray and proteomics, protein-protein interaction analysis, and computationally complex tasks like molecular dynamics. Moreover, most of the programs have been configured and optimized for high performance computing. Conclusions: LXtoo aims to provide well-supported computing environment tailored for bioinformatics research, reducing duplication of efforts in building computing infrastructure. LXtoo is distributed as a Live DVD and freely available at http://bioinformatics.jnu.edu.cn/LXtoo. © 2012 Yu et al.; licensee BioMed Central Ltd.",
            "authors": [
                "Yu G.",
                "Wang L.-G.",
                "Meng X.-H.",
                "He Q.-Y."
            ],
            "cit_count": 3,
            "journal": "BMC Research Notes",
            "pmid": "22813356",
            "title": "LXtoo: An integrated live Linux distribution for the bioinformatics community",
            "year": "2012-08-08"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:lxtoo",
        "biotoolsID": "lxtoo",
        "description": "Customized Linux distribution for bioinformatics research. It aims to provide well-supported computing environment tailored for bioinformatics research, reducing duplication of efforts in building computing infrastructure.",
        "homepage": "http://bioinformatics.jnu.edu.cn/LXtoo/",
        "name": "LXtoo"
    }
}