{
    "accessibility": "Open access",
    "additionDate": "2019-07-04T08:00:17Z",
    "biotoolsCURIE": "biotools:ROIMCR",
    "biotoolsID": "ROIMCR",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "rtaqam@idaea.csic.es",
            "name": "Romà Tauler",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Powerful analysis strategy for LC-MS metabolomic datasets.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://protocolexchange.researchsquare.com/article/nprot-4347/v1"
        }
    ],
    "download": [
        {
            "type": "Downloads page",
            "url": "https://www.dropbox.com/s/u362bjlsve5f6ly/ROIMCR%20functions.rar?dl=0"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Chromatographic alignment",
                    "uri": "http://edamontology.org/operation_3628"
                },
                {
                    "term": "Read binning",
                    "uri": "http://edamontology.org/operation_3798"
                }
            ]
        }
    ],
    "homepage": "https://mcrals.wordpress.com/download/roimcr/",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2020-06-16T10:55:23Z",
    "license": "Unlicense",
    "maturity": "Mature",
    "name": "ROIMCR",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "Ruta",
    "publication": [
        {
            "doi": "10.1186/s12859-019-2848-8",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: The analysis of LC-MS metabolomic datasets appears to be a challenging task in a wide range of disciplines since it demands the highly extensive processing of a vast amount of data. Different LC-MS data analysis packages have been developed in the last few years to facilitate this analysis. However, most of these strategies involve chromatographic alignment and peak shaping and often associate each \"feature\" (i.e., chromatographic peak) with a unique m/z measurement. Thus, the development of an alternative data analysis strategy that is applicable to most types of MS datasets and properly addresses these issues is still a challenge in the metabolomics field. Results: Here, we present an alternative approach called ROIMCR to: i) filter and compress massive LC-MS datasets while transforming their original structure into a data matrix of features without losing relevant information through the search of regions of interest (ROIs) in the m/z domain and ii) resolve compressed data to identify their contributing pure components without previous alignment or peak shaping by applying a Multivariate Curve Resolution-Alternating Least Squares (MCR-ALS) analysis. In this study, the basics of the ROIMCR method are presented in detail and a detailed description of its implementation is also provided. Data were analyzed using the MATLAB (The MathWorks, Inc., www.mathworks.com) programming and computing environment. The application of the ROIMCR methodology is described in detail, with an example of LC-MS data generated in a lipidomic study and with other examples of recent applications. Conclusions: The methodology presented here combines the benefits of data filtering and compression based on the searching of ROI features, without the loss of spectral accuracy. The method has the benefits of the application of the powerful MCR-ALS data resolution method without the necessity of performing chromatographic peak alignment or modelling. The presented method is a powerful alternative to other existing data analysis approaches that do not use the MCR-ALS method to resolve LC-MS data. The ROIMCR method also represents an improved strategy compared to the direct applications of the MCR-ALS method that use less-powerful data compression strategies such as binning and windowing. Overall, the strategy presented here confirms the usefulness of the ROIMCR chemometrics method for analyzing LC-MS untargeted metabolomics data.",
                "authors": [
                    {
                        "name": "Gorrochategui E."
                    },
                    {
                        "name": "Jaumot J."
                    },
                    {
                        "name": "Tauler R."
                    }
                ],
                "citationCount": 23,
                "date": "2019-05-17T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "ROIMCR: A powerful analysis strategy for LC-MS metabolomic datasets"
            },
            "pmcid": "PMC6525397",
            "pmid": "31101001",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Lipids",
            "uri": "http://edamontology.org/topic_0153"
        },
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        }
    ],
    "validated": 1
}
