{
    "additionDate": "2020-01-09T17:49:39Z",
    "biotoolsCURIE": "biotools:APIS",
    "biotoolsID": "APIS",
    "confidence_flag": "tool",
    "description": "An auto-adaptive parentage inference software that tolerates missing parents.\n\nAuto-Adaptive Parentage Inference Software Tolerant to Missing Parents.\n\nParentage assignment package. Parentage assignment is performed based on observed average Mendelian transmission probability distributions. The main function of this package is the function APIS(), which is the parentage assignment function",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                }
            ]
        }
    ],
    "homepage": "https://cran.r-project.org/package=APIS",
    "language": [
        "R"
    ],
    "lastUpdate": "2020-12-02T14:16:41.467052Z",
    "license": "GPL-2.0",
    "name": "APIS",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1111/1755-0998.13103",
            "metadata": {
                "abstract": "© 2019 John Wiley & Sons LtdIn the context of parentage assignment using genomic markers, key issues are genotyping errors and an absence of parent genotypes because of sampling, traceability or genotyping problems. Most likelihood-based parentage assignment software programs require a priori estimates of genotyping errors and the proportion of missing parents to set up meaningful assignment decision rules. We present here the R package APIS, which can assign offspring to their parents without any prior information other than the offspring and parental genotypes, and a user-defined, acceptable error rate among assigned offspring. Assignment decision rules use the distributions of average Mendelian transmission probabilities, which enable estimates of the proportion of offspring with missing parental genotypes. APIS has been compared to other software (CERVUS, VITASSIGN), on a real European seabass (Dicentrarchus labrax) single nucleotide polymorphism data set. The type I error rate (false positives) was lower with APIS than with other software, especially when parental genotypes were missing, but the true positive rate was also lower, except when the theoretical exclusion power reached 0.99999. In general, APIS provided assignments that satisfied the user-set acceptable error rate of 1% or 5%, even when tested on simulated data with high genotyping error rates (1% or 3%) and up to 50% missing sires. Because it uses the observed distribution of Mendelian transmission probabilities, APIS is best suited to assigning parentage when numerous offspring (>200) are genotyped. We have demonstrated that APIS is an easy-to-use and reliable software for parentage assignment, even when up to 50% of sires are missing.",
                "authors": [
                    {
                        "name": "Griot R."
                    },
                    {
                        "name": "Allal F."
                    },
                    {
                        "name": "Brard-Fudulea S."
                    },
                    {
                        "name": "Morvezen R."
                    },
                    {
                        "name": "Haffray P."
                    },
                    {
                        "name": "Phocas F."
                    },
                    {
                        "name": "Vandeputte M."
                    }
                ],
                "citationCount": 1,
                "date": "2020-03-01T00:00:00Z",
                "journal": "Molecular Ecology Resources",
                "title": "APIS: An auto-adaptive parentage inference software that tolerates missing parents"
            },
            "pmid": "31609085"
        }
    ],
    "topic": [
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        },
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        }
    ]
}