{
    "additionDate": "2024-01-26T10:24:26.697669Z",
    "biotoolsCURIE": "biotools:ppintegrator",
    "biotoolsID": "ppintegrator",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "atrv@lncc.br",
            "name": "Ana Tereza Ribeiro de Vasconcelos",
            "typeEntity": "Person"
        }
    ],
    "description": "Semantic integrative system for protein-protein interaction and application for host-pathogen datasets.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein interaction prediction",
                    "uri": "http://edamontology.org/operation_2492"
                },
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                },
                {
                    "term": "Virulence prediction",
                    "uri": "http://edamontology.org/operation_3461"
                }
            ]
        }
    ],
    "homepage": "https://github.com/YasCoMa/ppintegrator",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T14:19:54.072420Z",
    "license": "MIT",
    "name": "PPIntegrator",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/bioadv/vbad067",
            "metadata": {
                "abstract": "Summary: Semantic web standards have shown importance in the last 20 years in promoting data formalization and interlinking between the existing knowledge graphs. In this context, several ontologies and data integration initiatives have emerged in recent years for the biological area, such as the broadly used Gene Ontology that contains metadata to annotate gene function and subcellular location. Another important subject in the biological area is protein-protein interactions (PPIs) which have applications like protein function inference. Current PPI databases have heterogeneous exportation methods that challenge their integration and analysis. Presently, several initiatives of ontologies covering some concepts of the PPI domain are available to promote interoperability across datasets. However, the efforts to stimulate guidelines for automatic semantic data integration and analysis for PPIs in these datasets are limited. Here, we present PPIntegrator, a system that semantically describes data related to protein interactions. We also introduce an enrichment pipeline to generate, predict and validate new potential host-pathogen datasets by transitivity analysis. PPIntegrator contains a data preparation module to organize data from three reference databases and a triplification and data fusion module to describe the provenance information and results. This work provides an overview of the PPIntegrator system applied to integrate and compare host-pathogen PPI datasets from four bacterial species using our proposed transitivity analysis pipeline. We also demonstrated some critical queries to analyze this kind of data and highlight the importance and usage of the semantic data generated by our system.",
                "authors": [
                    {
                        "name": "Cavalcanti M.C.R."
                    },
                    {
                        "name": "Cerqueira E Costa M.D.O."
                    },
                    {
                        "name": "De Vasconcelos A.T.R."
                    },
                    {
                        "name": "Martins Y.C."
                    },
                    {
                        "name": "Nicolas M.F."
                    },
                    {
                        "name": "Ziviani A."
                    }
                ],
                "date": "2023-01-01T00:00:00Z",
                "journal": "Bioinformatics Advances",
                "title": "PPIntegrator: semantic integrative system for protein-protein interaction and application for host-pathogen datasets"
            },
            "pmcid": "PMC10290227",
            "pmid": "37359724",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Ontology and terminology",
            "uri": "http://edamontology.org/topic_0089"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ]
}
