{"credit":[{"name":"Adam J Richards","typeEntity":"Person","typeRoles":["Primary contact"],"url":"https://github.com/ajrichards"}],"documentation":[{"type":"GENERAL","url":"http://ajrichards.github.io/htsint/"}],"function":[{"operation":[{"term":"Functional clustering","uri":"http://edamontology.org/operation_3459"}]}],"labels":{"language":["Python"],"operatingSystem":["Linux","Mac"],"toolType":["Library"],"topic":[{"term":"Genetics","uri":"http://edamontology.org/topic_3053"},{"term":"Sequencing","uri":"http://edamontology.org/topic_3168"},{"term":"Functional genomics","uri":"http://edamontology.org/topic_0085"},{"term":"Function analysis","uri":"http://edamontology.org/topic_1775"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/htsint-high-throughput-data-integration-tool.html"}],"publication":[{"abstract":"© 2015 Richards et al. Background: Sequencing technologies provide a wealth of details in terms of genes, expression, splice variants, polymorphisms, and other features. A standard for sequencing analysis pipelines is to put genomic or transcriptomic features into a context of known functional information, but the relationships between ontology terms are often ignored. For RNA-Seq, considering genes and their genetic variants at the group level enables a convenient way to both integrate annotation data and detect small coordinated changes between experimental conditions, a known caveat of gene level analyses. Results: We introduce the high throughput data integration tool, htsint, as an extension to the commonly used gene set enrichment frameworks. The central aim of htsint is to compile annotation information from one or more taxa in order to calculate functional distances among all genes in a specified gene space. Spectral clustering is then used to partition the genes, thereby generating functional modules. The gene space can range from a targeted list of genes, like a specific pathway, all the way to an ensemble of genomes. Given a collection of gene sets and a count matrix of transcriptomic features (e.g. expression, polymorphisms), the gene sets produced by htsint can be tested for 'enrichment' or conditional differences using one of a number of commonly available packages. Conclusion: The database and bundled tools to generate functional modules were designed with sequencing pipelines in mind, but the toolkit nature of htsint allows it to also be used in other areas of genomics. The software is freely available as a Python library through GitHub at https://github.com/ajrichards/htsint.","authors":["Richards A.J.","Herrel A.","Bonneaud C."],"cit_count":0,"journal":"BMC Bioinformatics","pmid":"26399714","title":"htsint: A Python library for sequencing pipelines that combines data through gene set generation","year":"2015-09-24"}],"summary":{"biotoolsCURIE":"biotools:htsint","biotoolsID":"htsint","description":"Python package used to create gene sets for the study of high-throughput sequencing data.","homepage":"http://ajrichards.github.io/htsint/","name":"htsint"}}