{
    "additionDate": "2019-11-14T19:42:14Z",
    "biotoolsCURIE": "biotools:minnow",
    "biotoolsID": "minnow",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "rob.patro@cs.stonybrook.edu",
            "name": "Rob Patro",
            "typeEntity": "Person"
        }
    ],
    "description": "A principled framework for rapid simulation of dscRNA-seq data at the read level | Minnow ( read level simulator for dscRNA-seq data) | Most analysis pipelines validate their results using known marker genes (which are not widely available for all types of analysis) and by using simulated data from gene-count-level simulators",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "De-novo assembly",
                    "uri": "http://edamontology.org/operation_0524"
                },
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                }
            ]
        }
    ],
    "homepage": "https://github.com/COMBINE-lab/minnow",
    "language": [
        "C++"
    ],
    "lastUpdate": "2020-12-29T08:56:01Z",
    "name": "minnow",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ351",
            "metadata": {
                "abstract": "© 2019 The Author(s) 2019. Published by Oxford University Press.Summary: With the advancements of high-throughput single-cell RNA-sequencing protocols, there has been a rapid increase in the tools available to perform an array of analyses on the gene expression data that results from such studies. For example, there exist methods for pseudo-time series analysis, differential cell usage, cell-type detection RNA-velocity in single cells, etc. Most analysis pipelines validate their results using known marker genes (which are not widely available for all types of analysis) and by using simulated data from gene-count-level simulators. Typically, the impact of using different read-alignment or unique molecular identifier (UMI) deduplication methods has not been widely explored. Assessments based on simulation tend to start at the level of assuming a simulated count matrix, ignoring the effect that different approaches for resolving UMI counts from the raw read data may produce. Here, we present minnow, a comprehensive sequence-level droplet-based single-cell RNA-sequencing (dscRNA-seq) experiment simulation framework. Minnow accounts for important sequence-level characteristics of experimental scRNA-seq datasets and models effects such as polymerase chain reaction amplification, cellular barcodes (CB) and UMI selection and sequence fragmentation and sequencing. It also closely matches the gene-level ambiguity characteristics that are observed in real scRNA-seq experiments. Using minnow, we explore the performance of some common processing pipelines to produce gene-by-cell count matrices from droplet-bases scRNA-seq data, demonstrate the effect that realistic levels of gene-level sequence ambiguity can have on accurate quantification and show a typical use-case of minnow in assessing the output generated by different quantification pipelines on the simulated experiment. Supplementary information: Supplementary data are available at Bioinformatics online.",
                "authors": [
                    {
                        "name": "Sarkar H."
                    },
                    {
                        "name": "Srivastava A."
                    },
                    {
                        "name": "Patro R."
                    }
                ],
                "citationCount": 3,
                "date": "2019-07-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Minnow: A principled framework for rapid simulation of dscRNA-seq data at the read level"
            },
            "pmcid": "PMC6612833",
            "pmid": "31510649"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "PCR experiment",
            "uri": "http://edamontology.org/topic_3519"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ],
    "validated": 1
}