{
    "accessibility": [
        "Open access"
    ],
    "additionDate": "2019-01-23T12:32:59Z",
    "biotoolsCURIE": "biotools:ebprot",
    "biotoolsID": "ebprot",
    "collectionID": [
        "Proteomics"
    ],
    "cost": "Free of charge",
    "credit": [
        {
            "email": "hiromi_koh@nuhs.edu.sg",
            "name": "Hiromi W.L. Koh",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "yz2236@nyu.edu",
            "name": "Yunbin Zhang",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "cvogel@nyu.edu",
            "name": "Christine Vogel",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "hwchoi@nus.edu.sg",
            "name": "Hyungwon Choi",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Perseus plugin for differential protein abundance analysis of labeling-based and label-free quantitative proteomics data",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://github.com/cssblab/EBprot/wiki"
        }
    ],
    "download": [
        {
            "type": "Software package",
            "url": "https://github.com/cssblab/EBprot/releases"
        }
    ],
    "editPermission": {
        "authors": [
            "proteomics.bio.tools"
        ],
        "type": "group"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Peptide identification",
                        "uri": "http://edamontology.org/data_0945"
                    }
                }
            ],
            "operation": [
                {
                    "term": "Label-free quantification",
                    "uri": "http://edamontology.org/operation_3634"
                },
                {
                    "term": "Labeled quantification",
                    "uri": "http://edamontology.org/operation_3635"
                }
            ]
        }
    ],
    "homepage": "https://github.com/cssblab/EBprot",
    "language": [
        "C++"
    ],
    "lastUpdate": "2019-07-29T06:57:34Z",
    "license": "Apache-2.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/cssblab/EBprot"
        },
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/cssblab/EBprot/issues"
        }
    ],
    "maturity": "Mature",
    "name": "EBprot",
    "operatingSystem": [
        "Windows"
    ],
    "owner": "n.m.palmblad@lumc.nl",
    "publication": [
        {
            "doi": "10.1021/acs.jproteome.8b00483",
            "metadata": {
                "abstract": "Copyright © 2018 American Chemical Society.We present EBprotV2, a Perseus plugin for peptide-ratio-based differential protein abundance analysis in labeling-based proteomics experiments. The original version of EBprot models the distribution of log-transformed peptide-level ratios as a Gaussian mixture of differentially abundant proteins and nondifferentially abundant proteins and computes the probability score of differential abundance for each protein based on the reproducible magnitude of peptide ratios. However, the fully parametric model can be inflexible, and its R implementation is time-consuming for data sets containing a large number of peptides (e.g., >100000). The new tool built in the C++ language is not only faster in computation time but also equipped with a flexible semiparametric model that handles skewed ratio distributions better. We have also developed a Perseus plugin for EBprotV2 for easy access to the tool. In addition, the tool now offers a new submodule (MakeGrpData) to transform label-free peptide intensity data into peptide ratio data for group comparisons and performs differential abundance analysis using mixture modeling. This approach is especially useful when the label-free data have many missing peptide intensity data points.",
                "authors": [
                    {
                        "name": "Koh H.W.L."
                    },
                    {
                        "name": "Zhang Y."
                    },
                    {
                        "name": "Vogel C."
                    },
                    {
                        "name": "Choi H."
                    }
                ],
                "date": "2019-02-01T00:00:00Z",
                "journal": "Journal of Proteome Research",
                "title": "EBprotV2: A Perseus Plugin for Differential Protein Abundance Analysis of Labeling-Based Quantitative Proteomics Data"
            },
            "pmid": "30411623",
            "type": [
                "Primary"
            ],
            "version": "2.0"
        },
        {
            "doi": "10.1002/pmic.201400620",
            "metadata": {
                "abstract": "© 2015 WILEY-VCH Verlag GmbH & Co. KGaA, Weinheim.Labeling-based proteomics is a powerful method for detection of differentially expressed proteins (DEPs). The current data analysis platform typically relies on protein-level ratios, which is obtained by summarizing peptide-level ratios for each protein. In shotgun proteomics, however, some proteins are quantified with more peptides than others, and this reproducibility information is not incorporated into the differential expression (DE) analysis. Here, we propose a novel probabilistic framework EBprot that directly models the peptide-protein hierarchy and rewards the proteins with reproducible evidence of DE over multiple peptides. To evaluate its performance with known DE states, we conducted a simulation study to show that the peptide-level analysis of EBprot provides better receiver-operating characteristic and more accurate estimation of the false discovery rates than the methods based on protein-level ratios. We also demonstrate superior classification performance of peptide-level EBprot analysis in a spike-in dataset. To illustrate the wide applicability of EBprot in different experimental designs, we applied EBprot to a dataset for lung cancer subtype analysis with biological replicates and another dataset for time course phosphoproteome analysis of EGF-stimulated HeLa cells with multiplexed labeling. Through these examples, we show that the peptide-level analysis of EBprot is a robust alternative to the existing statistical methods for the DE analysis of labeling-based quantitative datasets. The software suite is freely available on the Sourceforge website http://ebprot.sourceforge.net/. All MS data have been deposited in the ProteomeXchange with identifier PXD001426 (http://proteomecentral.proteomexchange.org/dataset/PXD001426/).",
                "authors": [
                    {
                        "name": "Koh H.W.L."
                    },
                    {
                        "name": "Swa H.L.F."
                    },
                    {
                        "name": "Fermin D."
                    },
                    {
                        "name": "Ler S.G."
                    },
                    {
                        "name": "Gunaratne J."
                    },
                    {
                        "name": "Choi H."
                    }
                ],
                "citationCount": 7,
                "date": "2015-08-01T00:00:00Z",
                "journal": "Proteomics",
                "title": "EBprot: Statistical analysis of labeling-based quantitative proteomics data"
            },
            "pmid": "25913743",
            "type": [
                "Primary"
            ],
            "version": "1.0"
        }
    ],
    "toolType": [
        "Plug-in"
    ],
    "topic": [
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        }
    ],
    "version": [
        "2.0"
    ]
}