{
    "additionDate": "2021-01-18T08:09:56Z",
    "biotoolsCURIE": "biotools:gsp4pdb",
    "biotoolsID": "gsp4pdb",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "rangles@utalca.cl",
            "name": "Renzo Angles",
            "typeEntity": "Person"
        }
    ],
    "description": "A web tool to visualize, search and explore protein-ligand structural patterns.\n\nGraph-based Structural Patterns for PDB.\n\nGSP4PDB is a tool that lets the users design, search and analyze structural patterns inside biomacromolecules of the PDB in a graphic way.\n\nThe novel feature of GSP4PDB is that a protein-ligand structural pattern is graphically represented as a graph such that the nodes represent protein’s components (amino acids and ligands) and the edges represent structural relationships (e.g. distance relationships). Such abstract representation is called a Graph-based Structural Pattern (GSP).",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Structure visualisation",
                    "uri": "http://edamontology.org/operation_0570"
                },
                {
                    "term": "Virtual screening",
                    "uri": "http://edamontology.org/operation_3938"
                }
            ]
        }
    ],
    "homepage": "https://structuralbio.utalca.cl/gsp4pdb/",
    "lastUpdate": "2021-01-25T11:45:48Z",
    "name": "GSP4PDB",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1186/S12859-020-3352-X",
            "metadata": {
                "abstract": "© 2020 The Author(s).Background: In the field of protein engineering and biotechnology, the discovery and characterization of structural patterns is highly relevant as these patterns can give fundamental insights into protein-ligand interaction and protein function. This paper presents GSP4PDB, a bioinformatics web tool that enables the user to visualize, search and explore protein-ligand structural patterns within the entire Protein Data Bank. Results: We introduce the notion of graph-based structural pattern (GSP) as an abstract model for representing protein-ligand interactions. A GSP is a graph where the nodes represent entities of the protein-ligand complex (amino acids and ligands) and the edges represent structural relationships (e.g. distances ligand - amino acid). The novel feature of GSP4PDB is a simple and intuitive graphical interface where the user can \"draw\" a GSP and execute its search in a relational database containing the structural data of each PDB entry. The results of the search are displayed using the same graph-based representation of the pattern. The user can further explore and analyse the results using a wide range of filters, or download their related information for external post-processing and analysis. Conclusions: GSP4PDB is a user-friendly and efficient application to search and discover new patterns of protein-ligand interaction.",
                "authors": [
                    {
                        "name": "Angles R."
                    },
                    {
                        "name": "Arenas-Salinas M."
                    },
                    {
                        "name": "Garcia R."
                    },
                    {
                        "name": "Pohl E."
                    },
                    {
                        "name": "Reyes-Suarez J.A."
                    }
                ],
                "citationCount": 3,
                "date": "2020-03-11T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "GSP4PDB: A web tool to visualize, search and explore protein-ligand structural patterns"
            },
            "pmcid": "PMC7068854",
            "pmid": "32164553"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Biotechnology",
            "uri": "http://edamontology.org/topic_3297"
        },
        {
            "term": "Immunoproteins and antigens",
            "uri": "http://edamontology.org/topic_2830"
        },
        {
            "term": "Protein folds and structural domains",
            "uri": "http://edamontology.org/topic_0736"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ],
    "validated": 1
}
