{
    "additionDate": "2021-07-06T18:24:01Z",
    "biotoolsCURIE": "biotools:lumpy",
    "biotoolsID": "lumpy",
    "description": "A novel SV discovery framework that naturally integrates multiple SV signals jointly across multiple samples. We show that LUMPY yields improved sensitivity, especially when SV signal is reduced owing to either low coverage data or low intra-sample variant allele frequency.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Structural variation detection",
                    "uri": "http://edamontology.org/operation_3228"
                }
            ]
        }
    ],
    "homepage": "https://github.com/arq5x/lumpy-sv",
    "lastUpdate": "2021-07-08T18:17:13.518498Z",
    "name": "lumpy",
    "owner": "leipzig",
    "publication": [
        {
            "doi": "10.1186/gb-2014-15-6-r84",
            "metadata": {
                "abstract": "© 2014 Layer et al.Comprehensive discovery of structural variation (SV) from whole genome sequencing data requires multiple detection signals including read-pair, split-read, read-depth and prior knowledge. Owing to technical challenges, extant SV discovery algorithms either use one signal in isolation, or at best use two sequentially. We present LUMPY, a novel SV discovery framework that naturally integrates multiple SV signals jointly across multiple samples. We show that LUMPY yields improved sensitivity, especially when SV signal is reduced owing to either low coverage data or low intra-sample variant allele frequency. We also report a set of 4,564 validated breakpoints from the NA12878 human genome. https://github.com/arq5x/lumpy-sv.",
                "authors": [
                    {
                        "name": "Layer R.M."
                    },
                    {
                        "name": "Chiang C."
                    },
                    {
                        "name": "Quinlan A.R."
                    },
                    {
                        "name": "Hall I.M."
                    }
                ],
                "citationCount": 514,
                "date": "2014-06-26T00:00:00Z",
                "journal": "Genome Biology",
                "title": "LUMPY: A probabilistic framework for structural variant discovery"
            }
        }
    ],
    "topic": [
        {
            "term": "Structural variation",
            "uri": "http://edamontology.org/topic_3175"
        }
    ]
}