{
    "additionDate": "2020-01-14T09:41:37Z",
    "biotoolsCURIE": "biotools:E14",
    "biotoolsID": "E14",
    "confidence_flag": "low",
    "description": "Cardiac risk assessment based on early Phase I data and PK-QTc analysis is concordant with the outcome of thorough QTc trials.\n\nCardiac safety assessment is a key regulatory requirement for almost all new drugs. Until recently, one evaluation aspect was via a specifically designated, expensive, and resource intensive thorough QTc study, and a by-time-point analysis using an intersection-union test (IUT). ICH E14 Q&A (R3) (http: www.ich.org fileadmin Public_Web_Site ICH_Products Guidelines Efficacy E14 E14_Q_As_R3__Step4.pdf) allows for analysis of the PK-QTc relationship using early Phase I data to assess QTc liability.\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'ICH', 'QTc', 'thorough QTc', 'Cardiac risk assessment based early Phase I data PK-QTc analysis concordant outcome thorough QTc ...'",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Phasing",
                    "uri": "http://edamontology.org/operation_3454"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "http://www.ich.org/fileadmin/Public_Web_Site/ICH_Products/Guidelines/Efficacy/E14/E14_Q_As_R3__Step4.pdf",
    "language": [
        "R",
        "SAS"
    ],
    "lastUpdate": "2020-01-14T09:41:37Z",
    "name": "E14",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1007/S10928-019-09662-3",
            "metadata": {
                "abstract": "© 2019, Springer Science+Business Media, LLC, part of Springer Nature.Cardiac safety assessment is a key regulatory requirement for almost all new drugs. Until recently, one evaluation aspect was via a specifically designated, expensive, and resource intensive thorough QTc study, and a by-time-point analysis using an intersection–union test (IUT). ICH E14 Q&A (R3) (http://www.ich.org/fileadmin/Public_Web_Site/ICH_Products/Guidelines/Efficacy/E14/E14_Q_As_R3__Step4.pdf) allows for analysis of the PK-QTc relationship using early Phase I data to assess QTc liability. In this paper, we compared the cardiac risk assessment based on the early Phase I analysis with that from a thorough QTc study across eleven drug candidate programs, and demonstrate that the conclusions are largely the same. The early Phase I analysis is based upon a linear mixed effect model with known covariance structure (Dosne et al. in Stat Med 36(24):3844–3857, 2017). The treatment effect was evaluated at the supratherapeutic Cmax as observed in the thorough QTc study using a non-parametric bootstrap analysis to generate 90% confidence intervals for the treatment effect, and implementation of the standardized methodology in R and SAS software yielded consistent results. The risk assessment based on the concentration–response analysis on the early Phase I data was concordant with that based on the standard analysis of the thorough QTc study for nine out of the eleven drug candidates. This retrospective analysis is consistent with and supportive of the conclusion of a previous prospective analysis by Darpo et al. (Clin Pharmacol Ther 97(4):326–335, 2015) to evaluate whether C-QTc analysis can detect QTc effects in a small study with healthy subjects.",
                "authors": [
                    {
                        "name": "Gaitonde P."
                    },
                    {
                        "name": "Huh Y."
                    },
                    {
                        "name": "Darpo B."
                    },
                    {
                        "name": "Ferber G."
                    },
                    {
                        "name": "Heimann G."
                    },
                    {
                        "name": "Li J."
                    },
                    {
                        "name": "Lu K."
                    },
                    {
                        "name": "Sebastien B."
                    },
                    {
                        "name": "Tsai K."
                    },
                    {
                        "name": "Riley S."
                    }
                ],
                "date": "2019-12-01T00:00:00Z",
                "journal": "Journal of Pharmacokinetics and Pharmacodynamics",
                "title": "Cardiac risk assessment based on early Phase I data and PK-QTc analysis is concordant with the outcome of thorough QTc trials: an assessment based on eleven drug candidates"
            },
            "pmid": "31667657"
        }
    ],
    "topic": [
        {
            "term": "Safety sciences",
            "uri": "http://edamontology.org/topic_3377"
        },
        {
            "term": "Drug metabolism",
            "uri": "http://edamontology.org/topic_3375"
        },
        {
            "term": "Pharmacology",
            "uri": "http://edamontology.org/topic_0202"
        },
        {
            "term": "Preclinical and clinical studies",
            "uri": "http://edamontology.org/topic_3379"
        }
    ]
}