{"credit":[{"name":"Marcel Martin","typeRoles":[],"url":"http://orcid.org/0000-0002-0680-200X"},{"name":"Tobias Marschall","typeRoles":[],"url":"http://orcid.org/0000-0002-9376-1030"},{"typeEntity":"Person","typeRoles":["Primary contact"],"url":"https://lists.cwi.nl/mailman/listinfo/whatshap"}],"documentation":[{"type":"GENERAL","url":"http://whatshap.readthedocs.io"}],"download":[{"url":"https://pypi.python.org/pypi/whatshap"}],"function":[{"operation":[{"term":"Genotyping","uri":"http://edamontology.org/operation_3196"}]}],"labels":{"accessibility":["Open access"],"cost":"Free of charge","language":["C++","Python"],"license":"MIT","maturity":"Emerging","operatingSystem":["Linux","Mac"],"toolType":["Command-line tool"],"topic":[{"term":"DNA polymorphism","uri":"http://edamontology.org/topic_2885"},{"term":"Sequence assembly","uri":"http://edamontology.org/topic_0196"}]},"link":[{"type":"ISSUE_TRACKER","url":"https://bitbucket.org/whatshap/whatshap/issues?status=new&status=open"},{"type":"MAILING_LIST","url":"https://lists.cwi.nl/mailman/listinfo/whatshap"}],"publication":[{"abstract":"© Copyright 2015, Mary Ann Liebert, Inc. The human genome is diploid, which requires assigning heterozygous single nucleotide polymorphisms (SNPs) to the two copies of the genome. The resulting haplotypes, lists of SNPs belonging to each copy, are crucial for downstream analyses in population genetics. Currently, statistical approaches, which are oblivious to direct read information, constitute the state-of-the-art. Haplotype assembly, which addresses phasing directly from sequencing reads, suffers from the fact that sequencing reads of the current generation are too short to serve the purposes of genome-wide phasing. While future-technology sequencing reads will contain sufficient amounts of SNPs per read for phasing, they are also likely to suffer from higher sequencing error rates. Currently, no haplotype assembly approaches exist that allow for taking both increasing read length and sequencing error information into account. Here, we suggest WhatsHap, the first approach that yields provably optimal solutions to the weighted minimum error correction problem in runtime linear in the number of SNPs. WhatsHap is a fixed parameter tractable (FPT) approach with coverage as the parameter. We demonstrate that WhatsHap can handle datasets of coverage up to 20x, and that 15x; are generally enough for reliably phasing long reads, even at significantly elevated sequencing error rates. We also find that the switch and flip error rates of the haplotypes we output are favorable when comparing them with state-of-the-art statistical phasers.","authors":["Patterson M.D.","Marschall T.","Pisanti N.","Van Iersel L.","Stougie L.","Klau G.W.","Schonhuth A."],"cit_count":25,"doi":"10.1089/cmb.2014.0157","journal":"Journal of Computational Biology","title":"WhatsHap: Weighted Haplotype Assembly for Future-Generation Sequencing Reads","type":"Primary","year":"2015-01-01"},{"doi":"10.1101/037101","type":"Primary"}],"summary":{"biotoolsCURIE":"biotools:whatshap","biotoolsID":"whatshap","description":"Software for phasing genomic variants using DNA sequencing reads, also called haplotype assembly. It is especially suitable for long reads, but works also well with short reads.","homepage":"http://whatshap.readthedocs.io","name":"WhatsHap","version":["0.13"]}}