{
    "additionDate": "2019-11-14T19:37:09Z",
    "biotoolsCURIE": "biotools:uORF-Tools",
    "biotoolsID": "uORF-Tools",
    "confidence_flag": "high",
    "credit": [
        {
            "email": "egg@informatik.uni-freiburg.de",
            "name": "Florian Eggenhofer",
            "typeEntity": "Person"
        },
        {
            "email": "t.schmid@biochem.uni-frankfurt.de",
            "name": "Tobias Schmid",
            "orcidid": "https://orcid.org/0000-0002-1952-5259",
            "typeEntity": "Person"
        }
    ],
    "description": "uORF-Tools-Workflow for the determination of translation-regulatory upstream open reading frames | uORF-Tools are a workflow and a collection of tools for the analysis of 'Upstream Open Reading Frames' (short uORFs) | uORF-Tools are a workflow and a collection of tools for the analysis of 'upstream Open Reading Frames' (short uORFs). The workflow is based on the workflow management system snakemake and handles installation of all dependencies, as well as all processings steps. The source code of uORF-Tools is open source and available under the GPL-3 License. Installation is described below, for usage please refer to the Userguide",
    "download": [
        {
            "type": "Software package",
            "url": "ftp://biftp.informatik.uni-freiburg.de/pub/uORF-Tools/bam.tar.gz"
        }
    ],
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Coding region prediction",
                    "uri": "http://edamontology.org/operation_0436"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Biochemistry1-FFM/uORF-Tools",
    "language": [
        "R",
        "Python"
    ],
    "lastUpdate": "2019-11-14T19:37:09Z",
    "license": "GPL-3.0",
    "name": "uORF-Tools",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PONE.0222459",
            "metadata": {
                "abstract": "© 2019 Scholz et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Ribosome profiling (ribo-seq) provides a means to analyze active translation by determining ribosome occupancy in a transcriptome-wide manner. The vast majority of ribosome protected fragments (RPFs) resides within the protein-coding sequence of mRNAs. However, commonly reads are also found within the transcript leader sequence (TLS) (aka 5' untranslated region) preceding the main open reading frame (ORF), indicating the translation of regulatory upstream ORFs (uORFs). Here, we present a workflow for the identification of translation-regulatory uORFs. Specifically, uORF-Tools uses Ribo-TISH to identify uORFs within a given dataset and generates a uORF annotation file. In addition, a comprehensive human uORF annotation file, based on 35 ribo-seq files, is provided, which can serve as an alternative input file for the workflow. To assess the translation-regulatory activity of the uORFs, stimulus-induced changes in the ratio of the RPFs residing in the main ORFs relative to those found in the associated uORFs are determined. The resulting output file allows for the easy identification of candidate uORFs, which have translation-inhibitory effects on their associated main ORFs. uORF-Tools is available as a free and open Snakemake workflow at https://github.com/Biochemistry1-FFM/uORF-Tools. It is easily installed and all necessary tools are provided in a version-controlled manner, which also ensures lasting usability. uORF-Tools is designed for intuitive use and requires only limited computing times and resources.",
                "authors": [
                    {
                        "name": "Scholz A."
                    },
                    {
                        "name": "Eggenhofer F."
                    },
                    {
                        "name": "Gelhausen R."
                    },
                    {
                        "name": "Gruning B."
                    },
                    {
                        "name": "Zarnack K."
                    },
                    {
                        "name": "Brune B."
                    },
                    {
                        "name": "Backofen R."
                    },
                    {
                        "name": "Schmid T."
                    }
                ],
                "citationCount": 2,
                "date": "2019-09-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "UORF-Tools-Workflow for the determination of translation-regulatory upstream open reading frames"
            },
            "pmcid": "PMC6742470",
            "pmid": "31513641"
        }
    ],
    "topic": [
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        },
        {
            "term": "Protein expression",
            "uri": "http://edamontology.org/topic_0108"
        }
    ]
}