{
    "additionDate": "2018-08-20T14:22:58Z",
    "biotoolsCURIE": "biotools:qsurface",
    "biotoolsID": "qsurface",
    "credit": [
        {
            "email": "yoonsj@sookmyung.ac.kr",
            "name": "Sukjoon YoonEmail author",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Analyze lineage- and mutation-specific cell surface transcriptome marker from patient cancer samples. It is a fast and efficient tool to find novel tumor-specific cell surface markers for advanced cancer therapies.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://compbio.sookmyung.ac.kr/~qsurface/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genetic variation analysis",
                    "uri": "http://edamontology.org/operation_3197"
                }
            ]
        }
    ],
    "homepage": "http://compbio.sookmyung.ac.kr/~qsurface/",
    "language": [
        "Java"
    ],
    "lastUpdate": "2018-12-10T12:59:01Z",
    "name": "QSurface",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1186/s12918-018-0541-6",
            "metadata": {
                "abstract": "BACKGROUND: Cell surface proteins have provided useful targets and biomarkers for advanced cancer therapies. The recent clinical success of antibody-drug conjugates (ADCs) highlights the importance of finding selective surface antigens for given cancer subtypes. We thus attempted to develop stand-alone software for the analysis of the cell surface transcriptome of patient cancer samples and to prioritize lineage- and/or mutation-specific over-expression markers in cancer cells. RESULTS: A total of 519 genes were selected as surface proteins, and their expression was profiled in 14 cancer subtypes using patient sample transcriptome data. Lineage/mutation-oriented analysis was used to identify subtype-specific surface markers with statistical confidence. Experimental validation confirmed the unique over-expression of predicted surface markers (MUC4, MSLN, and SLC7A11) in lung cancer cells at the protein level. The differential cell surface gene expression of cell lines may differ from that of tissue samples due to the absence of the tumor microenvironment. CONCLUSIONS: In the present study, advanced 3D models of lung cell lines successfully reproduced the predicted patterns, demonstrating the physiological relevance of cell line-based 3D models in validating surface markers from patient tumor data. Also QSurface software is freely available at http://compbio.sookmyung.ac.kr/~qsurface .",
                "authors": [
                    {
                        "name": "Cho J."
                    },
                    {
                        "name": "Hong Y."
                    },
                    {
                        "name": "Jeong E."
                    },
                    {
                        "name": "Kim J."
                    },
                    {
                        "name": "Kim N."
                    },
                    {
                        "name": "Moon S.U."
                    },
                    {
                        "name": "Park C."
                    },
                    {
                        "name": "Yoon S."
                    }
                ],
                "citationCount": 1,
                "date": "2018-03-19T00:00:00Z",
                "journal": "BMC systems biology",
                "title": "QSurface: fast identification of surface expression markers in cancers"
            }
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Human biology",
            "uri": "http://edamontology.org/topic_2815"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Physiology",
            "uri": "http://edamontology.org/topic_3300"
        },
        {
            "term": "Systems biology",
            "uri": "http://edamontology.org/topic_2259"
        }
    ],
    "validated": 1
}
