{
    "additionDate": "2017-03-30T23:01:14Z",
    "biotoolsCURIE": "biotools:mmmdb",
    "biotoolsID": "mmmdb",
    "credit": [
        {
            "email": "msugi@sfc.keio.ac.jp",
            "name": "Masahiro SUGIMOTO",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Mouse Multiple Tissue Metabolome Database: metabolomic database containing a collection of metabolites measured from multiple tissues from single mice. The datases are collected using a single instrument and not integrated from literatures, which is useful for capturing the holistic overview of large metabolomic pathway.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://mmmdb.iab.keio.ac.jp/quickguide.html"
        }
    ],
    "editPermission": {
        "authors": [
            "proteomics.bio.tools"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database comparison",
                    "uri": "http://edamontology.org/operation_3561"
                },
                {
                    "term": "Data handling",
                    "uri": "http://edamontology.org/operation_2409"
                },
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                },
                {
                    "term": "Mass spectra calibration",
                    "uri": "http://edamontology.org/operation_3627"
                }
            ]
        }
    ],
    "homepage": "http://mmmdb.iab.keio.ac.jp/",
    "language": [
        "Java"
    ],
    "lastUpdate": "2019-06-27T08:59:51Z",
    "name": "MMMDB",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "The Mouse Multiple Tissue Metabolome Database (MMMDB) provides comprehensive and quantitative metabolomic information for multiple tissues from single mice. Manually curated databases that integrate literature-based individual metabolite information have been available so far. However, data sets on the absolute concentration of a single metabolite integrated from multiple resources are often difficult to be used when different metabolomic studies are compared because the relative balance of the multiple metabolite concentrations in the metabolic pathways as a snapshot of a dynamic system is more important than the absolute concentration of a single metabolite. We developed MMMDB by performing non-targeted analyses of cerebra, cerebella, thymus, spleen, lung, liver, kidney, heart, pancreas, testis and plasma using capillary electrophoresis time-of-flight mass spectrometry and detected 428 non-redundant features from which 219 metabolites were successfully identified. Quantified concentrations of the individual metabolites and the corresponding processed raw data; for example, the electropherograms and mass spectra with their annotations, such as isotope and fragment information, are stored in the database. MMMDB is designed to normalize users' data, which can be submitted online and used to visualize overlaid electropherograms. Thus, MMMDB allows newly measured data to be compared with the other data in the database. MMMDB is available at: http:// mmmdb.iab.keio.ac.jp. © The Author(s) 2011.",
                "authors": [
                    {
                        "name": "Sugimoto M."
                    },
                    {
                        "name": "Ikeda S."
                    },
                    {
                        "name": "Niigata K."
                    },
                    {
                        "name": "Tomita M."
                    },
                    {
                        "name": "Sato H."
                    },
                    {
                        "name": "Soga T."
                    }
                ],
                "citationCount": 33,
                "date": "2012-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "MMMDB: Mouse multiple tissue metabolome database"
            },
            "pmid": "22139941"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ],
    "validated": 1
}