{
    "additionDate": "2017-12-18T00:11:55Z",
    "biotoolsCURIE": "biotools:rnawolf",
    "biotoolsID": "rnawolf",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.tbi.univie.ac.at/~ivo/"
        }
    ],
    "description": "This tool and MC-Fold-DP are two programs (rather, collections of a library and several programs, each) that deal with RNA secondary structure prediction.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://www.tbi.univie.ac.at/software/rnawolf/rnawolf.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "RNA secondary structure prediction",
                    "uri": "http://edamontology.org/operation_0278"
                }
            ]
        }
    ],
    "homepage": "http://www.tbi.univie.ac.at/software/rnawolf/index.html",
    "language": [
        "Perl"
    ],
    "lastUpdate": "2018-12-10T12:58:54Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/rnawolf-0-3-2-mc-fold-dp-rna-secondary-structure-prediction.html"
        }
    ],
    "name": "RNAwolf",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btr220",
            "metadata": {
                "abstract": "Motivation: RNA secondary structure contains many non-canonical base pairs of different pair families. Successful prediction of these structural features leads to improved secondary structures with applications in tertiary structure prediction and simultaneous folding and alignment. Results: We present a theoretical model capturing both RNA pair families and extended secondary structure motifs with shared nucleotides using 2-diagrams. We accompany this model with a number of programs for parameter optimization and structure prediction. © The Author(s) 2011. Published by Oxford University Press.",
                "authors": [
                    {
                        "name": "Bernhart S.H."
                    },
                    {
                        "name": "Hofacker I.L."
                    },
                    {
                        "name": "Honer zu Siederdissen C."
                    },
                    {
                        "name": "Stadler P.F."
                    }
                ],
                "citationCount": 45,
                "date": "2011-01-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "A folding algorithm for extended RNA secondary structures"
            },
            "type": [
                "Primary"
            ]
        },
        {
            "doi": "10.1186/1471-2105-9-340",
            "metadata": {
                "abstract": "Background: The ability to access, search and analyse secondary structures of a large set of known RNA molecules is very important for deriving improved RNA energy models, for evaluating computational predictions of RNA secondary structures and for a better understanding of RNA folding. Currently there is no database that can easily provide these capabilities for almost all RNA molecules with known secondary structures. Results: In this paper we describe RNA STRAND - the RNA secondary STRucture and statistical ANalysis Database, a curated database containing known secondary structures of any type and organism. Our new database provides a wide collection of known RNA secondary structures drawn from public databases, searchable and downloadable in a common format. Comprehensive statistical information on the secondary structures in our database is provided using the RNA Secondary Structure Analyser, a new tool we have developed to analyse RNA secondary structures. The information thus obtained is valuable for understanding to which extent and with which probability certain structural motifs can appear. We outline several ways in which the data provided in RNA STRAND can facilitate research on RNA structure, including the improvement of RNA energy models and evaluation of secondary structure prediction programs. In order to keep up-to-date with new RNA secondary structure experiments, we offer the necessary tools to add solved RNA secondary structures to our database and invite researchers to contribute to RNA STRAND. Conclusion: RNA STRAND is a carefully assembled database of trusted RNA secondary structures, with easy on-line tools for searching, analyzing and downloading user selected entries, and is publicly available at http://www.rnasoft.ca/strand. © 2008 Andronescu et al; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Andronescu M."
                    },
                    {
                        "name": "Bereg V."
                    },
                    {
                        "name": "Condon A."
                    },
                    {
                        "name": "Hoos H.H."
                    }
                ],
                "citationCount": 187,
                "date": "2008-08-13T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "RNA STRAND: The RNA secondary structure and statistical analysis database"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Nucleic acid structure analysis",
            "uri": "http://edamontology.org/topic_0097"
        },
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        }
    ],
    "validated": 1,
    "version": [
        "0.3.2"
    ]
}
