{
    "additionDate": "2021-01-18T09:58:33Z",
    "biotoolsCURIE": "biotools:pedl",
    "biotoolsID": "pedl",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "jana.wolf@mdc-berlin.de",
            "name": "Jana Wolf",
            "typeEntity": "Person"
        },
        {
            "email": "leser@informatik.hu-berlin.de",
            "name": "Ulf Leser",
            "typeEntity": "Person"
        }
    ],
    "description": "PEDL is a method for predicting protein-protein assocations from text. extracting protein-protein associations using deep language models and distant supervision.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Named-entity and concept recognition",
                    "uri": "http://edamontology.org/operation_3280"
                },
                {
                    "term": "Relation extraction",
                    "uri": "http://edamontology.org/operation_3625"
                },
                {
                    "term": "Pathway analysis",
                    "uri": "http://edamontology.org/operation_3928"
                }
            ]
        }
    ],
    "homepage": "https://github.com/leonweber/pedl",
    "language": [
        "Python",
        "Shell"
    ],
    "lastUpdate": "2021-01-23T07:50:52Z",
    "name": "PEDL",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAA430",
            "metadata": {
                "abstract": "© The Author(s) 2020. Published by Oxford University Press.Motivation: A significant portion of molecular biology investigates signalling pathways and thus depends on an up-to-date and complete resource of functional protein-protein associations (PPAs) that constitute such pathways. Despite extensive curation efforts, major pathway databases are still notoriously incomplete. Relation extraction can help to gather such pathway information from biomedical publications. Current methods for extracting PPAs typically rely exclusively on rare manually labelled data which severely limits their performance. Results: We propose PPA Extraction with Deep Language (PEDL), a method for predicting PPAs from text that combines deep language models and distant supervision. Due to the reliance on distant supervision, PEDL has access to an order of magnitude more training data than methods solely relying on manually labelled annotations. We introduce three different datasets for PPA prediction and evaluate PEDL for the two subtasks of predicting PPAs between two proteins, as well as identifying the text spans stating the PPA. We compared PEDL with a recently published state-of-the-art model and found that on average PEDL performs better in both tasks on all three datasets. An expert evaluation demonstrates that PEDL can be used to predict PPAs that are missing from major pathway databases and that it correctly identifies the text spans supporting the PPA. Availability and implementation: PEDL is freely available at https://github.com/leonweber/pedl. The repository also includes scripts to generate the used datasets and to reproduce the experiments from this article.",
                "authors": [
                    {
                        "name": "Weber L."
                    },
                    {
                        "name": "Thobe K."
                    },
                    {
                        "name": "Lozano O.A.M."
                    },
                    {
                        "name": "Wolf J."
                    },
                    {
                        "name": "Leser U."
                    }
                ],
                "date": "2020-01-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "PEDL: Extracting protein-protein associations using deep language models and distant supervision"
            },
            "pmcid": "PMC7355289",
            "pmid": "32657389"
        }
    ],
    "topic": [
        {
            "term": "Natural language processing",
            "uri": "http://edamontology.org/topic_0218"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        }
    ],
    "validated": 1
}