
{
    "credit": [
        {
            "name": "UDUS",
            "typeEntity": "Institute",
            "typeRoles": [
                "Provider"
            ]
        },
        {
            "name": "BioMedBridges",
            "typeEntity": "Consortium",
            "typeRoles": [
                "Documentor"
            ],
            "url": "http://www.biomedbridges.eu"
        },
        {
            "email": "Benjamin.Braasch@med.uni-duesseldorf.de",
            "name": "Benjamin Braasch",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Keyword",
                        "uri": "http://edamontology.org/data_0968"
                    }
                }
            ],
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Clinical trial report",
                        "uri": "http://edamontology.org/data_3558"
                    }
                }
            ]
        }
    ],
    "labels": {
        "collectionID": [
            "BioMedBridges Tools"
        ],
        "toolType": [
            "Database portal"
        ],
        "topic": [
            {
                "term": "Data acquisition",
                "uri": "http://edamontology.org/topic_3077"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© 2016 For research in biomedical sciences, cross-domain searches through several different databases are an increasingly necessary task that often becomes a time consuming and labour-intense process. This is especially the case when different domain databases have to be combined, for example combined searches in clinical trials registries, publication databases and research databases. The Clinical Trial Information Mediator (CTIM) addresses this problem and offers a novel way for the combined search in ClinicalTrials.gov, PubMed and BioSamples. CTIM was developed based on a requirements analysis and implemented using open source technology. A search engine with a graphical user interface was developed in order to search linked data in the three databases ClinicalTrials.gov, PubMed and BioSamples; thereby enabling CTIM to bridge the gap between different knowledge domains of clinical trials, publications of research results and biosamples/genetic information. CTIM was applied in three use cases demonstrating that information retrieval could be considerably improved in sense for complex queries. These use cases show that more relevant results were obtained and more associated publications and biosamples could be retrieved in comparison to a separate single search. Main advantages of CTIM are identifying related information between clinical trials and publications employing a clinical trial centred kind of search, simplified access to its databases and thus reduced search time. In addition it can be used by researchers without prior training because of the intuitive usage.",
            "authors": [
                "Krauth C.",
                "Kuchinke W.",
                "Eckert M.",
                "Bergmann R.",
                "Braasch B.",
                "Karakoyun T.",
                "Ohmann C."
            ],
            "cit_count": 1,
            "doi": "10.1016/j.jbi.2016.08.012",
            "journal": "Journal of Biomedical Informatics",
            "title": "Clinical Trial Information Mediator",
            "type": "Primary",
            "year": "2016-10-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:clinical_trials_information_mediator",
        "biotoolsID": "clinical_trials_information_mediator",
        "description": "Easy access to results of publications and genetic or drug information in other databases that are relevant to a clinical trials.",
        "homepage": "http://hhu3.at.xencon.de/ctim",
        "name": "Clinical Trials Information Mediator"
    }
}