{
    "additionDate": "2021-01-18T10:27:57Z",
    "biotoolsCURIE": "biotools:care",
    "biotoolsID": "care",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "kallenborn@uni-mainz.de",
            "name": "Felix Kallenborn",
            "typeEntity": "Person"
        },
        {
            "email": "bertil.schmidt@uni-mainz.de",
            "name": "Bertil Schmidt",
            "typeEntity": "Person"
        }
    ],
    "description": "CARE is an alignment-based scalable error correction algorithm for Illumina data using the concept of minhashing. Minhashing allows for efficient similarity search within large sequencing read collections which enables fast computation of high-quality multiple alignments. Sequencing errors are corrected by detailed inspection of the corresponding alignments.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "De-novo assembly",
                    "uri": "http://edamontology.org/operation_0524"
                },
                {
                    "term": "k-mer counting",
                    "uri": "http://edamontology.org/operation_3472"
                },
                {
                    "term": "Genome assembly",
                    "uri": "http://edamontology.org/operation_0525"
                }
            ]
        }
    ],
    "homepage": "https://github.com/fkallen/CARE",
    "language": [
        "C++"
    ],
    "lastUpdate": "2021-02-07T13:44:50Z",
    "license": "GPL-3.0",
    "name": "CARE",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAA738",
            "metadata": {
                "abstract": "© 2020 The Author(s) 2020. Published by Oxford University Press. All rights reserved. For permissions, please e-mail: journals.permissions@oup.com.Motivation: Error correction is a fundamental pre-processing step in many Next-Generation Sequencing (NGS) pipelines, in particular for de novo genome assembly. However, existing error correction methods either suffer from high false-positive rates since they break reads into independent k-mers or do not scale efficiently to large amounts of sequencing reads and complex genomes. Results: We present CARE - an alignment-based scalable error correction algorithm for Illumina data using the concept of minhashing. Minhashing allows for efficient similarity search within large sequencing read collections which enables fast computation of high-quality multiple alignments. Sequencing errors are corrected by detailed inspection of the corresponding alignments. Our performance evaluation shows that CARE generates significantly fewer false-positive corrections than state-of-the-art tools (Musket, SGA, BFC, Lighter, Bcool, Karect) while maintaining a competitive number of true positives. When used prior to assembly it can achieve superior de novo assembly results for a number of real datasets. CARE is also the first multiple sequence alignment-based error corrector that is able to process a human genome Illumina NGS dataset in only 4 h on a single workstation using GPU acceleration. Availabilityand implementation: CARE is open-source software written in C++ (CPU version) and in CUDA/C++ (GPU version). It is licensed under GPLv3 and can be downloaded at https://github.com/fkallen/CARE.",
                "authors": [
                    {
                        "name": "Kallenborn F."
                    },
                    {
                        "name": "Hildebrandt A."
                    },
                    {
                        "name": "Schmidt B."
                    }
                ],
                "date": "2021-04-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "CARE: Context-aware sequencing read error correction"
            },
            "pmid": "32818262"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        },
        {
            "term": "Critical care medicine",
            "uri": "http://edamontology.org/topic_3403"
        }
    ]
}