{"credit":[{"email":"urgi-support@inrae.fr","name":"urgi-support","typeRoles":["Primary contact"]}],"documentation":[{"type":"TERMS_OF_USE","url":"https://urgi.versailles.inra.fr/data-discovery/legal"},{"type":"CONTRIBUTIONS_POLICY","url":"https://urgi.versailles.inra.fr/data-discovery/join"},{"url":"https://urgi.versailles.inra.fr/data-discovery/help"}],"function":[{"input":[{"data":{"term":"Keyword","uri":"http://edamontology.org/data_0968"}}],"operation":[{"term":"Data retrieval","uri":"http://edamontology.org/operation_2422"},{"term":"Query and retrieval","uri":"http://edamontology.org/operation_0224"},{"term":"Information retrieval","uri":"http://edamontology.org/operation_3908"}],"output":[{"data":{"term":"Database search results","uri":"http://edamontology.org/data_2080"}},{"data":{"term":"Text mining report","uri":"http://edamontology.org/data_0972"}},{"data":{"term":"Identifier","uri":"http://edamontology.org/data_0842"}}]}],"labels":{"collectionID":["elixir-fr-sdp-2019","FR"],"cost":"Free of charge","elixirNode":["France"],"elixirPlatform":["Data","Tools","Interoperability"],"language":["JavaScript","Java"],"license":"BSD-3-Clause","maturity":"Emerging","operatingSystem":["Linux"],"toolType":["Web application","Database portal"],"topic":[{"term":"Agricultural science","uri":"http://edamontology.org/topic_3810"}]},"link":[{"note":"DataDiscovery for Wheat","type":"SERVICE","url":"https://urgi.versailles.inra.fr/wheatis/"},{"note":"DataDiscovery for URGI","type":"SERVICE","url":"https://urgi.versailles.inra.fr/data-discovery/"},{"note":"DataDiscovery for RARe","type":"SERVICE","url":"https://urgi.versailles.inra.fr/rare/"}],"publication":[{"abstract":"© Crop Science Society of America.The genome sequences of many important Triticeae species, including bread wheat (Triticum aestivum L.) and barley (Hordeum vulgare L.), remained uncharacterized for a long time because their high repeat content, large sizes, and polyploidy. As a result of improvements in sequencing technologies and novel analyses strategies, several of these have recently been deciphered. These efforts have generated new insights into Triticeae biology and genome organization and have important implications for downstream usage by breeders, experimental biologists, and comparative genomicists. transPLANT (http://www.transplantdb.eu) is an EU-funded project aimed at constructing hardware, software, and data infrastructure for genome-scale research in the life sciences. Since the Triticeae data are intrinsically complex, heterogenous, and distributed, the transPLANT consortium has undertaken efforts to develop common data formats and tools that enable the exchange and integration of data from distributed resources. Here we present an overview of the individual Triticeae genome resources hosted by transPLANT partners, introduce the objectives of transPLANT, and outline common developments and interfaces supporting integrated data access.","authors":["Spannagl M.","Alaux M.","Lange M.","Bolser D.M.","Bader K.C.","Letellier T.","Kimmel E.","Flores R.","Pommier C.","Kerhornou A.","Walts B.","Nussbaumer T.","Grabmuller C.","Chen J.","Colmsee C.","Beier S.","Mascher M.","Schmutzer T.","Arend D.","Thanki A.","Ramirez-Gonzalez R.","Ayling M.","Ayling S.","Caccamo M.","Mayer K.F.X.","Scholz U.","Steinbach D.","Quesneville H.","Kersey P.J."],"cit_count":4,"doi":"10.3835/plantgenome2015.06.0038","journal":"Plant Genome","title":"TransPLANT resources for triticeae genomic data","type":"Primary","year":"2016-03-01"},{"abstract":"© 2016 The Author(s).Viticulture, like other fields of agriculture, is currently facing important challenges that will be addressed only through sustained, dedicated and coordinated research. Although the methods used in biology have evolved tremendously in recent years and now involve the routine production of large data sets of varied nature, in many domains of study, including grapevine research, there is a need to improve the findability, accessibility, interoperability and reusability (FAIR-ness) of these data. Considering the heterogeneous nature of the data produced, the transnational nature of the scientific community and the experience gained elsewhere, we have formed an open working group, in the framework of the International Grapevine Genome Program (www.vitaceae.org), to construct a coordinated federation of information systems holding grapevine data distributed around the world, providing an integrated set of interfaces supporting advanced data modeling, rich semantic integration and the next generation of data mining tools. To achieve this goal, it will be critical to develop, implement and adopt appropriate standards for data annotation and formatting. The development of this system, the GrapeIS, linking genotypes to phenotypes, and scientific research to agronomical and oeneological data, should provide new insights into grape biology, and allow the development of new varieties to meet the challenges of biotic and abiotic stress, environmental change, and consumer demand.","authors":["Adam-Blondon A.-F.","Alaux M.","Pommier C.","Cantu D.","Cheng Z.-M.","Cramer G.","Davies C.","Delrot S.","Deluc L.","Di Gaspero G.","Grimplet J.","Fennell A.","Londo J.","Kersey P.","Mattivi F.","Naithani S.","Neveu P.","Nikolski M.","Pezzotti M.","Reisch B.","Topfer R.","Vivier M.","Ware D.","Quesneville H."],"cit_count":15,"doi":"10.1038/hortres.2016.56","journal":"Horticulture Research","title":"Towards an open grapevine information system","year":"2016-11-23"},{"abstract":"© 2018 The Author(s).The Wheat@URGI portal has been developed to provide the international community of researchers and breeders with access to the bread wheat reference genome sequence produced by the International Wheat Genome Sequencing Consortium. Genome browsers, BLAST, and InterMine tools have been established for in-depth exploration of the genome sequence together with additional linked datasets including physical maps, sequence variations, gene expression, and genetic and phenomic data from other international collaborative projects already stored in the GnpIS information system. The portal provides enhanced search and browser features that will facilitate the deployment of the latest genomics resources in wheat improvement.","authors":["Alaux M.","Rogers J.","Letellier T.","Flores R.","Alfama F.","Pommier C.","Mohellibi N.","Durand S.","Kimmel E.","Michotey C.","Guerche C.","Loaec M.","Laine M.","Steinbach D.","Choulet F.","Rimbert H.","Leroy P.","Guilhot N.","Salse J.","Feuillet C.","Paux E.","Eversole K.","Adam-Blondon A.-F.","Quesneville H."],"cit_count":26,"doi":"10.1186/s13059-018-1491-4","journal":"Genome Biology","title":"Linking the International Wheat Genome Sequencing Consortium bread wheat reference genome sequence to wheat genetic and phenomic data","year":"2018-08-17"}],"summary":{"biotoolsCURIE":"biotools:DataDiscovery","biotoolsID":"DataDiscovery","description":"The Data Discovery tool allows the discovery of any data type. Its current implementations supported by URGI are:\n•\tThe WheatIS search that allows to search 16 important worldwide community databases for this species. New nodes are still regularly included in the federation with the support of URGI staff.\n•\tA Plant Data Discovery Portal has also been set up by extending the access of the nodes involved in the WheatIS federation to data on other plant species and by adding new nodes.","homepage":"https://urgi.versailles.inra.fr/data-discovery","name":"DataDiscovery"}}