{"credit":[{"email":"m75225@gmail.com","name":"Chun-Yu Lin","typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://monetfamily.life.nctu.edu.tw/contact.php"}],"documentation":[{"type":"GENERAL","url":"http://monetfamily.life.nctu.edu.tw/help.php"}],"function":[{"operation":[{"term":"Pathway or network prediction","uri":"http://edamontology.org/operation_3439"}]}],"labels":{"operatingSystem":["Linux","Windows","Mac"],"toolType":["Web application"],"topic":[{"term":"Systems biology","uri":"http://edamontology.org/topic_2259"},{"term":"Proteins","uri":"http://edamontology.org/topic_0078"},{"term":"Protein interactions","uri":"http://edamontology.org/topic_0128"},{"term":"Molecular interactions, pathways and networks","uri":"http://edamontology.org/topic_0602"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/monetfamily-homologous-modules-and-module-module-interaction-networks-in-vertebrates.html"}],"publication":[{"abstract":"A module is a fundamental unit forming with highly connected proteins and performs a certain kind of biological functions. Modules and module-module interaction (MMI) network are essential for understanding cellular processes and functions. The MoNetFamily web server can identify the modules, homologous modules (called module family) and MMI networks across multiple species for the query protein(s). This server first finds module candidates of the query by using BLASTP to search the module template database (1785 experimental and 1252 structural templates). MoNetFamily then infers the homologous modules of the selected module candidate using protein-protein interaction (PPI) families. According to homologous modules and PPIs, we statistically calculated MMIs and MMI networks across multiple species. For each module candidate, MoNetFamily identifies its neighboring modules and their MMIs in module networks of Homo sapiens, Mus musculus and Danio rerio. Finally, MoNetFamily shows the conserved proteins, PPI profiles and functional annotations of the module family. Our results indicate that the server can be useful for MMI network (e.g. 1818 modules and 9678 MMIs in H. sapiens) visualizations and query annotations using module families and neighboring modules. We believe that the server is able to provide valuable insights to determine homologous modules and MMI networks across multiple species for studying module evolution and cellular processes. The MoNetFamily sever is available at http://monetfamily.life.nctu.edu.tw. © 2012 The Author(s).","authors":["Lin C.-Y.","Lin Y.-W.","Yu S.-W.","Lo Y.-S.","Yang J.-M."],"cit_count":5,"journal":"Nucleic Acids Research","pmid":"22689643","title":"MoNetFamily: A web server to infer homologous modules and module-module interaction networks in vertebrates","year":"2012-07-01"}],"summary":{"biotoolsCURIE":"biotools:monetfamily","biotoolsID":"monetfamily","description":"Web server that can identify the modules, homologous modules (called module family), and MMI networks across multiple species for the query protein(s).","homepage":"http://monetfamily.life.nctu.edu.tw/","name":"MoNetFamily"}}