{
    "name": "Homologous Series Detection", 
    "description": "Nontargeted homologue series extraction from hyphenated high resolution mass spectrometry data.", 
    "homepage": "https://www.envihomolog.eawag.ch/", 
    "biotoolsID": "homologous_series_detection", 
    "biotoolsCURIE": "biotools:homologous_series_detection", 
    "version": [], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_3214", 
                    "term": "Spectral analysis"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Web application"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_2258", 
            "term": "Cheminformatics"
        }, 
        {
            "uri": "http://edamontology.org/topic_3520", 
            "term": "Mass spectrometry"
        }, 
        {
            "uri": "http://edamontology.org/topic_3332", 
            "term": "Computational chemistry"
        }
    ], 
    "operatingSystem": [
        "Linux", 
        "Windows", 
        "Mac"
    ], 
    "language": [
        "R"
    ], 
    "license": null, 
    "collectionID": [
        "Proteomics"
    ], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [], 
    "download": [], 
    "documentation": [
        {
            "url": "https://www.envihomolog.eawag.ch/", 
            "type": "General", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": "10.1186/s13321-017-0197-z", 
            "pmid": null, 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "Nontargeted homologue series extraction from hyphenated high resolution mass spectrometry data", 
                "abstract": "© 2017 The Author(s). Background: A large proportion of polar anthropogenic compounds routinely released into the environment comprises homologue series, i.e., sets of chemicals differing in a repeating chemical unit. Using analytical techniques such as liquid chromatography coupled to high-resolution mass spectrometry (LC-HRMS), these compounds are readily measurable as signal sets with characteristic differences in mass and typically retention time. However, and despite such distinct characteristics, no computational approach for the direct, simultaneous and untargeted detection of all such signal sets comprising both LC and HRMS information has to date been presented. Results: A fast two-staged approach has been developed to extract LC-HRMS signal patterns which can be indicative of homologous analytes. In a first stage, a k-d tree representation of picked LC-HRMS peaks is used to extract all feasible 3-tuples of peaks with restrictions in, e.g., mass defect differences. A second stage then recombines these 3-tuples to larger series tuples while ensuring smooth changes in their retention time characteristics. This unsupervised approach was evaluated for ten effluent samples from Swiss sewage treatment plants (STPs), in both positive and negative electrospray-ionization. Conclusions: Beside recovering all continuous series of previously identified homologues, substantial fractions of nontargeted peaks could subsequently be assigned into very diverse peak series, although assignments were often not unique. The latter ambiguities were resolved by a self-organizing map technique and revealed both distinctive series meshing and rivaling combinatorial solutions in the presence of isobaric or gapped series peaks. When comparing STPs, several ubiquitous yet partially low-frequent series mass differences emerged and may prioritize future identification efforts. The presented algorithm is freely available as part of the R package nontarget and as a user-friendly web-interface at www.envihomolog.eawag.ch. Graphical Abstract Search for systematic series indicative of homologous compounds is based on a partitioned representation of LC-HRMS signal characteristics. This nontargeted search first extracts series triplets in a nearest-neighbour walk and then recombines them to larger ones. For illustration, the two dimensions involving mass defect characteristics are represented by one only.", 
                "date": "2017-02-23T00:00:00Z", 
                "citationCount": 6, 
                "authors": [
                    {
                        "name": "Loos M."
                    }, 
                    {
                        "name": "Singer H."
                    }
                ], 
                "journal": "Journal of Cheminformatics"
            }
        }
    ], 
    "credit": [
        {
            "name": "Martin Loos", 
            "email": "martin.loos@alumni.ethz.ch", 
            "url": null, 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "d.gabrielaitis", 
    "additionDate": "2018-09-01T09:52:14Z", 
    "lastUpdate": "2019-03-26T08:18:32Z", 
    "editPermission": {
        "type": "group", 
        "authors": [
            "proteomics.bio.tools"
        ]
    }, 
    "validated": 0, 
    "homepage_status": 0, 
    "elixir_badge": 0
}