{
    "additionDate": "2022-07-21T11:24:25.164636Z",
    "biotoolsCURIE": "biotools:pathvarweb",
    "biotoolsID": "pathvarweb",
    "collectionID": [
        "LCSB",
        "LCSB-BDS",
        "UniLu"
    ],
    "credit": [
        {
            "email": "enrico.glaab@uni.lu",
            "name": "Enrico Glaab",
            "orcidid": "https://orcid.org/0000-0003-3977-7469"
        }
    ],
    "description": "PathVar, a web-application to study how the variance of expression levels across genes/proteins in cellular pathways changes under different experimental conditions, and to extract patterns for sample clustering and classification.",
    "documentation": [
        {
            "type": [
                "Training material"
            ],
            "url": "https://lcsb-pathvar.uni.lu/pathvar/tutorial.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "homepage": "http://pathvar.embl.de/",
    "lastUpdate": "2024-11-24T15:53:54.826968Z",
    "maturity": "Mature",
    "name": "PathVar",
    "owner": "enricogl",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btr656",
            "metadata": {
                "abstract": "Finding significant differences between the expression levels of genes or proteins across diverse biological conditions is one of the primary goals in the analysis of functional genomics data. However, existing methods for identifying differentially expressed genes or sets of genes by comparing measures of the average expression across predefined sample groups do not detect differential variance in the expression levels across genes in cellular pathways. Since corresponding pathway deregulations occur frequently in microarray gene or protein expression data, we present a new dedicated web application, PathVar, to analyze these data sources. The software ranks pathway-representing gene/protein sets in terms of the differences of the variance in the within-pathway expression levels across different biological conditions. Apart from identifying new pathway deregulation patterns, the tool exploits these patterns by combining different machine learning methods to find clusters of similar samples and build sample classification models. © The Author(s) 2011. Published by Oxford University Press. All rights reserved.",
                "authors": [
                    {
                        "name": "Glaab E."
                    },
                    {
                        "name": "Schneider R."
                    }
                ],
                "citationCount": 11,
                "date": "2012-02-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Pathvar: Analysis of gene and protein expression variance in cellular pathways using microarray data"
            },
            "pmcid": "PMC3268235",
            "pmid": "22123829",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Functional genomics",
            "uri": "http://edamontology.org/topic_0085"
        }
    ]
}
