{
    "additionDate": "2017-12-18T00:06:36Z",
    "biotoolsCURIE": "biotools:frida",
    "biotoolsID": "frida",
    "credit": [
        {
            "name": "Bora Gurel",
            "orcidid": "http://orcid.org/0000-0002-5018-8078",
            "typeEntity": "Person",
            "typeRole": [
                "Contributor"
            ]
        },
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://tmalab.jhmi.edu/"
        }
    ],
    "description": "Frida (FRamework for Image Dataset Analysis) is image analysis software. Frida was developed by the Johns Hopkins University Tissue Microarray Core Facility. Frida is open source and written in 100% Java. Frida makes use of functionality from the NIH’s ImageJ application.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                }
            ]
        }
    ],
    "homepage": "http://bui3.win.ad.jhu.edu/frida/",
    "language": [
        "Java"
    ],
    "lastUpdate": "2018-12-24T22:47:41Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/frida-1-1-0-framework-image-dataset-analysis.html"
        }
    ],
    "name": "Frida",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1038/modpathol.2008.111",
            "metadata": {
                "abstract": "The MYC onco-protein is a transcription factor that regulates cell proliferation, metabolism, protein synthesis, mitochondrial function and stem cell renewal. A region on chromosome 8q24 encompassing the MYC locus is amplified in prostate cancer, but this occurs mostly in advanced disease suggesting that MYC alterations occur late in prostate cancer. In contrast, MYC mRNA is elevated in most prostate cancers, even those of relatively low stage and grade (eg Gleason score 6) suggesting that MYC plays a role in initiation. However, since MYC protein levels are tightly regulated, elevated MYC mRNA does not necessarily imply elevated MYC protein. Thus, it is critical to determine whether MYC protein is elevated in human prostate cancer, and if so, at what stage of the disease this elevation occurs. Prior studies of MYC protein localization have been hampered by lack of suitable antibodies and controls. We utilized a new anti-MYC antibody coupled with genetically defined control experiments to localize MYC protein within human tissue microarrays consisting of normal, atrophy, PIN, primary adenocarcinoma, and metastatic adenocarcinoma. Nuclear overexpression of MYC protein occurred frequently in luminal cells of PIN, as well as in most primary carcinomas and metastatic disease. MYC protein did not correlate with gain of 8q24, suggesting alternative mechanisms for MYC overexpression. These results provide evidence that upregulation of nuclear MYC protein expression is a highly prevalent and early change in prostate cancer and suggest that increased nuclear MYC may be a critical oncogenic event driving human prostate cancer initiation and progression. © 2008 USCAP, Inc All rights reserved.",
                "authors": [
                    {
                        "name": "Cornish T.C."
                    },
                    {
                        "name": "De Marzo A.M."
                    },
                    {
                        "name": "Gurel B."
                    },
                    {
                        "name": "Hicks J.L."
                    },
                    {
                        "name": "Isaacs W.B."
                    },
                    {
                        "name": "Iwata T."
                    },
                    {
                        "name": "Jenkins R.B."
                    },
                    {
                        "name": "Koh C.M."
                    },
                    {
                        "name": "Lan F."
                    },
                    {
                        "name": "Luo J."
                    },
                    {
                        "name": "Morgan J."
                    },
                    {
                        "name": "Sutcliffe S."
                    },
                    {
                        "name": "Van Dang C."
                    }
                ],
                "citationCount": 279,
                "date": "2008-09-01T00:00:00Z",
                "journal": "Modern Pathology",
                "title": "Nuclear MYC protein overexpression is an early alteration in human prostate carcinogenesis"
            },
            "pmcid": "PMC3170853",
            "pmid": "18567993",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Tissue microarray",
            "uri": "http://edamontology.org/topic_3518"
        }
    ],
    "validated": 1,
    "version": [
        "1.1.0"
    ]
}
