{
    "additionDate": "2017-12-18T00:05:43Z",
    "biotoolsCURIE": "biotools:drimust",
    "biotoolsID": "drimust",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://bioinfo.cs.technion.ac.il/people/zohar/"
        }
    ],
    "description": "DRIMUST is a software implementation of a new statistical and algorithmic approach that we developed to enable efficient motif searches, covering a broader range of motif spaces comparing with state of the art motif searching tools. In particular, DRIMUST can efficiently search for variable gapped motifs, long motifs and motifs over large alphabets. The motif structure that DRIMUST searches comprises two half sites separated by a gap, that can be of a variable length.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://drimust.technion.ac.il/manual.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Search",
                    "uri": "http://edamontology.org/operation_2421"
                }
            ]
        }
    ],
    "homepage": "http://drimust.technion.ac.il/",
    "language": [
        "Java"
    ],
    "lastUpdate": "2018-12-10T12:58:57Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/drimust-discovering-ranked-imbalanced-motifs-suffix-trees.html"
        }
    ],
    "name": "DRIMust",
    "operatingSystem": [
        "Linux",
        "Windows"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1093/nar/gkt407",
            "metadata": {
                "abstract": "Cellular regulation mechanisms that involve proteins and other active molecules interacting with specific targets often involve the recognition of sequence patterns. Short sequence elements on DNA, RNA and proteins play a central role in mediating such molecular recognition events. Studies that focus on measuring and investigating sequence-based recognition processes make use of statistical and computational tools that support the identification and understanding of sequence motifs. We present a new web application, named DRIMust, freely accessible through the website http://drimust.technion.ac.il for de novo motif discovery services. The DRIMust algorithm is based on the minimum hypergeometric statistical framework and uses suffix trees for an efficient enumeration of motif candidates. DRIMust takes as input ranked lists of sequences in FASTA format and returns motifs that are over-represented at the top of the list, where the determination of the threshold that defines top is data driven. The resulting motifs are presented individually with an accurate P-value indication and as a Position Specific Scoring Matrix. Comparing DRIMust with other state-of-the-art tools demonstrated significant advantage to DRIMust, both in result accuracy and in short running times. Overall, DRIMust is unique in combining efficient search on large ranked lists with rigorous P-value assessment for the detected motifs.",
                "authors": [
                    {
                        "name": "Leibovich L."
                    },
                    {
                        "name": "Paz I."
                    },
                    {
                        "name": "Yakhini Z."
                    },
                    {
                        "name": "Mandel-Gutfreund Y."
                    }
                ],
                "citationCount": 36,
                "date": "2013-01-01T00:00:00Z",
                "journal": "Nucleic acids research",
                "title": "DRIMust: a web server for discovering rank imbalanced motifs using suffix trees."
            },
            "type": [
                "Primary"
            ]
        },
        {
            "doi": "10.1093/nar/gks206",
            "metadata": {
                "abstract": "Sequence elements, at all levels-DNA, RNA and protein, play a central role in mediating molecular recognition and thereby molecular regulation and signaling. Studies that focus on measuring and investigating sequence-based recognition make use of statistical and computational tools, including approaches to searching sequence motifs. State-of-the-art motif searching tools are limited in their coverage and ability to address large motif spaces. We develop and present statistical and algorithmic approaches that take as input ranked lists of sequences and return significant motifs. The efficiency of our approach, based on suffix trees, allows searches over motif spaces that are not covered by existing tools. This includes searching variable gap motifs-two half sites with a flexible length gap in between-and searching long motifs over large alphabets. We used our approach to analyze several high-throughput measurement data sets and report some validation results as well as novel suggested motifs and motif refinements. We suggest a refinement of the known estrogen receptor 1 motif in humans, where we observe gaps other than three nucleotides that also serve as significant recognition sites, as well as a variable length motif related to potential tyrosine phosphorylation. © 2012 The Author(s).",
                "authors": [
                    {
                        "name": "Leibovich L."
                    },
                    {
                        "name": "Yakhini Z."
                    }
                ],
                "citationCount": 13,
                "date": "2012-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "Efficient motif search in ranked lists and applications to variable gap motifs"
            }
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        }
    ],
    "validated": 1,
    "version": [
        "1.0"
    ]
}