{
    "additionDate": "2021-01-18T06:58:20Z",
    "biotoolsCURIE": "biotools:spread",
    "biotoolsID": "spread",
    "confidence_flag": "tool",
    "description": "A Fully Automated Toolkit for Single-Particle Cryogenic Electron Microscopy Data 3D Reconstruction with Image-Network-Aided Orientation Assignment.\n\nSPREAD: A fully automated toolkit for single-particle cryo-EM data 3D reconstruction with image network-aided orientation assignment.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Single particle analysis",
                    "uri": "http://edamontology.org/operation_3457"
                },
                {
                    "term": "Peak detection",
                    "uri": "http://edamontology.org/operation_3215"
                },
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                }
            ]
        }
    ],
    "homepage": "http://www.csbio.sjtu.edu.cn/bioinf/SPREAD/",
    "lastUpdate": "2021-02-21T14:58:04Z",
    "name": "SPREAD",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1021/ACS.JCIM.9B01099",
            "metadata": {
                "abstract": "Copyright © 2020 American Chemical Society.For the past decade, cryogenic electron microscopy (cryo-EM) has become an important technology to determine three-dimensional (3D) structures of biomacromolecules. Many software tools have been developed for cryo-EM image processing and 3D reconstruction, covering various computational tasks in cryo-EM data analysis. Despite the recent progress, most of these software tools focus on a single task, such as automatic particle picking or image clustering, whereas software packages covering the whole pipeline of cryo-EM data processing are still few. In this study, we developed a fully automatic single-particle reconstruction and analysis toolkit for cryo-EM data, named SPREAD, which integrates 2D image classification, 3D initial model generation, model selection, and 3D refinement. In SPREAD, we adopt our previously proposed network-based clustering algorithm for 2D image classification, NCEM, and the reference-free resolution measurement method SRes to realize the automatic model ranking and selection procedure. Projection orientation assignment is one of the key steps in initial model generation and 3D refinement. In SPREAD, we use the network-based image similarity metric and introduce a new probabilistic-based orientation searching method, named peak finding, to enhance assignment of the projection orientations. For dealing with both the particle images and projection images in the 3D refinement using SPREAD, we build a mixture image network containing both of these types of images on the basis of the peak-finding results, and then similarities for node pairs are recomputed by a superposed random walk on the network. SPREAD achieves a fully automatic workflow in which nearly no expert domain knowledge and interactive manual operation are involved. Our software can accessed for free at http://www.csbio.sjtu.edu.cn/bioinf/SPREAD/ for academic use.",
                "authors": [
                    {
                        "name": "Xie R."
                    },
                    {
                        "name": "Chen Y.-X."
                    },
                    {
                        "name": "Cai J.-M."
                    },
                    {
                        "name": "Yang Y."
                    },
                    {
                        "name": "Shen H.-B."
                    }
                ],
                "citationCount": 4,
                "date": "2020-05-26T00:00:00Z",
                "journal": "Journal of Chemical Information and Modeling",
                "title": "SPREAD: A Fully Automated Toolkit for Single-Particle Cryogenic Electron Microscopy Data 3D Reconstruction with Image-Network-Aided Orientation Assignment"
            },
            "pmid": "31990536"
        }
    ],
    "topic": [
        {
            "term": "Electron microscopy",
            "uri": "http://edamontology.org/topic_0611"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        }
    ]
}