
{
    "credit": [
        {
            "email": "hyung_won_choi@nuhs.edu.sg",
            "name": "Hyungwon Choi",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "url": "http://bioconductor.org/packages/release/bioc/html/metaArray.html"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://bioconductor/packages/release/bioc/src/contrib/metaArray_1.52.0.tar.gz"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Formatting",
                    "uri": "http://edamontology.org/operation_0335"
                }
            ]
        }
    ],
    "labels": {
        "collectionID": [
            "BioConductor"
        ],
        "language": [
            "R"
        ],
        "license": "GPL-2.0",
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Command-line tool",
            "Library"
        ],
        "topic": [
            {
                "term": "Gene expression",
                "uri": "http://edamontology.org/topic_0203"
            },
            {
                "term": "Microarray experiment",
                "uri": "http://edamontology.org/topic_3518"
            },
            {
                "term": "Data management",
                "uri": "http://edamontology.org/topic_3071"
            }
        ]
    },
    "publication": [
        {
            "abstract": "Background: With the explosion in data generated using microarray technology by different investigators working on similar experiments, it is of interest to combine results across multiple studies. Results: In this article, we describe a general probabilistic framework for combining high-throughput genomic data from several related microarray experiments using mixture models. A key feature of the model is the use of latent variables that represent quantities that can be combined across diverse platforms. We consider two methods for estimation of an index termed the probability of expression (POE). The first, reported in previous work by the authors, involves Markov Chain Monte Carlo (MCMC) techniques. The second method is a faster algorithm based on the expectation-maximization (EM) algorithm. The methods are illustrated with application to a meta-analysis of datasets for metastatic cancer. Conclusion: The statistical methods described in the paper are available as an R package, metaArray 1.8.1, which is at Bioconductor, whose URL is http://www.bioconductor.org/. © 2007 Choi et al; licensee BioMed Central Ltd.",
            "authors": [
                "Choi H.",
                "Shen R.",
                "Chinnaiyan A.M.",
                "Ghosh D."
            ],
            "cit_count": 42,
            "doi": "10.1186/1471-2105-8-364",
            "journal": "BMC Bioinformatics",
            "title": "A latent variable approach for meta-analysis of gene expression data from multiple microarray experiments",
            "type": "Primary",
            "year": "2007-09-27"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:metaarray",
        "biotoolsID": "metaarray",
        "description": "Data transformation for meta-analysis of microarray data: Transformation of gene expression data to signed probability scale (MCMC/EM methods). Combined differential expression on raw scale: Weighted Z-score after stabilizing mean-variance relation within platform.",
        "homepage": "http://bioconductor.org/packages/release/bioc/html/metaArray.html",
        "name": "metaArray",
        "version": [
            "1.52.0"
        ]
    }
}