{
    "accessibility": "Open access",
    "additionDate": "2022-06-07T05:23:22.542241Z",
    "biotoolsCURIE": "biotools:coreatac",
    "biotoolsID": "coreatac",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "duygu.ucar@jax.org",
            "name": "Duygu Ucar",
            "orcidid": "https://orcid.org/0000-0002-9772-3066",
            "typeEntity": "Person"
        }
    ],
    "description": "A deep learning model for the functional classification of regulatory elements from single cell and bulk ATAC-seq data.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Peak calling",
                    "uri": "http://edamontology.org/operation_3222"
                },
                {
                    "term": "Promoter prediction",
                    "uri": "http://edamontology.org/operation_0440"
                },
                {
                    "term": "Sequence trimming",
                    "uri": "http://edamontology.org/operation_3192"
                }
            ]
        }
    ],
    "homepage": "https://github.com/UcarLab/CoRE-ATAC",
    "language": [
        "Java",
        "Python"
    ],
    "lastUpdate": "2022-06-07T05:24:40.467943Z",
    "license": "MIT",
    "name": "CoRE-ATAC",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PCBI.1009670",
            "metadata": {
                "abstract": "© 2021 Thibodeau et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Cis-Regulatory elements (cis-REs) include promoters, enhancers, and insulators that regulate gene expression programs via binding of transcription factors. ATAC-seq technology effectively identifies active cis-REs in a given cell type (including from single cells) by mapping accessible chromatin at base-pair resolution. However, these maps are not immediately useful for inferring specific functions of cis-REs. For this purpose, we developed a deep learning framework (CoRE-ATAC) with novel data encoders that integrate DNA sequence (reference or personal genotypes) with ATAC-seq cut sites and read pileups. CoRE-ATAC was trained on 4 cell types (n = 6 samples/replicates) and accurately predicted known cis-RE functions from 7 cell types (n = 40 samples) that were not used in model training (mean average precision = 0.80, mean F1 score = 0.70). CoRE-ATAC enhancer predictions from 19 human islet samples coincided with genetically modulated gain/loss of enhancer activity, which was confirmed by massively parallel reporter assays (MPRAs). Finally, CoRE-ATAC effectively inferred cis-RE function from aggregate single nucleus ATAC-seq (snATAC) data from human blood-derived immune cells that overlapped with known functional annotations in sorted immune cells, which established the efficacy of these models to study cis-RE functions of rare cells without the need for cell sorting. ATAC-seq maps from primary human cells reveal individual- and cell-specific variation in cis-RE activity. CoRE-ATAC increases the functional resolution of these maps, a critical step for studying regulatory disruptions behind diseases.",
                "authors": [
                    {
                        "name": "Eroglu A."
                    },
                    {
                        "name": "Khetan S."
                    },
                    {
                        "name": "Stitzel M.L."
                    },
                    {
                        "name": "Tewhey R."
                    },
                    {
                        "name": "Thibodeau A."
                    },
                    {
                        "name": "Ucar D."
                    }
                ],
                "citationCount": 1,
                "date": "2021-12-01T00:00:00Z",
                "journal": "PLoS Computational Biology",
                "title": "CoRE-ATAC: A deep learning model for the functional classification of regulatory elements from single cell and bulk ATAC-seq data"
            },
            "pmcid": "PMC8699717",
            "pmid": "34898596"
        }
    ],
    "toolType": [
        "Workbench"
    ],
    "topic": [
        {
            "term": "ChIP-seq",
            "uri": "http://edamontology.org/topic_3169"
        },
        {
            "term": "Epigenomics",
            "uri": "http://edamontology.org/topic_3173"
        },
        {
            "term": "Gene regulation",
            "uri": "http://edamontology.org/topic_0204"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ]
}
