{
    "additionDate": "2021-01-18T09:27:46Z",
    "biotoolsCURIE": "biotools:taxamat",
    "biotoolsID": "taxamat",
    "confidence_flag": "tool",
    "description": "Automated biodiversity data management tool.\n\n Taxamat is avialable either as a single executable file or as an installable package. In addition you can also download example test data together with a manual that contains a step-by-step user'guide.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Taxonomic classification",
                    "uri": "http://edamontology.org/operation_3460"
                },
                {
                    "term": "Filtering",
                    "uri": "http://edamontology.org/operation_3695"
                },
                {
                    "term": "Parsing",
                    "uri": "http://edamontology.org/operation_1812"
                }
            ]
        }
    ],
    "homepage": "http://www.taxamat.com",
    "lastUpdate": "2021-02-26T16:26:57Z",
    "name": "Taxamat",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1556/2060.2020.00004",
            "metadata": {
                "abstract": "© 2020 The Author(s)Working with biodiversity data is a computationally intensive process. Numerous applications and services provide options to deal with sequencing and taxonomy data. Professional statistics software are also available to analyze these type of data. However, in-between the two processes there is a huge need to curate biodiversity sample files. Curation involves creating summed abundance values for chosen taxonomy ranks, excluding certain taxa from analysis, and finally merging and downsampling data files. Very few tools, if any, offer a solution to this problem, thus we present Taxamat, a simple data management application that allows for curation of biodiversity data files before they can be imported to other statistics software. Taxamat is a downloadable application for automated curation of biodiversity data featuring taxonomic classification, taxon filtering, sample merging, and downsampling. Input and output files are compatible with most widely used programs. Taxamat is available on the web at http://www.taxamat.com either as a single executable or as an installable package for Microsoft Windows platforms.",
                "authors": [
                    {
                        "name": "Vida A."
                    },
                    {
                        "name": "Bodrogi B.L."
                    },
                    {
                        "name": "Balogh B."
                    },
                    {
                        "name": "Bai P."
                    }
                ],
                "citationCount": 2,
                "date": "2020-03-01T00:00:00Z",
                "journal": "Physiology International",
                "title": "Taxamat: Automated biodiversity data management tool - Implications for microbiome studies"
            },
            "pmid": "32491285"
        }
    ],
    "topic": [
        {
            "term": "Biodiversity",
            "uri": "http://edamontology.org/topic_3050"
        },
        {
            "term": "Taxonomy",
            "uri": "http://edamontology.org/topic_0637"
        },
        {
            "term": "Microbial ecology",
            "uri": "http://edamontology.org/topic_3697"
        }
    ]
}