{
    "additionDate": "2020-01-14T09:49:47Z",
    "biotoolsCURIE": "biotools:CRISPR",
    "biotoolsID": "CRISPR",
    "confidence_flag": "very low",
    "credit": [
        {
            "email": "biohuma@gmail.com",
            "name": "Humira Sonah",
            "orcidid": "https://orcid.org/0000-0003-4796-6120",
            "typeEntity": "Person"
        },
        {
            "email": "trsharma@nabi.res.in",
            "name": "Tilak Raj Sharma",
            "typeEntity": "Person"
        },
        {
            "email": "rupesh0deshmukh@gmail.com",
            "name": "Rupesh Deshmukh",
            "orcidid": "https://orcid.org/0000-0003-4167-6552",
            "typeEntity": "Person"
        }
    ],
    "description": "Exploration of Technological Advancements and Challenges.\n\nDesign of target-specific guide RNAs in CRISPR-Cas9, genome-editing systems.\n\nThe package includes functions to find potential guide RNAs for input target sequences, optionally filter guide RNAs without restriction enzyme cut site, or without paired guide RNAs, genome-wide search for off-targets, score, rank, fetch flank sequence and indicate whether the target and off-targets are located in exon region or not. Potential guide RNAs are annotated with total score of the top5 and topN off-targets, detailed topN mismatch sites, restriction enzyme cut sites, and paired guide RNAs. This package leverages Biostrings and BSgenome packages.\n\nCRISPR/Cas9 target online predictor.\n\n— Rational design of CRISPR/Cas target.\n\nEnter an accession number (e.g.\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'Cas', 'Genome Editing Plants', 'CRISPR Cas', 'review'",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Editing",
                    "uri": "http://edamontology.org/operation_3096"
                },
                {
                    "term": "Promoter prediction",
                    "uri": "http://edamontology.org/operation_0440"
                },
                {
                    "term": "PCR primer design",
                    "uri": "http://edamontology.org/operation_0308"
                }
            ]
        }
    ],
    "homepage": "http://crispr.dbcls.jp/",
    "language": [
        "R"
    ],
    "lastUpdate": "2020-01-14T09:49:47Z",
    "license": "GPL-2.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://bioconductor.org/packages/release/bioc/html/CRISPRseek.html"
        },
        {
            "type": [
                "Other"
            ],
            "url": "http://multicrispr.net/"
        },
        {
            "type": [
                "Other"
            ],
            "url": "http://cbi.hzau.edu.cn/cgi-bin/CRISPR"
        },
        {
            "type": [
                "Other"
            ],
            "url": "https://crispr.cos.uni-heidelberg.de/"
        }
    ],
    "name": "CRISPR",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.3390/CELLS8111386",
            "metadata": {
                "abstract": "Genome-editing, a recent technological advancement in the field of life sciences, is one of the great examples of techniques used to explore the understanding of the biological phenomenon. Besides having different site-directed nucleases for genome editing over a decade ago, the CRISPR/Cas (clustered regularly interspaced short palindromic repeats/CRISPR-associated protein) based genome editing approach has become a choice of technique due to its simplicity, ease of access, cost, and flexibility. In the present review, several CRISPR/Cas based approaches have been discussed, considering recent advances and challenges to implicate those in the crop improvement programs. Successful examples where CRISPR/Cas approach has been used to improve the biotic and abiotic stress tolerance, and traits related to yield and plant architecture have been discussed. The review highlights the challenges to implement the genome editing in polyploid crop plants like wheat, canola, and sugarcane. Challenges for plants difficult to transform and germline-specific gene expression have been discussed. We have also discussed the notable progress with multi-target editing approaches based on polycistronic tRNA processing, Csy4 endoribonuclease, intron processing, and Drosha ribonuclease. Potential to edit multiple targets simultaneously makes it possible to take up more challenging tasks required to engineer desired crop plants. Similarly, advances like precision gene editing, promoter bashing, and methylome-editing will also be discussed. The present review also provides a catalog of available computational tools and servers facilitating designing of guide-RNA targets, construct designs, and data analysis. The information provided here will be useful for the efficient exploration of technological advances in genome editing field for the crop improvement programs.",
                "authors": [
                    {
                        "name": "Vats S."
                    },
                    {
                        "name": "Kumawat S."
                    },
                    {
                        "name": "Kumar V."
                    },
                    {
                        "name": "Patil G.B."
                    },
                    {
                        "name": "Joshi T."
                    },
                    {
                        "name": "Sonah H."
                    },
                    {
                        "name": "Sharma T.R."
                    },
                    {
                        "name": "Deshmukh R."
                    }
                ],
                "citationCount": 7,
                "date": "2019-11-04T00:00:00Z",
                "journal": "Cells",
                "title": "Genome Editing in Plants: Exploration of Technological Advancements and Challenges"
            },
            "pmcid": "PMC6912757",
            "pmid": "31689989"
        }
    ],
    "topic": [
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "Genetic engineering",
            "uri": "http://edamontology.org/topic_3912"
        },
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        }
    ]
}