{
    "accessibility": "Open access",
    "additionDate": "2022-09-30T14:29:56.889565Z",
    "biotoolsCURIE": "biotools:cogo",
    "biotoolsID": "cogo",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "mchen@zju.edu.cn",
            "name": "Ming Chen",
            "typeEntity": "Person"
        },
        {
            "name": "Yuhao Chen"
        }
    ],
    "description": "A contrastive learning framework to predict disease similarity based on gene network and ontology structure.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Feature extraction",
                    "uri": "http://edamontology.org/operation_3937"
                },
                {
                    "term": "Fold recognition",
                    "uri": "http://edamontology.org/operation_0303"
                },
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                }
            ]
        }
    ],
    "homepage": "https://github.com/yhchen1123/CoGO",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T15:33:09.546987Z",
    "license": "MIT",
    "name": "CoGO",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btac520",
            "metadata": {
                "abstract": "Motivation: Quantifying the similarity of human diseases provides guiding insights to the discovery of micro-scope mechanisms from a macro scale. Previous work demonstrated that better performance can be gained by integrating multiview data sources or applying machine learning techniques. However, designing an efficient framework to extract and incorporate information from different biological data using deep learning models remains unexplored. Results: We present CoGO, a Contrastive learning framework to predict disease similarity based on Gene network and Ontology structure, which incorporates the gene interaction network and gene ontology (GO) domain knowledge using graph deep learning models. First, graph deep learning models are applied to encode the features of genes and GO terms from separate graph structure data. Next, gene and GO features are projected to a common embedding space via a nonlinear projection. Then cross-view contrastive loss is applied to maximize the agreement of corresponding gene-GO associations and lead to meaningful gene representation. Finally, CoGO infers the similarity between diseases by the cosine similarity of disease representation vectors derived from related gene embedding. In our experiments, CoGO outperforms the most competitive baseline method on both AUROC and AUPRC, especially improves 19.57% in AUPRC (0.7733). The prediction results are significantly comparable with other disease similarity studies and thus highly credible. Furthermore, we conduct a detailed case study of top similar disease pairs which is demonstrated by other studies. Empirical results show that CoGO achieves powerful performance in disease similarity problem.",
                "authors": [
                    {
                        "name": "Chen M."
                    },
                    {
                        "name": "Chen Y."
                    },
                    {
                        "name": "Feng C."
                    },
                    {
                        "name": "Hu X."
                    },
                    {
                        "name": "Hu Y."
                    }
                ],
                "citationCount": 9,
                "date": "2022-09-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "CoGO: a contrastive learning framework to predict disease similarity based on gene network and ontology structure"
            },
            "pmid": "35900147"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Ontology and terminology",
            "uri": "http://edamontology.org/topic_0089"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Respiratory medicine",
            "uri": "http://edamontology.org/topic_3322"
        }
    ],
    "validated": 1
}
