{
    "additionDate": "2021-01-18T07:03:36Z",
    "biotoolsCURIE": "biotools:pinn",
    "biotoolsID": "pinn",
    "confidence_flag": "tool",
    "description": "A Python Library for Building Atomic Neural Networks of Molecules and Materials.\n\nPiNN: a Python library for building atomic neural networks.\n\nPiNN is a Python library built on top of TensorFlow for building atomic neural network potentials. The PiNN library also provides elemental layers and abstractions to implement various atomic neural networks.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Hydrogen bond calculation",
                    "uri": "http://edamontology.org/operation_0394"
                },
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Teoroo-CMC/PiNN/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-01-23T16:37:06Z",
    "license": "BSD-3-Clause",
    "name": "PiNN",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1021/ACS.JCIM.9B00994",
            "metadata": {
                "abstract": "Copyright © 2020 American Chemical Society.Atomic neural networks (ANNs) constitute a class of machine learning methods for predicting potential energy surfaces and physicochemical properties of molecules and materials. Despite many successes, developing interpretable ANN architectures and implementing existing ones efficiently are still challenging. This calls for reliable, general-purpose, and open-source codes. Here, we present a python library named PiNN as a solution toward this goal. In PiNN, we designed a new interpretable and high-performing graph convolutional neural network variant, PiNet, as well as implemented the established Behler-Parrinello neural network. These implementations were tested using datasets of isolated small molecules, crystalline materials, liquid water, and an aqueous alkaline electrolyte. PiNN comes with a visualizer called PiNNBoard to extract chemical insight \"learned\"by ANNs. It provides analytical stress tensor calculations and interfaces to both the atomic simulation environment and a development version of the Amsterdam Modeling Suite. Moreover, PiNN is highly modularized, which makes it useful not only as a standalone package but also as a chain of tools to develop and to implement novel ANNs. The code is distributed under a permissive BSD license and is freely accessible at https://github.com/Teoroo-CMC/PiNN/with full documentation and tutorials.",
                "authors": [
                    {
                        "name": "Shao Y."
                    },
                    {
                        "name": "Hellstrom M."
                    },
                    {
                        "name": "Mitev P.D."
                    },
                    {
                        "name": "Knijff L."
                    },
                    {
                        "name": "Zhang C."
                    }
                ],
                "citationCount": 14,
                "date": "2020-03-23T00:00:00Z",
                "journal": "Journal of Chemical Information and Modeling",
                "title": "PiNN: A Python Library for Building Atomic Neural Networks of Molecules and Materials"
            },
            "pmid": "31935100"
        }
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Molecular biology",
            "uri": "http://edamontology.org/topic_3047"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Chemistry",
            "uri": "http://edamontology.org/topic_3314"
        }
    ],
    "validated": 1
}