{
    "additionDate": "2018-05-06T11:04:44Z",
    "biotoolsCURIE": "biotools:cellxpress",
    "biotoolsID": "cellxpress",
    "credit": [
        {
            "email": "loolh@bii.a-star.edu.sg",
            "name": "Lit-Hsin Loo",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "A fast and user-friendly platform for profiling cellular phenotypes.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://www.cellxpress.org/manual/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene expression profiling",
                    "uri": "http://edamontology.org/operation_0314"
                }
            ]
        }
    ],
    "homepage": "http://www.cellxpress.org/",
    "lastUpdate": "2018-12-10T12:58:57Z",
    "name": "cellXpress",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1186/1471-2105-14-S16-S4",
            "metadata": {
                "abstract": "Background: High-throughput, image-based screens of cellular responses to genetic or chemical perturbations generate huge numbers of cell images. Automated analysis is required to quantify and compare the effects of these perturbations. However, few of the current freely-available bioimage analysis software tools are optimized for efficient handling of these images. Even fewer of them are designed to transform the phenotypic features measured from these images into discriminative profiles that can reveal biologically meaningful associations among the tested perturbations.Results: We present a fast and user-friendly software platform called \"cellXpress\" to segment cells, measure quantitative features of cellular phenotypes, construct discriminative profiles, and visualize the resulting cell masks and feature values. We have also developed a suite of library functions to load the extracted features for further customizable analysis and visualization under the R computing environment. We systematically compared the processing speed, cell segmentation accuracy, and phenotypic-profile clustering performance of cellXpress to other existing bioimage analysis software packages or algorithms. We found that cellXpress outperforms these existing tools on three different bioimage datasets. We estimate that cellXpress could finish processing a genome-wide gene knockdown image dataset in less than a day on a modern personal desktop computer.Conclusions: The cellXpress platform is designed to make fast and efficient high-throughput phenotypic profiling more accessible to the wider biological research community. The cellXpress installation packages for 64-bit Windows and Linux, user manual, installation guide, and datasets used in this analysis can be downloaded freely from http://www.cellXpress.org. © 2013 Laksameethanasan et al.; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Laksameethanasan D."
                    },
                    {
                        "name": "Tan R.Z."
                    },
                    {
                        "name": "Toh G.W.-L."
                    },
                    {
                        "name": "Loo L.-H."
                    }
                ],
                "citationCount": 16,
                "date": "2013-10-22T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "CellXpress: A fast and user-friendly software platform for profiling cellular phenotypes"
            },
            "pmcid": "PMC3853218",
            "pmid": "24564609"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        }
    ],
    "validated": 1
}