
{
    "credit": [
        {
            "email": "ibirol@bcgsc.ca",
            "name": "Inanc Birol",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "https://github.com/bcgsc/kollector"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "De-novo assembly",
                    "uri": "http://edamontology.org/operation_0524"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Shell"
        ],
        "operatingSystem": [
            "Linux",
            "Mac"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Transcription factors and regulatory sites",
                "uri": "http://edamontology.org/topic_0749"
            },
            {
                "term": "Molecular genetics",
                "uri": "http://edamontology.org/topic_3321"
            },
            {
                "term": "Sequence assembly",
                "uri": "http://edamontology.org/topic_0196"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© The Author 2017. Published by Oxford University Press. Motivation: Despite considerable advancements in sequencing and computing technologies, de novo assembly of whole eukaryotic genomes is still a time-consuming task that requires a significant amount of computational resources and expertise. A targeted assembly approach to perform local assembly of sequences of interest remains a valuable option for some applications. This is especially true for gene-centric assemblies, whose resulting sequence can be readily utilized for more focused biological research. Here we describe Kollector, an alignment-free targeted assembly pipeline that uses thousands of transcript sequences concurrently to inform the localized assembly of corresponding gene loci. Kollector robustly reconstructs introns and novel sequences within these loci, and scales well to large genomes - properties that makes it especially useful for researchers working on non-model eukaryotic organisms. Results: We demonstrate the performance of Kollector for assembling complete or near-complete Caenorhabditis elegans and Homo sapiens gene loci from their respective, input transcripts. In a time- and memory-efficient manner, the Kollector pipeline successfully reconstructs respectively 99% and 80% (compared to 86% and 73% with standard de novo assembly techniques) of C.elegans and H.sapiens transcript targets in their corresponding genomic space using whole genome shotgun sequencing reads. We also show that Kollector outperforms both established and recently released targeted assembly tools. Finally, we demonstrate three use cases for Kollector, including comparative and cancer genomics applications. Availability and Implementation: Kollector is implemented as a bash script, and is available at https://github.com/bcgsc/kollector.",
            "authors": [
                "Kucuk E.",
                "Chu J.",
                "Vandervalk B.P.",
                "Hammond S.A.",
                "Warren R.L.",
                "Birol I."
            ],
            "cit_count": 0,
            "doi": "10.1093/bioinformatics/btx078",
            "journal": "Bioinformatics",
            "title": "Kollector: Transcript-informed, targeted de novo assembly of gene loci",
            "year": "2017-06-15"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:kollector",
        "biotoolsID": "kollector",
        "description": "Transcript-informed, targeted de novo assembly of gene loci.",
        "homepage": "https://github.com/bcgsc/kollector",
        "name": "Kollector"
    }
}