{
    "additionDate": "2021-01-18T12:01:39Z",
    "biotoolsCURIE": "biotools:lc-n2g",
    "biotoolsID": "lc-n2g",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "jean.yang@sydney.edu.au",
            "name": "Jean Y. H. Yang",
            "orcidid": "https://orcid.org/0000-0002-5271-2603",
            "typeEntity": "Person"
        }
    ],
    "description": "A local consistency approach for nutrigenomics data analysis.\n\nNutrigenomics aims at understanding the interaction between nutrition and gene information. Due to the complex interactions of nutrients and genes, their relationship exhibits non-linearity. One of the most effective and efficient methods to explore their relationship is the nutritional geometry framework which fits a response surface for the gene expression over two prespecified nutrition variables. However, when the number of nutrients involved is large, it is challenging to find combinations of informative nutrients with respect to a certain gene and to test whether the relationship is stronger than chance. Methods for identifying informative combinations are essential to understanding the relationship between nutrients and genes.<h4>Results< h4>We introduce Local Consistency Nutrition to Graphics (LC-N2G), a novel approach for ranking and identifying combinations of nutrients with gene expression",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Expression correlation analysis",
                    "uri": "http://edamontology.org/operation_3463"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                },
                {
                    "term": "Weighted correlation network analysis",
                    "uri": "http://edamontology.org/operation_3766"
                }
            ]
        }
    ],
    "homepage": "http://shiny.maths.usyd.edu.au/LC-N2G/",
    "lastUpdate": "2021-02-12T11:19:21Z",
    "name": "LC-N2G",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1186/S12859-020-03861-3",
            "metadata": {
                "abstract": "© 2020, The Author(s).Background: Nutrigenomics aims at understanding the interaction between nutrition and gene information. Due to the complex interactions of nutrients and genes, their relationship exhibits non-linearity. One of the most effective and efficient methods to explore their relationship is the nutritional geometry framework which fits a response surface for the gene expression over two prespecified nutrition variables. However, when the number of nutrients involved is large, it is challenging to find combinations of informative nutrients with respect to a certain gene and to test whether the relationship is stronger than chance. Methods for identifying informative combinations are essential to understanding the relationship between nutrients and genes. Results: We introduce Local Consistency Nutrition to Graphics (LC-N2G), a novel approach for ranking and identifying combinations of nutrients with gene expression. In LC-N2G, we first propose a model-free quantity called Local Consistency statistic to measure whether there is non-random relationship between combinations of nutrients and gene expression measurements based on (1) the similarity between samples in the nutrient space and (2) their difference in gene expression. Then combinations with small LC are selected and a permutation test is performed to evaluate their significance. Finally, the response surfaces are generated for the subset of significant relationships. Evaluation on simulated data and real data shows the LC-N2G can accurately find combinations that are correlated with gene expression. Conclusion: The LC-N2G is practically powerful for identifying the informative nutrition variables correlated with gene expression. Therefore, LC-N2G is important in the area of nutrigenomics for understanding the relationship between nutrition and gene expression information.",
                "authors": [
                    {
                        "name": "Fontana L."
                    },
                    {
                        "name": "Mueller S."
                    },
                    {
                        "name": "Raubenheimer D."
                    },
                    {
                        "name": "Senior A."
                    },
                    {
                        "name": "Simpson S.J."
                    },
                    {
                        "name": "Solon-Biet S.M."
                    },
                    {
                        "name": "Xu X."
                    },
                    {
                        "name": "Yang J.Y.H."
                    }
                ],
                "date": "2020-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "LC-N2G: a local consistency approach for nutrigenomics data analysis"
            },
            "pmcid": "PMC7672905",
            "pmid": "33203358"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        },
        {
            "term": "Nutritional science",
            "uri": "http://edamontology.org/topic_3390"
        },
        {
            "term": "Zoology",
            "uri": "http://edamontology.org/topic_3500"
        }
    ]
}
