{
    "accessibility": "Open access",
    "additionDate": "2022-06-10T23:16:15.899746Z",
    "biotoolsCURIE": "biotools:sars-cov-2_spike_rbd_ace2",
    "biotoolsID": "sars-cov-2_spike_rbd_ace2",
    "collectionID": [
        "COVID-19"
    ],
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "ciro.pierri@uniba.it",
            "name": "Ciro Leonardo Pierri",
            "orcidid": "https://orcid.org/0000-0003-1816-548X",
            "typeEntity": "Person"
        },
        {
            "name": "Anna De Grassi"
        },
        {
            "name": "Mariateresa Volpicella"
        }
    ],
    "description": "Modeling SARS-CoV-2 spike/ACE2 protein-protein interactions for predicting the binding affinity of new spike variants for ACE2, and novel ACE2 structurally related human protein targets, for COVID-19 handling in the 3PM context.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Fold recognition",
                    "uri": "http://edamontology.org/operation_0303"
                },
                {
                    "term": "Protein interaction prediction",
                    "uri": "http://edamontology.org/operation_2492"
                },
                {
                    "term": "Variant effect prediction",
                    "uri": "http://edamontology.org/operation_0331"
                },
                {
                    "term": "Virulence prediction",
                    "uri": "http://edamontology.org/operation_3461"
                }
            ]
        }
    ],
    "homepage": "https://www.mitoairm.it/covid19affinities",
    "lastUpdate": "2022-06-10T23:18:31.983528Z",
    "name": "SARS-CoV-2 spike RBD ACE2",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1007/S13167-021-00267-W",
            "metadata": {
                "abstract": "© 2022, The Author(s), under exclusive licence to European Association for Predictive, Preventive and Personalised Medicine (EPMA).Aims: The rapid spread of new SARS-CoV-2 variants has highlighted the crucial role played in the infection by mutations occurring at the SARS-CoV-2 spike receptor binding domain (RBD) in the interactions with the human ACE2 receptor. In this context, it urgently needs to develop new rapid tools for quickly predicting the affinity of ACE2 for the SARS-CoV-2 spike RBD protein variants to be used with the ongoing SARS-CoV-2 genomic sequencing activities in the clinics, aiming to gain clues about the transmissibility and virulence of new variants, to prevent new outbreaks and to quickly estimate the severity of the disease in the context of the 3PM. Methods: In our study, we used a computational pipeline for calculating the interaction energies at the SARS-CoV-2 spike RBD/ACE2 protein–protein interface for a selected group of characterized infectious variants of concern/interest (VoC/VoI). By using our pipeline, we built 3D comparative models of the SARS-CoV-2 spike RBD/ACE2 protein complexes for the VoC B.1.1.7-United Kingdom (carrying the mutations of concern/interest N501Y, S494P, E484K at the RBD), P.1-Japan/Brazil (RBD mutations: K417T, E484K, N501Y), B.1.351-South Africa (RBD mutations: K417N, E484K, N501Y), B.1.427/B.1.429-California (RBD mutations: L452R), the B.1.141 (RBD mutations: N439K), and the recent B.1.617.1-India (RBD mutations: L452R; E484Q) and the B.1.620 (RBD mutations: S477N; E484K). Then, we used the obtained 3D comparative models of the SARS-CoV-2 spike RBD/ACE2 protein complexes for predicting the interaction energies at the protein–protein interface. Results: Along SARS-CoV-2 mutation database screening and mutation localization analysis, it was ascertained that the most dangerous mutations at VoC/VoI spike proteins are located mainly at three regions of the SARS-CoV-2 spike “boat-shaped” receptor binding motif, on the RBD domain. Notably, the P.1 Japan/Brazil variant present three mutations, K417T, E484K, N501Y, located along the entire receptor binding motif, which apparently determines the highest interaction energy at the SARS-CoV-2 spike RBD/ACE2 protein–protein interface, among those calculated. Conversely, it was also observed that the replacement of a single acidic/hydrophilic residue with a basic residue (E484K or N439K) at the “stern” or “bow” regions, of the boat-shaped receptor binding motif on the RBD, appears to determine an interaction energy with ACE2 receptor higher than that observed with single mutations occurring at the “hull” region or with other multiple mutants. In addition, our pipeline allowed searching for ACE2 structurally related proteins, i.e., THOP1 and NLN, which deserve to be investigated for their possible involvement in interactions with the SARS-CoV-2 spike protein, in those tissues showing a low expression of ACE2, or as a novel receptor for future spike variants. A freely available web-tool for the in silico calculation of the interaction energy at the SARS-CoV-2 spike RBD/ACE2 protein–protein interface, starting from the sequences of the investigated spike and/or ACE2 variants, was made available for the scientific community at: https://www.mitoairm.it/covid19affinities. Conclusion: In the context of the PPPM/3PM, the employment of the described pipeline through the provided webservice, together with the ongoing SARS-CoV-2 genomic sequencing, would help to predict the transmissibility of new variants sequenced from future patients, depending on SARS-CoV-2 genomic sequencing activities and on the specific amino acid replacement and/or on its location on the SARS-CoV-2 spike RBD, to put in play all the possible counteractions for preventing the most deleterious scenarios of new outbreaks, taking into consideration that a greater transmissibility has not to be necessarily related to a more severe manifestation of the disease.",
                "authors": [
                    {
                        "name": "De Grassi A."
                    },
                    {
                        "name": "Laera L."
                    },
                    {
                        "name": "Mercurio I."
                    },
                    {
                        "name": "Onofrio A."
                    },
                    {
                        "name": "Pierri C.L."
                    },
                    {
                        "name": "Preziusi F."
                    },
                    {
                        "name": "Todisco S."
                    },
                    {
                        "name": "Tragni V."
                    },
                    {
                        "name": "Volpicella M."
                    }
                ],
                "citationCount": 3,
                "date": "2022-03-01T00:00:00Z",
                "journal": "EPMA Journal",
                "title": "Modeling SARS-CoV-2 spike/ACE2 protein–protein interactions for predicting the binding affinity of new spike variants for ACE2, and novel ACE2 structurally related human protein targets, for COVID-19 handling in the 3PM context"
            },
            "pmcid": "PMC8732965",
            "pmid": "35013687"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Personalised medicine",
            "uri": "http://edamontology.org/topic_3577"
        },
        {
            "term": "Protein folds and structural domains",
            "uri": "http://edamontology.org/topic_0736"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
