{
    "additionDate": "2019-11-14T19:31:06Z",
    "biotoolsCURIE": "biotools:spectrum-clustering",
    "biotoolsID": "spectrum-clustering",
    "confidence_flag": "tool",
    "description": "Fast density-aware spectral clustering for single and multi-omic data | Fast Adaptive Spectral Clustering for Single and Multi-View Data | A self-tuning spectral clustering method for single or multi-view data. 'Spectrum' uses a new type of adaptive density aware kernel that strengthens connections in the graph based on common nearest neighbours. It uses a tensor product graph data integration and diffusion procedure to integrate different data sources and reduce noise. 'Spectrum' uses either the eigengap or multimodality gap heuristics to determine the number of clusters. The method is sufficiently flexible so that a wide range of Gaussian and non-Gaussian structures can be clustered with automatic selection of K",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Spectrum calculation",
                    "uri": "http://edamontology.org/operation_3860"
                },
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "Mass spectrum visualisation",
                    "uri": "http://edamontology.org/operation_3694"
                }
            ]
        }
    ],
    "homepage": "https://cran.r-project.org/web/packages/Spectrum/index.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2020-12-24T08:56:27Z",
    "license": "AGPL-3.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/crj32/spectrum_manuscript"
        }
    ],
    "name": "Spectrum",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ704",
            "metadata": {
                "abstract": "© 2020 Oxford University Press. All rights reserved.Motivation: Clustering patient omic data is integral to developing precision medicine because it allows the identification of disease subtypes. A current major challenge is the integration multi-omic data to identify a shared structure and reduce noise. Cluster analysis is also increasingly applied on single-omic data, for example, in single cell RNA-seq analysis for clustering the transcriptomes of individual cells. This technology has clinical implications. Our motivation was therefore to develop a flexible and effective spectral clustering tool for both single and multi-omic data. Results: We present Spectrum, a new spectral clustering method for complex omic data. Spectrum uses a self-tuning density-aware kernel we developed that enhances the similarity between points that share common nearest neighbours. It uses a tensor product graph data integration and diffusion procedure to reduce noise and reveal underlying structures. Spectrum contains a new method for finding the optimal number of clusters (K) involving eigenvector distribution analysis. Spectrum can automatically find K for both Gaussian and non-Gaussian structures. We demonstrate across 21 real expression datasets that Spectrum gives improved runtimes and better clustering results relative to other methods.",
                "authors": [
                    {
                        "name": "John C.R."
                    },
                    {
                        "name": "Watson D."
                    },
                    {
                        "name": "Barnes M.R."
                    },
                    {
                        "name": "Pitzalis C."
                    },
                    {
                        "name": "Lewis M.J."
                    }
                ],
                "citationCount": 8,
                "date": "2020-02-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Spectrum: Fast density-aware spectral clustering for single and multi-omic data"
            },
            "pmid": "31501851"
        }
    ],
    "topic": [
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Personalised medicine",
            "uri": "http://edamontology.org/topic_3577"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        }
    ],
    "validated": 1
}