{
    "additionDate": "2017-01-17T15:02:30Z",
    "biotoolsCURIE": "biotools:pathnet",
    "biotoolsID": "pathnet",
    "collectionID": [
        "BioConductor"
    ],
    "credit": [
        {
            "email": "jsmith@bhsai.org",
            "name": "Jason B. Smith",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "This tool uses topological information present in pathways and differential expression levels of genes (obtained from microarray experiment) to identify pathways that are 1) significantly enriched and 2) associated with each other in the context of differential expression.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://bioconductor.org/packages/release/bioc/html/PathNet.html"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://bioconductor/packages/release/bioc/src/contrib/PathNet_1.14.0.tar.gz"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Differential gene expression analysis",
                    "uri": "http://edamontology.org/operation_3223"
                }
            ]
        }
    ],
    "homepage": "http://bioconductor.org/packages/release/bioc/html/PathNet.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2019-01-09T15:54:01Z",
    "license": "GPL-3.0",
    "name": "PathNet",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "bioconductor_import",
    "publication": [
        {
            "doi": "10.1186/1751-0473-7-10",
            "metadata": {
                "abstract": "Background: Identification of canonical pathways through enrichment of differentially expressed genes in a given pathway is a widely used method for interpreting gene lists generated from high-throughput experimental studies. However, most algorithms treat pathways as sets of genes, disregarding any inter- and intra-pathway connectivity information, and do not provide insights beyond identifying lists of pathways.Results: We developed an algorithm (PathNet) that utilizes the connectivity information in canonical pathway descriptions to help identify study-relevant pathways and characterize non-obvious dependencies and connections among pathways using gene expression data. PathNet considers both the differential expression of genes and their pathway neighbors to strengthen the evidence that a pathway is implicated in the biological conditions characterizing the experiment. As an adjunct to this analysis, PathNet uses the connectivity of the differentially expressed genes among all pathways to score pathway contextual associations and statistically identify biological relations among pathways. In this study, we used PathNet to identify biologically relevant results in two Alzheimer's disease microarray datasets, and compared its performance with existing methods. Importantly, PathNet identified de-regulation of the ubiquitin-mediated proteolysis pathway as an important component in Alzheimer's disease progression, despite the absence of this pathway in the standard enrichment analyses.Conclusions: PathNet is a novel method for identifying enrichment and association between canonical pathways in the context of gene expression data. It takes into account topological information present in pathways to reveal biological information. PathNet is available as an R workspace image from http://www.bhsai.org/downloads/pathnet/. © 2012 Dutta et al.; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Dutta B."
                    },
                    {
                        "name": "Wallqvist A."
                    },
                    {
                        "name": "Reifman J."
                    }
                ],
                "citationCount": 33,
                "date": "2012-09-24T00:00:00Z",
                "journal": "Source Code for Biology and Medicine",
                "title": "PathNet: A tool for pathway analysis using topological information"
            },
            "pmcid": "PMC3563509",
            "pmid": "23006764",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool",
        "Library"
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ],
    "validated": 1,
    "version": [
        "1.14.0"
    ]
}