{
    "additionDate": "2022-09-05T13:33:09.883340Z",
    "biotoolsCURIE": "biotools:cancercelltracker",
    "biotoolsID": "cancercelltracker",
    "confidence_flag": "tool",
    "credit": [
        {
            "name": "Qibing Jiang"
        },
        {
            "name": "Wei Zhang",
            "orcidid": "https://orcid.org/0000-0003-3605-9373"
        }
    ],
    "description": "A framework, CancerCellTracker to process the time-lapse microscopy images and track the behavior of thousands of MM cells simultaneously for drug response prediction of patients",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                }
            ]
        }
    ],
    "homepage": "https://github.com/compbiolabucf/CancerCellTracker",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T15:42:20.740391Z",
    "license": "Not licensed",
    "name": "CancerCellTracker",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btac417",
            "metadata": {
                "abstract": "Motivation: Time-lapse microscopy is a powerful technique that relies on images of live cells cultured ex vivo that are captured at regular intervals of time to describe and quantify their behavior under certain experimental conditions. This imaging method has great potential in advancing the field of precision oncology by quantifying the response of cancer cells to various therapies and identifying the most efficacious treatment for a given patient. Digital image processing algorithms developed so far require high-resolution images involving very few cells originating from homogeneous cell line populations. We propose a novel framework that tracks cancer cells to capture their behavior and quantify cell viability to inform clinical decisions in a high-throughput manner. Results: The brightfield microscopy images a large number of patient-derived cells in an ex vivo reconstruction of the tumor microenvironment treated with 31 drugs for up to 6 days. We developed a robust and user-friendly pipeline CancerCellTracker that detects cells in co-culture, tracks these cells across time and identifies cell death events using changes in cell attributes. We validated our computational pipeline by comparing the timing of cell death estimates by CancerCellTracker from brightfield images and a fluorescent channel featuring ethidium homodimer. We benchmarked our results using a state-of-the-art algorithm implemented in ImageJ and previously published in the literature. We highlighted CancerCellTracker's efficiency in estimating the percentage of live cells in the presence of bone marrow stromal cells.",
                "authors": [
                    {
                        "name": "Ahmed K.T."
                    },
                    {
                        "name": "Alugubelli R.R."
                    },
                    {
                        "name": "Baz R."
                    },
                    {
                        "name": "Canevarolo R.R."
                    },
                    {
                        "name": "Deavila G."
                    },
                    {
                        "name": "Gatenby R.A."
                    },
                    {
                        "name": "Gillies R.J."
                    },
                    {
                        "name": "Jiang Q."
                    },
                    {
                        "name": "Meads M.B."
                    },
                    {
                        "name": "Perez L."
                    },
                    {
                        "name": "Shain K.H."
                    },
                    {
                        "name": "Silva A.S."
                    },
                    {
                        "name": "Silva M.C."
                    },
                    {
                        "name": "Sudalagunta P."
                    },
                    {
                        "name": "Tungesvik A."
                    },
                    {
                        "name": "Zhang W."
                    },
                    {
                        "name": "Zhao X."
                    }
                ],
                "citationCount": 1,
                "date": "2022-08-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "CancerCellTracker: A brightfield time-lapse microscopy framework for cancer drug sensitivity estimation"
            },
            "pmcid": "PMC9991899",
            "pmid": "35751591"
        }
    ],
    "toolType": [
        "Workbench",
        "Workflow"
    ],
    "topic": [
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        }
    ],
    "validated": 1
}
