
{
    "credit": [
    ],
    "labels": {
        "topic": [
            {
                "term": "Surgery",
                "uri": "http://edamontology.org/topic_3421"
            }
        ]
    },
    "publication": [
        {
            "abstract": "BACKGROUND: As of December 31, 2016, in the United States, 22 866 patients received left ventricular assist devices (LVADs) (J Heart Lung Transplant. 2017;36(10):1080-1086). First responders are generally unfamiliar with LVAD equipment functionality (J Heart Lung Transplant. 2018;37(4):S275). When a patient has an emergency either clinically or with a controller alarm or failure, speaking with ventricle assist device (VAD)-trained personnel is imperative to the prevention of adverse events. Starting February 2017, an LVAD program totaling 181 patients at a large teaching hospital changed their afterhours process to reduce wait time between patient call and talking to VAD-trained personnel to increase patient safety and patient satisfaction. METHODS: The Plan-Do-Check-Act quality improvement method was used to evaluate this project from February 2017 to July 2018 by the program's clinical information analyst. An afterhours summary of telephone interactions between VAD program clinicians (VAD coordinators, physician assistants, and nurse practitioner) was used to analyze the use of the \"VAD Emergency Line.\" An annual patient satisfaction survey was completed to analyze patient satisfaction of the VAD Emergency Line. INTERVENTIONS: Review of the afterhours summary was conducted to determine the use of the VAD Emergency Line. The process of afterhours patient calls was changed so that calls are answered immediately by a 24-hour LVAD-trained medical ambulance service, called VAD Emergency Line. Patient use of the VAD Emergency Line was continuously assessed. In November 2017, it was recognized that only 57% of patient calls used the VAD Emergency Line, and further intervention was needed. In November 2017, patients were provided visual reminders to ensure compliance. RESULTS: Seventeen months after the implementation of the VAD Emergency Line, 92% of patient's afterhours calls were through the VAD Emergency Line. Although there was no statistical significance found, there was clinical significance. Since the implementation of the VAD Emergency Line, patient use of the VAD Emergency Line increased 56% from March 2017 to July 2018. There have been zero adverse safety events. Sixty-one percent of patients strongly agreed to the question \"You are able to communicate emergent needs after hours (VAD Emergency Line)? CONCLUSION: Implementation of the LVAD Emergency Line has improved communication between patients in the outpatient setting. This increased patient safety by allowing patients to speak to LVAD-trained first responders and VAD coordinator personnel immediately without ever being put on hold. This communication process can be applied to other clinical programs.",
            "authors": [
                "Griffith A.",
                "Haverstick S.",
                "Blissick D.",
                "Colaianne T.",
                "Shields H.",
                "Johnson C.",
                "Lucier R.",
                "Melong M.J.",
                "Kasten K.",
                "Knott K."
            ],
            "cit_count": 0,
            "doi": "10.1097/DCC.0000000000000397",
            "journal": "Dimensions of critical care nursing : DCCN",
            "pmid": "31789980",
            "title": "Bridging the Communication Gap: A Quality Improvement Project of a Ventricular Assist Device Program",
            "year": "2020-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:VAD_Emergency",
        "biotoolsID": "VAD_Emergency",
        "description": "A Quality Improvement Project of a Ventricular Assist Device Program.\n\nBACKGROUND:As of December 31, 2016, in the United States, 22 866 patients received left ventricular assist devices (LVADs) (J Heart Lung Transplant. 2017;36(10):1080-1086). First responders are generally unfamiliar with LVAD equipment functionality (J Heart Lung Transplant. 2018;37(4):S275). When a patient has an emergency either clinically or with a controller alarm or failure, speaking with ventricle assist device (VAD)-trained personnel is imperative to the prevention of adverse events. Starting February 2017, an LVAD program totaling 181 patients at a large teaching hospital changed their afterhours process to reduce wait time between patient call and talking to VAD-trained personnel to increase patient safety and patient satisfaction.\n\n||| HOMEPAGE MISSING!.\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'VAD'",
        "homepage": "https://www.ncbi.nlm.nih.gov/pubmed/?term=31789980",
        "name": "VAD Emergency"
    }
}