{
    "accessibility": "Open access",
    "additionDate": "2019-02-20T13:41:21Z",
    "biotoolsCURIE": "biotools:GLOSSary",
    "biotoolsID": "GLOSSary",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "bioinforma@szn.it",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "16S subunit related sequences database, identified from metagenomic efforts as part of the Tara Oceans project. It includes a BLAST search tool. The analysis system incorporates the SILVA collection, allowing comparative analyses to identify unclassified sequences and their geographical distribution.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://bioinfo.szn.it/wp-content/uploads/2018/02/GLOSSary_USER_GUIDE.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "homepage": "http://bioinfo.szn.it/glossary/",
    "lastUpdate": "2020-06-16T10:55:24Z",
    "license": "Unlicense",
    "maturity": "Mature",
    "name": "GLOSSary",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "ELIXIR-ITA-STZOO",
    "publication": [
        {
            "doi": "10.1186/s12859-018-2423-8",
            "metadata": {
                "abstract": "© 2018 The Author(s). Background: Environmental metagenomics is a challenging approach that is exponentially spreading in the scientific community to investigate taxonomic diversity and possible functions of the biological components. The massive amount of sequence data produced, often endowed with rich environmental metadata, needs suitable computational tools to fully explore the embedded information. Bioinformatics plays a key role in providing methodologies to manage, process and mine molecular data, integrated with environmental metagenomics collections. One such relevant example is represented by the Tara Ocean Project. Results: We considered the Tara 16S miTAGs released by the consortium, representing raw sequences from a shotgun metagenomics approach with similarities to 16S rRNA genes. We generated assembled 16S rDNA sequences, which were classified according to their lengths, the possible presence of chimeric reads, the putative taxonomic affiliation. The dataset was included in GLOSSary (the GLobal Ocean 16S Subunit web accessible resource), a bioinformatics platform to organize environmental metagenomics data. The aims of this work were: i) to present alternative computational approaches to manage challenging metagenomics data; ii) to set up user friendly web-based platforms to allow the integration of environmental metagenomics sequences and of the associated metadata; iii) to implement an appropriate bioinformatics platform supporting the analysis of 16S rDNA sequences exploiting reference datasets, such as the SILVA database. We organized the data in a next-generation NoSQL \"schema-less\" database, allowing flexible organization of large amounts of data and supporting native geospatial queries. A web interface was developed to permit an interactive exploration and a visual geographical localization of the data, either raw miTAG reads or 16S contigs, from our processing pipeline. Information on unassembled sequences is also available. The taxonomic affiliations of contigs and miTAGs, and the spatial distribution of the sampling sites and their associated sequence libraries, as they are contained in the Tara metadata, can be explored by a query interface, which allows both textual and visual investigations. In addition, all the sequence data were made available for a dedicated BLAST-based web application alongside the SILVA collection. Conclusions: GLOSSary provides an expandable bioinformatics environment, able to support the scientific community in current and forthcoming environmental metagenomics analyses.",
                "authors": [
                    {
                        "name": "Tangherlini M."
                    },
                    {
                        "name": "Miralto M."
                    },
                    {
                        "name": "Colantuono C."
                    },
                    {
                        "name": "Sangiovanni M."
                    },
                    {
                        "name": "Dell' Anno A."
                    },
                    {
                        "name": "Corinaldesi C."
                    },
                    {
                        "name": "Danovaro R."
                    },
                    {
                        "name": "Chiusano M.L."
                    }
                ],
                "date": "2018-11-30T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "GLOSSary: The GLobal Ocean 16S subunit web accessible resource"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application",
        "Database portal"
    ],
    "topic": [
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        },
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        }
    ]
}