{
    "additionDate": "2021-01-18T12:36:06Z",
    "biotoolsCURIE": "biotools:isnpranker",
    "biotoolsID": "isnpranker",
    "confidence_flag": "tool",
    "description": "Refinement of coding SNPs in the human aryl hydrocarbon receptor gene using ISNPranker.",
    "editPermission": {
        "type": "private"
    },
    "homepage": "http://isnpranker.semilab.ir/",
    "lastUpdate": "2021-02-11T10:25:13Z",
    "name": "ISNPranker",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1016/J.COMPBIOLCHEM.2020.107416",
            "metadata": {
                "abstract": "© 2020 Elsevier LtdDifferent bioinformatic methods apply various approaches to predict how much the effect of a SNP could be deleterious and therefore their results may differ significantly. However, variation studies often need to consider an integrated prediction result to analyze the effect of SNPs. To address this problem, we used an algorithm to map ordinal predictions to a numeral space and averaging them, and based on it we developed the ISNPranker web-tool (http://isnpranker.semilab.ir/). It takes heterogonous outputs of different predictors and generates integrated numerical predictions and ranks SNPs based on them. Afterward, we used ISNPranker to identify the most deleterious coding SNPs (cSNPs) of the human aryl hydrocarbon receptor (AHR) gene. AHR is a ligand-activated transcription factor that governs many molecular and cellular mechanisms and cSNPs may affect its structure, interactions, and function. Forty validated cSNPs of AHR were initially analyzed using 16 publicly available SNP analyzers and the results were introduced to the ISNPranker and integrated predictions were obtained. The cSNPs were ranked in 34 levels of danger and rs200257782 in the ARNT dimerization domain (ADD121-289) of AHR was identified as the most deleterious cSNP. The rs148360742, which affect ADD40-79 and Hsp90 binding domain (HBD27-79) was in the second rank and the third and fourth ranks were occupied by ADD121-289-located variations rs571123681 and rs141667112 respectively. In conclusion, we introduced ISNPranker, which is a web-tool for integrative ranking of SNPs, and we showed that AHR structure and function may be highly sensitive to the cSNPs in the ARNT dimerization domain.",
                "authors": [
                    {
                        "name": "Aftabi Y."
                    },
                    {
                        "name": "Rafei S."
                    },
                    {
                        "name": "Zarredar H."
                    },
                    {
                        "name": "Amiri-Sadeghan A."
                    },
                    {
                        "name": "Akbari-Shahpar M."
                    },
                    {
                        "name": "Khoshkam Z."
                    },
                    {
                        "name": "Seyedrezazadeh E."
                    },
                    {
                        "name": "Khalili M."
                    },
                    {
                        "name": "Mehrnejad F."
                    },
                    {
                        "name": "Fereidouni S."
                    },
                    {
                        "name": "Lawrence B.P."
                    }
                ],
                "date": "2021-02-01T00:00:00Z",
                "journal": "Computational Biology and Chemistry",
                "title": "Refinement of coding SNPs in the human aryl hydrocarbon receptor gene using ISNPranker: An integrative-SNP ranking web-tool"
            },
            "pmid": "33264727"
        }
    ],
    "toolType": [
        "Web service"
    ],
    "topic": [
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Bioinformatics",
            "uri": "http://edamontology.org/topic_0091"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        }
    ]
}