{
    "additionDate": "2017-02-10T11:35:20Z",
    "biotoolsCURIE": "biotools:trod",
    "biotoolsID": "trod",
    "credit": [
        {
            "email": "dudek@cellbio.unige.ch",
            "name": "Support",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "T7 RNAi Oligo Designer (TROD) aids in the design of DNA oligonucleotides for short interfering RNA (siRNA) synthesis with T7 RNA polymerase.  It takes an input of a cDNA sequence and outputs a list of DNA oligos for ordering.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://www.unige.ch/sciences/biologie/bicel/websoft/help.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "DNA vaccine design",
                    "uri": "http://edamontology.org/operation_0560"
                },
                {
                    "term": "Read mapping",
                    "uri": "http://edamontology.org/operation_3198"
                }
            ]
        }
    ],
    "homepage": "http://www.cellbio.unige.ch/RNAi.html",
    "homepage_status": 1,
    "language": [
        "Perl"
    ],
    "lastUpdate": "2018-12-10T12:58:54Z",
    "name": "TROD",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "Methods that allow the specific silencing of a desired gene are invaluable tools for research. One of these is based on RNA interference (RNAi), a process by which double-stranded RNA (dsRNA) specifically suppresses the expression of a target mRNA. Recently, it has been reported that RNAi also works in mammalian cells if small interfering RNAs (siRNAs) are used to avoid activation of the interferon system by long dsRNA. Thus, RNAi could become a major tool for reverse genetics in mammalian systems. However, the high cost and the limited availability of the short synthetic RNAs and the lack of certainty that a designed siRNA will work present major drawbacks of the siRNA technology. Here we present an alternative method to obtain cheap and large amounts of siRNAs using T7 RNA polymerase. With multiple transfection procedures, including calcium phosphate co-precipitation, we demonstrate silencing of both exogenous and endogenous genes.",
                "authors": [
                    {
                        "name": "Donze O."
                    },
                    {
                        "name": "Picard D."
                    }
                ],
                "citationCount": 234,
                "date": "2002-01-01T00:00:00Z",
                "journal": "Nucleic acids research",
                "title": "RNA interference in mammalian cells using siRNAs synthesized with T7 RNA polymerase."
            },
            "pmid": "12000851"
        },
        {
            "metadata": {
                "abstract": "We have developed T7 RNAi Oligo Designer (TROD), a web application for RNA interference studies. TROD greatly facilitates the design of oligodeoxynucleotide sequences for the in vitro production of siRNA duplexes with T7 RNA polymerase. Given a query cDNA sequence, the program scans for appropriate target sequences based on the constraints of the T7 RNA polymerase method and published criteria for RNA interference with siRNAs. The output is an ordered and prioritized list of ready-to-order DNA oligonucleotide sequences, with links to perform a BLAST search to ascertain target sequence specificity. The TROD web service is available at http://www.cellbio.unige.ch/RNAi.html. © Oxford University Press 2004; all rights reserved.",
                "authors": [
                    {
                        "name": "Dudek P."
                    },
                    {
                        "name": "Picard D."
                    }
                ],
                "citationCount": 19,
                "date": "2004-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "TROD: T7 RNAi oligo designer"
            },
            "pmid": "15215363"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        },
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        }
    ],
    "validated": 1
}