{
    "additionDate": "2023-03-19T09:38:05.150341Z",
    "biotoolsCURIE": "biotools:gacnnmda",
    "biotoolsID": "gacnnmda",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "1970250317@qq.com",
            "name": "Yaqin Tan",
            "typeEntity": "Person"
        },
        {
            "email": "wanglei@xtu.edu.cn",
            "name": "Lei Wang",
            "typeEntity": "Person"
        }
    ],
    "description": "A computational model for predicting potential human microbe-drug associations based on graph attention network and CNN-based classifier.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                },
                {
                    "term": "Small molecule design",
                    "uri": "http://edamontology.org/operation_4009"
                }
            ]
        }
    ],
    "homepage": "https://github.com/tyqGitHub/TYQ/tree/master/GACNNMDA",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T14:53:12.679584Z",
    "license": "Not licensed",
    "name": "GACNNMDA",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1186/s12859-023-05158-7",
            "metadata": {
                "abstract": "As new drug targets, human microbes are proven to be closely related to human health. Effective computational methods for inferring potential microbe-drug associations can provide a useful complement to conventional experimental methods and will facilitate drug research and development. However, it is still a challenging work to predict potential interactions for new microbes or new drugs, since the number of known microbe-drug associations is very limited at present. In this manuscript, we first constructed two heterogeneous microbe-drug networks based on multiple measures of similarity of microbes and drugs, and known microbe-drug associations or known microbe-disease-drug associations, respectively. And then, we established two feature matrices for microbes and drugs through concatenating various attributes of microbes and drugs. Thereafter, after taking these two feature matrices and two heterogeneous microbe-drug networks as inputs of a two-layer graph attention network, we obtained low dimensional feature representations for microbes and drugs separately. Finally, through integrating low dimensional feature representations with two feature matrices to form the inputs of a convolutional neural network respectively, a novel computational model named GACNNMDA was designed to predict possible scores of microbe-drug pairs. Experimental results show that the predictive performance of GACNNMDA is superior to existing advanced methods. Furthermore, case studies on well-known microbes and drugs demonstrate the effectiveness of GACNNMDA as well. Source codes and supplementary materials are available at: https://github.com/tyqGitHub/TYQ/tree/master/GACNNMDA.",
                "authors": [
                    {
                        "name": "Ma Q."
                    },
                    {
                        "name": "Tan Y."
                    },
                    {
                        "name": "Wang L."
                    }
                ],
                "citationCount": 11,
                "date": "2023-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "GACNNMDA: a computational model for predicting potential human microbe-drug associations based on graph attention network and CNN-based classifier"
            },
            "pmcid": "PMC9893988",
            "pmid": "36732704"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Drug development",
            "uri": "http://edamontology.org/topic_3373"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Microbial ecology",
            "uri": "http://edamontology.org/topic_3697"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
