{
    "additionDate": "2020-01-14T09:33:32Z",
    "biotoolsCURIE": "biotools:TeleECHO",
    "biotoolsID": "TeleECHO",
    "confidence_flag": "medium",
    "description": "a Force Multiplier to Improve the Care of Skeletal Diseases in Underserved Communities.\n\nProject ECHO is committed to addressing the needs.\n\nof the most vulnerable populations by equipping communities with.\n\nthe right knowledge, at the right place, at the right time.\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'Bone Health TeleECHO', 'ECHO' (bio.tools/echo)",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://echo.unm.edu/",
    "lastUpdate": "2020-01-14T09:33:32Z",
    "name": "TeleECHO",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1007/S11914-019-00543-9",
            "metadata": {
                "abstract": "© 2019, Springer Science+Business Media, LLC, part of Springer Nature.Purpose of Review: This review describes the global development of a model of technology-enabled collaborative learning for healthcare professionals called Project ECHO (Extension for Community Healthcare Outcomes) and its applications for the management of patients with skeletal diseases. Recent Findings: The prototype Bone Health TeleECHO was established in 2015, with others now operational in the USA and other countries, and more expected to follow soon. Each teleECHO program, in the right language and convenient time zone, provides a virtual community of practice for healthcare professionals to benefit from real-time interactive case-based learning and brief didactic presentations on topics of interest. Summary: Bone Health TeleECHO elevates the level of knowledge of participants and improves self-confidence in managing patients with skeletal diseases. The development of many teleECHO programs worldwide serves as a force multiplier, with the potential to narrow the osteoporosis treatment gap and enhance the effectiveness of fracture liaison services.",
                "authors": [
                    {
                        "name": "Lewiecki E.M."
                    },
                    {
                        "name": "Jackson A."
                    },
                    {
                        "name": "Lake A.F."
                    },
                    {
                        "name": "Carey J.J."
                    },
                    {
                        "name": "Belaya Z."
                    },
                    {
                        "name": "Melnichenko G.A."
                    },
                    {
                        "name": "Rochelle R."
                    }
                ],
                "date": "2019-12-01T00:00:00Z",
                "journal": "Current Osteoporosis Reports",
                "title": "Bone Health TeleECHO: a Force Multiplier to Improve the Care of Skeletal Diseases in Underserved Communities"
            },
            "pmid": "31713181"
        }
    ],
    "topic": [
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Medical informatics",
            "uri": "http://edamontology.org/topic_3063"
        },
        {
            "term": "Public health and epidemiology",
            "uri": "http://edamontology.org/topic_3305"
        }
    ]
}