{
    "accessibility": "Open access",
    "additionDate": "2022-09-05T00:29:16.923275Z",
    "biotoolsCURIE": "biotools:o-net",
    "biotoolsID": "o-net",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "naichengang@126.com",
            "name": "Gang Chen",
            "typeEntity": "Person"
        },
        {
            "email": "ttraveltong@gmail.com",
            "name": "Tong Tong",
            "typeEntity": "Person"
        },
        {
            "name": "Ming Du"
        },
        {
            "name": "Qinquan Gao"
        },
        {
            "name": "Ren-Guey Lee"
        }
    ],
    "description": "A Novel Framework With Deep Fusion of CNN and Transformer for Simultaneous Segmentation and Classification.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Feature extraction",
                    "uri": "http://edamontology.org/operation_3937"
                }
            ]
        }
    ],
    "homepage": "https://github.com/ortonwang/O-Net",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-09-05T00:29:16.925613Z",
    "license": "Not licensed",
    "name": "O-Net",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.3389/FNINS.2022.876065",
            "metadata": {
                "abstract": "Copyright © 2022 Wang, Lan, Han, Hu, Huang, Deng, Zhang, Wang, Chen, Jiang, Lee, Gao, Du, Tong and Chen.The application of deep learning in the medical field has continuously made huge breakthroughs in recent years. Based on convolutional neural network (CNN), the U-Net framework has become the benchmark of the medical image segmentation task. However, this framework cannot fully learn global information and remote semantic information. The transformer structure has been demonstrated to capture global information relatively better than the U-Net, but the ability to learn local information is not as good as CNN. Therefore, we propose a novel network referred to as the O-Net, which combines the advantages of CNN and transformer to fully use both the global and the local information for improving medical image segmentation and classification. In the encoder part of our proposed O-Net framework, we combine the CNN and the Swin Transformer to acquire both global and local contextual features. In the decoder part, the results of the Swin Transformer and the CNN blocks are fused to get the final results. We have evaluated the proposed network on the synapse multi-organ CT dataset and the ISIC 2017 challenge dataset for the segmentation task. The classification network is simultaneously trained by using the encoder weights of the segmentation network. The experimental results show that our proposed O-Net achieves superior segmentation performance than state-of-the-art approaches, and the segmentation results are beneficial for improving the accuracy of the classification task. The codes and models of this study are available at https://github.com/ortonwang/O-Net.",
                "authors": [
                    {
                        "name": "Chen G."
                    },
                    {
                        "name": "Chen M."
                    },
                    {
                        "name": "Deng Y."
                    },
                    {
                        "name": "Du M."
                    },
                    {
                        "name": "Gao Q."
                    },
                    {
                        "name": "Han Z."
                    },
                    {
                        "name": "Hu Z."
                    },
                    {
                        "name": "Huang Y."
                    },
                    {
                        "name": "Jiang H."
                    },
                    {
                        "name": "Lan J."
                    },
                    {
                        "name": "Lee R.-G."
                    },
                    {
                        "name": "Tong T."
                    },
                    {
                        "name": "Wang J."
                    },
                    {
                        "name": "Wang T."
                    },
                    {
                        "name": "Zhang H."
                    }
                ],
                "date": "2022-06-02T00:00:00Z",
                "journal": "Frontiers in Neuroscience",
                "title": "O-Net: A Novel Framework With Deep Fusion of CNN and Transformer for Simultaneous Segmentation and Classification"
            },
            "pmcid": "PMC9201625",
            "pmid": "35720715"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        },
        {
            "term": "Tomography",
            "uri": "http://edamontology.org/topic_3452"
        }
    ],
    "validated": 1
}
