{
    "additionDate": "2021-01-18T07:02:31Z",
    "biotoolsCURIE": "biotools:tgex",
    "biotoolsID": "tgex",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "simon.fishilevich@weizmann.ac.il",
            "name": "Simon Fishilevich",
            "orcidid": "https://orcid.org/0000-0003-1167-1638",
            "typeEntity": "Person"
        },
        {
            "email": "doron.lancet@weizmann.ac.il",
            "name": "Doron Lancet",
            "typeEntity": "Person"
        },
        {
            "email": "dvird@lifemapsc.com",
            "name": "Dvir Dahary",
            "typeEntity": "Person"
        }
    ],
    "description": "Genome analysis and knowledge-driven variant interpretation with TGex.\n\n· Rapid and accurate phenotype-driven variant prioritization.\n\n· Automated ACMG/ClinGen variant classification.\n\n· Comprehensive evidence collection & reporting.\n\n整合超过120个关键数据来源，GeneCards® Suite信息数据库通过突出基因和表型之间的关联、提供即时评估的支持证据以及自动生成案例报告的方式进行您的新一代测序分析。.\n\n如果您需要在防火墙内安装，只需要将TGex集成到您的商业数据库和内部及外部数据源即可。根据您的自有测序数据创建属于自己的内部专属数据库。.\n\n通过简单易且配有灵活的交互式过滤工具和注释的强大用户界面浏览和发现关键基因体变异体。.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                },
                {
                    "term": "Variant classification",
                    "uri": "http://edamontology.org/operation_3225"
                },
                {
                    "term": "Variant prioritisation",
                    "uri": "http://edamontology.org/operation_3226"
                }
            ]
        }
    ],
    "homepage": "http://tgex.genecards.org/",
    "lastUpdate": "2021-02-27T09:06:43Z",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "https://tgex-app.genecards.cn"
        },
        {
            "type": [
                "Other"
            ],
            "url": "https://tgex-app.genecards.org/"
        }
    ],
    "name": "TGex",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1186/S12920-019-0647-8",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: The clinical genetics revolution ushers in great opportunities, accompanied by significant challenges. The fundamental mission in clinical genetics is to analyze genomes, and to identify the most relevant genetic variations underlying a patient's phenotypes and symptoms. The adoption of Whole Genome Sequencing requires novel capacities for interpretation of non-coding variants. Results: We present TGex, the Translational Genomics expert, a novel genome variation analysis and interpretation platform, with remarkable exome analysis capacities and a pioneering approach of non-coding variants interpretation. TGex's main strength is combining state-of-the-art variant filtering with knowledge-driven analysis made possible by VarElect, our highly effective gene-phenotype interpretation tool. VarElect leverages the widely used GeneCards knowledgebase, which integrates information from > 150 automatically-mined data sources. Access to such a comprehensive data compendium also facilitates TGex's broad variant annotation, supporting evidence exploration, and decision making. TGex has an interactive, user-friendly, and easy adaptive interface, ACMG compliance, and an automated reporting system. Beyond comprehensive whole exome sequence capabilities, TGex encompasses innovative non-coding variants interpretation, towards the goal of maximal exploitation of whole genome sequence analyses in the clinical genetics practice. This is enabled by GeneCards' recently developed GeneHancer, a novel integrative and fully annotated database of human enhancers and promoters. Examining use-cases from a variety of TGex users world-wide, we demonstrate its high diagnostic yields (42% for single exome and 50% for trios in 1500 rare genetic disease cases) and critical actionable genetic findings. The platform's support for integration with EHR and LIMS through dedicated APIs facilitates automated retrieval of patient data for TGex's customizable reporting engine, establishing a rapid and cost-effective workflow for an entire range of clinical genetic testing, including rare disorders, cancer predisposition, tumor biopsies and health screening. Conclusions: TGex is an innovative tool for the annotation, analysis and prioritization of coding and non-coding genomic variants. It provides access to an extensive knowledgebase of genomic annotations, with intuitive and flexible configuration options, allows quick adaptation, and addresses various workflow requirements. It thus simplifies and accelerates variant interpretation in clinical genetics workflows, with remarkable diagnostic yield, as exemplified in the described use cases. TGex is available at http://tgex.genecards.org/",
                "authors": [
                    {
                        "name": "Barshir R."
                    },
                    {
                        "name": "Chen F."
                    },
                    {
                        "name": "Dahary D."
                    },
                    {
                        "name": "Fishilevich S."
                    },
                    {
                        "name": "Golan Y."
                    },
                    {
                        "name": "Iny Stein T."
                    },
                    {
                        "name": "Kariv R."
                    },
                    {
                        "name": "Lancet D."
                    },
                    {
                        "name": "Mazor Y."
                    },
                    {
                        "name": "Rosner G."
                    },
                    {
                        "name": "Safran M."
                    },
                    {
                        "name": "Shen Y."
                    },
                    {
                        "name": "Twik M."
                    },
                    {
                        "name": "Zelig O."
                    },
                    {
                        "name": "Zhang Q."
                    }
                ],
                "citationCount": 4,
                "date": "2019-12-30T00:00:00Z",
                "journal": "BMC Medical Genomics",
                "title": "Genome analysis and knowledge-driven variant interpretation with TGex"
            },
            "pmcid": "PMC6937949",
            "pmid": "31888639"
        }
    ],
    "topic": [
        {
            "term": "Exome sequencing",
            "uri": "http://edamontology.org/topic_3676"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Whole genome sequencing",
            "uri": "http://edamontology.org/topic_3673"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ]
}
