{
    "accessibility": "Open access",
    "additionDate": "2019-07-04T14:58:43Z",
    "biotoolsCURIE": "biotools:SW-Tandem",
    "biotoolsID": "SW-Tandem",
    "cost": "Free of charge",
    "description": "Tool for large-scale peptide identification with parallel spectrum dot product on Sunway TaihuLight.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/Logic09/SW-Tandem/blob/master/README.md"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                },
                {
                    "term": "Peptide database search",
                    "uri": "http://edamontology.org/operation_3646"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Logic09/SW-Tandem",
    "language": [
        "C++"
    ],
    "lastUpdate": "2020-06-16T10:55:23Z",
    "license": "Unlicense",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/Logic09/SW-Tandem/issues"
        }
    ],
    "maturity": "Mature",
    "name": "SW-Tandem",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "Ruta",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btz147",
            "metadata": {
                "abstract": "© 2019 The Author(s). Published by Oxford University Press. All rights reserved.Summary: Tandem mass spectrometry based database searching is a widely acknowledged and adopted method that identifies peptide sequence in shotgun proteomics. However, database searching is extremely computationally expensive, which can take days even weeks to process a large spectra dataset. To address this critical issue, this paper presents SW-Tandem, a new tool for large-scale peptide sequencing. SW-Tandem parallelizes the spectrum dot product scoring algorithm and leverages the advantages of Sunway TaihuLight, the No. 1 supercomputer in the world in 2017. Sunway TaihuLight is powered by the brand new many-core SW26010 processors and provides a peak computation performance greater than 100PFlops. To fully utilize the Sunway TaihuLights capacity, SW-Tandem employs three mechanisms to accelerate large-scale peptide identification, memory-access optimizations, double buffering and vectorization. The results of experiments conducted on multiple datasets demonstrate the performance of SW-Tandem against three state-of-the-art tools for peptide identification, including X!! Tandem, MR-Tandem and MSFragger. In addition, it shows high scalability in the experiments on extremely large datasets sized up to 12 GB. Availability and implementation: SW-Tandem is an open source software tool implemented in C++. The source code and the parameter settings are available at https://github.com/Logic09/SW-Tandem. Supplementary information: Supplementary data are available at Bioinformatics online.",
                "authors": [
                    {
                        "name": "Chen T."
                    },
                    {
                        "name": "He Q."
                    },
                    {
                        "name": "Li C."
                    },
                    {
                        "name": "Li K."
                    },
                    {
                        "name": "Zhu Y."
                    }
                ],
                "citationCount": 4,
                "date": "2019-10-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "SW-Tandem: A highly efficient tool for large-scale peptide identification with parallel spectrum dot product on Sunway TaihuLight"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ],
    "validated": 1
}
