{
    "additionDate": "2018-08-04T13:37:10Z",
    "biotoolsCURIE": "biotools:tmpd",
    "biotoolsID": "tmpd",
    "credit": [
        {
            "name": "Support",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://biodb.sdau.edu.cn/tmpd/contact.html"
        }
    ],
    "description": "The Tobacco Markers & Primers Database.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://biodb.sdau.edu.cn/tmpd/statics.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                }
            ]
        }
    ],
    "homepage": "http://biodb.sdau.edu.cn/tmpd/index.html",
    "lastUpdate": "2018-12-10T12:59:00Z",
    "name": "TMPD",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1186/s12864-018-4878-4",
            "metadata": {
                "abstract": "© 2018 The Author(s).Background: Simple sequence repeats (SSRs) are tandem repeats of DNA that have been used to develop robust genetic markers. These molecular markers are powerful tools for basic and applied studies such as molecular breeding. In the model plants in Nicotiana genus e.g. N. benthamiana, a comprehensive assessment of SSR content has become possible now because several Nicotiana genomes have been sequenced. We conducted a genome-wide SSR characterization and marker development across seven Nicotiana genomes. Results: Here, we initially characterized 2,483,032 SSRs (repeat units of 1-10 bp) from seven genomic sequences of Nicotiana and developed SSR markers using the GMATA® software package. Of investigated repeat units, mono-, di- and tri-nucleotide SSRs account for 98% of all SSRs in Nicotiana. More complex SSR motifs, although rare, are highly variable between Nicotiana genomes. A total of 1,224,048 non-redundant Nicotiana (NIX) markers were developed, of which 99.98% are novel. An efficient and uniform genotyping protocol for NIX markers was developed and validated. We created a web-based database of NIX marker information including amplicon sizes of alleles in each genome for downloading and online analysis. Conclusions: The present work constitutes the first deep characterization of SSRs in seven genomes of Nicotiana, and the development of NIX markers for these SSRs. Our online marker database and an efficient genotyping protocol facilitate the application of these markers. The NIX markers greatly expand Nicotiana marker resources, thus providing a useful tool for future research and breeding. We demonstrate a novel protocol for SSR marker development and utilization at the whole genome scale that can be applied to any lineage of organisms. The Tobacco Markers & Primers Database (TMPD) is available at http://biodb.sdau.edu.cn/tmpd/index.html",
                "authors": [
                    {
                        "name": "Wang X."
                    },
                    {
                        "name": "Yang S."
                    },
                    {
                        "name": "Chen Y."
                    },
                    {
                        "name": "Zhang S."
                    },
                    {
                        "name": "Zhao Q."
                    },
                    {
                        "name": "Li M."
                    },
                    {
                        "name": "Gao Y."
                    },
                    {
                        "name": "Yang L."
                    },
                    {
                        "name": "Bennetzen J.L."
                    }
                ],
                "citationCount": 14,
                "date": "2018-06-27T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "Comparative genome-wide characterization leading to simple sequence repeat marker development for Nicotiana"
            },
            "pmcid": "PMC6020451",
            "pmid": "29945549"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Sequence sites, features and motifs",
            "uri": "http://edamontology.org/topic_0160"
        }
    ],
    "validated": 1
}