{"credit":[{"email":"agor@ornl.gov","name":"Andrey A. Gorin","typeEntity":"Person","typeRoles":["Primary contact"],"url":"https://www.ornl.gov/staff-profile/se-ran-jun"}],"documentation":[{"type":"GENERAL","url":"https://github.com/srjun/PanFP/blob/master/README.md"}],"function":[{"operation":[{"term":"Sequence classification","uri":"http://edamontology.org/operation_2995"},{"term":"Prediction and recognition","uri":"http://edamontology.org/operation_2423"}]}],"labels":{"language":["Perl"],"operatingSystem":["Linux","Windows"],"toolType":["Command-line tool"],"topic":[{"term":"DNA","uri":"http://edamontology.org/topic_0654"},{"term":"Genomics","uri":"http://edamontology.org/topic_0622"},{"term":"Microbiology","uri":"http://edamontology.org/topic_3301"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/panfp-pangenome-based-functional-profiles-for-microbial-communities.html"}],"publication":[{"abstract":"© 2015 Jun et al.Background: For decades there has been increasing interest in understanding the relationships between microbial communities and ecosystem functions. Current DNA sequencing technologies allows for the exploration of microbial communities in two principle ways: targeted rRNA gene surveys and shotgun metagenomics. For large study designs, it is often still prohibitively expensive to sequence metagenomes at both the breadth and depth necessary to statistically capture the true functional diversity of a community. Although rRNA gene surveys provide no direct evidence of function, they do provide a reasonable estimation of microbial diversity, while being a very cost-effective way to screen samples of interest for later shotgun metagenomic analyses. However, there is a great deal of 16S rRNA gene survey data currently available from diverse environments, and thus a need for tools to infer functional composition of environmental samples based on 16S rRNA gene survey data. Results: We present a computational method called pangenome-based functional profiles (PanFP), which infers functional profiles of microbial communities from 16S rRNA gene survey data for Bacteria and Archaea. PanFP is based on pangenome reconstruction of a 16S rRNA gene operational taxonomic unit (OTU) from known genes and genomes pooled from the OTU's taxonomic lineage. From this lineage, we derive an OTU functional profile by weighting a pangenome's functional profile with the OTUs abundance observed in a given sample. We validated our method by comparing PanFP to the functional profiles obtained from the direct shotgun metagenomic measurement of 65 diverse communities via Spearman correlation coefficients. These correlations improved with increasing sequencing depth, within the range of 0.8-0.9 for the most deeply sequenced Human Microbiome Project mock community samples. PanFP is very similar in performance to another recently released tool, PICRUSt, for almost all of survey data analysed here. But, our method is unique in that any OTU building method can be used, as opposed to being limited to closed-reference OTU picking strategies against specific reference sequence databases. Conclusions: We developed an automated computational method, which derives an inferred functional profile based on the 16S rRNA gene surveys of microbial communities. The inferred functional profile provides a cost effective way to study complex ecosystems through predicted comparative functional metagenomes and metadata analysis. All PanFP source code and additional documentation are freely available online at GitHub (https://github.com/srjun/PanFP).","authors":["Jun S.-R.","Robeson M.S.","Hauser L.J.","Schadt C.W.","Gorin A.A."],"cit_count":8,"journal":"BMC Research Notes","pmid":"26409790","title":"PanFP: Pangenome-based functional profiles for microbial communities","year":"2015-09-26"}],"summary":{"biotoolsCURIE":"biotools:panfp","biotoolsID":"panfp","description":"This software is a tool to predict functional composition of microbial communities based on communities survey data which builds a pangenome for each OTU and assigns the pangenome’s functional profile to the OTU.","homepage":"https://github.com/srjun/PanFP","name":"PanFP"}}