{"credit":[{"email":"jiang.du@yale.edu","name":"Jiang Du","typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://homes.gersteinlab.org/people/jiangdu/"}],"documentation":[{"type":"GENERAL","url":"http://archive.gersteinlab.org/proj/ReSeqSim/"}],"function":[{"operation":[{"term":"Read mapping","uri":"http://edamontology.org/operation_3198"}]}],"labels":{"operatingSystem":["Linux"],"toolType":["Command-line tool"],"topic":[{"term":"DNA structural variation","uri":"http://edamontology.org/topic_3175"}]},"publication":[{"abstract":"The goal of human genome re-sequencing is obtaining an accurate assembly of an individual's genome. Recently, there has been great excitement in the development of many technologies for this (e.g. medium and short read sequencing from companies such as 454 and SOLiD, and high-density oligo-arrays from Affymetrix and NimbelGen), with even more expected to appear. The costs and sensitivities of these technologies differ considerably from each other. As an important goal of personal genomics is to reduce the cost of re-sequencing to an affordable point, it is worthwhile to consider optimally integrating technologies. Here, we build a simulation toolbox that will help us optimally combine different technologies for genome re-sequencing, especially in reconstructing large structural variants (SVs). SV reconstruction is considered the most challenging step in human genome re-sequencing. (It is sometimes even harder than de novo assembly of small genomes because of the duplications and repetitive sequences in the human genome.) To this end, we formulate canonical problems that are representative of issues in reconstruction and are of small enough scale to be computationally tractable and simulatable. Using semi-realistic simulations, we show how we can combine different technologies to optimally solve the assembly at low cost. With mapability maps, our simulations efficiently handle the inhomogeneous repeat-containing structure of the human genome and the computational complexity of practical assembly algorithms. They quantitatively show how combining different read lengths is more cost-effective than using one length, how an optimal mixed sequencing strategy for reconstructing large novel SVs usually also gives accurate detection of SNPs/indels, how paired-end reads can improve reconstruction efficiency, and how adding in arrays is more efficient than just sequencing for disentangling some complex SVs. Our strategy should facilitate the sequencing of human genomes at maximum accuracy and low cost. ©2009 Du et al.","authors":["Du J.","Bjornson R.D.","Zhang Z.D.","Kong Y.","Snyder M.","Gerstein M.B."],"cit_count":10,"doi":"10.1371/journal.pcbi.1000432","journal":"PLoS Computational Biology","title":"Integrating sequencing technologies in personal genomics: Optimal low cost reconstruction of structural variants","type":"Primary","year":"2009-07-01"}],"summary":{"biotoolsCURIE":"biotools:reseqsim","biotoolsID":"reseqsim","description":"A simulation toolbox that will help us optimize the combination of different technologies to perform comparative genome re-sequencing, especially in reconstructing large structural variants (SVs).","homepage":"http://archive.gersteinlab.org/proj/ReSeqSim/","name":"ReSeqSim"}}