{
    "accessibility": "Open access",
    "additionDate": "2019-07-04T14:43:40Z",
    "biotoolsCURIE": "biotools:PleioNet",
    "biotoolsID": "PleioNet",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "ray.x.gao@gmail.com",
            "name": "X. R. Gao",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Web-based visualization tool for exploring pleiotropy across complex traits.",
    "documentation": [
        {
            "note": "Tutorial material",
            "type": [
                "Training material"
            ],
            "url": "http://35.231.237.229/pleionet/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "homepage": "http://www.pleionet.com/",
    "lastUpdate": "2020-06-16T10:55:23Z",
    "license": "Unlicense",
    "maturity": "Mature",
    "name": "PleioNet",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Ruta",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btz179",
            "metadata": {
                "abstract": "© 2019 The Author(s) 2019. Published by Oxford University Press. All rights reserved.Pleiotropy plays an important role in furthering our understanding of the shared genetic architecture of different human diseases and traits. However, exploring and visualizing pleiotropic information with currently publicly available tools is limiting and challenging. To aid researchers in constructing and digesting pleiotropic networks, we present PleioNet, a web-based visualization tool for exploring this information across human diseases and traits. This program provides an intuitive and interactive web interface that seamlessly integrates large database queries with visualizations that enable users to quickly explore complex high-dimensional pleiotropic information. PleioNet works on all modern computer and mobile web browsers, making pleiotropic information readily available to a broad range of researchers and clinicians with diverse technical backgrounds. We expect that PleioNet will be an important tool for studying the underlying pleiotropic connections among human diseases and traits. Availability and implementation: PleioNet is hosted on Google cloud and freely available at http://www.pleionet.com/.",
                "authors": [
                    {
                        "name": "Gao X.R."
                    },
                    {
                        "name": "Huang H."
                    }
                ],
                "citationCount": 3,
                "date": "2019-10-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "PleioNet: A web-based visualization tool for exploring pleiotropy across complex traits"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        }
    ],
    "validated": 1
}
