{
    "additionDate": "2020-01-14T19:34:42Z",
    "biotoolsCURIE": "biotools:scReClassify",
    "biotoolsID": "scReClassify",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "pengyi.yang@sydney.edu.au",
            "name": "Pengyi Yang",
            "orcidid": "https://orcid.org/0000-0003-1098-3138",
            "typeEntity": "Person"
        }
    ],
    "description": "post hoc cell type classification of single-cell rNA-seq data.\n\nPost hoc cell type classification of single-cell RNA-sequencing data.\n\nscReClassify is a post hoc cell type classification of single-cell RNA-sequencing data. Using semi-supervised learning algorithm, adaSampling, to correct cell type annotation from noise",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Principal component visualisation",
                    "uri": "http://edamontology.org/operation_2939"
                }
            ]
        }
    ],
    "homepage": "https://github.com/SydneyBioX/scReClassify",
    "language": [
        "R"
    ],
    "lastUpdate": "2020-12-18T08:11:22Z",
    "name": "scReClassify",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12864-019-6305-X",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Single-cell RNA-sequencing (scRNA-seq) is a fast emerging technology allowing global transcriptome profiling on the single cell level. Cell type identification from scRNA-seq data is a critical task in a variety of research such as developmental biology, cell reprogramming, and cancers. Typically, cell type identification relies on human inspection using a combination of prior biological knowledge (e.g. marker genes and morphology) and computational techniques (e.g. PCA and clustering). Due to the incompleteness of our current knowledge and the subjectivity involved in this process, a small amount of cells may be subject to mislabelling. Results: Here, we propose a semi-supervised learning framework, named scReClassify, for 'post hoc' cell type identification from scRNA-seq datasets. Starting from an initial cell type annotation with potentially mislabelled cells, scReClassify first performs dimension reduction using PCA and next applies a semi-supervised learning method to learn and subsequently reclassify cells that are likely mislabelled initially to the most probable cell types. By using both simulated and real-world experimental datasets that profiled various tissues and biological systems, we demonstrate that scReClassify is able to accurately identify and reclassify misclassified cells to their correct cell types. Conclusions: ScReClassify can be used for scRNA-seq data as a post hoc cell type classification tool to fine-tune cell type annotations generated by any cell type classification procedure. It is implemented as an R package and is freely available from https://github.com/SydneyBioX/scReClassify",
                "authors": [
                    {
                        "name": "Geddes T.A."
                    },
                    {
                        "name": "Kim H.J."
                    },
                    {
                        "name": "Kim T."
                    },
                    {
                        "name": "Lo K."
                    },
                    {
                        "name": "Yang J.Y.H."
                    },
                    {
                        "name": "Yang P."
                    }
                ],
                "citationCount": 5,
                "date": "2019-12-24T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "ScReClassify: Post hoc cell type classification of single-cell RNA-seq data"
            },
            "pmcid": "PMC6929456",
            "pmid": "31874628"
        }
    ],
    "topic": [
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ],
    "validated": 1
}
