{"credit":[{"email":"jmower2@unl.edu","name":"Jeff Mower","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"http://prep.unl.edu/"}],"function":[{"operation":[{"term":"Protein subcellular localisation prediction","uri":"http://edamontology.org/operation_2489"},{"term":"Editing","uri":"http://edamontology.org/operation_3096"},{"term":"Gene prediction","uri":"http://edamontology.org/operation_2454"},{"term":"Protein feature detection","uri":"http://edamontology.org/operation_3092"}]}],"labels":{"operatingSystem":["Linux","Windows","Mac"],"toolType":["Web application"],"topic":[{"term":"Plant biology","uri":"http://edamontology.org/topic_0780"},{"term":"RNA","uri":"http://edamontology.org/topic_0099"},{"term":"Nucleic acid structure analysis","uri":"http://edamontology.org/topic_0097"},{"term":"Structure prediction","uri":"http://edamontology.org/topic_0082"}]},"publication":[{"abstract":"RNA editing alters plant mitochondrial and chloroplast transcripts by converting specific cytidines to uridines, which usually results in a change in the amino acid sequence of the translated protein. Systematic studies have experimentally identified sites of RNA editing in organellar transcriptomes from several species, but these analyses have not kept pace with rate of genome sequencing. The PREP (predictive RNA editors for plants) suite was developed to computationally predict sites of RNA editing based on the well-known principle that editing in plant organelles increases the conservation of proteins across species. The PREP suite provides predictive RNA editors for plant mitochondrial genes (PREP-Mt), for chloroplast genes (PREP-Cp), and for alignments submitted by the user (PREP-Aln). These servers require minimal input, are very fast, and are highly accurate on all seed plants examined to date. PREP-Mt has proved useful in several research studies and the newly developed PREP-Cp and PREP-Aln servers should be of further assistance for analyses that require knowledge of the location of sites of RNA editing. The PREP suite is freely available at http://prep.unl.edu/.","authors":["Mower J.P."],"cit_count":73,"journal":"Nucleic Acids Research","pmid":"19433507","title":"The PREP suite: Predictive RNA editors for plant mitochondrial genes, chloroplast genes and user-defined alignments","year":"2009-08-04"},{"abstract":"Background: In plants, RNA editing is a process that converts specific cytidines to uridines and uridines to cytidines in transcripts from virtually all mitochondrial protein-coding genes. There are thousands of plant mitochondrial genes in the sequence databases, but sites of RNA editing have not been determined for most. Accurate methods of RNA editing site prediction will be important in filling in this information gap and could reduce or even eliminate the need for experimental determination of editing sites for many sequences. Because RNA editing tends to increase protein conservation across species by \"correcting\" codons that specify unconserved amino acids, this principle can be used to predict editing sites by identifying positions where an RNA editing event would increase the conservation of a protein to homologues from other plants. PREP-Mt takes this approach to predict editing sites for any protein-coding gene in plant mitochondria. Results: To test the general applicability of the PREP-Mt methodology, RNA editing sites were predicted for 370 full-length or nearly full-length DNA sequences and then compared to the known sites of RNA editing for these sequences. Of 60,263 cytidines in this test set, PREP-Mt correctly classified 58,994 as either an edited or unedited site (accuracy = 97.9%). PREP-Mt properly identified 3,038 of the 3,698 known sites of RNA editing (sensitivity = 82.2%) and 55,956 of the 56,565 known unedited sites (specificity = 98.9%). Accuracy and sensitivity increased to 98.7% and 94.7%, respectively, after excluding the 489 silent editing sites (which have no effect on protein sequence or function) from the test set. Conclusion: These results indicate that PREP-Mt is effective at identifying C to U RNA editing sites in plant mitochondrial protein-coding genes. Thus, PREP-Mt should be useful in predicting protein sequences for use in molecular, biochemical, and phylogenetic analyses. In addition, PREP-Mt could be used to determine functionality of a mitochondrial gene or to identify particular sequences with unusual editing properties. The PREP-Mt methodology should be applicable to any system where RNA editing increases protein conservation across species. © 2005 Mower; licensee BioMed Central Ltd.","authors":["Mower J.P."],"cit_count":50,"journal":"BMC Bioinformatics","pmid":"15826309","title":"PREP-Mt: Predictive RNA editor for plant mitochondrial genes","year":"2005-04-12"}],"summary":{"biotoolsCURIE":"biotools:prep_suite","biotoolsID":"prep_suite","description":"The PREP (Predictive RNA Editors for Plants) suite predicts sites of RNA editing based on the principle that editing in plant organelles increases the conservation of proteins across species. Predictors for mitochondrial genes, chloroplast genes, and alignments input by the user are included.","homepage":"http://prep.unl.edu/","name":"PREP Suite"}}