{
    "additionDate": "2023-11-17T16:52:25.024020Z",
    "biotoolsCURIE": "biotools:gpkb",
    "biotoolsID": "gpkb",
    "credit": [
        {
            "email": "marco.masseroli@polimi.it",
            "name": "Marco Masseroli",
            "orcidid": "https://orcid.org/0000-0003-2574-1174",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "name": "ELEXIR-ITA",
            "typeEntity": "Project",
            "url": "https://elixir-italy.org/"
        },
        {
            "name": "ELIXIR-ITA-POLIMI",
            "typeEntity": "Project",
            "url": "https://www.deib.polimi.it/eng/elixir-iib"
        }
    ],
    "description": "Genomic and Proteomic Knowledge Base (GPKB), based on the Genomic and Proteomic Data Warehouse (GPDW), is an integrative database of annotation data from several sources.",
    "editPermission": {
        "type": "group"
    },
    "elixirNode": [
        "Italy"
    ],
    "elixirPlatform": [
        "Data"
    ],
    "homepage": "http://www.bioinformatics.deib.polimi.it/GPKB/",
    "lastUpdate": "2023-12-03T20:18:12.422625Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "http://www.bioinformatics.deib.polimi.it/GPKB/"
        }
    ],
    "name": "GPKB",
    "owner": "ELIXIR-ITA-POLIMI",
    "publication": [
        {
            "doi": "10.1186/1471-2164-16-S6-S5",
            "metadata": {
                "abstract": "Background: Increasingly high amounts of heterogeneous and valuable controlled biomolecular annotations are available, but far from exhaustive and scattered in many databases. Several annotation integration and prediction approaches have been proposed, but these issues are still unsolved. We previously created a Genomic and Proteomic Knowledge Base (GPKB) that efficiently integrates many distributed biomolecular annotation and interaction data of several organisms, including 32,956,102 gene annotations, 273,522,470 protein annotations and 277,095 protein-protein interactions (PPIs). Results: By comprehensively leveraging transitive relationships defined by the numerous association data integrated in GPKB, we developed a software procedure that effectively detects and supplement consistent biomolecular annotations not present in the integrated sources. According to some defined logic rules, it does so only when the semantic type of data and of their relationships, as well as the cardinality of the relationships, allow identifying molecular biology compliant annotations. Thanks to controlled consistency and quality enforced on data integrated in GPKB, and to the procedures used to avoid error propagation during their automatic processing, we could reliably identify many annotations, which we integrated in GPKB. They comprise 3,144 gene to pathway and 21,942 gene to biological function annotations of many organisms, and 1,027 candidate associations between 317 genetic disorders and 782 human PPIs. Overall estimated recall and precision of our approach were 90.56 % and 96.61 %, respectively. Co-functional evaluation of genes with known function showed high functional similarity between genes with new detected and known annotation to the same pathway; considering also the new detected gene functional annotations enhanced such functional similarity, which resembled the one existing between genes known to be annotated to the same pathway. Strong evidence was also found in the literature for the candidate associations detected between Cystic fibrosis disorder and the PPIs between the CFTR_HUMAN, DERL1_HUMAN, RNF5_HUMAN, AHSA1_HUMAN and GOPC_HUMAN proteins, and between the CHIP_HUMAN and HSP7C_HUMAN proteins. Conclusions: Although identified gene annotations and PPI-genetic disorder candidate associations require biological validation, our approach intrinsically provides their in silico evidence based on available data. Public availability within the GPKB ( http://www.bioinformatics.deib.polimi.it/GPKB/ ) of all identified and integrated annotations offers a valuable resource fostering new biomedical-molecular knowledge discoveries.",
                "authors": [
                    {
                        "name": "Canakoglu A."
                    },
                    {
                        "name": "Masseroli M."
                    },
                    {
                        "name": "Quigliatti M."
                    }
                ],
                "citationCount": 6,
                "date": "2015-06-01T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "Detection of gene annotations and protein-protein interaction associated disorders through transitive relationships between integrated annotations"
            }
        },
        {
            "metadata": {
                "abstract": "Understanding complex biological phenomena involves answering complex biomedical questions on multiple biomolecular information simultaneously, which are expressed through multiple genomic and proteomic semantic annotations scattered in many distributed and heterogeneous data sources; such heterogeneity and dispersion hamper the biologists' ability of asking global queries and performing global evaluations. To overcome this problem, we developed a software architecture to create and maintain a Genomic and Proteomic Knowledge Base (GPKB), which integrates several of the most relevant sources of such dispersed information (including Entrez Gene, UniProt, IntAct, Expasy Enzyme, GO, GOA, BioCyc, KEGG, Reactome, and OMIM). Our solution is general, as it uses a flexible, modular, and multilevel global data schema based on abstraction and generalization of integrated data features, and a set of automatic procedures for easing data integration and maintenance, also when the integrated data sources evolve in data content, structure, and number. These procedures also assure consistency, quality, and provenance tracking of all integrated data, and perform the semantic closure of the hierarchical relationships of the integrated biomedical ontologies. At http://www.bioinformatics.deib.polimi.it/GPKB/, a Web interface allows graphical easy composition of queries, although complex, on the knowledge base, supporting also semantic query expansion and comprehensive explorative search of the integrated data to better sustain biomedical knowledge extraction.",
                "authors": [
                    {
                        "name": "Canakoglu A."
                    },
                    {
                        "name": "Ceri S."
                    },
                    {
                        "name": "Masseroli M."
                    }
                ],
                "citationCount": 20,
                "date": "2016-03-01T00:00:00Z",
                "journal": "IEEE/ACM Transactions on Computational Biology and Bioinformatics",
                "title": "Integration and Querying of Genomic and Proteomic Semantic Annotations for Biomedical Knowledge Extraction"
            },
            "pmid": "27045824"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Biological databases",
            "uri": "http://edamontology.org/topic_3071"
        },
        {
            "term": "Data integration and warehousing",
            "uri": "http://edamontology.org/topic_3366"
        }
    ]
}
