{
    "additionDate": "2021-01-18T10:31:41Z",
    "biotoolsCURIE": "biotools:mustool",
    "biotoolsID": "mustool",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "xbendik@fi.muni.cz",
            "name": "Jaroslav Bendík",
            "orcidid": "https://orcid.org/0000-0001-9784-3028",
            "typeEntity": "Person"
        }
    ],
    "description": "Minimal Unsatisfiable Subsets Enumeration Tool.\n\nMUST is a tool for online enumeration of minimal unsatisfiable subsets (MUSes) of a given unsatisfiable set of constraints. The tool currently implements three online MUS enumeration algorithms: MARCO [9], TOME [2], and ReMUS [3], and supports MUS enumeration in three constraint domains: SAT, SMT, and LTL. A paper [1] describing MUST will be presented at TACAS 2020.",
    "editPermission": {
        "type": "private"
    },
    "homepage": "https://github.com/jar-ben/mustool",
    "language": [
        "C++"
    ],
    "lastUpdate": "2021-03-02T08:25:26Z",
    "license": "MIT",
    "name": "MUSTool",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1007/978-3-030-45190-5_8",
            "metadata": {
                "abstract": "© 2020, The Author(s).In many areas of computer science, we are given an unsatisfiable set of constraints with the goal to provide an insight into the unsatisfiability. One of common approaches is to identify minimal unsatisfiable subsets (MUSes) of the constraint set. The more MUSes are identified, the better insight is obtained. However, since there can be up to exponentially many MUSes, their complete enumeration might be intractable. Therefore, we focus on algorithms that enumerate MUSes online, i.e. one by one, and thus can find at least some MUSes even in the intractable cases. Since MUSes find applications in different constraint domains and new applications still arise, there have been proposed several domain agnostic algorithms. Such algorithms can be applied in any constraint domain and thus theoretically serve as ready-to-use solutions for all the emerging applications. However, there are almost no domain agnostic tools, i.e. tools that both implement domain agnostic algorithms and can be easily extended to support any constraint domain. In this work, we close this gap by introducing a domain agnostic tool called MUST. Our tool outperforms other existing domain agnostic tools and moreover, it is even competitive to fully domain specific solutions.",
                "authors": [
                    {
                        "name": "Bendik J."
                    },
                    {
                        "name": "Cerna I."
                    }
                ],
                "citationCount": 6,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Lecture Notes in Computer Science (including subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics)",
                "title": "Must: Minimal unsatisfiable subsets enumeration tool"
            },
            "pmcid": "PMC7439739"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Allergy, clinical immunology and immunotherapeutics",
            "uri": "http://edamontology.org/topic_3400"
        }
    ]
}
