
{
    "credit": [
        {
            "email": "silvio.bicciato@unimore.it",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        },
        {
            "email": "jimmy.caroli@unimore.it",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://gda.unimore.it/help.php"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Gene expression profiling",
                    "uri": "http://edamontology.org/operation_0314"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Differential gene expression analysis",
                    "uri": "http://edamontology.org/operation_3223"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Pharmacology",
                "uri": "http://edamontology.org/topic_0202"
            },
            {
                "term": "Oncology",
                "uri": "http://edamontology.org/topic_2640"
            },
            {
                "term": "Gene expression",
                "uri": "http://edamontology.org/topic_0203"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© The Author(s) 2018. Published by Oxford University Press on behalf of Nucleic Acids Research.Several major screenings of genetic profiling and drug testing in cancer cell lines proved that the integration of genomic portraits and compound activities is effective in discovering new genetic markers of drug sensitivity and clinically relevant anticancer compounds. Despite most genetic and drug response data are publicly available, the availability of user-friendly tools for their integrative analysis remains limited, thus hampering an effective exploitation of this information. Here, we present GDA, a web-based tool for Genomics and Drugs integrated Analysis that combines drug response data for >50 800 compounds with mutations and gene expression profiles across 73 cancer cell lines. Genomic and pharmacological data are integrated through a modular architecture that allows users to identify compounds active towards cancer cell lines bearing a specific genomic background and, conversely, the mutational or transcriptional status of cells responding or not-responding to a specific compound. Results are presented through intuitive graphical representations and supplemented with information obtained from public repositories. As both personalized targeted therapies and drug-repurposing are gaining increasing attention, GDA represents a resource to formulate hypotheses on the interplay between genomic traits and drug response in cancer. GDA is freely available at http://gda.unimore.it/.",
            "authors": [
                "Caroli J.",
                "Sorrentino G.",
                "Forcato M.",
                "Del Sal G.",
                "Bicciato S."
            ],
            "cit_count": 0,
            "doi": "10.1093/nar/gky434",
            "journal": "Nucleic Acids Research",
            "pmid": "29800349",
            "title": "GDA, a web-based tool for Genomics and Drugs integrated analysis",
            "year": "2018-07-02"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:gda",
        "biotoolsID": "gda",
        "description": "The Genomics and Drugs integrated Analysis portal (GDA) combines NCI60 uniquely large number of drug sensitivity data with CCLE and NCI60 gene mutation and expression profiles.",
        "homepage": "http://gda.unimore.it",
        "name": "GDA"
    }
}