{
    "additionDate": "2019-11-14T18:00:00Z",
    "biotoolsCURIE": "biotools:SAnDReS",
    "biotoolsID": "SAnDReS",
    "confidence_flag": "tool",
    "description": "> CORRECT NAME OF TOOL COULD ALSO BE 'statistical analysis docking results', 'affinity', 'protein-targeted', 'machine-learning' | A Computational Tool for Docking | Molegro Virtual Docker for Docking | Machine Learning to Predict Binding Affinity | Make molecular docking reliable, fast, easy, free, and funny with SAnDReS. It is the easiest way to run dependable protein-ligand docking simulations. SAnDReS takes a different approach to docking; it focuses on the simulation of a system composed of an ensemble of crystallographic structures for which ligand binding affinity data is available",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein-protein docking",
                    "uri": "http://edamontology.org/operation_3899"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                },
                {
                    "term": "Protein-ligand docking",
                    "uri": "http://edamontology.org/operation_0482"
                }
            ]
        }
    ],
    "homepage": "https://github.com/azevedolab/sandres",
    "lastUpdate": "2020-12-16T10:40:34Z",
    "license": "GPL-3.0",
    "name": "SAnDReS",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1007/978-1-4939-9752-7_4",
            "metadata": {
                "abstract": "© Springer Science+Business Media, LLC, part of Springer Nature 2019.Since the early 1980s, we have witnessed considerable progress in the development and application of docking programs to assess protein–ligand interactions. Most of these applications had as a goal the identification of potential new binders to protein targets. Another remarkable progress is taking place in the determination of the structures of protein–ligand complexes, mostly using X-ray diffraction crystallography. Considering these developments, we have a favorable scenario for the creation of a computational tool that integrates into one workflow all steps involved in molecular docking simulations. We had these goals in mind when we developed the program SAnDReS. This program allows the integration of all computational features related to modern docking studies into one workflow. SAnDReS not only carries out docking simulations but also evaluates several docking protocols allowing the selection of the best approach for a given protein system. SAnDReS is a free and open-source (GNU General Public License) computational environment for running docking simulations. Here, we describe the combination of SAnDReS and AutoDock4 for protein–ligand docking simulations. AutoDock4 is a free program that has been applied to over a thousand receptor–ligand docking simulations. The dataset described in this chapter is available for downloading at https://github.com/azevedolab/sandres",
                "authors": [
                    {
                        "name": "Bitencourt-Ferreira G."
                    },
                    {
                        "name": "de Azevedo W.F."
                    }
                ],
                "citationCount": 2,
                "date": "2019-01-01T00:00:00Z",
                "journal": "Methods in Molecular Biology",
                "title": "SAnDReS: A computational tool for docking"
            },
            "pmid": "31452098"
        },
        {
            "doi": "10.1007/978-1-4939-9752-7_10",
            "metadata": {
                "abstract": "© Springer Science+Business Media, LLC, part of Springer Nature 2019.Molegro Virtual Docker is a protein-ligand docking simulation program that allows us to carry out docking simulations in a fully integrated computational package. MVD has been successfully applied to hundreds of different proteins, with docking performance similar to other docking programs such as AutoDock4 and AutoDock Vina. The program MVD has four search algorithms and four native scoring functions. Considering that we may have water molecules or not in the docking simulations, we have a total of 32 docking protocols. The integration of the programs SAnDReS (https://github.com/azevedolab/sandres ) and MVD opens the possibility to carry out a detailed statistical analysis of docking results, which adds to the native capabilities of the program MVD. In this chapter, we describe a tutorial to carry out docking simulations with MVD and how to perform a statistical analysis of the docking results with the program SAnDReS. To illustrate the integration of both programs, we describe the redocking simulation focused the cyclin-dependent kinase 2 in complex with a competitive inhibitor.",
                "authors": [
                    {
                        "name": "Bitencourt-Ferreira G."
                    },
                    {
                        "name": "de Azevedo W.F."
                    }
                ],
                "citationCount": 8,
                "date": "2019-01-01T00:00:00Z",
                "journal": "Methods in Molecular Biology",
                "title": "Molegro virtual docker for docking"
            },
            "pmid": "31452104"
        },
        {
            "doi": "10.1007/978-1-4939-9752-7_16",
            "metadata": {
                "abstract": "© Springer Science+Business Media, LLC, part of Springer Nature 2019.Recent progress in the development of scientific libraries with machine-learning techniques paved the way for the implementation of integrated computational tools to predict ligand-binding affinity. The prediction of binding affinity uses the atomic coordinates of protein-ligand complexes. These new computational tools made application of a broad spectrum of machine-learning techniques to study protein-ligand interactions possible. The essential aspect of these machine-learning approaches is to train a new computational model by using technologies such as supervised machine-learning techniques, convolutional neural network, and random forest to mention the most commonly applied methods. In this chapter, we focus on supervised machine-learning techniques and their applications in the development of protein-targeted scoring functions for the prediction of binding affinity. We discuss the development of the program SAnDReS and its application to the creation of machine-learning models to predict inhibition of cyclin-dependent kinase and HIV-1 protease. Moreover, we describe the scoring function space, and how to use it to explain the development of targeted scoring functions.",
                "authors": [
                    {
                        "name": "Bitencourt-Ferreira G."
                    },
                    {
                        "name": "de Azevedo W.F."
                    }
                ],
                "citationCount": 2,
                "date": "2019-01-01T00:00:00Z",
                "journal": "Methods in Molecular Biology",
                "title": "Machine learning to predict binding affinity"
            },
            "pmid": "31452110"
        }
    ],
    "topic": [
        {
            "term": "Molecular modelling",
            "uri": "http://edamontology.org/topic_2275"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        }
    ],
    "validated": 1
}