{
    "additionDate": "2021-06-14T12:45:58Z",
    "biotoolsCURIE": "biotools:chemprops",
    "biotoolsID": "chemprops",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "cate.brinson@duke.edu",
            "name": "L. Catherine Brinson",
            "orcidid": "https://orcid.org/0000-0003-2551-1563",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "ChemProps is a RESTful API enabled database for composite polymer name standardization.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                }
            ]
        }
    ],
    "homepage": "https://materialsmine.org/nm#/ChemProps",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-08-20T07:54:40.573294Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/Duke-MatSci/ChemProps"
        }
    ],
    "name": "ChemProps",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1186/S13321-021-00502-6",
            "metadata": {
                "abstract": "© 2021, The Author(s).The inconsistency of polymer indexing caused by the lack of uniformity in expression of polymer names is a major challenge for widespread use of polymer related data resources and limits broad application of materials informatics for innovation in broad classes of polymer science and polymeric based materials. The current solution of using a variety of different chemical identifiers has proven insufficient to address the challenge and is not intuitive for researchers. This work proposes a multi-algorithm-based mapping methodology entitled ChemProps that is optimized to solve the polymer indexing issue with easy-to-update design both in depth and in width. RESTful API is enabled for lightweight data exchange and easy integration across data systems. A weight factor is assigned to each algorithm to generate scores for candidate chemical names and optimized to maximize the minimum value of the score difference between the ground truth chemical name and the other candidate chemical names. Ten-fold validation is utilized on the 160 training data points to prevent overfitting issues. The obtained set of weight factors achieves a 100% test accuracy on the 54 test data points. The weight factors will evolve as ChemProps grows. With ChemProps, other polymer databases can remove duplicate entries and enable a more accurate “search by SMILES” function by using ChemProps as a common name-to-SMILES translator through API calls. ChemProps is also an excellent tool for auto-populating polymer properties thanks to its easy-to-update design.",
                "authors": [
                    {
                        "name": "Hu B."
                    },
                    {
                        "name": "Lin A."
                    },
                    {
                        "name": "Brinson L.C."
                    }
                ],
                "date": "2021-12-01T00:00:00Z",
                "journal": "Journal of Cheminformatics",
                "title": "ChemProps: A RESTful API enabled database for composite polymer name standardization"
            },
            "pmcid": "PMC7955638",
            "pmid": "33712066"
        }
    ],
    "toolType": [
        "Database portal",
        "Web API"
    ],
    "topic": [
        {
            "term": "Chemistry",
            "uri": "http://edamontology.org/topic_3314"
        },
        {
            "term": "Informatics",
            "uri": "http://edamontology.org/topic_0605"
        },
        {
            "term": "Protein expression",
            "uri": "http://edamontology.org/topic_0108"
        }
    ]
}