
{
    "credit": [
        {
            "email": "jparsons@littlest.co.uk",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://www.jeremyparsons.com/"
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://www.littlest.co.uk/software/bioinf/old_packages/jesam/jesam_paper.html"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Gene expression profile clustering",
                    "uri": "http://edamontology.org/operation_0313"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Sequence alignment",
                    "uri": "http://edamontology.org/operation_0292"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Java",
            "C++",
            "C"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Gene expression",
                "uri": "http://edamontology.org/topic_0203"
            },
            {
                "term": "DNA",
                "uri": "http://edamontology.org/topic_0654"
            },
            {
                "term": "Functional, regulatory and non-coding RNA",
                "uri": "http://edamontology.org/topic_0659"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/jesam-0-8-1-parallel-processing-dna-sequence-comparison-clustering.html"
        }
    ],
    "publication": [
        {
            "abstract": "Motivation: Expressed Sequence Tags (ESTs) are cheap, easy and quick to obtain relative to fill genomic sequencing and currently sample more eukaryotic genes than any other data source. They are particularly useful for developing Sequence Tag Sites (STSs for mapping), polymorphism discovery, disease gene hunting, mass spectrometer proteomics, and most ironically for finding genes and predicting gene structure after the great effort of genomic sequencing. However, ESTs have many problems and the public EST databases contain all the errors and high redundancy intrinsic to the submitted data so it is often found that derived database views, which reduce both errors and redundancy, are more effective starting points for research than the original raw submissions. Existing derived views such as EST cluster databases and consensus databases have never published supporting evidence or intermediary results leading to difficulties trusting, correcting, and customizing the final published database. These difficulties have lead many groups to wastefully repeat the complex intermediary work of others in order to offer slightly different final views. A better approach might be to discover the most expensive common calculations used by all the approaches and then publish all intermediary results. Given a globally accessible database with a suitable component interface, like the JESAM software described in this paper the creation of customized EST-derived databases could be achieved with minimum effort. Results: Databases of EST and full-length mRNA sequences for four model organisms have been self-compared by searching for overlaps consistent with contiguity. The sequence comparisons are performed in parallel using a PVM process farm and previous results are stored to allow incremental updates with minimal effort. The overlap databases have been published with CORBA interfaces to enable flexible global access as demonstrated by example Java applet browsers. Simple cDNA supercluster databases built as alignment database clients are themselves published via CORBA interfaces browsable with prototypical applets. A comparison with UniGene Mouse and Rat databases revealed undesirable features in both and the advantages of contrasting perspectives on complex data. Availability: The software is packaged as two Jar files available from: URL: http://corba.ebi.ac.uk/EST/jesam/jesam.html. One jar contains all the Java source code, and the other contains all the C, C++ and IDL code. Links to working examples of the alignment and cluster viewers (if remote firewall permits) can be found at http://corba.ebi.ac.uk/EST. All the Washington University mouse EST traces are available for browsing at the same URL.",
            "authors": [
                "Parsons J.D.",
                "Rodriguez-Tome P."
            ],
            "cit_count": 13,
            "journal": "Bioinformatics",
            "pmid": "10869029",
            "title": "JESAM: CORBA software components to create and publish EST alignments and clusters",
            "year": "2000-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:jesam",
        "biotoolsID": "jesam",
        "description": "Software components to create and publish EST alignments and clusters.",
        "homepage": "http://www.littlest.co.uk/software/bioinf/old_packages/jesam/jesam_paper.html",
        "name": "JESAM"
    }
}