{
    "additionDate": "2020-01-14T09:07:32Z",
    "biotoolsCURIE": "biotools:Muscle2View",
    "biotoolsID": "Muscle2View",
    "confidence_flag": "high",
    "description": "CellProfiler pipeline for detection of the capillary-to-muscle fiber interface and high-content quantification of fiber type-specific histology.\n\nBecause manual immunohistochemical analysis of features such as skeletal muscle fiber typing, capillaries, myonuclei, and fiber size-related parameters is time consuming and prone to user subjectivity, automatic computational methods could allow for faster and more objective evaluation. Here, we developed Muscle2View, a free CellProfiler-based pipeline that integrates all key fiber-morphological variables, including the novel quantification of the capillary-to-fiber interface, in one single tool. Provided that the images are of sufficient quality and the settings are configured for the specific study, the pipeline allows for automatic and unsupervised analysis of fiber borders, myonuclei, capillaries, and morphometric parameters in a fiber type-specific manner from large batches of images in <10 min tissue sample.\n\n||| HOMEPAGE MISSING!",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                }
            ]
        }
    ],
    "homepage": "https://www.ncbi.nlm.nih.gov/pubmed/?term=31697593",
    "lastUpdate": "2020-01-14T09:07:32Z",
    "name": "Muscle2View",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1152/JAPPLPHYSIOL.00257.2019",
            "metadata": {
                "abstract": "© 2019 the American Physiological Society.Because manual immunohistochemical analysis of features such as skeletal muscle fiber typing, capillaries, myonuclei, and fiber size-related parameters is time consuming and prone to user subjectivity, automatic computational methods could allow for faster and more objective evaluation. Here, we developed Muscle2View, a free CellProfiler-based pipeline that integrates all key fiber-morphological variables, including the novel quantification of the capillaryto-fiber interface, in one single tool. Provided that the images are of sufficient quality and the settings are configured for the specific study, the pipeline allows for automatic and unsupervised analysis of fiber borders, myonuclei, capillaries, and morphometric parameters in a fiber type-specific manner from large batches of images in <10 min/tissue sample. The novel identification of the capillary-to-fiber interface allowed for the calculation of microvascular factors such as capillary contacts (CC), individual capillary-to-fiber ratio (C/Fi), and capillary-to-fiber perimeter exchange (CFPE) index. When comparing the Muscle2View pipeline to manual or semiautomatic analysis, overall the results revealed strong correlations. For several variables, however, there were differences (5-15%) between values computed by manual counting and Muscle2View, suggesting that the methods should not necessarily be used interchangeably. Collectively, we demonstrate that the Muscle2View pipeline can provide unbiased and high-content analysis of muscle cross-sectional immunohistochemistry images. In addition to the classical morphological measurements, the Muscle2View can identify the complex capillary-to-fiber network and myonuclear density in a fiber type-specific manner. This robust analysis is done in one single run within a user-friendly and flexible environment based on the free and widely used image software CellProfiler. NEW & NOTEWORTHY Here, we developed a freely available CellProfiler-based pipeline termed Muscle2View, which provides unbiased, high-content analysis of muscle cross-sectional immunohistochemistry images. In addition to fiber typing, myonuclei counting, and the quantification of fiber type-specific morphological measurements, the Muscle2View pipeline can identify the complex capillaryto-fiber network from a batch of images within minutes. Thus, the Muscle2View is a viable tool for researchers aiming to quantify immunohistochemical variables from skeletal muscle biopsies.",
                "authors": [
                    {
                        "name": "Sanz G."
                    },
                    {
                        "name": "Martinez-Aranda L.M."
                    },
                    {
                        "name": "Tesch P.A."
                    },
                    {
                        "name": "Fernandez-Gonzalo R."
                    },
                    {
                        "name": "Lundberg T.R."
                    }
                ],
                "date": "2019-01-01T00:00:00Z",
                "journal": "Journal of Applied Physiology",
                "title": "Muscle2View, a CellProfiler pipeline for detection of the capillary-to-muscle fiber interface and high-content quantification of fiber type-specific histology"
            },
            "pmid": "31697593"
        }
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ]
}