{
    "additionDate": "2017-12-18T00:09:56Z",
    "biotoolsCURIE": "biotools:olicheck",
    "biotoolsID": "olicheck",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.genomic.ch/index.php"
        }
    ],
    "description": "OliCheck is a program designed to test the validity of potential microarray probes by considering the possibility of cross-hybridization with non-target coding sequences. This analysis can be performed within a single genome or between several different strains/organisms.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Microarray data analysis",
                    "uri": "http://edamontology.org/operation_2495"
                }
            ]
        }
    ],
    "homepage": "http://www.genomic.ch/software.php",
    "language": [
        "Delphi"
    ],
    "lastUpdate": "2018-12-10T12:58:58Z",
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/olicheck-test-validity-potential-microarray-probes.html"
        }
    ],
    "name": "OliCheck",
    "operatingSystem": [
        "Windows"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1186/1471-2164-6-95",
            "metadata": {
                "abstract": "Background: DNA microarray technology is widely used to determine the expression levels of thousands of genes in a single experiment, for a broad range of organisms. Optimal design of immobilized nucleic acids has a direct impact on the reliability of microarray results. However, despite small genome size and complexity, prokaryotic organisms are not frequently studied to validate selected bioinformatics approaches. Relying on parameters shown to affect the hybridization of nucleic acids, we designed freely available software and validated experimentally its performance on the bacterial pathogen Staphylococcus aureus. Results: We describe an efficient procedure for selecting 40-60 mer oligonucleotide probes combining optimal thermodynamic properties with high target specificity, suitable for genomic studies of microbial species. The algorithm for filtering probes from extensive oligonucleotides libraries fitting standard thermodynamic criteria includes positional information of predicted target-probe binding regions. This algorithm efficiently selected probes recognizing homologous gene targets across three different sequenced genomes of Staphylococcus aureus. BLAST analysis of the final selection of 5,427 probes yielded >97%, 93%, and 81% of Staphylococcus aureus genome coverage in strains N315, Mu50, and COL, respectively. A manufactured oligoarray including a subset of control Escherichia coli probes was validated for applications in the fields of comparative genomics and molecular epidemiology, mapping of deletion mutations and transcription profiling. Conclusion: This generic chip-design process merging sequence information from several related genomes improves genome coverage even in conserved regions. © 2005 Charbonnier et al; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Charbonnier Y."
                    },
                    {
                        "name": "Gettler B."
                    },
                    {
                        "name": "Francois P."
                    },
                    {
                        "name": "Bento M."
                    },
                    {
                        "name": "Renzoni A."
                    },
                    {
                        "name": "Vaudaux P."
                    },
                    {
                        "name": "Schlegel W."
                    },
                    {
                        "name": "Schrenzel J."
                    }
                ],
                "citationCount": 94,
                "date": "2005-06-17T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "A generic approach for the design of whole-genome oligoarrays, validated for genomotyping, deletion mapping and gene expression analysis on Staphylococcus aureaus"
            },
            "type": "Primary"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Sequences",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "Organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Probes",
            "uri": "http://edamontology.org/topic_0632"
        }
    ],
    "validated": 1
}