
{
    "credit": [
        {
            "email": "celine.scornavacca@umontpellier.fr",
            "name": "Celine Scornavacca",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://mbb.univ-montp2.fr/MBB/subsection/softExec.php?soft=eccetera"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Phylogenetic tree analysis",
                    "uri": "http://edamontology.org/operation_0324"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Genetics",
                "uri": "http://edamontology.org/topic_3053"
            },
            {
                "term": "Sequence analysis",
                "uri": "http://edamontology.org/topic_0080"
            },
            {
                "term": "Phylogenetics",
                "uri": "http://edamontology.org/topic_3293"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© The Author 2016. Published by Oxford University Press. Gene trees reconstructed from sequence alignments contain poorly supported branches when the phylogenetic signal in the sequences is insufficient to determine them all. When a species tree is available, the signal of gains and losses of genes can be used to correctly resolve the unsupported parts of the gene history. However finding a most parsimonious binary resolution of a non-binary tree obtained by contracting the unsupported branches is NP-hard if transfer events are considered as possible gene scale events, in addition to gene origination, duplication and loss. We propose an exact, parameterized algorithm to solve this problem in single-exponential time, where the parameter is the number of connected branches of the gene tree that show low support from the sequence alignment or, equivalently, the maximum number of children of any node of the gene tree once the low-support branches have been collapsed. This improves on the best known algorithm by an exponential factor. We propose a way to choose among optimal solutions based on the available information. We show the usability of this principle on several simulated and biological datasets. The results are comparable in quality to several other tested methods having similar goals, but our approach provides a lower running time and a guarantee that the produced solution is optimal. Availability and Implementation: Our algorithm has been integrated into the ecceTERA phylogeny package, available at http://mbb.univ-montp2.fr/MBB/download-sources/16-ecceTERA and which can be run online at http://mbb.univ-montp2.fr/MBB/subsection/softExec.php?soft=eccetera.",
            "authors": [
                "Jacox E.",
                "Weller M.",
                "Tannier E.",
                "Scornavacca C."
            ],
            "cit_count": 3,
            "doi": "10.1093/bioinformatics/btw778",
            "journal": "Bioinformatics",
            "title": "Resolution and reconciliation of non-binary gene trees with transfers, duplications and losses",
            "year": "2017-04-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:eccetera",
        "biotoolsID": "eccetera",
        "description": "Resolution and reconciliation of non-binary gene trees with transfers, duplications and losses.",
        "homepage": "http://mbb.univ-montp2.fr/MBB/subsection/softExec.php?soft=eccetera",
        "name": "ecceTERA"
    }
}