{
    "additionDate": "2021-12-13T09:55:38.642518Z",
    "biotoolsCURIE": "biotools:tncentral",
    "biotoolsID": "tncentral",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "mc2126@georgetown.edu",
            "name": "Mick Chandler",
            "orcidid": "https://orcid.org/0000-0002-0292-6662",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "TnCentral is a prokaryotic transposable element database and web portal for transposon analysis.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Transposon prediction",
                    "uri": "http://edamontology.org/operation_0427"
                }
            ]
        }
    ],
    "homepage": "https://tncentral.proteininformationresource.org/",
    "lastUpdate": "2024-11-24T20:14:25.220009Z",
    "name": "TnCentral",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1128/mbio.02060-21",
            "metadata": {
                "abstract": "We describe here the structure and organization of TnCentral (https:// tncentral.proteininformationresource.org/ [or the mirror link at https://tncentral.ncc .unesp.br/]), a web resource for prokaryotic transposable elements (TE). TnCentral currently contains;400 carefully annotated TE, including transposons from the Tn3, Tn7, Tn402, and Tn554 families; compound transposons; integrons; and associated insertion sequences (IS). These TE carry passenger genes, including genes conferring resistance to over 25 classes of antibiotics and nine types of heavy metal, as well as genes responsible for pathogenesis in plants, toxin/antitoxin gene pairs, transcription factors, and genes involved in metabolism. Each TE has its own entry page, providing details about its transposition genes, passenger genes, and other sequence features required for transposition, as well as a graphical map of all features. TnCentral content can be browsed and queried through text- and sequence-based searches with a graphic output. We describe three use cases, which illustrate how the search interface, results tables, and entry pages can be used to explore and compare TE. TnCentral also includes downloadable software to facilitate user-driven identification, with manual annotation, of certain types of TE in genomic sequences. Through the TnCentral homepage, users can also access TnPedia, which provides comprehensive reviews of the major TE families, including an extensive general section and specialized sections with descriptions of insertion sequence and transposon families. TnCentral and TnPedia are intuitive resources that can be used by clinicians and scientists to assess TE diversity in clinical, veterinary, and environmental samples. IMPORTANCE The ability of bacteria to undergo rapid evolution and adapt to changing environmental circumstances drives the public health crisis of multiple antibiotic resistance, as well as outbreaks of disease in economically important agricultural crops and animal husbandry. Prokaryotic transposable elements (TE) play a critical role in this. Many carry “passenger genes” (not required for the transposition process) conferring resistance to antibiotics or heavy metals or causing disease in plants and animals. Passenger genes are spread by normal TE transposition activities and by insertion into plasmids, which then spread via conjugation within and across bacterial populations. Thus, an understanding of TE composition and transposition mechanisms is key to developing strategies to combat bacterial pathogenesis. Toward this end, we have developed TnCentral, a bioinformatics resource dedicated to describing and exploring the structural and functional features of prokaryotic TE whose use is intuitive and accessible to users with or without bioinformatics expertise.",
                "authors": [
                    {
                        "name": "Alvarenga D.O."
                    },
                    {
                        "name": "Chandlere M."
                    },
                    {
                        "name": "Huang H."
                    },
                    {
                        "name": "McGann P."
                    },
                    {
                        "name": "Ross K."
                    },
                    {
                        "name": "Snesrud E."
                    },
                    {
                        "name": "Varani A.M."
                    },
                    {
                        "name": "Wu C."
                    },
                    {
                        "name": "Zhang J."
                    }
                ],
                "citationCount": 65,
                "date": "2021-10-01T00:00:00Z",
                "journal": "mBio",
                "title": "TnCentral: a Prokaryotic Transposable Element Database and Web Portal for Transposon Analysis"
            },
            "pmcid": "PMC8546635",
            "pmid": "34517763",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Bioinformatics portal"
    ],
    "topic": [
        {
            "term": "Agricultural science",
            "uri": "http://edamontology.org/topic_3810"
        },
        {
            "term": "Mobile genetic elements",
            "uri": "http://edamontology.org/topic_0798"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ]
}
