{
    "accessibility": "Open access",
    "additionDate": "2022-06-07T06:52:27.764208Z",
    "biotoolsCURIE": "biotools:deepidp-2l",
    "biotoolsID": "deepidp-2l",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "bliu@bliulab.net",
            "name": "Bin Liu",
            "typeEntity": "Person"
        }
    ],
    "description": "Tool for protein intrinsically disordered region prediction by combining convolutional attention network and hierarchical attention network.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                },
                {
                    "term": "Protein disorder prediction",
                    "uri": "http://edamontology.org/operation_3904"
                },
                {
                    "term": "Protein secondary structure prediction (coils)",
                    "uri": "http://edamontology.org/operation_0470"
                }
            ]
        }
    ],
    "homepage": "http://bliulab.net/DeepIDP-2L/",
    "lastUpdate": "2022-06-07T06:52:27.766888Z",
    "name": "DeepIDP-2L",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAB810",
            "metadata": {
                "abstract": "© The Author(s) 2021. Published by Oxford University Press. All rights reserved.Motivation: Intrinsically disordered regions (IDRs) are widely distributed in proteins. Accurate prediction of IDRs is critical for the protein structure and function analysis. The IDRs are divided into long disordered regions (LDRs) and short disordered regions (SDRs) according to their lengths. Previous studies have shown that LDRs and SDRs have different proprieties. However, the existing computational methods fail to extract different features for LDRs and SDRs separately. As a result, they achieve unstable performance on datasets with different ratios of LDRs and SDRs. Results: In this study, a two-layer predictor was proposed called DeepIDP-2L. In the first layer, two kinds of attention-based models are used to extract different features for LDRs and SDRs, respectively. The hierarchical attention network is used to capture the distribution pattern features of LDRs, and convolutional attention network is used to capture the local correlation features of SDRs. The second layer of DeepIDP-2L maps the feature extracted in the first layer into a new feature space. Convolutional network and bidirectional long short term memory are used to capture the local and long-range information for predicting both SDRs and LDRs. Experimental results show that DeepIDP-2L can achieve more stable performance than other exiting predictors on independent test sets with different ratios of SDRs and LDRs.",
                "authors": [
                    {
                        "name": "Liu B."
                    },
                    {
                        "name": "Pang Y.-H."
                    },
                    {
                        "name": "Tang Y.-J."
                    }
                ],
                "citationCount": 1,
                "date": "2022-03-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "DeepIDP-2L: Protein intrinsically disordered region prediction by combining convolutional attention network and hierarchical attention network"
            },
            "pmid": "34864847"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Protein disordered structure",
            "uri": "http://edamontology.org/topic_3538"
        },
        {
            "term": "Structure prediction",
            "uri": "http://edamontology.org/topic_0082"
        },
        {
            "term": "X-ray diffraction",
            "uri": "http://edamontology.org/topic_2828"
        }
    ],
    "validated": 1
}
