{
    "additionDate": "2020-01-09T17:30:03Z",
    "biotoolsCURIE": "biotools:iRNA-m2G",
    "biotoolsID": "iRNA-m2G",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "chenweiimu@gmail.com",
            "name": "Wei Chen",
            "typeEntity": "Person"
        },
        {
            "email": "hlin@uestc.edu.cn",
            "name": "Hao Lin",
            "typeEntity": "Person"
        }
    ],
    "description": "Identifying N2-methylguanosine Sites Based on Sequence-Derived Information.\n\niRNA-m2G: identifying N2-methylguanosine sites.\n\nThe benchmark datasets that uesed to train and test the proposed model are provided on this page.\n\nBenchmark dataset S1 contains 143 m2G site containing sequences and 143 non-m2G site containing sequences from H. sapiens, M. musculus and S. cerevisiae, respectively.\n\nBenchmark dataset S2 contains 143 non-m2G site containing sequences (same as dataset S1) and 1246 non-m2G site containing sequences from H. sapiens, M. musculus and S. cerevisiae, respectively",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                }
            ]
        }
    ],
    "homepage": "http://lin-group.cn/server/iRNA-m2G.php",
    "lastUpdate": "2020-12-14T13:20:58Z",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "http://lin-group.cn/server/iRNA-m2G/data.htm"
        }
    ],
    "name": "iRNA-m2G",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1016/J.OMTN.2019.08.023",
            "metadata": {
                "abstract": "© 2019 The AuthorsRNA N2-methylguanosine (m2G) is one kind of posttranscriptional modification and plays crucial roles in the control and stabilization of tRNA. However, our knowledge about the biological functions of m2G is still limited. The key step of revealing its new function is to recognize the m2G sites in the transcriptome. Since there is no effective method for detecting m2G sites, it is desirable to develop new methods to identify m2G sites. In this study, a computational predictor called iRNA-m2G was proposed to identify m2G sites in eukaryotic transcriptomes. In iRNA-m2G, the RNA sequences were encoded by using nucleotide chemical property and accumulated nucleotide frequency. iRNA-m2G was not only validated by the rigorous jackknife test on the benchmark dataset but also examined by performing cross-species validations. In addition, iRNA-m2G was also tested on an independent dataset. It was found that the accuracies obtained by iRNA-m2G were all quite promising in these tests, indicating that the proposed method could become a powerful tool for identifying m2G sites. Finally, a user-friendly web server for iRNA-m2G is freely accessible at http://lin-group.cn/server/iRNA-m2G.php.",
                "authors": [
                    {
                        "name": "Chen W."
                    },
                    {
                        "name": "Song X."
                    },
                    {
                        "name": "Lv H."
                    },
                    {
                        "name": "Lin H."
                    }
                ],
                "citationCount": 15,
                "date": "2019-12-06T00:00:00Z",
                "journal": "Molecular Therapy - Nucleic Acids",
                "title": "iRNA-m2G: Identifying N2-methylguanosine Sites Based on Sequence-Derived Information"
            },
            "pmcid": "PMC6796771",
            "pmid": "31581049"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Sequence sites, features and motifs",
            "uri": "http://edamontology.org/topic_0160"
        }
    ],
    "validated": 1
}