{
    "accessibility": "Open access",
    "additionDate": "2021-11-28T14:17:44.661841Z",
    "biotoolsCURIE": "biotools:genovault",
    "biotoolsID": "genovault",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "rajendra@cdac.in",
            "name": "Rajendra Joshi",
            "orcidid": "https://orcid.org/0000-0003-1299-0091",
            "typeEntity": "Person"
        }
    ],
    "description": "GenoVault is a private cloud-based central repository for storage and retrieval of genomics data generated in various research labs in various organizations. The solution is delivered in the form of a software suite called “GenoVault”, that enables quick archival and retrieval of data along with analytical support.",
    "download": [
        {
            "type": "Downloads page",
            "url": "https://www.cdac.in/index.aspx?id=bio_products"
        }
    ],
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                }
            ]
        }
    ],
    "homepage": "https://github.com/bioinformatics-cdac/GenoVault",
    "lastUpdate": "2021-11-28T14:17:44.664847Z",
    "name": "GenoVault",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1186/S13040-021-00268-5",
            "metadata": {
                "abstract": "© 2021, The Author(s).GenoVault is a cloud-based repository for handling Next Generation Sequencing (NGS) data. It is developed using OpenStack-based private cloud with various services like keystone for authentication, cinder for block storage, neutron for networking and nova for managing compute instances for the Cloud. GenoVault uses object-based storage, which enables data to be stored as objects instead of files or blocks for faster retrieval from different distributed object nodes. Along with a web-based interface, a JavaFX-based desktop client has also been developed to meet the requirements of large file uploads that are usually seen in NGS datasets. Users can store files in their respective object-based storage areas and the metadata provided by the user during file uploads is used for querying the database. GenoVault repository is designed taking into account future needs and hence can scale both vertically and horizontally using OpenStack-based cloud features. Users have an option to make the data shareable to the public or restrict the access as private. Data security is ensured as every container is a separate entity in object-based storage architecture which is also supported by Secure File Transfer Protocol (SFTP) for data upload and download. The data is uploaded by the user in individual containers that include raw read files (fastq), processed alignment files (bam, sam, bed) and the output of variation detection (vcf). GenoVault architecture allows verification of the data in terms of integrity and authentication before making it available to collaborators as per the user’s permissions. GenoVault is useful for maintaining the organization-wide NGS data generated in various labs which is not yet published and submitted to public repositories like NCBI. GenoVault also provides support to share NGS data among the collaborating institutions. GenoVault can thus manage vast volumes of NGS data on any OpenStack-based private cloud.",
                "authors": [
                    {
                        "name": "Bhadhadhara K."
                    },
                    {
                        "name": "Bharti N."
                    },
                    {
                        "name": "Hesarur S."
                    },
                    {
                        "name": "Jain S."
                    },
                    {
                        "name": "Joshi R."
                    },
                    {
                        "name": "Kasibhatla S.M."
                    },
                    {
                        "name": "Saxena A."
                    },
                    {
                        "name": "Sonavane U."
                    }
                ],
                "date": "2021-12-01T00:00:00Z",
                "journal": "BioData Mining",
                "title": "GenoVault: a cloud based genomics repository"
            },
            "pmcid": "PMC8319889",
            "pmid": "34325724"
        }
    ],
    "topic": [
        {
            "term": "Computer science",
            "uri": "http://edamontology.org/topic_3316"
        },
        {
            "term": "Data security",
            "uri": "http://edamontology.org/topic_3263"
        },
        {
            "term": "Database management",
            "uri": "http://edamontology.org/topic_3489"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ],
    "validated": 1
}
