{
    "additionDate": "2021-01-18T11:19:31Z",
    "biotoolsCURIE": "biotools:fiddle",
    "biotoolsID": "fiddle",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "rene.bernard@charite.de",
            "name": "René Bernard",
            "orcidid": "https://orcid.org/0000-0003-3265-2372",
            "typeEntity": "Person"
        }
    ],
    "description": "Fiddle (file drawer data liberation effort) is a tool to combat publication bias by getting research out of the file drawer and into the scientific community. Fiddle is a “matchmaking” tool designed to help researchers to identify the publication format that will work best for a particular dataset that may be hard to publish in traditional journals.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                },
                {
                    "term": "Format detection",
                    "uri": "http://edamontology.org/operation_3357"
                }
            ]
        }
    ],
    "homepage": "http://s-quest.bihealth.org/fiddle/",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-03-11T08:49:46Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/quest-bih/fiddle"
        }
    ],
    "name": "Fiddle",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1042/CS20201125",
            "metadata": {
                "abstract": "© 2020 The Author(s).Statistically significant findings are more likely to be published than non-significant or null findings, leaving scientists and healthcare personnel to make decisions based on distorted scientific evidence. Continuously expanding ´file drawers’ of unpublished data from well-designed experiments waste resources creates problems for researchers, the scientific community and the public. There is limited awareness of the negative impact that publication bias and selective reporting have on the scientific literature. Alternative publication formats have recently been introduced that make it easier to publish research that is difficult to publish in traditional peer reviewed journals. These include micropublications, data repositories, data journals, preprints, publishing platforms, and journals focusing on null or neutral results. While these alternative formats have the potential to reduce publication bias, many scientists are unaware that these formats exist and don’t know how to use them. Our open source file drawer data liberation effort (fiddle) tool (RRID:SCR 017327 available at: http://s-quest.bihealth.org/fiddle/) is a match-making Shiny app designed to help biomedical researchers to identify the most appropriate publication format for their data. Users can search for a publication format that meets their needs, compare and contrast different publication formats, and find links to publishing platforms. This tool will assist scientists in getting otherwise inaccessible, hidden data out of the file drawer into the scientific community and literature. We briefly highlight essential details that should be included to ensure reporting quality, which will allow others to use and benefit from research published in these new formats.",
                "authors": [
                    {
                        "name": "Bernard R."
                    },
                    {
                        "name": "Weissgerber T.L."
                    },
                    {
                        "name": "Bobrov E."
                    },
                    {
                        "name": "Winham S.J."
                    },
                    {
                        "name": "Dirnagl U."
                    },
                    {
                        "name": "Riedel N."
                    }
                ],
                "date": "2020-10-01T00:00:00Z",
                "journal": "Clinical Science",
                "title": "fiddle: a tool to combat publication bias by getting research out of the file drawer and into the scientific community"
            },
            "pmcid": "PMC7593522",
            "pmid": "33111948"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Literature and language",
            "uri": "http://edamontology.org/topic_3068"
        },
        {
            "term": "Medicine",
            "uri": "http://edamontology.org/topic_3303"
        },
        {
            "term": "Preclinical and clinical studies",
            "uri": "http://edamontology.org/topic_3379"
        }
    ]
}