
{
    "credit": [
        {
            "email": "admin@ezbiocloud.net",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://hpc.ilri.cgiar.org/using-the-cluster"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence analysis",
                    "uri": "http://edamontology.org/operation_2403"
                }
            ]
        }
    ],
    "labels": {
        "collectionID": [
            "EBI Training Tools"
        ],
        "language": [
            "R"
        ],
        "operatingSystem": [
            "Linux"
        ],
        "toolType": [
            "Desktop application"
        ],
        "topic": [
            {
                "term": "Metagenomics",
                "uri": "http://edamontology.org/topic_3174"
            },
            {
                "term": "Transcriptomics",
                "uri": "http://edamontology.org/topic_3308"
            }
        ]
    },
    "publication": [
        {
            "abstract": "Metagenomic and metatranscriptomic shotgun sequencing techniques are gaining popularity as more cost-effective next-generation sequencing technologies become commercially available. The initial stage of bioinfor-matic analysis generally involves the identification of phylogenetic markers such as ribosomal RNA genes. The sequencing reads that do not code for rRNA can then be used for protein-based analysis. Hidden Markov model is a well-known method for pattern recognition. Hidden Markov models that are trained on well-curated rRNA sequence databases have been successfully used to identify DNA sequence coding for rRNAs in pro-karyotes. Here, we introduce rRNASelector, which is a computer program for selecting rRNA genes from massive metagenomic and metatranscriptomic sequences using hidden Markov models. The program successfully identified prokaryotic 5S, 26S, and 23S rRNA genes from Roche 454 FLX Titanium-based metagenomic and metatranscriptomic libraries. The rRNASelector program is available at http://sw.ezbiocloud.net/rrnaselector. © 2011 The Microbiological Society of Korea and Springer-Verlag Berlin Heidelberg.",
            "authors": [
                "Lee J.-H.",
                "Yi H.",
                "Chun J."
            ],
            "cit_count": 23,
            "doi": "10.1007/s12275-011-1213-z",
            "journal": "Journal of Microbiology",
            "title": "rRNASelector: A computer program for selecting ribosomal RNA encoding sequences from metagenomic and metatranscriptomic shotgun libraries",
            "year": "2011-08-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:rrnaselector",
        "biotoolsID": "rrnaselector",
        "description": "A computer program for selecting rRNA genes from metagenomic and metatranscriptomic sequences.",
        "homepage": "http://hpc.ilri.cgiar.org/rrnaselector-software",
        "name": "rRNASelector"
    }
}