{
    "accessibility": "Restricted access",
    "additionDate": "2019-11-14T18:26:34Z",
    "biotoolsCURIE": "biotools:ImpRes",
    "biotoolsID": "ImpRes",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "louise.hull@kcl.ac.uk",
            "name": "Louise Hull",
            "orcidid": "https://orcid.org/0000-0003-4660-4005",
            "typeEntity": "Person"
        }
    ],
    "description": "Development, application, feasibility and preliminary evaluation of the implementation science research development (ImpRes) tool and guide | BACKGROUND:Designing implementation research can be a complex and daunting task, especially for applied health researchers who have not received specialist training in implementation science. We developed the Implementation Science Research Development (ImpRes) tool and supplementary guide to address this challenge and provide researchers with a systematic approach to designing implementation research. METHODS:A multi-method and multi-stage approach was employed. An international, multidisciplinary expert panel engaged in an iterative brainstorming and consensus-building process to generate core domains of the ImpRes tool, representing core implementation science principles and concepts that researchers should consider when designing implementation research",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://www.ncbi.nlm.nih.gov/pubmed/?term=31412887",
    "lastUpdate": "2020-12-14T09:43:18Z",
    "name": "ImpRes",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S13012-019-0897-Z",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Designing implementation research can be a complex and daunting task, especially for applied health researchers who have not received specialist training in implementation science. We developed the Implementation Science Research Development (ImpRes) tool and supplementary guide to address this challenge and provide researchers with a systematic approach to designing implementation research. Methods: A multi-method and multi-stage approach was employed. An international, multidisciplinary expert panel engaged in an iterative brainstorming and consensus-building process to generate core domains of the ImpRes tool, representing core implementation science principles and concepts that researchers should consider when designing implementation research. Simultaneously, an iterative process of reviewing the literature and expert input informed the development and content of the tool. Once consensus had been reached, specialist expert input was sought on involving and engaging patients/service users; and economic evaluation. ImpRes was then applied to 15 implementation and improvement science projects across the National Institute of Health Research (NIHR) Collaboration for Leadership in Applied Health Research and Care (CLAHRC) South London, a research organisation in London, UK. Researchers who applied the ImpRes tool completed an 11-item questionnaire evaluating its structure, content and usefulness. Results: Consensus was reached on ten implementation science domains to be considered when designing implementation research. These include implementation theories, frameworks and models, determinants of implementation, implementation strategies, implementation outcomes and unintended consequences. Researchers who used the ImpRes tool found it useful for identifying project areas where implementation science is lacking (median 5/5, IQR 4-5) and for improving the quality of implementation research (median 4/5, IQR 4-5) and agreed that it contained the key components that should be considered when designing implementation research (median 4/5, IQR 4-4). Qualitative feedback from researchers who applied the ImpRes tool indicated that a supplementary guide was needed to facilitate use of the tool. Conclusions: We have developed a feasible and acceptable tool, and supplementary guide, to facilitate consideration and incorporation of core principles and concepts of implementation science in applied health implementation research. Future research is needed to establish whether application of the tool and guide has an effect on the quality of implementation research.",
                "authors": [
                    {
                        "name": "Bakolis I."
                    },
                    {
                        "name": "Davis R."
                    },
                    {
                        "name": "Goulding L."
                    },
                    {
                        "name": "Healey A."
                    },
                    {
                        "name": "Hull L."
                    },
                    {
                        "name": "Khadjesari Z."
                    },
                    {
                        "name": "Sevdalis N."
                    }
                ],
                "citationCount": 16,
                "date": "2019-08-14T00:00:00Z",
                "journal": "Implementation Science",
                "title": "Designing high-quality implementation research: Development, application, feasibility and preliminary evaluation of the implementation science research development (ImpRes) tool and guide"
            },
            "pmcid": "PMC6693182",
            "pmid": "31412887"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Medicines research and development",
            "uri": "http://edamontology.org/topic_3376"
        },
        {
            "term": "Ontology and terminology",
            "uri": "http://edamontology.org/topic_0089"
        },
        {
            "term": "Psychiatry",
            "uri": "http://edamontology.org/topic_3419"
        }
    ],
    "validated": 1
}
