{
    "name": "ChromaSig", 
    "description": "An unsupervised learning method, which finds, in an unbiased fashion, commonly occurring chromatin signatures in both tiling microarray and sequencing data.", 
    "homepage": "http://bioinformatics-renlab.ucsd.edu/rentrac/wiki/ChromaSig", 
    "biotoolsID": "chromasig", 
    "biotoolsCURIE": "biotools:chromasig", 
    "version": [], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_0239", 
                    "term": "Sequence motif recognition"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Command-line tool"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_3179", 
            "term": "ChIP-on-chip"
        }, 
        {
            "uri": "http://edamontology.org/topic_3656", 
            "term": "Immunoprecipitation experiment"
        }
    ], 
    "operatingSystem": [], 
    "language": [
        "Perl", 
        "C"
    ], 
    "license": null, 
    "collectionID": [], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [], 
    "download": [], 
    "documentation": [], 
    "publication": [
        {
            "doi": null, 
            "pmid": "18927605", 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "ChromaSig: A probabilistic approach to finding common chromatin signatures in the human genome", 
                "abstract": "Computational methods to identify functional genomic elements using genetic information have been very successful in determining gene structure and in identifying a handful of cis-regulatory elements. But the vast majority of regulatory elements have yet to be discovered, and it has become increasingly apparent that their discovery will not come from using genetic information alone. Recently, high-throughput technologies have enabled the creation of information-rich epigenetic maps, most notably for histone modifications. However, tools that search for functional elements using this epigenetic information have been lacking. Here, we describe an unsupervised learning method called ChromaSig to find, in an unbiased fashion, commonly occurring chromatin signatures in both tiling microarray and sequencing data. Applying this algorithm to nine chromatin marks across a 1% sampling of the human genome in HeLa cells, we recover eight clusters of distinct chromatin signatures, five of which correspond to known patterns associated with transcriptional promoters and enhancers. Interestingly, we observe that the distinct chromatin signatures found at enhancers mark distinct functional classes of enhancers in terms of transcription factor and coactivator binding. In addition, we identify three clusters of novel chromatin signatures that contain evolutionarily conserved sequences and potential cis-regulatory elements. Applying ChromaSig to a panel of 21 chromatin marks mapped genomewide by ChIP-Seq reveals 16 classes of genomic elements marked by distinct chromatin signatures. Interestingly, four classes containing enrichment for repressive histone modifications appear to be locally heterochromatic sites and are enriched in quickly evolving regions of the genome. The utility of this approach in uncovering novel, functionally significant genomic elements will aid future efforts of genome annotation via chromatin modifications. © 2008 Hon et al.", 
                "date": "2008-10-01T00:00:00Z", 
                "citationCount": 103, 
                "authors": [
                    {
                        "name": "Hon G."
                    }, 
                    {
                        "name": "Ren B."
                    }, 
                    {
                        "name": "Wang W."
                    }
                ], 
                "journal": "PLoS Computational Biology"
            }
        }
    ], 
    "credit": [], 
    "owner": "seqwiki_import", 
    "additionDate": "2017-01-13T13:14:02Z", 
    "lastUpdate": "2018-12-10T12:58:37Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 1, 
    "homepage_status": 1, 
    "elixir_badge": 0
}