{
    "additionDate": "2018-08-26T10:47:46Z",
    "biotoolsCURIE": "biotools:comptox_chemistry_dashboard",
    "biotoolsID": "comptox_chemistry_dashboard",
    "credit": [
        {
            "email": "Williams.antony@epa.gov",
            "name": "Antony J. Williams",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Community data resource for environmental chemistry.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://www.epa.gov/aboutepa"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                }
            ]
        }
    ],
    "homepage": "https://comptox.epa.gov/dashboard",
    "lastUpdate": "2018-12-10T12:59:01Z",
    "name": "CompTox Chemistry Dashboard",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1186/s13321-017-0247-6",
            "metadata": {
                "abstract": "© 2017 The Author(s).Despite an abundance of online databases providing access to chemical data, there is increasing demand for high-quality, structure-curated, open data to meet the various needs of the environmental sciences and computational toxicology communities. The U.S. Environmental Protection Agency's (EPA) web-based CompTox Chemistry Dashboard is addressing these needs by integrating diverse types of relevant domain data through a cheminformatics layer, built upon a database of curated substances linked to chemical structures. These data include physicochemical, environmental fate and transport, exposure, usage, in vivo toxicity, and in vitro bioassay data, surfaced through an integration hub with link-outs to additional EPA data and public domain online resources. Batch searching allows for direct chemical identifier (ID) mapping and downloading of multiple data streams in several different formats. This facilitates fast access to available structure, property, toxicity, and bioassay data for collections of chemicals (hundreds to thousands at a time). Advanced search capabilities are available to support, for example, non-targeted analysis and identification of chemicals using mass spectrometry. The contents of the chemistry database, presently containing ~ 760,000 substances, are available as public domain data for download. The chemistry content underpinning the Dashboard has been aggregated over the past 15 years by both manual and auto-curation techniques within EPA's DSSTox project. DSSTox chemical content is subject to strict quality controls to enforce consistency among chemical substance-structure identifiers, as well as list curation review to ensure accurate linkages of DSSTox substances to chemical lists and associated data. The Dashboard, publicly launched in April 2016, has expanded considerably in content and user traffic over the past year. It is continuously evolving with the growth of DSSTox into high-interest or data-rich domains of interest to EPA, such as chemicals on the Toxic Substances Control Act listing, while providing the user community with a flexible and dynamic web-based platform for integration, processing, visualization and delivery of data and resources. The Dashboard provides support for a broad array of research and regulatory programs across the worldwide community of toxicologists and environmental scientists.[Figure not available: see fulltext.]",
                "authors": [
                    {
                        "name": "Williams A.J."
                    },
                    {
                        "name": "Grulke C.M."
                    },
                    {
                        "name": "Edwards J."
                    },
                    {
                        "name": "McEachran A.D."
                    },
                    {
                        "name": "Mansouri K."
                    },
                    {
                        "name": "Baker N.C."
                    },
                    {
                        "name": "Patlewicz G."
                    },
                    {
                        "name": "Shah I."
                    },
                    {
                        "name": "Wambaugh J.F."
                    },
                    {
                        "name": "Judson R.S."
                    },
                    {
                        "name": "Richard A.M."
                    }
                ],
                "citationCount": 239,
                "date": "2017-11-28T00:00:00Z",
                "journal": "Journal of Cheminformatics",
                "title": "The CompTox Chemistry Dashboard: A community data resource for environmental chemistry"
            }
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Cheminformatics",
            "uri": "http://edamontology.org/topic_2258"
        },
        {
            "term": "Compound libraries and screening",
            "uri": "http://edamontology.org/topic_3343"
        },
        {
            "term": "Data management",
            "uri": "http://edamontology.org/topic_3071"
        }
    ],
    "validated": 1
}