{
    "additionDate": "2019-11-14T19:40:41Z",
    "biotoolsCURIE": "biotools:py2DIC",
    "biotoolsID": "py2DIC",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "valeria.belloni@uniroma1.it",
            "name": "Valeria Belloni",
            "orcidid": "https://orcid.org/0000-0003-4765-0281",
            "typeEntity": "Person"
        }
    ],
    "description": "A New Free and Open Source Software for Displacement and Strain Measurements in the Field of Experimental Mechanics | py2DIC is a free and open source software for 2D DIC developed at the Geodesy and Geomatics Division, University of Rome \"La Sapienza\" | pydic is a free suite of python tools for local digital image correlation analysis",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                },
                {
                    "term": "Expression correlation analysis",
                    "uri": "http://edamontology.org/operation_3463"
                }
            ]
        }
    ],
    "homepage": "http://github.com/Geod-Geom/py2DIC/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-12-10T12:53:20Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://gitlab.com/damien.andre/pydic"
        }
    ],
    "name": "py2DIC",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.3390/S19183832",
            "metadata": {
                "abstract": "© 2019 by the authors. Licensee MDPI, Basel, Switzerland.Thanks to the advances in computer power, memory storage and the availability of low-cost and high resolution digital cameras, Digital Image Correlation (DIC) is currently one of the most used optical and non-contact techniques for measuring material deformations. A free and open source 2D DIC software, named py2DIC, was developed at the Geodesy and Geomatics Division of the Sapienza University of Rome. Implemented in Python, the software is based on the template matching method and computes the 2D displacements and strains of samples subjected to mechanical loading. In this work, the potentialities of py2DIC were evaluated by processing two different sets of experimental data and comparing the results with other three well known DIC software packages Ncorr, Vic-2D and DICe. Moreover, an accuracy assessment was performed comparing the results with the values independently measured by a strain gauge fixed on one of the samples. The results demonstrate the possibility of successfully characterizing the deformation mechanism of the investigated materials, highlighting the pros and cons of each software package.",
                "authors": [
                    {
                        "name": "Belloni V."
                    },
                    {
                        "name": "Ravanelli R."
                    },
                    {
                        "name": "Nascetti A."
                    },
                    {
                        "name": "Rita M.D."
                    },
                    {
                        "name": "Mattei D."
                    },
                    {
                        "name": "Crespi M."
                    }
                ],
                "citationCount": 3,
                "date": "2019-09-02T00:00:00Z",
                "journal": "Sensors (Switzerland)",
                "title": "Py2dic: A new free and open source software for displacement and strain measurements in the field of experimental mechanics"
            },
            "pmcid": "PMC6766978",
            "pmid": "31491860"
        }
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        }
    ],
    "validated": 1
}