{
    "additionDate": "2021-01-18T11:49:02Z",
    "biotoolsCURIE": "biotools:asymmetron",
    "biotoolsID": "asymmetron",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "nadav.ahituv@ucsf.edu",
            "name": "Nadav Ahituv",
            "typeEntity": "Person"
        }
    ],
    "description": "Asymmetron is a toolkit for the identifcation of asymmetry patterns in biological sequences. Asymmetron can identify strand asymmetries within consecutive occurrences of a single genomic element and for pairs of overlapping and non-overlapping genomic elements. It can also measure strand asymmetries of genomic elements relative to transcriptional and replicative orientations. Asymmetron can assign strand orientation to third features such as mutations, by orienting them relative to other genomic elements.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://asymmetron.readthedocs.io/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "DNA transcription",
                    "uri": "http://edamontology.org/operation_0372"
                },
                {
                    "term": "Sequence motif recognition",
                    "uri": "http://edamontology.org/operation_0239"
                },
                {
                    "term": "Transcription factor binding site prediction",
                    "uri": "http://edamontology.org/operation_0445"
                },
                {
                    "term": "cis-regulatory element prediction",
                    "uri": "http://edamontology.org/operation_0441"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Ahituv-lab/Asymmetron",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-01-28T21:00:31Z",
    "license": "Apache-2.0",
    "name": "Asymmetron",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/NAR/GKAA1052",
            "metadata": {
                "abstract": "© 2021 The Author(s) 2020. Published by Oxford University Press on behalf of Nucleic Acids Research.DNA strand asymmetries can have a major effect on several biological functions, including replication, transcription and transcription factor binding. As such, DNA strand asymmetries and mutational strand bias can provide information about biological function. However, a versatile tool to explore this does not exist. Here, we present Asymmetron, a user-friendly computational tool that performs statistical analysis and visualizations for the evaluation of strand asymmetries. Asymmetron takes as input DNA features provided with strand annotation and outputs strand asymmetries for consecutive occurrences of a single DNA feature or between pairs of features. We illustrate the use of Asymmetron by identifying transcriptional and replicative strand asymmetries of germline structural variant breakpoints. We also show that the orientation of the binding sites of 45% of human transcription factors analyzed have a significant DNA strand bias in transcribed regions, that is also corroborated in ChIP-seq analyses, and is likely associated with transcription. In summary, we provide a novel tool to assess DNA strand asymmetries and show how it can be used to derive new insights across a variety of biological disciplines.",
                "authors": [
                    {
                        "name": "Ahituv N."
                    },
                    {
                        "name": "Georgakopoulos-Soares I."
                    },
                    {
                        "name": "Hemberg M."
                    },
                    {
                        "name": "Matharu N."
                    },
                    {
                        "name": "Mouratidis I."
                    },
                    {
                        "name": "Parada G.E."
                    }
                ],
                "date": "2021-01-11T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "Asymmetron: A toolkit for the identification of strand asymmetry patterns in biological sequences"
            },
            "pmid": "33211865"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "ChIP-seq",
            "uri": "http://edamontology.org/topic_3169"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ]
}
