{
    "additionDate": "2022-09-13T17:37:56.065660Z",
    "biotoolsCURIE": "biotools:edotrans",
    "biotoolsID": "edotrans",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "j.loetsch@em.uni-frankfurt.de",
            "name": "Jörn Lötsch",
            "typeEntity": "Person"
        }
    ],
    "description": "A data transformation method which takes into account the special property of scale non-invariance with a breakpoint at 1 of the Euclidean distance.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "Principal component visualisation",
                    "uri": "http://edamontology.org/operation_2939"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://cran.r-project.org/package=EDOtrans",
    "language": [
        "R"
    ],
    "lastUpdate": "2024-11-24T15:39:46.637892Z",
    "license": "GPL-3.0",
    "name": "EDOtrans",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1186/s12859-022-04769-w",
            "metadata": {
                "abstract": "Background: Data transformations are commonly used in bioinformatics data processing in the context of data projection and clustering. The most used Euclidean metric is not scale invariant and therefore occasionally inappropriate for complex, e.g., multimodal distributed variables and may negatively affect the results of cluster analysis. Specifically, the squaring function in the definition of the Euclidean distance as the square root of the sum of squared differences between data points has the consequence that the value 1 implicitly defines a limit for distances within clusters versus distances between (inter-) clusters. Methods: The Euclidean distances within a standard normal distribution (N(0,1)) follow a N(0,2) distribution. The EDO-transformation of a variable X is proposed as EDO=X/(2·s) following modeling of the standard deviation s by a mixture of Gaussians and selecting the dominant modes via item categorization. The method was compared in artificial and biomedical datasets with clustering of untransformed data, z-transformed data, and the recently proposed pooled variable scaling. Results: A simulation study and applications to known real data examples showed that the proposed EDO scaling method is generally useful. The clustering results in terms of cluster accuracy, adjusted Rand index and Dunn’s index outperformed the classical alternatives. Finally, the EDO transformation was applied to cluster a high-dimensional genomic dataset consisting of gene expression data for multiple samples of breast cancer tissues, and the proposed approach gave better results than classical methods and was compared with pooled variable scaling. Conclusions: For multivariate procedures of data analysis, it is proposed to use the EDO transformation as a better alternative to the established z-standardization, especially for nontrivially distributed data. The “EDOtrans” R package is available at https://cran.r-project.org/package=EDOtrans.",
                "authors": [
                    {
                        "name": "Lotsch J."
                    },
                    {
                        "name": "Ultsch A."
                    }
                ],
                "citationCount": 15,
                "date": "2022-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Euclidean distance-optimized data transformation for cluster analysis in biomedical data (EDOtrans)"
            },
            "pmcid": "PMC9202178",
            "pmid": "35710346"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Bioinformatics",
            "uri": "http://edamontology.org/topic_0091"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Mathematics",
            "uri": "http://edamontology.org/topic_3315"
        },
        {
            "term": "Medical informatics",
            "uri": "http://edamontology.org/topic_3063"
        }
    ],
    "validated": 1
}
