{
    "additionDate": "2021-09-27T07:53:23.297761Z",
    "biotoolsCURIE": "biotools:ignomonicm",
    "biotoolsID": "ignomonicm",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "embojorq@prodigy.net.mx",
            "name": "Enrique Morales-Bojórquez",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "ignomonicM is an R-package to estimate natural mortality throughout different life stages.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://cran.r-project.org/web/packages/gnomonicM/gnomonicM.pdf"
        },
        {
            "type": [
                "User manual"
            ],
            "url": "https://cran.r-project.org/web/packages/gnomonicM/vignettes/gnomonicM.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Incident curve plotting",
                    "uri": "http://edamontology.org/operation_3503"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://cran.r-project.org/package=gnomonicM",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-09-27T07:53:23.301452Z",
    "license": "GPL-2.0",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/ejosymart/gnomonicM/issues"
        },
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/ejosymart/gnomonicM"
        }
    ],
    "name": "ignomonicM",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.7717/PEERJ.11229",
            "metadata": {
                "abstract": "© 2021 PeerJ Inc.. All rights reserved.Natural mortality (M) is defined as the rate of loss that occurs in a fish stock due to natural (non-fishing) causes and can be influenced by density-dependent or density-independent factors. Different methods have been used to estimate M, one of these is the gnomonic approach. This method estimates M rates by dividing the life cycle of a species into subunits of time that increase as a constant proportion of the time elapsed from birth up to the initiation of each subdivision. In this study, an improved gnomonic approach is proposed to estimate natural mortality throughout different life stages in marine stocks using the gnomonicM package written in R software. This package was built to require data about (i) the number of gnomonic intervals, (ii) egg stage duration, (iii) longevity, and (iv) fecundity. With this information, it is possible to estimate the duration and natural mortality (Mi) of each gnomonic interval. The gnomonicM package uses a deterministic or stochastic approach, the latter of which assesses variability in M by assuming that the mean lifetime fecundity (MLF) is the main source of uncertainty. Additionally, the gnomonicM package allows the incorporation of auxiliary information related to the observed temporal durations of specific gnomonic intervals, which is useful for calibrating estimates of M vectors. The gnomonicM package, tested via deterministic and stochastic functions, was supported by the reproducibility and verification of the results obtained from different reports, thus guaranteeing its functionality, applicability, and performance in estimating M for different ontogenetic developmental stages. Based on the biological information of Pacific chub mackerel (Scomber japonicus), we presented a new case study to provide a comprehensive guide to data collection to obtain results and explain the details of the application of the gnomonicM package and avoid its misuse. This package could provide an alternative approach for estimating M and provide basic input data for ecological models, allowing the option of using estimates of variable natural mortality across different ages, mainly for life stages affected by fishing. The inputs for the gnomonicM packages are composed of numbers, vectors, or characters depending on whether the deterministic or stochastic approach is used, making the package quick, flexible, and easy to use; this allows users to focus on obtaining and interpreting results rather than the calculation process.",
                "authors": [
                    {
                        "name": "Arreguin-Sanchez F."
                    },
                    {
                        "name": "Morales-Bojorquez E."
                    },
                    {
                        "name": "Torrejon-Magallanes J."
                    }
                ],
                "date": "2021-04-19T00:00:00Z",
                "journal": "PeerJ",
                "title": "Improving the gnomonic approach with the gnomonicM R-package to estimate natural mortality throughout different life stages"
            },
            "pmcid": "PMC8061571",
            "pmid": "33976973",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Ecology",
            "uri": "http://edamontology.org/topic_0610"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ]
}
