{
    "additionDate": "2017-02-14T09:36:47Z",
    "biotoolsCURIE": "biotools:pacomplex",
    "biotoolsID": "pacomplex",
    "credit": [
        {
            "email": "moon@faculty.nctu.edu.tw",
            "name": "Jinn-Moon Yang",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "fantasyhwind@gmail.com",
            "name": "Yu-Shu Lo",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "PAComplex is a web server for inferring peptide antigen families and binding models from T-cell receptor-peptide MHC complexes.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://pacomplex.life.nctu.edu.tw/help.php"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Peptide immunogenicity prediction",
                    "uri": "http://edamontology.org/operation_0252"
                },
                {
                    "term": "Haplotype mapping",
                    "uri": "http://edamontology.org/operation_0487"
                },
                {
                    "term": "Protein identification",
                    "uri": "http://edamontology.org/operation_3767"
                }
            ]
        }
    ],
    "homepage": "http://PAcomplex.life.nctu.edu.tw",
    "lastUpdate": "2018-12-10T12:58:56Z",
    "name": "PAComplex",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "One of the most adaptive immune responses is triggered by specific T-cell receptors (TCR) binding to peptide-major histocompatibility complexes (pMHC). Despite the availability of many prediction servers to identify peptides binding to MHC, these servers are often lacking in peptide-TCR interactions and detailed atomic interacting models. PAComplex is the first web server investigating both pMHC and peptide-TCR interfaces to infer peptide antigens and homologous peptide antigens of a query. This server first identifies significantly similar TCR-pMHC templates (joint Z-value4.0) of the query by using antibody-antigen and protein-protein interacting scoring matrices for peptide-TCR and pMHC interfaces, respectively. PAComplex then identifies the homologous peptide antigens of these hit templates from complete pathogen genome databases (108 peptide candidates from 864628 protein sequences of 389 pathogens) and experimental peptide databases (80057 peptides in 2287 species). Finally, the server outputs peptide antigens and homologous peptide antigens of the query and displays detailed interacting models (e.g. hydrogen bonds and steric interactions in two interfaces) of hitTCR-pMHC templates. Experimental results demonstrate that the proposed server can achieve high prediction accuracy and offer potential peptide antigens across pathogens. We believe that the server is able to provide valuable insights for the peptide vaccine and MHC restriction. The PAComplex sever is available at http://PAcomplex.life.nctu.edu.tw. © 2011 The Author(s).",
                "authors": [
                    {
                        "name": "Liu I.-H."
                    },
                    {
                        "name": "Lo Y.-S."
                    },
                    {
                        "name": "Yang J.-M."
                    }
                ],
                "citationCount": 24,
                "date": "2011-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "PAComplex: A web server to infer peptide antigen families and binding models from TCR-pMHC complexes"
            },
            "pmid": "21666259"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Immunoproteins, genes and antigens",
            "uri": "http://edamontology.org/topic_2830"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ],
    "validated": 1
}