{
    "additionDate": "2015-12-06T15:18:09Z",
    "biotoolsCURIE": "biotools:belvu",
    "biotoolsID": "belvu",
    "credit": [
        {
            "name": "bils.se",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ],
            "url": "https://bils.se/"
        },
        {
            "email": "seqtools@sanger.ac.uk",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "erik.sonnhammer@cgb.ki.se",
            "name": "Erik LL Sonnhammer",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Calculate trees from multiple alignments.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://sonnhammer.sbc.su.se/Belvu.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Sequence alignment",
                        "uri": "http://edamontology.org/data_0863"
                    }
                }
            ],
            "operation": [
                {
                    "term": "Sequence visualisation",
                    "uri": "http://edamontology.org/operation_0564"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Sequence alignment",
                        "uri": "http://edamontology.org/data_0863"
                    }
                }
            ]
        }
    ],
    "homepage": "http://sonnhammer.sbc.su.se/Belvu.html",
    "lastUpdate": "2018-12-10T12:58:50Z",
    "name": "Belvu",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "mikael.borg@bils.se",
    "publication": [
        {
            "doi": "10.1186/1471-2105-6-108",
            "metadata": {
                "abstract": "Background: Distance-based methods are popular for reconstructing evolutionary trees thanks to their speed and generality. A number of methods exist for estimating distances from sequence alignments, which often involves some sort of correction for multiple substitutions. The problem is to accurately estimate the number of true substitutions given an observed alignment. So far, the most accurate protein distance estimators have looked for the optimal matrix in a series of transition probability matrices, e.g. the Dayhoff series. The evolutionary distance between two aligned sequences is here estimated as the evolutionary distance of the optimal matrix. The optimal matrix can be found either by an iterative search for the Maximum Likelihood matrix, or by integration to find the Expected Distance. As a consequence, these methods are more complex to implement and computationally heavier than correction-based methods. Another problem is that the result may vary substantially depending on the evolutionary model used for the matrices. An ideal distance estimator should produce consistent and accurate distances independent of the evolutionary model used. Results: We propose a correction-based protein sequence estimator called Scoredist. It uses a logarithmic correction of observed divergence based on the alignment score according to the BLOSUM62 score matrix. We evaluated Scoredist and a number of optimal matrix methods using three evolutionary models for both training and testing Dayhoff, Jones-Taylor-Thornton, and Müller-Vingron, as well as Whelan and Goldman solely for testing. Test alignments with known distances between 0.01 and 2 substitutions per position (1-200 PAM) were simulated using ROSE. Scoredist proved as accurate as the optimal matrix methods, yet substantially more robust. When trained on one model but tested on another one, Scoredist was nearly always more accurate. The Jukes-Cantor and Kimura correction methods were also tested, but were substantially less accurate. Conclusion: The Scoredist distance estimator is fast to implement and run, and combines robustness with accuracy. Scoredist has been incorporated into the Belvu alignment viewer, which is available at ftp://ftp.cgb.ki.se/pub/prog/belvu/. © 2005 Sonnhammer and Hollich; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Sonnhammer E.L.L."
                    },
                    {
                        "name": "Hollich V."
                    }
                ],
                "citationCount": 83,
                "date": "2005-04-27T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Scoredist: A simple and robust protein sequence distance estimator"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        }
    ],
    "validated": 1,
    "version": [
        "1"
    ]
}