{
    "additionDate": "2017-12-18T00:06:49Z",
    "biotoolsCURIE": "biotools:gmdr",
    "biotoolsID": "gmdr",
    "credit": [
        {
            "email": "XLou@ms.soph.uab.edu",
            "name": "Xiang-Yang Lou",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Nonparametric and genetic model-free alternative to linear or logistic regression for detecting and characterizing nonlinear interactions among discrete genetic and environmental attributes. Compared with the MDR method, this method permits adjustment for discrete and quantitative covariates and is applicable to both dichotomous and continuous phenotypes in different population-based study designs. It will increase the precision accuracy and help users draw a more meaningful conclusion.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://www.ssg.uab.edu/gmdr/files/GMDR%20User%20Manual.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "http://www.ssg.uab.edu/gmdr/",
    "language": [
        "Java",
        "Perl"
    ],
    "lastUpdate": "2019-02-06T10:28:24Z",
    "license": "GPL-2.0",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/gmdr-1-0-detect-gene-by-gene-gene-by-environment-interactions.html"
        }
    ],
    "name": "GMDR",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1086/518312",
            "metadata": {
                "abstract": "The determination of gene-by-gene and gene-by-environment interactions has long been one of the greatest challenges in genetics. The traditional methods are typically inadequate because of the problem referred to as the \"curse of dimensionality.\" Recent combinatorial approaches, such as the multifactor dimensionality reduction (MDR) method, the combinatorial partitioning method, and the restricted partition method, have a straightforward correspondence to the concept of the phenotypic landscape that unifies biological, statistical genetics, and evolutionary theories. However, the existing approaches have several limitations, such as not allowing for covariates, that restrict their practical use. In this study, we report a generalized MDR (GMDR) method that permits adjustment for discrete and quantitative covariates and is applicable to both dichotomous and continuous phenotypes in various population-based study designs. Computer simulations indicated that the GMDR method has superior performance in its ability to identify epistatic loci, compared with current methods in the literature. We applied our proposed method to a genetics study of four genes that were reported to be associated with nicotine dependence and found significant joint action between CHRNB4 and NTRK2. Moreover, our example illustrates that the newly proposed GMDR approach can increase prediction ability, suggesting that its use is justified in practice. In summary, GMDR serves the purpose of identifying contributors to population variation better than do the other existing methods. © 2007 by The American Society of Human Genetics. All rights reserved.",
                "authors": [
                    {
                        "name": "Lou X.-Y."
                    },
                    {
                        "name": "Chen G.-B."
                    },
                    {
                        "name": "Yan L."
                    },
                    {
                        "name": "Ma J.Z."
                    },
                    {
                        "name": "Zhu J."
                    },
                    {
                        "name": "Elston R.C."
                    },
                    {
                        "name": "Li M.D."
                    }
                ],
                "citationCount": 443,
                "date": "2007-01-01T00:00:00Z",
                "journal": "American Journal of Human Genetics",
                "title": "A generalized combinatorial approach for detecting gene-by-gene and gene-by-environment interactions with application to nicotine dependence"
            },
            "pmid": "17503330",
            "type": [
                "Primary"
            ]
        },
        {
            "doi": "10.2174/1389202917666160513102612",
            "metadata": {
                "abstract": "© 2016 Bentham Science Publishers.Identification of multifactor gene-gene (G×G) and gene-environment (G×E) interactions underlying complex traits poses one of the great challenges to today’s genetic study. Development of the generalized multifactor dimensionality reduction (GMDR) method provides a practicable solution to problems in detection of interactions. To exploit the opportunities brought by the availability of diverse data, it is in high demand to develop the corresponding GMDR software that can handle a breadth of phenotypes, such as continuous, count, dichotomous, polytomous nominal, ordinal, survival and multivariate, and various kinds of study designs, such as unrelated case-control, family-based and pooled unrelated and family samples, and also allows adjustment for covariates. We developed a versatile GMDR package to implement this serial of GMDR analyses for various scenarios (e.g., unified analysis of unrelated and family samples) and large-scale (e.g., genome-wide) data. This package includes other desirable features such as data management and preprocessing. Permutation testing strategies are also built in to evaluate the threshold or empirical p values. In addition, its performance is scalable to the computational resources. The software is available at http:// www.soph.uab.edu/ssg/software or http://ibi.zju.edu.cn/software.",
                "authors": [
                    {
                        "name": "Xu H.-M."
                    },
                    {
                        "name": "Xu L.-F."
                    },
                    {
                        "name": "Hou T.-T."
                    },
                    {
                        "name": "Luo L.-F."
                    },
                    {
                        "name": "Chen G.-B."
                    },
                    {
                        "name": "Sun X.-W."
                    },
                    {
                        "name": "Lou X.-Y."
                    }
                ],
                "citationCount": 14,
                "date": "2016-10-01T00:00:00Z",
                "journal": "Current Genomics",
                "title": "GMDR: Versatile software for detecting gene-gene and gene-environment interactions underlying complex traits"
            },
            "pmcid": "PMC5320543",
            "pmid": "28479868",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        }
    ],
    "validated": 1
}