{
    "accessibility": [],
    "additionDate": "2017-12-18T00:06:49Z",
    "biotoolsCURIE": "biotools:gmdr",
    "biotoolsID": "gmdr",
    "collectionID": [],
    "confidence_flag": null,
    "cost": null,
    "credit": [
        {
            "email": "XLou@ms.soph.uab.edu",
            "gridid": null,
            "name": "Xiang-Yang Lou",
            "note": null,
            "orcidid": null,
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": null
        }
    ],
    "description": "Nonparametric and genetic model-free alternative to linear or logistic regression for detecting and characterizing nonlinear interactions among discrete genetic and environmental attributes. Compared with the MDR method, this method permits adjustment for discrete and quantitative covariates and is applicable to both dichotomous and continuous phenotypes in different population-based study designs. It will increase the precision accuracy and help users draw a more meaningful conclusion.",
    "documentation": [
        {
            "note": null,
            "type": "User manual",
            "url": "http://www.ssg.uab.edu/gmdr/files/GMDR%20User%20Manual.pdf"
        }
    ],
    "download": [],
    "editPermission": {
        "authors": [],
        "type": "private"
    },
    "elixirNode": [],
    "elixirPlatform": [],
    "elixir_badge": 0,
    "function": [
        {
            "cmd": null,
            "input": [],
            "note": null,
            "operation": [
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ],
            "output": []
        }
    ],
    "homepage": "http://www.ssg.uab.edu/gmdr/",
    "homepage_status": 0,
    "language": [
        "Java",
        "Perl"
    ],
    "lastUpdate": "2019-02-06T10:28:24Z",
    "license": "GPL-2.0",
    "link": [
        {
            "note": null,
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/gmdr-1-0-detect-gene-by-gene-gene-by-environment-interactions.html"
        }
    ],
    "maturity": null,
    "name": "GMDR",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "otherID": [],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1086/518312",
            "metadata": {
                "abstract": "The determination of gene-by-gene and gene-by-environment interactions has long been one of the greatest challenges in genetics. The traditional methods are typically inadequate because of the problem referred to as the \"curse of dimensionality.\" Recent combinatorial approaches, such as the multifactor dimensionality reduction (MDR) method, the combinatorial partitioning method, and the restricted partition method, have a straightforward correspondence to the concept of the phenotypic landscape that unifies biological, statistical genetics, and evolutionary theories. However, the existing approaches have several limitations, such as not allowing for covariates, that restrict their practical use. In this study, we report a generalized MDR (GMDR) method that permits adjustment for discrete and quantitative covariates and is applicable to both dichotomous and continuous phenotypes in various population-based study designs. Computer simulations indicated that the GMDR method has superior performance in its ability to identify epistatic loci, compared with current methods in the literature. We applied our proposed method to a genetics study of four genes that were reported to be associated with nicotine dependence and found significant joint action between CHRNB4 and NTRK2. Moreover, our example illustrates that the newly proposed GMDR approach can increase prediction ability, suggesting that its use is justified in practice. In summary, GMDR serves the purpose of identifying contributors to population variation better than do the other existing methods. © 2007 by The American Society of Human Genetics. All rights reserved.",
                "authors": [
                    {
                        "name": "Lou X.-Y."
                    },
                    {
                        "name": "Chen G.-B."
                    },
                    {
                        "name": "Yan L."
                    },
                    {
                        "name": "Ma J.Z."
                    },
                    {
                        "name": "Zhu J."
                    },
                    {
                        "name": "Elston R.C."
                    },
                    {
                        "name": "Li M.D."
                    }
                ],
                "citationCount": 395,
                "date": "2007-01-01T00:00:00Z",
                "journal": "American Journal of Human Genetics",
                "title": "A generalized combinatorial approach for detecting gene-by-gene and gene-by-environment interactions with application to nicotine dependence"
            },
            "note": null,
            "pmcid": null,
            "pmid": "17503330",
            "type": "Primary",
            "version": null
        },
        {
            "doi": "10.2174/1389202917666160513102612",
            "metadata": null,
            "note": null,
            "pmcid": "PMC5320543",
            "pmid": "28479868",
            "type": "Primary",
            "version": null
        }
    ],
    "relation": [],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        }
    ],
    "validated": 1,
    "version": []
}