
{
    "credit": [
        {
            "email": "contact.cube@univie.ac.at",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://cube.univie.ac.at/contact"
        },
        {
            "email": "thomas.rattei@univie.ac.at",
            "name": "Thomas Rattei",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://cube.univie.ac.at/conspred"
        }
    ],
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Sequence record",
                        "uri": "http://edamontology.org/data_0849"
                    }
                }
            ],
            "operation": [
                {
                    "term": "Sequence annotation",
                    "uri": "http://edamontology.org/operation_0361"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Feature table",
                        "uri": "http://edamontology.org/data_1270"
                    }
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Shell",
            "Java",
            "Perl"
        ],
        "operatingSystem": [
            "Linux",
            "Mac"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Systems biology",
                "uri": "http://edamontology.org/topic_2259"
            }
        ]
    },
    "link": [
        {
            "type": "Repository",
            "url": "https://sourceforge.net/projects/conspred/"
        }
    ],
    "publication": [
        {
            "abstract": "© The Author 2016. Published by Oxford University Press. All rights reserved. Motivation: The rapidly growing number of available prokaryotic genome sequences requires fully automated and high-quality software solutions for their initial and re-annotation. Here we present ConsPred, a prokaryotic genome annotation framework that performs intrinsic gene predictions, homology searches, predictions of non-coding genes as well as CRISPR repeats and integrates all evidence into a consensus annotation. ConsPred achieves comprehensive, high-quality annotations based on rules and priorities, similar to decision-making in manual curation and avoids conflicting predictions. Parameters controlling the annotation process are configurable by the user. ConsPred has been used in the institutions of the authors for longer than 5 years and can easily be extended and adapted to specific needs. Summary: The ConsPred algorithm for producing a consensus from the varying scores of multiple gene prediction programs approaches manual curation in accuracy. Its rule-based approach for choosing final predictions avoids overriding previous manual curations.",
            "authors": [
                "Weinmaier T.",
                "Platzer A.",
                "Frank J.",
                "Hellinger H.-J.",
                "Tischler P.",
                "Rattei T."
            ],
            "cit_count": 2,
            "doi": "10.1093/bioinformatics/btw393",
            "journal": "Bioinformatics",
            "title": "ConsPred: A rule-based (re-)annotation framework for prokaryotic genomes",
            "type": "Primary",
            "year": "2016-11-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:conspred",
        "biotoolsID": "conspred",
        "description": "Prokaryotic genome annotation framework that performs various intrinsic gene predictions, homology searches, predictions of non-coding genes, and complex features and integrates all evidence into a consensus annotation. It achieves high-quality and comprehensive annotations based on rules and priorities, similar to decision-making in manual curation. Parameters controlling the annotation process are configurable by the user.",
        "homepage": "https://sourceforge.net/projects/conspred/",
        "name": "Conspred",
        "version": [
            "1.33"
        ]
    }
}