{
    "additionDate": "2021-01-18T07:40:13Z",
    "biotoolsCURIE": "biotools:delia",
    "biotoolsID": "delia",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "hbshen@sjtu.edu.cn",
            "name": "Hong-Bin Shen",
            "typeEntity": "Person"
        }
    ],
    "description": "DELIA is a tool for deep learning model for protein-ligand binding site prediction based on amino acid distance matrix.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Binding site prediction",
                    "uri": "http://edamontology.org/operation_2575"
                },
                {
                    "term": "Protein-ligand docking",
                    "uri": "http://edamontology.org/operation_0482"
                },
                {
                    "term": "Residue contact prediction",
                    "uri": "http://edamontology.org/operation_0272"
                }
            ]
        }
    ],
    "homepage": "http://www.csbio.sjtu.edu.cn/bioinf/delia/",
    "lastUpdate": "2021-02-27T15:58:15Z",
    "name": "DELIA",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAA110",
            "metadata": {
                "abstract": "© 2020 The Author(s). Published by Oxford University Press. All rights reserved.Motivation: Knowledge of protein-ligand binding residues is important for understanding the functions of proteins and their interaction mechanisms. From experimentally solved protein structures, how to accurately identify its potential binding sites of a specific ligand on the protein is still a challenging problem. Compared with structurealignment-based methods, machine learning algorithms provide an alternative flexible solution which is less dependent on annotated homogeneous protein structures. Several factors are important for an efficient protein-ligand prediction model, e.g. discriminative feature representation and effective learning architecture to deal with both the large-scale and severely imbalanced data. Results: In this study, we propose a novel deep-learning-based method called DELIA for protein-ligand binding residue prediction. In DELIA, a hybrid deep neural network is designed to integrate 1D sequence-based features with 2D structure-based amino acid distance matrices. To overcome the problem of severe data imbalance between the binding and nonbinding residues, strategies of oversampling in mini-batch, random undersampling and stacking ensemble are designed to enhance the model. Experimental results on five benchmark datasets demonstrate the effectiveness of proposed DELIA pipeline.",
                "authors": [
                    {
                        "name": "Pan X."
                    },
                    {
                        "name": "Shen H.-B."
                    },
                    {
                        "name": "Xia C.-Q."
                    }
                ],
                "citationCount": 5,
                "date": "2020-05-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Protein-ligand binding residue prediction enhancement through hybrid deep heterogeneous learning of sequence and structure data"
            },
            "pmid": "32091580"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Immunoproteins and antigens",
            "uri": "http://edamontology.org/topic_2830"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Protein binding sites",
            "uri": "http://edamontology.org/topic_3534"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
