{
    "additionDate": "2017-01-17T15:00:40Z",
    "biotoolsCURIE": "biotools:flowpeaks",
    "biotoolsID": "flowpeaks",
    "collectionID": [
        "BioConductor"
    ],
    "credit": [
        {
            "email": "yongchao.ge@gmail.com",
            "name": "Yongchao Ge",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "A fast and automatic clustering to classify the cells into subpopulations based on finding the peaks from the overall density function generated by K-means.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://bioconductor.org/packages/release/bioc/html/flowPeaks.html"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://bioconductor/packages/release/bioc/src/contrib/flowPeaks_1.18.0.tar.gz"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Spectral analysis",
                    "uri": "http://edamontology.org/operation_3214"
                },
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                }
            ]
        }
    ],
    "homepage": "http://bioconductor.org/packages/release/bioc/html/flowPeaks.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2019-01-09T15:26:31Z",
    "license": "Artistic-1.0",
    "name": "flowPeaks",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "bioconductor_import",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/bts300",
            "metadata": {
                "abstract": "Motivation: For flow cytometry data, there are two common approaches to the unsupervised clustering problem: one is based on the finite mixture model and the other on spatial exploration of the histograms. The former is computationally slow and has difficulty to identify clusters of irregular shapes. The latter approach cannot be applied directly to high-dimensional data as the computational time and memory become unmanageable and the estimated histogram is unreliable. An algorithm without these two problems would be very useful.Results: In this article, we combine ideas from the finite mixture model and histogram spatial exploration. This new algorithm, which we call flowPeaks, can be applied directly to high-dimensional data and identify irregular shape clusters. The algorithm first uses K-means algorithm with a large K to partition the cell population into many small clusters. These partitioned data allow the generation of a smoothed density function using the finite mixture model. All local peaks are exhaustively searched by exploring the density function and the cells are clustered by the associated local peak. The algorithm flowPeaks is automatic, fast and reliable and robust to cluster shape and outliers. This algorithm has been applied to flow cytometry data and it has been compared with state of the art algorithms, including Misty Mountain, FLOCK, flowMeans, flowMerge and FLAME. © The Author 2012. Published by Oxford University Press. All rights reserved.",
                "authors": [
                    {
                        "name": "Ge Y."
                    },
                    {
                        "name": "Sealfon S.C."
                    }
                ],
                "citationCount": 85,
                "date": "2012-08-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Flowpeaks: A fast unsupervised clustering for flow cytometry data via K-means and density peak finding"
            },
            "pmcid": "PMC3400953",
            "pmid": "22595209",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool",
        "Library"
    ],
    "topic": [
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        }
    ],
    "validated": 1,
    "version": [
        "1.18.0"
    ]
}