{"credit":[{"name":"GitHub Issues","typeEntity":"Person","typeRoles":["Primary contact"],"url":"https://github.com/quantopian/qgrid/issues"}],"documentation":[{"type":"API_DOCUMENTATION","url":"https://github.com/quantopian/qgrid"}],"function":[{"operation":[{"term":"Protein hydrophobic region calculation","uri":"http://edamontology.org/operation_0405"},{"term":"Clustering","uri":"http://edamontology.org/operation_3432"},{"term":"Residue cluster calculation","uri":"http://edamontology.org/operation_0393"},{"term":"Protein model validation","uri":"http://edamontology.org/operation_0321"}]}],"labels":{"language":["Python"],"operatingSystem":["Linux","Windows","Mac"],"toolType":["Web application"],"topic":[{"term":"Proteins","uri":"http://edamontology.org/topic_0078"},{"term":"Protein properties","uri":"http://edamontology.org/topic_0123"}]},"publication":[{"abstract":"We have developed a simple but powerful method and web server to quickly locate charged and hydrophobic clusters in proteins (http://www.netasa.org/qgrid/index.html). For the charged clusters, each atom in the protein is first assigned a charge according to a standard force field. Then a box is created with dimensions corresponding to the range of atomic coordinates. This box is then divided into cubic grids of selected size, which now have one or more charged atoms in them. This leaves each grid with a certain amount of charge. Cubic grids with more than a cutoff charge are then clustered using a hierarchical clustering method based on Euclidean distance. A tree diagram made from the resulting clusters indicates the distribution of charged and hydrophobic regions of the protein. Hydrophobic clusters are developed by grouping the positions of Cα atoms of such residues. We propose that such a tree representation will be helpful in detecting protein-protein interfaces, structure similarity and motif detection. © Oxford University Press 2004; all rights reserved.","authors":["Ahmad S.","Sarai A."],"cit_count":6,"journal":"Nucleic Acids Research","pmid":"15215360","title":"Qgrid: Clustering tool for detecting charged and hydrophobic regions in proteins","year":"2004-07-01"}],"summary":{"biotoolsCURIE":"biotools:qgrid","biotoolsID":"qgrid","description":"Server which provides cluster tree diagrams of a protein based on the charged atoms or hydrophobicity of each of its residues.  The diagram allows for visual inspection of the distribution of hydrophobic and charged regions in proteins.","homepage":"https://qgrid.readthedocs.io/en/latest/","name":"Qgrid"}}