{
    "accessibility": "Open access",
    "additionDate": "2022-11-06T13:24:34.501787Z",
    "biotoolsCURIE": "biotools:apaview",
    "biotoolsID": "apaview",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "wxm@mail.xjtu.edu.cn",
            "name": "Xiaoming Wu",
            "typeEntity": "Person"
        }
    ],
    "description": "A web-based platform for alternative polyadenylation analyses in hematological cancers.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Differential gene expression profiling",
                    "uri": "http://edamontology.org/operation_3223"
                },
                {
                    "term": "Expression correlation analysis",
                    "uri": "http://edamontology.org/operation_3463"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Wu-xjtu/APAview",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-11-06T13:24:34.504332Z",
    "license": "MIT",
    "name": "APAview",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.3389/FGENE.2022.928862",
            "metadata": {
                "abstract": "Copyright © 2022 Hu, Song, Chyr, Wan, Wang, Du, Duan, Zhang, Zhou and Wu.Background: Hematologic malignancies, such as acute promyelocytic leukemia (APL) and acute myeloid leukemia (AML), are cancers that start in blood-forming tissues and can affect the blood, bone marrow, and lymph nodes. They are often caused by genetic and molecular alterations such as mutations and gene expression changes. Alternative polyadenylation (APA) is a post-transcriptional process that regulates gene expression, and dysregulation of APA contributes to hematological malignancies. RNA-sequencing-based bioinformatic methods can identify APA sites and quantify APA usages as molecular indexes to study APA roles in disease development, diagnosis, and treatment. Unfortunately, APA data pre-processing, analysis, and visualization are time-consuming, inconsistent, and laborious. A comprehensive, user-friendly tool will greatly simplify processes for APA feature screening and mining. Results: Here, we present APAview, a web-based platform to explore APA features in hematological cancers and perform APA statistical analysis. APAview server runs on Python3 with a Flask framework and a Jinja2 templating engine. For visualization, APAview client is built on Bootstrap and Plotly. Multimodal data, such as APA quantified by QAPA/DaPars, gene expression data, and clinical information, can be uploaded to APAview and analyzed interactively. Correlation, survival, and differential analyses among user-defined groups can be performed via the web interface. Using APAview, we explored APA features in two hematological cancers, APL and AML. APAview can also be applied to other diseases by uploading different experimental data.",
                "authors": [
                    {
                        "name": "Chyr J."
                    },
                    {
                        "name": "Du J."
                    },
                    {
                        "name": "Duan J."
                    },
                    {
                        "name": "Hu X."
                    },
                    {
                        "name": "Song J."
                    },
                    {
                        "name": "Wan J."
                    },
                    {
                        "name": "Wang X."
                    },
                    {
                        "name": "Wu X."
                    },
                    {
                        "name": "Zhang H."
                    },
                    {
                        "name": "Zhou X."
                    }
                ],
                "date": "2022-08-12T00:00:00Z",
                "journal": "Frontiers in Genetics",
                "title": "APAview: A web-based platform for alternative polyadenylation analyses in hematological cancers"
            },
            "pmcid": "PMC9411867",
            "pmid": "36035147"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        }
    ],
    "validated": 1
}
