{
    "additionDate": "2020-01-14T20:15:35Z",
    "biotoolsCURIE": "biotools:IgM",
    "biotoolsID": "IgM",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "a_pashov@microbio.bas.bg",
            "name": "Anastas Pashov",
            "typeEntity": "Person"
        }
    ],
    "description": "Diagnostic Profiling of the Human Public IgM Repertoire With Scalable Mimotope Libraries.\n\nGENERATING AND TESTING MIMOTOPE LIBRARIES.\n\nProof of pricniple diagnostic use with feature selection and predictor construction.\n\ncomparison between IgM reactivity with different peptide libraries.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Sequence clustering",
                    "uri": "http://edamontology.org/operation_0291"
                },
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                }
            ]
        }
    ],
    "homepage": "https://github.com/ansts/IgMimoPap1",
    "language": [
        "R"
    ],
    "lastUpdate": "2020-12-14T08:46:02Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/ansts/IgMimoPap2"
        }
    ],
    "name": "IgM",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.3389/FIMMU.2019.02796",
            "metadata": {
                "abstract": "© Copyright © 2019 Pashov, Shivarov, Hadzhieva, Kostov, Ferdinandov, Heintz, Pashova, Todorova, Vassilev, Kieber-Emmons, Meza-Zepeda and Hovig.Specific antibody reactivities are routinely used as biomarkers, but the antibody repertoire reactivity (igome) profiles are still neglected. Here, we propose rationally designed peptide arrays as efficient probes for these system level biomarkers. Most IgM antibodies are characterized by few somatic mutations, polyspecificity, and physiological autoreactivity with housekeeping function. Previously, probing this repertoire with a set of immunodominant self-proteins provided a coarse analysis of the respective repertoire profiles. In contrast, here, we describe the generation of a peptide mimotope library that reflects the common IgM repertoire of 10,000 healthy donors. In addition, an appropriately sized subset of this quasi-complete mimotope library was further designed as a potential diagnostic tool. A 7-mer random peptide phage display library was panned on pooled human IgM. Next-generation sequencing of the selected phage yielded 224,087 sequences, which clustered in 790 sequence clusters. A set of 594 mimotopes, representative of the most significant sequence clusters, was shown to probe symmetrically the space of IgM reactivities in patients' sera. This set of mimotopes can be easily scaled including a greater proportion of the mimotope library. The trade-off between the array size and the resolution can be explored while preserving the symmetric sampling of the mimotope sequence and reactivity spaces. BLAST search of the non-redundant protein database with the mimotopes sequences yielded significantly more immunoglobulin J region hits than random peptides, indicating a considerable idiotypic connectivity of the targeted igome. The proof of principle predictors for random diagnoses was represented by profiles of mimotopes. The number of potential reactivity profiles that can be extracted from this library is estimated at more than 1070. Thus, a quasi-complete IgM mimotope library and a scalable representative subset thereof are found to address very efficiently the dynamic diversity of the human public IgM repertoire, providing informationally dense and structurally interpretable IgM reactivity profiles.",
                "authors": [
                    {
                        "name": "Pashov A."
                    },
                    {
                        "name": "Shivarov V."
                    },
                    {
                        "name": "Hadzhieva M."
                    },
                    {
                        "name": "Kostov V."
                    },
                    {
                        "name": "Ferdinandov D."
                    },
                    {
                        "name": "Heintz K.-M."
                    },
                    {
                        "name": "Pashova S."
                    },
                    {
                        "name": "Todorova M."
                    },
                    {
                        "name": "Vassilev T."
                    },
                    {
                        "name": "Kieber-Emmons T."
                    },
                    {
                        "name": "Meza-Zepeda L.A."
                    },
                    {
                        "name": "Hovig E."
                    }
                ],
                "citationCount": 3,
                "date": "2019-12-03T00:00:00Z",
                "journal": "Frontiers in Immunology",
                "title": "Diagnostic Profiling of the Human Public IgM Repertoire With Scalable Mimotope Libraries"
            },
            "pmcid": "PMC6901697",
            "pmid": "31849974"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Immunology",
            "uri": "http://edamontology.org/topic_0804"
        },
        {
            "term": "Probes and primers",
            "uri": "http://edamontology.org/topic_0632"
        },
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        }
    ],
    "validated": 1
}