{
    "additionDate": "2018-05-23T17:05:33Z",
    "biotoolsCURIE": "biotools:orthograph",
    "biotoolsID": "orthograph",
    "credit": [
        {
            "email": "mpetersen@uni-bonn.de",
            "name": "Malte Petersen",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "o.niehuis@zfmk.de",
            "name": "Oliver Niehuis",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Applies reciprocal hit search strategy using profile hidden Markov models and maps nucleotide sequences to the globally best matching cluster of orthologous genes, thus enabling researchers to conveniently and reliably delineate orthologs and paralogs from transcriptomic and genomic sequence data.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://github.com/mptrsen/Orthograph/blob/master/README.md"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Transcriptome assembly",
                    "uri": "http://edamontology.org/operation_3258"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Local alignment",
                    "uri": "http://edamontology.org/operation_0495"
                }
            ]
        }
    ],
    "homepage": "https://mptrsen.github.io/Orthograph/",
    "language": [
        "Perl"
    ],
    "lastUpdate": "2018-12-10T12:58:58Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/mptrsen/Orthograph"
        }
    ],
    "name": "Orthograph",
    "owner": "aotamendi.1",
    "publication": [
        {
            "doi": "10.1186/s12859-017-1529-8",
            "metadata": {
                "abstract": "© 2017 The Author(s).Background: Orthology characterizes genes of different organisms that arose from a single ancestral gene via speciation, in contrast to paralogy, which is assigned to genes that arose via gene duplication. An accurate orthology assignment is a crucial step for comparative genomic studies. Orthologous genes in two organisms can be identified by applying a so-called reciprocal search strategy, given that complete information of the organisms' gene repertoire is available. In many investigations, however, only a fraction of the gene content of the organisms under study is examined (e.g., RNA sequencing). Here, identification of orthologous nucleotide or amino acid sequences can be achieved using a graph-based approach that maps nucleotide sequences to genes of known orthology. Existing implementations of this approach, however, suffer from algorithmic issues that may cause problems in downstream analyses. Results: We present a new software pipeline, Orthograph, that addresses and solves the above problems and implements useful features for a wide range of comparative genomic and transcriptomic analyses. Orthograph applies a best reciprocal hit search strategy using profile hidden Markov models and maps nucleotide sequences to the globally best matching cluster of orthologous genes, thus enabling researchers to conveniently and reliably delineate orthologs and paralogs from transcriptomic and genomic sequence data. We demonstrate the performance of our approach on de novo-sequenced and assembled transcript libraries of 24 species of apoid wasps (Hymenoptera: Aculeata) as well as on published genomic datasets. Conclusion: With Orthograph, we implemented a best reciprocal hit approach to reference-based orthology prediction for coding nucleotide sequences such as RNAseq data. Orthograph is flexible, easy to use, open source and freely available at https://mptrsen.github.io/Orthograph. Additionally, we release 24 de novo-sequenced and assembled transcript libraries of apoid wasp species.",
                "authors": [
                    {
                        "name": "Petersen M."
                    },
                    {
                        "name": "Meusemann K."
                    },
                    {
                        "name": "Donath A."
                    },
                    {
                        "name": "Dowling D."
                    },
                    {
                        "name": "Liu S."
                    },
                    {
                        "name": "Peters R.S."
                    },
                    {
                        "name": "Podsiadlowski L."
                    },
                    {
                        "name": "Vasilikopoulos A."
                    },
                    {
                        "name": "Zhou X."
                    },
                    {
                        "name": "Misof B."
                    },
                    {
                        "name": "Niehuis O."
                    }
                ],
                "citationCount": 72,
                "date": "2017-02-16T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Orthograph: A versatile tool for mapping coding nucleotide sequences to clusters of orthologous genes"
            },
            "pmcid": "PMC5312442",
            "pmid": "28209129"
        }
    ],
    "toolType": [
        "Command-line tool",
        "Workflow"
    ],
    "topic": [
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        },
        {
            "term": "RNA-seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        }
    ],
    "validated": 1
}