{
    "additionDate": "2021-01-18T07:01:49Z",
    "biotoolsCURIE": "biotools:ospaad",
    "biotoolsID": "ospaad",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "xqguo@henu.edu.cn",
            "name": "Xiangqian Guo",
            "typeEntity": "Person"
        }
    ],
    "description": "An online tool to perform survival analysis by integrating gene expression profiling and long-term follow-up data of 1319 pancreatic carcinoma patients.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                },
                {
                    "term": "Incident curve plotting",
                    "uri": "http://edamontology.org/operation_3503"
                },
                {
                    "term": "Splitting",
                    "uri": "http://edamontology.org/operation_3359"
                }
            ]
        }
    ],
    "homepage": "http://bioinfo.henu.edu.cn/PAAD/PAADList.jsp",
    "lastUpdate": "2021-03-15T14:19:16Z",
    "name": "OSpaad",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1002/MC.23154",
            "metadata": {
                "abstract": "© 2020 Wiley Periodicals, Inc.Pancreatic carcinoma (PC) is a type of highly lethal malignant tumor that has unfavorable outcomes. One major challenge in improving clinical outcomes is to identify novel biomarkers for prognosis. In this study, we developed an online consensus survival tool for pancreatic adenocarcinoma (OSpaad), which allows researchers and clinicians to analyze the prognostic value of selected genes in PC. OSpaad contains 1319 unique PC cases that have both gene expression data and correspondent clinical data from seven individual cohorts and provides four survival terms including overall survival, disease-specific survival, disease-free interval, progression-free interval for prognosis evaluation. To meet the different research needs, OSpaad allows users to limit survival analysis in subgroups by selecting different terms of clinical confounding factors such as TNM stage, sex, smoking time, lymph invasion, and race. Moreover, we showed that 97% (116 out of 120) previously reported prognostic biomarkers, including ERBB2, TP53, EGFR and so forth, were validated and confirmed their prognostic significance in OSpaad, demonstrating the well performance of survival analysis in OSpaad. OSpaad is a user-friendly online tool with a straightforward interface allowing clinicians and basic research scientists with even a limited bioinformatics background to easily screen and evaluate the prognostic value of genes in a large PC cohort. This online tool can be accessed at http://bioinfo.henu.edu.cn/PAAD/PAADList.jsp.",
                "authors": [
                    {
                        "name": "Zhang G."
                    },
                    {
                        "name": "Wang Q."
                    },
                    {
                        "name": "Yang M."
                    },
                    {
                        "name": "Yao X."
                    },
                    {
                        "name": "Qi X."
                    },
                    {
                        "name": "An Y."
                    },
                    {
                        "name": "Dong H."
                    },
                    {
                        "name": "Zhang L."
                    },
                    {
                        "name": "Zhu W."
                    },
                    {
                        "name": "Li Y."
                    },
                    {
                        "name": "Guo X."
                    }
                ],
                "citationCount": 5,
                "date": "2020-03-01T00:00:00Z",
                "journal": "Molecular Carcinogenesis",
                "title": "OSpaad: An online tool to perform survival analysis by integrating gene expression profiling and long-term follow-up data of 1319 pancreatic carcinoma patients"
            },
            "pmid": "31912599"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Medical informatics",
            "uri": "http://edamontology.org/topic_3063"
        },
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        }
    ]
}