{
    "additionDate": "2021-10-06T14:59:39.485990Z",
    "biotoolsCURIE": "biotools:virusviz",
    "biotoolsID": "virusviz",
    "collectionID": [
        "COVID-19"
    ],
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "stefano.ceri@polimi.it",
            "name": "Stefano Ceri",
            "orcidid": "https://orcid.org/0000-0003-0671-2415",
            "typeEntity": "Person"
        },
        {
            "name": "ELIXIR-ITA",
            "typeEntity": "Project",
            "url": "https://elixir-italy.org/"
        },
        {
            "name": "ELIXIR-ITA-POLIMI",
            "typeEntity": "Project",
            "url": "https://www.deib.polimi.it/eng/elixir-iib"
        }
    ],
    "description": "VirusViz is a Web Server for analyzing viral sequences and visualizing their variants and characteristics.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/DEIB-GECO/VirusViz/wiki"
        }
    ],
    "editPermission": {
        "authors": [
            "ELIXIR-ITA-POLIMI"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                },
                {
                    "term": "Genetic variation analysis",
                    "uri": "http://edamontology.org/operation_3197"
                },
                {
                    "term": "Variant effect prediction",
                    "uri": "http://edamontology.org/operation_0331"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://github.com/DEIB-GECO/VirusViz/wiki",
    "language": [
        "JavaScript",
        "Python"
    ],
    "lastUpdate": "2023-12-02T22:14:53.892519Z",
    "license": "GPL-3.0",
    "name": "VirusViz",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "abernasconi",
    "publication": [
        {
            "doi": "10.1186/s12859-022-05022-0",
            "metadata": {
                "abstract": "Background: Genomics and virology are unquestionably important, but complex, domains being investigated by a large number of scientists. The need to facilitate and support work within these domains requires sharing of databases, although it is often difficult to do so because of the different ways in which data is represented across the databases. To foster semantic interoperability, models are needed that provide a deep understanding and interpretation of the concepts in a domain, so that the data can be consistently interpreted among researchers. Results: In this research, we propose the use of conceptual models to support semantic interoperability among databases and assess their ontological clarity to support their effective use. This modeling effort is illustrated by its application to the Viral Conceptual Model (VCM) that captures and represents the sequencing of viruses, inspired by the need to understand the genomic aspects of the virus responsible for COVID-19. For achieving semantic clarity on the VCM, we leverage the “ontological unpacking” method, a process of ontological analysis that reveals the ontological foundation of the information that is represented in a conceptual model. This is accomplished by applying the stereotypes of the OntoUML ontology-driven conceptual modeling language.As a result, we propose a new OntoVCM, an ontologically grounded model, based on the initial VCM, but with guaranteed interoperability among the data sources that employ it. Conclusions: We propose and illustrate how the unpacking of the Viral Conceptual Model resolves several issues related to semantic interoperability, the importance of which is recognized by the “I” in FAIR principles. The research addresses conceptual uncertainty within the domain of SARS-CoV-2 data and knowledge.The method employed provides the basis for further analyses of complex models currently used in life science applications, but lacking ontological grounding, subsequently hindering the interoperability needed for scientists to progress their research.",
                "authors": [
                    {
                        "name": "Bernasconi A."
                    },
                    {
                        "name": "Guizzardi G."
                    },
                    {
                        "name": "Pastor O."
                    },
                    {
                        "name": "Storey V.C."
                    }
                ],
                "citationCount": 6,
                "date": "2022-11-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Semantic interoperability: ontological unpacking of a viral conceptual model"
            },
            "note": "Description of the Viral Conceptual Model (VCM) used by VirusViz"
        },
        {
            "doi": "10.1093/NAR/GKAB478",
            "metadata": {
                "abstract": "Variant visualization plays an important role in supporting the viral evolution analysis, extremely valuable during the COVID-19 pandemic. VirusViz is a web-based application for comparing variants of selected viral populations and their sub-populations; it is primarily focused on SARS-CoV-2 variants, although the tool also supports other viral species (SARS-CoV, MERS-CoV, Dengue, Ebola). As input, VirusViz imports results of queries extracting variants and metadata from the large database ViruSurf, which integrates information about most SARS-CoV-2 sequences publicly deposited worldwide. Moreover, VirusViz accepts sequences of new viral populations as multi-FASTA files plus corresponding metadata in CSV format; a bioinformatic pipeline builds a suitable input for VirusViz by extracting the nucleotide and amino acid variants. Pages of VirusViz provide metadata summarization, variant descriptions, and variant visualization with rich options for zooming, highlighting variants or regions of interest, and switching from nucleotides to amino acids; sequences can be grouped, groups can be comparatively analyzed. For SARS-CoV-2, we manually collect mutations with known or predicted levels of severity/virulence, as indicated in linked research articles; such critical mutations are reported when observed in sequences. The system includes light-weight project management for downloading, resuming, and merging data analysis sessions. VirusViz is freely available at http://gmql.eu/virusviz/.",
                "authors": [
                    {
                        "name": "Alfonsi T."
                    },
                    {
                        "name": "Bernasconi A."
                    },
                    {
                        "name": "Canakoglu A."
                    },
                    {
                        "name": "Ceri S."
                    },
                    {
                        "name": "Gulino A."
                    },
                    {
                        "name": "Pinoli P."
                    },
                    {
                        "name": "Sandionigi A."
                    }
                ],
                "citationCount": 14,
                "date": "2021-09-07T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "VirusViz: Comparative analysis and effective visualization of viral nucleotide and amino acid variants"
            },
            "pmcid": "PMC8344854",
            "pmid": "34107016"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Bioinformatics",
            "uri": "http://edamontology.org/topic_0091"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ],
    "validated": 1
}
