{
    "additionDate": "2017-12-18T00:11:05Z",
    "biotoolsCURIE": "biotools:predcsf",
    "biotoolsID": "predcsf",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.csbio.sjtu.edu.cn/"
        }
    ],
    "description": "The web server PredCSF was developed by using modified one-versus-rest SVMs. The SVMs’input features are composed of physicochemical properties, evolutionary information, second structure and amino acid composition. Each SVM classifier’s output is the probability assigned to a superfamily.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://www.csbio.sjtu.edu.cn/bioinf/PredCSF/Readme.htm"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein sequence analysis",
                    "uri": "http://edamontology.org/operation_2479"
                }
            ]
        }
    ],
    "homepage": "http://www.csbio.sjtu.edu.cn/bioinf/PredCSF/",
    "lastUpdate": "2018-12-29T15:12:07Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/predcsf-predicting-conotoxin-superfamily.html"
        }
    ],
    "name": "PredCSF",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.2174/092986611794578341",
            "metadata": {
                "abstract": "Conotoxins are small disulfide-rich peptides that are invaluable channel-targeted peptides and target neuronal receptors. They show prospects for being potent pharmaceuticals in the treatment of Alzheimer's disease, Parkinson's disease, and epilepsy. Accurate and fast prediction of conotoxin superfamily is very helpful towards the understanding of its biological and pharmacological functions especially in the post-genomic era. In the present study, we have developed a novel approach called PredCSF for predicting the conotoxin superfamily from the amino acid sequence directly based on fusing different kinds of sequential features by using modified one-versus-rest SVMs. The input features to the PredCSF classifiers are composed of physicochemical properties, evolutionary information, predicted secondary structure and amino acid composition, where the most important features are further screened by random forest feature selection to improve the prediction performance. The results show that PredCSF can obtain an overall accuracy of 90.65% based on a benchmark dataset constructed from the most recent database, which consists of 4 main conotoxin superfamilies and 1 class of non-conotoxin class. Systematic experiments also show that combing different features is helpful for enhancing the prediction power when dealing with complex biological problems. PredCSF is expected to be a powerful tool for in silico identification of novel conotonxins and is freely available for academic use at http://www.csbio.sjtu.edu.cn/ bioinf/PredCSF. © 2011 Bentham Science Publishers Ltd.",
                "authors": [
                    {
                        "name": "Fan Y.-X."
                    },
                    {
                        "name": "Kong X."
                    },
                    {
                        "name": "Shen H.-B."
                    },
                    {
                        "name": "Song J."
                    }
                ],
                "citationCount": 18,
                "date": "2011-03-01T00:00:00Z",
                "journal": "Protein and Peptide Letters",
                "title": "PredCSF: An integrated feature-based approach for predicting conotoxin superfamily"
            },
            "pmid": "20955172",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ],
    "validated": 1
}
