{
    "additionDate": "2019-11-14T18:33:38Z",
    "biotoolsCURIE": "biotools:scRNA-seq",
    "biotoolsID": "scRNA-seq",
    "confidence_flag": "very low",
    "credit": [
        {
            "email": "javier.diazmejia@gmail.com",
            "name": "J. Javier Diaz-Mejia",
            "orcidid": "https://orcid.org/0000-0003-2475-3077",
            "typeEntity": "Person"
        },
        {
            "name": "John H. Morris",
            "orcidid": "https://orcid.org/0000-0003-0290-7979",
            "typeEntity": "Person"
        }
    ],
    "description": "> MEDIUM CONFIDENCE! | Evaluation of methods to assign cell type labels to cell clusters from single-cell RNA-sequencing data | Scripts to run and benchmark scRNA-seq cell cluster labeling methods | This repository contains scripts to run and benchmark scRNA-seq cell cluster labeling methods and is a companion to our paper 'Evaluation of methods to assign cell type labels to cell clusters from single-cell RNA-sequencing data' (Diaz-Mejia JJ et al (2019) [Preprint at F1000Research https://doi.org/10.12688/f1000research.18490.1]",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Expression profile clustering",
                    "uri": "http://edamontology.org/operation_0313"
                },
                {
                    "term": "Gene-set enrichment analysis",
                    "uri": "http://edamontology.org/operation_2436"
                },
                {
                    "term": "RNA-Seq analysis",
                    "uri": "http://edamontology.org/operation_3680"
                }
            ]
        }
    ],
    "homepage": "https://github.com/jdime/scRNAseq_cell_cluster_labeling",
    "language": [
        "R",
        "Perl"
    ],
    "lastUpdate": "2019-11-14T18:33:38Z",
    "license": "MIT",
    "name": "scRNA-seq",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.12688/F1000RESEARCH.18490.2",
            "metadata": {
                "abstract": "© 2019 Diaz-Mejia JJ et al.Background: Identification of cell type subpopulations from complex cell mixtures using single-cell RNA-sequencing (scRNA-seq) data includes automated steps from normalization to cell clustering. However, assigning cell type labels to cell clusters is often conducted manually, resulting in limited documentation, low reproducibility and uncontrolled vocabularies. This is partially due to the scarcity of reference cell type signatures and because some methods support limited cell type signatures. Methods: In this study, we benchmarked five methods representing first-generation enrichment analysis (ORA), second-generation approaches (GSEA and GSVA), machine learning tools (CIBERSORT) and network-based neighbor voting (METANEIGHBOR), for the task of assigning cell type labels to cell clusters from scRNA-seq data. We used five scRNA-seq datasets: human liver, 11 Tabula Muris mouse tissues, two human peripheral blood mononuclear cell datasets, and mouse retinal neurons, for which reference cell type signatures were available. The datasets span Drop-seq, 10X Chromium and Seq-Well technologies and range in size from ~3,700 to ~68,000 cells. Results: Our results show that, in general, all five methods perform well in the task as evaluated by receiver operating characteristic curve analysis (average area under the curve (AUC) = 0.91, sd = 0.06), whereas precision-recall analyses show a wide variation depending on the method and dataset (average AUC = 0.53, sd = 0.24). We observed an influence of the number of genes in cell type signatures on performance, with smaller signatures leading more frequently to incorrect results. Conclusions: GSVA was the overall top performer and was more robust in cell type signature subsampling simulations, although different methods performed well using different datasets. METANEIGHBOR and GSVA were the fastest methods. CIBERSORT and METANEIGHBOR were more influenced than the other methods by analyses including only expected cell types. We provide an extensible framework that can be used to evaluate other methods and datasets at https://github.com/jdime/scRNAseq_cell_cluster_labeling.",
                "authors": [
                    {
                        "name": "Diaz-Mejia J.J."
                    },
                    {
                        "name": "Meng E.C."
                    },
                    {
                        "name": "Pico A.R."
                    },
                    {
                        "name": "Macparland S.A."
                    },
                    {
                        "name": "Ketela T."
                    },
                    {
                        "name": "Pugh T.J."
                    },
                    {
                        "name": "Bader G.D."
                    },
                    {
                        "name": "Morris J.H."
                    }
                ],
                "citationCount": 3,
                "date": "2019-01-01T00:00:00Z",
                "journal": "F1000Research",
                "title": "Evaluation of methods to assign cell type labels to cell clusters from single-cell RNA-sequencing data"
            },
            "pmcid": "PMC6720041",
            "pmid": "31508207"
        }
    ],
    "topic": [
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ]
}