{
    "additionDate": "2021-01-18T12:03:06Z",
    "biotoolsCURIE": "biotools:rodiomix",
    "biotoolsID": "rodiomix",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "hbagher1@hfhs.org",
            "name": "Hassan Bagher‐Ebadian",
            "typeEntity": "Person"
        }
    ],
    "description": "A validated software for radiomics analysis of medical images in radiation oncology.\nROdiomiX is a MATLAB-based framework for the computation of radiomic features and feature aggregation techniques in compliance with the Image-Biomarker-Standardization-Initiative (IBSI) guidelines, which includes preprocessing protocols and quantitative benchmark results for analysis of computational phantom images.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                },
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Ebadian-HFHS/ROdiomiX",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2021-03-20T10:48:48Z",
    "name": "ROdiomiX",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1002/MP.14590",
            "metadata": {
                "abstract": "© 2020 American Association of Physicists in MedicinePurpose: This study introduces an in-house-designed software platform (ROdiomiX) for the radiomics analysis of medical images in radiation oncology. ROdiomiX is a MATLAB-based framework for the computation of radiomic features and feature aggregation techniques in compliance with the Image-Biomarker-Standardization-Initiative (IBSI) guidelines, which includes preprocessing protocols and quantitative benchmark results for analysis of computational phantom images. Methods and Materials: The ROdiomiX software system consists of a series of computation cores implemented on the basis of the guidelines proposed by the IBSI. It is capable of quantitative computation of the following 11 different feature categories: Local-Intensity, Intensity-Histogram, Intensity-Based-Statistical, Intensity-Volume-Histogram, Gray-Level-Co-occurrence, Gray-Level-Run-Length, Gray-Level-Size-Zone, Gray-Level-Distance-Zone, Neighborhood-Grey-Tone-Difference, Neighboring-Grey-Level-Dependence, and Morphological feature. ROdiomiX was validated against benchmark values for the IBSI 3D digital phantom, as well as one designed in-house (HFH). The intraclass correlation coefficient (ICC) for estimating the degree of absolute agreement between ROdiomiX computation and benchmark values for different features at the 95% confidence level (CL) was used for comparison. Results: Among the 11 feature categories with 149 total features including 10 different feature aggregation methods (following the IBSI guidelines), the percent difference between absolute feature values computed by the ROdiomiX software and benchmark values reported for IBSI and HFH digital phantoms were 0.14% + 0.43% and 0.11% + 0.27%, respectively. The ICC values were >0.997 for all ten feature categories for both the IBSI and HFH digital phantoms. Conclusion: The authors successfully developed a platform for computation of quantitative radiomic features. The image preprocessing and computational software cores were designed following the procedures specified by the IBSI. Benchmarking testing was in excellent agreement against the IBSI- and HFH-designed computational phantoms.",
                "authors": [
                    {
                        "name": "Bagher-Ebadian H."
                    },
                    {
                        "name": "Chetty I.J."
                    }
                ],
                "date": "2021-01-01T00:00:00Z",
                "journal": "Medical Physics",
                "title": "Technical Note: ROdiomiX: A validated software for radiomics analysis of medical images in radiation oncology"
            },
            "pmid": "33169367"
        }
    ],
    "topic": [
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Tomography",
            "uri": "http://edamontology.org/topic_3452"
        }
    ]
}
