{
    "name": "ENT", 
    "description": "ENT is a highly scalable genotype phasing algorithm based on entropy minimization. ENT is capable of phasing both unrelated and related genotypes coming from complex pedigrees.", 
    "homepage": "http://dna.engr.uconn.edu/?page_id=25", 
    "biotoolsID": "ent", 
    "biotoolsCURIE": "biotools:ent", 
    "version": [
        "1.0.2"
    ], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_3454", 
                    "term": "Phasing"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Command-line tool"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_3053", 
            "term": "Genetics"
        }
    ], 
    "operatingSystem": [
        "Linux"
    ], 
    "language": [
        "C"
    ], 
    "license": null, 
    "collectionID": [], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [
        {
            "url": "http://www.mybiosoftware.com/ent-1-0-2-genotype-phasing-entropy-minimization.html", 
            "type": "Registry", 
            "note": null
        }
    ], 
    "download": [], 
    "documentation": [
        {
            "url": "http://dna.engr.uconn.edu/?page_id=25", 
            "type": "General", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": "10.1109/TCBB.2007.70223", 
            "pmid": null, 
            "pmcid": null, 
            "type": "Primary", 
            "version": null, 
            "metadata": {
                "title": "Highly scalable genotype phasing by entropy minimization", 
                "abstract": "A Single Nucleotide Polymorphism (SNP) is a positionin the genome at which two or more of the possible fournucleotides occur in a large percentage of the population. SNPsaccount for most of the genetic variability between individuals,and mapping SNPs in the human population has become thenext high-priority in genomics after the completion of the HumanGenome project. In diploid organisms such as humans, thereare two non-identical copies of each autosomal chromosome. Adescription of the SNPs in a chromosome is called a haplotype.At present, it is prohibitively expensive to directly determine thehaplotypes of an individual, but it is possible to obtain rather easilythe conflated SNP information in the so called genotype. Computationalmethods for genotype phasing, i.e., inferring haplotypesfrom genotype data, have received much attention in recent yearsas haplotype information leads to increased statistical power ofdisease association tests. However, many of the existing algorithmshave impractical running time for phasing large genotype datasetssuch as those generated by the international HapMap project.In this paper we propose a highly scalable algorithm based onentropy minimization. Our algorithm is capable of phasing bothunrelated and related genotypes coming from complex pedigrees.Experimental results on both real and simulated datasets showthat our algorithm achieves a phasing accuracy worse but closeto that of best existing methods while being several orders ofmagnitude faster. The open source code implementation of thealgorithm and a web interface are publicly available at http://dna.engr.uconn.edu/~software/ent/. © 2006 IEEE.", 
                "date": "2008-04-01T00:00:00Z", 
                "citationCount": 15, 
                "authors": [
                    {
                        "name": "Gusev A."
                    }, 
                    {
                        "name": "Mandoiu I.I."
                    }, 
                    {
                        "name": "Pasaniuc B."
                    }
                ], 
                "journal": "IEEE/ACM Transactions on Computational Biology and Bioinformatics"
            }
        }
    ], 
    "credit": [
        {
            "name": null, 
            "email": null, 
            "url": "http://dna.engr.uconn.edu/", 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "mbs_import", 
    "additionDate": "2017-12-18T00:05:59Z", 
    "lastUpdate": "2018-12-10T12:58:52Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 1, 
    "homepage_status": 0, 
    "elixir_badge": 0
}