{
    "additionDate": "2017-08-03T18:52:26Z",
    "biotoolsCURIE": "biotools:nmff",
    "biotoolsID": "nmff",
    "credit": [
        {
            "email": "brookscl@umich.edu",
            "name": "Charles Brooks",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.mmtsb.org/"
        }
    ],
    "description": "The theory and methods behind NMFF are based on searching along a few lowest frequency normal mode vectors, constructed from a multi-resolution elastic network representation of the atomic structure of interest, to maximize the correlation between the computed electron density for the flexible model and the experimental density.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://www.mmtsb.org/software/nmff.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "http://www.mmtsb.org/software/nmff.html",
    "language": [
        "Perl"
    ],
    "lastUpdate": "2018-12-10T12:58:59Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/nmff-normal-mode-flexible-fitting.html"
        }
    ],
    "name": "NMFF",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "A novel method is presented for the quantitative flexible docking of high-resolution structure into low-resolution maps of macromolecular complexes from electron microscopy. This method uses a linear combination of low-frequency normal modes from elastic network description of the molecular framework in an iterative manner to deform the structure optimally to conform to the low-resolution electron density map. The methodology utilizes gradient following techniques in collective normal modes to locally optimize the overall correlation coefficient between computed and measured electron density. To evaluate the performance of our approach, several proteins, which undergo large conformational changes, have been studied. We demonstrate that refinement based on normal mode analysis provides an accurate and fast alternative for the flexible fitting of high-resolution structure into a low-resolution density map. Additionally, we show that lower resolution (multi-scale) structural models can be used for the normal mode searching in lieu of fully atomic models with little loss of overall accuracy. © 2004 Elsevier Ltd. All rights reserved.",
                "authors": [
                    {
                        "name": "Tama F."
                    },
                    {
                        "name": "Miyashita O."
                    },
                    {
                        "name": "Brooks III C.L."
                    }
                ],
                "citationCount": 167,
                "date": "2004-04-02T00:00:00Z",
                "journal": "Journal of Molecular Biology",
                "title": "Flexible multi-scale fitting of atomic structures into low-resolution electron density maps with elastic network normal mode analysis"
            },
            "pmid": "15033365"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Tomography",
            "uri": "http://edamontology.org/topic_3452"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Data identity and mapping",
            "uri": "http://edamontology.org/topic_3345"
        }
    ],
    "validated": 1
}