{
    "additionDate": "2017-08-03T18:55:34Z",
    "biotoolsCURIE": "biotools:perseus",
    "biotoolsID": "perseus",
    "collectionID": [
        "Proteomics"
    ],
    "credit": [
        {
            "email": "cox@biochem.mpg.de",
            "name": "Jürgen Cox",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.biochem.mpg.de/en/rg/cox"
        }
    ],
    "description": "Software package for shotgun proteomics data analysis, which helps researchers to extract biologically meaningful information from their MaxQuant output such as post-translational modifications.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://www.biochem.mpg.de/en/rg/cox"
        }
    ],
    "editPermission": {
        "authors": [
            "proteomics.bio.tools"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Analysis",
                    "uri": "http://edamontology.org/operation_2945"
                }
            ]
        }
    ],
    "homepage": "http://www.biochem.mpg.de/en/rg/cox",
    "lastUpdate": "2019-07-01T13:53:04Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/perseus-shotgun-proteomics-data-analysis.html"
        }
    ],
    "name": "Perseus",
    "operatingSystem": [
        "Windows"
    ],
    "owner": "cox",
    "publication": [
        {
            "metadata": {
                "abstract": "Quantitative proteomics now provides abundance ratios for thousands of proteins upon perturbations. These need to be functionally interpreted and correlated to other types of quantitative genome-wide data such as the corresponding transcriptome changes. We describe a new method, 2D annotation enrichment, which compares quantitative data from any two 'omics' types in the context of categorical annotation of the proteins or genes. Suitable genome-wide categories are membership of proteins in biochemical pathways, their annotation with gene ontology terms, sub-cellular localization, presence of protein domains or membership in protein complexes. 2D annotation enrichment detects annotation terms whose members show consistent behavior in one or both of the data dimensions. This consistent behavior can be a correlation between the two data types, such as simultaneous up- or down-regulation in both data dimensions, or a lack thereof, such as regulation in one dimension but no change in the other. For the statistical formulation of the test we introduce a two-dimensional generalization of the nonparametric two-sample test. The false discovery rate is stringently controlled by correcting for multiple hypothesis testing. We also describe one-dimensional annotation enrichment, which can be applied to single omics data. The 1D and 2D annotation enrichment algorithms are freely available as part of the Perseus software.",
                "authors": [
                    {
                        "name": "Cox J."
                    },
                    {
                        "name": "Mann M."
                    }
                ],
                "citationCount": 342,
                "date": "2012-01-01T00:00:00Z",
                "journal": "BMC bioinformatics",
                "title": "1D and 2D annotation enrichment: a statistical method integrating quantitative proteomics with complementary high-throughput data."
            },
            "pmid": "23176165"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ],
    "validated": 1
}
