{
    "accessibility": "Open access",
    "additionDate": "2019-08-09T13:22:01Z",
    "biotoolsCURIE": "biotools:GGMs",
    "biotoolsID": "GGMs",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "p.l.horvatovich@rug.nl",
            "name": "Peter Horvatovich",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Exact hypothesis testing for shrinkage based Gaussian Graphical Models.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/V-Bernal/GGM-Shrinkage/blob/master/README.md"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                },
                {
                    "term": "Statistical calculation",
                    "uri": "http://edamontology.org/operation_2238"
                }
            ]
        }
    ],
    "homepage": "https://github.com/V-Bernal/GGM-Shrinkage",
    "language": [
        "R"
    ],
    "lastUpdate": "2020-06-16T10:55:25Z",
    "license": "Unlicense",
    "maturity": "Mature",
    "name": "GGMs",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "hans",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ357",
            "metadata": {
                "abstract": "© 2019 Oxford University Press. All rights reserved.Motivation: One of the main goals in systems biology is to learn molecular regulatory networks from quantitative profile data. In particular, Gaussian graphical models (GGMs) are widely used network models in bioinformatics where variables (e.g. transcripts, metabolites or proteins) are represented by nodes, and pairs of nodes are connected with an edge according to their partial correlation. Reconstructing a GGM from data is a challenging task when the sample size is smaller than the number of variables. The main problem consists in finding the inverse of the covariance estimator which is ill-conditioned in this case. Shrinkage-based covariance estimators are a popular approach, producing an invertible 'shrunk' covariance. However, a proper significance test for the 'shrunk' partial correlation (i.e. the GGM edges) is an open challenge as a probability density including the shrinkage is unknown. In this article, we present (i) a geometric reformulation of the shrinkage-based GGM, and (ii) a probability density that naturally includes the shrinkage parameter. Results: Our results show that the inference using this new 'shrunk' probability density is as accurate as Monte Carlo estimation (an unbiased non-parametric method) for any shrinkage value, while being computationally more efficient. We show on synthetic data how the novel test for significance allows an accurate control of the Type I error and outperforms the network reconstruction obtained by the widely used R package GeneNet. This is further highlighted in two gene expression datasets from stress response in Eschericha coli, and the effect of influenza infection in Mus musculus.",
                "authors": [
                    {
                        "name": "Bernal V."
                    },
                    {
                        "name": "Bischoff R."
                    },
                    {
                        "name": "Grzegorczyk M."
                    },
                    {
                        "name": "Guryev V."
                    },
                    {
                        "name": "Horvatovich P."
                    }
                ],
                "citationCount": 5,
                "date": "2019-12-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Exact hypothesis testing for shrinkage-based Gaussian graphical models"
            },
            "pmid": "31077287",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ],
    "validated": 1
}
