{
    "additionDate": "2020-01-09T17:42:23Z",
    "biotoolsCURIE": "biotools:4mCpred-EL",
    "biotoolsID": "4mCpred-EL",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "weileyi@tju.edu.cn",
            "name": "Leyi Wei",
            "orcidid": "https://orcid.org/0000-0003-1444-190X",
            "typeEntity": "Person"
        },
        {
            "email": "glee@ajou.ac.kr",
            "name": "Gwang Lee",
            "typeEntity": "Person"
        }
    ],
    "description": "A web application for identification of DNA N4-methylcytosine sites in the mouse genome.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "http://thegleelab.org/4mCpred-EL",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-01-11T14:24:29Z",
    "name": "4mCpred-EL",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.3390/CELLS8111332",
            "metadata": {
                "abstract": "DNA N4-methylcytosine (4mC) is one of the key epigenetic alterations, playing essential roles in DNA replication, differentiation, cell cycle, and gene expression. To better understand 4mC biological functions, it is crucial to gain knowledge on its genomic distribution. In recent times, few computational studies, in particular machine learning (ML) approaches have been applied in the prediction of 4mC site predictions. Although ML-based methods are promising for 4mC identification in other species, none are available for detecting 4mCs in the mouse genome. Our novel computational approach, called 4mCpred-EL, is the first method for identifying 4mC sites in the mouse genome where four different ML algorithms with a wide range of seven feature encodings are utilized. Subsequently, those feature encodings predicted probabilistic values are used as a feature vector and are once again inputted to ML algorithms, whose corresponding models are integrated into ensemble learning. Our benchmarking results demonstrated that 4mCpred-EL achieved an accuracy and MCC values of 0.795 and 0.591, which significantly outperformed seven other classifiers by more than 1.5-5.9% and 3.2-11.7%, respectively. Additionally, 4mCpred-EL attained an overall accuracy of 79.80%, which is 1.8-5.1% higher than that yielded by seven other classifiers in the independent evaluation. We provided a user-friendly web server, namely 4mCpred-EL which could be implemented as a pre-screening tool for the identification of potential 4mC sites in the mouse genome.",
                "authors": [
                    {
                        "name": "Manavalan B."
                    },
                    {
                        "name": "Basith S."
                    },
                    {
                        "name": "Shin T.H."
                    },
                    {
                        "name": "Lee D.Y."
                    },
                    {
                        "name": "Wei L."
                    },
                    {
                        "name": "Lee G."
                    }
                ],
                "citationCount": 25,
                "date": "2019-10-28T00:00:00Z",
                "journal": "Cells",
                "title": "4mCpred-EL: An Ensemble Learning Framework for Identification of DNA N4-methylcytosine Sites in the Mouse Genome"
            },
            "pmcid": "PMC6912380",
            "pmid": "31661923"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        },
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        }
    ],
    "validated": 1
}