
{
    "credit": [
    ],
    "labels": {
        "topic": [
            {
                "term": "Psychiatry",
                "uri": "http://edamontology.org/topic_3419"
            },
            {
                "term": "Transcription factors and regulatory sites",
                "uri": "http://edamontology.org/topic_0749"
            },
            {
                "term": "Reproductive health",
                "uri": "http://edamontology.org/topic_3420"
            },
            {
                "term": "Public health and epidemiology",
                "uri": "http://edamontology.org/topic_3305"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© 2019, The Canadian Public Health Association.Setting: Canadian youth (aged 15–29 years) are more diverse, educated, connected and socially engaged than ever before. However, many face health-related challenges, including mental health problems (10–20%), substance use concerns (14%) and obesity (45%). Intervention: The Young Canadians Roundtable on Health (YCRH) was created in 2013 to be Canada’s youth voice on health. Supported by the Sandbox Project, this youth-led advisory works primarily virtually, leading advocacy projects and wide-ranging health initiatives. Outcomes: Youth and adult allies engaged in a participatory research evaluation of the YCRH, which was identified as a living laboratory, where youth could experiment with ideas and provide new perspectives on health issues. Adult allies reported learning new skills from youth, and youth gained advocacy and leadership skills. Collaborative projects resulted in a sense of shared achievement. Further, youth increased their connections to health and youth-serving spaces across the country. Identified challenges included difficulties in coordinating a national roundtable and defining shared responsibilities. Implications: The researchers generated the following evidence-based promising practices for youth engagement in health systems and program planning: (1) provide a consistent platform for youth input; (2) appreciate different forms of knowledge, expertise and communication methods; (3) invest in relationships and build mutual understanding among youth and adults; (4) for adult allies, be patient and comfortable with the ambiguity and unpredictability of working with youth; and (5) continually revisit and renegotiate structure and flexibility.",
            "authors": [
                "Ramey H.L.",
                "Rayner M.-E.",
                "Mahdy S.S.",
                "Lawford H.L.",
                "Lanctot J.",
                "Campbell M.",
                "Valenzuela E.",
                "Miller J.",
                "Hazlett V."
            ],
            "cit_count": 0,
            "doi": "10.17269/S41997-019-00254-9",
            "journal": "Canadian Journal of Public Health",
            "pmid": "31595419",
            "title": "The Young Canadians Roundtable on Health: promising practices for youth and adults working in partnership",
            "year": "2019-10-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:YCRH",
        "biotoolsID": "YCRH",
        "description": "promising practices for youth and adults working in partnership.\n\nSETTING:Canadian youth (aged 15-29 years) are more diverse, educated, connected and socially engaged than ever before. However, many face health-related challenges, including mental health problems (10-20%), substance use concerns (14%) and obesity (45%). INTERVENTION:The Young Canadians Roundtable on Health (YCRH) was created in 2013 to be Canada's youth voice on health. Supported by the Sandbox Project, this youth-led advisory works primarily virtually, leading advocacy projects and wide-ranging health initiatives. OUTCOMES:Youth and adult allies engaged in a participatory research evaluation of the YCRH, which was identified as a living laboratory, where youth could experiment with ideas and provide new perspectives on health issues.\n\n||| HOMEPAGE BROKEN!.\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'Young Canadians Roundtable Health', 'engagement', 'youth', 'youth-led'",
        "homepage": "http://sandboxproject.ca/ycrh-ebook/",
        "name": "YCRH"
    }
}