
{
    "credit": [
        {
            "email": "fmelo@bio.puc.cl",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://melolab.org/mbl/"
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://melolab.org/sagexplore/tutorial.php"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Genetic mapping",
                    "uri": "http://edamontology.org/operation_0282"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Data submission, annotation and curation",
                "uri": "http://edamontology.org/topic_0219"
            },
            {
                "term": "DNA",
                "uri": "http://edamontology.org/topic_0654"
            },
            {
                "term": "Genomics",
                "uri": "http://edamontology.org/topic_0622"
            },
            {
                "term": "Mapping",
                "uri": "http://edamontology.org/topic_0102"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://www.mybiosoftware.com/sagexplore-map-sage-tags-genomic-annotation.html"
        }
    ],
    "publication": [
        {
            "abstract": "We describe a web server for the accurate mapping of experimental tags in serial analysis of gene expression (SAGE). The core of the server relies on a database of genomic virtual tags built by a recently described method that attempts to reduce the amount of ambiguous assignments for those tags that are not unique in the genome. The method provides a complete annotation of potential virtual SAGE tags within a genome, along with an estimation of their confidence for experimental observation that ranks tags that present multiple matches in the genome. The output of the server consists of a table in HTML format that contains links to a graphic representation of the results and to some external servers and databases, facilitating the tasks of analysis of gene expression and gene discovery. Also, a table in tab delimited text format is produced, allowing the user to export the results into custom databases and software for further analysis. The current server version provides the most accurate and complete SAGE tag mapping source that is available for the yeast organism. In the near future, this server will also allow the accurate mapping of experimental SAGE-tags from other model organisms such as human, mouse, frog and fly. The server is freely available on the web at: http://dna.bio.puc.cl/ SAGExplore.html. © 2007 The Author(s).",
            "authors": [
                "Norambuena T.",
                "Malig R.",
                "Melo F."
            ],
            "cit_count": 1,
            "journal": "Nucleic Acids Research",
            "pmid": "17626053",
            "title": "SAGExplore: A web server for unambiguous tag mapping in serial analysis of gene expression oriented to gene discovery and annotation",
            "year": "2007-07-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:sagexplore",
        "biotoolsID": "sagexplore",
        "description": "A server for the mapping of SAGE tags against a genomic annotation.",
        "homepage": "http://melolab.org/sagexplore/home.php",
        "name": "SAGExplore"
    }
}