{
    "additionDate": "2020-01-14T20:11:11Z",
    "biotoolsCURIE": "biotools:iMED",
    "biotoolsID": "iMED",
    "confidence_flag": "low",
    "credit": [
        {
            "email": "a.rheingans@uke.de",
            "name": "Anke Rheingans",
            "typeEntity": "Person"
        }
    ],
    "description": "The Hamburg integrated medical degree program iMED.\n\nDer iMED-Studiengang wurde von Lehrenden und Studierenden gemeinsam entwickelt und vernetzt von Anfang an theoretische Grundlagen mit klinischer Praxis.\n\nSeit 2012 bieten wir mit dem integrierten Modellstudiengang Medizin Hamburg (iMED) ein zukunftsweisendes Konzept für die Ausbildung von Ärztinnen und Ärzten. Lehrende aus allen Fächern haben gemeinsam mit Studierenden in einer mehrjährigen Vorbereitungsphase einen Studiengang entwickelt, der von Anfang an die theoretischen Grundlagenfächer mit der klinischen Praxis vernetzt. Unser Ansatz hat bundesweiten Modellcharakter: zentrale Empfehlungen des Wissenschaftsrates für die Weiterentwicklung des Medizinstudiums in Deutschland finden sich im iMED – Konzept wieder. Theoretisch können Sie auch woanders Medizin studieren – praktisch am besten bei uns",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://www.uke.de/studium-lehre/modellstudiengang-medizin-imed/",
    "lastUpdate": "2020-01-14T20:11:11Z",
    "name": "iMED",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.3205/ZMA001260",
            "metadata": {
                "abstract": "© 2019 Rheingans et al.The integrated medical degree program (iMED) was established in winter semester 2012/2013 at the Faculty of Medicine of Universität Hamburg with the aim of improving medical education. The main features of the iMED medical degree program include the close integration of theoretical knowledge and practical skills, scientific orientation and the teaching of psychosocial and communication skills. All these features are commonly found in the modular compulsory core curriculum and elective courses (“2nd Tracks”): The compulsory core curriculum comprises 19 modules which are arranged thematically in seven module groups and cover three stages of a “learning spiral”. By comprehensively coordinating the teaching content and the learning objectives of the participating theoretical and clinical subjects, theoretical content is taught on the basis of real patient’s medical histories from the first stage of the learning spiral. The elective courses enable students to learn and apply scientific work in a structured curriculum according to their own interests. Relevant practical skills for students future professional routines are taught in the longitudinal training course “Clinical Examination Methods plus Communication” (KUMplusKOM), which runs through the entire curriculum up to the final practical year. Accompanying, extra-curricular projects such as crash courses in the natural sciences or using the iMED Textbook as an online learning platform increase the attractiveness of the iMED degree program. Results of the evaluation show that the introduction and the accompanying optimization of iMED were very successful.",
                "authors": [
                    {
                        "name": "Rheingans A."
                    },
                    {
                        "name": "Soulos A."
                    },
                    {
                        "name": "Mohr S."
                    },
                    {
                        "name": "Meyer J."
                    },
                    {
                        "name": "Guse A.H."
                    }
                ],
                "citationCount": 3,
                "date": "2019-01-01T00:00:00Z",
                "journal": "GMS Journal for Medical Education",
                "title": "The hamburg integrated medical degree program iMED Der integrierte modellstudiengang medizin hamburg iMED"
            },
            "pmcid": "PMC6883244",
            "pmid": "31815162"
        }
    ],
    "topic": [
        {
            "term": "Complementary medicine",
            "uri": "http://edamontology.org/topic_3423"
        },
        {
            "term": "Anatomy",
            "uri": "http://edamontology.org/topic_3067"
        },
        {
            "term": "Database management",
            "uri": "http://edamontology.org/topic_3489"
        }
    ]
}