{
    "accessibility": "Open access",
    "additionDate": "2019-08-09T13:18:17Z",
    "biotoolsCURIE": "biotools:PastML",
    "biotoolsID": "PastML",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "anna.zhukova@pasteur.fr",
            "name": "Anna Zhukova",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "olivier.gascuel@pasteur.fr",
            "name": "Olivier Gascuel",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Fast inference and visualization of ancestral scenarios. PastML infers ancestral characters on a rooted phylogenetic tree with annotated tips, using maximum likelihood or parsimony. The result is then visualised as a zoomable html map.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://pastml.pasteur.fr/help"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "https://github.com/evolbioinfo/pastml/releases"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Phylogenetic tree visualisation",
                    "uri": "http://edamontology.org/operation_0567"
                },
                {
                    "term": "Phylogenetic tree reconstruction",
                    "uri": "http://edamontology.org/operation_3478"
                },
                {
                    "term": "Ancestral reconstruction",
                    "uri": "http://edamontology.org/operation_3745"
                }
            ]
        }
    ],
    "homepage": "https://pastml.pasteur.fr/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-06-16T10:55:26Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/evolbioinfo/pastml"
        },
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/evolbioinfo/pastml/issues"
        }
    ],
    "maturity": "Mature",
    "name": "PastML",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "hans",
    "publication": [
        {
            "doi": "10.1093/MOLBEV/MSZ131",
            "metadata": {
                "abstract": "© 2019 The Author(s). Published by Oxford University Press on behalf of the Society for Molecular Biology and Evolution.The reconstruction of ancestral scenarios is widely used to study the evolution of characters along phylogenetic trees. One commonly uses the marginal posterior probabilities of the character states, or the joint reconstruction of the most likely scenario. However, marginal reconstructions provide users with state probabilities, which are difficult to interpret and visualize, whereas joint reconstructions select a unique state for every tree node and thus do not reflect the uncertainty of inferences. We propose a simple and fast approach, which is in between these two extremes. We use decision-theory concepts (namely, the Brier score) to associate each node in the tree to a set of likely states. A unique state is predicted in tree regions with low uncertainty, whereas several states are predicted in uncertain regions, typically around the tree root. To visualize the results, we cluster the neighboring nodes associated with the same states and use graph visualization tools. The method is implemented in the PastML program and web server. The results on simulated data demonstrate the accuracy and robustness of the approach. PastML was applied to the phylogeography of Dengue serotype 2 (DENV2), and the evolution of drug resistances in a large HIV data set. These analyses took a few minutes and provided convincing results. PastML retrieved the main transmission routes of human DENV2 and showed the uncertainty of the human-sylvatic DENV2 geographic origin. With HIV, the results show that resistance mutations mostly emerge independently under treatment pressure, but resistance clusters are found, corresponding to transmissions among untreated patients.",
                "authors": [
                    {
                        "name": "Ishikawa S.A."
                    },
                    {
                        "name": "Zhukova A."
                    },
                    {
                        "name": "Iwasaki W."
                    },
                    {
                        "name": "Gascuel O."
                    },
                    {
                        "name": "Pupko T."
                    }
                ],
                "citationCount": 14,
                "date": "2019-09-01T00:00:00Z",
                "journal": "Molecular Biology and Evolution",
                "title": "A Fast Likelihood Method to Reconstruct and Visualize Ancestral Scenarios"
            },
            "pmid": "31127303",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        }
    ],
    "validated": 1
}