{
    "additionDate": "2020-01-14T08:56:46Z",
    "biotoolsCURIE": "biotools:ADDO",
    "biotoolsID": "ADDO",
    "confidence_flag": "tool",
    "description": "a comprehensive toolkit to detect, classify and visualise additive and non-additive Quantitative Trait Loci.\n\nWe developed ADDO, a highly-efficient tool designed to detect, classify and visualize quantitative trait loci (QTLs) with additive and non-additive effects. ADDO implements a mixed-model transformation to control for population structure and unequal relatedness that accounts for both additive and dominant genetic covariance among individuals, and decomposes single nucleotide polymorphism (SNP) effects into additive, partial dominance, dominance and overdominance categories. A matrix multiplication approach is used to accelerate the computation: a genome scan on 20 million markers from 836 individuals takes about 8.5 hours with 10 CPUs.\n\nAdditivity and dominance are the major genetic components underlying variations in complex traits",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genetic mapping",
                    "uri": "http://edamontology.org/operation_0282"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                }
            ]
        }
    ],
    "homepage": "https://github.com/LeileiCui/ADDO",
    "language": [
        "R"
    ],
    "lastUpdate": "2020-12-01T14:56:23Z",
    "license": "LGPL-3.0",
    "name": "ADDO",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ786",
            "metadata": {
                "abstract": "© The Author(s) 2019. Published by Oxford University Press. All rights reserved.Motivation: During the past decade, genome-wide association studies (GWAS) have been used to map quantitative trait loci (QTLs) underlying complex traits. However, most GWAS focus on additive genetic effects while ignoring non-additive effects, on the assumption that most QTL act additively. Consequently, QTLs driven by dominance and other non-additive effects could be overlooked. Results: We developed ADDO, a highly efficient tool to detect, classify and visualize QTLs with additive and nonadditive effects. ADDO implements a mixed-model transformation to control for population structure and unequal relatedness that accounts for both additive and dominant genetic covariance among individuals, and decomposes single-nucleotide polymorphism effects as either additive, partial dominant, dominant or over-dominant. A matrix multiplication approach is used to accelerate the computation: a genome scan on 13 million markers from 900 individuals takes about 5 h with 10 CPUs. Analysis of simulated data confirms ADDO's performance on traits with different additive and dominance genetic variance components. We showed two real examples in outbred rat where ADDO identified significant dominant QTL that were not detectable by an additive model. ADDO provides a systematic pipeline to characterize additive and non-additive QTL in whole genome sequence data, which complements current mainstream GWAS software for additive genetic effects. Availability and implementation: ADDO is customizable and convenient to install and provides extensive analytics and visualizations. The package is freely available online at https://github.com/LeileiCui/ADDO.",
                "authors": [
                    {
                        "name": "Cui L."
                    },
                    {
                        "name": "Huang L."
                    },
                    {
                        "name": "Mott R."
                    },
                    {
                        "name": "Pontikos N."
                    },
                    {
                        "name": "Yang B."
                    }
                ],
                "date": "2020-03-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "ADDO: A comprehensive toolkit to detect, classify and visualize additive and non-additive quantitative trait loci"
            },
            "pmid": "31764991"
        }
    ],
    "topic": [
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "GWAS study",
            "uri": "http://edamontology.org/topic_3517"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ],
    "validated": 1
}
