{
    "additionDate": "2020-01-14T09:16:34Z",
    "biotoolsCURIE": "biotools:ClusterBurden",
    "biotoolsID": "ClusterBurden",
    "confidence_flag": "tool",
    "description": "Enhanced prediction of gene and missense rare-variant pathogenicity by joint analysis of gene burden and amino-acid residue position.\n\nRare variant association using position and burden signals.\n\nThis method is designed for case-control studies where the condition under investigation is caused by rare variants in protein-coding regions. This is the case for most Mendelian diseases and therefore this method is relevant for these",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Collapsing methods",
                    "uri": "http://edamontology.org/operation_3791"
                },
                {
                    "term": "Gene prediction",
                    "uri": "http://edamontology.org/operation_2454"
                },
                {
                    "term": "Variant classification",
                    "uri": "http://edamontology.org/operation_3225"
                },
                {
                    "term": "Virulence prediction",
                    "uri": "http://edamontology.org/operation_3461"
                }
            ]
        }
    ],
    "homepage": "https://github.com/adamwaring/ClusterBurden",
    "language": [
        "R"
    ],
    "lastUpdate": "2024-11-24T20:54:50.869192Z",
    "name": "ClusterBurden",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1101/826164"
        },
        {
            "doi": "10.1136/jmedgenet-2020-106922",
            "metadata": {
                "abstract": "Background Although rare missense variants in Mendelian disease genes often cluster in specific regions of proteins, it is unclear how to consider this when evaluating the pathogenicity of a gene or variant. Here we introduce methods for gene association and variant interpretation that use this powerful signal. Methods We present statistical methods to detect missense variant clustering (BIN-test) combined with burden information (ClusterBurden). We introduce a flexible generalised additive modelling (GAM) framework to identify mutational hotspots using burden and clustering information (hotspot model) and supplemented by in silico predictors (hotspot+ model). The methods were applied to synthetic data and a case-control dataset, comprising 5338 hypertrophic cardiomyopathy patients and 125 748 population reference samples over 34 putative cardiomyopathy genes. Results In simulations, the BIN-test was almost twice as powerful as the Anderson-Darling or Kolmogorov-Smirnov tests; ClusterBurden was computationally faster and more powerful than alternative position-informed methods. For 6/8 sarcomeric genes with strong clustering, Clusterburden showed enhanced power over burden-alone, equivalent to increasing the sample size by 50%. Hotspot+ models that combine burden, clustering and in silico predictors outperform generic pathogenicity predictors and effectively integrate ACMG criteria PM1 and PP3 to yield strong or moderate evidence of pathogenicity for 31.8% of examined variants of uncertain significance. Conclusion GAMs represent a unified statistical modelling framework to combine burden, clustering and functional information. Hotspot models can refine maps of regional burden and hotspot+ models can be powerful predictors of variant pathogenicity. The BIN-test is a fast powerful approach to detect missense variant clustering that when combined with burden information (ClusterBurden) may enhance disease-gene discovery.",
                "authors": [
                    {
                        "name": "Farrall M."
                    },
                    {
                        "name": "Harper A."
                    },
                    {
                        "name": "Kramer C."
                    },
                    {
                        "name": "Neubauer S."
                    },
                    {
                        "name": "Salatino S."
                    },
                    {
                        "name": "Thomson K."
                    },
                    {
                        "name": "Waring A."
                    },
                    {
                        "name": "Watkins H."
                    }
                ],
                "citationCount": 2,
                "date": "2021-08-01T00:00:00Z",
                "journal": "Journal of Medical Genetics",
                "title": "Data-driven modelling of mutational hotspots and in silico predictors in hypertrophic cardiomyopathy"
            },
            "pmcid": "PMC8327322",
            "pmid": "32732227"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Exome sequencing",
            "uri": "http://edamontology.org/topic_3676"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Public health and epidemiology",
            "uri": "http://edamontology.org/topic_3305"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ],
    "validated": 1
}
