{
    "accessibility": [],
    "additionDate": "2017-08-03T19:08:32Z",
    "biotoolsCURIE": "biotools:tagimpute",
    "biotoolsID": "tagimpute",
    "collectionID": [],
    "confidence_flag": null,
    "cost": null,
    "credit": [
        {
            "email": null,
            "gridid": null,
            "name": null,
            "note": null,
            "orcidid": null,
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://dlin.web.unc.edu/people/"
        }
    ],
    "description": "A command-line program for the imputation of untyped SNPs. It is based on a few flanking SNPs that can optimally predict the SNP under imputation.",
    "documentation": [
        {
            "note": null,
            "type": "General",
            "url": "http://dlin.web.unc.edu/software/tagimpute-2/"
        }
    ],
    "download": [],
    "editPermission": {
        "authors": [],
        "type": "private"
    },
    "elixirNode": [],
    "elixirPlatform": [],
    "elixir_badge": 0,
    "function": [
        {
            "cmd": null,
            "input": [],
            "note": null,
            "operation": [
                {
                    "term": "Sequence mutation and randomisation",
                    "uri": "http://edamontology.org/operation_0367"
                }
            ],
            "output": []
        }
    ],
    "homepage": "http://dlin.web.unc.edu/software/tagimpute-2/",
    "homepage_status": 0,
    "language": [],
    "lastUpdate": "2018-12-10T12:58:45Z",
    "license": null,
    "link": [
        {
            "note": null,
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/tagimpute-1-0-tag-based-imputation.html"
        }
    ],
    "maturity": null,
    "name": "tagIMPUTE",
    "operatingSystem": [
        "Linux"
    ],
    "otherID": [],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": null,
            "metadata": {
                "abstract": "Analysis of untyped single nucleotide polymorphisms (SNPs) can facilitate the localization of disease-causing variants and permit meta-analysis of association studies with different genotyping platforms. We present two approaches for using the linkage disequilibrium structure of an external reference panel to infer the unknown value of an untyped SNP from the observed genotypes of typed SNPs. The maximum-likelihood approach integrates the prediction of untyped genotypes and estimation of association parameters into a single framework and yields consistent and efficient estimators of genetic effects and gene-environment interactions with proper variance estimators. The imputation approach is a two-stage strategy, which first imputes the untyped genotypes by either the most likely genotypes or the expected genotype counts and then uses the imputed values in a downstream association analysis. The latter approach has proper control of type I error in single-SNP tests with possible covariate adjustments even when the reference panel is misspecified; however, type I error may not be properly controlled in testing multiple-SNP effects or gene-environment interactions. In general, imputation yields biased estimators of genetic effects and gene-environment interactions, and the variances are underestimated. We conduct extensive simulation studies to compare the bias, type I error, power, and confidence interval coverage between the maximum likelihood and imputation approaches in the analysis of single-SNP effects, multiple-SNP effects, and gene-environment interactions under cross-sectional and case-control designs. In addition, we provide an illustration with genome-wide data from the Wellcome Trust Case-Control Consortium (WTCCC) [2007]. © 2010 Wiley-Liss, Inc.",
                "authors": [
                    {
                        "name": "Hu Y.J."
                    },
                    {
                        "name": "Lin D.Y."
                    }
                ],
                "citationCount": 11,
                "date": "2010-12-01T00:00:00Z",
                "journal": "Genetic Epidemiology",
                "title": "Analysis of untyped SNPs: Maximum likelihood and imputation methods"
            },
            "note": null,
            "pmcid": null,
            "pmid": "21104886",
            "type": null,
            "version": null
        }
    ],
    "relation": [],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        }
    ],
    "validated": 1,
    "version": []
}