
{
    "credit": [
        {
            "email": "mktrost@umich.edu",
            "name": "Mary Kate Wing",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "https://groups.google.com/forum/#!forum/bamUtils"
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "https://genome.sph.umich.edu/wiki/BamUtil"
        },
        {
            "type": "GENERAL",
            "url": "https://github.com/statgen/bamUtil"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Data handling",
                    "uri": "http://edamontology.org/operation_2409"
                }
            ]
        }
    ],
    "labels": {
        "collectionID": [
            "Animal and Crop Genomics"
        ],
        "language": [
            "C"
        ],
        "license": "GPL-3.0",
        "operatingSystem": [
            "Linux"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Data management",
                "uri": "http://edamontology.org/topic_3071"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© 2015 Jun et al.The analysis of next-generation sequencing data is computationally and statistically challenging because of the massive volume of data and imperfect data quality. We present GotCloud, a pipeline for efficiently detecting and genotyping highquality variants from large-scale sequencing data. GotCloud automates sequence alignment, sample-level quality control, variant calling, filtering of likely artifacts using machine-learning techniques, and genotype refinement using haplotype information. The pipeline can process thousands of samples in parallel and requires less computational resources than current alternatives. Experiments with whole-genome and exome-targeted sequence data generated by the 1000 Genomes Project show that the pipeline provides effective filtering against false positive variants and high power to detect true variants. Our pipeline has already contributed to variant detection and genotyping in several large-scale sequencing projects, including the 1000 Genomes Project and the NHLBI Exome Sequencing Project. We hope it will now prove useful to many medical sequencing studies.",
            "authors": [
                "Jun G.",
                "Wing M.K.",
                "Abecasis G.R.",
                "Kang H.M."
            ],
            "cit_count": 27,
            "doi": "10.1101/gr.176552.114",
            "journal": "Genome Research",
            "title": "An efficient and scalable analysis framework for variant extraction and refinement from population-scale DNA sequence data",
            "type": "Primary",
            "year": "2015-06-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:bamutil",
        "biotoolsID": "bamutil",
        "description": "Bamutil provides a serie of programs to work on SAM/BAM files.",
        "homepage": "http://genome.sph.umich.edu/wiki/BamUtil",
        "name": "Bamutil"
    }
}