{
    "additionDate": "2020-01-14T19:53:30Z",
    "biotoolsCURIE": "biotools:miR-206_hMCs_miR-206",
    "biotoolsID": "miR-206_hMCs_miR-206",
    "confidence_flag": "high",
    "description": "miR-206 Inhibits Cell Proliferation and Extracellular Matrix Accumulation by Targeting Hypoxia-Inducible Factor 1-alpha (HIF-1α) in Mesangial Cells Treated with High Glucose.\n\nBACKGROUND The goal of this study was to investigate the expression of miR-206 in human glomerular mesangial cells (hMCs) treated by exposure to high glucose (HG) levels, to assess the influence of miR-206 on the proliferation and extracellular matrix (ECM) deposition of hMCs, and to investigate the potential mechanisms of action. MATERIAL AND METHODS The level of miR-206 was detected by RT-qPCR. MTT assay and colony formation assay were used to assess hMCs cell proliferation ability. Western blotting was carried out to measure the expression of related proteins.\n\n||| HOMEPAGE MISSING!.\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'hMCs miR-206', 'miR-206 hMCs', 'miR-206 mimics miR-206', 'regulated miR-206 hMCs miR-206'",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                },
                {
                    "term": "miRNA target prediction",
                    "uri": "http://edamontology.org/operation_0463"
                }
            ]
        }
    ],
    "homepage": "https://www.ncbi.nlm.nih.gov/pubmed/?term=31880296",
    "lastUpdate": "2020-01-14T19:53:30Z",
    "name": "miR-206 hMCs miR-206",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.12659/MSM.918912",
            "metadata": {
                "abstract": "BACKGROUND The goal of this study was to investigate the expression of miR-206 in human glomerular mesangial cells (hMCs) treated by exposure to high glucose (HG) levels, to assess the influence of miR-206 on the proliferation and extracellular matrix (ECM) deposition of hMCs, and to investigate the potential mechanisms of action. MATERIAL AND METHODS The level of miR-206 was detected by RT-qPCR. MTT assay and colony formation assay were used to assess hMCs cell proliferation ability. Western blotting was carried out to measure the expression of related proteins. Bioinformatics software (http://www.targetscan.org) was used to predict the potential target genes of miR-206, and dual-luciferase reporter assay was used to confirm this prediction. RESULTS Our results suggest that the level of miR-206 was downregulated in HG-treated hMCs. Cell proliferation was promoted in HG-induced hMCs, while this phenomenon was significantly reversed with miR-206 mimics. miR-206 mimics significantly enhanced p21 expression and decreased cyclin D1 and CDK2 expressions, but the opposite was found in HG-induced hMCs. Moreover, the level of ECM proteins was notably increased in hMCs treated with HG, which was also significantly reversed by miR-206 mimics. miR-206 inhibitor had the opposite effects. Furthermore, HIF-1alpha was found to be a direct target of miR-206, and was negatively regulated by miR-206 in hMCs. miR-206 can target HIF-1alpha to modulate cell proliferation and ECM accumulation. CONCLUSIONS Collectively, our results suggest that miR-206 plays a vital role in HG-treated hMCs through inhibiting cell proliferation and ECM accumulation, partly via targeting HIF-1alpha.",
                "authors": [
                    {
                        "name": "Cao Y."
                    },
                    {
                        "name": "Cao X."
                    },
                    {
                        "name": "Sun L."
                    },
                    {
                        "name": "Li Y."
                    }
                ],
                "date": "2019-12-27T00:00:00Z",
                "journal": "Medical science monitor : international medical journal of experimental and clinical research",
                "title": "miR-206 Inhibits Cell Proliferation and Extracellular Matrix Accumulation by Targeting Hypoxia-Inducible Factor 1-alpha (HIF-1α) in Mesangial Cells Treated with High Glucose"
            },
            "pmid": "31880296"
        }
    ],
    "topic": [
        {
            "term": "PCR experiment",
            "uri": "http://edamontology.org/topic_3519"
        },
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ]
}