{
    "additionDate": "2020-01-14T20:15:25Z",
    "biotoolsCURIE": "biotools:Wang-xiaoheng",
    "biotoolsID": "Wang-xiaoheng",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "sfwang_66@ynu.edu.cn",
            "name": "Shunfang Wang",
            "typeEntity": "Person"
        }
    ],
    "description": "Prediction of protein structural classes by different feature expressions based on 2-D wavelet denoising and fusion.\n\n2D-wavelet-for-protein-structural-classes-prediction We constructed a prediction model based on wavelet denoising using different feature expression methods. A new fusion idea, first fuse and then denoise, is proposed in this article. Two types of pseudo amino acid compositions are utilized to distill feature vectors. Then, a two-dimensional (2-D) wavelet denoising algorithm is used to remove the redundant information from two extracted feature vectors. The two feature vectors based on parallel 2-D wavelet denoising are fused, which is known as PWD-FU-PseAAC. The project includes three original datasets, source code for two-dimensional wavelet denoising and source code for feature vector prediction",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Fold recognition",
                    "uri": "http://edamontology.org/operation_0303"
                },
                {
                    "term": "Protein secondary structure prediction",
                    "uri": "http://edamontology.org/operation_0267"
                },
                {
                    "term": "Protein structure prediction",
                    "uri": "http://edamontology.org/operation_0474"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Xiaoheng-Wang12/Wang-xiaoheng/tree/master",
    "lastUpdate": "2021-01-03T16:01:50Z",
    "name": "Wang-xiaoheng",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12859-019-3276-5",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Protein structural class predicting is a heavily researched subject in bioinformatics that plays a vital role in protein functional analysis, protein folding recognition, rational drug design and other related fields. However, when traditional feature expression methods are adopted, the features usually contain considerable redundant information, which leads to a very low recognition rate of protein structural classes. Results: We constructed a prediction model based on wavelet denoising using different feature expression methods. A new fusion idea, first fuse and then denoise, is proposed in this article. Two types of pseudo amino acid compositions are utilized to distill feature vectors. Then, a two-dimensional (2-D) wavelet denoising algorithm is used to remove the redundant information from two extracted feature vectors. The two feature vectors based on parallel 2-D wavelet denoising are fused, which is known as PWD-FU-PseAAC. The related source codes are available at https://github.com/Xiaoheng-Wang12/Wang-xiaoheng/tree/master. Conclusions: Experimental verification of three low-similarity datasets suggests that the proposed model achieves notably good results as regarding the prediction of protein structural classes.",
                "authors": [
                    {
                        "name": "Wang S."
                    },
                    {
                        "name": "Wang X."
                    }
                ],
                "citationCount": 3,
                "date": "2019-12-24T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Prediction of protein structural classes by different feature expressions based on 2-D wavelet denoising and fusion"
            },
            "pmcid": "PMC6929547",
            "pmid": "31874617"
        }
    ],
    "topic": [
        {
            "term": "Protein folds and structural domains",
            "uri": "http://edamontology.org/topic_0736"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Structure prediction",
            "uri": "http://edamontology.org/topic_0082"
        }
    ],
    "validated": 1
}
