{
    "accessibility": [],
    "additionDate": "2017-12-18T00:06:42Z",
    "biotoolsCURIE": "biotools:gem-trend",
    "biotoolsID": "gem-trend",
    "collectionID": [],
    "confidence_flag": null,
    "cost": null,
    "credit": [
        {
            "email": null,
            "gridid": null,
            "name": null,
            "note": null,
            "orcidid": null,
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://pharminfo.pharm.kyoto-u.ac.jp/"
        }
    ],
    "description": "GEM-TREND, a web tool for searching gene expression data, allows users to search data from GEO using gene-expression signatures or gene expression ratio data as a query and retrieve gene expression data by comparing gene-expression pattern between the query and GEO gene expression data.",
    "documentation": [
        {
            "note": null,
            "type": "User manual",
            "url": "http://cgs.pharm.kyoto-u.ac.jp/network/GEM-TREND_Manual.pdf"
        }
    ],
    "download": [],
    "editPermission": {
        "authors": [],
        "type": "private"
    },
    "elixirNode": [],
    "elixirPlatform": [],
    "elixir_badge": 0,
    "function": [
        {
            "cmd": null,
            "input": [],
            "note": null,
            "operation": [
                {
                    "term": "Query",
                    "uri": "http://edamontology.org/operation_0224"
                }
            ],
            "output": []
        },
        {
            "cmd": null,
            "input": [],
            "note": null,
            "operation": [
                {
                    "term": "Search",
                    "uri": "http://edamontology.org/operation_2421"
                }
            ],
            "output": []
        }
    ],
    "homepage": "http://cgs.pharm.kyoto-u.ac.jp/network/",
    "homepage_status": 0,
    "language": [
        "PHP",
        "Java",
        "R"
    ],
    "lastUpdate": "2018-12-10T12:58:57Z",
    "license": null,
    "link": [
        {
            "note": null,
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/gem-trend-gene-expression-data-mining-toward-relevant-network-discovery.html"
        }
    ],
    "maturity": null,
    "name": "GEM-TREND",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "otherID": [],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1186/1471-2164-10-411",
            "metadata": {
                "abstract": "Background: DNA microarray technology provides us with a first step toward the goal of uncovering gene functions on a genomic scale. In recent years, vast amounts of gene expression data have been collected, much of which are available in public databases, such as the Gene Expression Omnibus (GEO). To date, most researchers have been manually retrieving data from databases through web browsers using accession numbers (IDs) or keywords, but gene-expression patterns are not considered when retrieving such data. The Connectivity Map was recently introduced to compare gene expression data by introducing gene-expression signatures (represented by a set of genes with up- or down-regulated labels according to their biological states) and is available as a web tool for detecting similar gene-expression signatures from a limited data set (approximately 7,000 expression profiles representing 1,309 compounds). In order to support researchers to utilize the public gene expression data more effectively, we developed a web tool for finding similar gene expression data and generating its co-expression networks from a publicly available database. Results: GEM-TREND, a web tool for searching gene expression data, allows users to search data from GEO using gene-expression signatures or gene expression ratio data as a query and retrieve gene expression data by comparing gene-expression pattern between the query and GEO gene expression data. The comparison methods are based on the nonparametric, rank-based pattern matching approach of Lamb et al. (Science 2006) with the additional calculation of statistical significance. The web tool was tested using gene expression ratio data randomly extracted from the GEO and with in-house microarray data, respectively. The results validated the ability of GEM-TREND to retrieve gene expression entries biologically related to a query from GEO. For further analysis, a network visualization interface is also provided, whereby genes and gene annotations are dynamically linked to external data repositories. Conclusion: GEM-TREND was developed to retrieve gene expression data by comparing query gene-expression pattern with those of GEO gene expression data. It could be a very useful resource for finding similar gene expression profiles and constructing its gene co-expression networks from a publicly available database. GEM-TREND was designed to be user-friendly and is expected to support knowledge discovery. GEM-TREND is freely available at http://cgs.pharm.kyoto-u.ac.jp/services/network. © 2009 Feng et al; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Feng C."
                    },
                    {
                        "name": "Araki M."
                    },
                    {
                        "name": "Kunimoto R."
                    },
                    {
                        "name": "Tamon A."
                    },
                    {
                        "name": "Makiguchi H."
                    },
                    {
                        "name": "Niijima S."
                    },
                    {
                        "name": "Tsujimoto G."
                    },
                    {
                        "name": "Okuno Y."
                    }
                ],
                "citationCount": 29,
                "date": "2009-09-03T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "GEM-TREND: A web tool for gene expression data mining toward relevant network discovery"
            },
            "note": null,
            "pmcid": null,
            "pmid": null,
            "type": "Primary",
            "version": null
        }
    ],
    "relation": [],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Data mining",
            "uri": "http://edamontology.org/topic_3473"
        },
        {
            "term": "Systems biology",
            "uri": "http://edamontology.org/topic_2259"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        }
    ],
    "validated": 1,
    "version": []
}