{
    "additionDate": "2018-08-13T11:36:51Z",
    "biotoolsCURIE": "biotools:wave-crest",
    "biotoolsID": "wave-crest",
    "credit": [
        {
            "email": "lchu@morgridge.org",
            "name": "Li-Fang Chu",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Statistical approach to reconstruct gene expression trajectory in single cell RNA-seq experiments with ordered conditions.",
    "documentation": [
        {
            "type": "User manual",
            "url": "https://github.com/lengning/WaveCrest/blob/master/package/WaveCrestVig_v1.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                }
            ]
        }
    ],
    "homepage": "https://github.com/lengning/WaveCrest",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-10T12:59:01Z",
    "license": "Apache-2.0",
    "name": "Wave-Crest",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1186/s13059-016-1033-x",
            "metadata": {
                "abstract": "© 2016 The Author(s). Background: Human pluripotent stem cells offer the best available model to study the underlying cellular and molecular mechanisms of human embryonic lineage specification. However, it is not fully understood how individual stem cells exit the pluripotent state and transition towards their respective progenitor states. Results: Here, we analyze the transcriptomes of human embryonic stem cell-derived lineage-specific progenitors by single-cell RNA-sequencing (scRNA-seq). We identify a definitive endoderm (DE) transcriptomic signature that leads us to pinpoint a critical time window when DE differentiation is enhanced by hypoxia. The molecular mechanisms governing the emergence of DE are further examined by time course scRNA-seq experiments, employing two new statistical tools to identify stage-specific genes over time (SCPattern) and to reconstruct the differentiation trajectory from the pluripotent state through mesendoderm to DE (Wave-Crest). Importantly, presumptive DE cells can be detected during the transitory phase from Brachyury (T) + mesendoderm toward a CXCR4 + DE state. Novel regulators are identified within this time window and are functionally validated on a screening platform with a T-2A-EGFP knock-in reporter engineered by CRISPR/Cas9. Through loss-of-function and gain-of-function experiments, we demonstrate that KLF8 plays a pivotal role modulating mesendoderm to DE differentiation. Conclusions: We report the analysis of 1776 cells by scRNA-seq covering distinct human embryonic stem cell-derived progenitor states. By reconstructing a differentiation trajectory at single-cell resolution, novel regulators of the mesendoderm transition to DE are elucidated and validated. Our strategy of combining single-cell analysis and genetic approaches can be applied to uncover novel regulators governing cell fate decisions in a variety of systems.",
                "authors": [
                    {
                        "name": "Chu L.-F."
                    },
                    {
                        "name": "Leng N."
                    },
                    {
                        "name": "Zhang J."
                    },
                    {
                        "name": "Hou Z."
                    },
                    {
                        "name": "Mamott D."
                    },
                    {
                        "name": "Vereide D.T."
                    },
                    {
                        "name": "Choi J."
                    },
                    {
                        "name": "Kendziorski C."
                    },
                    {
                        "name": "Stewart R."
                    },
                    {
                        "name": "Thomson J.A."
                    }
                ],
                "citationCount": 39,
                "date": "2016-08-17T00:00:00Z",
                "journal": "Genome Biology",
                "title": "Single-cell RNA-seq reveals novel regulators of human embryonic stem cell differentiation to definitive endoderm"
            }
        }
    ],
    "toolType": [
        "Library",
        "Desktop application"
    ],
    "topic": [
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        }
    ],
    "validated": 1
}