{
    "additionDate": "2021-01-18T09:15:14Z",
    "biotoolsCURIE": "biotools:2sigfinder",
    "biotoolsID": "2sigfinder",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "daiailiu04@yahoo.com",
            "name": "Qi Dai",
            "typeEntity": "Person"
        }
    ],
    "description": "2SigFinder implements multiscale statistical algorithm to predict genomic islands from a single genome. It uses small-scale test with large-scale features to score small region deviating from the host and large-scale statistical test with small-scale features to identify multi-window segments for identification of genomic islands.\n\n2SigFinder is a novel prediction method, the first combined use of small-scale and large-scale statistical testing for genomic island detection. 2SigFinder was tested by genomic island boundary detection and identification of genomic islands or functional features of real biological data.\n\nGenomic island (GI) is a cluster of genes in prokaryotic genomes that have probable horizontal origins.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "CpG island and isochore detection",
                    "uri": "http://edamontology.org/operation_0430"
                },
                {
                    "term": "Genome annotation",
                    "uri": "http://edamontology.org/operation_0362"
                },
                {
                    "term": "Virulence prediction",
                    "uri": "http://edamontology.org/operation_3461"
                }
            ]
        }
    ],
    "homepage": "http://bioinfo.zstu.edu.cn/2SigFinder",
    "language": [
        "C",
        "MATLAB"
    ],
    "lastUpdate": "2021-01-19T10:23:54Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/bioinfo0706/2SigFinder"
        }
    ],
    "name": "2SigFinder",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1186/S12859-020-3501-2",
            "metadata": {
                "abstract": "© 2020 The Author(s).Background: Genomic islands are associated with microbial adaptations, carrying genomic signatures different from the host. Some methods perform an overall test to identify genomic islands based on their local features. However, regions of different scales will display different genomic features. Results: We proposed here a novel method \"2SigFinder \", the first combined use of small-scale and large-scale statistical testing for genomic island detection. The proposed method was tested by genomic island boundary detection and identification of genomic islands or functional features of real biological data. We also compared the proposed method with the comparative genomics and composition-based approaches. The results indicate that the proposed 2SigFinder is more efficient in identifying genomic islands. Conclusions: From real biological data, 2SigFinder identified genomic islands from a single genome and reported robust results across different experiments, without annotated information of genomes or prior knowledge from other datasets. 2SigHunter identified 25 Pathogenicity, 1 tRNA, 2 Virulence and 2 Repeats from 27 Pathogenicity, 1 tRNA, 2 Virulence and 2 Repeats, and detected 101 Phage and 28 HEG out of 130 Phage and 36 HEGs in S. enterica Typhi CT18, which shows that it is more efficient in detecting functional features associated with GIs.",
                "authors": [
                    {
                        "name": "Dai Q."
                    },
                    {
                        "name": "He P."
                    },
                    {
                        "name": "Kong R."
                    },
                    {
                        "name": "Liu X."
                    },
                    {
                        "name": "Xu X."
                    },
                    {
                        "name": "Zhang M.Q."
                    }
                ],
                "date": "2020-04-29T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "2SigFinder: The combined use of small-scale and large-scale statistical testing for genomic island detection from a single genome"
            },
            "pmcid": "PMC7191778",
            "pmid": "32349677"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Evolutionary biology",
            "uri": "http://edamontology.org/topic_3299"
        },
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ],
    "validated": 1
}
