{
    "additionDate": "2019-11-14T18:03:40Z",
    "biotoolsCURIE": "biotools:CFEA",
    "biotoolsID": "CFEA",
    "confidence_flag": "tool",
    "description": "A cell-free epigenome atlas in human diseases | Search and download the information for the Mutual exclusivity. MutExGenome is a database of Mutual Exclusive mutations in mutiple species | Welcome to CFEA (Cell-Free Epigenome Atlas) | The cell-free DNA (cfDNA) was shown to be a powerful tool for the noninvasive diagnosis of various diseases and accumulating evidence suggests large-scale epigenetic alterations such as cfDNA methylation (5mC), cfDNA hydroxymethylation (5hmC) and cfDNA nucleosome positioning (NP) can sensitively detect and classify cancers. The CFEA (Cell-Free Epigenome Atlas) data portal is the first database dedicated to human cell-free epigenomes",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Nucleosome position prediction",
                    "uri": "http://edamontology.org/operation_0432"
                },
                {
                    "term": "Sequence trimming",
                    "uri": "http://edamontology.org/operation_3192"
                },
                {
                    "term": "Validation",
                    "uri": "http://edamontology.org/operation_2428"
                }
            ]
        }
    ],
    "homepage": "http://www.bio-data.cn/CFEA",
    "lastUpdate": "2020-12-10T15:55:39Z",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "http://128.1.137.15/CFEA"
        }
    ],
    "name": "Cell-Free Epigenome Atlas (CFEA)",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/NAR/GKZ715",
            "metadata": {
                "abstract": "© 2019 The Author(s) 2019. Published by Oxford University Press on behalf of Nucleic Acids Research.Epigenetic alterations, including 5-methylcytosine (5mC), 5-hydroxymethylcytosine (5hmC) and nucleosome positioning (NP), in cell-free DNA (cfDNA) have been widely observed in human diseases, and many available cfDNA-based epigenome-wide profiles exhibit high sensitivity and specificity in disease detection and classification. However, due to the lack of efficient collection, standardized quality control, and analysis procedures, efficiently integrating and reusing these data remain considerable challenges. Here, we introduce CFEA (http://www.bio-data.cn/CFEA), a cell-free epigenome database dedicated to three types of widely adopted epigenetic modifications (5mC, 5hmC and NP) involved in 27 human diseases. We developed bioinformatic pipelines for quality control and standard data processing and an easy-to-use web interface to facilitate the query, visualization and download of these cell-free epigenome data. We also manually curated related biological and clinical information for each profile, allowing users to better browse and compare cfDNA epigenomes at a specific stage (such as early-or metastasis-stage) of cancer development. CFEA provides a comprehensive and timely resource to the scientific community and supports the development of liquid biopsy-based biomarkers for various human diseases.",
                "authors": [
                    {
                        "name": "Chen H."
                    },
                    {
                        "name": "Li K."
                    },
                    {
                        "name": "Li S."
                    },
                    {
                        "name": "Liu J."
                    },
                    {
                        "name": "Liu Z."
                    },
                    {
                        "name": "Su J."
                    },
                    {
                        "name": "Wu N."
                    },
                    {
                        "name": "Yu F."
                    },
                    {
                        "name": "Zhang Y."
                    },
                    {
                        "name": "Zhao H."
                    },
                    {
                        "name": "Zhou M."
                    }
                ],
                "citationCount": 3,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "CFEA: A cell-free epigenome atlas in human diseases"
            },
            "pmcid": "PMC6943076",
            "pmid": "31428785"
        }
    ],
    "topic": [
        {
            "term": "DNA packaging",
            "uri": "http://edamontology.org/topic_3176"
        },
        {
            "term": "Epigenomics",
            "uri": "http://edamontology.org/topic_3173"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        }
    ],
    "validated": 1
}
