{
    "additionDate": "2019-11-14T18:13:40Z",
    "biotoolsCURIE": "biotools:fagin",
    "biotoolsID": "fagin",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "mash@iastate.edu",
            "name": "Eve Syrkin Wurtele",
            "orcidid": "https://orcid.org/0000-0003-1552-9495",
            "typeEntity": "Person"
        }
    ],
    "description": "synteny-based phylostratigraphy and finer classification of young genes | This repo contains the code needed to generate the tables and figures used in the synder paper and its supplementary files. And more | install_github(\"arendsee/fagin\") | The CRAN packages can be installed from an R shell with as so",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Ab initio structure prediction",
                    "uri": "http://edamontology.org/operation_0476"
                },
                {
                    "term": "Polymorphism detection",
                    "uri": "http://edamontology.org/operation_3202"
                },
                {
                    "term": "de Novo sequencing",
                    "uri": "http://edamontology.org/operation_3644"
                }
            ]
        }
    ],
    "homepage": "https://rdrr.io/github/arendsee/fagin/",
    "language": [
        "R"
    ],
    "lastUpdate": "2020-12-28T16:58:19Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/arendsee/fagin/issues"
        },
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/arendsee/fagin"
        }
    ],
    "name": "fagin",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12859-019-3023-Y",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: With every new genome that is sequenced, thousands of species-specific genes (orphans) are found, some originating from ultra-rapid mutations of existing genes, many others originating de novo from non-genic regions of the genome. If some of these genes survive across speciations, then extant organisms will contain a patchwork of genes whose ancestors first appeared at different times. Standard phylostratigraphy, the technique of partitioning genes by their age, is based solely on protein similarity algorithms. However, this approach relies on negative evidence â\"€a failure to detect a homolog of a query gene. An alternative approach is to limit the search for homologs to syntenic regions. Then, genes can be positively identified as de novo orphans by tracing them to non-coding sequences in related species. Results: We have developed a synteny-based pipeline in the R framework. Fagin determines the genomic context of each query gene in a focal species compared to homologous sequence in target species. We tested the fagin pipeline on two focal species, Arabidopsis thaliana (plus four target species in Brassicaseae) and Saccharomyces cerevisiae (plus six target species in Saccharomyces). Using microsynteny maps, fagin classified the homology relationship of each query gene against each target genome into three main classes, and further subclasses: AAic (has a coding syntenic homolog), NTic (has a non-coding syntenic homolog), and Unknown (has no detected syntenic homolog). fagin inferred over half the \"Unknown\" A. thaliana query genes, and about 20% for S. cerevisiae, as lacking a syntenic homolog because of local indels or scrambled synteny. Conclusions: fagin augments standard phylostratigraphy, and extends synteny-based phylostratigraphy with an automated, customizable, and detailed contextual analysis. By comparing synteny-based phylostrata to standard phylostrata, fagin systematically identifies those orphans and lineage-specific genes that are well-supported to have originated de novo. Analyzing within-species genomes should distinguish orphan genes that may have originated through rapid divergence from de novo orphans. Fagin also delineates whether a gene has no syntenic homolog because of technical or biological reasons. These analyses indicate that some orphans may be associated with regions of high genomic perturbation.",
                "authors": [
                    {
                        "name": "Arendsee Z."
                    },
                    {
                        "name": "Bhandary P."
                    },
                    {
                        "name": "Li J."
                    },
                    {
                        "name": "Seetharam A."
                    },
                    {
                        "name": "Singh U."
                    },
                    {
                        "name": "Wurtele E.S."
                    }
                ],
                "citationCount": 3,
                "date": "2019-01-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Fagin: Synteny-based phylostratigraphy and finer classification of young genes"
            },
            "pmcid": "PMC6712868",
            "pmid": "31455236"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Whole genome sequencing",
            "uri": "http://edamontology.org/topic_3673"
        }
    ],
    "validated": 1
}
