{
    "additionDate": "2017-05-01T17:08:40Z",
    "biotoolsCURIE": "biotools:enet",
    "biotoolsID": "enet",
    "credit": [
        {
            "email": "andrew.emili@utoronto.ca",
            "name": "Andrew Emili",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Global functional atlas of Escherichia coli encompassing previously uncharacterized proteins. This resource provides a \"systems-wide\" functional blueprint of a model microbe, with insights into the biological and evolutionary significance of previously uncharacterized proteins.",
    "documentation": [
        {
            "type": "General",
            "url": "http://ecoli.med.utoronto.ca/php/help.php?PHPSESSID=463418253aa3f5ec13ea2a12c0c7cb78"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein modelling",
                    "uri": "http://edamontology.org/operation_0477"
                }
            ]
        }
    ],
    "homepage": "http://ecoli.med.utoronto.ca/",
    "lastUpdate": "2018-12-10T12:58:56Z",
    "name": "eNet",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "One-third of the 4,225 protein-coding genes of Escherichia coli K-12 remain functionally unannotated (orphans). Many map to distant clades such as Archaea, suggesting involvement in basic prokaryotic traits, whereas others appear restricted to E. coli, including pathogenic strains. To elucidate the orphans' biological roles, we performed an extensive proteomic survey using affinity-tagged E. coli strains and generated comprehensive genomic context inferences to derive a high-confidence compendium for virtually the entire proteome consisting of 5,993 putative physical interactions and 74,776 putative functional associations, most of which are novel. Clustering of the respective probabilistic networks revealed putative orphan membership in discrete multiprotein complexes and functional modules together with annotated gene products, whereas a machine-learning strategy based on network integration implicated the orphans in specific biological processes. We provide additional experimental evidence supporting orphan participation in protein synthesis, amino acid metabolism, biofilm formation, motility, and assembly of the bacterial cell envelope. This resource provides a \"systems-wide\" functional blueprint of a model microbe, with insights into the biological and evolutionary significance of previously uncharacterized proteins. Copyright: © 2009 Hu et al. This is an open-access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.",
                "authors": [
                    {
                        "name": "Hu P."
                    },
                    {
                        "name": "Janga S.C."
                    },
                    {
                        "name": "Babu M."
                    },
                    {
                        "name": "Diaz-Mejia J.J."
                    },
                    {
                        "name": "Butland G."
                    },
                    {
                        "name": "Yang W."
                    },
                    {
                        "name": "Pogoutse O."
                    },
                    {
                        "name": "Guo X."
                    },
                    {
                        "name": "Phanse S."
                    },
                    {
                        "name": "Wong P."
                    },
                    {
                        "name": "Chandran S."
                    },
                    {
                        "name": "Christopoulos C."
                    },
                    {
                        "name": "Nazarians-Armavil A."
                    },
                    {
                        "name": "Nasseri N.K."
                    },
                    {
                        "name": "Musso G."
                    },
                    {
                        "name": "Ali M."
                    },
                    {
                        "name": "Nazemof N."
                    },
                    {
                        "name": "Eroukova V."
                    },
                    {
                        "name": "Golshani A."
                    },
                    {
                        "name": "Paccanaro A."
                    },
                    {
                        "name": "Greenblatt J.F."
                    },
                    {
                        "name": "Moreno-Hagelsieb G."
                    },
                    {
                        "name": "Emili A."
                    }
                ],
                "citationCount": 202,
                "date": "2009-01-01T00:00:00Z",
                "journal": "PLoS Biology",
                "title": "Global functional atlas of Escherichia coli encompassing previously uncharacterized proteins"
            },
            "pmid": "19402753"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Systems biology",
            "uri": "http://edamontology.org/topic_2259"
        }
    ],
    "validated": 1
}