{
    "additionDate": "2021-01-18T09:57:56Z",
    "biotoolsCURIE": "biotools:coexp-web",
    "biotoolsID": "coexp-web",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "juanbotiablaya@gmail.com",
            "name": "Juan A. Botía",
            "typeEntity": "Person"
        }
    ],
    "description": "CoExp Webpage is a web platform that enables the exploitation of co-expression networks. CoExp currently offers 109 co-expression models focused on brain transcriptomics with plans to expand its scope. It is a powerful, easy to use and innovative tool for gene set annotation across a variety of brain specific transcriptomicdata sets. CoExp makes co-expression models visually manageable, accessible and easily exploitable to the scientific community.",
    "download": [
        {
            "type": "Container file",
            "url": "https://hub.docker.com/r/soniaruiz/coexp"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Expression correlation analysis",
                    "uri": "http://edamontology.org/operation_3463"
                },
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://snca.atica.um.es/coexp/",
    "language": [
        "JavaScript"
    ],
    "lastUpdate": "2021-08-23T13:41:21Z",
    "license": "Apache-2.0",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/SoniaRuiz/CoExp_Web/issues"
        },
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/SoniaRuiz/CoExp_Web"
        }
    ],
    "name": "CoExp Web",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.3389/FGENE.2021.630187",
            "metadata": {
                "abstract": "© Copyright © 2021 García-Ruiz, Gil-Martínez, Cisterna, Jurado-Ruiz, Reynolds, Cookson, Hardy, Ryten and Botía.Gene co-expression networks are a powerful type of analysis to construct gene groupings based on transcriptomic profiling. Co-expression networks make it possible to discover modules of genes whose mRNA levels are highly correlated across samples. Subsequent annotation of modules often reveals biological functions and/or evidence of cellular specificity for cell types implicated in the tissue being studied. There are multiple ways to perform such analyses with weighted gene co-expression network analysis (WGCNA) amongst one of the most widely used R packages. While managing a few network models can be done manually, it is often more advantageous to study a wider set of models derived from multiple independently generated transcriptomic data sets (e.g., multiple networks built from many transcriptomic sources). However, there is no software tool available that allows this to be easily achieved. Furthermore, the visual nature of co-expression networks in combination with the coding skills required to explore networks, makes the construction of a web-based platform for their management highly desirable. Here, we present the CoExp Web application, a user-friendly online tool that allows the exploitation of the full collection of 109 co-expression networks provided by the CoExpNets suite of R packages. We describe the usage of CoExp, including its contents and the functionality available through the family of CoExpNets packages. All the tools presented, including the web front- and back-ends are available for the research community so any research group can build its own suite of networks and make them accessible through their own CoExp Web application. Therefore, this paper is of interest to both researchers wishing to annotate their genes of interest across different brain network models and specialists interested in the creation of GCNs looking for a tool to appropriately manage, use, publish, and share their networks in a consistent and productive manner.",
                "authors": [
                    {
                        "name": "Botia J.A."
                    },
                    {
                        "name": "Cisterna A."
                    },
                    {
                        "name": "Cookson M.R."
                    },
                    {
                        "name": "Garcia-Ruiz S."
                    },
                    {
                        "name": "Gil-Martinez A.L."
                    },
                    {
                        "name": "Hardy J."
                    },
                    {
                        "name": "Jurado-Ruiz F."
                    },
                    {
                        "name": "Reynolds R.H."
                    },
                    {
                        "name": "Ryten M."
                    }
                ],
                "date": "2021-02-24T00:00:00Z",
                "journal": "Frontiers in Genetics",
                "title": "CoExp: A Web Tool for the Exploitation of Co-expression Networks"
            },
            "pmcid": "PMC7943635",
            "pmid": "33719340",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        },
        {
            "term": "Ontology and terminology",
            "uri": "http://edamontology.org/topic_0089"
        }
    ]
}
