{
    "additionDate": "2021-01-18T07:28:10Z",
    "biotoolsCURIE": "biotools:coolpuppy",
    "biotoolsID": "coolpuppy",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "ilya.flyamer@igmm.ed.ac.uk",
            "name": "Ilya M Flyamer",
            "orcidid": "https://orcid.org/0000-0002-4892-4208",
            "typeEntity": "Person"
        }
    ],
    "description": "coolpup.py is a versatile Python tool to perform pile-up analysis on Hi-C data in .cool format. coolpup.py is particularly well suited performance-wise for analysing huge numbers of potential interactions, since it loads whole chromosomes into memory one by one (or in parallel to speed it up) to extract small submatrices quickly. Having to read everything into memory makes it relatively slow for small numbers of loops, but performance doesn't decrease until you reach a huge number of interactions.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://coolpuppy.readthedocs.io/en/latest/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Parsing",
                    "uri": "http://edamontology.org/operation_1812"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Phlya/coolpuppy",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-02-17T15:03:09Z",
    "license": "MIT",
    "name": "coolpup.py",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAA073",
            "metadata": {
                "abstract": "© 2020 The Author(s). Published by Oxford University Press. All rights reserved.Motivation: Hi-C is currently the method of choice to investigate the global 3D organization of the genome. A major limitation of Hi-C is the sequencing depth required to robustly detect loops in the data. A popular approach used to mitigate this issue, even in single-cell Hi-C data, is genome-wide averaging (piling-up) of peaks, or other features, annotated in high-resolution datasets, to measure their prominence in less deeply sequenced data. However, current tools do not provide a computationally efficient and versatile implementation of this approach. Results: Here, we describe coolpup.py-a versatile tool to perform pile-up analysis on Hi-C data. We demonstrate its utility by replicating previously published findings regarding the role of cohesin and CTCF in 3D genome organization, as well as discovering novel details of Polycomb-driven interactions. We also present a novel variation of the pile-up approach that can aid the statistical analysis of looping interactions. We anticipate that coolpup.py will aid in Hi-C data analysis by allowing easy to use, versatile and efficient generation of pile-ups.",
                "authors": [
                    {
                        "name": "Bickmore W.A."
                    },
                    {
                        "name": "Flyamer I.M."
                    },
                    {
                        "name": "Illingworth R.S."
                    }
                ],
                "citationCount": 14,
                "date": "2020-05-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Coolpup.py: Versatile pile-up analysis of Hi-C data"
            },
            "pmcid": "PMC7214034",
            "pmid": "32003791"
        }
    ],
    "toolType": [
        "Command-line tool",
        "Library"
    ],
    "topic": [
        {
            "term": "ChIP-seq",
            "uri": "http://edamontology.org/topic_3169"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ]
}
