
{
    "credit": [
        {
            "email": "polo.simion@gmail.com",
            "name": "Paul Simion",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        },
        {
            "email": "khalid.belkhir@umontpellier.fr",
            "name": "Khalid Belkhir",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        },
        {
            "email": "m.telford@ucl.ac.uk",
            "name": "Maximilian Telford",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://gitlab.mbb.univ-montp2.fr/mbb/CroCo"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence assembly validation",
                    "uri": "http://edamontology.org/operation_3180"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "R"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Gene expression",
                "uri": "http://edamontology.org/topic_0203"
            },
            {
                "term": "Genomics",
                "uri": "http://edamontology.org/topic_0622"
            },
            {
                "term": "Genomics",
                "uri": "http://edamontology.org/topic_0622"
            },
            {
                "term": "Data quality management",
                "uri": "http://edamontology.org/topic_3572"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© 2018 Telford et al. Background: Multiple RNA samples are frequently processed together and often mixed before multiplex sequencing in the same sequencing run. While different samples can be separated post sequencing using sample barcodes, the possibility of cross contamination between biological samples from different species that have been processed or sequenced in parallel has the potential to be extremely deleterious for downstream analyses. Results: We present CroCo, a software package for identifying and removing such cross contaminants from assembled transcriptomes. Using multiple, recently published sequence datasets, we show that cross contamination is consistently present at varying levels in real data. Using real and simulated data, we demonstrate that CroCo detects contaminants efficiently and correctly. Using a real example from a molecular phylogenetic dataset, we show that contaminants, if not eliminated, can have a decisive, deleterious impact on downstream comparative analyses. Conclusions: Cross contamination is pervasive in new and published datasets and, if undetected, can have serious deleterious effects on downstream analyses. CroCo is a database-independent, multi-platform tool, designed for ease of use, that efficiently and accurately detects and removes cross contamination in assembled transcriptomes to avoid these problems. We suggest that the use of CroCo should become a standard cleaning step when processing multiple samples for transcriptome sequencing.",
            "authors": [
                "Simion P.",
                "Belkhir K.",
                "Francois C.",
                "Veyssier J.",
                "Rink J.C.",
                "Manuel M.",
                "Philippe H.",
                "Telford M.J."
            ],
            "cit_count": 5,
            "doi": "10.1186/s12915-018-0486-7",
            "journal": "BMC Biology",
            "title": "A software tool 'CroCo' detects pervasive cross-species contamination in next generation sequencing data",
            "year": "2018-03-05"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:croco",
        "biotoolsID": "croco",
        "description": "A program to detect potential cross contaminations in HTS assembled transcriptomes using expression level quantification.",
        "homepage": "http://gitlab.mbb.univ-montp2.fr/mbb/CroCo",
        "name": "CroCo"
    }
}