{
    "additionDate": "2021-01-18T10:37:01Z",
    "biotoolsCURIE": "biotools:bridge-galaxy",
    "biotoolsID": "bridge-galaxy",
    "confidence_flag": "tool",
    "description": "Biomolecular Reaction and Interaction Dynamics Global Environment (BRIDGE) is an open-source web platform developed with the aim to provide an environment for the design of reliable methods to conduct reproducible biomolecular simulations. It is built on the well-known Galaxy bioinformatics platform. Through this, BRIDGE hosts computational chemistry tools on public web servers for internet use and provides machine- and operating-system-independent portability using the Docker container platform for local use.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Salt bridge calculation",
                    "uri": "http://edamontology.org/operation_1839"
                },
                {
                    "term": "Virtual screening",
                    "uri": "http://edamontology.org/operation_3938"
                }
            ]
        }
    ],
    "homepage": "https://github.com/scientificomputing/BRIDGE",
    "lastUpdate": "2021-02-06T19:55:31Z",
    "name": "BRIDGE",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1021/ACS.JCIM.0C00206",
            "metadata": {
                "abstract": "© 2020 American Chemical Society.Biomolecular Reaction and Interaction Dynamics Global Environment (BRIDGE) is an open-source web platform developed with the aim to provide an environment for the design of reliable methods to conduct reproducible biomolecular simulations. It is built on the well-known Galaxy bioinformatics platform. Through this, BRIDGE hosts computational chemistry tools on public web servers for internet use and provides machine- and operating-system-independent portability using the Docker container platform for local use. This construction improves the accessibility, shareability, and reproducibility of computational methods for molecular simulations. Here we present integrated free energy tools (or apps) to calculate absolute binding free energies (ABFEs) and relative binding free energies (RBFEs), as illustrated through use cases. We present free energy perturbation (FEP) methods contained in various software packages such as GROMACS and YANK that are independent of hardware configuration, software libraries, or operating systems when ported in the Galaxy-BRIDGE Docker container platform. By performing cyclin-dependent kinase 2 (CDK2) FEP calculations on geographically dispersed web servers (in Africa and Europe), we illustrate that large-scale computations can be performed using the exact same codes and methodology by collaborating groups through publicly shared protocols and workflows. The ease of public sharing and independent reproduction of simulations via BRIDGE makes possible an open review of methods and complete simulation protocols. This makes the discovery of inhibitors for drug targets accessible to nonexperts and the computer experiments that are used to arrive at leads verifiable by experts and reviewers. We illustrate this on α- galactoside α-2,3-sialyltransferase I (ST3Gal-I), a breast cancer drug target, where a combination of RBFE and ABFE methods are used to compute the binding free energies of three inhibitors.",
                "authors": [
                    {
                        "name": "Barnett C.B."
                    },
                    {
                        "name": "Essex J."
                    },
                    {
                        "name": "Naidoo K.J."
                    },
                    {
                        "name": "Senapathi T."
                    },
                    {
                        "name": "Suruzhon M."
                    }
                ],
                "citationCount": 2,
                "date": "2020-11-23T00:00:00Z",
                "journal": "Journal of Chemical Information and Modeling",
                "title": "BRIDGE: An open platform for reproducible high-throughput free energy simulations"
            },
            "pmid": "32810405"
        }
    ],
    "toolType": [
        "Workbench",
        "Workflow"
    ],
    "topic": [
        {
            "term": "Biomolecular simulation",
            "uri": "http://edamontology.org/topic_3892"
        },
        {
            "term": "Computational chemistry",
            "uri": "http://edamontology.org/topic_3332"
        },
        {
            "term": "Drug discovery",
            "uri": "http://edamontology.org/topic_3336"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ]
}
