
{
    "credit": [
        {
            "email": "support@pacb.com",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://www.smrtcommunity.com/"
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "https://github.com/PacificBiosciences/blasr"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Local alignment",
                    "uri": "http://edamontology.org/operation_0495"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Mapping",
                    "uri": "http://edamontology.org/operation_2429"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Shell",
            "C++",
            "Perl",
            "Python"
        ],
        "operatingSystem": [
            "Linux"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Mapping",
                "uri": "http://edamontology.org/topic_0102"
            },
            {
                "term": "Sequencing",
                "uri": "http://edamontology.org/topic_3168"
            },
            {
                "term": "Genomics",
                "uri": "http://edamontology.org/topic_0622"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/blasr-basic-local-alignment-successive-refinement.html"
        }
    ],
    "publication": [
        {
            "abstract": "Background: Recent methods have been developed to perform high-throughput sequencing of DNA by Single Molecule Sequencing (SMS). While Next-Generation sequencing methods may produce reads up to several hundred bases long, SMS sequencing produces reads up to tens of kilobases long. Existing alignment methods are either too inefficient for high-throughput datasets, or not sensitive enough to align SMS reads, which have a higher error rate than Next-Generation sequencing.Results: We describe the method BLASR (Basic Local Alignment with Successive Refinement) for mapping Single Molecule Sequencing (SMS) reads that are thousands of bases long, with divergence between the read and genome dominated by insertion and deletion error. The method is benchmarked using both simulated reads and reads from a bacterial sequencing project. We also present a combinatorial model of sequencing error that motivates why our approach is effective.Conclusions: The results indicate that it is possible to map SMS reads with high accuracy and speed. Furthermore, the inferences made on the mapability of SMS reads using our combinatorial model of sequencing error are in agreement with the mapping accuracy demonstrated on simulated reads. © 2012 Chaisson and Tesler; licensee BioMed Central Ltd.",
            "authors": [
                "Chaisson M.J.",
                "Tesler G."
            ],
            "cit_count": 350,
            "journal": "BMC Bioinformatics",
            "pmid": "22988817",
            "title": "Mapping single molecule sequencing reads using basic local alignment with successive refinement (BLASR): Application and theory",
            "year": "2012-09-19"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:blasr",
        "biotoolsID": "blasr",
        "description": "Software for mapping Single Molecule Sequencing (SMS) reads that are thousands of bases long, with divergence between the read and genome dominated by insertion and deletion error.",
        "homepage": "https://github.com/PacificBiosciences/blasr",
        "name": "Blasr"
    }
}