{
    "additionDate": "2021-06-14T12:46:29Z",
    "biotoolsCURIE": "biotools:cemda",
    "biotoolsID": "cemda",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "zhanglei@cumt.edu.cn",
            "name": "Lei Zhang",
            "typeEntity": "Person"
        },
        {
            "email": "zwli@cumt.edu.cn",
            "name": "Zhengwei Li",
            "typeEntity": "Person"
        }
    ],
    "description": "Combined Embedding Model for MiRNA-Disease Association Prediction (CEMDA).",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "miRNA target prediction",
                    "uri": "http://edamontology.org/operation_0463"
                },
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                },
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                }
            ]
        }
    ],
    "homepage": "https://github.com/liubailong/CEMDA",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-08-20T06:19:32.508029Z",
    "name": "CEMDA",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1186/S12859-021-04092-W",
            "metadata": {
                "abstract": "© 2021, The Author(s).Background: Cumulative evidence from biological experiments has confirmed that miRNAs have significant roles to diagnose and treat complex diseases. However, traditional medical experiments have limitations in time-consuming and high cost so that they fail to find the unconfirmed miRNA and disease interactions. Thus, discovering potential miRNA-disease associations will make a contribution to the decrease of the pathogenesis of diseases and benefit disease therapy. Although, existing methods using different computational algorithms have favorable performances to search for the potential miRNA-disease interactions. We still need to do some work to improve experimental results. Results: We present a novel combined embedding model to predict MiRNA-disease associations (CEMDA) in this article. The combined embedding information of miRNA and disease is composed of pair embedding and node embedding. Compared with the previous heterogeneous network methods that are merely node-centric to simply compute the similarity of miRNA and disease, our method fuses pair embedding to pay more attention to capturing the features behind the relative information, which models the fine-grained pairwise relationship better than the previous case when each node only has a single embedding. First, we construct the heterogeneous network from supported miRNA-disease pairs, disease semantic similarity and miRNA functional similarity. Given by the above heterogeneous network, we find all the associated context paths of each confirmed miRNA and disease. Meta-paths are linked by nodes and then input to the gate recurrent unit (GRU) to directly learn more accurate similarity measures between miRNA and disease. Here, the multi-head attention mechanism is used to weight the hidden state of each meta-path, and the similarity information transmission mechanism in a meta-path of miRNA and disease is obtained through multiple network layers. Second, pair embedding of miRNA and disease is fed to the multi-layer perceptron (MLP), which focuses on more important segments in pairwise relationship. Finally, we combine meta-path based node embedding and pair embedding with the cost function to learn and predict miRNA-disease association. The source code and data sets that verify the results of our research are shown at https://github.com/liubailong/CEMDA. Conclusions: The performance of CEMDA in the leave-one-out cross validation and fivefold cross validation are 93.16% and 92.03%, respectively. It denotes that compared with other methods, CEMDA accomplishes superior performance. Three cases with lung cancers, breast cancers, prostate cancers and pancreatic cancers show that 48,50,50 and 50 out of the top 50 miRNAs, which are confirmed in HDMM V2.0. Thus, this further identifies the feasibility and effectiveness of our method.",
                "authors": [
                    {
                        "name": "Liu B."
                    },
                    {
                        "name": "Zhu X."
                    },
                    {
                        "name": "Zhang L."
                    },
                    {
                        "name": "Liang Z."
                    },
                    {
                        "name": "Li Z."
                    }
                ],
                "date": "2021-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Combined embedding model for MiRNA-disease association prediction"
            },
            "pmcid": "PMC7995599",
            "pmid": "33765909"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Infectious disease",
            "uri": "http://edamontology.org/topic_3324"
        },
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Cardiology",
            "uri": "http://edamontology.org/topic_3335"
        }
    ]
}