{
    "additionDate": "2021-01-18T07:00:27Z",
    "biotoolsCURIE": "biotools:personode",
    "biotoolsID": "personode",
    "confidence_flag": "tool",
    "credit": [
        {
            "name": "Gustavo S. P. Pamplona",
            "typeEntity": "Person"
        }
    ],
    "description": "A Toolbox for ICA Map Classification and Individualized ROI Definition.\n\nPersonode is a MATLAB toolbox designed for regions-of-interest (ROI) individualization based on fMRI spatial independent component analysis (ICA) maps after a semi-automatic classification into resting-state networks (RSNs).\n\nPersonode is a user-friendly, open-source MatLab toolbox that semi-automatically guides through ICA components classification into resting-state networks (RSN), alleviating the selection process, and allows the robust definition of either group- or subject-specific ROIs derived from RSN, which could make network analysis more accurate and individually specific.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Mapping",
                    "uri": "http://edamontology.org/operation_2429"
                },
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                }
            ]
        }
    ],
    "homepage": "http://www.nitrc.org/projects/personode",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2021-01-23T08:47:43Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/gustavopamplona/Personode"
        }
    ],
    "name": "Personode",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1007/S12021-019-09449-4",
            "metadata": {
                "abstract": "© 2020, Springer Science+Business Media, LLC, part of Springer Nature.Canonical resting state networks (RSNs) can be obtained through independent component analysis (ICA). RSNs are reproducible across subjects but also present inter-individual differences, which can be used to individualize regions-of-interest (ROI) definition, thus making fMRI analyses more accurate. Unfortunately, no automatic tool for defining subject-specific ROIs exists, making the classification of ICAs as representatives of RSN time-consuming and largely dependent on visual inspection. Here, we present Personode, a user-friendly and open source MATLAB-based toolbox that semi-automatically performs the classification of RSN and allows for defining subject- and group-specific ROIs. To validate the applicability of our new approach and to assess potential improvements compared to previous approaches, we applied Personode to both task-related activation and resting-state data. Our analyses show that for task-related activation analyses, subject-specific spherical ROIs defined with Personode produced higher activity contrasts compared to ROIs derived from single-study and meta-analytic coordinates. We also show that subject-specific irregular ROIs defined with Personode improved ROI-to-ROI functional connectivity analyses. Hence, Personode might be a useful toolbox for ICA map classification into RSNs and group- as well as subject-specific ROI definitions, leading to improved analyses of task-related activation and functional connectivity.",
                "authors": [
                    {
                        "name": "Pamplona G.S.P."
                    },
                    {
                        "name": "Vieira B.H."
                    },
                    {
                        "name": "Scharnowski F."
                    },
                    {
                        "name": "Salmon C.E.G."
                    }
                ],
                "citationCount": 2,
                "date": "2020-06-01T00:00:00Z",
                "journal": "Neuroinformatics",
                "title": "Personode: A Toolbox for ICA Map Classification and Individualized ROI Definition"
            },
            "pmid": "31900722"
        }
    ],
    "topic": [
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        }
    ],
    "validated": 1
}