{
    "additionDate": "2021-01-18T10:00:50Z",
    "biotoolsCURIE": "biotools:malacoda",
    "biotoolsID": "malacoda",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "cashaw@bcm.edu",
            "name": "Chad A. Shaw",
            "orcidid": "https://orcid.org/0000-0001-7267-5398",
            "typeEntity": "Person"
        }
    ],
    "description": "Bayesian modelling of high-throughput sequencing assays with malacoda.\n\nThe goal of malacoda is to enable Bayesian analysis of high-throughput genomic assays like massively parallel reporter assays (MPRA) and CRISPR screens.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "DNA barcoding",
                    "uri": "http://edamontology.org/operation_3200"
                },
                {
                    "term": "Genome annotation",
                    "uri": "http://edamontology.org/operation_0362"
                },
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                }
            ]
        }
    ],
    "homepage": "http://github.com/andrewGhazi/malacoda",
    "language": [
        "C++",
        "R"
    ],
    "lastUpdate": "2021-02-19T09:16:51Z",
    "name": "malacoda",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PCBI.1007504",
            "metadata": {
                "abstract": "© 2020 Ghazi et al.NGS studies have uncovered an ever-growing catalog of human variation while leaving an enormous gap between observed variation and experimental characterization of variant function. High-throughput screens powered by NGS have greatly increased the rate of variant functionalization, but the development of comprehensive statistical methods to analyze screen data has lagged. In the massively parallel reporter assay (MPRA), short barcodes are counted by sequencing DNA libraries transfected into cells and the cell's output RNA in order to simultaneously measure the shifts in transcription induced by thousands of genetic variants. These counts present many statistical challenges, including overdispersion, depth dependence, and uncertain DNA concentrations. So far, the statistical methods used have been rudimentary, employing transformations on count level data and disregarding experimental and technical structure while failing to quantify uncertainty in the statistical model. We have developed an extensive framework for the analysis of NGS functionalization screens available as an R package called malacoda (available from github.com/ andrewGhazi/malacoda). Our software implements a probabilistic, fully Bayesian model of screen data. The model uses the negative binomial distribution with gamma priors to model sequencing counts while accounting for effects from input library preparation and sequencing depth. The method leverages the high-throughput nature of the assay to estimate the priors empirically. External annotations such as ENCODE data or DeepSea predictions can also be incorporated to obtain more informative priors-a transformative capability for data integration. The package also includes quality control and utility functions, including automated barcode counting and visualization methods. To validate our method, we analyzed several datasets using malacoda and alternative MPRA analysis methods. These data include experiments from the literature, simulated assays, and primary MPRA data. We also used luciferase assays to experimentally validate several hits from our primary data, as well as variants for which the various methods disagree and variants detectable only with the aid of external annotations. Copyright:",
                "authors": [
                    {
                        "name": "Chen E.S."
                    },
                    {
                        "name": "Edelstein L.C."
                    },
                    {
                        "name": "Ghazi A.R."
                    },
                    {
                        "name": "Kong X."
                    },
                    {
                        "name": "Shaw C.A."
                    }
                ],
                "citationCount": 1,
                "date": "2020-07-01T00:00:00Z",
                "journal": "PLoS Computational Biology",
                "title": "Bayesian modelling of high-throughput sequencing assays with malacoda"
            },
            "pmcid": "PMC7394446",
            "pmid": "32692749"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ]
}
