{
    "accessibility": "Open access",
    "additionDate": "2019-07-19T13:24:41Z",
    "biotoolsCURIE": "biotools:RegulationSpotter",
    "biotoolsID": "RegulationSpotter",
    "collectionID": [
        "Rare Disease",
        "RD-connect",
        "ELIXIR-DE"
    ],
    "cost": "Free of charge",
    "description": "RegulationSpotter is a web-based tool for the user-friendly annotation and interpretation of 'extratranscriptic' DNA variants. It annotates individual variants with underlying regulatory features in an intuitive way by assessing over 100 genome-wide annotations. Additionally, it calculates a score, which reflects the regulatory potential of the variant region.\nPhenotypic data can be used to focus on likely disease genes.",
    "editPermission": {
        "type": "private"
    },
    "elixirNode": [
        "Germany"
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Variant classification",
                    "uri": "http://edamontology.org/operation_3225"
                }
            ]
        }
    ],
    "homepage": "https://www.regulationspotter.org/",
    "language": [
        "SQL",
        "Perl"
    ],
    "lastUpdate": "2020-06-16T10:55:24Z",
    "maturity": "Mature",
    "name": "RegulationSpotter",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "Dominik",
    "publication": [
        {
            "doi": "10.1093/nar/gkz327",
            "metadata": {
                "abstract": "© 2019 The Author(s) 2019. Published by Oxford University Press on behalf of Nucleic Acids Research.RegulationSpotter is a web-based tool for the user-friendly annotation and interpretation of DNA variants located outside of protein-coding transcripts (extratranscriptic variants). It is designed for clinicians and researchers who wish to assess the potential impact of the considerable number of non-coding variants found in Whole Genome Sequencing runs. It annotates individual variants with underlying regulatory features in an intuitive way by assessing over 100 genome-wide annotations. Additionally, it calculates a score, which reflects the regulatory potential of the variant region. Its dichotomous classifications, 'functional' or 'non-functional', and a human-readable presentation of the underlying evidence allow a biologically meaningful interpretation of the score. The output shows key aspects of every variant and allows rapid access to more detailed information about its possible role in gene regulation. RegulationSpotter can either analyse single variants or complete VCF files. Variants located within protein-coding transcripts are automatically assessed by MutationTaster as well as by RegulationSpotter to account for possible intragenic regulatory effects. RegulationSpotter offers the possibility of using phenotypic data to focus on known disease genes or genomic elements interacting with them. RegulationSpotter is freely available at https://www.regulationspotter.org.",
                "authors": [
                    {
                        "name": "Schwarz J.M."
                    },
                    {
                        "name": "Hombach D."
                    },
                    {
                        "name": "Kohler S."
                    },
                    {
                        "name": "Cooper D.N."
                    },
                    {
                        "name": "Schuelke M."
                    },
                    {
                        "name": "Seelow D."
                    }
                ],
                "citationCount": 1,
                "date": "2019-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "RegulationSpotter: Annotation and interpretation of extratranscriptic DNA variants"
            },
            "pmid": "31106382"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Rare diseases",
            "uri": "http://edamontology.org/topic_3325"
        }
    ],
    "validated": 1
}