{
    "accessibility": "Open access (with restrictions)",
    "additionDate": "2022-07-17T09:50:07.302568Z",
    "biotoolsCURIE": "biotools:bash-gn",
    "biotoolsID": "bash-gn",
    "confidence_flag": "tool",
    "cost": "Free of charge (with restrictions)",
    "credit": [
        {
            "name": "Jiayan Huo"
        },
        {
            "name": "Ao Li",
            "orcidid": "https://orcid.org/0000-0002-1927-8606"
        }
    ],
    "description": "A new machine learning-derived questionnaire for screening obstructive sleep apnea.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "https://c2ship.org/bash-gn",
    "lastUpdate": "2024-11-24T15:54:55.019803Z",
    "license": "Other",
    "name": "BASH-GN",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1007/s11325-022-02629-8",
            "metadata": {
                "abstract": "Purpose: This study aimed to develop a machine learning–based questionnaire (BASH-GN) to classify obstructive sleep apnea (OSA) risk by considering risk factor subtypes. Methods: Participants who met study inclusion criteria were selected from the Sleep Heart Health Study Visit 1 (SHHS 1) database. Other participants from the Wisconsin Sleep Cohort (WSC) served as an independent test dataset. Participants with an apnea hypopnea index (AHI) ≥ 15/h were considered as high risk for OSA. Potential risk factors were ranked using mutual information between each factor and the AHI, and only the top 50% were selected. We classified the subjects into 2 different groups, low and high phenotype groups, according to their risk scores. We then developed the BASH-GN, a machine learning–based questionnaire that consists of two logistic regression classifiers for the 2 different subtypes of OSA risk prediction. Results: We evaluated the BASH-GN on the SHHS 1 test set (n = 1237) and WSC set (n = 1120) and compared its performance with four commonly used OSA screening questionnaires, the Four-Variable, Epworth Sleepiness Scale, Berlin, and STOP-BANG. The model outperformed these questionnaires on both test sets regarding the area under the receiver operating characteristic (AUROC) and the area under the precision-recall curve (AUPRC). The model achieved AUROC (SHHS 1: 0.78, WSC: 0.76) and AUPRC (SHHS 1: 0.72, WSC: 0.74), respectively. The questionnaire is available at https://c2ship.org/bash-gn. Conclusion: Considering OSA subtypes when evaluating OSA risk may improve the accuracy of OSA screening.",
                "authors": [
                    {
                        "name": "Huo J."
                    },
                    {
                        "name": "Li A."
                    },
                    {
                        "name": "Quan S.F."
                    },
                    {
                        "name": "Roveda J."
                    }
                ],
                "citationCount": 4,
                "date": "2023-05-01T00:00:00Z",
                "journal": "Sleep and Breathing",
                "title": "BASH-GN: a new machine learning–derived questionnaire for screening obstructive sleep apnea"
            },
            "pmid": "35482152"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        }
    ],
    "validated": 1
}
