{
    "accessibility": "Open access",
    "additionDate": "2023-02-25T13:43:19.584469Z",
    "biotoolsCURIE": "biotools:graltr-lda",
    "biotoolsID": "graltr-lda",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "bliu@bliulab.net",
            "name": "Bin Liu",
            "typeEntity": "Person"
        },
        {
            "email": "hwu@bliulab.net",
            "name": "Hao Wu",
            "typeEntity": "Person"
        }
    ],
    "description": "A tool that for LncRNA-disease association identification using graph auto-encoder and learning to rank.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Feature extraction",
                    "uri": "http://edamontology.org/operation_3937"
                },
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "http://bliulab.net/GraLTR-LDA",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T14:58:09.340645Z",
    "license": "Other",
    "name": "GraLTR-LDA",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1093/bib/bbac539",
            "metadata": {
                "abstract": "Discovering the relationships between long non-coding RNAs (lncRNAs) and diseases is significant in the treatment, diagnosis and prevention of diseases. However, current identified lncRNA-disease associations are not enough because of the expensive and heavy workload of wet laboratory experiments. Therefore, it is greatly important to develop an efficient computational method for predicting potential lncRNA-disease associations. Previous methods showed that combining the prediction results of the lncRNA-disease associations predicted by different classification methods via Learning to Rank (LTR) algorithm can be effective for predicting potential lncRNA-disease associations. However, when the classification results are incorrect, the ranking results will inevitably be affected. We propose the GraLTR-LDA predictor based on biological knowledge graphs and ranking framework for predicting potential lncRNA-disease associations. Firstly, homogeneous graph and heterogeneous graph are constructed by integrating multi-source biological information. Then, GraLTR-LDA integrates graph auto-encoder and attention mechanism to extract embedded features from the constructed graphs. Finally, GraLTR-LDA incorporates the embedded features into the LTR via feature crossing statistical strategies to predict priority order of diseases associated with query lncRNAs. Experimental results demonstrate that GraLTR-LDA outperforms the other state-of-the-art predictors and can effectively detect potential lncRNA-disease associations. Availability and implementation: Datasets and source codes are available at http://bliulab.net/GraLTR-LDA.",
                "authors": [
                    {
                        "name": "Liang Q."
                    },
                    {
                        "name": "Liu B."
                    },
                    {
                        "name": "Wu H."
                    },
                    {
                        "name": "Zhang W."
                    }
                ],
                "citationCount": 12,
                "date": "2023-01-01T00:00:00Z",
                "journal": "Briefings in Bioinformatics",
                "title": "LncRNA-disease association identification using graph auto-encoder and learning to rank"
            },
            "pmid": "36545805"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        }
    ]
}
