{
    "additionDate": "2017-02-10T11:34:42Z",
    "biotoolsCURIE": "biotools:trample",
    "biotoolsID": "trample",
    "credit": [
        {
            "email": "bugs@biodec.com",
            "name": "BDM Support",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Tool for the prediction of transmembrane helices, transmembrane strands, secondary structure, and signal peptides.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://gpcr.biocomp.unibo.it/biodec/help.html#trample"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein secondary structure prediction (helices)",
                    "uri": "http://edamontology.org/operation_0468"
                },
                {
                    "term": "RNA secondary structure prediction",
                    "uri": "http://edamontology.org/operation_0278"
                },
                {
                    "term": "Protein secondary structure comparison",
                    "uri": "http://edamontology.org/operation_2488"
                },
                {
                    "term": "Protein secondary structure prediction",
                    "uri": "http://edamontology.org/operation_0267"
                },
                {
                    "term": "Transmembrane protein prediction",
                    "uri": "http://edamontology.org/operation_0269"
                }
            ]
        }
    ],
    "homepage": "http://gpcr.biocomp.unibo.it/biodec/",
    "language": [
        "JavaScript"
    ],
    "lastUpdate": "2018-12-10T12:58:56Z",
    "name": "TRAMPLE",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "In this paper we describe a microcomputer program (HTP) for predicting the location and orientation of α-helical transmembrane segments in integral membrane proteins. HTP is a neural network- based tool which gives as output the protein membrane topology based on the statistical propensity of residues to be located in external and internal loops. This method, which uses single protein sequences as input to the network system, correctly predicts the topology of 71 out of 92 membrane proteins of putative membrane orientation, independently of the protein source.",
                "authors": [
                    {
                        "name": "Fariselli P."
                    },
                    {
                        "name": "Casadio R."
                    }
                ],
                "citationCount": 22,
                "date": "1996-04-09T00:00:00Z",
                "journal": "Computer Applications in the Biosciences",
                "title": "HTP: A neural network-based method for predicting the topology of helical transmembrane domains in proteins"
            },
            "pmid": "8670618"
        },
        {
            "metadata": {
                "abstract": "Motivation: Membrane proteins are an abundant and functionally relevant subset of proteins that putatively include from about 15 up to 30% of the proteome of organisms fully sequenced. These estimates are mainly computed on the basis of sequence comparison and membrane protein prediction. It is therefore urgent to develop methods capable of selecting membrane proteins especially in the case of outer membrane proteins, barely taken into consideration when proteome wide analysis is performed. This will also help protein annotation when no homologous sequence is found in the database. Outer membrane proteins solved so far at atomic resolution interact with the external membrane of bacteria with a characteristic β barrel structure comprising different even numbers of β strands (β barrel membrane proteins). In this they differ from the membrane proteins of the cytoplasmic membrane endowed with alpha helix bundles (all alpha membrane proteins) and need specialised predictors. Results: We develop a HMM model, which can predict the topology of β barrel membrane proteins using, as input, evolutionary information. The model is cyclic with 6 types of states: two for the β strand transmembrane core, one for the β strand cap on either side of the membrane, one for the inner loop, one for the outer loop and one for the globular domain state in the middle of each loop. The development of a specific input for HMM based on multiple sequence alignment is novel. The accuracy per residue of the model is 83% when a jack knife procedure is adopted. With a model optimisation method using a dynamic programming algorithm seven topological models out of the twelve proteins included in the testing set are also correctly predicted. When used as a discriminator, the model is rather selective. At a fixed probability value, it retains 84% of a non-redundant set comprising 145 sequences of well-annotated outer membrane proteins. Concomitantly, it correctly rejects 90% of a set of globular proteins including about 1200 chains with low sequence identity (<30%) and 90% of a set of all alpha membrane proteins, including 188 chains. Availability: The program will be available on request from the authors. © Oxford University Press 2002.",
                "authors": [
                    {
                        "name": "Martelli P.L."
                    },
                    {
                        "name": "Fariselli P."
                    },
                    {
                        "name": "Krogh A."
                    },
                    {
                        "name": "Casadio R."
                    }
                ],
                "citationCount": 155,
                "date": "2002-12-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "A sequence-profile-based HMM for predicting and discriminating β barrel membrane proteins"
            },
            "pmid": "12169530"
        },
        {
            "metadata": {
                "abstract": "Previously, we introduced a neural network system predicting locations o f transmembrane helices (HTMs) based on evolutionary profiles (PHDhtm, Rost B, Casadio R, Fariselli P, Sander C, 1995, Protein Sci 4:521-533). Here, we describe an improvement and an extension of that system. The improvement is achieved by a dynamic programming-like algorithm that optimizes helices compatible with the neural network output. The extension is the prediction of topology (orientation of first loop region with respect to membrane) by applying to the refined prediction the observation that positively charged residues are more abundant in extra-cytoplasmic regions. Furthermore, we introduce a method to reduce the number of false positives, i.e., proteins falsely predicted with membrane helices. The evaluation of prediction accuracy is based on a cross-validation and a double-blind test set (in total 131 proteins). The final method appears to be more accurate than other methods published: (1) For almost 89% (±3%) of the test proteins, all HTMs are predicted correctly. (2) For more than 86% (±3%) of the proteins, topology is predicted correctly. (3) We define reliability indices that correlate with prediction accuracy: for one half of the proteins, segment accuracy raises to 98%; and for two-thirds, accuracy of topology prediction is 95%. (4) The rate of proteins for which HTMs are predicted falsely is below 2% (±1%). Finally, the method is applied to 1,616 sequences of Haemophilus influenzae. We predict 19% of the genome sequences to contain one or more HTMs. This appears to be lower than what we predicted previously for the yeast VIII chromosome (about 25%).",
                "authors": [
                    {
                        "name": "Rost B."
                    },
                    {
                        "name": "Fariselli P."
                    },
                    {
                        "name": "Casadio R."
                    }
                ],
                "citationCount": 514,
                "date": "1996-01-01T00:00:00Z",
                "journal": "Protein Science",
                "title": "Topology prediction for helical transmembrane proteins at 86% accuracy"
            },
            "pmid": "8844859"
        },
        {
            "metadata": {
                "abstract": "A method based on neural networks is trained and tested on a nonredundant set of β-barrel membrane proteins known at atomic resolution with a jackknife procedure. The method predicts the topography of transmembrane β strands with residue accuracy as high as 78% when evolutionary information is used as input to the network. Of the transmembrane β-strands included in the training set, 93% are correctly assigned. The predictor includes an algorithm of model optimization, based on dynamic programming, that correctly models eight out of the 11 proteins present in the training/testing set. In addition, protein topology is assigned on the basis of the location of the longest loops in the models. We propose this as a general method to fill the gap of the prediction of β-barrel membrane proteins.",
                "authors": [
                    {
                        "name": "Jacoboni I."
                    },
                    {
                        "name": "Martelli P.L."
                    },
                    {
                        "name": "Fariselli P."
                    },
                    {
                        "name": "De Pinto V."
                    },
                    {
                        "name": "Casadio R."
                    }
                ],
                "citationCount": 89,
                "date": "2001-04-05T00:00:00Z",
                "journal": "Protein Science",
                "title": "Prediction of the transmembrane regions of β-barrel membrane proteins with a neural network-based predictor"
            },
            "pmid": "11274469"
        },
        {
            "metadata": {
                "abstract": "TRAMPLE (http://gpcr.biocomp.unibo.it/biodec/) is a web application server dedicated to the detection and the annotation of transmembrane protein sequences. TRAMPLE includes different state-of-the-art algorithms for the prediction of signal peptides, transmembrane segments (both beta-strands and alpha-helices), secondary structure and fast fold recognition. TRAMPLE also includes a complete content management system to manage the results of the predictions. Each user of the server has his/her own workplace, where the data can be stored, organized, accessed and annotated with documents through a simple web-based interface. In this manner, TRAMPLE significantly improves usability with respect to other more traditional web servers. © 2005 Oxford University Press.",
                "authors": [
                    {
                        "name": "Fariselli P."
                    },
                    {
                        "name": "Finelli M."
                    },
                    {
                        "name": "Rossi I."
                    },
                    {
                        "name": "Amico M."
                    },
                    {
                        "name": "Zauli A."
                    },
                    {
                        "name": "Martelli P.L."
                    },
                    {
                        "name": "Casadio R."
                    }
                ],
                "citationCount": 11,
                "date": "2005-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "TRAMPLE: The transmembrane protein labelling environment"
            },
            "pmid": "15980454"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Protein folds and structural domains",
            "uri": "http://edamontology.org/topic_0736"
        },
        {
            "term": "Protein secondary structure",
            "uri": "http://edamontology.org/topic_3542"
        },
        {
            "term": "Structure prediction",
            "uri": "http://edamontology.org/topic_0082"
        },
        {
            "term": "Protein sites, features and motifs",
            "uri": "http://edamontology.org/topic_3510"
        }
    ],
    "validated": 1
}