{
    "additionDate": "2021-03-19T09:15:01Z",
    "biotoolsCURIE": "biotools:audiomath",
    "biotoolsID": "audiomath",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "jezhill@gmail.com",
            "name": "N. Jeremy Hill",
            "typeEntity": "Person"
        }
    ],
    "description": "audiomath is a package for Python programmers who want to record, manipulate, visualize or play sound waveforms.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://audiomath.readthedocs.io/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                },
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://pypi.org/project/audiomath",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-03-19T17:44:16Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://bitbucket.org/snapproject/audiomath-gitrepo"
        }
    ],
    "name": "audiomath",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1016/J.HELIYON.2021.E06236",
            "metadata": {
                "abstract": "© 2021In neuroscientific experiments and applications, working with auditory stimuli demands software tools for generation and acquisition of raw audio, for composition and tailoring of that material into finished stimuli, for precisely timed presentation of the stimuli, and for experimental session recording. Numerous programming tools exist to approach these tasks, but their differing specializations and conventions demand extra time and effort for integration. In particular, verifying stimulus timing requires extensive engineering effort when developing new applications. This paper has two purposes. The first is to present audiomath (https://pypi.org/project/audiomath), a sound software library for Python that prioritizes the needs of neuroscientists. It minimizes programming effort by providing a simple object-oriented interface that unifies functionality for audio generation, manipulation, visualization, decoding, encoding, recording, and playback. It also incorporates specialized tools for measuring and optimizing stimulus timing. The second purpose is to relay what we have learned, during development and application of the software, about the twin challenges of delivering stimuli precisely at a certain time, and of precisely measuring the time at which stimuli were delivered. We provide a primer on these problems and the possible approaches to them. We then report audio latency measurements across a range of hardware, operating systems and settings, to illustrate the ways in which hardware and software factors interact to affect stimulus presentation performance, and the resulting pitfalls for the programmer and experimenter. In particular, we highlight the potential conflict between demands for low latency, low variability in latency (“jitter”), cooperativeness, and robustness. We report the ways in which audiomath can help to map this territory and provide a simplified path toward each application's particular priority. By unifying audio-related functionality and providing specialized diagnostic tools, audiomath both simplifies and potentiates the development of neuroscientific applications in Python. © 2021Auditory stimuli; Python; Software library; Audio latency; Audio jitter",
                "authors": [
                    {
                        "name": "Hill N.J."
                    },
                    {
                        "name": "Mooney S.W.J."
                    },
                    {
                        "name": "Prusky G.T."
                    }
                ],
                "date": "2021-02-01T00:00:00Z",
                "journal": "Heliyon",
                "title": "audiomath: A neuroscientist's sound toolkit"
            },
            "pmcid": "PMC7881231",
            "pmid": "33615015"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Probes and primers",
            "uri": "http://edamontology.org/topic_0632"
        },
        {
            "term": "Bioengineering",
            "uri": "http://edamontology.org/topic_3398"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        }
    ]
}