{
    "additionDate": "2021-01-18T08:10:07Z",
    "biotoolsCURIE": "biotools:validsplicemut",
    "biotoolsID": "validsplicemut",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "progan@uwo.ca",
            "name": "Peter K. Rogan",
            "typeEntity": "Person"
        }
    ],
    "description": "Expression Changes Confirm Genomic Variants Predicted to Result in Allele-Specific, Alternative mRNA Splicing.\n\n\nInformation Theory is proven to accurately predict the impact a mutation has on mRNA splicing, and has been used to interpret coding and non-coding mutations that alter mRNA splicing in both common and rare diseases (Caminsky et al., 2014; Burke et al., 2018; Dos Santos et al., 2018; Yang et al., 2017; Caminsky et al., 2016; Mucaki et al., 2016; Peterlongo et al., 2014; Mucaki et al., 2013; Mucaki et al., 2011; Rogan et al., 2003; Rogan et al., 1998; Rogan and Schneider, 1995).",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Splice site prediction",
                    "uri": "http://edamontology.org/operation_0433"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Alternative splicing prediction",
                    "uri": "http://edamontology.org/operation_0264"
                },
                {
                    "term": "Variant effect prediction",
                    "uri": "http://edamontology.org/operation_0331"
                },
                {
                    "term": "PCR primer design",
                    "uri": "http://edamontology.org/operation_0308"
                }
            ]
        }
    ],
    "homepage": "http://validsplicemut.cytognomix.com",
    "lastUpdate": "2021-03-11T08:33:54Z",
    "name": "ValidSpliceMut",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.3389/FGENE.2020.00109",
            "metadata": {
                "abstract": "© Copyright © 2020 Mucaki, Shirley and Rogan.Splice isoform structure and abundance can be affected by either noncoding or masquerading coding variants that alter the structure or abundance of transcripts. When these variants are common in the population, these nonconstitutive transcripts are sufficiently frequent so as to resemble naturally occurring, alternative mRNA splicing. Prediction of the effects of such variants has been shown to be accurate using information theory-based methods. Single nucleotide polymorphisms (SNPs) predicted to significantly alter natural and/or cryptic splice site strength were shown to affect gene expression. Splicing changes for known SNP genotypes were confirmed in HapMap lymphoblastoid cell lines with gene expression microarrays and custom designed q-RT-PCR or TaqMan assays. The majority of these SNPs (15 of 22) as well as an independent set of 24 variants were then subjected to RNAseq analysis using the ValidSpliceMut web beacon (http://validsplicemut.cytognomix.com), which is based on data from the Cancer Genome Atlas and International Cancer Genome Consortium. SNPs from different genes analyzed with gene expression microarray and q-RT-PCR exhibited significant changes in affected splice site use. Thirteen SNPs directly affected exon inclusion and 10 altered cryptic site use. Homozygous SNP genotypes resulting in stronger splice sites exhibited higher levels of processed mRNA than alleles associated with weaker sites. Four SNPs exhibited variable expression among individuals with the same genotypes, masking statistically significant expression differences between alleles. Genome-wide information theory and expression analyses (RNAseq) in tumor exomes and genomes confirmed splicing effects for 7 of the HapMap SNP and 14 SNPs identified from tumor genomes. q-RT-PCR resolved rare splice isoforms with read abundance too low for statistical significance in ValidSpliceMut. Nevertheless, the web-beacon provides evidence of unanticipated splicing outcomes, for example, intron retention due to compromised recognition of constitutive splice sites. Thus, ValidSpliceMut and q-RT-PCR represent complementary resources for identification of allele-specific, alternative splicing.",
                "authors": [
                    {
                        "name": "Mucaki E.J."
                    },
                    {
                        "name": "Shirley B.C."
                    },
                    {
                        "name": "Rogan P.K."
                    }
                ],
                "citationCount": 3,
                "date": "2020-03-05T00:00:00Z",
                "journal": "Frontiers in Genetics",
                "title": "Expression Changes Confirm Genomic Variants Predicted to Result in Allele-Specific, Alternative mRNA Splicing"
            },
            "pmcid": "PMC7066660",
            "pmid": "32211018"
        }
    ],
    "topic": [
        {
            "term": "RNA splicing",
            "uri": "http://edamontology.org/topic_3320"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        }
    ]
}