{"credit":[{"email":"pevsner@kennedykrieger.org","name":"Jonathan Pevsner","typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://pevsnerlab.kennedykrieger.org/"}],"documentation":[{"url":"http://pevsnerlab.kennedykrieger.org/pediSNP/pediSNP03.php"},{"type":"GENERAL","url":"http://pevsnerlab.kennedykrieger.org/pediSNP/pediSNP02.php"}],"function":[{"operation":[{"term":"Analysis","uri":"http://edamontology.org/operation_2945"}]}],"labels":{"operatingSystem":["Linux","Windows","Mac"],"toolType":["Web application"],"topic":[{"term":"DNA polymorphism","uri":"http://edamontology.org/topic_2885"},{"term":"Genotype and phenotype","uri":"http://edamontology.org/topic_0625"},{"term":"Genetics","uri":"http://edamontology.org/topic_3053"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/pedisnp-locate-meiotic-recombination-sites-snps.html"}],"publication":[{"abstract":"Background: Meiotic crossovers are the major mechanism by which haplotypes are shuffled to generate genetic diversity. Previously available methods for the genome-wide, high-resolution identification of meiotic crossover sites are limited by the laborious nature of the assay (as in sperm typing). Methods: Several methods have been introduced to identify crossovers using high density single nucleotide polymorphism (SNP) array technologies, although programs are not widely available to implement such analyses. Results: Here we present a two-generation *reverse pedigree analysis* method (analyzing the genotypes of two children relative to each parent) and a web-accessible tool to determine and visualize inheritance differences among siblings and crossover locations on each parental gamete. This approach is complementary to existing methods and uses informative markers which provide high resolution for locating meiotic crossover sites. We introduce a segmentation algorithm to identify crossover sites, and used a synthetic data set to determine that the segmentation algorithm specificity was 92% and sensitivity was 89%. The use of reverse pedigrees allows the inference of crossover locations on the X chromosome in a maternal gamete through analysis of two sons and their father. We further analyzed genotypes from eight multiplex autism families, observing a 1.462 maternal to paternal recombination ratio and no significant differences between affected and unaffected children. Meiotic recombination results from pediSNP can also be used to identify haplotypes that are shared by probands within a pedigree, as we demonstrated with a multiplex autism family. Conclusion: Using *reverse pedigrees* and defining unique sets of genotype markers within pedigree data, we introduce a method that identifies inherited allelic differences and meiotic crossovers. We implemented the method in the pediSNP software program, and we applied it to several data sets. This approach uses data from two generations to identify crossover sites, facilitating studies of recombination in disease. pediSNP is available online at http://pevsnerlab.kennedykrieger.org/pediSNP. © 2009 Ting et al; licensee BioMed Central Ltd.","authors":["Ting J.C.","Roberson E.D.O.","Currier D.G.","Pevsner J."],"cit_count":5,"journal":"BMC Medical Genetics","pmid":"19761602","title":"Locations and patterns of meiotic recombination in two-generation pedigrees","year":"2009-09-17"}],"summary":{"biotoolsCURIE":"biotools:pedisnp","biotoolsID":"pedisnp","description":"Designed to provide an analysis of Single Nucleotide Polymorphism (SNP) data from a pedigree of two generations: two parents with two or more children. I","homepage":"http://pevsnerlab.kennedykrieger.org/pediSNP/","name":"pediSNP"}}