{
    "additionDate": "2017-01-13T13:16:43Z",
    "biotoolsCURIE": "biotools:star",
    "biotoolsID": "star",
    "collectionID": [
        "Animal and Crop Genomics"
    ],
    "credit": [
        {
            "email": "dobin@cshl.edu",
            "name": "rna-styar team",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Ultrafast universal RNA-seq data aligner",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/alexdobin/STAR/releases"
        }
    ],
    "editPermission": {
        "authors": [
            "hmenager",
            "animalandcropgenomics"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence alignment",
                    "uri": "http://edamontology.org/operation_0292"
                }
            ]
        }
    ],
    "homepage": "http://code.google.com/p/rna-star/",
    "language": [
        "C++"
    ],
    "lastUpdate": "2021-09-28T07:28:50.397510Z",
    "license": "GPL-3.0",
    "maturity": "Mature",
    "name": "STAR",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "seqwiki_import",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/bts635",
            "metadata": {
                "abstract": "Motivation: Accurate alignment of high-throughput RNA-seq data is a challenging and yet unsolved problem because of the non-contiguous transcript structure, relatively short read lengths and constantly increasing throughput of the sequencing technologies. Currently available RNA-seq aligners suffer from high mapping error rates, low mapping speed, read length limitation and mapping biases.Results: To align our large (>80 billon reads) ENCODE Transcriptome RNA-seq dataset, we developed the Spliced Transcripts Alignment to a Reference (STAR) software based on a previously undescribed RNA-seq alignment algorithm that uses sequential maximum mappable seed search in uncompressed suffix arrays followed by seed clustering and stitching procedure. STAR outperforms other aligners by a factor of >50 in mapping speed, aligning to the human genome 550 million 2 × 76 bp paired-end reads per hour on a modest 12-core server, while at the same time improving alignment sensitivity and precision. In addition to unbiased de novo detection of canonical junctions, STAR can discover non-canonical splices and chimeric (fusion) transcripts, and is also capable of mapping full-length RNA sequences. Using Roche 454 sequencing of reverse transcription polymerase chain reaction amplicons, we experimentally validated 1960 novel intergenic splice junctions with an 80-90% success rate, corroborating the high precision of the STAR mapping strategy. © The Author(s) 2012. Published by Oxford University Press.",
                "authors": [
                    {
                        "name": "Dobin A."
                    },
                    {
                        "name": "Davis C.A."
                    },
                    {
                        "name": "Schlesinger F."
                    },
                    {
                        "name": "Drenkow J."
                    },
                    {
                        "name": "Zaleski C."
                    },
                    {
                        "name": "Jha S."
                    },
                    {
                        "name": "Batut P."
                    },
                    {
                        "name": "Chaisson M."
                    },
                    {
                        "name": "Gingeras T.R."
                    }
                ],
                "citationCount": 12650,
                "date": "2013-01-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "STAR: Ultrafast universal RNA-seq aligner"
            },
            "pmcid": "PMC3530905",
            "pmid": "23104886",
            "type": [
                "Primary"
            ]
        },
        {
            "doi": "10.1038/nmeth.4106",
            "metadata": {
                "abstract": "© 2017 Nature America, inc., part of springer Nature. All rights reserved.Alignment is the first step in most RNA-seq analysis pipelines, and the accuracy of downstream analyses depends heavily on it. Unlike most steps in the pipeline, alignment is particularly amenable to benchmarking with simulated data. We performed a comprehensive benchmarking of 14 common splice-aware aligners for base, read, and exon junction-level accuracy and compared default with optimized parameters. We found that performance varied by genome complexity, and accuracy and popularity were poorly correlated. The most widely cited tool underperforms for most metrics, particularly when using default settings.",
                "authors": [
                    {
                        "name": "Baruzzo G."
                    },
                    {
                        "name": "Hayer K.E."
                    },
                    {
                        "name": "Kim E.J."
                    },
                    {
                        "name": "DI Camillo B."
                    },
                    {
                        "name": "Fitzgerald G.A."
                    },
                    {
                        "name": "Grant G.R."
                    }
                ],
                "citationCount": 115,
                "date": "2017-02-01T00:00:00Z",
                "journal": "Nature Methods",
                "title": "Simulation-based comprehensive benchmarking of RNA-seq aligners"
            },
            "pmcid": "PMC5792058",
            "pmid": "27941783",
            "type": [
                "Benchmarking study"
            ]
        },
        {
            "doi": "10.1093/bioinformatics/btu146",
            "metadata": {
                "abstract": "Motivation: Next-generation sequencing has become an important tool in molecular biology. Various protocols to investigate genomic, transcriptomic and epigenomic features across virtually all species and tissues have been devised. For most of these experiments, one of the first crucial steps of bioinformatic analysis is the mapping of reads to reference genomes. Results: Here, we present thorough benchmarks of our read aligner segemehl in comparison with other state-of-the-art methods. Furthermore, we introduce the tool lack to rescue unmapped RNA-seq reads which works in conjunction with segemehl and many other frequently used split-read aligners. © The Author 2014.",
                "authors": [
                    {
                        "name": "Otto C."
                    },
                    {
                        "name": "Stadler P.F."
                    },
                    {
                        "name": "Hoffmann S."
                    }
                ],
                "citationCount": 52,
                "date": "2014-07-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Lacking alignments? The next-generation sequencing mapper segemehl revisited"
            },
            "pmid": "24626854",
            "type": [
                "Benchmarking study"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ],
    "validated": 1
}