{
    "additionDate": "2015-09-11T22:52:47Z",
    "biotoolsCURIE": "biotools:ccap",
    "biotoolsID": "ccap",
    "collectionID": [
        "DRCAT"
    ],
    "credit": [
        {
            "email": "CCAP@sams.ac.uk",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "name": "DRCAT",
            "typeEntity": "Project",
            "typeRole": [
                "Documentor"
            ]
        }
    ],
    "description": "Culture collection of algae and protozoa.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://www.ccap.ac.uk/index.htm"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "CCAP strain number",
                        "uri": "http://edamontology.org/data_2778"
                    }
                }
            ],
            "operation": [
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Cell line report",
                        "uri": "http://edamontology.org/data_0963"
                    },
                    "format": [
                        {
                            "term": "HTML",
                            "uri": "http://edamontology.org/format_2331"
                        }
                    ]
                }
            ]
        }
    ],
    "homepage": "http://www.ccap.ac.uk/index.htm",
    "lastUpdate": "2018-12-10T12:58:49Z",
    "name": "Culture collection of algae and protozoa (CCAP)",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "DRCAT",
    "publication": [
        {
            "doi": "10.1016/j.gene.2007.05.018",
            "metadata": {
                "abstract": "CCAP, the largest European protistan culture collection, is based at the Scottish Association for Marine Science near Oban, Scotland (http://www.ccap.ac.uk). The Collection comprises more than 2700 strains in the public domain, of which 1050 are marine algae, 1300 freshwater algae, and 350 protozoa. The primary mission of CCAP is to maintain and distribute defined cultures and their associated information to its customers. It also has a support and advisory function on all aspects of protistan science. In addition, it is involved in the training of students and researchers in algal identification and culture techniques. In light of the increasing number of fully sequenced protists, the CCAP is striving to provide targeted services and support to workers involved in all aspects of genomic research. At present, the Collection holds several hundred strains of genomic model taxa including: Acanthamoeba, Cafeteria, Cercomonas, Chlamydomonas, Chlorella, Cyanophora, Dictyostelium, Dunaliella, Ectocarpus, Emiliania, Euglena, Micromonas, Naegleria, Nephroselmis, Paramecium, Pavlova, Phaeodactylum, Porphyra, Pseudendoclonium, Pylaiella, Rhodomonas, Scenedesmus, Staurastrum, Tetrahymena, Thalassiosira, Volvox and Zygnema. These strains provide a defined representation of natural variation within model organisms, an increasingly useful resource for post-genomics approaches. Our aim over the next 2-5 years is to add value to the Collection by increasing the number of genome model species, and by offering an integrated, up-to-date, easy-to-use resource that would provide curated information on our strain holdings. In collaboration with other major Biological Resource Centres worldwide, we intend to build a hub providing access to both protistan cultures and their associated bioinformatics data. © 2007 Elsevier B.V. All rights reserved.",
                "authors": [
                    {
                        "name": "Campbell C.N."
                    },
                    {
                        "name": "Day J.G."
                    },
                    {
                        "name": "Gachon C.M.M."
                    },
                    {
                        "name": "Kupper F.C."
                    },
                    {
                        "name": "Proschold T."
                    },
                    {
                        "name": "Saxon R.J."
                    }
                ],
                "citationCount": 21,
                "date": "2007-12-30T00:00:00Z",
                "journal": "Gene",
                "title": "The Culture Collection of Algae and Protozoa (CCAP): A biological resource for protistan genomics"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        }
    ],
    "validated": 1
}
