{
    "additionDate": "2017-08-03T18:57:55Z",
    "biotoolsCURIE": "biotools:rnaeapath",
    "biotoolsID": "rnaeapath",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://genome.ucf.edu/"
        }
    ],
    "description": "The tool provides an alternate approach for predicting low-barrier folding pathways between RNA conformational secondary structures.",
    "documentation": [
        {
            "type": "General",
            "url": "http://genome.ucf.edu/RNAEAPath/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Nucleic acid folding analysis",
                    "uri": "http://edamontology.org/operation_0279"
                }
            ]
        }
    ],
    "homepage": "http://genome.ucf.edu/RNAEAPath/",
    "language": [
        "C"
    ],
    "lastUpdate": "2018-12-10T12:58:49Z",
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/rnaeapath-1-0-predicting-folding-pathways-rna-conformational-structures-guided-rna-stacks.html"
        }
    ],
    "name": "RNAEAPath",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Background: Accurately predicting low energy barrier folding pathways between conformational secondary structures of an RNA molecule can provide valuable information for understanding its catalytic and regulatory functions. Most existing heuristic algorithms guide the construction of folding pathways by free energies of intermediate structures in the next move during the folding. However due to the size and ruggedness of RNA energy landscape, energy-guided search can become trapped in local optima.Results: In this paper, we propose an algorithm that guides the construction of folding pathways through the formation and destruction of RNA stacks. Guiding the construction of folding pathways by coarse grained movements of RNA stacks can help reduce the search space and make it easier to jump out of local optima. RNAEAPath is able to find lower energy barrier folding pathways between secondary structures of conformational switches and outperforms the existing heuristic algorithms in most test cases.Conclusions: RNAEAPath provides an alternate approach for predicting low-barrier folding pathways between RNA conformational secondary structures. The source code of RNAEAPath and the test data sets are available at http://genome.ucf.edu/RNAEAPath. © 2012 Li and Zhang; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Li Y."
                    },
                    {
                        "name": "Zhang S."
                    }
                ],
                "citationCount": 8,
                "date": "2012-03-21T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Predicting folding pathways between RNA conformational structures guided by RNA stacks"
            },
            "pmid": "22536903"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        },
        {
            "term": "Nucleic acid structure analysis",
            "uri": "http://edamontology.org/topic_0097"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ],
    "validated": 1
}