{"credit":[{"email":"juw.park@louisville.edu","typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://rmaps.cecsresearch.org/"}],"documentation":[{"type":"GENERAL","url":"http://rmaps.cecsresearch.org/Help/UserGuide"}],"function":[{"operation":[{"term":"Differential binding analysis","uri":"http://edamontology.org/operation_3677"},{"term":"Sequence motif analysis","uri":"http://edamontology.org/operation_2404"}]}],"labels":{"operatingSystem":["Linux","Windows","Mac"],"toolType":["Web application"],"topic":[{"term":"Proteins","uri":"http://edamontology.org/topic_0078"},{"term":"RNA","uri":"http://edamontology.org/topic_0099"},{"term":"Gene transcripts","uri":"http://edamontology.org/topic_3512"},{"term":"Nucleic acid structure analysis","uri":"http://edamontology.org/topic_0097"},{"term":"Data visualisation","uri":"http://edamontology.org/topic_0092"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/rmaps-rna-map-analysis-and-plotting-server-for-alternative-exon-regulation.html"}],"publication":[{"abstract":"© The Author(s) 2016. Published by Oxford University Press on behalf of Nucleic Acids Research. RNA-binding proteins (RBPs) play a critical role in the regulation of alternative splicing (AS), a prevalent mechanism for generating transcriptomic and proteomic diversity in eukaryotic cells. Studies have shown that AS can be regulated by RBPs in a binding-site-position dependent manner. Depending on where RBPs bind, splicing of an alternative exon can be enhanced or suppressed. Therefore, spatial analyses of RBP motifs and binding sites around alternative exons will help elucidate splicing regulation by RBPs. The development of high-throughput sequencing technologies has allowed transcriptome-wide analyses of AS and RBP-RNA interactions. Given a set of differentially regulated alternative exons obtained from RNA sequencing (RNA-seq) experiments, the rMAPS web server (http://rmaps.cecsresearch.org) performs motif analyses of RBPs in the vicinity of alternatively spliced exons and creates RNA maps that depict the spatial patterns of RBP motifs. Similarly, rMAPS can also perform spatial analyses of RBP-RNA binding sites identified by cross-linking immunoprecipitation sequencing (CLIP-seq) experiments. We anticipate rMAPS will be a useful tool for elucidating RBP regulation of alternative exon splicing using high-throughput sequencing data.","authors":["Park J.W.","Jung S.","Rouchka E.C.","Tseng Y.-T.","Xing Y."],"cit_count":14,"journal":"Nucleic acids research","pmid":"27174931","title":"rMAPS: RNA map analysis and plotting server for alternative exon regulation","year":"2016-07-08"}],"summary":{"biotoolsCURIE":"biotools:rmaps","biotoolsID":"rmaps","description":"A web server that systematically generates RNA-maps for the analysis of RNA-binding proteins (RBPs) binding sites which have position-dependent functions.","homepage":"http://rmaps.cecsresearch.org/","name":"rMAPS"}}