{
    "additionDate": "2021-03-19T09:07:44Z",
    "biotoolsCURIE": "biotools:ppd",
    "biotoolsID": "ppd",
    "confidence_flag": "tool",
    "description": "PPD-Prokaryotic Promoter Database: A Manually Curated Database for Experimentally Verified Prokaryotic Promoters.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Promoter prediction",
                    "uri": "http://edamontology.org/operation_0440"
                },
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                }
            ]
        }
    ],
    "homepage": "http://lin-group.cn/database/ppd/",
    "lastUpdate": "2021-03-28T13:15:18Z",
    "name": "PPD",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1016/J.JMB.2021.166860",
            "metadata": {
                "abstract": "© 2021 Elsevier LtdAs a key region, promoter plays a key role in transcription regulation. A eukaryotic promoter database called EPD has been constructed to store eukaryotic POL II promoters. Although there are some promoter databases for specific prokaryotic species or specific promoter type, such as RegulonDB for Escherichia coli K-12, DBTBS for Bacillus subtilis and Pro54DB for sigma 54 promoter, because of the diversity of prokaryotes and the development of sequencing technology, huge amounts of prokaryotic promoters are scattered in numerous published articles, which is inconvenient for researchers to explore the process of gene regulation in prokaryotes. In this study, we constructed a Prokaryotic Promoter Database (PPD), which records the experimentally validated promoters in prokaryotes, from published articles. Up to now, PPD has stored 129,148 promoters across 63 prokaryotic species manually extracted from published papers. We provided a friendly interface for users to browse, search, blast, visualize, submit and download data. The PPD will provide relatively comprehensive resources of prokaryotic promoter for the study of prokaryotic gene transcription. The PPD is freely available and easy accessed at http://lin-group.cn/database/ppd/.",
                "authors": [
                    {
                        "name": "Su W."
                    },
                    {
                        "name": "Liu M.-L."
                    },
                    {
                        "name": "Yang Y.-H."
                    },
                    {
                        "name": "Wang J.-S."
                    },
                    {
                        "name": "Li S.-H."
                    },
                    {
                        "name": "Lv H."
                    },
                    {
                        "name": "Dao F.-Y."
                    },
                    {
                        "name": "Yang H."
                    },
                    {
                        "name": "Lin H."
                    }
                ],
                "citationCount": 6,
                "date": "2021-05-28T00:00:00Z",
                "journal": "Journal of Molecular Biology",
                "title": "PPD: A Manually Curated Database for Experimentally Verified Prokaryotic Promoters"
            },
            "pmid": "33539888"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "Data submission, annotation and curation",
            "uri": "http://edamontology.org/topic_0219"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        }
    ]
}