{
    "additionDate": "2017-01-13T13:14:34Z",
    "biotoolsCURIE": "biotools:fhitings",
    "biotoolsID": "fhitings",
    "credit": [
        {
            "email": "jordan.peccia@yale.edu",
            "name": "Jordan Peccia",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "\"FHiTINGS is designed for use in rapidly identifying, classifying, and parsing internal transcribed spacer (ITS) DNA sequences after a BLASTn search. This software is useful for fungal ecology studies using next generation sequencing (NGS).\"",
    "documentation": [
        {
            "type": "General",
            "url": "https://sourceforge.net/p/fhitings/wiki/Home/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence alignment",
                    "uri": "http://edamontology.org/operation_0292"
                }
            ]
        }
    ],
    "homepage": "https://sourceforge.net/projects/fhitings/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2018-12-10T12:58:52Z",
    "maturity": "Mature",
    "name": "FHiTINGS",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "seqwiki_import",
    "publication": [
        {
            "doi": "10.1002/jobm.201200507",
            "metadata": {
                "abstract": "Improvements in DNA sequencing technology provide unprecedented opportunities to explore fungal diversity, but also present challenges in data analysis due to the large number of sequences generated. Here, we describe an open source software program \"FHiTINGS\" that utilizes the output of a BLASTn (blastall) search to rapidly identify, classify, and parse internal transcribed spacer (ITS) DNA sequences produced in fungal ecology studies that utilize next-generation DNA sequencing. This tool was designed for use with 454 pyrosequencing and is also appropriate for use with any sequencing platform that allows for BLAST searches against the indicated ITS database. For each sequence, FHiTINGS uses the lowest common ancestor method (LCA) to produce a single identification from BLAST output results, and then assigns taxonomic ranks from species through kingdom when possible for each sequence based on the Index Fungorum database. The program then sums and sorts this data into tabular form to enable rapid analysis of the sample, including α-diversity measures or richness. In silico testing demonstrates the time required to analyze and classify 1000 sequences is reduced from over 2h by manual sorting to <1min of computational time when using FHiTINGS, and that the classification output from the software is consistent with that derived from manual sorting of the data. © 2014 WILEY-VCH Verlag GmbH & Co. KGaA, Weinheim.",
                "authors": [
                    {
                        "name": "Dannemiller K.C."
                    },
                    {
                        "name": "Reeves D."
                    },
                    {
                        "name": "Bibby K."
                    },
                    {
                        "name": "Yamamoto N."
                    },
                    {
                        "name": "Peccia J."
                    }
                ],
                "citationCount": 35,
                "date": "2014-01-01T00:00:00Z",
                "journal": "Journal of Basic Microbiology",
                "title": "Fungal High-throughput Taxonomic Identification tool for use with Next-Generation Sequencing (FHiTINGS)"
            },
            "type": "Primary"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "Comparative genomics",
            "uri": "http://edamontology.org/topic_0797"
        }
    ],
    "validated": 1
}