{
    "additionDate": "2024-04-08T10:02:11.012451Z",
    "biotoolsCURIE": "biotools:pycreas",
    "biotoolsID": "pycreas",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "s.scherneck@tu-braunschweig.de",
            "name": "Stephan Scherneck",
            "typeEntity": "Person"
        }
    ],
    "description": "Tool for quantification of localization and distribution of endocrine cell types in the islets of Langerhans.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://gitlab.com/scherneckgroup/pycreas",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-04-08T10:02:11.015167Z",
    "license": "GPL-3.0",
    "name": "PyCreas",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.3389/FENDO.2023.1250023",
            "metadata": {
                "abstract": "Manifest diabetes, but also conditions of increased insulin resistance such as pregnancy or obesity can lead to islet architecture remodeling. The contributing mechanisms are as poorly understood as the consequences of altered cell arrangement. For the quantification of the different cell types but also the frequency of different cell-cell contacts within the islets, different approaches exist. However, few methods are available to characterize islet cell distribution in a statistically valid manner. Here we describe PyCreas, an open-source tool written in Python that allows semi-automated analysis of islet cell distribution based on images of pancreatic sections stained by immunohistochemistry or immunofluorescence. To ensure that the PyCreas tool is suitable for quantitative analysis of cell distribution in the islets at different metabolic states, we studied the localization and distribution of alpha, beta, and delta cells during gestation and prediabetes. We compared the islet cell distribution of pancreatic islets from metabolically healthy NMRI mice with that of New Zealand obese (NZO) mice, which exhibit impaired glucose tolerance (IGT) both preconceptionally and during gestation, and from C57BL/6 N (B6) mice, which acquire this IGT only during gestation. Since substrain(s) of the NZO mice are known to show a variant in the Abcc8 gene, we additionally examined preconceptional SUR1 knock-out (SUR1-KO) mice. PyCreas provided quantitative evidence that alterations in the Abcc8 gene are associated with an altered distribution pattern of islet cells. Moreover, our data indicate that this cannot be a consequence of prolonged hyperglycemia, as islet architecture is already altered in the prediabetic state. Furthermore, the quantitative analysis suggests that states of transient IGT, such as during common gestational diabetes mellitus (GDM), are not associated with changes in islet architecture as observed during long-term IGT. PyCreas provides the ability to systematically analyze the localization and distribution of islet cells at different stages of metabolic disease to better understand the underlying pathophysiology.",
                "authors": [
                    {
                        "name": "Asuaje Pfeifer M."
                    },
                    {
                        "name": "Grupe K."
                    },
                    {
                        "name": "Langehein H."
                    },
                    {
                        "name": "Liebmann M."
                    },
                    {
                        "name": "Muller S."
                    },
                    {
                        "name": "Rustenbeck I."
                    },
                    {
                        "name": "Scherneck S."
                    },
                    {
                        "name": "Seyda J."
                    }
                ],
                "date": "2023-01-01T00:00:00Z",
                "journal": "Frontiers in Endocrinology",
                "title": "PyCreas: a tool for quantification of localization and distribution of endocrine cell types in the islets of Langerhans"
            },
            "pmcid": "PMC10523144",
            "pmid": "37772078"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Endocrinology and metabolism",
            "uri": "http://edamontology.org/topic_3407"
        },
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        }
    ]
}
