{
    "accessibility": "Open access",
    "additionDate": "2020-04-24T15:51:24Z",
    "biotoolsCURIE": "biotools:watchdog",
    "biotoolsID": "watchdog",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Amrei L Menzel"
        },
        {
            "name": "Marie-Sophie Friedl"
        },
        {
            "name": "Michael Kluge"
        },
        {
            "name": "Caroline C. Friedel",
            "orcidid": "https://orcid.org/0000-0003-3569-4877"
        }
    ],
    "description": "Workflow management system for the automated and distributed analysis of large-scale experimental data",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://klugem.github.io/watchdog/Watchdog-manual.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "RNA-Seq analysis",
                    "uri": "http://edamontology.org/operation_3680"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://www.bio.ifi.lmu.de/watchdog",
    "language": [
        "Java"
    ],
    "lastUpdate": "2024-11-24T14:48:18.737857Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://anaconda.org/bioconda/watchdog-wms"
        },
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/klugem/watchdog"
        },
        {
            "type": [
                "Repository"
            ],
            "url": "https://hub.docker.com/r/klugem/watchdog-wms/"
        }
    ],
    "name": "Watchdog",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "CarolineFriedel",
    "publication": [
        {
            "doi": "10.1093/gigascience/giaa068",
            "metadata": {
                "abstract": "Background: Advances in high-throughput methods have brought new challenges for biological data analysis, often requiring many interdependent steps applied to a large number of samples. To address this challenge, workflow management systems, such as Watchdog, have been developed to support scientists in the (semi-)automated execution of large analysis workflows. Implementation: Here, we present Watchdog 2.0, which implements new developments for module creation, reusability, and documentation and for reproducibility of analyses and workflow execution. Developments include a graphical user interface for semi-automatic module creation from software help pages, sharing repositories for modules and workflows, and a standardized module documentation format. The latter allows generation of a customized reference book of public and user-specific modules. Furthermore, extensive logging of workflow execution, module and software versions, and explicit support for package managers and container virtualization now ensures reproducibility of results. A step-by-step analysis protocol generated from the log file may, e.g., serve as a draft of a manuscript methods section. Finally, 2 new execution modes were implemented. One allows resuming workflow execution after interruption or modification without rerunning successfully executed tasks not affected by changes. The second one allows detaching and reattaching to workflow execution on a local computer while tasks continue running on computer clusters. Conclusions: Watchdog 2.0 provides several new developments that we believe to be of benefit for large-scale bioinformatics analysis and that are not completely covered by other competing workflow management systems. The software itself, module and workflow repositories, and comprehensive documentation are freely available at https://www.bio.ifi.lmu.de/watchdog.",
                "authors": [
                    {
                        "name": "Friedel C.C."
                    },
                    {
                        "name": "Friedl M.-S."
                    },
                    {
                        "name": "Kluge M."
                    },
                    {
                        "name": "Menzel A.L."
                    }
                ],
                "citationCount": 6,
                "date": "2020-01-01T00:00:00Z",
                "journal": "GigaScience",
                "title": "Watchdog 2.0: New developments for reusability, reproducibility, and workflow execution"
            },
            "pmcid": "PMC7298769",
            "pmid": "32556167"
        },
        {
            "doi": "10.1186/s12859-018-2107-4",
            "metadata": {
                "abstract": "Background: The development of high-throughput experimental technologies, such as next-generation sequencing, have led to new challenges for handling, analyzing and integrating the resulting large and diverse datasets. Bioinformatical analysis of these data commonly requires a number of mutually dependent steps applied to numerous samples for multiple conditions and replicates. To support these analyses, a number of workflow management systems (WMSs) have been developed to allow automated execution of corresponding analysis workflows. Major advantages of WMSs are the easy reproducibility of results as well as the reusability of workflows or their components. Results: In this article, we present Watchdog, a WMS for the automated analysis of large-scale experimental data. Main features include straightforward processing of replicate data, support for distributed computer systems, customizable error detection and manual intervention into workflow execution. Watchdog is implemented in Java and thus platform-independent and allows easy sharing of workflows and corresponding program modules. It provides a graphical user interface (GUI) for workflow construction using pre-defined modules as well as a helper script for creating new module definitions. Execution of workflows is possible using either the GUI or a command-line interface and a web-interface is provided for monitoring the execution status and intervening in case of errors. To illustrate its potentials on a real-life example, a comprehensive workflow and modules for the analysis of RNA-seq experiments were implemented and are provided with the software in addition to simple test examples. Conclusions:Watchdog is a powerful and flexible WMS for the analysis of large-scale high-throughput experiments. We believe it will greatly benefit both users with and without programming skills who want to develop and apply bioinformatical workflows with reasonable overhead. The software, example workflows and a comprehensive documentation are freely available at www.bio.ifi.lmu.de/watchdog.",
                "authors": [
                    {
                        "name": "Friedel C.C."
                    },
                    {
                        "name": "Kluge M."
                    }
                ],
                "citationCount": 17,
                "date": "2018-03-13T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Watchdog - a workflow management system for the distributed analysis of large-scale experimental data"
            },
            "pmcid": "PMC5850912",
            "pmid": "29534677"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Bioinformatics",
            "uri": "http://edamontology.org/topic_0091"
        },
        {
            "term": "ChIP-seq",
            "uri": "http://edamontology.org/topic_3169"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ],
    "validated": 1,
    "version": [
        "1.2.5-2.0.6"
    ]
}
