{
    "accessibility": "Open access (with restrictions)",
    "additionDate": "2021-05-05T10:53:22Z",
    "biotoolsCURIE": "biotools:optimaltreatmentstrategies",
    "biotoolsID": "optimaltreatmentstrategies",
    "collectionID": [
        "File Exchange",
        "MATLAB"
    ],
    "cost": "Free of charge (with restrictions)",
    "credit": [
        {
            "name": "Sulav Duwal",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://www.mathworks.com/matlabcentral/profile/1402071-sulav-duwal"
        }
    ],
    "description": "Algorithms based on optimal control theory to optimise the treatment strategies for a disease.",
    "download": [
        {
            "type": "Screenshot",
            "url": "https://www.mathworks.com//matlabcentral/mlc-downloads/downloads/submissions/59202/versions/6/screenshot.png"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "homepage": "https://www.mathworks.com/matlabcentral/fileexchange/59202-sulavduwal-optimaltreatmentstrategies",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2021-05-14T12:15:55Z",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/SulavDuwal/OptimalTreatmentStrategies/issues"
        },
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/SulavDuwal/OptimalTreatmentStrategies"
        }
    ],
    "name": "OptimalTreatmentStrategies",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1371/journal.pcbi.1004200",
            "metadata": {
                "abstract": "© 2015 Duwal et alAn estimated 2.7 million new HIV-1 infections occurred in 2010. `Treatment-for-prevention’ may strongly prevent HIV-1 transmission. The basic idea is that immediate treatment initiation rapidly decreases virus burden, which reduces the number of transmittable viruses and thereby the probability of infection. However, HIV inevitably develops drug resistance, which leads to virus rebound and nullifies the effect of `treatment-for-prevention’ for the time it remains unrecognized. While timely conducted treatment changes may avert periods of viral rebound, necessary treatment options and diagnostics may be lacking in resourceconstrained settings. Within this work, we provide a mathematical platform for comparing different treatment paradigms that can be applied to many medical phenomena. We use this platform to optimize two distinct approaches for the treatment of HIV-1: (i) a diagnosticguided treatment strategy, based on infrequent and patient-specific diagnostic schedules and (ii) a pro-active strategy that allows treatment adaptation prior to diagnostic ascertainment. Both strategies are compared to current clinical protocols (standard of care and the HPTN052 protocol) in terms of patient health, economic means and reduction in HIV-1 onward transmission exemplarily for South Africa. All therapeutic strategies are assessed using a coarse-grained stochastic model of within-host HIV dynamics and pseudo-codes for solving the respective optimal control problems are provided. Our mathematical model suggests that both optimal strategies (i)-(ii) perform better than the current clinical protocols and no treatment in terms of economic means, life prolongation and reduction of HIV-transmission. The optimal diagnostic-guided strategy suggests rare diagnostics and performs similar to the optimal pro-active strategy. Our results suggest that ‘treatment-for-prevention’ may be further improved using either of the two analyzed treatment paradigms.",
                "authors": [
                    {
                        "name": "Duwal S."
                    },
                    {
                        "name": "Schutte C."
                    },
                    {
                        "name": "Von Kleist M."
                    },
                    {
                        "name": "Winkelmann S."
                    }
                ],
                "citationCount": 9,
                "date": "2015-04-01T00:00:00Z",
                "journal": "PLoS Computational Biology",
                "title": "Optimal treatment strategies in the context of ‘treatment for prevention’ against hiv-1 in resource-poor settings"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Biology",
            "uri": "http://edamontology.org/topic_3070"
        },
        {
            "term": "Biomedical science",
            "uri": "http://edamontology.org/topic_3344"
        }
    ],
    "version": [
        "1.0.0.0"
    ]
}
