{
    "additionDate": "2021-01-18T11:11:49Z",
    "biotoolsCURIE": "biotools:protac-db",
    "biotoolsID": "protac-db",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "lidancps@zju.edu.cn",
            "name": "Dan Li",
            "typeEntity": "Person"
        },
        {
            "email": "tingjunhou@zju.edu.cn",
            "name": "Tingjun Hou",
            "typeEntity": "Person"
        },
        {
            "email": "wujian2000@zju.edu.cn",
            "name": "Jian Wu",
            "typeEntity": "Person"
        }
    ],
    "description": "PROTAC-DB is the first web-accessible database dedicated to proteolysis-targeting chimeras (PROTACs). Users can search compounds through target, chemical structure, compound name, and ID. The chemical structures, biological activities, and physiochemical properties of these compounds were manually extracted from the literature or calculated by some programs. We will constantly add new data and improve the usability of the interface. The latest version of PROTAC-DB was released on 2020-09-09.\n\nan online database of PROTACs.\n\nExample: EGFR AR ARV-771 dBET1 13.\n\nPROTACs Warheads E3 ligands Linkers.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Phasing",
                    "uri": "http://edamontology.org/operation_3454"
                },
                {
                    "term": "Virtual screening",
                    "uri": "http://edamontology.org/operation_3938"
                }
            ]
        }
    ],
    "homepage": "http://cadd.zju.edu.cn/protacdb/",
    "lastUpdate": "2021-01-28T16:29:39Z",
    "name": "PROTAC-DB",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1093/NAR/GKAA807",
            "metadata": {
                "abstract": "© 2021 The Author(s) 2020. Published by Oxford University Press on behalf of Nucleic Acids Research.Proteolysis-targeting chimeras (PROTACs), which selectively degrade targeted proteins by the ubiquitin-proteasome system, have emerged as a novel therapeutic technology with potential advantages over traditional inhibition strategies. In the past few years, this technology has achieved substantial progress and two PROTACs have been advanced into phase I clinical trials. However, this technology is still maturing and the design of PROTACs remains a great challenge. In order to promote the rational design of PROTACs, we present PROTAC-DB, a web-based open-access database that integrates structural information and experimental data of PROTACs. Currently, PROTAC-DB consists of 1662 PROTACs, 202 warheads (small molecules that target the proteins of interest), 65 E3 ligands (small molecules capable of recruiting E3 ligases) and 806 linkers, as well as their chemical structures, biological activities, and physicochemical properties. Except the biological activities of warheads and E3 ligands, PROTAC-DB also provides the degradation capacities, binding affinities and cellular activities for PROTACs. PROTAC-DB can be queried with two general searching approaches: text-based (target name, compound name or ID) and structure-based. In addition, for the convenience of users, a filtering tool for the searching results based on the physicochemical properties of compounds is also offered. PROTAC-DB is freely accessible at http://cadd.zju.edu.cn/protacdb/.",
                "authors": [
                    {
                        "name": "Cao D."
                    },
                    {
                        "name": "Dong X."
                    },
                    {
                        "name": "Gao J."
                    },
                    {
                        "name": "He Q."
                    },
                    {
                        "name": "Hou T."
                    },
                    {
                        "name": "Li D."
                    },
                    {
                        "name": "Shen C."
                    },
                    {
                        "name": "Weng G."
                    },
                    {
                        "name": "Wu J."
                    },
                    {
                        "name": "Yang B."
                    }
                ],
                "citationCount": 11,
                "date": "2021-01-08T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "PROTAC-DB: An online database of PROTACs"
            },
            "pmid": "33010159"
        }
    ],
    "topic": [
        {
            "term": "Literature and language",
            "uri": "http://edamontology.org/topic_3068"
        },
        {
            "term": "Molecular biology",
            "uri": "http://edamontology.org/topic_3047"
        },
        {
            "term": "Preclinical and clinical studies",
            "uri": "http://edamontology.org/topic_3379"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ]
}
