
{
    "credit": [
        {
            "email": "Mark.Gerstein@Yale.edu",
            "name": "Mark Gerstein",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Structural variation detection",
                    "uri": "http://edamontology.org/operation_3228"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Perl",
            "Python"
        ],
        "operatingSystem": [
            "Linux"
        ],
        "toolType": [
            "Workflow"
        ],
        "topic": [
            {
                "term": "DNA structural variation",
                "uri": "http://edamontology.org/topic_3175"
            }
        ]
    },
    "publication": [
        {
            "abstract": "Personal-genomics endeavors, such as the 1000 Genomes project, are generating maps of genomic structural variants by analyzing ends of massively sequenced genome fragments. To process these we developed Paired-End Mapper (PEMer; http://sv.gersteinlab.org/pemer). This comprises an analysis pipeline, compatible with several next-generation sequencing platforms; simulation-based error models, yielding confidence-values for each structural variant; and a back-end database. The simulations demonstrated high structural variant reconstruction efficiency for PEMer's coverage-adjusted multi-cutoff scoring-strategy and showed its relative insensitivity to base-calling errors. © 2009 Korbel et al.; licensee BioMed Central Ltd.",
            "authors": [
                "Korbel J.O.",
                "Abyzov A.",
                "Mu X.J.",
                "Carriero N.",
                "Cayting P.",
                "Zhang Z.",
                "Snyder M.",
                "Gerstein M.B."
            ],
            "cit_count": 165,
            "journal": "Genome Biology",
            "pmid": "19236709",
            "title": "PEMer: A computational framework with simulation-based error models for inferring genomic structural variants from massive paired-end sequencing data",
            "year": "2009-02-23"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:pemer",
        "biotoolsID": "pemer",
        "description": "The package is composed of three modules, PEMer workflow, SV-Simulation and BreakDB. PEMer workflow is a sensitive software for detecting SVs from paired-end sequence reads. SV-Simulation randomly introduces SVs into a given genome and generates simulated paired-end reads from the ‘novel’ genome. Subsequent analysis with PEMer workflow on the simulated reads can facilitate parameterize PEMer workflow.",
        "homepage": "http://sv.gersteinlab.org/pemer/",
        "name": "PEMer"
    }
}