{
    "name": "CONSTAX", 
    "description": "Tool for improved taxonomic resolution of environmental fungal ITS sequences.", 
    "homepage": "https://github.com/natalie-vandepol/compare_taxonomy", 
    "biotoolsID": "CONSTAX", 
    "biotoolsCURIE": "biotools:CONSTAX", 
    "version": [], 
    "otherID": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_3460", 
                    "term": "Taxonomic classification"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Command-line tool"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_0637", 
            "term": "Taxonomy"
        }
    ], 
    "operatingSystem": [
        "Linux", 
        "Mac"
    ], 
    "language": [
        "R", 
        "Python"
    ], 
    "license": null, 
    "collectionID": [], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [], 
    "download": [], 
    "documentation": [
        {
            "url": "https://github.com/natalie-vandepol/compare_taxonomy/blob/master/README.md", 
            "type": "General", 
            "note": null
        }, 
        {
            "url": "https://github.com/natalie-vandepol/compare_taxonomy/blob/master/Supplemental_File1_CONSTAX_tutorial.Rmd", 
            "type": "Manual", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": "10.1186/s12859-017-1952-x", 
            "pmid": null, 
            "pmcid": null, 
            "type": "Primary", 
            "version": null, 
            "metadata": {
                "title": "CONSTAX: A tool for improved taxonomic resolution of environmental fungal ITS sequences", 
                "abstract": "© 2017 The Author(s). Background: One of the most crucial steps in high-throughput sequence-based microbiome studies is the taxonomic assignment of sequences belonging to operational taxonomic units (OTUs). Without taxonomic classification, functional and biological information of microbial communities cannot be inferred or interpreted. The internal transcribed spacer (ITS) region of the ribosomal DNA is the conventional marker region for fungal community studies. While bioinformatics pipelines that cluster reads into OTUs have received much attention in the literature, less attention has been given to the taxonomic classification of these sequences, upon which biological inference is dependent. Results: Here we compare how three common fungal OTU taxonomic assignment tools (RDP Classifier, UTAX, and SINTAX) handle ITS fungal sequence data. The classification power, defined as the proportion of assigned OTUs at a given taxonomic rank, varied among the classifiers. Classifiers were generally consistent (assignment of the same taxonomy to a given OTU) across datasets and ranks; a small number of OTUs were assigned unique classifications across programs. We developed CONSTAX (CONSensus TAXonomy), a Python tool that compares taxonomic classifications of the three programs and merges them into an improved consensus taxonomy. This tool also produces summary classification outputs that are useful for downstream analyses. Conclusions: Our results demonstrate that independent taxonomy assignment tools classify unique members of the fungal community, and greater classification power is realized by generating consensus taxonomy of available classifiers with CONSTAX.", 
                "date": "2017-12-06T00:00:00Z", 
                "citationCount": 0, 
                "authors": [
                    {
                        "name": "Gdanetz K."
                    }, 
                    {
                        "name": "Benucci G.M.N."
                    }, 
                    {
                        "name": "Vande Pol N."
                    }, 
                    {
                        "name": "Bonito G."
                    }
                ], 
                "journal": "BMC Bioinformatics"
            }
        }
    ], 
    "credit": [
        {
            "name": "Gian Maria Niccolò Benucci", 
            "email": "benucci@msu.edu", 
            "url": null, 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "migle_sur", 
    "additionDate": "2018-07-28T07:53:05Z", 
    "lastUpdate": "2018-12-10T12:59:00Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 0, 
    "homepage_status": 0
}