{
    "additionDate": "2021-01-18T10:20:03Z",
    "biotoolsCURIE": "biotools:seladb",
    "biotoolsID": "seladb",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "beremen@usp.br",
            "name": "Berenice Bilharinho Mendonca",
            "orcidid": "https://orcid.org/0000-0003-1762-1084",
            "typeEntity": "Person"
        }
    ],
    "description": "A database of exonic variants in a Brazilian population referred to a quaternary medical center in São Paulo.\n\nHigh-throughput sequencing of genomes, exomes, and disease-focused gene panels is becoming increasingly common for molecular diagnostics. However, identifying a single clinically relevant pathogenic variant among thousands of genetic polymorphisms is a challenging task. Publicly available genomic databases are useful resources to filter out common genetic variants present in the population and enable the identification of each disease-causing variant. Based on our experience applying these technologies at Hospital das Clínicas da Faculdade de Medicina da Universidade de São Paulo (HCFMUSP), São Paulo, Brazil, we recognized that the Brazilian population is not adequately represented in widely available genomic databases",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                },
                {
                    "term": "Variant filtering",
                    "uri": "http://edamontology.org/operation_3675"
                },
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                }
            ]
        }
    ],
    "homepage": "http://intranet.fm.usp.br/sela",
    "lastUpdate": "2021-02-16T14:01:42Z",
    "name": "SELAdb",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.6061/CLINICS/2020/E1913",
            "metadata": {
                "abstract": "© 2020 CLINICS.OBJECTIVES: High-throughput sequencing of genomes, exomes, and disease-focused gene panels is becoming increasingly common for molecular diagnostics. However, identifying a single clinically relevant pathogenic variant among thousands of genetic polymorphisms is a challenging task. Publicly available genomic databases are useful resources to filter out common genetic variants present in the population and enable the identification of each disease-causing variant. Based on our experience applying these technologies at Hospital das Clínicas da Faculdade de Medicina da Universidade de São Paulo (HCFMUSP), São Paulo, Brazil, we recognized that the Brazilian population is not adequately represented in widely available genomic databases. METHODS: Here, we took advantage of our 5-year experience as a high-throughput sequencing core facility focused on individuals with putative genetic disorders to build a genomic database that may serve as a more accurate reference for our patient population: SELAdb. RESULTS/CONCLUSIONS: Currently, our database comprises a final cohort of 523 unrelated individuals, including patients or family members managed by different clinics of HCFMUSP. We compared SELAdb with other publicly available genomic databases and demonstrated that this population is very heterogeneous, largely resembling Latin American individuals of mixed origin, rather than individuals of pure European ancestry. Interestingly, exclusively through SELAdb, we identified a spectrum of known and potentially novel pathogenic variants in genes associated with highly penetrant Mendelian disorders, illustrating that pathogenic variants circulating in the Brazilian population that is treated in our clinics are underrepresented in other population databases. SELAdb is freely available for public consultation at: http://intranet.fm.usp.br/sela.",
                "authors": [
                    {
                        "name": "Lerario A.M."
                    },
                    {
                        "name": "Mohan D.R."
                    },
                    {
                        "name": "Montenegro L.R."
                    },
                    {
                        "name": "Funari M.F.A."
                    },
                    {
                        "name": "Nishi M.Y."
                    },
                    {
                        "name": "Narcizo A.M."
                    },
                    {
                        "name": "Benedetti A.F.F."
                    },
                    {
                        "name": "Oba-Shinjo S.M."
                    },
                    {
                        "name": "Vitorino A.J."
                    },
                    {
                        "name": "Dos Santos R.A.S.X."
                    },
                    {
                        "name": "Jorge A.A.L."
                    },
                    {
                        "name": "Onuchic L.F."
                    },
                    {
                        "name": "Marie S.K.N."
                    },
                    {
                        "name": "Mendonca B.B."
                    }
                ],
                "date": "2020-01-01T00:00:00Z",
                "journal": "Clinics",
                "title": "SELADB: A database of exonic variants in a brazilian population referred to a quaternary medical center in São Paulo"
            },
            "pmcid": "PMC7410354",
            "pmid": "32785571"
        }
    ],
    "topic": [
        {
            "term": "Exome sequencing",
            "uri": "http://edamontology.org/topic_3676"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Population genetics",
            "uri": "http://edamontology.org/topic_3056"
        },
        {
            "term": "Personalised medicine",
            "uri": "http://edamontology.org/topic_3577"
        }
    ]
}