{
    "additionDate": "2019-11-14T19:28:53Z",
    "biotoolsCURIE": "biotools:SCRIBER",
    "biotoolsID": "SCRIBER",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "lkurgan@vcu.edu",
            "name": "Lukasz Kurgan",
            "orcidid": "https://orcid.org/0000-0002-7749-0314",
            "typeEntity": "Person"
        }
    ],
    "description": "accurate and partner type-specific prediction of protein-binding residues from proteins sequences | SCRIBER - web server from Biomine lab",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Residue contact prediction",
                    "uri": "http://edamontology.org/operation_0272"
                },
                {
                    "term": "Protein interaction prediction",
                    "uri": "http://edamontology.org/operation_2492"
                },
                {
                    "term": "Protein-protein docking",
                    "uri": "http://edamontology.org/operation_3899"
                }
            ]
        }
    ],
    "homepage": "http://biomine.cs.vcu.edu/servers/SCRIBER/",
    "lastUpdate": "2020-12-18T08:13:02Z",
    "name": "SCRIBER",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ324",
            "metadata": {
                "abstract": "© The Author(s) 2019. Published by Oxford University Press.Motivation: Accurate predictions of protein-binding residues (PBRs) enhances understanding of molecular-level rules governing protein-protein interactions, helps protein-protein docking and facilitates annotation of protein functions. Recent studies show that current sequence-based predictors of PBRs severely cross-predict residues that interact with other types of protein partners (e.g. RNA and DNA) as PBRs. Moreover, these methods are relatively slow, prohibiting genomescale use. Results: We propose a novel, accurate and fast sequence-based predictor of PBRs that minimizes the cross-predictions. Our SCRIBER (SeleCtive pRoteIn-Binding rEsidue pRedictor) method takes advantage of three innovations: comprehensive dataset that covers multiple types of binding residues, novel types of inputs that are relevant to the prediction of PBRs, and an architecture that is tailored to reduce the cross-predictions. The dataset includes complete protein chains and offers improved coverage of binding annotations that are transferred from multiple protein-protein complexes. We utilize innovative two-layer architecture where the first layer generates a prediction of protein-binding, RNA-binding, DNA-binding and small ligand-binding residues. The second layer re-predicts PBRs by reducing overlap between PBRs and the other types of binding residues produced in the first layer. Empirical tests on an independent test dataset reveal that SCRIBER significantly outperforms current predictors and that all three innovations contribute to its high predictive performance. SCRIBER reduces cross-predictions by between 41% and 69% and our conservative estimates show that it is at least 3 times faster. We provide putative PBRs produced by SCRIBER for the entire human proteome and use these results to hypothesize that about 14% of currently known human protein domains bind proteins.",
                "authors": [
                    {
                        "name": "Zhang J."
                    },
                    {
                        "name": "Kurgan L."
                    }
                ],
                "citationCount": 6,
                "date": "2019-07-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "SCRIBER: Accurate and partner type-specific prediction of protein-binding residues from proteins sequences"
            },
            "pmcid": "PMC6612887",
            "pmid": "31510679"
        }
    ],
    "topic": [
        {
            "term": "Molecular modelling",
            "uri": "http://edamontology.org/topic_2275"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        }
    ],
    "validated": 1
}