{
    "additionDate": "2021-01-18T12:06:50Z",
    "biotoolsCURIE": "biotools:ihp-ping",
    "biotoolsID": "ihp-ping",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "gaston.mazandu@uct.ac.za",
            "name": "Gaston K Mazandu",
            "typeEntity": "Person"
        }
    ],
    "description": "IHP-PING-generating integrated human protein-protein interaction networks on-the-fly.\n\nIHP-PING: Integrated Human Protein-Protein Interaction Network Generator.\n\nMaintainer: Gaston K. Mazandu 1,2,3 <gaston.mazandu at uct.ac.za>, Bioinformatics and Genomics Informatics Tools.\n\nIHP-PING provides a flexible python package, which extracts and integrates heterogeneous PPI datasets to generate a unified PPI network on-the-fly, which is stored locally for further potential user applications through three main steps starting from user input as shown in the figure (Part A) below, with basic statistics and properties: power-law and small-world (Part B).",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Network visualisation",
                    "uri": "http://edamontology.org/operation_3925"
                },
                {
                    "term": "Protein interaction network analysis",
                    "uri": "http://edamontology.org/operation_0276"
                },
                {
                    "term": "Protein interaction network prediction",
                    "uri": "http://edamontology.org/operation_3094"
                }
            ]
        }
    ],
    "homepage": "http://web.cbio.uct.ac.za/ITGOM/post-analysis-tools/ihp-ping-dev/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-02-03T07:49:51Z",
    "name": "IHP-PING",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1093/BIB/BBAA277",
            "metadata": {
                "abstract": "© The Author(s) 2020. Published by Oxford University Press. All rights reserved. For Permissions, please email: journals.permissions@oup.com.Advances in high-throughput sequencing technologies have resulted in an exponential growth of publicly accessible biological datasets. In the 'big data' driven 'post-genomic' context, much work is being done to explore human protein-protein interactions (PPIs) for a systems level based analysis to uncover useful signals and gain more insights to advance current knowledge and answer specific biological and health questions. These PPIs are experimentally or computationally predicted, stored in different online databases and some of PPI resources are updated regularly. As with many biological datasets, such regular updates continuously render older PPI datasets potentially outdated. Moreover, while many of these interactions are shared between these online resources, each resource includes its own identified PPIs and none of these databases exhaustively contains all existing human PPI maps. In this context, it is essential to enable the integration of or combining interaction datasets from different resources, to generate a PPI map with increased coverage and confidence. To allow researchers to produce an integrated human PPI datasets in real-time, we introduce the integrated human protein-protein interaction network generator (IHP-PING) tool. IHP-PING is a flexible python package which generates a human PPI network from freely available online resources. This tool extracts and integrates heterogeneous PPI datasets to generate a unified PPI network, which is stored locally for further applications.",
                "authors": [
                    {
                        "name": "Chimusa E.R."
                    },
                    {
                        "name": "Hooper C."
                    },
                    {
                        "name": "Makinde F."
                    },
                    {
                        "name": "Mazandu G.K."
                    },
                    {
                        "name": "Mulder N.J."
                    },
                    {
                        "name": "Nembaware V."
                    },
                    {
                        "name": "Opap K."
                    },
                    {
                        "name": "Thomford N.E."
                    },
                    {
                        "name": "Wonkam A."
                    }
                ],
                "citationCount": 1,
                "date": "2021-07-20T00:00:00Z",
                "journal": "Briefings in bioinformatics",
                "title": "IHP-PING-generating integrated human protein-protein interaction networks on-the-fly"
            },
            "pmid": "33129201"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Human biology",
            "uri": "http://edamontology.org/topic_2815"
        },
        {
            "term": "Informatics",
            "uri": "http://edamontology.org/topic_0605"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Protein interaction experiment",
            "uri": "http://edamontology.org/topic_3957"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        }
    ]
}
