{
    "accessibility": "Open access",
    "additionDate": "2017-07-26T14:31:22Z",
    "biotoolsCURIE": "biotools:calchas",
    "biotoolsID": "calchas",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "koumakis@ics.forth.gr",
            "name": "Lefteris Koumakis",
            "typeEntity": "Person",
            "typeRole": [
                "Developer"
            ]
        },
        {
            "email": "koumakis@ics.forth.gr",
            "name": "Lefteris Koumakis",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://users.ics.forth.gr/~koumakis/"
        }
    ],
    "description": "A web based framework that takes advantage of domain specific ontologies, and Natural Language Processing, aiming to empower exploration of biomedical resources via semantic-based querying and search. The NLP engine analyzes the input free-text query and translates it into targeted queries with terms from the underlying ontology. Each query is passed to the semantically-annotated tools repository, and based on similarity matches, it ranks the available resources.",
    "documentation": [
        {
            "note": "Calchas Manual",
            "type": [
                "User manual"
            ],
            "url": "http://calchas.ics.forth.gr:8580/BiOnline-1.0/calchas.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Text data",
                        "uri": "http://edamontology.org/data_2526"
                    },
                    "format": [
                        {
                            "term": "plain text format (unformatted)",
                            "uri": "http://edamontology.org/format_1964"
                        },
                        {
                            "term": "Annotated text format",
                            "uri": "http://edamontology.org/format_3780"
                        }
                    ]
                }
            ],
            "operation": [
                {
                    "term": "Service discovery",
                    "uri": "http://edamontology.org/operation_3761"
                },
                {
                    "term": "Text annotation",
                    "uri": "http://edamontology.org/operation_3778"
                },
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                },
                {
                    "term": "Service composition",
                    "uri": "http://edamontology.org/operation_3762"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Tool identifier",
                        "uri": "http://edamontology.org/data_0977"
                    },
                    "format": [
                        {
                            "term": "plain text format (unformatted)",
                            "uri": "http://edamontology.org/format_1964"
                        }
                    ]
                }
            ]
        }
    ],
    "homepage": "http://calchas.ics.forth.gr",
    "homepage_status": 1,
    "language": [
        "JavaScript",
        "Java"
    ],
    "lastUpdate": "2020-06-16T10:55:20Z",
    "link": [
        {
            "note": "Calchas tries to link the gap between research question and efficient dynamic biomedical resources discovery.",
            "type": [
                "Other"
            ],
            "url": "http://calchas.ics.forth.gr"
        }
    ],
    "maturity": "Mature",
    "name": "Calchas",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "koumakis",
    "publication": [
        {
            "doi": "10.1186/s12911-015-0200-4",
            "metadata": {
                "abstract": "© 2015 Sfakianaki et al.Background: A plethora of publicly available biomedical resources do currently exist and are constantly increasing at a fast rate. In parallel, specialized repositories are been developed, indexing numerous clinical and biomedical tools. The main drawback of such repositories is the difficulty in locating appropriate resources for a clinical or biomedical decision task, especially for non-Information Technology expert users. In parallel, although NLP research in the clinical domain has been active since the 1960s, progress in the development of NLP applications has been slow and lags behind progress in the general NLP domain. The aim of the present study is to investigate the use of semantics for biomedical resources annotation with domain specific ontologies and exploit Natural Language Processing methods in empowering the non-Information Technology expert users to efficiently search for biomedical resources using natural language. Methods: A Natural Language Processing engine which can \"translate\" free text into targeted queries, automatically transforming a clinical research question into a request description that contains only terms of ontologies, has been implemented. The implementation is based on information extraction techniques for text in natural language, guided by integrated ontologies. Furthermore, knowledge from robust text mining methods has been incorporated to map descriptions into suitable domain ontologies in order to ensure that the biomedical resources descriptions are domain oriented and enhance the accuracy of services discovery. The framework is freely available as a web application at (http://calchas.ics.forth.gr/). Results: For our experiments, a range of clinical questions were established based on descriptions of clinical trials from the ClinicalTrials.gov registry as well as recommendations from clinicians. Domain experts manually identified the available tools in a tools repository which are suitable for addressing the clinical questions at hand, either individually or as a set of tools forming a computational pipeline. The results were compared with those obtained from an automated discovery of candidate biomedical tools. For the evaluation of the results, precision and recall measurements were used. Our results indicate that the proposed framework has a high precision and low recall, implying that the system returns essentially more relevant results than irrelevant. Conclusions: There are adequate biomedical ontologies already available, sufficiency of existing NLP tools and quality of biomedical annotation systems for the implementation of a biomedical resources discovery framework, based on the semantic annotation of resources and the use on NLP techniques. The results of the present study demonstrate the clinical utility of the application of the proposed framework which aims to bridge the gap between clinical question in natural language and efficient dynamic biomedical resources discovery.",
                "authors": [
                    {
                        "name": "Sfakianaki P."
                    },
                    {
                        "name": "Koumakis L."
                    },
                    {
                        "name": "Sfakianakis S."
                    },
                    {
                        "name": "Iatraki G."
                    },
                    {
                        "name": "Zacharioudakis G."
                    },
                    {
                        "name": "Graf N."
                    },
                    {
                        "name": "Marias K."
                    },
                    {
                        "name": "Tsiknakis M."
                    }
                ],
                "citationCount": 19,
                "date": "2015-09-30T00:00:00Z",
                "journal": "BMC Medical Informatics and Decision Making",
                "title": "Semantic biomedical resource discovery: A Natural Language Processing framework"
            },
            "pmcid": "PMC4591066",
            "pmid": "26423616",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Natural language processing",
            "uri": "http://edamontology.org/topic_0218"
        },
        {
            "term": "Ontology and terminology",
            "uri": "http://edamontology.org/topic_0089"
        },
        {
            "term": "Bioinformatics",
            "uri": "http://edamontology.org/topic_0091"
        },
        {
            "term": "Medical informatics",
            "uri": "http://edamontology.org/topic_3063"
        }
    ],
    "validated": 1,
    "version": [
        "1.0"
    ]
}