{
    "additionDate": "2020-01-09T18:12:47Z",
    "biotoolsCURIE": "biotools:FEniCS",
    "biotoolsID": "FEniCS",
    "confidence_flag": "medium",
    "description": "Portable simulation framework for diffusion MRI.\n\nFEniCS is a popular open-source (LGPLv3) computing platform for solving partial differential equations (PDEs). FEniCS enables users to quickly translate scientific models into efficient finite element code. With the high-level Python and C++ interfaces to FEniCS, it is easy to get started, but FEniCS offers also powerful capabilities for more experienced programmers. FEniCS runs on a multitude of platforms ranging from laptops to high-performance clusters.\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'MRI'",
    "editPermission": {
        "type": "public"
    },
    "homepage": "http://fenicsproject.org",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-01-09T18:12:47Z",
    "name": "FEniCS",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1016/J.JMR.2019.106611",
            "metadata": {
                "abstract": "© 2019 Elsevier Inc.The numerical simulation of the diffusion MRI signal arising from complex tissue micro-structures is helpful for understanding and interpreting imaging data as well as for designing and optimizing MRI sequences. The discretization of the Bloch-Torrey equation by finite elements is a more recently developed approach for this purpose, in contrast to random walk simulations, which has a longer history. While finite element discretization is more difficult to implement than random walk simulations, the approach benefits from a long history of theoretical and numerical developments by the mathematical and engineering communities. In particular, software packages for the automated solutions of partial differential equations using finite element discretization, such as FEniCS, are undergoing active support and development. However, because diffusion MRI simulation is a relatively new application area, there is still a gap between the simulation needs of the MRI community and the available tools provided by finite element software packages. In this paper, we address two potential difficulties in using FEniCS for diffusion MRI simulation. First, we simplified software installation by the use of FEniCS containers that are completely portable across multiple platforms. Second, we provide a portable simulation framework based on Python and whose code is open source. This simulation framework can be seamlessly integrated with cloud computing resources such as Google Colaboratory notebooks working on a web browser or with Google Cloud Platform with MPI parallelization. We show examples illustrating the accuracy, the computational times, and parallel computing capabilities. The framework contributes to reproducible science and open-source software in computational diffusion MRI with the hope that it will help to speed up method developments and stimulate research collaborations.",
                "authors": [
                    {
                        "name": "Nguyen V.-D."
                    },
                    {
                        "name": "Leoni M."
                    },
                    {
                        "name": "Dancheva T."
                    },
                    {
                        "name": "Jansson J."
                    },
                    {
                        "name": "Hoffman J."
                    },
                    {
                        "name": "Wassermann D."
                    },
                    {
                        "name": "Li J.-R."
                    }
                ],
                "date": "2019-12-01T00:00:00Z",
                "journal": "Journal of Magnetic Resonance",
                "title": "Portable simulation framework for diffusion MRI"
            },
            "pmid": "31574354"
        }
    ],
    "topic": [
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        },
        {
            "term": "Computer science",
            "uri": "http://edamontology.org/topic_3316"
        },
        {
            "term": "Mathematics",
            "uri": "http://edamontology.org/topic_3315"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        }
    ]
}