{
    "additionDate": "2018-07-08T15:34:33Z",
    "biotoolsCURIE": "biotools:eventpointer",
    "biotoolsID": "eventpointer",
    "collectionID": [
        "BioConductor"
    ],
    "credit": [
        {
            "email": "jpromero@ceit.es",
            "name": "Juan Pablo Romero",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "It identifies alternative splicing events that involve either simple or complex experimental designs such as time course experiments and studies including paired-samples. The algorithm can be used to analyze data from either junction arrays or sequencing data. The algorithm can generate a series of files to visualize the detected alternative splicing events in IGV. This eases the interpretation of results and the design of primers for standard PCR validation.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://bioconductor.org/packages/release/bioc/manuals/EventPointer/man/EventPointer.pdf"
        }
    ],
    "download": [
        {
            "type": "Software package",
            "url": "http://bioconductor.org/packages/release/bioc/src/contrib/EventPointer_1.4.0.tar.gz"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Splicing model analysis",
                    "uri": "http://edamontology.org/operation_2499"
                }
            ]
        }
    ],
    "homepage": "http://bioconductor.org/packages/release/bioc/html/EventPointer.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-10T12:59:00Z",
    "license": "Artistic-2.0",
    "link": [
        {
            "type": [
                "Mirror"
            ],
            "url": "http://bioconductor.org/packages/EventPointer/"
        },
        {
            "type": [
                "Repository"
            ],
            "url": "https://git.bioconductor.org/packages/EventPointer"
        }
    ],
    "name": "EventPointer",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "shadi.m",
    "publication": [
        {
            "doi": "10.1186/s12864-016-2816-x",
            "metadata": {
                "abstract": "© 2016 The Author(s).Background: Alternative splicing (AS) is a major source of variability in the transcriptome of eukaryotes. There is an increasing interest in its role in different pathologies. Before sequencing technology appeared, AS was measured with specific arrays. However, these arrays did not perform well in the detection of AS events and provided very large false discovery rates (FDR). Recently the Human Transcriptome Array 2.0 (HTA 2.0) has been deployed. It includes junction probes. However, the interpretation software provided by its vendor (TAC 3.0) does not fully exploit its potential (does not study jointly the exons and junctions involved in a splicing event) and can only be applied to case-control studies. New statistical algorithms and software must be developed in order to exploit the HTA 2.0 array for event detection. Results: We have developed EventPointer, an R package (built under the aroma.affymetrix framework) to search and analyze Alternative Splicing events using HTA 2.0 arrays. This software uses a linear model that broadens its application from plain case-control studies to complex experimental designs. Given the CEL files and the design and contrast matrices, the software retrieves a list of all the detected events indicating: 1) the type of event (exon cassette, alternative 3', etc.), 2) its fold change and its statistical significance, and 3) the potential protein domains affected by the AS events and the statistical significance of the possible enrichment. Our tests have shown that EventPointer has an extremely low FDR value (only 1 false positive within the tested top-200 events). This software is publicly available and it has been uploaded to GitHub. Conclusions: This software empowers the HTA 2.0 arrays for AS event detection as an alternative to RNA-seq: simplifying considerably the required analysis, speeding it up and reducing the required computational power.",
                "authors": [
                    {
                        "name": "Romero J.P."
                    },
                    {
                        "name": "Muniategui A."
                    },
                    {
                        "name": "De Miguel F.J."
                    },
                    {
                        "name": "Aramburu A."
                    },
                    {
                        "name": "Montuenga L."
                    },
                    {
                        "name": "Pio R."
                    },
                    {
                        "name": "Rubio A."
                    }
                ],
                "citationCount": 18,
                "date": "2016-06-17T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "EventPointer: An effective identification of alternative splicing events using junction arrays"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "RNA splicing",
            "uri": "http://edamontology.org/topic_3320"
        },
        {
            "term": "RNA-seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        }
    ],
    "validated": 1,
    "version": [
        "1.4.0"
    ]
}