{
    "additionDate": "2021-01-18T09:04:25Z",
    "biotoolsCURIE": "biotools:causalmgm",
    "biotoolsID": "causalmgm",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "benos@pitt.edu",
            "name": "Panayiotis V Benos",
            "orcidid": "https://orcid.org/0000-0003-3172-3132",
            "typeEntity": "Person"
        },
        {
            "email": "panos@cs.pitt.edu",
            "name": "Panos K Chrysanthis",
            "orcidid": "https://orcid.org/0000-0001-7189-9816",
            "typeEntity": "Person"
        }
    ],
    "description": "CausalMGM is a data analysis tool to explore large, complex datasets. The method learns a graphical model of the data where the nodes are variables and edges display the dependencies among variables. The graphical model allows users to query their data to find the direct influences of a target variable of interest, or to find novel associations between pairs of variables.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Feature selection",
                    "uri": "http://edamontology.org/operation_3936"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                },
                {
                    "term": "Relation extraction",
                    "uri": "http://edamontology.org/operation_3625"
                }
            ]
        }
    ],
    "homepage": "http://causalmgm.org/",
    "lastUpdate": "2021-02-09T07:36:22Z",
    "name": "CausalMGM",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/NAR/GKAA350",
            "metadata": {
                "abstract": "© The Author(s) 2020. Published by Oxford University Press on behalf of Nucleic Acids Research.High-throughput sequencing and the availability of large online data repositories (e.g. The Cancer Genome Atlas and Trans-Omics for Precision Medicine) have the potential to revolutionize systems biology by enabling researchers to study interactions between data from different modalities (i.e. genetic, genomic, clinical, behavioral, etc.). Currently, data mining and statistical approaches are confined to identifying correlates in these datasets, but researchers are often interested in identifying cause- and-effect relationships. Causal discovery methods were developed to infer such cause-and-effect relationships from observational data. Though these algorithms have had demonstrated successes in several biomedical applications, they are difficult to use for non-experts. So, there is a need for web-based tools to make causal discovery methods accessible. Here, we present CausalMGM (http://causalmgm.org/), the first web-based causal discovery tool that enables researchers to find cause-and-effect relationships from observational data. Web-based CausalMGM consists of three data analysis tools: (i) feature selection and clustering; (ii) automated identification of cause-and-effect relationships via a graphical model; and (iii) interactive visualization of the learned causal (directed) graph. We demonstrate how CausalMGM enables an end-to-end exploratory analysis of biomedical datasets, giving researchers a clearer picture of its capabilities.",
                "authors": [
                    {
                        "name": "Benos P.V."
                    },
                    {
                        "name": "Chrysanthis P.K."
                    },
                    {
                        "name": "Ge X."
                    },
                    {
                        "name": "Raghu V.K."
                    }
                ],
                "citationCount": 1,
                "date": "2021-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "CausalMGM: An interactive web-based causal discovery tool"
            },
            "pmcid": "PMC7319538",
            "pmid": "32392295"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Data mining",
            "uri": "http://edamontology.org/topic_3473"
        },
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Personalised medicine",
            "uri": "http://edamontology.org/topic_3577"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ]
}
