{
    "additionDate": "2017-04-23T14:58:28Z",
    "biotoolsCURIE": "biotools:virsirnadb",
    "biotoolsID": "virsirnadb",
    "credit": [
        {
            "email": "manojk@imtech.res.in",
            "name": "Dr. Manoj Kumar",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "VIRsiRNAdb is a curated database of experimentally validated viral siRNA/shRNA targeting diverse genes of 42 important human viruses including influenza, SARS and Hepatitis viruses. Additionally useful siRNA analysis tools are also provided e.g. siTarAlign for aligning the siRNA sequence with reference viral genomes or user defined sequences.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://crdd.osdd.net/servers/virsirnadb/details.php"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "siRNA duplex prediction",
                    "uri": "http://edamontology.org/operation_2008"
                },
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                },
                {
                    "term": "Validation",
                    "uri": "http://edamontology.org/operation_2428"
                },
                {
                    "term": "siRNA binding specificity prediction",
                    "uri": "http://edamontology.org/operation_0465"
                }
            ]
        }
    ],
    "homepage": "http://crdd.osdd.net/servers/virsirnadb/",
    "language": [
        "PHP"
    ],
    "lastUpdate": "2018-12-10T12:58:56Z",
    "name": "VIRsiRNAdb",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "RNAi technology has been emerging as a potential modality to inhibit viruses during past decade. In literature a few siRNA databases have been reported that focus on targeting human and mammalian genes but experimentally validated viral siRNA databases are lacking. We have developed VIRsiRNAdb, a manually curated database having comprehensive details of 1358 siRNA/shRNA targeting viral genome regions. Further, wherever available, information regarding alternative efficacies of above 300 siRNAs derived from different assays has also been incorporated. Important fields included in the database are siRNA sequence, virus subtype, target genome region, cell type, target object, experimental assay, efficacy, off-target and siRNA matching with reference viral sequences. Database also provides the users with facilities of advance search, browsing, data submission, linking to external databases and useful siRNA analysis tools especially siTarAlign which align the siRNA with reference viral genomes or user defined sequences. VIRsiRNAdb contains extensive details of siRNA/shRNA targeting 42 important human viruses including influenza virus, hepatitis B virus, HPV and SARS Corona virus. VIRsiRNAdb would prove useful for researchers in picking up the best viral siRNA for antiviral therapeutics development and also for developing better viral siRNA design tools. The database is freely available at http://crdd.osdd.net/servers/virsirnadb. © The Author(s) 2011. Published by Oxford University Press.",
                "authors": [
                    {
                        "name": "Thakur N."
                    },
                    {
                        "name": "Qureshi A."
                    },
                    {
                        "name": "Kumar M."
                    }
                ],
                "citationCount": 35,
                "date": "2012-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "VIRsiRNAdb: A curated database of experimentally validated viral siRNA/shRNA"
            },
            "pmid": "22139916"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Virology",
            "uri": "http://edamontology.org/topic_0781"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Data submission, annotation and curation",
            "uri": "http://edamontology.org/topic_0219"
        }
    ],
    "validated": 1
}