{
    "additionDate": "2020-01-14T09:51:16Z",
    "biotoolsCURIE": "biotools:Pelodiscus_sinensis",
    "biotoolsID": "Pelodiscus_sinensis",
    "confidence_flag": "very low",
    "description": "Transcriptome analysis provides insight into the role of the melanin pathway in two differently pigmented strains of the turtle Pelodiscus sinensis.\n\nPelodiscus sinensis is the most common turtle species raised in East and Southeast Asia. The Japanese strain and the Qingxi black strain are important aquatic breeds of P. sinensis in China with unique characteristics in terms of production performance and appearance, including skin color. In this study, melanin content measure and histological analysis on skin samples of these two strains were carried out to compare their color characteristics. The results showed that Qingxi black turtles clearly have a greater ability to deposit melanin than the Japanese strain especially in the abdomen.\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'Qingxi', 'sinensis', 'log2FoldChange', 'DESeq' (bio.tools/deseq)",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                },
                {
                    "term": "De-novo assembly",
                    "uri": "http://edamontology.org/operation_0524"
                },
                {
                    "term": "Differential gene expression analysis",
                    "uri": "http://edamontology.org/operation_3223"
                }
            ]
        }
    ],
    "homepage": "ftp://ftp.ensembl.org/pub/release-81/fasta/pelodiscus_sinensis/dna/",
    "language": [
        "R"
    ],
    "lastUpdate": "2020-01-14T09:51:16Z",
    "name": "Pelodiscus sinensis",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1007/S00427-019-00639-3",
            "metadata": {
                "abstract": "© 2019, Springer-Verlag GmbH Germany, part of Springer Nature.Pelodiscus sinensis is the most common turtle species raised in East and Southeast Asia. The Japanese strain and the Qingxi black strain are important aquatic breeds of P. sinensis in China with unique characteristics in terms of production performance and appearance, including skin color. In this study, melanin content measure and histological analysis on skin samples of these two strains were carried out to compare their color characteristics. The results showed that Qingxi black turtles clearly have a greater ability to deposit melanin than the Japanese strain especially in the abdomen. Then, de novo transcriptome assembly and differential expression profiling analyses on the ventral skin from the two strains were performed to identify the genes responsible for the differences in skin color using the Illumina RNA-Seq system with three biological replicates. A total of 19,331 annotated unigenes were found by aligning to the reference genome of P. sinensis using TopHat v2.0.12. Differential expression analysis revealed that 670 genes were expressed differently, including 185 upregulated genes and 485 downregulated genes in Qingxi black strain using the DESeq R package (|log2FoldChange| ≥ 1, padj < 0.05). Sixteen differentially expressed genes (DEGs), which were randomly selected, were confirmed by quantitative real-time PCR (qRT-PCR). GO and KEGG analyses revealed four DEGs (agouti signaling protein, frizzled family receptor 1, phospholipase C, and protein kinase C) were related to melanogenesis pathway. Gene expression levels of the four DEGs as well as three genes from the tyrosinase gene family were measured by qRT-PCR. The results indicated that agouti signaling protein, tyrosinase-related protein, and dopachrome tautomerase could be the main genes responsible for the difference in abdominal skin color between the two turtle strains. This study provided valuable information for further analysis of the melanogenesis mechanisms in different varieties of P. sinensis.",
                "authors": [
                    {
                        "name": "Si Y."
                    },
                    {
                        "name": "Zhang L."
                    },
                    {
                        "name": "Zhang L."
                    },
                    {
                        "name": "Zhao F."
                    },
                    {
                        "name": "Wang Q."
                    },
                    {
                        "name": "Qian G."
                    },
                    {
                        "name": "Yin S."
                    }
                ],
                "citationCount": 1,
                "date": "2019-11-01T00:00:00Z",
                "journal": "Development Genes and Evolution",
                "title": "Transcriptome analysis provides insight into the role of the melanin pathway in two differently pigmented strains of the turtle Pelodiscus sinensis"
            },
            "pmid": "31712893"
        }
    ],
    "topic": [
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Probes and primers",
            "uri": "http://edamontology.org/topic_0632"
        }
    ]
}