{
    "additionDate": "2017-08-03T18:48:13Z",
    "biotoolsCURIE": "biotools:lracluster",
    "biotoolsID": "lracluster",
    "credit": [
        {
            "email": "wdm2008@gmail.com",
            "name": "Dingming Wu",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://bioinfo.au.tsinghua.edu.cn/member/jgu/"
        },
        {
            "email": "wellgoo@gmail.com",
            "name": "Jin Gu",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://bioinfo.au.tsinghua.edu.cn/member/jgu/"
        }
    ],
    "description": "New method to discover molecular subtypes by detecting the low-dimensional intrinsic space of high-dimensional cancer multi-omics data.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://bioinfo.au.tsinghua.edu.cn/member/jgu/lracluster/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Classification",
                    "uri": "http://edamontology.org/operation_2990"
                }
            ]
        }
    ],
    "homepage": "http://bioinfo.au.tsinghua.edu.cn/member/jgu/lracluster/",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-10T12:58:49Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/lracluster-low-rank-approximation-based-multi-omics-data-clustering.html"
        }
    ],
    "name": "LRAcluster",
    "operatingSystem": [
        "Linux",
        "Windows"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "© 2015 Wu et al. Open Access.Background: One major goal of large-scale cancer omics study is to identify molecular subtypes for more accurate cancer diagnoses and treatments. To deal with high-dimensional cancer multi-omics data, a promising strategy is to find an effective low-dimensional subspace of the original data and then cluster cancer samples in the reduced subspace. However, due to data-type diversity and big data volume, few methods can integrative and efficiently find the principal low-dimensional manifold of the high-dimensional cancer multi-omics data. Results: In this study, we proposed a novel low-rank approximation based integrative probabilistic model to fast find the shared principal subspace across multiple data types: the convexity of the low-rank regularized likelihood function of the probabilistic model ensures efficient and stable model fitting. Candidate molecular subtypes can be identified by unsupervised clustering hundreds of cancer samples in the reduced low-dimensional subspace. On testing datasets, our method LRAcluster (low-rank approximation based multi-omics data clustering) runs much faster with better clustering performances than the existing method. Then, we applied LRAcluster on large-scale cancer multi-omics data from TCGA. The pan-cancer analysis results show that the cancers of different tissue origins are generally grouped as independent clusters, except squamous-like carcinomas. While the single cancer type analysis suggests that the omics data have different subtyping abilities for different cancer types. Conclusions: LRAcluster is a very useful method for fast dimension reduction and unsupervised clustering of largescale multi-omics data. LRAcluster is implemented in R and freely available via http://bioinfo.au.tsinghua.edu.cn/ software/lracluster/.",
                "authors": [
                    {
                        "name": "Wu D."
                    },
                    {
                        "name": "Wang D."
                    },
                    {
                        "name": "Zhang M.Q."
                    },
                    {
                        "name": "Gu J."
                    }
                ],
                "citationCount": 46,
                "date": "2015-12-01T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "Fast dimension reduction and integrative clustering of multi-omics data using lowrank approximation: Application to cancer molecular classification"
            },
            "pmid": "26626453"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Omics",
            "uri": "http://edamontology.org/topic_3391"
        },
        {
            "term": "Molecular biology",
            "uri": "http://edamontology.org/topic_3047"
        }
    ],
    "validated": 1
}