
{
    "credit": [
        {
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://liulab.dfci.harvard.edu/"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Mapping",
                    "uri": "http://edamontology.org/operation_2429"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Query",
                    "uri": "http://edamontology.org/operation_0224"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Mapping",
                "uri": "http://edamontology.org/topic_0102"
            },
            {
                "term": "DNA",
                "uri": "http://edamontology.org/topic_0654"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://www.mybiosoftware.com/xman-20060717-map-oligonucleotides-subject-genome.html"
        }
    ],
    "publication": [
        {
            "abstract": "Background: The ability to rapidly map millions of oligonucleotide fragments to a reference genome is crucial to many high throughput genomic technologies. Results: We propose an intuitive and efficient algorithm, titled extreme MApping of OligoNucleotide (xMAN), to rapidly map millions of oligonucleotide fragments to a genome of any length. By converting oligonucleotides to integers hashed in RAM, xMAN can scan through genomes using bit shifting operation and achieve at least one order of magnitude speed increase over existing tools. xMAN can map the 42 million 25-mer probes on the Affymetrix whole human genome tiling arrays to the entire genome in less than 6 CPU hours. Conclusions: In addition to the speed advantage, we found the probe mapping of xMAN to substantially improve the final analysis results in both a spike-in experiment on ENCODE tiling arrays and an estrogen receptor ChIP-chip experiment on whole human genome tiling arrays. Those improvements were confirmed by direct ChIP and real-time PCR assay. xMAN can be further extended for application to other high-throughput genomic technologies for oligonucleotide mapping. © 2008 Li et al.; licensee BioMed Central Ltd.",
            "authors": [
                "Li W.",
                "Carroll J.S.",
                "Brown M.",
                "Shirley X.S."
            ],
            "cit_count": 16,
            "doi": "10.1186/1471-2164-9-S1-S20",
            "journal": "BMC Genomics",
            "title": "xMAN: Extreme MApping of OligoNucleotides",
            "type": "Primary",
            "year": "2008-03-20"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:xman",
        "biotoolsID": "xman",
        "description": "Simple and efficient method for the mapping of millions of query oligonucleotide fragments to the subject genome of any given length.",
        "homepage": "http://liulab.dfci.harvard.edu/WEBSITE/software.htm",
        "name": "xMAN",
        "version": [
            "20060925"
        ]
    }
}