{
    "additionDate": "2020-01-14T08:59:17Z",
    "biotoolsCURIE": "biotools:FCNN",
    "biotoolsID": "FCNN",
    "confidence_flag": "high",
    "credit": [
        {
            "email": "yuantian@jlu.edu.cn",
            "name": "Yuan Tian",
            "typeEntity": "Person"
        }
    ],
    "description": "Measurement of Conditional Relatedness Between Genes Using Fully Convolutional Neural Network.\n\nFully Convolutional Neural Network model.\n\nA demonstration of what can be accomplished visually through CSS-based design.\n\nIf you want to visit this website, the google browser will be recommended !.\n\nThe fully convolutional neural network (FCNN) model is a deep learning model based on traditional convolution neural network (CNN) model with a fully connected first layer and combines expression similarities and prior-knowledge similarities as the input",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Pathway or network prediction",
                    "uri": "http://edamontology.org/operation_3439"
                },
                {
                    "term": "Expression correlation analysis",
                    "uri": "http://edamontology.org/operation_3463"
                },
                {
                    "term": "Metabolic network modelling",
                    "uri": "http://edamontology.org/operation_3660"
                }
            ]
        }
    ],
    "homepage": "https://bmbl.bmi.osumc.edu/FCNN",
    "lastUpdate": "2020-01-14T08:59:17Z",
    "name": "FCNN",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.3389/FGENE.2019.01009",
            "metadata": {
                "abstract": "© Copyright © 2019 Wang, Zhang, Yang, Yang, Tian and Ma.Measuring conditional relatedness, the degree of relation between a pair of genes in a certain condition, is a basic but difficult task in bioinformatics, as traditional co-expression analysis methods rely on co-expression similarities, well known with high false positive rate. Complement with prior-knowledge similarities is a feasible way to tackle the problem. However, classical combination machine learning algorithms fail in detection and application of the complex mapping relations between similarities and conditional relatedness, so a powerful predictive model will have enormous benefit for measuring this kind of complex mapping relations. To this need, we propose a novel deep learning model of convolutional neural network with a fully connected first layer, named fully convolutional neural network (FCNN), to measure conditional relatedness between genes using both co-expression and prior-knowledge similarities. The results on validation and test datasets show FCNN model yields an average 3.0% and 2.7% higher accuracy values for identifying gene–gene interactions collected from the COXPRESdb, KEGG, and TRRUST databases, and a benchmark dataset of Xiao-Yong et al. research, by grid-search 10-fold cross validation, respectively. In order to estimate the FCNN model, we conduct a further verification on the GeneFriends and DIP datasets, and the FCNN model obtains an average of 1.8% and 7.6% higher accuracy, respectively. Then the FCNN model is applied to construct cancer gene networks, and also calls more practical results than other compared models and methods. A website of the FCNN model and relevant datasets can be accessed from https://bmbl.bmi.osumc.edu/FCNN.",
                "authors": [
                    {
                        "name": "Wang Y."
                    },
                    {
                        "name": "Zhang S."
                    },
                    {
                        "name": "Yang L."
                    },
                    {
                        "name": "Yang S."
                    },
                    {
                        "name": "Tian Y."
                    },
                    {
                        "name": "Ma Q."
                    }
                ],
                "citationCount": 2,
                "date": "2019-10-22T00:00:00Z",
                "journal": "Frontiers in Genetics",
                "title": "Measurement of Conditional Relatedness Between Genes Using Fully Convolutional Neural Network"
            },
            "pmcid": "PMC6818468",
            "pmid": "31695723"
        }
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Medical informatics",
            "uri": "http://edamontology.org/topic_3063"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        }
    ]
}