{
    "accessibility": "Open access",
    "additionDate": "2021-12-13T15:27:01.580217Z",
    "biotoolsCURIE": "biotools:transformers-sklearn",
    "biotoolsID": "transformers-sklearn",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "li.jiao@imicams.ac.cn",
            "name": "Jiao Li",
            "orcidid": "https://orcid.org/0000-0001-6391-8343",
            "typeEntity": "Person"
        },
        {
            "name": "Feihong Yang"
        },
        {
            "name": "Hetong Ma"
        },
        {
            "name": "Xuwen Wang"
        }
    ],
    "description": "A Fitting, Scoring and Predicting Toolkit for Transformer Series Models.",
    "download": [
        {
            "type": "Source code",
            "url": "https://github.com/trueto/transformers_sklearn/releases/tag/V1.1"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Named-entity and concept recognition",
                    "uri": "http://edamontology.org/operation_3280"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "https://github.com/trueto/transformers_sklearn",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-12-13T15:27:01.582679Z",
    "license": "Apache-2.0",
    "name": "transformers-sklearn",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1186/S12911-021-01459-0",
            "metadata": {
                "abstract": "© 2021, The Author(s).Background: Transformer is an attention-based architecture proven the state-of-the-art model in natural language processing (NLP). To reduce the difficulty of beginning to use transformer-based models in medical language understanding and expand the capability of the scikit-learn toolkit in deep learning, we proposed an easy to learn Python toolkit named transformers-sklearn. By wrapping the interfaces of transformers in only three functions (i.e., fit, score, and predict), transformers-sklearn combines the advantages of the transformers and scikit-learn toolkits. Methods: In transformers-sklearn, three Python classes were implemented, namely, BERTologyClassifier for the classification task, BERTologyNERClassifier for the named entity recognition (NER) task, and BERTologyRegressor for the regression task. Each class contains three methods, i.e., fit for fine-tuning transformer-based models with the training dataset, score for evaluating the performance of the fine-tuned model, and predict for predicting the labels of the test dataset. transformers-sklearn is a user-friendly toolkit that (1) Is customizable via a few parameters (e.g., model_name_or_path and model_type), (2) Supports multilingual NLP tasks, and (3) Requires less coding. The input data format is automatically generated by transformers-sklearn with the annotated corpus. Newcomers only need to prepare the dataset. The model framework and training methods are predefined in transformers-sklearn. Results: We collected four open-source medical language datasets, including TrialClassification for Chinese medical trial text multi label classification, BC5CDR for English biomedical text name entity recognition, DiabetesNER for Chinese diabetes entity recognition and BIOSSES for English biomedical sentence similarity estimation. In the four medical NLP tasks, the average code size of our script is 45 lines/task, which is one-sixth the size of transformers’ script. The experimental results show that transformers-sklearn based on pretrained BERT models achieved macro F1 scores of 0.8225, 0.8703 and 0.6908, respectively, on the TrialClassification, BC5CDR and DiabetesNER tasks and a Pearson correlation of 0.8260 on the BIOSSES task, which is consistent with the results of transformers. Conclusions: The proposed toolkit could help newcomers address medical language understanding tasks using the scikit-learn coding style easily. The code and tutorials of transformers-sklearn are available at https://doi.org/10.5281/zenodo.4453803. In future, more medical language understanding tasks will be supported to improve the applications of transformers_sklearn.",
                "authors": [
                    {
                        "name": "Li J."
                    },
                    {
                        "name": "Ma H."
                    },
                    {
                        "name": "Wang X."
                    },
                    {
                        "name": "Yang F."
                    }
                ],
                "date": "2021-07-01T00:00:00Z",
                "journal": "BMC Medical Informatics and Decision Making",
                "title": "Transformers-sklearn: a toolkit for medical language understanding with transformer-based models"
            },
            "pmcid": "PMC8323195",
            "pmid": "34330244"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Natural language processing",
            "uri": "http://edamontology.org/topic_0218"
        }
    ]
}
