{
    "additionDate": "2021-01-18T11:58:31Z",
    "biotoolsCURIE": "biotools:ecif",
    "biotoolsID": "ecif",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "norberto.sc90@gmail.com",
            "name": "Norberto Sánchez-Cruz",
            "typeEntity": "Person"
        }
    ],
    "description": "Extended Connectivity Interaction Features (ECIF) to describe protein–ligand complexes and build machine-learning scoring functions with improved predictions of binding affinity. ECIF are a set of protein−ligand atom-type pair counts that take into account each atom’s connectivity to describe it and thus define the pair types. ECIF were used to build different machine-learning models to predict protein–ligand affinities (pKd/pKi).",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Virtual screening",
                    "uri": "http://edamontology.org/operation_3938"
                },
                {
                    "term": "Protein-protein docking",
                    "uri": "http://edamontology.org/operation_3899"
                },
                {
                    "term": "Protein structure validation",
                    "uri": "http://edamontology.org/operation_0321"
                }
            ]
        }
    ],
    "homepage": "https://github.com/DIFACQUIM/ECIF",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-03-08T10:45:58Z",
    "name": "ECIF",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAA982",
            "metadata": {
                "abstract": "© The Author(s) 2020. Published by Oxford University Press. All rights reserved. For permissions, please e-mail: journals.permissions@oup.com.MOTIVATION: Machine-learning scoring functions (SFs) have been found to outperform standard SFs for binding affinity prediction of protein-ligand complexes. A plethora of reports focus on the implementation of increasingly complex algorithms, while the chemical description of the system has not been fully exploited. RESULTS: Herein, we introduce Extended Connectivity Interaction Features (ECIF) to describe protein-ligand complexes and build machine-learning SFs with improved predictions of binding affinity. ECIF are a set of protein-ligand atom-type pair counts that take into account each atom's connectivity to describe it and thus define the pair types. ECIF were used to build different machine-learning models to predict protein-ligand affinities (pKd/pKi). The models were evaluated in terms of 'scoring power' on the Comparative Assessment of Scoring Functions 2016. The best models built on ECIF achieved Pearson correlation coefficients of 0.857 when used on its own, and 0.866 when used in combination with ligand descriptors, demonstrating ECIF descriptive power. AVAILABILITY AND IMPLEMENTATION: Data and code to reproduce all the results are freely available at https://github.com/DIFACQUIM/ECIF. SUPPLEMENTARY INFORMATION: Supplementary data are available at Bioinformatics online.",
                "authors": [
                    {
                        "name": "Sanchez-Cruz N."
                    },
                    {
                        "name": "Medina-Franco J.L."
                    },
                    {
                        "name": "Mestres J."
                    },
                    {
                        "name": "Barril X."
                    }
                ],
                "citationCount": 3,
                "date": "2021-06-16T00:00:00Z",
                "journal": "Bioinformatics (Oxford, England)",
                "title": "Extended connectivity interaction features: improving binding affinity prediction through chemical description"
            },
            "pmid": "33226061"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "Molecular modelling",
            "uri": "http://edamontology.org/topic_2275"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        }
    ]
}