{
    "accessibility": "Open access",
    "additionDate": "2019-05-27T14:49:51Z",
    "biotoolsCURIE": "biotools:TOPAS-nBio",
    "biotoolsID": "TOPAS-nBio",
    "cost": "Free of charge (with restrictions)",
    "credit": [
        {
            "email": "jverburg@mgh.harvard.edu",
            "name": "Joost Verburg",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "tbortfeld@mgh.harvard.edu",
            "name": "Thomas Bortfeld",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Extension to the TOPAS Simulation Toolkit for Cellular and Sub-cellular Radiobiology.",
    "editPermission": {
        "type": "private"
    },
    "homepage": "https://gray.mgh.harvard.edu/software/258-topas-nbio",
    "language": [
        "C++"
    ],
    "lastUpdate": "2020-06-16T10:55:24Z",
    "maturity": "Mature",
    "name": "TOPAS-nBio",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "Ruta",
    "publication": [
        {
            "doi": "10.1667/RR15226.1",
            "metadata": {
                "abstract": "© 2019 by Radiation Research Society.The TOPAS Monte Carlo (MC) system is used in radiation therapy and medical imaging research, having played a significant role in making Monte Carlo simulations widely available for proton therapy related research. While TOPAS provides detailed simulations of patient scale properties, the fundamental unit of the biological response to radiation is a cell. Thus, our goal was to develop TOPAS-nBio, an extension of TOPAS dedicated to advance understanding of radiobiological effects at the (sub-)cellular, (i.e., the cellular and sub-cellular) scale. TOPAS-nBio was designed as a set of open source classes that extends TOPAS to model radiobiological experiments. TOPAS-nBio is based on and extends Geant4-DNA, which extends the Geant4 toolkit, the basis of TOPAS, to include very low-energy interactions of particles down to vibrational energies, explicitly simulates every particle interaction (i.e., without using condensed histories) and propagates radiolysis products. To further facilitate the use of TOPAS-nBio, a graphical user interface was developed. TOPAS-nBio offers full track-structure Monte Carlo simulations, integration of chemical reactions within the first millisecond, an extensive catalogue of specialized cell geometries as well as sub-cellular structures such as DNA and mitochondria, and interfaces to mechanistic models of DNA repair kinetics. We compared TOPAS-nBio simulations to measured and published data of energy deposition patterns and chemical reaction rates (G values). Our simulations agreed well within the experimental uncertainties. Additionally, we expanded the chemical reactions and species provided in Geant4-DNA and developed a new method based on independent reaction times (IRT), including a total of 72 reactions classified into 6 types between neutral and charged species. Chemical stage simulations using IRT were a factor of 145 faster than with step-by-step tracking. Finally, we applied the geometric/chemical modeling to obtain initial yields of double-strand breaks (DSBs) in DNA fibers for proton irradiations of 3 and 50 MeV and compared the effect of including chemical reactions on the number and complexity of DSB induction. Over half of the DSBs were found to include chemical reactions with approximately 5% of DSBs caused only by chemical reactions. In conclusion, the TOPAS-nBio extension to the TOPAS MC application offers access to accurate and detailed multiscale simulations, from a macroscopic description of the radiation field to microscopic description of biological outcome for selected cells. TOPAS-nBio offers detailed physics and chemistry simulations of radiobiological experiments on cells simulating the initially induced damage and links to models of DNA repair kinetics.",
                "authors": [
                    {
                        "name": "Schuemann J."
                    },
                    {
                        "name": "McNamara A.L."
                    },
                    {
                        "name": "Ramos-Mendez J."
                    },
                    {
                        "name": "Perl J."
                    },
                    {
                        "name": "Held K.D."
                    },
                    {
                        "name": "Paganetti H."
                    },
                    {
                        "name": "Incerti S."
                    },
                    {
                        "name": "Faddegon B."
                    }
                ],
                "citationCount": 28,
                "date": "2019-02-01T00:00:00Z",
                "journal": "Radiation Research",
                "title": "TOPAS-nBio: An Extension to the TOPAS Simulation Toolkit for Cellular and Sub-cellular Radiobiology"
            },
            "pmcid": "PMC6377808",
            "pmid": "30609382",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Chemistry",
            "uri": "http://edamontology.org/topic_3314"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Physics",
            "uri": "http://edamontology.org/topic_3318"
        }
    ],
    "validated": 1
}