{
    "name": "Haploclusters", 
    "description": "Program designed to detect excess haplotypes sharing in datasets consisting of case and control haplotypes. Excess haplotype sharing can be seen around disease loci in case samples since LD persists longer here than in the controls where LD is persisting only according to the relatedness of the individuals in the population, i.e. the age of the population. This LD is often referred to as background LD.", 
    "homepage": "http://bioinf.wehi.edu.au/folders/melanie/haploclusters.html", 
    "biotoolsID": "haploclusters", 
    "biotoolsCURIE": "biotools:haploclusters", 
    "version": [], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_0487", 
                    "term": "Haplotype mapping"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Command-line tool"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_0634", 
            "term": "Pathology"
        }, 
        {
            "uri": "http://edamontology.org/topic_3056", 
            "term": "Population genetics"
        }, 
        {
            "uri": "http://edamontology.org/topic_0625", 
            "term": "Genotype and phenotype"
        }
    ], 
    "operatingSystem": [
        "Linux"
    ], 
    "language": [], 
    "license": null, 
    "collectionID": [], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [
        {
            "url": "http://www.mybiosoftware.com/haploclusters-detect-excess-haplotypes-sharing.html", 
            "type": "Registry", 
            "note": null
        }
    ], 
    "download": [], 
    "documentation": [
        {
            "url": "http://bioinf.wehi.edu.au/folders/melanie/haploclusters.html", 
            "type": "General", 
            "note": "Download includes documentation"
        }
    ], 
    "publication": [
        {
            "doi": null, 
            "pmid": "16362347", 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "Detecting genome wide haplotype sharing using SNP or microsatellite haplotype data", 
                "abstract": "Genome wide association studies using high throughput technology are already being conducted despite the significant hurdles that need to be overcome (Nat Rev Genet 6:95-108, 2005; Nat Rev Genet 6:109-118, 2005). Methods for detecting haplotype association signals in genome wide haplotype datasets are as yet very limited. Much methodological research has already been devoted to linkage disequilibrium (LD) fine mapping where the focus is the identification of the disease locus rather than the detection of a disease signal. Applications of these approaches to genome wide scanning are limited by the strong model assumptions of the sharing process, which lead to computational complexity. We describe a new algorithm for the initial identification of disease susceptibility loci in genome wide haplotype association studies. Excess sharing of ancestral haplotypes, which indicates the presence of a disease locus, is detected with a simple, easy to interpret, χ2 based statistic. The method allows genome wide scanning for qualitative traits within reasonable computational timeframes and can serve as a first pass analysis prior to the usage of likelihood based methods, providing candidate regions and inferred susceptibility haplotypes. Our method makes no assumptions regarding the population history or the pattern of background LD. Statistical significance is evaluated with permutation tests. The method is illustrated on simulated and real data where it is applied to simple (cystic fibrosis) and complex disease (multiple sclerosis) examples. The statistic has low type I error and greater power to map disease loci over conventional single marker tests for low to moderate levels of LD. © Springer-Verlag 2005.", 
                "date": "2006-03-01T00:00:00Z", 
                "citationCount": 11, 
                "authors": [
                    {
                        "name": "Bahlo M."
                    }, 
                    {
                        "name": "Stankovich J."
                    }, 
                    {
                        "name": "Speed T.P."
                    }, 
                    {
                        "name": "Rubio J.P."
                    }, 
                    {
                        "name": "Burfoot R.K."
                    }, 
                    {
                        "name": "Foote S.J."
                    }
                ], 
                "journal": "Human Genetics"
            }
        }
    ], 
    "credit": [
        {
            "name": "Melanie Bahlo", 
            "email": "bahlo@wehi.edu.au", 
            "url": "http://bioinf.wehi.edu.au/", 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "mbs_import", 
    "additionDate": "2017-08-03T18:46:22Z", 
    "lastUpdate": "2018-12-10T12:58:43Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 1, 
    "homepage_status": 0, 
    "elixir_badge": 0
}