{
    "additionDate": "2021-11-29T12:26:54.628710Z",
    "biotoolsCURIE": "biotools:sch-net",
    "biotoolsID": "sch-net",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "ling.he@scu.edu.cn",
            "name": "Ling He",
            "orcidid": "https://orcid.org/0000-0002-7168-2737",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Sch-net is a deep learning architecture for automatic schizophrenia setection.",
    "editPermission": {
        "type": "private"
    },
    "homepage": "https://github.com/Scu-sen/Sch-net",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-11-29T12:26:54.631411Z",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/Scu-sen/Sch-net/issues"
        }
    ],
    "name": "Sch-net",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1186/s12938-021-00915-2",
            "metadata": {
                "abstract": "© 2021, The Author(s).Background: Schizophrenia is a chronic and severe mental disease, which largely influences the daily life and work of patients. Clinically, schizophrenia with negative symptoms is usually misdiagnosed. The diagnosis is also dependent on the experience of clinicians. It is urgent to develop an objective and effective method to diagnose schizophrenia with negative symptoms. Recent studies had shown that impaired speech could be considered as an indicator to diagnose schizophrenia. The literature about schizophrenic speech detection was mainly based on feature engineering, in which effective feature extraction is difficult because of the variability of speech signals. Methods: This work designs a novel Sch-net neural network based on a convolutional neural network, which is the first work for end-to-end schizophrenic speech detection using deep learning techniques. The Sch-net adds two components, skip connections and convolutional block attention module (CBAM), to the convolutional backbone architecture. The skip connections enrich the information used for the classification by emerging low- and high-level features. The CBAM highlights the effective features by giving learnable weights. The proposed Sch-net combines the advantages of the two components, which can avoid the procedure of manual feature extraction and selection. Results: We validate our Sch-net through ablation experiments on a schizophrenic speech data set that contains 28 patients with schizophrenia and 28 healthy controls. The comparisons with the models based on feature engineering and deep neural networks are also conducted. The experimental results show that the Sch-net has a great performance on the schizophrenic speech detection task, which can achieve 97.68% accuracy on the schizophrenic speech data set. To further verify the generalization of our model, the Sch-net is tested on open access LANNA children speech database for specific language impairment detection. The results show that our model achieves 99.52% accuracy in classifying patients with SLI and healthy controls. Our code will be available at https://github.com/Scu-sen/Sch-net. Conclusions: Extensive experiments show that the proposed Sch-net can provide aided information for the diagnosis of schizophrenia and specific language impairment.",
                "authors": [
                    {
                        "name": "Fu J."
                    },
                    {
                        "name": "Yang S."
                    },
                    {
                        "name": "He F."
                    },
                    {
                        "name": "He L."
                    },
                    {
                        "name": "Li Y."
                    },
                    {
                        "name": "Zhang J."
                    },
                    {
                        "name": "Xiong X."
                    }
                ],
                "date": "2021-12-01T00:00:00Z",
                "journal": "BioMedical Engineering Online",
                "title": "Sch-net: a deep learning architecture for automatic detection of schizophrenia"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Ear, nose and throat medicine",
            "uri": "http://edamontology.org/topic_3406"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Public health and epidemiology",
            "uri": "http://edamontology.org/topic_3305"
        },
        {
            "term": "Pharmacology",
            "uri": "http://edamontology.org/topic_0202"
        }
    ]
}