{
    "accessibility": "Open access",
    "additionDate": "2022-10-30T10:39:34.040381Z",
    "biotoolsCURIE": "biotools:cohesindb",
    "biotoolsID": "cohesindb",
    "confidence_flag": "tool",
    "credit": [
        {
            "name": "Jiankang Wang"
        },
        {
            "name": "Ryuichiro Nakato"
        }
    ],
    "description": "A comprehensive database for decoding cohesin-related epigenomes, 3D genomes and transcriptomes in human cells.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://cohesindb.iqb.u-tokyo.ac.jp",
    "language": [
        "JavaScript",
        "Python"
    ],
    "lastUpdate": "2024-11-24T15:25:06.688296Z",
    "license": "GPL-3.0",
    "name": "CohesinDB",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1093/nar/gkac795",
            "metadata": {
                "abstract": "Cohesin is a multifunctional protein responsible for transcriptional regulation and chromatin organization. Cohesin binds to chromatin at tens of thousands of distinct sites in a conserved or tissue-specific manner, whereas the function of cohesin varies greatly depending on the epigenetic properties of specific chromatin loci. Cohesin also extensively mediates cis-regulatory modules (CRMs) and chromatin loops. Even though next-generation sequencing technologies have provided a wealth of information on different aspects of cohesin, the integration and exploration of the resultant massive cohesin datasets are not straightforward. Here, we present CohesinDB (https://cohesindb.iqb.u-tokyo.ac.jp), a comprehensive multiomics cohesin database in human cells. CohesinDB includes 2043 epigenomics, transcriptomics and 3D genomics datasets from 530 studies involving 176 cell types. By integrating these large-scale data, CohesinDB summarizes three types of ‘cohesin objects’: 751 590 cohesin binding sites, 957 868 cohesin-related chromatin loops and 2 229 500 cohesin-related CRMs. Each cohesin object is annotated with locus, cell type, classification, function, 3D genomics and cis-regulatory information. CohesinDB features a user-friendly interface for browsing, searching, analyzing, visualizing and downloading the desired information. CohesinDB contributes a valuable resource for all researchers studying cohesin, epigenomics, transcriptional regulation and chromatin organization.",
                "authors": [
                    {
                        "name": "Nakato R."
                    },
                    {
                        "name": "Wang J."
                    }
                ],
                "citationCount": 3,
                "date": "2023-01-06T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "CohesinDB: a comprehensive database for decoding cohesin-related epigenomes, 3D genomes and transcriptomes in human cells"
            },
            "pmcid": "PMC9825609",
            "pmid": "36162821"
        }
    ],
    "toolType": [
        "Database portal",
        "Web application"
    ],
    "topic": [
        {
            "term": "Epigenomics",
            "uri": "http://edamontology.org/topic_3173"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ],
    "validated": 1
}
