{
    "additionDate": "2021-11-29T07:11:53.421547Z",
    "biotoolsCURIE": "biotools:proms",
    "biotoolsID": "proms",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "bing.zhang@bcm.edu",
            "name": "Bing Zhang",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "ProMS (Protein Marker Selection) is a python package designed to tackle a novel problem of multiview feature selection: given multiple views of same set of samples, select important features from one view of interest (target view) by integrating information from other views. It was initially developed to select protein biomarkers using proteomics data with the help of additional omics views (e.g. RNAseq).",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Feature selection",
                    "uri": "http://edamontology.org/operation_3936"
                },
                {
                    "term": "Principal component analysis",
                    "uri": "http://edamontology.org/operation_3960"
                }
            ]
        }
    ],
    "homepage": "https://github.com/bzhanglab/proms",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-11-29T07:11:53.424120Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/bzhanglab/proms/issues"
        },
        {
            "type": [
                "Repository"
            ],
            "url": "https://pypi.org/project/proms"
        }
    ],
    "name": "ProMS",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1016/J.MCPRO.2021.100083",
            "metadata": {
                "abstract": "© 2021 The Authors.Untargeted mass spectrometry (MS)-based proteomics provides a powerful platform for protein biomarker discovery, but clinical translation depends on the selection of a small number of proteins for downstream verification and validation. Due to the small sample size of typical discovery studies, protein markers identified from discovery data may not be generalizable to independent datasets. In addition, a good protein marker identified using a discovery platform may be difficult to implement in verification and validation platforms. Moreover, although multiomics characterization is being increasingly used in discovery cohort studies, there is no existing method for multiomics-facilitated protein biomarker selection. Here, we present ProMS, a computational algorithm for protein marker selection. The algorithm is based on the hypothesis that a phenotype is characterized by a few underlying biological functions, each manifested by a group of coexpressed proteins. A weighted k-medoids clustering algorithm is applied to all univariately informative proteins to identify both coexpressed protein clusters and a representative protein for each cluster as markers. In two clinically important classification problems, ProMS shows superior performance compared with existing feature selection methods. ProMS can be extended to the multiomics setting (ProMS-mo) through a constrained weighted k-medoids clustering algorithm, and the protein panels selected by ProMS-mo show improved performance on independent test data compared with ProMS. In addition to superior performance, ProMS and ProMS-mo also have two unique strengths. First, the feature clusters enable functional interpretation of the selected protein markers. Second, the feature clusters provide an opportunity to select replacement protein markers, facilitating a robust transition to the verification and validation platforms. In summary, this study provides a unified and effective computational framework for selecting protein biomarkers using proteomics or multiomics data.",
                "authors": [
                    {
                        "name": "Shi Z."
                    },
                    {
                        "name": "Wen B."
                    },
                    {
                        "name": "Gao Q."
                    },
                    {
                        "name": "Zhang B."
                    }
                ],
                "citationCount": 1,
                "date": "2021-05-01T00:00:00Z",
                "journal": "Molecular and Cellular Proteomics",
                "title": "Feature selection methods for protein biomarker discovery from proteomics or multiomics data"
            },
            "pmcid": "PMC8165452",
            "pmid": "33887487",
            "type": [
                "Primary"
            ]
        }
    ],
    "topic": [
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ]
}