{
    "name": "LEMONS", 
    "description": "Library for the Enumeration of MOdular Natural Structures.", 
    "homepage": "https://github.com/magarveylab/lemons", 
    "biotoolsID": "LEMONS", 
    "biotoolsCURIE": "biotools:LEMONS", 
    "version": [], 
    "otherID": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_2480", 
                    "term": "Structure analysis"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Library"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_2258", 
            "term": "Cheminformatics"
        }, 
        {
            "uri": "http://edamontology.org/topic_0081", 
            "term": "Structure analysis"
        }, 
        {
            "uri": "http://edamontology.org/topic_3373", 
            "term": "Drug development"
        }
    ], 
    "operatingSystem": [
        "Linux", 
        "Mac"
    ], 
    "language": [
        "Java"
    ], 
    "license": null, 
    "collectionID": [], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [], 
    "download": [], 
    "documentation": [
        {
            "url": "https://github.com/magarveylab/lemons", 
            "type": "General", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": "10.1186/s13321-017-0234-y", 
            "pmid": null, 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "Comparative analysis of chemical similarity methods for modular natural products with a hypothetical structure enumeration algorithm", 
                "abstract": "© 2017 The Author(s). Natural products represent a prominent source of pharmaceutically and industrially important agents. Calculating the chemical similarity of two molecules is a central task in cheminformatics, with applications at multiple stages of the drug discovery pipeline. Quantifying the similarity of natural products is a particularly important problem, as the biological activities of these molecules have been extensively optimized by natural selection. The large and structurally complex scaffolds of natural products distinguish their physical and chemical properties from those of synthetic compounds. However, no analysis of the performance of existing methods for molecular similarity calculation specific to natural products has been reported to date. Here, we present LEMONS, an algorithm for the enumeration of hypothetical modular natural product structures. We leverage this algorithm to conduct a comparative analysis of molecular similarity methods within the unique chemical space occupied by modular natural products using controlled synthetic data, and comprehensively investigate the impact of diverse biosynthetic parameters on similarity search. We additionally investigate a recently described algorithm for natural product retrobiosynthesis and alignment, and find that when rule-based retrobiosynthesis can be applied, this approach outperforms conventional two-dimensional fingerprints, suggesting it may represent a valuable approach for the targeted exploration of natural product chemical space and microbial genome mining. Our open-source algorithm is an extensible method of enumerating hypothetical natural product structures with diverse potential applications in bioinformatics.", 
                "date": "2017-08-16T00:00:00Z", 
                "citationCount": 2, 
                "authors": [
                    {
                        "name": "Skinnider M.A."
                    }, 
                    {
                        "name": "Dejong C.A."
                    }, 
                    {
                        "name": "Franczak B.C."
                    }, 
                    {
                        "name": "McNicholas P.D."
                    }, 
                    {
                        "name": "Magarvey N.A."
                    }
                ], 
                "journal": "Journal of Cheminformatics"
            }
        }
    ], 
    "credit": [
        {
            "name": "Nathan A. Magarvey", 
            "email": "magarv@mcmaster.ca", 
            "url": null, 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "d.gabrielaitis", 
    "additionDate": "2018-08-29T12:23:25Z", 
    "lastUpdate": "2018-12-10T12:59:01Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 0, 
    "homepage_status": 0
}