
{
    "credit": [
        {
            "email": "michelle.zhang@utsa.edu",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://compgenomics.utsa.edu/zgroup/PeakLink/"
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://compgenomics.utsa.edu/zgroup/PeakLink/"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Peak detection",
                    "uri": "http://edamontology.org/operation_3215"
                }
            ]
        }
    ],
    "labels": {
        "collectionID": [
            "Proteomics"
        ],
        "language": [
            "C"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Proteomics experiment",
                "uri": "http://edamontology.org/topic_3520"
            },
            {
                "term": "Small molecules",
                "uri": "http://edamontology.org/topic_0154"
            },
            {
                "term": "Data mining",
                "uri": "http://edamontology.org/topic_3473"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/peaklink-peptide-peak-linking-method-in-lc-msms-using-wavelet-and-svm.html"
        }
    ],
    "publication": [
        {
            "abstract": "Motivation: In liquid chromatography-mass spectrometry/tandem mass spectrometry (LC-MS/MS), it is necessary to link tandem MSidentified peptide peaks so that protein expression changes between the two runs can be tracked. However, only a small number of peptides can be identified and linked by tandem MS in two runs, and it becomes necessary to link peptide peaks with tandem identification in one run to their corresponding ones in another run without identification. In the past, peptide peaks are linked based on similarities in retention time (rt), mass or peak shape after rt alignment, which corrects mean rt shifts between runs. However, the accuracy in linking is still limited especially for complex samples collected from different conditions. Consequently, large-scale proteomics studies that require comparison of protein expression profiles of hundreds of patients can not be carried out effectively. Method: In this article, we consider the problem of linking peptides from a pair of LC-MS/MS runs and propose a new method, PeakLink (PL), which uses information in both the time and frequency domain as inputs to a non-linear support vector machine (SVM) classifier. The PL algorithm first uses a threshold on an rt likelihood ratio score to remove candidate corresponding peaks with excessively large elution time shifts, then PL calculates the correlation between a pair of candidate peaks after reducing noise through wavelet transformation. After converting rt and peak shape correlation to statistical scores, an SVM classifier is trained and applied for differentiating corresponding and non-corresponding peptide peaks. Results: PL is tested in multiple challenging cases, in which LC-MS/ MS samples are collected from different disease states, different instruments and different laboratories. Testing results show significant improvement in linking accuracy compared with other algorithms.. © The Author(s) 2014.",
            "authors": [
                "Bari M.G.",
                "Ma X.",
                "Zhang J."
            ],
            "cit_count": 4,
            "journal": "Bioinformatics",
            "pmid": "24813213",
            "title": "PeakLink: A new peptide peak linking method in LC-MS/MS using wavelet and SVM",
            "year": "2014-09-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:peaklink",
        "biotoolsID": "peaklink",
        "description": "Uses information in both the time and frequency domain as inputs to a non-linear support vector machine (SVM) classifier. The PL algorithm first  removes candidate corresponding peaks with excessively large elution time shifts, then calculates the correlation between a pair of candidate peaks after removing noise. Then a SVM classifier is trained and applied for differentiating corresponding and non-corresponding peptide peaks.",
        "homepage": "http://compgenomics.utsa.edu/zgroup/PeakLink/",
        "name": "PeakLink"
    }
}