{
    "additionDate": "2022-10-13T06:49:41.286724Z",
    "biotoolsCURIE": "biotools:glaucomanet",
    "biotoolsID": "glaucomanet",
    "confidence_flag": "tool",
    "credit": [
        {
            "name": "Mingquan Lin"
        },
        {
            "name": "Yifan Peng"
        }
    ],
    "description": "A deep-learning algorithm for the diagnosis of primary open-angle glaucoma from fundus photographs.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                },
                {
                    "term": "Image annotation",
                    "uri": "http://edamontology.org/operation_3553"
                },
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                }
            ]
        }
    ],
    "homepage": "https://github.com/bionlplab/GlaucomaNet",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-10-13T06:49:41.289217Z",
    "license": "BSD-3-Clause",
    "name": "GlaucomaNet",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1038/S41598-022-17753-4",
            "metadata": {
                "abstract": "© 2022, The Author(s).Primary open-angle glaucoma (POAG) is a leading cause of irreversible blindness worldwide. Although deep learning methods have been proposed to diagnose POAG, it remains challenging to develop a robust and explainable algorithm to automatically facilitate the downstream diagnostic tasks. In this study, we present an automated classification algorithm, GlaucomaNet, to identify POAG using variable fundus photographs from different populations and settings. GlaucomaNet consists of two convolutional neural networks to simulate the human grading process: learning the discriminative features and fusing the features for grading. We evaluated GlaucomaNet on two datasets: Ocular Hypertension Treatment Study (OHTS) participants and the Large-scale Attention-based Glaucoma (LAG) dataset. GlaucomaNet achieved the highest AUC of 0.904 and 0.997 for POAG diagnosis on OHTS and LAG datasets. An ensemble of network architectures further improved diagnostic accuracy. By simulating the human grading process, GlaucomaNet demonstrated high accuracy with increased transparency in POAG diagnosis (comprehensiveness scores of 97% and 36%). These methods also address two well-known challenges in the field: the need for increased image data diversity and relying heavily on perimetry for POAG diagnosis. These results highlight the potential of deep learning to assist and enhance clinical POAG diagnosis. GlaucomaNet is publicly available on https://github.com/bionlplab/GlaucomaNet.",
                "authors": [
                    {
                        "name": "Gordon M."
                    },
                    {
                        "name": "Hou B."
                    },
                    {
                        "name": "Kass M."
                    },
                    {
                        "name": "Lin M."
                    },
                    {
                        "name": "Liu L."
                    },
                    {
                        "name": "Peng Y."
                    },
                    {
                        "name": "Van Tassel S.H."
                    },
                    {
                        "name": "Wang F."
                    }
                ],
                "date": "2022-12-01T00:00:00Z",
                "journal": "Scientific Reports",
                "title": "Automated diagnosing primary open-angle glaucoma from fundus image by simulating human’s grading with deep learning"
            },
            "pmcid": "PMC9388536",
            "pmid": "35982106"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Medicine",
            "uri": "http://edamontology.org/topic_3303"
        },
        {
            "term": "Preclinical and clinical studies",
            "uri": "http://edamontology.org/topic_3379"
        }
    ],
    "validated": 1
}
