
{
    "credit": [
        {
            "name": "Micha Sammeth",
            "typeEntity": "Person",
            "typeRoles": [
                "Developer"
            ]
        },
        {
            "name": "Lab Roderic Guigo Group",
            "typeEntity": "Institute",
            "typeRoles": [
                "Provider"
            ]
        },
        {
            "name": "crg.eu",
            "typeEntity": "Institute",
            "typeRoles": [
                "Provider"
            ]
        },
        {
            "email": "micha@sammeth.net",
            "name": "Micha Sammeth",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://sammeth.net/confluence/display/SIM/Home"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://sammeth.net/confluence/display/SIM/2+-+Download"
        },
        {
            "type": "Binaries",
            "url": "http://sammeth.net/confluence/display/SIM/2+-+Download"
        }
    ],
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Sequence features",
                        "uri": "http://edamontology.org/data_1255"
                    },
                    "format": [
                        {
                            "term": "GTF",
                            "uri": "http://edamontology.org/format_2306"
                        }
                    ]
                },
                {
                    "data": {
                        "term": "Data",
                        "uri": "http://edamontology.org/data_0006"
                    }
                }
            ],
            "note": "The Flux Simulator aims at modeling RNA-Seq experiments in silico: sequencing reads are produced from a reference genome according annotated transcripts. The simulation pipeline models different steps as modules, each with a minimal set of parameters that can be estimated by experimental parameters.  The first step is-in fact-a transcriptome simulator. Subsequently, common sources of systematic bias in the abundance and distribution of produced reads are simulated by in silico library preparation and sequencing. Our models do not simulate molecular processes on the level of atoms, but represent a collection of deterministic approaches with a minimal set of parameters that can be estimated from observations of the experiment that is to be reproduced. Model development has to be understood as an iterative process to a maximal convergence of \"model world\" and \"real world\". It always requires a careful evaluation of all hypotheses and assumptions by comparison with experimental data.",
            "operation": [
                {
                    "term": "Simulated gene expression data generation",
                    "uri": "http://edamontology.org/operation_3566"
                }
            ]
        }
    ],
    "labels": {
        "cost": "Free of charge",
        "language": [
            "Java"
        ],
        "license": "BSD-3-Clause",
        "maturity": "Mature",
        "operatingSystem": [
            "Linux",
            "Mac"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Sequence analysis",
                "uri": "http://edamontology.org/topic_0080"
            }
        ]
    },
    "link": [
        {
            "type": "REPOSITORY",
            "url": "http://sammeth.net/bitbucket/projects/BARNA/repos/barna/browse/barna.simulator"
        }
    ],
    "publication": [
        {
            "abstract": "High-throughput sequencing of cDNA libraries constructed from cellular RNA complements (RNA-Seq) naturally provides a digital quantitative measurement for every expressed RNA molecule. Nature, impact and mutual interference of biases in different experimental setups are, however, still poorly understood - mostly due to the lack of data from intermediate protocol steps. We analysed multiple RNA-Seq experiments, involving different sample preparation protocols and sequencing platforms: we broke them down into their common - and currently indispensable - technical components (reverse transcription, fragmentation, adapter ligation, PCR amplification, gel segregation and sequencing), investigating how such different steps influence abundance and distribution of the sequenced reads. For each of those steps, we developed universally applicable models, which can be parameterised by empirical attributes of any experimental protocol. Our models are implemented in a computer simulation pipeline called the Flux Simulator, and we show that read distributions generated by different combinations of these models reproduce well corresponding evidence obtained from the corresponding experimental setups. We further demonstrate that our in silico RNA-Seq provides insights about hidden precursors that determine the final configuration of reads along gene bodies; enhancing or compensatory effects that explain apparently controversial observations can be observed. Moreover, our simulations identify hitherto unreported sources of systematic bias from RNA hydrolysis, a fragmentation technique currently employed by most RNA-Seq protocols. © 2012 The Author(s).",
            "authors": [
                "Griebel T.",
                "Zacher B.",
                "Ribeca P.",
                "Raineri E.",
                "Lacroix V.",
                "Guigo R.",
                "Sammeth M."
            ],
            "cit_count": 141,
            "doi": "10.1093/nar/gks666",
            "journal": "Nucleic Acids Research",
            "title": "Modelling and simulating generic RNA-Seq experiments with the flux simulator",
            "type": "Primary",
            "year": "2012-11-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:the_flux_simulator",
        "biotoolsID": "the_flux_simulator",
        "description": "Model RNA-Seq experiments in silico: sequencing reads are produced from a reference genome according annotated transcripts.",
        "homepage": "http://sammeth.net/confluence/display/SIM/Home",
        "name": "The Flux Simulator",
        "version": [
            "1.2.1"
        ]
    }
}