{
    "additionDate": "2017-02-14T09:35:44Z",
    "biotoolsCURIE": "biotools:rnabindr",
    "biotoolsID": "rnabindr",
    "credit": [
        {
            "email": "rnabindr_new@iastate.edu",
            "name": "RNABindR team",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "A server for analyzing and predicting RNA binding sites in proteins.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://ailab1.ist.psu.edu/RNABindR/instructions.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein-nucleic acid binding prediction",
                    "uri": "http://edamontology.org/operation_0420"
                },
                {
                    "term": "Transcription factor binding site prediction",
                    "uri": "http://edamontology.org/operation_0445"
                },
                {
                    "term": "Protein binding site prediction",
                    "uri": "http://edamontology.org/operation_2575"
                },
                {
                    "term": "Protein feature detection",
                    "uri": "http://edamontology.org/operation_3092"
                }
            ]
        }
    ],
    "homepage": "http://ailab1.ist.psu.edu/RNABindR/",
    "lastUpdate": "2018-12-10T12:58:54Z",
    "name": "RNABindR",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "Understanding interactions between proteins and RNA is key to deciphering the mechanisms of many important biological processes. Here we describe RNABindR, a web-based server that identifies and displays RNA-binding residues in known protein-RNA complexes and predicts RNA-binding residues in proteins of unknown structure. RNABindR uses a distance cutoff to identify which amino acids contact RNA in solved complex structures (from the Protein Data Bank) and provides a labeled amino acid sequence and a Jmol graphical viewer in which RNA-binding residues are displayed in the context of the three-dimensional structure. Alternatively, RNABindR can use a Naive Bayes classifier trained on a non-redundant set of protein-RNA complexes from the PDB to predict which amino acids in a protein sequence of unknown structure are most likely to bind RNA. RNABindR automatically displays 'high specificity' and 'high sensitivity' predictions of RNA-binding residues. RNABindR is freely available at http://bindr.gdcb.iastate.edu/RNABindR. © 2007 The Author(s).",
                "authors": [
                    {
                        "name": "Terribilini M."
                    },
                    {
                        "name": "Sander J.D."
                    },
                    {
                        "name": "Lee J.-H."
                    },
                    {
                        "name": "Zaback P."
                    },
                    {
                        "name": "Jernigan R.L."
                    },
                    {
                        "name": "Honavar V."
                    },
                    {
                        "name": "Dobbs D."
                    }
                ],
                "citationCount": 148,
                "date": "2007-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "RNABindR: A server for analyzing and predicting RNA-binding sites in proteins"
            },
            "pmid": "17483510"
        },
        {
            "metadata": {
                "abstract": "RNA-protein interactions are vitally important in a wide range of biological processes, including regulation of gene expression, protein synthesis, and replication and assembly of many viruses. We have developed a computational tool for predicting which amino acids of an RNA binding protein participate in RNA-protein interactions, using only the protein sequence as input. RNABindR was developed using machine learning on a validated nonredundant data set of interfaces from known RNA-protein complexes in the Protein Data Bank. It generates a classifier that captures primary sequence signals sufficient for predicting which amino acids in a given protein are located in the RNA-protein interface. In leave-one-out cross-validation experiments, RNABindR identifies interface residues with >85% overall accuracy. It can be calibrated by the user to obtain either high specificity or high sensitivity for interface residues. RNABindR, implementing a Naive Bayes classifier, performs as well as a more complex neural network classifier (to our knowledge, the only previously published sequence-based method for RNA binding site prediction) and offers the advantages of speed, simplicity and interpretability of results. RNABindR predictions on the human telomerase protein hTERT are in good agreement with experimental data. The availability of computational tools for predicting which residues in an RNA binding protein are likely to contact RNA should facilitate design of experiments to directly test RNA binding function and contribute to our understanding of the diversity, mechanisms, and regulation of RNA-protein complexes in biological systems. (RNABindR is available as a Web tool from http://bindr.gdcb.iastate.edu.) Published by Cold Spring Harbor Laboratory Press. Copyright © 2006 RNA Society.",
                "authors": [
                    {
                        "name": "Terribilini M."
                    },
                    {
                        "name": "Lee J.-H."
                    },
                    {
                        "name": "Yan C."
                    },
                    {
                        "name": "Jernigan R.L."
                    },
                    {
                        "name": "Honavar V."
                    },
                    {
                        "name": "Dobbs D."
                    }
                ],
                "citationCount": 140,
                "date": "2006-08-03T00:00:00Z",
                "journal": "RNA",
                "title": "Prediction of RNA binding sites in proteins from amino acid sequence"
            },
            "pmid": "16790841"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Protein binding sites",
            "uri": "http://edamontology.org/topic_3534"
        },
        {
            "term": "Nucleic acid sites, features and motifs",
            "uri": "http://edamontology.org/topic_3511"
        },
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        },
        {
            "term": "DNA binding sites",
            "uri": "http://edamontology.org/topic_3125"
        },
        {
            "term": "Structure prediction",
            "uri": "http://edamontology.org/topic_0082"
        }
    ],
    "validated": 1
}