{
    "additionDate": "2018-08-04T12:44:56Z",
    "biotoolsCURIE": "biotools:assayr",
    "biotoolsID": "assayr",
    "credit": [
        {
            "email": "jimi.wills@igmm.ed.ac.uk",
            "name": "Jimi Wills",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Simple Mass Spectrometry Software Tool for Targeted Metabolic and Stable Isotope Tracer Analyses.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://gitlab.com/jimiwills/assay.R/"
        }
    ],
    "editPermission": {
        "authors": [
            "proteomics.bio.tools"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Spectral analysis",
                    "uri": "http://edamontology.org/operation_3214"
                }
            ]
        }
    ],
    "homepage": "https://gitlab.com/jimiwills/assay.R/",
    "language": [
        "R",
        "Shell"
    ],
    "lastUpdate": "2022-01-11T16:54:42.906741Z",
    "name": "AssayR",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1021/acs.analchem.7b02401",
            "metadata": {
                "abstract": "© 2017 American Chemical Society.Metabolic analyses generally fall into two classes: unbiased metabolomic analyses and analyses that are targeted toward specific metabolites. Both techniques have been revolutionized by the advent of mass spectrometers with detectors that afford high mass accuracy and resolution, such as time-of-flights (TOFs) and Orbitraps. One particular area where this technology is key is in the field of metabolic flux analysis because the resolution of these spectrometers allows for discrimination between 13C-containing isotopologues and those containing 15N or other isotopes. While XCMS-based software is freely available for untargeted analysis of mass spectrometric data sets, it does not always identify metabolites of interest in a targeted assay. Furthermore, there is a paucity of vendor-independent software that deals with targeted analyses of metabolites and of isotopologues in particular. Here, we present AssayR, an R package that takes high resolution wide-scan liquid chromatography-mass spectrometry (LC-MS) data sets and tailors peak detection for each metabolite through a simple, iterative user interface. It automatically integrates peak areas for all isotopologues and outputs extracted ion chromatograms (EICs), absolute and relative stacked bar charts for all isotopologues, and a.csv data file. We demonstrate several examples where AssayR provides more accurate and robust quantitation than XCMS, and we propose that tailored peak detection should be the preferred approach for targeted assays. In summary, AssayR provides easy and robust targeted metabolite and stable isotope analyses on wide-scan data sets from high resolution mass spectrometers.",
                "authors": [
                    {
                        "name": "Wills J."
                    },
                    {
                        "name": "Edwards-Hicks J."
                    },
                    {
                        "name": "Finch A.J."
                    }
                ],
                "citationCount": 15,
                "date": "2017-09-19T00:00:00Z",
                "journal": "Analytical Chemistry",
                "title": "AssayR: A Simple Mass Spectrometry Software Tool for Targeted Metabolic and Stable Isotope Tracer Analyses"
            },
            "pmcid": "PMC5628912",
            "pmid": "28850215"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        }
    ],
    "validated": 1
}