{
    "additionDate": "2017-01-17T15:05:54Z",
    "biotoolsCURIE": "biotools:rnaseqcomp",
    "biotoolsID": "rnaseqcomp",
    "collectionID": [
        "BioConductor"
    ],
    "credit": [
        {
            "email": "tengmx@gmail.com",
            "name": "Mingxiang Teng",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Several quantitative and visualized benchmarks for RNA-seq quantification pipelines. Two-condition quantifications for genes, transcripts, junctions or exons by each pipeline with necessary meta information should be organized into numeric matrices in order to proceed the evaluation.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://bioconductor.org/packages/release/bioc/html/rnaseqcomp.html"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://bioconductor/packages/release/bioc/src/contrib/rnaseqcomp_1.4.0.tar.gz"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "RNA-Seq quantification",
                    "uri": "http://edamontology.org/operation_3800"
                }
            ]
        }
    ],
    "homepage": "http://bioconductor.org/packages/release/bioc/html/rnaseqcomp.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2019-01-13T17:47:21Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Mirror"
            ],
            "url": "https://github.com/tengmx/rnaseqcomp"
        }
    ],
    "name": "rnaseqcomp",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "bioconductor_import",
    "publication": [
        {
            "doi": "10.1186/s13059-016-1060-7",
            "metadata": {
                "abstract": "© 2016 The Author(s).After the publication of this work [1] it was noticed that there were typographical errors in the following equations: equation 5 in column 2, equation 7 in column 2, equation 8 in column 1. The bracket was placed incorrectly, so it should read: \\ log _2 (Y_{gij} + 0.5) rather than (\\ log _2 Y_{gij} + 0.5) It was brought to our attention that a new submission to the webtool for the eXpress algorithm for the ENCODE GM12878 dataset performs better than what is reported in the paper. While looking into the reason for this discrepancy we found two errors. First, the commands and parameter settings provided in the log information on the webtool were incorrect. Second, we realized that we ran the eXpress submission differently from the other methods for this particular dataset. One cause for the discrepancy was the accidental use of a different transcript FASTA file. We reran eXpress controlling for these differences and confirmed that better results are attained. Row 2 in Table 1 is changed, and the updated row is below. The comparative figures for GM12878 change (panel A Figures 3, 4, 5, 6 and Additional file 1: Figure S5). The new figures are below. The following statements should now read: Performance was generally poor, with one method clearly underperforming and RSEM slightly outperforming the rest. In the first dataset, Flux Capacitor clearly underperforms compared with the other methods in the regions with most data (A between 3 and 8). Here we see Flux Capacitor underperforming and RSEM slightly outperforming the other methods in the simulation dataset. With the exception of the underperforming Flux Capacitor, we found that the other algorithms performed similarly. The eXpress entry in the webtool, including the log-file entry which includes the scripts, has also been updated. You can see this in the ENCODE: 2 reps, high depth tab here: http://rafalab.rc.fas.harvard.edu/rnaseqbenchmark The authors apologize for this error.",
                "authors": [
                    {
                        "name": "Teng M."
                    },
                    {
                        "name": "Love M.I."
                    },
                    {
                        "name": "Davis C.A."
                    },
                    {
                        "name": "Djebali S."
                    },
                    {
                        "name": "Dobin A."
                    },
                    {
                        "name": "Graveley B.R."
                    },
                    {
                        "name": "Li S."
                    },
                    {
                        "name": "Mason C.E."
                    },
                    {
                        "name": "Olson S."
                    },
                    {
                        "name": "Pervouchine D."
                    },
                    {
                        "name": "Sloan C.A."
                    },
                    {
                        "name": "Wei X."
                    },
                    {
                        "name": "Zhan L."
                    },
                    {
                        "name": "Irizarry R.A."
                    }
                ],
                "citationCount": 1,
                "date": "2016-09-30T00:00:00Z",
                "journal": "Genome Biology",
                "title": "Erratum: A benchmark for RNA-seq quantification pipelines [Genome Biol. (2016), 17, 74], DOI: 10.1186/s13059-016-0940-1"
            },
            "pmcid": "PMC5045616",
            "pmid": "27716375",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool",
        "Library"
    ],
    "topic": [
        {
            "term": "RNA-seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ],
    "validated": 1,
    "version": [
        "1.4.0"
    ]
}