{
    "additionDate": "2021-01-18T09:30:59Z",
    "biotoolsCURIE": "biotools:neddpred",
    "biotoolsID": "neddpred",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "juzhe1120@hotmail.com",
            "name": "Zhe Ju",
            "typeEntity": "Person"
        }
    ],
    "description": "Identify Lysine Neddylation Sites Using Bi-profile Bayes Feature Extraction via the Chou's 5-steps Rule and General Pseudo Components.\n\nNeddylation is a highly dynamic and reversible post-translational modification. The abnormality of neddylation has previously been shown to be closely related to some human diseases. The detection of neddylation sites is essential for elucidating the regulation mechanisms of protein neddylation.\nAs the detection of the lysine neddylation sites by the traditional experimental method is often expensive and time-consuming, it is imperative to design computational methods to identify neddylation sites.",
    "editPermission": {
        "authors": [
            "guoqq"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Feature extraction",
                    "uri": "http://edamontology.org/operation_3937"
                },
                {
                    "term": "PTM localisation",
                    "uri": "http://edamontology.org/operation_3755"
                },
                {
                    "term": "PTM site prediction",
                    "uri": "http://edamontology.org/operation_0417"
                }
            ]
        }
    ],
    "homepage": "http://123.206.31.171/NeddPred/",
    "lastUpdate": "2024-11-24T14:41:17.784392Z",
    "name": "NeddPred",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.2174/1389202921666191223154629",
            "metadata": {
                "abstract": "Introduction: Neddylation is a highly dynamic and reversible post-translational modification. The abnormality of neddylation has previously been shown to be closely related to some human diseases. The detection of neddylation sites is essential for elucidating the regulation mechanisms of protein neddylation. Objective: As the detection of the lysine neddylation sites by the traditional experimental method is often expensive and time-consuming, it is imperative to design computational methods to identify neddylation sites. Methods: In this study, a bioinformatics tool named NeddPred is developed to identify underlying protein neddylation sites. A bi-profile bayes feature extraction is used to encode neddylation sites and a fuzzy support vector machine model is utilized to overcome the problem of noise and class imbalance in the prediction. Results: Matthew's correlation coefficient of NeddPred achieved 0.7082 and an area under the receiver operating characteristic curve of 0.9769. Independent tests show that NeddPred significantly outperforms existing lysine neddylation sites predictor NeddyPreddy. Conclusion: Therefore, NeddPred can be a complement to the existing tools for the prediction of neddylation sites. A user-friendly webserver for NeddPred is accessible at 123.206.31.171/NeddPred/.",
                "authors": [
                    {
                        "name": "Ju Z."
                    },
                    {
                        "name": "Wang S.-Y."
                    }
                ],
                "citationCount": 4,
                "date": "2019-01-01T00:00:00Z",
                "journal": "Current Genomics",
                "title": "Identify lysine neddylation sites using bi-profile bayes feature extraction via the chou’s 5-steps rule and general pseudo components"
            },
            "pmcid": "PMC7290059",
            "pmid": "32581647"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Protein modifications",
            "uri": "http://edamontology.org/topic_0601"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ]
}
