{
    "additionDate": "2017-01-13T13:15:49Z",
    "biotoolsCURIE": "biotools:peakranger",
    "biotoolsID": "peakranger",
    "credit": [
        {
            "name": "Xin Feng",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://www.linkedin.com/in/xinfeng/"
        }
    ],
    "description": "A multi-purpose, ultrafast ChIP Seq peak caller",
    "documentation": [
        {
            "type": "General",
            "url": "http://ranger.sourceforge.net/manual1.18.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Peak calling",
                    "uri": "http://edamontology.org/operation_3222"
                }
            ]
        }
    ],
    "homepage": "http://ranger.sourceforge.net",
    "language": [
        "C++"
    ],
    "lastUpdate": "2018-12-10T12:58:55Z",
    "license": "Artistic-2.0",
    "maturity": "Mature",
    "name": "PeakRanger",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "seqwiki_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Background: Chromatin immunoprecipitation (ChIP), coupled with massively parallel short-read sequencing (seq) is used to probe chromatin dynamics. Although there are many algorithms to call peaks from ChIP-seq datasets, most are tuned either to handle punctate sites, such as transcriptional factor binding sites, or broad regions, such as histone modification marks; few can do both. Other algorithms are limited in their configurability, performance on large data sets, and ability to distinguish closely-spaced peaks.Results: In this paper, we introduce PeakRanger, a peak caller software package that works equally well on punctate and broad sites, can resolve closely-spaced peaks, has excellent performance, and is easily customized. In addition, PeakRanger can be run in a parallel cloud computing environment to obtain extremely high performance on very large data sets. We present a series of benchmarks to evaluate PeakRanger against 10 other peak callers, and demonstrate the performance of PeakRanger on both real and synthetic data sets. We also present real world usages of PeakRanger, including peak-calling in the modENCODE project.Conclusions: Compared to other peak callers tested, PeakRanger offers improved resolution in distinguishing extremely closely-spaced peaks. PeakRanger has above-average spatial accuracy in terms of identifying the precise location of binding events. PeakRanger also has excellent sensitivity and specificity in all benchmarks evaluated. In addition, PeakRanger offers significant improvements in run time when running on a single processor system, and very marked improvements when allowed to take advantage of the MapReduce parallel environment offered by a cloud computing resource. PeakRanger can be downloaded at the official site of modENCODE project: http://www.modencode.org/software/ranger/. © 2011 Feng et al; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Feng X."
                    },
                    {
                        "name": "Grossman R."
                    },
                    {
                        "name": "Stein L."
                    }
                ],
                "citationCount": 81,
                "date": "2011-05-09T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "PeakRanger: A cloud-enabled peak caller for ChIP-seq data"
            },
            "pmid": "21554709"
        }
    ],
    "toolType": [
        "Suite"
    ],
    "topic": [
        {
            "term": "ChIP-seq",
            "uri": "http://edamontology.org/topic_3169"
        }
    ],
    "validated": 1
}