{
    "additionDate": "2021-01-18T08:32:35Z",
    "biotoolsCURIE": "biotools:ibitter-scm",
    "biotoolsID": "ibitter-scm",
    "confidence_flag": "tool",
    "description": "Identification and characterization of bitter peptides using a scoring card method with propensity scores of dipeptides.\n\nThis is the website for predicting Bitter peptides from the publication called ...",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Peptide identification",
                    "uri": "http://edamontology.org/operation_3631"
                },
                {
                    "term": "Protein signal peptide detection",
                    "uri": "http://edamontology.org/operation_0418"
                }
            ]
        }
    ],
    "homepage": "http://camt.pythonanywhere.com/iBitter-SCM",
    "lastUpdate": "2021-02-01T09:27:04Z",
    "name": "iBitter-SCM",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1016/J.YGENO.2020.03.019",
            "metadata": {
                "abstract": "© 2020 Elsevier Inc.In general, hydrolyzed proteins, plant-derived alkaloids and toxins displays unpleasant bitter taste. Thus, the perception of bitter taste plays a crucial role in protecting animals from poisonous plants and environmental toxins. Therapeutic peptides have attracted great attention as a new drug class. The successful identification and characterization of bitter peptides are essential for drug development and nutritional research. Owing to the large volume of peptides generated in the post-genomic era, there is an urgent need to develop computational methods for rapidly and effectively discriminating bitter peptides from non-bitter peptides. To the best of our knowledge, there is yet no computational model for predicting and analyzing bitter peptides using sequence information. In this study, we present for the first time a computational model called the iBitter-SCM that can predict the bitterness of peptides directly from their amino acid sequence without any dependence on their functional domain or structural information. iBitter-SCM is a simple and effective method that was built using the scoring card method (SCM) with estimated propensity scores of amino acids and dipeptides. Our benchmarking results demonstrated that iBitter-SCM achieved an accuracy and Matthews coefficient correlation of 84.38% and 0.688, respectively, on the independent dataset. Rigorous independent test indicated that iBitter-SCM was superior to those of other widely used machine-learning classifiers (e.g. k-nearest neighbor, naive Bayes, decision tree and random forest) owing to its simplicity, interpretability and implementation. Furthermore, the analysis of estimated propensity scores of amino acids and dipeptides were performed to provide a better understanding of the biophysical and biochemical properties of bitter peptides. For the convenience of experimental scientists, a web server is provided publicly at http://camt.pythonanywhere.com/iBitter-SCM. It is anticipated that iBitter-SCM can serve as an important tool to facilitate the high-throughput prediction and de novo design of bitter peptides.",
                "authors": [
                    {
                        "name": "Charoenkwan P."
                    },
                    {
                        "name": "Hasan M.M."
                    },
                    {
                        "name": "Nantasenamat C."
                    },
                    {
                        "name": "Schaduangrat N."
                    },
                    {
                        "name": "Shoombuatong W."
                    },
                    {
                        "name": "Yana J."
                    }
                ],
                "citationCount": 22,
                "date": "2020-07-01T00:00:00Z",
                "journal": "Genomics",
                "title": "iBitter-SCM: Identification and characterization of bitter peptides using a scoring card method with propensity scores of dipeptides"
            },
            "pmid": "32234434"
        }
    ],
    "toolType": [
        "Web service"
    ],
    "topic": [
        {
            "term": "Biophysics",
            "uri": "http://edamontology.org/topic_3306"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Nutritional science",
            "uri": "http://edamontology.org/topic_3390"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
