{
    "additionDate": "2015-08-03T09:35:52Z",
    "biotoolsCURIE": "biotools:fastm_api_ebi",
    "biotoolsID": "fastm_api_ebi",
    "credit": [
        {
            "name": "BioCatalogue",
            "typeEntity": "Project",
            "typeRole": [
                "Documentor"
            ],
            "url": "https://www.biocatalogue.org"
        },
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.ebi.ac.uk/support/"
        }
    ],
    "description": "Includes FASTF, that compares an ordered peptide mixture, as would be obtained by Edman degradation of a CNBr cleavage of a protein, against a protein database; FASTM, that compares an ordered set of peptides to a protein sequence database or an ordered set of oligonucleotides to a nucleotide sequence database; and FASTS, that compares a set of short peptide fragments, as would be obtained from mass-spec. analysis of a protein, against a protein database.",
    "documentation": [
        {
            "type": "General",
            "url": "http://www.ebi.ac.uk/Tools/webservices/services/sss/fastm_rest"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence comparison",
                    "uri": "http://edamontology.org/operation_2451"
                }
            ]
        }
    ],
    "homepage": "http://www.ebi.ac.uk/Tools/webservices/services/sss/fastm_rest",
    "lastUpdate": "2018-12-10T12:58:51Z",
    "link": [
        {
            "type": "Software catalogue",
            "url": "https://www.biocatalogue.org/services/2745"
        }
    ],
    "name": "FASTM API (EBI)",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "BioCatalogue",
    "publication": [
        {
            "doi": "10.1074/mcp.M100004-MCP200",
            "metadata": {
                "abstract": "We describe two novel sequence similarity search algorithms, FASTS and FASTF, that use multiple short peptide sequences to identify homologous sequences in protein or DNA databases. FASTS searches with peptide sequences of unknown order, as obtained by mass spectrometry-based sequencing, evaluating all possible arrangements of the peptides. FASTF searches with mixed peptide sequences, as generated by Edman sequencing of unseparated mixtures of peptides. FASTF deconvolutes the mixture, using a greedy heuristic that allows rapid identification of high scoring alignments while reducing the total number of explored alternatives. Both algorithms use the heuristic FASTA comparison strategy to accelerate the search but use alignment probability, rather than similarity score, as the criterion for alignment optimality. Statistical estimates are calculated using an empirical correction to a theoretical probability. These calculated estimates were accurate within a factor of 10 for FASTS and 1000 for FASTF on our test dataset. FASTS requires only 15-20 total residues in three or four peptides to robustly identify homologues sharing 50% or greater protein sequence identity. FASTF requires about 25% more sequence data than FASTS for equivalent sensitivity, but additional sequence data are usually available from mixed Edman experiments. Thus, both algorithms can identify homologues that diverged 100 to 500 million years ago, allowing proteomic identification from organisms whose genomes have not been sequenced.",
                "authors": [
                    {
                        "name": "Mackey A.J."
                    },
                    {
                        "name": "Haystead T.A."
                    },
                    {
                        "name": "Pearson W.R."
                    }
                ],
                "citationCount": 185,
                "date": "2002-01-01T00:00:00Z",
                "journal": "Molecular & cellular proteomics : MCP",
                "title": "Getting more from less: algorithms for rapid protein identification with multiple short peptide sequences."
            },
            "type": "Primary"
        }
    ],
    "toolType": [
        "Web API"
    ],
    "topic": [
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        }
    ],
    "validated": 1,
    "version": [
        "1"
    ]
}