{
    "additionDate": "2018-05-17T16:57:18Z",
    "biotoolsCURIE": "biotools:cmsa",
    "biotoolsID": "cmsa",
    "credit": [
        {
            "email": "yuce@tju.edu.cn",
            "name": "Ce Yu",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "A heterogeneous CPU/GPU computing system for multiple similar RNA/DNA sequence alignment.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/wangvsa/CMSA"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Multiple sequence alignment",
                    "uri": "http://edamontology.org/operation_0492"
                }
            ]
        }
    ],
    "homepage": "https://github.com/wangvsa/CMSA",
    "language": [
        "C++"
    ],
    "lastUpdate": "2018-12-10T12:58:58Z",
    "name": "CMSA",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1186/S12859-017-1725-6",
            "metadata": {
                "abstract": "© 2017 The Author(s).Background: The multiple sequence alignment (MSA) is a classic and powerful technique for sequence analysis in bioinformatics. With the rapid growth of biological datasets, MSA parallelization becomes necessary to keep its running time in an acceptable level. Although there are a lot of work on MSA problems, their approaches are either insufficient or contain some implicit assumptions that limit the generality of usage. First, the information of users' sequences, including the sizes of datasets and the lengths of sequences, can be of arbitrary values and are generally unknown before submitted, which are unfortunately ignored by previous work. Second, the center star strategy is suited for aligning similar sequences. But its first stage, center sequence selection, is highly time-consuming and requires further optimization. Moreover, given the heterogeneous CPU/GPU platform, prior studies consider the MSA parallelization on GPU devices only, making the CPUs idle during the computation. Co-run computation, however, can maximize the utilization of the computing resources by enabling the workload computation on both CPU and GPU simultaneously. Results: This paper presents CMSA, a robust and efficient MSA system for large-scale datasets on the heterogeneous CPU/GPU platform. It performs and optimizes multiple sequence alignment automatically for users' submitted sequences without any assumptions. CMSA adopts the co-run computation model so that both CPU and GPU devices are fully utilized. Moreover, CMSA proposes an improved center star strategy that reduces the time complexity of its center sequence selection process from O(mn 2) to O(mn). The experimental results show that CMSA achieves an up to 11× speedup and outperforms the state-of-the-art software. Conclusion: CMSA focuses on the multiple similar RNA/DNA sequence alignment and proposes a novel bitmap based algorithm to improve the center star strategy. We can conclude that harvesting the high performance of modern GPU is a promising approach to accelerate multiple sequence alignment. Besides, adopting the co-run computation model can maximize the entire system utilization significantly. The source code is available at https://github.com/wangvsa/CMSA.",
                "authors": [
                    {
                        "name": "Chen X."
                    },
                    {
                        "name": "Wang C."
                    },
                    {
                        "name": "Tang S."
                    },
                    {
                        "name": "Yu C."
                    },
                    {
                        "name": "Zou Q."
                    }
                ],
                "citationCount": 15,
                "date": "2017-06-24T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "CMSA: A heterogeneous CPU/GPU computing system for multiple similar RNA/DNA sequence alignment"
            },
            "pmcid": "PMC5483318",
            "pmid": "28646874"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        },
        {
            "term": "Nucleic acid structure analysis",
            "uri": "http://edamontology.org/topic_0097"
        }
    ],
    "validated": 1
}