
{
    "credit": [
        {
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://www.cs.ucr.edu/~wpan005/"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Phasing",
                    "uri": "http://edamontology.org/operation_3454"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "C++"
        ],
        "operatingSystem": [
            "Linux"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Sequences",
                "uri": "http://edamontology.org/topic_0080"
            },
            {
                "term": "Genetics",
                "uri": "http://edamontology.org/topic_3053"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/winhap-2-0-fast-haplotype-phasing-program-for-long-genotype-sequences.html"
        }
    ],
    "publication": [
        {
            "abstract": "Haplotype phasing represents an essential step in studying the association of genomic polymorphisms with complex genetic diseases, and in determining targets for drug designing. In recent years, huge amounts of genotype data are produced from the rapidly evolving high-throughput sequencing technologies, and the data volume challenges the community with more efficient haplotype phasing algorithms, in the senses of both running time and overall accuracy. 2SNP is one of the fastest haplotype phasing algorithms with comparable low error rates with the other algorithms. The most time-consuming step of 2SNP is the construction of a maximum spanning tree (MST) among all the heterozygous SNP pairs. We simplified this step by replacing the MST with the initial haplotypes of adjacent heterozygous SNP pairs. The multi-SNP haplotypes were estimated within a sliding window along the chromosomes. The comparative studies on four different-scale genotype datasets suggest that our algorithm WinHAP outperforms 2SNP and most of the other haplotype phasing algorithms in terms of both running speeds and overall accuracies. To facilitate the WinHAP's application in more practical biological datasets, we released the software for free at:http://staff.ustc.edu.cn/xuyun/winhap/index.htm. © 2012 Xu et al.",
            "authors": [
                "Xu Y.",
                "Cheng W.",
                "Nie P.",
                "Zhou F."
            ],
            "cit_count": 5,
            "doi": "10.1371/journal.pone.0043163",
            "journal": "PLoS ONE",
            "title": "Winhap: An efficient haplotype phasing algorithm based on scalable sliding windows",
            "type": "Primary",
            "year": "2012-08-14"
        },
        {
            "abstract": "Background: The haplotype phasing problem tries to screen for phenotype associated genomic variations from millions of candidate data. Most of the current computer programs handle this problem with high requirements of computing power and memory. By replacing the computation-intensive step of constructing the maximum spanning tree with a heuristics of estimated initial haplotype, we released the WinHAP algorithm version 1.0, which outperforms the other algorithms in terms of both running speed and overall accuracy.Results: This work further speeds up the WinHAP algorithm to version 2.0 (WinHAP2) by utilizing the divide-and-conquer strategy and the OpenMP parallel computing mode. WinHAP2 can phase 500 genotypes with 1,000,000 SNPs using just 12.8 MB in memory and 2.5 hours on a personal computer, whereas the other programs require unacceptable memory or running times. The parallel running mode further improves WinHAP2's running speed with several orders of magnitudes, compared with the other programs, including Beagle, SHAPEIT2 and 2SNP.Conclusions: WinHAP2 is an extremely fast haplotype phasing program which can handle a large-scale genotyping study with any number of SNPs in the current literature and at least in the near future. © 2014 Pan et al.; licensee BioMed Central Ltd.",
            "authors": [
                "Pan W.",
                "Zhao Y.",
                "Xu Y.",
                "Zhou F."
            ],
            "cit_count": 2,
            "doi": "10.1186/1471-2105-15-164",
            "journal": "BMC Bioinformatics",
            "title": "WinHAP2: An extremely fast haplotype phasing program for long genotype sequences",
            "type": "Primary",
            "year": "2014-05-30"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:winhap",
        "biotoolsID": "winhap",
        "description": "Haplotype phasing for large-scale population genotypes data. Significantly improved version of the WinHAP program that both process longer sequences with less computer memory usage and increases computing speed.",
        "homepage": "http://staff.ustc.edu.cn/~xuyun/winhap/WinHAP2.0.htm",
        "name": "WinHAP",
        "version": [
            "2.0"
        ]
    }
}