{
    "additionDate": "2020-01-14T20:06:27Z",
    "biotoolsCURIE": "biotools:HybridAtt",
    "biotoolsID": "HybridAtt",
    "confidence_flag": "medium",
    "credit": [
        {
            "email": "kebinj@bjut.edu.cn",
            "name": "Kebin Jia",
            "typeEntity": "Person"
        }
    ],
    "description": "A hybrid self-attention deep learning framework for multivariate sleep stage classification.\n\nBACKGROUND:Sleep is a complex and dynamic biological process characterized by different sleep patterns. Comprehensive sleep monitoring and analysis using multivariate polysomnography (PSG) records has achieved significant efforts to prevent sleep-related disorders. To alleviate the time consumption caused by manual visual inspection of PSG, automatic multivariate sleep stage classification has become an important research topic in medical and bioinformatics. RESULTS:We present a unified hybrid self-attention deep learning framework, namely HybridAtt, to automatically classify sleep stages by capturing channel and temporal correlations from multivariate PSG records. We construct a new multi-view convolutional representation module to learn channel-specific and global view features from the heterogeneous PSG inputs.\n\n||| HOMEPAGE MISSING!",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                }
            ]
        }
    ],
    "homepage": "https://www.ncbi.nlm.nih.gov/pubmed/?term=31787093",
    "lastUpdate": "2020-01-14T20:06:27Z",
    "name": "HybridAtt",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12859-019-3075-Z",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Sleep is a complex and dynamic biological process characterized by different sleep patterns. Comprehensive sleep monitoring and analysis using multivariate polysomnography (PSG) records has achieved significant efforts to prevent sleep-related disorders. To alleviate the time consumption caused by manual visual inspection of PSG, automatic multivariate sleep stage classification has become an important research topic in medical and bioinformatics. Results: We present a unified hybrid self-attention deep learning framework, namely HybridAtt, to automatically classify sleep stages by capturing channel and temporal correlations from multivariate PSG records. We construct a new multi-view convolutional representation module to learn channel-specific and global view features from the heterogeneous PSG inputs. The hybrid attention mechanism is designed to further fuse the multi-view features by inferring their dependencies without any additional supervision. The learned attentional representation is subsequently fed through a softmax layer to train an end-to-end deep learning model. Conclusions: We empirically evaluate our proposed HybridAtt model on a benchmark PSG dataset in two feature domains, referred to as the time and frequency domains. Experimental results show that HybridAtt consistently outperforms ten baseline methods in both feature spaces, demonstrating the effectiveness of HybridAtt in the task of sleep stage classification.",
                "authors": [
                    {
                        "name": "Yuan Y."
                    },
                    {
                        "name": "Jia K."
                    },
                    {
                        "name": "Ma F."
                    },
                    {
                        "name": "Xun G."
                    },
                    {
                        "name": "Wang Y."
                    },
                    {
                        "name": "Su L."
                    },
                    {
                        "name": "Zhang A."
                    }
                ],
                "date": "2019-12-02T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "A hybrid self-attention deep learning framework for multivariate sleep stage classification"
            },
            "pmcid": "PMC6886163",
            "pmid": "31787093"
        }
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Bioinformatics",
            "uri": "http://edamontology.org/topic_0091"
        },
        {
            "term": "Neurology",
            "uri": "http://edamontology.org/topic_3334"
        }
    ]
}