{
    "accessibility": "Open access",
    "additionDate": "2022-11-03T08:07:21.049488Z",
    "biotoolsCURIE": "biotools:fets",
    "biotoolsID": "fets",
    "confidence_flag": "tool",
    "credit": [
        {
            "name": "Sarthak Pati",
            "orcidid": "https://orcid.org/0000-0003-2243-8487"
        },
        {
            "name": "Spyridon Bakas",
            "orcidid": "https://orcid.org/0000-0001-8734-6482"
        }
    ],
    "description": "The Federated Tumor Segmentation (FeTS) platform, describes an on-going under development open-source toolkit, with a user-friendly graphical user interface (GUI)",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://fets-ai.github.io/Front-End/"
        }
    ],
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://www.med.upenn.edu/cbica/fets/",
    "language": [
        "C++"
    ],
    "lastUpdate": "2022-11-03T08:07:21.051923Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/FETS-AI/Front-End"
        }
    ],
    "name": "FeTS",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1088/1361-6560/AC9449",
            "metadata": {
                "abstract": "© 2022 Institute of Physics and Engineering in Medicine.Objective. De-centralized data analysis becomes an increasingly preferred option in the healthcare domain, as it alleviates the need for sharing primary patient data across collaborating institutions. This highlights the need for consistent harmonized data curation, pre-processing, and identification of regions of interest based on uniform criteria. Approach. Towards this end, this manuscript describes the Federated Tumor Segmentation (FeTS) tool, in terms of software architecture and functionality. Main results. The primary aim of the FeTS tool is to facilitate this harmonized processing and the generation of gold standard reference labels for tumor sub-compartments on brain magnetic resonance imaging, and further enable federated training of a tumor sub-compartment delineation model across numerous sites distributed across the globe, without the need to share patient data. Significance. Building upon existing open-source tools such as the Insight Toolkit and Qt, the FeTS tool is designed to enable training deep learning models targeting tumor delineation in either centralized or federated settings. The target audience of the FeTS tool is primarily the computational researcher interested in developing federated learning models, and interested in joining a global federation towards this effort. The tool is open sourced at https://github.com/FETS-AI/Front-End.",
                "authors": [
                    {
                        "name": "Anthony Reina G."
                    },
                    {
                        "name": "Baid U."
                    },
                    {
                        "name": "Bakas S."
                    },
                    {
                        "name": "Bilello M."
                    },
                    {
                        "name": "Davatzikos C."
                    },
                    {
                        "name": "Edwards B."
                    },
                    {
                        "name": "Foley P."
                    },
                    {
                        "name": "Martin J."
                    },
                    {
                        "name": "Menze B."
                    },
                    {
                        "name": "Pati S."
                    },
                    {
                        "name": "Sako C."
                    },
                    {
                        "name": "Shah P."
                    },
                    {
                        "name": "Sheller M.J."
                    },
                    {
                        "name": "Thakur S."
                    }
                ],
                "date": "2022-10-21T00:00:00Z",
                "journal": "Physics in Medicine and Biology",
                "title": "The federated tumor segmentation (FeTS) tool: an open-source solution to further solid tumor research"
            },
            "pmid": "36137534"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        }
    ]
}
