{
    "additionDate": "2017-12-18T00:10:38Z",
    "biotoolsCURIE": "biotools:pss-sql",
    "biotoolsID": "pss-sql",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://zti.polsl.pl/dmrozek/"
        }
    ],
    "description": "Allows searching a database in order to identify proteins having secondary structure similar to the structure specified by the user in a PSS-SQL query.",
    "documentation": [
        {
            "type": "General",
            "url": "http://www.zti.aei.polsl.pl/w3/dmrozek/science/pss-sql.htm"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein sequence analysis",
                    "uri": "http://edamontology.org/operation_2479"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Protein structure analysis",
                    "uri": "http://edamontology.org/operation_2406"
                }
            ]
        }
    ],
    "homepage": "http://zti.polsl.pl/dmrozek/science/pss-sql.htm",
    "language": [
        "SQL",
        "C#"
    ],
    "lastUpdate": "2018-12-10T12:58:52Z",
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/pss-sql-protein-secondary-structure-similarity-searching-in-microsoft-sql-server.html"
        }
    ],
    "name": "PSS-SQL",
    "operatingSystem": [
        "Windows"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1007/s10844-014-0353-0",
            "metadata": {
                "abstract": "© 2015, The Author(s). Protein secondary structure describe protein construction in terms of regular spatial shapes, including alpha-helices, beta-strands, and loops, which protein amino acid chain can adopt in some of its regions. This information is supportive for protein classification, functional annotation, and 3D structure prediction. The relevance of this information and the scope of its practical applications cause the requirement for its effective storage and processing. Relational databases, widely-used in commercial systems in recent years, are one of the serious alternatives honed by years of experience, enriched with developed technologies, equipped with the declarative SQL query language, and accepted by the large community of programmers. Unfortunately, relational database management systems are not designed for efficient storage and processing of biological data, such as protein secondary structures. In this paper, we present a new search method implemented in the search engine of the PSS-SQL language. The PSS-SQL allows formulation of queries against a relational database in order to find proteins having secondary structures similar to the structural pattern specified by a user. In the paper, we will show how the search process can be accelerated by multiple scanning of the Segment Index and parallel implementation of the alignment procedure using multiple threads working on multiple-core CPUs.",
                "authors": [
                    {
                        "name": "Mrozek D."
                    },
                    {
                        "name": "Socha B."
                    },
                    {
                        "name": "Kozielski S."
                    },
                    {
                        "name": "Malysiak-Mrozek B."
                    }
                ],
                "citationCount": 13,
                "date": "2016-02-01T00:00:00Z",
                "journal": "Journal of Intelligent Information Systems",
                "title": "An efficient and flexible scanning of databases of protein secondary structures: with the segment index and multithreaded alignment"
            },
            "type": "Primary"
        },
        {
            "doi": "10.1007/978-3-319-06971-5"
        },
        {
            "doi": "10.1109/IEMBS.2010.5627303",
            "metadata": {
                "abstract": "Secondary structure representation of proteins provides important information regarding protein general construction and shape. This representation is often used in protein similarity searching. Since existing commercial database management systems do not offer integrated exploration methods for biological data e.g. at the level of the SQL language, the structural similarity searching is usually performed by external tools. In the paper, we present our newly developed PSS-SQL language, which allows searching a database in order to identify proteins having secondary structure similar to the structure specified by the user in a PSS-SQL query. Therefore, we provide a simple and declarative language for protein structure similarity searching. © 2010 IEEE.",
                "authors": [
                    {
                        "name": "Mrozek D."
                    },
                    {
                        "name": "Wieczorek D."
                    },
                    {
                        "name": "Malysiak-Mrozek B."
                    },
                    {
                        "name": "Kozielski S."
                    }
                ],
                "citationCount": 9,
                "date": "2010-12-01T00:00:00Z",
                "journal": "2010 Annual International Conference of the IEEE Engineering in Medicine and Biology Society, EMBC'10",
                "title": "PSS-SQL: Protein secondary structure - Structured query language"
            }
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        },
        {
            "term": "Structure analysis",
            "uri": "http://edamontology.org/topic_0081"
        },
        {
            "term": "Protein structure analysis",
            "uri": "http://edamontology.org/topic_2814"
        }
    ],
    "validated": 1
}