{
    "accessibility": "Open access",
    "additionDate": "2021-05-26T20:43:11Z",
    "biotoolsCURIE": "biotools:mashmap",
    "biotoolsID": "mashmap",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "adam.phillippy@nih.gov",
            "name": "Adam Phillippy",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "aluru@cc.gatech.edu",
            "name": "Srinivas Aluru",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "MashMap implements a fast and approximate algorithm for computing local alignment boundaries between long DNA sequences. It can be useful for mapping genome assembly or long reads (PacBio/ONT) to reference genome(s). Given a minimum alignment length and an identity threshold for the desired local alignments, Mashmap computes alignment boundaries and identity estimates using k-mers",
    "documentation": [
        {
            "type": [
                "Installation instructions"
            ],
            "url": "https://github.com/marbl/MashMap/blob/master/INSTALL.txt"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence alignment",
                    "uri": "http://edamontology.org/operation_0292"
                },
                {
                    "term": "Genome assembly",
                    "uri": "http://edamontology.org/operation_0525"
                },
                {
                    "term": "Mapping assembly",
                    "uri": "http://edamontology.org/operation_0523"
                }
            ]
        }
    ],
    "homepage": "https://github.com/marbl/MashMap",
    "language": [
        "C++"
    ],
    "lastUpdate": "2021-07-20T18:41:55.010636Z",
    "license": "Freeware",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/marbl/MashMap/issues"
        }
    ],
    "name": "MashMap",
    "operatingSystem": [
        "Mac",
        "Linux"
    ],
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/bty597",
            "metadata": {
                "abstract": "© The Author(s) 2018. Published by Oxford University Press.Motivation Whole-genome alignment is an important problem in genomics for comparing different species, mapping draft assemblies to reference genomes and identifying repeats. However, for large plant and animal genomes, this task remains compute and memory intensive. In addition, current practical methods lack any guarantee on the characteristics of output alignments, thus making them hard to tune for different application requirements. Results We introduce an approximate algorithm for computing local alignment boundaries between long DNA sequences. Given a minimum alignment length and an identity threshold, our algorithm computes the desired alignment boundaries and identity estimates using kmer-based statistics, and maintains sufficient probabilistic guarantees on the output sensitivity. Further, to prioritize higher scoring alignment intervals, we develop a plane-sweep based filtering technique which is theoretically optimal and practically efficient. Implementation of these ideas resulted in a fast and accurate assembly-to-genome and genome-to-genome mapper. As a result, we were able to map an error-corrected whole-genome NA12878 human assembly to the hg38 human reference genome in about 1 min total execution time and <4 GB memory using eight CPU threads, achieving significant improvement in memory-usage over competing methods. Recall accuracy of computed alignment boundaries was consistently found to be >97% on multiple datasets. Finally, we performed a sensitive self-alignment of the human genome to compute all duplications of length ≥1 Kbp and ≥90% identity. The reported output achieves good recall and covers twice the number of bases than the current UCSC browser's segmental duplication annotation. Availability and implementation https://github.com/marbl/MashMap.",
                "authors": [
                    {
                        "name": "Jain C."
                    },
                    {
                        "name": "Koren S."
                    },
                    {
                        "name": "Dilthey A."
                    },
                    {
                        "name": "Phillippy A.M."
                    },
                    {
                        "name": "Aluru S."
                    }
                ],
                "citationCount": 29,
                "date": "2018-09-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "A fast adaptive algorithm for computing whole-genome homology maps"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ]
}