{
    "additionDate": "2018-09-20T03:30:44Z",
    "biotoolsCURIE": "biotools:lncident",
    "biotoolsID": "lncident",
    "credit": [
        {
            "email": "liying@jlu.edu.cn",
            "name": "Ying Li",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Lncident is a tool for rapid identification of long noncoding RNAs utilizing sequence intrinsic composition and open reading frame information.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://csbl.bmb.uga.edu/mirrors/JLU/Lncident/Lncident-manual.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence analysis",
                    "uri": "http://edamontology.org/operation_2403"
                }
            ]
        }
    ],
    "homepage": "http://csbl.bmb.uga.edu/mirrors/JLU/Lncident/index.php",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-10T12:59:01Z",
    "license": "GPL-3.0",
    "name": "Lncident",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "daniel_stefan",
    "publication": [
        {
            "doi": "10.1155/2016/9185496",
            "metadata": {
                "abstract": "© 2016 Siyu Han et al.More and more studies have demonstrated that long noncoding RNAs (lncRNAs) play critical roles in diversity of biological process and are also associated with various types of disease. How to rapidly identify lncRNAs and messenger RNA is the fundamental step to uncover the function of lncRNAs identification. Here, we present a novel method for rapid identification of lncRNAs utilizing sequence intrinsic composition features and open reading frame information based on support vector machine model, named as Lncident (LncRNAs identification). The 10-fold cross-validation and ROC curve are used to evaluate the performance of Lncident. The main advantage of Lncident is high speed without the loss of accuracy. Compared with the exiting popular tools, Lncident outperforms Coding-Potential Calculator, Coding-Potential Assessment Tool, Coding-Noncoding Index, and PLEK. Lncident is also much faster than Coding-Potential Calculator and Coding-Noncoding Index. Lncident presents an outstanding performance on microorganism, which offers a great application prospect to the analysis of microorganism. In addition, Lncident can be trained by users' own collected data. Furthermore, R package and web server are simultaneously developed in order to maximize the convenience for the users. The R package \"Lncident\" can be easily installed on multiple operating system platforms, as long as R is supported.",
                "authors": [
                    {
                        "name": "Han S."
                    },
                    {
                        "name": "Liang Y."
                    },
                    {
                        "name": "Li Y."
                    },
                    {
                        "name": "Du W."
                    }
                ],
                "citationCount": 4,
                "date": "2016-01-01T00:00:00Z",
                "journal": "International Journal of Genomics",
                "title": "Lncident: A Tool for Rapid Identification of Long Noncoding RNAs Utilizing Sequence Intrinsic Composition and Open Reading Frame Information"
            },
            "pmcid": "PMC5223071",
            "pmid": "28116287",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        }
    ],
    "validated": 1
}