{
    "accessibility": "Open access",
    "additionDate": "2023-02-13T19:02:43.349948Z",
    "biotoolsCURIE": "biotools:catnet",
    "biotoolsID": "catnet",
    "confidence_flag": "tool",
    "credit": [
        {
            "name": "Sicen Liu"
        }
    ],
    "description": "Cross-event attention-based time-aware network for medical event prediction",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                }
            ]
        }
    ],
    "homepage": "https://github.com/sherry6247/CATNet.git",
    "language": [
        "Python"
    ],
    "lastUpdate": "2023-02-13T19:02:43.352609Z",
    "license": "Not licensed",
    "name": "CATNet",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1016/J.ARTMED.2022.102440",
            "metadata": {
                "abstract": "© 2022 Elsevier B.V.Medical event prediction (MEP) is a fundamental task in the healthcare domain, which needs to predict medical events, including medications, diagnosis codes, laboratory tests, procedures, outcomes, and so on, according to historical medical records of patients. Many researchers have tried to build MEP models to overcome the challenges caused by the heterogeneous and irregular temporal characteristics of EHR data. However, most of them consider the heterogenous and temporal medical events separately and ignore the correlations among different types of medical events, especially relations between heterogeneous historical medical events and target medical events. In this paper, we propose a novel neural network based on attention mechanism called Cross-event Attention-based Time-aware Network (CATNet) for MEP. It is a time-aware, event-aware and task-adaptive method with the following advantages: 1) modeling heterogeneous information and temporal information in a unified way and considering irregular temporal characteristics locally and globally respectively, 2) taking full advantage of correlations among different types of events via cross-event attention. Experiments on two public datasets (MIMIC-III and eICU) show CATNet outperforms other state-of-the-art methods on various MEP tasks. The source code of CATNet is released at https://github.com/sherry6247/CATNet.git.",
                "authors": [
                    {
                        "name": "Liu S."
                    },
                    {
                        "name": "Tang B."
                    },
                    {
                        "name": "Wang H."
                    },
                    {
                        "name": "Wang X."
                    },
                    {
                        "name": "Xiang Y."
                    },
                    {
                        "name": "Xu H."
                    }
                ],
                "date": "2022-12-01T00:00:00Z",
                "journal": "Artificial Intelligence in Medicine",
                "title": "CATNet: Cross-event attention-based time-aware network for medical event prediction"
            },
            "pmid": "36462902"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Human biology",
            "uri": "http://edamontology.org/topic_2815"
        },
        {
            "term": "Laboratory techniques",
            "uri": "http://edamontology.org/topic_3361"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        }
    ]
}
