{
    "additionDate": "2021-01-18T10:38:47Z",
    "biotoolsCURIE": "biotools:regsnps-asb",
    "biotoolsID": "regsnps-asb",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "yunliu@iu.edu",
            "name": "Yunlong Liu",
            "typeEntity": "Person"
        }
    ],
    "description": "A Computational Framework for Identifying Allele-Specific Transcription Factor Binding From ATAC-seq Data.\n\nExpression quantitative trait loci (eQTL) analysis is useful for identifying genetic variants correlated with gene expression, however, it cannot distinguish between causal and nearby non-functional variants. Because the majority of disease-associated SNPs are located in regulatory regions, they can impact allele-specific binding (ASB) of transcription factors and result in differential expression of the target gene alleles. In this study, our aim was to identify functional single-nucleotide polymorphisms (SNPs) that alter transcriptional regulation and thus, potentially impact cellular function. Here, we present regSNPs-ASB, a generalized linear model-based approach to identify regulatory SNPs that are located in transcription factor binding sites",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "SNP detection",
                    "uri": "http://edamontology.org/operation_0484"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Transcription factor binding site prediction",
                    "uri": "http://edamontology.org/operation_0445"
                },
                {
                    "term": "Variant prioritisation",
                    "uri": "http://edamontology.org/operation_3226"
                }
            ]
        }
    ],
    "homepage": "https://github.com/SiwenX/RegSNPs-ASB",
    "lastUpdate": "2021-02-06T12:22:49Z",
    "name": "regSNPs-ASB",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.3389/FBIOE.2020.00886",
            "metadata": {
                "abstract": "© Copyright © 2020 Xu, Feng, Lu, Yu, Shao, Nakshatri, Reiter, Gao, Chu, Wang and Liu.Expression quantitative trait loci (eQTL) analysis is useful for identifying genetic variants correlated with gene expression, however, it cannot distinguish between causal and nearby non-functional variants. Because the majority of disease-associated SNPs are located in regulatory regions, they can impact allele-specific binding (ASB) of transcription factors and result in differential expression of the target gene alleles. In this study, our aim was to identify functional single-nucleotide polymorphisms (SNPs) that alter transcriptional regulation and thus, potentially impact cellular function. Here, we present regSNPs-ASB, a generalized linear model-based approach to identify regulatory SNPs that are located in transcription factor binding sites. The input for this model includes ATAC-seq (assay for transposase-accessible chromatin with high-throughput sequencing) raw read counts from heterozygous loci, where differential transposase-cleavage patterns between two alleles indicate preferential transcription factor binding to one of the alleles. Using regSNPs-ASB, we identified 53 regulatory SNPs in human MCF-7 breast cancer cells and 125 regulatory SNPs in human mesenchymal stem cells (MSC). By integrating the regSNPs-ASB output with RNA-seq experimental data and publicly available chromatin interaction data from MCF-7 cells, we found that these 53 regulatory SNPs were associated with 74 potential target genes and that 32 (43%) of these genes showed significant allele-specific expression. By comparing all of the MCF-7 and MSC regulatory SNPs to the eQTLs in the Genome-Tissue Expression (GTEx) Project database, we found that 30% (16/53) of the regulatory SNPs in MCF-7 and 43% (52/122) of the regulatory SNPs in MSC were also in eQTL regions. The enrichment of regulatory SNPs in eQTLs indicated that many of them are likely responsible for allelic differences in gene expression (chi-square test, p-value < 0.01). In summary, we conclude that regSNPs-ASB is a useful tool for identifying causal variants from ATAC-seq data. This new computational tool will enable efficient prioritization of genetic variants identified as eQTL for further studies to validate their causal regulatory function. Ultimately, identifying causal genetic variants will further our understanding of the underlying molecular mechanisms of disease and the eventual development of potential therapeutic targets.",
                "authors": [
                    {
                        "name": "Xu S."
                    },
                    {
                        "name": "Feng W."
                    },
                    {
                        "name": "Lu Z."
                    },
                    {
                        "name": "Yu C.Y."
                    },
                    {
                        "name": "Shao W."
                    },
                    {
                        "name": "Nakshatri H."
                    },
                    {
                        "name": "Reiter J.L."
                    },
                    {
                        "name": "Gao H."
                    },
                    {
                        "name": "Chu X."
                    },
                    {
                        "name": "Wang Y."
                    },
                    {
                        "name": "Liu Y."
                    }
                ],
                "date": "2020-07-29T00:00:00Z",
                "journal": "Frontiers in Bioengineering and Biotechnology",
                "title": "regSNPs-ASB: A Computational Framework for Identifying Allele-Specific Transcription Factor Binding From ATAC-seq Data"
            },
            "pmcid": "PMC7405637",
            "pmid": "32850739"
        }
    ],
    "topic": [
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "ChIP-seq",
            "uri": "http://edamontology.org/topic_3169"
        },
        {
            "term": "RNA splicing",
            "uri": "http://edamontology.org/topic_3320"
        }
    ]
}