{
    "accessibility": "Open access",
    "additionDate": "2019-05-17T10:48:13Z",
    "biotoolsCURIE": "biotools:NITPicker",
    "biotoolsID": "NITPicker",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "dezer@turing.ac.uk",
            "name": "Daphne Ezer",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "NITPicker (Next Iteration Time-point Picker) selects optimal time points (or spatial points along a single axis), that eliminates some of the biases caused by human decision-making, while maximising information about the shape of the underlying curves.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/ezer/NITPicker"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "RNA-seq time series data analysis",
                    "uri": "http://edamontology.org/operation_3565"
                },
                {
                    "term": "RNA-Seq quantification",
                    "uri": "http://edamontology.org/operation_3800"
                }
            ]
        }
    ],
    "homepage": "https://cran.r-project.org/package=NITPicker",
    "language": [
        "R"
    ],
    "lastUpdate": "2020-06-16T10:55:22Z",
    "license": "GPL-3.0",
    "maturity": "Mature",
    "name": "NITPicker",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "Ruta",
    "publication": [
        {
            "doi": "10.1186/s12859-019-2717-5",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: The design of an experiment influences both what a researcher can measure, as well as how much confidence can be placed in the results. As such, it is vitally important that experimental design decisions do not systematically bias research outcomes. At the same time, making optimal design decisions can produce results leading to statistically stronger conclusions. Deciding where and when to sample are among the most critical aspects of many experimental designs; for example, we might have to choose the time points at which to measure some quantity in a time series experiment. Choosing times which are too far apart could result in missing short bursts of activity. On the other hand, there may be time points which provide very little information regarding the overall behaviour of the quantity in question. Results: In this study, we develop a tool called NITPicker (Next Iteration Time-point Picker) for selecting optimal time points (or spatial points along a single axis), that eliminates some of the biases caused by human decision-making, while maximising information about the shape of the underlying curves. NITPicker uses ideas from the field of functional data analysis. NITPicker is available on the Comprehensive R Archive Network (CRAN) and code for drawing figures is available on Github (https://github.com/ezer/NITPicker). Conclusions: NITPicker performs well on diverse real-world datasets that would be relevant for varied biological applications, including designing follow-up experiments for longitudinal gene expression data, weather pattern changes over time, and growth curves.",
                "authors": [
                    {
                        "name": "Ezer D."
                    },
                    {
                        "name": "Keir J."
                    }
                ],
                "citationCount": 1,
                "date": "2019-04-02T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "NITPicker: Selecting time points for follow-up experiments"
            },
            "pmcid": "PMC6444531",
            "pmid": "30940082",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "RNA-seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Experimental design and studies",
            "uri": "http://edamontology.org/topic_3678"
        }
    ],
    "version": [
        "1.0.1"
    ]
}