{
    "additionDate": "2017-05-16T12:28:07Z",
    "biotoolsCURIE": "biotools:arrayanalysis.org",
    "biotoolsID": "arrayanalysis.org",
    "credit": [
        {
            "name": "Support Forum",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.arrayanalysis.org/"
        }
    ],
    "description": "ArrayAnalysis.org is a web server for quality control and pre-processing analysis of Affymetrix gene expression results by extending, integrating and harmonizing functionality of Bioconductor packages. The tool may also be downloaded for use in R.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://www.arrayanalysis.org"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequencing quality control",
                    "uri": "http://edamontology.org/operation_3218"
                },
                {
                    "term": "Validation",
                    "uri": "http://edamontology.org/operation_2428"
                },
                {
                    "term": "Differential gene expression analysis",
                    "uri": "http://edamontology.org/operation_3223"
                },
                {
                    "term": "Gene expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                }
            ]
        }
    ],
    "homepage": "http://www.arrayanalysis.org",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-10T12:58:54Z",
    "name": "ArrayAnalysis.org",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "doi": "10.1093/nar/gkt293",
            "metadata": {
                "abstract": "Quality control (QC) is crucial for any scientific method producing data. Applying adequate QC introduces new challenges in the genomics field where large amounts of data are produced with complex technologies. For DNA microarrays, specific algorithms for QC and pre-processing including normalization have been developed by the scientific community, especially for expression chips of the Affymetrix platform. Many of these have been implemented in the statistical scripting language R and are available from the Bioconductor repository. However, application is hampered by lack of integrative tools that can be used by users of any experience level. To fill this gap, we developed a freely available tool for QC and pre-processing of Affymetrix gene expression results, extending, integrating and harmonizing functionality of Bioconductor packages. The tool can be easily accessed through a wizard-like web portal at http://www.arrayanalysis.org or downloaded for local use in R. The portal provides extensive documentation, including user guides, interpretation help with real output illustrations and detailed technical documentation. It assists newcomers to the field in performing state-of-the-art QC and pre-processing while offering data analysts an integral open-source package. Providing the scientific community with this easily accessible tool will allow improving data quality and reuse and adoption of standards.",
                "authors": [
                    {
                        "name": "Eijssen L.M."
                    },
                    {
                        "name": "Jaillard M."
                    },
                    {
                        "name": "Adriaens M.E."
                    },
                    {
                        "name": "Gaj S."
                    },
                    {
                        "name": "de Groot P.J."
                    },
                    {
                        "name": "Muller M."
                    },
                    {
                        "name": "Evelo C.T."
                    }
                ],
                "citationCount": 87,
                "date": "2013-01-01T00:00:00Z",
                "journal": "Nucleic acids research",
                "title": "User-friendly solutions for microarray quality control and pre-processing on ArrayAnalysis.org."
            },
            "pmcid": "PMC3692049",
            "pmid": "23620278"
        },
        {
            "doi": "10.1186/s12864-015-1689-8",
            "metadata": {
                "abstract": "© 2015 Eijssen et al.Background: Illumina whole-genome expression bead arrays are a widely used platform for transcriptomics. Most of the tools available for the analysis of the resulting data are not easily applicable by less experienced users. ArrayAnalysis.org provides researchers with an easy-to-use and comprehensive interface to the functionality of R and Bioconductor packages for microarray data analysis. As a modular open source project, it allows developers to contribute modules that provide support for additional types of data or extend workflows. Results: To enable data analysis of Illumina bead arrays for a broad user community, we have developed a module for ArrayAnalysis.org that provides a free and user-friendly web interface for quality control and pre-processing for these arrays. This module can be used together with existing modules for statistical and pathway analysis to provide a full workflow for Illumina gene expression data analysis. Conclusions: The Illumina bead arrays analysis module is available at http://www.arrayanalysis.org. A user guide, a tutorial demonstrating the analysis of an example dataset, and R scripts are available. The module can be used as a starting point for statistical evaluation and pathway analysis provided on the website or to generate processed input data for a broad range of applications in life sciences research.",
                "authors": [
                    {
                        "name": "Eijssen L.M.T."
                    },
                    {
                        "name": "Goelela V.S."
                    },
                    {
                        "name": "Kelder T."
                    },
                    {
                        "name": "Adriaens M.E."
                    },
                    {
                        "name": "Evelo C.T."
                    },
                    {
                        "name": "Radonjic M."
                    }
                ],
                "citationCount": 8,
                "date": "2015-06-30T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "A user-friendly workflow for analysis of Illumina gene expression bead array data available at the arrayanalysis.org portal"
            },
            "pmcid": "PMC4486126",
            "pmid": "26122086"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "ChIP-on-chip",
            "uri": "http://edamontology.org/topic_3179"
        },
        {
            "term": "Data architecture, analysis and design",
            "uri": "http://edamontology.org/topic_3365"
        }
    ],
    "validated": 1
}