
{
    "credit": [
        {
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://www.cbio.uct.ac.za/about"
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://web.cbio.uct.ac.za/ITGOM/adagofun/"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Gene-set enrichment analysis",
                    "uri": "http://edamontology.org/operation_2436"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Python"
        ],
        "operatingSystem": [
            "Linux"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Sequence analysis",
                "uri": "http://edamontology.org/topic_0080"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/a-dago-fun-gene-ontology-semantic-similarity-based-functional-analysis.html"
        }
    ],
    "publication": [
        {
            "abstract": "© The Author 2015. Published by Oxford University Press. Summary: Gene Ontology (GO) semantic similarity measures are being used for biological knowledge discovery based on GO annotations by integrating biological information contained in the GO structure into data analyses. To empower users to quickly compute, manipulate and explore these measures, we introduce A-DaGO-Fun (ADaptable Gene Ontology semantic similarity-based Functional analysis). It is a portable software package integrating all known GO information content-based semantic similarity measures and relevant biological applications associated with these measures. A-DaGO-Fun has the advantage not only of handling datasets from the current high-throughput genome-wide applications, but also allowing users to choose the most relevant semantic similarity approach for their biological applications and to adapt a given module to their needs.",
            "authors": [
                "Mazandu G.K.",
                "Chimusa E.R.",
                "Mbiyavanga M.",
                "Mulder N.J."
            ],
            "cit_count": 11,
            "journal": "Bioinformatics",
            "pmid": "26476781",
            "title": "A-DaGO-Fun: An adaptable Gene Ontology semantic similarity-based functional analysis tool",
            "year": "2015-04-23"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:a-dago-fun",
        "biotoolsID": "a-dago-fun",
        "description": "Python library that provides a comprehensive and customized set of Gene Ontology (GO) based functional analysis tools that exploit the biological knowledge that GO offers in describing genes or groups of genes through the use of GO semantic similarity measures for biological knowledge discovery.",
        "homepage": "http://web.cbio.uct.ac.za/ITGOM/adagofun/",
        "name": "A-DaGO-Fun"
    }
}