
{
    "credit": [
        {
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://www.stanford.edu/group/sherlocklab/index.shtml"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Java"
        ],
        "operatingSystem": [
            "Linux",
            "Windows"
        ],
        "toolType": [
            "Desktop application"
        ],
        "topic": [
            {
                "term": "Sequence analysis",
                "uri": "http://edamontology.org/topic_0080"
            },
            {
                "term": "Genomics",
                "uri": "http://edamontology.org/topic_0622"
            },
            {
                "term": "Nucleic acid structure analysis",
                "uri": "http://edamontology.org/topic_0097"
            },
            {
                "term": "DNA",
                "uri": "http://edamontology.org/topic_0654"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/caryoscope-0-4-0-view-gene-expression-data-genome.html"
        }
    ],
    "publication": [
        {
            "abstract": "Background: Microarray-based comparative genome hybridization experiments generate data that can be mapped onto the genome. These data are interpreted more easily when represented graphically in a genomic context. Results: We have developed Caryoscope, which is an open source Java application for visualizing microarray data from array comparative genome hybridization experiments in a genomic context. Caryoscope can read General Feature Format files (GFF files), as well as comma- and tab-delimited files, that define the genomic positions of the microarray reporters for which data are obtained. The microarray data can be browsed using an interactive, zoomable interface, which helps users identify regions of chromosomal deletion or amplification. The graphical representation of the data can be exported in a number of graphic formats, including publication-quality formats such as PostScript. Conclusion: Caryoscope is a useful tool that can aid in the visualization, exploration and interpretation of microarray data in a genomic context. © 2004 Awad et al; licensee BioMed Central Ltd.",
            "authors": [
                "Awad I.A.B.",
                "Rees C.A.",
                "Hernandez-Boussard T.",
                "Ball C.A.",
                "Sherlock G."
            ],
            "cit_count": 26,
            "doi": "10.1186/1471-2105-5-151",
            "journal": "BMC Bioinformatics",
            "title": "Caryoscope: An open source Java application for viewing microarray data in a genomic context",
            "type": "Primary",
            "year": "2004-10-15"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:caryoscope",
        "biotoolsID": "caryoscope",
        "description": "Application for viewing gene expression data in a whole-genome context. It has been used to “draw” microarray data onto a set of chromosomes so that changes in DNA copy number can identify regions of chromosome loss or duplication within the genome of tumor cells (Nat Genet. 1999 Sep;23(1):41-6).",
        "homepage": "http://www.stanford.edu/group/sherlocklab/software.shtml",
        "name": "Caryoscope",
        "version": [
            "0.4.0"
        ]
    }
}