{
    "accessibility": "Open access",
    "additionDate": "2024-03-07T09:55:14.889578Z",
    "biotoolsCURIE": "biotools:easycgtree",
    "biotoolsID": "easycgtree",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "Shaozz@163.com",
            "name": "Zongze Shao",
            "typeEntity": "Person"
        },
        {
            "email": "zdf@hhu.edu.cn",
            "name": "Dao-Feng Zhang",
            "typeEntity": "Person"
        }
    ],
    "description": "Pipeline for prokaryotic phylogenomic analysis based on core gene sets.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://github.com/zdf1987/EasyCGTree4/blob/main/Manual-v4.2.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Consensus tree construction",
                    "uri": "http://edamontology.org/operation_0555"
                },
                {
                    "term": "Phylogenetic reconstruction",
                    "uri": "http://edamontology.org/operation_3478"
                },
                {
                    "term": "Phylogenetic sub/super tree construction",
                    "uri": "http://edamontology.org/operation_0556"
                }
            ]
        }
    ],
    "homepage": "https://github.com/zdf1987/EasyCGTree4",
    "language": [
        "Perl"
    ],
    "lastUpdate": "2024-03-07T09:55:14.894222Z",
    "name": "EasyCGTree",
    "operatingSystem": [
        "Linux",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12859-023-05527-2",
            "metadata": {
                "abstract": "Background: Genome-scale phylogenetic analysis based on core gene sets is routinely used in microbiological research. However, the techniques are still not approachable for individuals with little bioinformatics experience. Here, we present EasyCGTree, a user-friendly and cross-platform pipeline to reconstruct genome-scale maximum-likehood (ML) phylogenetic tree using supermatrix (SM) and supertree (ST) approaches. Results: EasyCGTree was implemented in Perl programming languages and was built using a collection of published reputable programs. All the programs were precompiled as standalone executable files and contained in the EasyCGTree package. It can run after installing Perl language environment. Several profile hidden Markov models (HMMs) of core gene sets were prepared in advance to construct a profile HMM database (PHD) that was enclosed in the package and available for homolog searching. Customized gene sets can also be used to build profile HMM and added to the PHD via EasyCGTree. Taking 43 genomes of the genus Paracoccus as the testing data set, consensus (a variant of the typical SM), SM, and ST trees were inferred via EasyCGTree successfully, and the SM trees were compared with those inferred via the pipelines UBCG and bcgTree, using the metrics of cophenetic correlation coefficients (CCC) and Robinson–Foulds distance (topological distance). The results suggested that EasyCGTree can infer SM trees with nearly identical topology (distance < 0.1) and accuracy (CCC > 0.99) to those of trees inferred with the two pipelines. Conclusions: EasyCGTree is an all-in-one automatic pipeline from input data to phylogenomic tree with guaranteed accuracy, and is much easier to install and use than the reference pipelines. In addition, ST is implemented in EasyCGTree conveniently and can be used to explore prokaryotic evolutionary signals from a different perspective. The EasyCGTree version 4 is freely available for Linux and Windows users at Github (https://github.com/zdf1987/EasyCGTree4).",
                "authors": [
                    {
                        "name": "Ahmed I."
                    },
                    {
                        "name": "He W."
                    },
                    {
                        "name": "Li W.-J."
                    },
                    {
                        "name": "Shao Z."
                    },
                    {
                        "name": "Zhang D.-F."
                    },
                    {
                        "name": "Zhang Y."
                    },
                    {
                        "name": "Zhao Z."
                    }
                ],
                "citationCount": 3,
                "date": "2023-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "EasyCGTree: a pipeline for prokaryotic phylogenomic analysis based on core gene sets"
            },
            "pmcid": "PMC10576351",
            "pmid": "37838689"
        }
    ],
    "toolType": [
        "Workflow"
    ],
    "topic": [
        {
            "term": "Microbiology",
            "uri": "http://edamontology.org/topic_3301"
        },
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        },
        {
            "term": "Phylogenomics",
            "uri": "http://edamontology.org/topic_0194"
        },
        {
            "term": "Sequence sites, features and motifs",
            "uri": "http://edamontology.org/topic_0160"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ]
}
