{
    "additionDate": "2020-01-14T09:00:44Z",
    "biotoolsCURIE": "biotools:SCGid",
    "biotoolsID": "SCGid",
    "confidence_flag": "tool",
    "description": "consensus approach to contig filtering and genome prediction from single cell sequencing libraries of uncultured eukaryotes.\n\nSCGid, a consensus approach to contig filtering and genome prediction from single-cell sequencing libraries.\n\nPlease note that this version of SCGid constitutes an early-release version that is currently under active development toward a stable version coinciding with the release of the accepted manuscript introduing it. I am now porting SCGid to python 3 and stabilizing it for full release as SCGid (v1.0) within the next few weeks. This development is taking place on a separate branch. In the mean time, this beta version is working and available for use. I am available to assist with any problems you run into while using this branch of SCGid as well as patch bugs. If you encounter a bug or confusing error while running the beta version of SCGid, please open an issue on this repositiory",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Filtering",
                    "uri": "http://edamontology.org/operation_3695"
                },
                {
                    "term": "Genome assembly",
                    "uri": "http://edamontology.org/operation_0525"
                },
                {
                    "term": "Scaffolding",
                    "uri": "http://edamontology.org/operation_3216"
                },
                {
                    "term": "Sequence trimming",
                    "uri": "http://edamontology.org/operation_3192"
                }
            ]
        }
    ],
    "homepage": "http://www.github.com/amsesk/SCGid",
    "language": [
        "Perl",
        "Python",
        "R"
    ],
    "lastUpdate": "2020-12-17T09:32:02Z",
    "license": "GPL-3.0",
    "name": "SCGid",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ866",
            "metadata": {
                "abstract": "© 2019 The Author(s). Published by Oxford University Press.Motivation: Whole-genome sequencing of uncultured eukaryotic genomes is complicated by difficulties in acquiring sufficient amounts of tissue. Single-cell genomics (SCG) by multiple displacement amplification provides a technical workaround, yielding whole-genome libraries which can be assembled de novo. Downsides of multiple displacement amplification include coverage biases and exacerbation of contamination. These factors affect assembly continuity and fidelity, complicating discrimination of genomes from contamination and noise by available tools. Uncultured eukaryotes and their relatives are often underrepresented in large sequence data repositories, further impairing identification and separation. Results: We compare the ability of filtering approaches to remove contamination and resolve eukaryotic draft genomes from SCG metagenomes, finding significant variation in outcomes. To address these inconsistencies, we introduce a consensus approach that is codified in the SCGid software package. SCGid parallelly filters assemblies using different approaches, yielding three intermediate drafts from which consensus is drawn. Using genuine and mock SCG metagenomes, we show that our approach corrects for variation among draft genomes predicted by individual approaches and outperforms them in recapitulating published drafts in a fast and repeatable way, providing a useful alternative to available methods and manual curation.",
                "authors": [
                    {
                        "name": "Amses K.R."
                    },
                    {
                        "name": "Davis W.J."
                    },
                    {
                        "name": "James T.Y."
                    }
                ],
                "date": "2020-04-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "SCGid: A consensus approach to contig filtering and genome prediction from single-cell sequencing libraries of uncultured eukaryotes"
            },
            "pmid": "31764940"
        }
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        }
    ],
    "validated": 1
}
