{
    "additionDate": "2021-01-18T07:32:03Z",
    "biotoolsCURIE": "biotools:ratemirs",
    "biotoolsID": "ratemirs",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "bushel@niehs.nih.gov",
            "name": "Pierre R. Bushel",
            "orcidid": "https://orcid.org/0000-0001-5188-8693",
            "typeEntity": "Person"
        }
    ],
    "description": "the rat atlas of tissue-specific and enriched miRNAs for discerning baseline expression exclusivity of candidate biomarkers.\n\nRat Atlas of Tissue-specific and Enriched miRs.\n\nRATEmiRs- a database of rat microRNA-Seq data in several tissues. \"Data Driven\" pipelines are available to detect tissue-specific and tissue-enriched miRs. \"User Driven\" entrez is available to enter a list of IDs of mature miRs. Organ-specific pipelines detects miRs that are specific for a particular set of tissues that comprise of an organ.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "miRNA expression analysis",
                    "uri": "http://edamontology.org/operation_3792"
                },
                {
                    "term": "miRNA target prediction",
                    "uri": "http://edamontology.org/operation_0463"
                }
            ]
        }
    ],
    "homepage": "https://www.niehs.nih.gov/ratemirs/",
    "lastUpdate": "2021-02-03T15:47:42Z",
    "name": "RATEmiRs",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1080/15476286.2020.1724715",
            "metadata": {
                "abstract": "© 2020, This work was authored as part of the Contributor’s official duties as an Employee of the United States Government and is therefore a work of the United States Government. In accordance with 17 U.S.C. 105, no copyright protection is available for such works under U.S. Law.MicroRNAs (miRNAs) are small RNAs that regulate mRNA expression and have been targeted as biomarkers of organ damage and disease. To explore the utility of miRNAs to assess injury to specific tissues, a tissue atlas of miRNA abundance was constructed. The Rat Atlas of Tissue-specific and Enriched miRNAs (RATEmiRs) catalogues miRNA sequencing data from 21 and 23 tissues in male and female Sprague-Dawley rats, respectively. RATEmiRs identifies tissue-enriched (TE), tissue-specific (TS), or organ-specific (OS) miRNAs via comparisons of one or more tissue or organ vs others. We provide a brief overview of RATEmiRs and present how to use it to detect miRNA expression abundance of candidate biomarkers as well as to compare the expression of miRNAs between rat and human. The database is available at https://www.niehs.nih.gov/ratemirs/.",
                "authors": [
                    {
                        "name": "Bushel P.R."
                    },
                    {
                        "name": "Caiment F."
                    },
                    {
                        "name": "Calley J."
                    },
                    {
                        "name": "Day F."
                    },
                    {
                        "name": "Harrill A.H."
                    },
                    {
                        "name": "Li J."
                    },
                    {
                        "name": "O'Lone R."
                    },
                    {
                        "name": "Smith A."
                    },
                    {
                        "name": "Wu H."
                    }
                ],
                "citationCount": 1,
                "date": "2020-05-03T00:00:00Z",
                "journal": "RNA Biology",
                "title": "RATEmiRs: the rat atlas of tissue-specific and enriched miRNAs for discerning baseline expression exclusivity of candidate biomarkers"
            },
            "pmcid": "PMC7237151",
            "pmid": "32009518"
        }
    ],
    "topic": [
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ]
}
