{
    "accessibility": "Open access",
    "additionDate": "2024-01-02T16:23:30.394470Z",
    "biotoolsCURIE": "biotools:ldrgdb",
    "biotoolsID": "ldrgdb",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "ckj522@yahoo.com",
            "name": "Chakresh Kumar Jain",
            "typeEntity": "Person"
        },
        {
            "email": "singh.nisha88@gmail.com",
            "name": "Nisha Singh",
            "typeEntity": "Person"
        }
    ],
    "description": "Legumes disease resistance genes database.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Gene expression QTL analysis",
                    "uri": "http://edamontology.org/operation_3232"
                },
                {
                    "term": "Genetic mapping",
                    "uri": "http://edamontology.org/operation_0282"
                }
            ]
        }
    ],
    "homepage": "https://ldrgdb.in/",
    "lastUpdate": "2024-11-24T14:24:48.691825Z",
    "name": "LDRGDb",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.3389/fpls.2023.1143111",
            "metadata": {
                "abstract": "Legumes comprise one of the world’s largest, most diverse, and economically important plant families, known for their nutritional and medicinal benefits. Legumes are susceptible to a wide range of diseases, similar to other agricultural crops. Diseases have a considerable impact on the production of legume crop species, resulting in large yield losses worldwide. Due to continuous interactions between plants and their pathogens in the environment and the evolution of new pathogens under high selection pressure; disease resistant genes emerge in plant cultivars in the field against those pathogens or disease. Thus, disease resistant genes play critical roles in plant resistance responses, and their discovery and subsequent use in breeding programmes aid in reducing yield loss. The genomic era, with its high-throughput and low-cost genomic tools, has revolutionised our understanding of the complex interactions between legumes and pathogens, resulting in the identification of several critical participants in both the resistant and susceptible relationships. However, a substantial amount of existing information about numerous legume species has been disseminated as text or is preserved across fractions in different databases, posing a challenge for researchers. As a result, the range, scope, and complexity of these resources pose challenges to those who manage and use them. Therefore, there is an urgent need to develop tools and a single conjugate database to manage genetic information for the world’s plant genetic resources, allowing for the rapid incorporation of essential resistance genes into breeding strategies. Here, developed the first comprehensive database of disease resistance genes named as LDRGDb - LEGUMES DISEASE RESISTANCE GENES DATABASE comprises 10 legumes [Pigeon pea (Cajanus cajan), Chickpea (Cicer arietinum), Soybean (Glycine max), Lentil (Lens culinaris), Alfalfa (Medicago sativa), Barrelclover (Medicago truncatula), Common bean (Phaseolus vulgaris), Pea (Pisum sativum),Faba bean (Vicia faba), and Cowpea (Vigna unguiculata)]. The LDRGDb is a user-friendly database developed by integrating a variety of tools and software that combine knowledge about resistant genes, QTLs, and their loci, with proteomics, pathway interactions, and genomics (https://ldrgdb.in/).",
                "authors": [
                    {
                        "name": "Agarwal A."
                    },
                    {
                        "name": "Jain C.K."
                    },
                    {
                        "name": "Kulshreshtha A."
                    },
                    {
                        "name": "Kumar A."
                    },
                    {
                        "name": "Saxena H."
                    },
                    {
                        "name": "Singh N."
                    }
                ],
                "date": "2023-01-01T00:00:00Z",
                "journal": "Frontiers in Plant Science",
                "title": "LDRGDb - Legumes disease resistance genes database"
            },
            "pmcid": "PMC10151526",
            "pmid": "37143876"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Agricultural science",
            "uri": "http://edamontology.org/topic_3810"
        },
        {
            "term": "Nutritional science",
            "uri": "http://edamontology.org/topic_3390"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        }
    ]
}
