
{
    "credit": [
        {
            "email": "shijia.zhu@mssm.edu",
            "name": "Shijia Zhu",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "User manual",
            "url": "https://github.com/fanglab/MatrixEpistasis/blob/master/vignettes/MatrixEpistasis-manual.pdf"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Gene expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "R"
        ],
        "license": "LGPL-3.0",
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Library"
        ],
        "topic": [
            {
                "term": "Genotype and phenotype",
                "uri": "http://edamontology.org/topic_0625"
            },
            {
                "term": "Sequence analysis",
                "uri": "http://edamontology.org/topic_0080"
            },
            {
                "term": "Quantitative genetics",
                "uri": "http://edamontology.org/topic_3055"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© The Author(s) 2018. Motivation: For many traits, causal loci uncovered by genetic mapping studies explain only a minority of the heritable contribution to trait variation. Multiple explanations for this 'missing heritability' have been proposed. Single nucleotide polymorphism (SNP)-SNP interaction (epistasis), as one of the compelling models, has been widely studied. However, the genome-wide scan of epistasis, especially for quantitative traits, poses huge computational challenges. Moreover, covariate adjustment is largely ignored in epistasis analysis due to the massive extra computational undertaking. Results: In the current study, we found striking differences among epistasis models using both simulation data and real biological data, suggesting that not only can covariate adjustment remove confounding bias, it can also improve power. Furthermore, we derived mathematical formulas, which enable the exhaustive epistasis scan together with full covariate adjustment to be expressed in terms of large matrix operation, therefore substantially improving the computational efficiency (104× faster than existing methods). We call the new method MatrixEpistasis. With MatrixEpistasis, we re-analyze a large real yeast dataset comprising 11 623 SNPs, 1008 segregants and 46 quantitative traits with covariates fully adjusted and detect thousands of novel putative epistasis with P-values<1.48e-10.",
            "authors": [
                "Zhu S.",
                "Fang G."
            ],
            "cit_count": 1,
            "doi": "10.1093/bioinformatics/bty094",
            "journal": "Bioinformatics",
            "title": "MatrixEpistasis: Ultrafast, exhaustive epistasis scan for quantitative traits with covariate adjustment",
            "year": "2018-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:matrixepistasis",
        "biotoolsID": "matrixepistasis",
        "description": "Ultrafast exhaustive epistasis scan for quantitative traits with covariate adjustment.",
        "homepage": "https://github.com/fanglab/MatrixEpistasis",
        "name": "MatrixEpistasis"
    }
}