{
    "additionDate": "2021-01-18T07:30:32Z",
    "biotoolsCURIE": "biotools:ncep",
    "biotoolsID": "ncep",
    "confidence_flag": "tool",
    "description": "A Manually Curated Database for Experimentally Validated ncRNA-encoded Proteins or Peptides.\n\nMore and more evidences have shown that non-coding RNAs (ncRNAs), such as lncRNAs, circRNAs and primary miRNAs, could encode proteins or peptides. ncEP is a database for collecting ncRNA-encoded proteins or peptides, which have been validated by low-throughput experiments from published papers. ncEP contains features of the proteins or peptides encoded by ncRNAs, including their names, sequences, species, genomic locations, tissues or cell lines, experimental methods, data source and other detailed information.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Validation",
                    "uri": "http://edamontology.org/operation_2428"
                },
                {
                    "term": "miRNA target prediction",
                    "uri": "http://edamontology.org/operation_0463"
                }
            ]
        }
    ],
    "homepage": "http://www.jianglab.cn/ncEP/",
    "lastUpdate": "2021-03-08T09:43:24Z",
    "name": "ncEP",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1016/J.JMB.2020.02.022",
            "metadata": {
                "abstract": "© 2020 Elsevier LtdNoncoding RNAs (ncRNAs), such as lncRNAs, circRNAs and pri-miRNAs, play important roles in physiological and pathological processes. Recently, it was demonstrated that they could encode proteins or peptides. However, relevant information is scattered across numerous published articles, which is inconvenient for the exploration of ncRNA translation by researchers. In this study, we presented an ncEP database, which records the low-throughput experimentally validated (LTEV) proteins or peptides encoded by ncRNAs, from published articles. Collectively, ncEP contains 80 entries including 74 proteins or peptides, 22 lncRNAs, 11 circRNAs, 9 pri-miRNAs and 37 other ncRNAs across 18 species from more than 50 articles of over 2000 candidate articles. We have provided a user-friendly interface for users to search, browse, visualize, download and submit data. In summary, ncEP provides a relatively comprehensive repository of the LTEV proteins or peptides encoded by ncRNAs and will enrich the knowledge for translation process. ncEP is freely available at http://www.jianglab.cn/ncEP/.",
                "authors": [
                    {
                        "name": "Liu H."
                    },
                    {
                        "name": "Zhou X."
                    },
                    {
                        "name": "Yuan M."
                    },
                    {
                        "name": "Zhou S."
                    },
                    {
                        "name": "Huang Y.-E."
                    },
                    {
                        "name": "Hou F."
                    },
                    {
                        "name": "Song X."
                    },
                    {
                        "name": "Wang L."
                    },
                    {
                        "name": "Jiang W."
                    }
                ],
                "citationCount": 11,
                "date": "2020-05-15T00:00:00Z",
                "journal": "Journal of Molecular Biology",
                "title": "ncEP: A Manually Curated Database for Experimentally Validated ncRNA-encoded Proteins or Peptides"
            },
            "pmid": "32105730"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Protein expression",
            "uri": "http://edamontology.org/topic_0108"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Data submission, annotation and curation",
            "uri": "http://edamontology.org/topic_0219"
        }
    ]
}