{
    "additionDate": "2021-01-18T08:35:54Z",
    "biotoolsCURIE": "biotools:cscape-somatic",
    "biotoolsID": "cscape-somatic",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "mark.f.rogers.phd@gmail.com",
            "name": "Mark F Rogers",
            "orcidid": "https://orcid.org/0000-0001-7886-0674",
            "typeEntity": "Person"
        },
        {
            "email": "C.Campbell@bristol.ac.uk",
            "name": "Colin Campbell",
            "orcidid": "https://orcid.org/0000-0002-6485-6014",
            "typeEntity": "Person"
        }
    ],
    "description": "CScape-somatic is a web tool for distinguishing driver and passenger point mutations in the cancer genome.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                }
            ]
        }
    ],
    "homepage": "http://CScape-somatic.biocompute.org.uk/",
    "lastUpdate": "2021-02-18T17:25:21Z",
    "name": "CScape-somatic",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAA242",
            "metadata": {
                "abstract": "© 2020 The Author(s) 2020. Published by Oxford University Press.Motivation: Next-generation sequencing technologies have accelerated the discovery of single nucleotide variants in the human genome, stimulating the development of predictors for classifying which of these variants are likely functional in disease, and which neutral. Recently, we proposed CScape, a method for discriminating between cancer driver mutations and presumed benign variants. For the neutral class, this method relied on benign germline variants found in the 1000 Genomes Project database. Discrimination could, therefore, be influenced by the distinction of germline versus somatic, rather than neutral versus disease driver. This motivates this article in which we consider predictive discrimination between recurrent and rare somatic single point mutations based solely on using cancer data, and the distinction between these two somatic classes and germline single point mutations. Results: For somatic point mutations in coding and non-coding regions of the genome, we propose CScape-somatic, an integrative classifier for predictively discriminating between recurrent and rare variants in the human cancer genome. In this study, we use purely cancer genome data and investigate the distinction between minimal occurrence and significantly recurrent somatic single point mutations in the human cancer genome. We show that this type of predictive distinction can give novel insight, and may deliver more meaningful prediction in both coding and non-coding regions of the cancer genome. Tested on somatic mutations, CScape-somatic outperforms alternative methods, reaching 74% balanced accuracy in coding regions and 69% in non-coding regions, whereas even higher accuracy may be achieved using thresholds to isolate high-confidence predictions. Contact: mark.f.rogers.phd@gmail.com or C.Campbell@bristol.ac.uk",
                "authors": [
                    {
                        "name": "Rogers M.F."
                    },
                    {
                        "name": "Gaunt T.R."
                    },
                    {
                        "name": "Campbell C."
                    }
                ],
                "citationCount": 2,
                "date": "2020-03-31T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "CScape-somatic: Distinguishing driver and passenger point mutations in the cancer genome"
            },
            "pmcid": "PMC7320610",
            "pmid": "32282885"
        }
    ],
    "topic": [
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ]
}