{
    "accessibility": "Open access",
    "additionDate": "2017-09-11T10:43:38Z",
    "biotoolsCURIE": "biotools:pickle",
    "biotoolsID": "pickle",
    "credit": [
        {
            "email": "n_moschonas@med.upatras.gr",
            "name": "Nicholas Moschonas",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.pickle.gr"
        },
        {
            "email": "mklapa@iceht.forth.gr",
            "name": "Maria Klapa",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.iceht.forth.gr/staff/klapa.html"
        }
    ],
    "description": "A human protein-protein interaction meta-database employing primary dataset integration via genetic information ontology, which allows the integrated network to be reversibly normalized to any level of genetic reference without loss of source information and enables primary PPI dataset cross-checking.",
    "documentation": [
        {
            "note": "The web portal of the meta-database",
            "type": [
                "General"
            ],
            "url": "http://www.pickle.gr"
        }
    ],
    "download": [
        {
            "note": "The current and archived PICKLE PPI datasets at the UniProt and gene levels can be freely downloaded from the PICKLE webpage.",
            "type": "Biological data",
            "url": "http://www.pickle.gr/Downloads"
        },
        {
            "note": "The current and archived PICKLE genetic information ontology networks are available in owl format.",
            "type": "Biological data",
            "url": "http://www.pickle.gr/Downloads"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "elixirNode": [
        "Greece"
    ],
    "elixirPlatform": [
        "Data"
    ],
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Protein name",
                        "uri": "http://edamontology.org/data_1009"
                    }
                },
                {
                    "data": {
                        "term": "Gene identifier",
                        "uri": "http://edamontology.org/data_1025"
                    },
                    "format": [
                        {
                            "term": "Textual format",
                            "uri": "http://edamontology.org/format_2330"
                        }
                    ]
                },
                {
                    "data": {
                        "term": "Ontology identifier",
                        "uri": "http://edamontology.org/data_2338"
                    }
                }
            ],
            "operation": [
                {
                    "term": "Protein interaction network analysis",
                    "uri": "http://edamontology.org/operation_0276"
                },
                {
                    "term": "Sorting",
                    "uri": "http://edamontology.org/operation_3802"
                },
                {
                    "term": "Filtering",
                    "uri": "http://edamontology.org/operation_3695"
                },
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                },
                {
                    "term": "Pathway or network visualisation",
                    "uri": "http://edamontology.org/operation_3083"
                }
            ]
        }
    ],
    "homepage": "http://www.pickle.gr",
    "language": [
        "C#"
    ],
    "lastUpdate": "2020-06-16T10:55:27Z",
    "link": [
        {
            "note": "Content available to any user with no restrictions\nCopyright: University of Patras & FORTH/ICE-HT, Greece",
            "type": [
                "Other"
            ],
            "url": "http://www.pickle.gr"
        }
    ],
    "maturity": "Emerging",
    "name": "PICKLE",
    "operatingSystem": [
        "Windows"
    ],
    "owner": "mklapa",
    "publication": [
        {
            "doi": "10.1186/1752-0509-7-96",
            "pmcid": "PMC5638325",
            "pmid": "24088582",
            "type": [
                "Other"
            ]
        },
        {
            "doi": "10.1371/journal.pone.0186039",
            "metadata": {
                "abstract": "© 2017 Gioutlakis et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.It has been acknowledged that source databases recording experimentally supported human protein-protein interactions (PPIs) exhibit limited overlap. Thus, the reconstruction of a comprehensive PPI network requires appropriate integration of multiple heterogeneous primary datasets, presenting the PPIs at various genetic reference levels. Existing PPI meta-databases perform integration via normalization; namely, PPIs are merged after converted to a certain target level. Hence, the node set of the integrated network depends each time on the number and type of the combined datasets. Moreover, the irreversible a priori normalization process hinders the identification of normalization artifacts in the integrated network, which originate from the nonlinearity characterizing the genetic information flow. PICKLE (Protein InteraCtion KnowLedgebasE) 2.0 implements a new architecture for this recently introduced human PPI meta-database. Its main novel feature over the existing meta-databases is its approach to primary PPI dataset integration via genetic information ontology. Building upon the PICKLE principles of using the reviewed human complete proteome (RHCP) of UniProtKB/Swiss-Prot as the reference protein interactor set, and filtering out protein interactions with low probability of being direct based on the available evidence, PICKLE 2.0 first assembles the RHCP genetic information ontology network by connecting the corresponding genes, nucleotide sequences (mRNAs) and proteins (UniProt entries) and then integrates PPI datasets by superimposing them on the ontology network without any a priori transformations. Importantly, this process allows the resulting heterogeneous integrated network to be reversibly normalized to any level of genetic reference without loss of the original information, the latter being used for identification of normalization biases, and enables the appraisal of potential false positive interactions through PPI source database cross-checking. The PICKLE web-based interface (www.pickle.gr) allows for the simultaneous query of multiple entities and provides integrated human PPI networks at either the protein (UniProt) or the gene level, at three PPI filtering modes.",
                "authors": [
                    {
                        "name": "Gioutlakis A."
                    },
                    {
                        "name": "Klapa M.I."
                    },
                    {
                        "name": "Moschonas N.K."
                    }
                ],
                "citationCount": 9,
                "date": "2017-10-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "PICKLE 2.0: A human protein-protein interaction meta-database employing data integration via genetic information ontology"
            },
            "pmid": "29023571",
            "type": [
                "Primary"
            ]
        },
        {
            "doi": "10.13140/RG.2.2.16985.21608",
            "type": [
                "Other"
            ]
        }
    ],
    "toolType": [
        "Web application",
        "Database portal"
    ],
    "topic": [
        {
            "term": "Systems biology",
            "uri": "http://edamontology.org/topic_2259"
        },
        {
            "term": "Human biology",
            "uri": "http://edamontology.org/topic_2815"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "Human genetics",
            "uri": "http://edamontology.org/topic_3574"
        },
        {
            "term": "Systems medicine",
            "uri": "http://edamontology.org/topic_3396"
        }
    ],
    "version": [
        "2.5"
    ]
}