{
    "accessibility": "Open access",
    "additionDate": "2017-09-11T10:43:38Z",
    "biotoolsCURIE": "biotools:pickle",
    "biotoolsID": "pickle",
    "credit": [
        {
            "email": "n_moschonas@med.upatras.gr",
            "name": "Nicholas Moschonas",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.pickle.gr"
        },
        {
            "email": "mklapa@iceht.forth.gr",
            "name": "Maria Klapa",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.iceht.forth.gr/staff/klapa.html"
        }
    ],
    "description": "PICKLE (Protein InteraCtion KnowLedgebasE) is a meta-database for the direct protein-protein interactome of the human and the mouse proteomes, integrating publicly available source protein-protein interaction (PPI) databases via genetic information ontology. PICKLE integrates the primary PPI datasets by superimposing them on the UniProtKB/Swiss-Prot reviewed complete proteome of the human (RHCP) and the mouse (RMCP) ontology network without any a priori transformations.",
    "documentation": [
        {
            "note": "The web portal of the meta-database",
            "type": [
                "General"
            ],
            "url": "http://www.pickle.gr"
        }
    ],
    "download": [
        {
            "note": "The current and archived PICKLE PPI datasets at the UniProt and gene levels can be freely downloaded from the PICKLE webpage.",
            "type": "Biological data",
            "url": "http://www.pickle.gr/Downloads",
            "version": "active and archived versions"
        },
        {
            "note": "The current and archived PICKLE genetic information ontology networks are available in owl format.",
            "type": "Biological data",
            "url": "http://www.pickle.gr/Downloads",
            "version": "active and archived versions"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "elixirNode": [
        "Greece"
    ],
    "elixirPlatform": [
        "Data"
    ],
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Protein name",
                        "uri": "http://edamontology.org/data_1009"
                    }
                },
                {
                    "data": {
                        "term": "Gene identifier",
                        "uri": "http://edamontology.org/data_1025"
                    },
                    "format": [
                        {
                            "term": "Textual format",
                            "uri": "http://edamontology.org/format_2330"
                        }
                    ]
                },
                {
                    "data": {
                        "term": "Ontology identifier",
                        "uri": "http://edamontology.org/data_2338"
                    }
                }
            ],
            "operation": [
                {
                    "term": "Protein interaction network analysis",
                    "uri": "http://edamontology.org/operation_0276"
                },
                {
                    "term": "Sorting",
                    "uri": "http://edamontology.org/operation_3802"
                },
                {
                    "term": "Filtering",
                    "uri": "http://edamontology.org/operation_3695"
                },
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                },
                {
                    "term": "Pathway or network visualisation",
                    "uri": "http://edamontology.org/operation_3083"
                }
            ]
        }
    ],
    "homepage": "http://www.pickle.gr",
    "language": [
        "C#"
    ],
    "lastUpdate": "2021-05-17T08:54:14.820643Z",
    "link": [
        {
            "note": "Content available to any user with no restrictions\nCopyright: University of Patras & FORTH/ICE-HT, Greece",
            "type": [
                "Other"
            ],
            "url": "http://www.pickle.gr"
        }
    ],
    "maturity": "Emerging",
    "name": "PICKLE",
    "operatingSystem": [
        "Windows"
    ],
    "owner": "mklapa",
    "publication": [
        {
            "doi": "10.1186/1752-0509-7-96",
            "metadata": {
                "abstract": "Background: Understanding the topology and dynamics of the human protein-protein interaction (PPI) network will significantly contribute to biomedical research, therefore its systematic reconstruction is required. Several meta-databases integrate source PPI datasets, but the protein node sets of their networks vary depending on the PPI data combined. Due to this inherent heterogeneity, the way in which the human PPI network expands via multiple dataset integration has not been comprehensively analyzed. We aim at assembling the human interactome in a global structured way and exploring it to gain insights of biological relevance. Results: First, we defined the UniProtKB manually reviewed human \" complete\" proteome as the reference protein-node set and then we mined five major source PPI datasets for direct PPIs exclusively between the reference proteins. We updated the protein and publication identifiers and normalized all PPIs to the UniProt identifier level. The reconstructed interactome covers approximately 60% of the human proteome and has a scale-free structure. No apparent differentiating gene functional classification characteristics were identified for the unrepresented proteins. The source dataset integration augments the network mainly in PPIs. Polyubiquitin emerged as the highest-degree node, but the inclusion of most of its identified PPIs may be reconsidered. The high number (>300) of connections of the subsequent fifteen proteins correlates well with their essential biological role. According to the power-law network structure, the unrepresented proteins should mainly have up to four connections with equally poorly-connected interactors. Conclusions: Reconstructing the human interactome based on the a priori definition of the protein nodes enabled us to identify the currently included part of the human \" complete\" proteome, and discuss the role of the proteins within the network topology with respect to their function. As the network expansion has to comply with the scale-free theory, we suggest that the core of the human interactome has essentially emerged. Thus, it could be employed in systems biology and biomedical research, despite the considerable number of currently unrepresented proteins. The latter are probably involved in specialized physiological conditions, justifying the scarcity of related PPI information, and their identification can assist in designing relevant functional experiments and targeted text mining algorithms. © 2013 Klapa et al.; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Klapa M.I."
                    },
                    {
                        "name": "Tsafou K."
                    },
                    {
                        "name": "Theodoridis E."
                    },
                    {
                        "name": "Tsakalidis A."
                    },
                    {
                        "name": "Moschonas N.K."
                    }
                ],
                "citationCount": 15,
                "date": "2013-10-02T00:00:00Z",
                "journal": "BMC Systems Biology",
                "title": "Reconstruction of the experimentally supported human protein interactome: What can we learn?"
            },
            "pmcid": "PMC5638325",
            "pmid": "24088582",
            "type": [
                "Primary"
            ],
            "version": "1.0"
        },
        {
            "doi": "10.1371/journal.pone.0186039",
            "metadata": {
                "abstract": "© 2017 Gioutlakis et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.It has been acknowledged that source databases recording experimentally supported human protein-protein interactions (PPIs) exhibit limited overlap. Thus, the reconstruction of a comprehensive PPI network requires appropriate integration of multiple heterogeneous primary datasets, presenting the PPIs at various genetic reference levels. Existing PPI meta-databases perform integration via normalization; namely, PPIs are merged after converted to a certain target level. Hence, the node set of the integrated network depends each time on the number and type of the combined datasets. Moreover, the irreversible a priori normalization process hinders the identification of normalization artifacts in the integrated network, which originate from the nonlinearity characterizing the genetic information flow. PICKLE (Protein InteraCtion KnowLedgebasE) 2.0 implements a new architecture for this recently introduced human PPI meta-database. Its main novel feature over the existing meta-databases is its approach to primary PPI dataset integration via genetic information ontology. Building upon the PICKLE principles of using the reviewed human complete proteome (RHCP) of UniProtKB/Swiss-Prot as the reference protein interactor set, and filtering out protein interactions with low probability of being direct based on the available evidence, PICKLE 2.0 first assembles the RHCP genetic information ontology network by connecting the corresponding genes, nucleotide sequences (mRNAs) and proteins (UniProt entries) and then integrates PPI datasets by superimposing them on the ontology network without any a priori transformations. Importantly, this process allows the resulting heterogeneous integrated network to be reversibly normalized to any level of genetic reference without loss of the original information, the latter being used for identification of normalization biases, and enables the appraisal of potential false positive interactions through PPI source database cross-checking. The PICKLE web-based interface (www.pickle.gr) allows for the simultaneous query of multiple entities and provides integrated human PPI networks at either the protein (UniProt) or the gene level, at three PPI filtering modes.",
                "authors": [
                    {
                        "name": "Gioutlakis A."
                    },
                    {
                        "name": "Klapa M.I."
                    },
                    {
                        "name": "Moschonas N.K."
                    }
                ],
                "citationCount": 18,
                "date": "2017-10-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "PICKLE 2.0: A human protein-protein interaction meta-database employing data integration via genetic information ontology"
            },
            "pmid": "29023571",
            "type": [
                "Primary"
            ],
            "version": "2.0"
        },
        {
            "doi": "10.13140/RG.2.2.16985.21608",
            "note": "Poster Presentation in the ELIXIR All Hands Meeting",
            "type": [
                "Other"
            ]
        },
        {
            "doi": "10.1093/bioinformatics/btaa1070",
            "note": "The PICKLE 3.0 upgrade refers to the enrichment of this human protein–protein interaction (PPI) meta-database with the mouse protein interactome.",
            "pmcid": "PMC8034533",
            "pmid": "33367505",
            "type": [
                "Method"
            ],
            "version": "3.0"
        }
    ],
    "toolType": [
        "Web application",
        "Database portal"
    ],
    "topic": [
        {
            "term": "Systems biology",
            "uri": "http://edamontology.org/topic_2259"
        },
        {
            "term": "Human biology",
            "uri": "http://edamontology.org/topic_2815"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "Human genetics",
            "uri": "http://edamontology.org/topic_3574"
        },
        {
            "term": "Systems medicine",
            "uri": "http://edamontology.org/topic_3396"
        }
    ],
    "validated": 1,
    "version": [
        "3.0"
    ]
}