
{
    "credit": [
        {
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://ccmbweb.ccv.brown.edu/"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Gibbs sampling",
                    "uri": "http://edamontology.org/operation_2238"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Alignment",
                    "uri": "http://edamontology.org/operation_2928"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Prediction",
                    "uri": "http://edamontology.org/operation_2423"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Perl",
            "Python"
        ],
        "operatingSystem": [
            "Linux",
            "Windows"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Sequences",
                "uri": "http://edamontology.org/topic_0080"
            },
            {
                "term": "Probability",
                "uri": "http://edamontology.org/topic_2269"
            },
            {
                "term": "RNA",
                "uri": "http://edamontology.org/topic_0099"
            },
            {
                "term": "samples",
                "uri": "http://edamontology.org/topic_3277"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/rnag-block-gibbs-sampler-rna-prediction.html"
        }
    ],
    "publication": [
        {
            "abstract": "Motivation: RNA secondary structure plays an important role in the function of many RNAs, and structural features are often key to their interaction with other cellular components. Thus, there has been considerable interest in the prediction of secondary structures for RNA families. In this article, we present a new global structural alignment algorithm, RNAG, to predict consensus secondary structures for unaligned sequences. It uses a blocked Gibbs sampling algorithm, which has a theoretical advantage in convergence time. This algorithm iteratively samples from the conditional probability distributions P(Structure | Alignment) and P(Alignment | Structure). Not surprisingly, there is considerable uncertainly in the high-dimensional space of this difficult problem, which has so far received limited attention in this field. We show how the samples drawn from this algorithm can be used to more fully characterize the posterior space and to assess the uncertainty of predictions. Results: Our analysis of three publically available datasets showed a substantial improvement in RNA structure prediction by RNAG over extant prediction methods. Additionally, our analysis of 17 RNA families showed that the RNAG sampled structures were generally compact around their ensemble centroids, and at least 11 families had at least two well-separated clusters of predicted structures. In general, the distance between a reference structure and our predicted structure was large relative to the variation among structures within an ensemble. © The Author(s) 2011. Published by Oxford University Press.",
            "authors": [
                "Wei D.",
                "Alpert L.V.",
                "Lawrence C.E."
            ],
            "cit_count": 18,
            "doi": "10.1093/bioinformatics/btr421",
            "journal": "Bioinformatics",
            "title": "RNAG: A new gibbs sampler for predicting RNA secondary structure for unaligned sequences",
            "type": "Primary",
            "year": "2011-09-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:rnag",
        "biotoolsID": "rnag",
        "description": "Predict consensus secondary structures for unaligned sequences. Uses a blocked Gibbs sampling algorithm that iteratively samples from the conditional probability distributions P(Structure | Alignment) and P(Alignment | Structure).",
        "homepage": "http://ccmbweb.ccv.brown.edu/rnag.html",
        "name": "RNAG"
    }
}