{
    "additionDate": "2016-04-22T13:36:54Z",
    "biotoolsCURIE": "biotools:irbis",
    "biotoolsID": "irbis",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Dmitri Pervouchine",
            "typeEntity": "Person",
            "typeRole": [
                "Developer"
            ]
        },
        {
            "name": "Lab Roderic Guigo Group",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        },
        {
            "name": "crg.eu",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        },
        {
            "email": "dp@crg.eu",
            "name": "Dmitri Pervouchine",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "A computational pipeline for detecting conserved complementary regions in unaligned orthologous sequences.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/pervouchine/irbis/blob/master/Manual/irbis-manual.pdf"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "https://github.com/pervouchine/irbis/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "note": "IRBIS is a computational pipeline for detecting conserved complementary regions in unaligned orthologous sequences. Unlike other methods, it follows the ``first-fold-then-align'' principle in which all possible combinations of complementary k-mers are searched for simultaneous conservation. The novel trimming procedure reduces the size of the search space and improves the performance to the point where large-scale analyses of intra- and intermolecular RNA-RNA interactions become possible.",
            "operation": [
                {
                    "term": "Prediction and recognition",
                    "uri": "http://edamontology.org/operation_2423"
                }
            ]
        }
    ],
    "homepage": "https://github.com/pervouchine/irbis/",
    "language": [
        "Perl",
        "C"
    ],
    "lastUpdate": "2018-12-10T12:58:52Z",
    "license": "AGPL-3.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/pervouchine/irbis/"
        }
    ],
    "name": "IRBIS",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "francisco.camara@crg.eu",
    "publication": [
        {
            "doi": "10.1261/rna.045088.114",
            "metadata": {
                "abstract": "© 2014 Pervouchine.IRBIS is a computational pipeline for detecting conserved complementary regions in unaligned orthologous sequences. Unlike other methods, it follows the \"first-fold-then-align\" principle in which all possible combinations of complementary k-mers are searched for simultaneous conservation. The novel trimming procedure reduces the size of the search space and improves the performance to the point where large-scale analyses of intra- and intermolecular RNA-RNA interactions become possible. In this article, I provide a rigorous description of the method, benchmarking on simulated and real data, and a set of stringent predictions of intramolecular RNA structure in placental mammals, drosophilids, and nematodes. I discuss two particular cases of long-range RNA structures that are likely to have a causal effect on single- and multiple-exon skipping, one in the mammalian gene Dystonin and the other in the insect gene Ca-α1D. In Dystonin, one of the two complementary boxes contains a binding site of Rbfox protein similar to one recently described in Enah gene. I also report that snoRNAs and long noncoding RNAs (lncRNAs) have a high capacity of base-pairing to introns of protein-coding genes, suggesting possible involvement of these transcripts in splicing regulation. I also find that conserved sequences that occur equally likely on both strands of DNA (e.g., transcription factor binding sites) contribute strongly to the false-discovery rate and, therefore, would confound every such analysis. IRBIS is an open-source software that is available at http://genome.crg.es/~dmitri/irbis/.",
                "authors": [
                    {
                        "name": "Pervouchine D.D."
                    }
                ],
                "citationCount": 6,
                "date": "2014-10-01T00:00:00Z",
                "journal": "RNA",
                "title": "IRBIS: A systematic search for conserved complementarity"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        }
    ],
    "validated": 1,
    "version": [
        "3.0"
    ]
}