{
    "accessibility": "Open access",
    "additionDate": "2019-06-26T08:34:21Z",
    "biotoolsCURIE": "biotools:Platon",
    "biotoolsID": "Platon",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Oliver Schwengers",
            "orcidid": "http://orcid.org/0000-0003-4216-2721",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact",
                "Developer",
                "Maintainer"
            ]
        },
        {
            "name": "DZIF",
            "typeEntity": "Consortium"
        },
        {
            "name": "de.NBI",
            "typeEntity": "Consortium"
        }
    ],
    "description": "Identification and characterization of bacterial plasmid contigs from short-read draft assemblies.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/oschwengers/platon"
        }
    ],
    "download": [
        {
            "note": "Pre-computed custom database necessary to execute PLATON.",
            "type": "Other",
            "url": "https://doi.org/10.5281/zenodo.3349651",
            "version": "v1.3.1"
        },
        {
            "type": "Software package",
            "url": "https://anaconda.org/bioconda/platon",
            "version": "v1.3.1"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "elixirNode": [
        "Germany"
    ],
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "DNA sequence",
                        "uri": "http://edamontology.org/data_3494"
                    },
                    "format": [
                        {
                            "term": "FASTA",
                            "uri": "http://edamontology.org/format_1929"
                        }
                    ]
                }
            ],
            "operation": [
                {
                    "term": "Sequence classification",
                    "uri": "http://edamontology.org/operation_2995"
                }
            ]
        }
    ],
    "homepage": "https://github.com/oschwengers/platon",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-06-29T09:13:27Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/oschwengers/platon"
        },
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/oschwengers/platon/issues"
        },
        {
            "note": "Necessary Database via Zenodo",
            "type": [
                "Other"
            ],
            "url": "https://doi.org/10.5281/zenodo.3349651"
        }
    ],
    "maturity": "Mature",
    "name": "Platon",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "oschwengers",
    "publication": [
        {
            "doi": "10.1099/mgen.0.000398",
            "metadata": {
                "abstract": "© 2020 The Authors.Plasmids are extrachromosomal genetic elements that replicate independently of the chromosome and play a vital role in the environmental adaptation of bacteria. Due to potential mobilization or conjugation capabilities, plasmids are important genetic vehicles for antimicrobial resistance genes and virulence factors with huge and increasing clinical implications. They are therefore subject to large genomic studies within the scientific community worldwide. As a result of rapidly improving next-generation sequencing methods, the quantity of sequenced bacterial genomes is constantly increasing, in turn raising the need for specialized tools to (i) extract plasmid sequences from draft assemblies, (ii) derive their origin and distribution, and (iii) further investigate their genetic repertoire. Recently, several bioinformatic methods and tools have emerged to tackle this issue; however, a combination of high sensitivity and specificity in plasmid sequence identification is rarely achieved in a taxon-independent manner. In addition, many software tools are not appropriate for large high-throughput analyses or cannot be included in existing software pipelines due to their technical design or software implementation. In this study, we investigated differences in the replicon distributions of protein-coding genes on a large scale as a new approach to distinguish plasmid-borne from chromosome-borne contigs. We defined and computed statistical discrimination thresholds for a new metric: the replicon distribution score (RDS), which achieved an accuracy of 96.6 %. The final performance was further improved by the combination of the RDS metric with heuristics exploiting several plasmid-specific higher-level contig characterizations. We implemented this workflow in a new high-throughput taxon-independent bioinformatics software tool called Platon for the recruitment and characterization of plasmid-borne contigs from short-read draft assemblies. Compared to PlasFlow, Platon achieved a higher accuracy (97.5 %) and more balanced predictions (F1=82.6 %) tested on a broad range of bacterial taxa and better or equal performance against the targeted tools PlasmidFinder and PlaScope on sequenced Escherichia coli isolates. Platon is available at: http:// platon. computational. bio/.",
                "authors": [
                    {
                        "name": "Schwengers O."
                    },
                    {
                        "name": "Barth P."
                    },
                    {
                        "name": "Falgenhauer L."
                    },
                    {
                        "name": "Hain T."
                    },
                    {
                        "name": "Chakraborty T."
                    },
                    {
                        "name": "Goesmann A."
                    }
                ],
                "date": "2020-01-01T00:00:00Z",
                "journal": "Microbial Genomics",
                "title": "Platon: Identification and characterization of bacterial plasmid contigs in short-read draft assemblies exploiting protein sequence-based replicon distribution scores"
            },
            "pmid": "32579097",
            "type": [
                "Primary"
            ],
            "version": "v1.3.1"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Mobile genetic elements",
            "uri": "http://edamontology.org/topic_0798"
        }
    ],
    "validated": 1,
    "version": [
        "1.4.0"
    ]
}