{
    "additionDate": "2017-08-03T18:55:25Z",
    "biotoolsCURIE": "biotools:pedigraph",
    "biotoolsID": "pedigraph",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://animalgene.umn.edu/"
        }
    ],
    "description": "Pedigraph is able to draw pedigrees with complex inbreeding structures over multiple generations in a population with a large number of individuals, as is common in animal populations.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://animalgene.umn.edu/pedigraph/license"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "homepage": "http://animalgene.umn.edu/pedigraph/index.html",
    "homepage_status": 1,
    "lastUpdate": "2018-12-10T12:58:50Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/pedigraph-2-4-draw-pedigrees.html"
        }
    ],
    "name": "Pedigraph",
    "operatingSystem": [
        "Windows"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Pedigree drawing is an essential tool in genetic and genealogical studies. A genetic analysis of a disease often starts with drawing a pedigree to show the overall population structure, the relationship among individuals, and gene flows from generation to generation. Such a graphical presentation of a pedigree is valuable for understanding the nature of the disease such as inheritance mode and familial trends and of the disease, for tracing the source of a detrimental gene, and for identifying the founders of the population. A genealogy study typically requires a pedigree drawing to show relationships among individuals. However, as the size and complexity of a pedigree increase, drawing a clear pedigree becomes a challenge. Pedigraph has been created to solve this problem. We developed a software tool named Pedigraph capable of creating artistic graphical pedigree drawings of large and complex populations with flexible options for pedigree analysis. Preliminary tests show that this software tool has great potential to be a useful tool for research in breeding, genetics and genomics in plants, animals, and zoo species, as well as a useful tool for studying history and human populations.",
                "authors": [
                    {
                        "name": "Garbe J.R."
                    },
                    {
                        "name": "Da Y."
                    }
                ],
                "citationCount": 4,
                "date": "2003-01-01T00:00:00Z",
                "journal": "Yi chuan xue bao = Acta genetica Sinica",
                "title": "A software tool for the graphical visualization of large and complex populations."
            },
            "pmid": "14986440"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        },
        {
            "term": "Zoology",
            "uri": "http://edamontology.org/topic_3500"
        }
    ],
    "validated": 1
}