{
    "additionDate": "2021-01-18T11:25:19Z",
    "biotoolsCURIE": "biotools:deeplyessential",
    "biotoolsID": "deeplyessential",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "mhasa006@ucr.edu",
            "name": "Md Abid Hasan",
            "typeEntity": "Person"
        }
    ],
    "description": "DeeplyEssential is a Deep neural network for the identification of Essential genes in bacteria species. The dataset used for the learning of the nework contains 30 bacterial species collected from DEG.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                },
                {
                    "term": "Homology-based gene prediction",
                    "uri": "http://edamontology.org/operation_3663"
                },
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                }
            ]
        }
    ],
    "homepage": "https://github.com/ucrbioinfo/DeeplyEssential",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-02-27T14:10:38Z",
    "name": "DeeplyEssential",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1186/S12859-020-03688-Y",
            "metadata": {
                "abstract": "© 2020 The Author(s).Background: Essential genes are those genes that are critical for the survival of an organism. The prediction of essential genes in bacteria can provide targets for the design of novel antibiotic compounds or antimicrobial strategies. Results: We propose a deep neural network for predicting essential genes in microbes. Our architecture called DeeplyEssential makes minimal assumptions about the input data (i.e., it only uses gene primary sequence and the corresponding protein sequence) to carry out the prediction thus maximizing its practical application compared to existing predictors that require structural or topological features which might not be readily available. We also expose and study a hidden performance bias that effected previous classifiers. Extensive results show that DeeplyEssential outperform existing classifiers that either employ down-sampling to balance the training set or use clustering to exclude multiple copies of orthologous genes. Conclusion: Deep neural network architectures can efficiently predict whether a microbial gene is essential (or not) using only its sequence information.",
                "authors": [
                    {
                        "name": "Hasan M.A."
                    },
                    {
                        "name": "Lonardi S."
                    }
                ],
                "citationCount": 5,
                "date": "2020-09-30T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "DeeplyEssential: A deep neural network for predicting essential genes in microbes"
            },
            "pmcid": "PMC7525945",
            "pmid": "32998698"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        }
    ]
}