{
    "additionDate": "2018-08-06T12:34:19Z",
    "biotoolsCURIE": "biotools:pharaoh-multi",
    "biotoolsID": "pharaoh-multi",
    "credit": [
        {
            "email": "biznok@gmail.com",
            "name": "Sungyoung Lee",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Pathway-based approach using HierArchical structure of collapsed RAre variants Of High-throughput sequencing data for Multiple phenotypes is a novel statistical approach for multivariate analysis of rare variants using pathway information. It is possible to investigate an association between multiple phenotypes and each pathway or entire pathways simultaneously, regarding the relatedness across entire pathways, using collapsed rare variants using gene information.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://statgen.snu.ac.kr/software/pharaoh-multi/?page_id=10"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Pathway analysis",
                    "uri": "http://edamontology.org/operation_2497"
                }
            ]
        }
    ],
    "homepage": "http://statgen.snu.ac.kr/software/pharaoh-multi/",
    "lastUpdate": "2018-12-10T12:59:01Z",
    "name": "PHARAOH-multi",
    "operatingSystem": [
        "Linux",
        "Windows"
    ],
    "owner": "shadi.m",
    "publication": [
        {
            "doi": "10.1186/s12859-018-2066-9",
            "metadata": {
                "abstract": "© 2018 The Author(s).Background: As one possible solution to the \"missing heritability\" problem, many methods have been proposed that apply pathway-based analyses, using rare variants that are detected by next generation sequencing technology. However, while a number of methods for pathway-based rare-variant analysis of multiple phenotypes have been proposed, no method considers a unified model that incorporate multiple pathways. Results: Simulation studies successfully demonstrated advantages of multivariate analysis, compared to univariate analysis, and comparison studies showed the proposed approach to outperform existing methods. Moreover, real data analysis of six type 2 diabetes-related traits, using large-scale whole exome sequencing data, identified significant pathways that were not found by univariate analysis. Furthermore, strong relationships between the identified pathways, and their associated metabolic disorder risk factors, were found via literature search, and one of the identified pathway, was successfully replicated by an analysis with an independent dataset. Conclusions: Herein, we present a powerful, pathway-based approach to investigate associations between multiple pathways and multiple phenotypes. By reflecting the natural hierarchy of biological behavior, and considering correlation between pathways and phenotypes, the proposed method is capable of analyzing multiple phenotypes and multiple pathways simultaneously.",
                "authors": [
                    {
                        "name": "Choi S."
                    },
                    {
                        "name": "Hwang H."
                    },
                    {
                        "name": "Kim Y."
                    },
                    {
                        "name": "Lee S."
                    },
                    {
                        "name": "Park T."
                    }
                ],
                "citationCount": 6,
                "date": "2018-05-08T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Pathway-based approach using hierarchical components of rare variants to analyze multiple phenotypes"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Next generation sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ],
    "validated": 1
}
