{
    "accessibility": "Open access",
    "additionDate": "2024-06-18T16:59:18.765225Z",
    "biotoolsCURIE": "biotools:pyaging",
    "biotoolsID": "pyaging",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "lpd27@cam.ac.uk",
            "name": "Lucas Paulo de Lima Camillo",
            "typeEntity": "Person"
        }
    ],
    "description": "pyaging is a cutting-edge Python package designed for the longevity research community, offering a comprehensive suite of GPU-optimized biological aging clocks.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://pyaging.readthedocs.io/en/latest/index.html"
        }
    ],
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Molecular model refinement",
                    "uri": "http://edamontology.org/operation_0322"
                },
                {
                    "term": "PTM site prediction",
                    "uri": "http://edamontology.org/operation_0417"
                }
            ]
        }
    ],
    "homepage": "https://github.com/rsinghlab/pyaging",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-06-18T16:59:18.767781Z",
    "license": "BSD-3-Clause",
    "name": "pyaging",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btae200",
            "metadata": {
                "abstract": "Motivation: Aging is intricately linked to diseases and mortality. It is reflected in molecular changes across various tissues which can be leveraged for the development of biomarkers of aging using machine learning models, known as aging clocks. Despite advancements in the field, a significant challenge remains: the lack of robust, Python-based software tools for integrating and comparing these diverse models. This gap highlights the need for comprehensive solutions that can handle the complexity and variety of data in aging research. Results: To address this gap, I introduce pyaging, a comprehensive open-source Python package designed to facilitate aging research. pyaging harmonizes dozens of aging clocks, covering a range of molecular data types such as DNA methylation, transcriptomics, histone mark ChIP-Seq, and ATAC-Seq. The package is not limited to traditional model types; it features a diverse array, from linear and principal component models to neural networks and automatic relevance determination models. Thanks to a PyTorch-based backend that enables GPU acceleration, pyaging is capable of rapid inference, even when dealing with large datasets and complex models. In addition, the package’s support for multi-species analysis extends its utility across various organisms, including humans, various mammals, and Caenorhabditis elegans. Availability and implementation: pyaging is accessible on GitHub, at https://github.com/rsinghlab/pyaging, and the distribution is available on PyPi, at https://pypi.org/project/pyaging/. The software is also archived on Zenodo, at https://zenodo.org/doi/10.5281/zenodo.10335011.",
                "authors": [
                    {
                        "name": "de Lima Camillo L.P."
                    }
                ],
                "date": "2024-04-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "pyaging: a Python-based compendium of GPU-optimized aging clocks"
            },
            "pmcid": "PMC11058068",
            "pmid": "38603598"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "ChIP-seq",
            "uri": "http://edamontology.org/topic_3169"
        },
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ]
}
