
{
    "credit": [
        {
            "email": "herman.debeukelaer@ugent.be",
            "name": "Herman De Beukelaer",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "https://github.com/corehunter/corehunter3/blob/master/README.md"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Generation",
                    "uri": "http://edamontology.org/operation_3429"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Optimisation and refinement",
                    "uri": "http://edamontology.org/operation_2425"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Java"
        ],
        "license": "Apache-2.0",
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Library",
            "Desktop application"
        ],
        "topic": [
            {
                "term": "Genotype and phenotype",
                "uri": "http://edamontology.org/topic_0625"
            }
        ]
    },
    "link": [
        {
            "type": "MIRROR",
            "url": "https://github.com/corehunter/corehunter3"
        }
    ],
    "publication": [
        {
            "abstract": "© 2018 The Author(s). Background: Core collections provide genebank curators and plant breeders a way to reduce size of their collections and populations, while minimizing impact on genetic diversity and allele frequency. Many methods have been proposed to generate core collections, often using distance metrics to quantify the similarity of two accessions, based on genetic marker data or phenotypic traits. Core Hunter is a multi-purpose core subset selection tool that uses local search algorithms to generate subsets relying on one or more metrics, including several distance metrics and allelic richness. Results: In version 3 of Core Hunter (CH3) we have incorporated two new, improved methods for summarizing distances to quantify diversity or representativeness of the core collection. A comparison of CH3 and Core Hunter 2 (CH2) showed that these new metrics can be effectively optimized with less complex algorithms, as compared to those used in CH2. CH3 is more effective at maximizing the improved diversity metric than CH2, still ensures a high average and minimum distance, and is faster for large datasets. Using CH3, a simple stochastic hill-climber is able to find highly diverse core collections, and the more advanced parallel tempering algorithm further increases the quality of the core and further reduces variability across independent samples. We also evaluate the ability of CH3 to simultaneously maximize diversity, and either representativeness or allelic richness, and compare the results with those of the GDOpt and SimEli methods. CH3 can sample equally representative cores as GDOpt, which was specifically designed for this purpose, and is able to construct cores that are simultaneously more diverse, and either are more representative or have higher allelic richness, than those obtained by SimEli. Conclusions: In version 3, Core Hunter has been updated to include two new core subset selection metrics that construct cores for representativeness or diversity, with improved performance. It combines and outperforms the strengths of other methods, as it (simultaneously) optimizes a variety of metrics. In addition, CH3 is an improvement over CH2, with the option to use genetic marker data or phenotypic traits, or both, and improved speed. Core Hunter 3 is freely available on http://www.corehunter.org.",
            "authors": [
                "De Beukelaer H.",
                "Davenport G.F.",
                "Fack V."
            ],
            "cit_count": 2,
            "doi": "10.1186/s12859-018-2209-z",
            "journal": "BMC Bioinformatics",
            "title": "Core Hunter 3: Flexible core subset selection",
            "type": "Primary",
            "year": "2018-05-31"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:core_hunter",
        "biotoolsID": "core_hunter",
        "description": "Core Hunter is a flexible tool to sample diverse, representative subsets from large germplasm collections, with minimum redundancy. Such so-called core collections have applications in plant breeding and genetic resource management in general.In addition, CH3 is an improvement over CH2, with the option to use genetic marker data or phenotypic traits, or both, and improved speed.",
        "homepage": "http://www.corehunter.org",
        "name": "Core Hunter",
        "version": [
            "3.0"
        ]
    }
}