{
    "accessibility": "Open access",
    "additionDate": "2023-01-18T23:06:10.846569Z",
    "biotoolsCURIE": "biotools:deeppervar",
    "biotoolsID": "deeppervar",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "chen61@iu.edu",
            "name": "Li Chen",
            "orcidid": "http://orcid.org/0000-0001-9372-5606",
            "typeEntity": "Person"
        },
        {
            "name": "Ye Wang"
        }
    ],
    "description": "A multimodal deep learning framework for functional interpretation of genetic variants in personal genome.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Collapsing methods",
                    "uri": "http://edamontology.org/operation_3791"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Variant effect prediction",
                    "uri": "http://edamontology.org/operation_0331"
                },
                {
                    "term": "Variant prioritisation",
                    "uri": "http://edamontology.org/operation_3226"
                }
            ]
        }
    ],
    "homepage": "https://github.com/lichen-lab/DeepPerVar",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T15:11:35.928882Z",
    "license": "Not licensed",
    "name": "DeepPerVar",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btac696",
            "metadata": {
                "abstract": "Motivation: Understanding the functional consequence of genetic variants, especially the non-coding ones, is important but particularly challenging. Genome-wide association studies (GWAS) or quantitative trait locus analyses may be subject to limited statistical power and linkage disequilibrium, and thus are less optimal to pinpoint the causal variants. Moreover, most existing machine-learning approaches, which exploit the functional annotations to interpret and prioritize putative causal variants, cannot accommodate the heterogeneity of personal genetic variations and traits in a population study, targeting a specific disease. Results: By leveraging paired whole-genome sequencing data and epigenetic functional assays in a population study, we propose a multi-modal deep learning framework to predict genome-wide quantitative epigenetic signals by considering both personal genetic variations and traits. The proposed approach can further evaluate the functional consequence of non-coding variants on an individual level by quantifying the allelic difference of predicted epigenetic signals. By applying the approach to the ROSMAP cohort studying Alzheimer's disease (AD), we demonstrate that the proposed approach can accurately predict quantitative genome-wide epigenetic signals and in key genomic regions of AD causal genes, learn canonical motifs reported to regulate gene expression of AD causal genes, improve the partitioning heritability analysis and prioritize putative causal variants in a GWAS risk locus. Finally, we release the proposed deep learning model as a stand-alone Python toolkit and a web server.",
                "authors": [
                    {
                        "name": "Chen L."
                    },
                    {
                        "name": "Wang Y."
                    }
                ],
                "citationCount": 5,
                "date": "2022-12-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "DeepPerVar: A multi-modal deep learning framework for functional interpretation of genetic variants in personal genome"
            },
            "pmcid": "PMC9750124",
            "pmid": "36271868"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        },
        {
            "term": "GWAS study",
            "uri": "http://edamontology.org/topic_3517"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        }
    ],
    "validated": 1
}
