{
    "additionDate": "2021-01-18T12:21:55Z",
    "biotoolsCURIE": "biotools:bsnet",
    "biotoolsID": "bsnet",
    "confidence_flag": "tool",
    "description": "Bi-Similarity Network (BSNet) consists of a single embedding module and a bi-similarity module of two similarity measures. After the support images and the query images pass through the convolution-based embedding module, the bi-similarity module learns feature maps according to two similarity measures of diverse characteristics.",
    "editPermission": {
        "type": "private"
    },
    "homepage": "https://github.com/PRIS-CV/BSNet",
    "lastUpdate": "2021-02-06T20:21:41Z",
    "name": "BSNet",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1109/TIP.2020.3043128",
            "metadata": {
                "abstract": "© 1992-2012 IEEE.Few-shot learning for fine-grained image classification has gained recent attention in computer vision. Among the approaches for few-shot learning, due to the simplicity and effectiveness, metric-based methods are favorably state-of-the-art on many tasks. Most of the metric-based methods assume a single similarity measure and thus obtain a single feature space. However, if samples can simultaneously be well classified via two distinct similarity measures, the samples within a class can distribute more compactly in a smaller feature space, producing more discriminative feature maps. Motivated by this, we propose a so-called Bi-Similarity Network (BSNet) that consists of a single embedding module and a bi-similarity module of two similarity measures. After the support images and the query images pass through the convolution-based embedding module, the bi-similarity module learns feature maps according to two similarity measures of diverse characteristics. In this way, the model is enabled to learn more discriminative and less similarity-biased features from few shots of fine-grained images, such that the model generalization ability can be significantly improved. Through extensive experiments by slightly modifying established metric/similarity based networks, we show that the proposed approach produces a substantial improvement on several fine-grained image benchmark datasets. Codes are available at: https://github.com/PRIS-CV/BSNet.",
                "authors": [
                    {
                        "name": "Cao J."
                    },
                    {
                        "name": "Li X."
                    },
                    {
                        "name": "Ma Z."
                    },
                    {
                        "name": "Sun Z."
                    },
                    {
                        "name": "Wu J."
                    },
                    {
                        "name": "Xue J.-H."
                    }
                ],
                "citationCount": 1,
                "date": "2021-01-01T00:00:00Z",
                "journal": "IEEE Transactions on Image Processing",
                "title": "BSNet: Bi-Similarity Network for Few-shot Fine-grained Image Classification"
            },
            "pmid": "33315565"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        }
    ]
}
