{
    "additionDate": "2021-01-18T11:51:10Z",
    "biotoolsCURIE": "biotools:clusterm",
    "biotoolsID": "clusterm",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "xqian@ece.tamu.edu",
            "name": "Xiaoning Qian",
            "typeEntity": "Person"
        }
    ],
    "description": "a scalable algorithm for computational prediction of conserved protein complexes across multiple protein interaction networks.\n\nSource Code and Supplementary Materials for ClusterM.\n\n· The relevant files can be found in the [zip] file.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein interaction network prediction",
                    "uri": "http://edamontology.org/operation_3094"
                },
                {
                    "term": "Protein interaction network analysis",
                    "uri": "http://edamontology.org/operation_0276"
                },
                {
                    "term": "Protein interaction prediction",
                    "uri": "http://edamontology.org/operation_2492"
                }
            ]
        }
    ],
    "homepage": "http://www.ece.tamu.edu/~xqian/ClusterM/",
    "lastUpdate": "2021-02-12T16:12:10Z",
    "name": "ClusterM",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1186/S12864-020-07010-1",
            "metadata": {
                "abstract": "© 2020, The Author(s).Background: The current computational methods on identifying conserved protein complexes across multiple Protein-Protein Interaction (PPI) networks suffer from the lack of explicit modeling of the desired topological properties within conserved protein complexes as well as their scalability. Results: To overcome those issues, we propose a scalable algorithm—ClusterM—for identifying conserved protein complexes across multiple PPI networks through the integration of network topology and protein sequence similarity information. ClusterM overcomes the computational barrier that existed in previous methods, where the complexity escalates exponentially when handling an increasing number of PPI networks; and it is able to detect conserved protein complexes with both topological separability and cohesive protein sequence conservation. On two independent compendiums of PPI networks from Saccharomyces cerevisiae (Sce, yeast), Drosophila melanogaster (Dme, fruit fly), Caenorhabditis elegans (Cel, worm), and Homo sapiens (Hsa, human), we demonstrate that ClusterM outperforms other state-of-the-art algorithms by a significant margin and is able to identify de novo conserved protein complexes across four species that are missed by existing algorithms. Conclusions: ClusterM can better capture the desired topological property of a typical conserved protein complex, which is densely connected within the complex while being well-separated from the rest of the networks. Furthermore, our experiments have shown that ClusterM is highly scalable and efficient when analyzing multiple PPI networks.",
                "authors": [
                    {
                        "name": "Wang Y."
                    },
                    {
                        "name": "Jeong H."
                    },
                    {
                        "name": "Yoon B.-J."
                    },
                    {
                        "name": "Qian X."
                    }
                ],
                "date": "2020-11-01T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "ClusterM: a scalable algorithm for computational prediction of conserved protein complexes across multiple protein interaction networks"
            },
            "pmcid": "PMC7677834",
            "pmid": "33208103"
        }
    ],
    "topic": [
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Protein expression",
            "uri": "http://edamontology.org/topic_0108"
        },
        {
            "term": "Sequence sites, features and motifs",
            "uri": "http://edamontology.org/topic_0160"
        }
    ]
}