{
    "additionDate": "2021-01-18T08:15:16Z",
    "biotoolsCURIE": "biotools:cena",
    "biotoolsID": "cena",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "iritgv@gmail.com",
            "name": "Irit Gat-Viks",
            "typeEntity": "Person"
        }
    ],
    "description": "CEllular Niche Association (CENA) is a method for a joint identification of pairwise association together with the particular subset of cells in which the association is detected. In this implementation, CENA is limited to associations between the genes' expression levels (data from scRNA-sequencing) and an additional cellular meta-data of choice.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Scatter plot plotting",
                    "uri": "http://edamontology.org/operation_2940"
                }
            ]
        }
    ],
    "homepage": "https://github.com/mayalevy/CENA",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-02-10T20:36:57Z",
    "name": "CENA",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAA151",
            "metadata": {
                "abstract": "© 2020 The Author(s) 2020. Published by Oxford University Press. All rights reserved. For permissions, please e-mail: journals.permissions@oup.com.Motivation: Cell-to-cell variation has uncovered associations between cellular phenotypes. However, it remains challenging to address the cellular diversity of such associations. Results: Here, we do not rely on the conventional assumption that the same association holds throughout the entire cell population. Instead, we assume that associations may exist in a certain subset of the cells. We developed CEllular Niche Association (CENA) to reliably predict pairwise associations together with the cell subsets in which the associations are detected. CENA does not rely on predefined subsets but only requires that the cells of each predicted subset would share a certain characteristic state. CENA may therefore reveal dynamic modulation of dependencies along cellular trajectories of temporally evolving states. Using simulated data, we show the advantage of CENA over existing methods and its scalability to a large number of cells. Application of CENA to real biological data demonstrates dynamic changes in associations that would be otherwise masked. Contact: iritgv@gmail.com",
                "authors": [
                    {
                        "name": "Levy M."
                    },
                    {
                        "name": "Frishberg A."
                    },
                    {
                        "name": "Gat-Viks I."
                    }
                ],
                "date": "2020-06-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Inferring cellular heterogeneity of associations from single cell genomics"
            },
            "pmid": "32129824"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        }
    ]
}