{
    "additionDate": "2021-01-18T09:53:52Z",
    "biotoolsCURIE": "biotools:eccparacorp",
    "biotoolsID": "eccparacorp",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "qian.qing@imicams.ac.cn",
            "name": "Qing Qian",
            "typeEntity": "Person"
        },
        {
            "email": "prof.jiehe@gmail.com",
            "name": "Jie He",
            "typeEntity": "Person"
        }
    ],
    "description": "English-Chinese Cancer Parallel Corpus (ECParaCorp) is a database involving information of 6 cancers in three different themes: cancer prevention, cancer screening and cancer treatment.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Parsing",
                    "uri": "http://edamontology.org/operation_1812"
                }
            ]
        }
    ],
    "homepage": "http://www.phoc.org.cn/ECCParaCorp/",
    "lastUpdate": "2021-03-05T15:22:38Z",
    "name": "ECCParaCorp",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1186/S12911-020-1116-1",
            "metadata": {
                "abstract": "© 2020 The Author(s).Background: The increasing global cancer incidence corresponds to serious health impact in countries worldwide. Knowledge-powered health system in different languages would enhance clinicians' healthcare practice, patients' health management and public health literacy. High-quality corpus containing cancer information is the necessary foundation of cancer education. Massive non-structural information resources exist in clinical narratives, electronic health records (EHR) etc. They can only be used for training AI models after being transformed into structured corpus. However, the scarcity of multilingual cancer corpus limits the intelligent processing, such as machine translation in medical scenarios. Thus, we created the cancer specific cross-lingual corpus and open it to the public for academic use. Methods: Aiming to build an English-Chinese cancer parallel corpus, we developed a workflow of seven steps including data retrieval, data parsing, data processing, corpus implementation, assessment verification, corpus release, and application. We applied the workflow to a cross-lingual, comprehensive and authoritative cancer information resource, PDQ (Physician Data Query). We constructed, validated and released the parallel corpus named as ECCParaCorp, made it openly accessible online. Results: The proposed English-Chinese Cancer Parallel Corpus (ECCParaCorp) consists of 6685 aligned text pairs in Xml, Excel, Csv format, containing 5190 sentence pairs, 1083 phrase pairs and 412 word pairs, which involved information of 6 cancers including breast cancer, liver cancer, lung cancer, esophageal cancer, colorectal cancer, and stomach cancer, and 3 cancer themes containing cancer prevention, screening, and treatment. All data in the parallel corpus are online, available for users to browse and download (http://www.phoc.org.cn/ECCParaCorp/). Conclusions: ECCParaCorp is a parallel corpus focused on cancer in a cross-lingual form, which is openly accessible. It would make up the imbalance of scarce multilingual corpus resources, bridge the gap between human readable information and machine understanding data resources, and would contribute to intelligent technology application as a preparatory data foundation e.g. cancer-related machine translation, cancer system development towards medical education, and disease-oriented knowledge extraction.",
                "authors": [
                    {
                        "name": "Ma H."
                    },
                    {
                        "name": "Yang F."
                    },
                    {
                        "name": "Ren J."
                    },
                    {
                        "name": "Li N."
                    },
                    {
                        "name": "Dai M."
                    },
                    {
                        "name": "Wang X."
                    },
                    {
                        "name": "Fang A."
                    },
                    {
                        "name": "Li J."
                    },
                    {
                        "name": "Qian Q."
                    },
                    {
                        "name": "He J."
                    }
                ],
                "date": "2020-07-09T00:00:00Z",
                "journal": "BMC Medical Informatics and Decision Making",
                "title": "ECCParaCorp: A cross-lingual parallel corpus towards cancer education, dissemination and application"
            },
            "pmcid": "PMC7346326",
            "pmid": "32646415"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Medical informatics",
            "uri": "http://edamontology.org/topic_3063"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        }
    ]
}