
{
    "credit": [
        {
            "email": "exj13@case.edu",
            "name": "Eckhard Jankowsky",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Structure database search",
                    "uri": "http://edamontology.org/operation_0339"
                },
                {
                    "term": "Structural similarity search",
                    "uri": "http://edamontology.org/operation_0360"
                },
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Database portal"
        ],
        "topic": [
            {
                "term": "RNA",
                "uri": "http://edamontology.org/topic_0099"
            },
            {
                "term": "Model organisms",
                "uri": "http://edamontology.org/topic_0621"
            },
            {
                "term": "Functional, regulatory and non-coding RNA",
                "uri": "http://edamontology.org/topic_0659"
            },
            {
                "term": "Nucleic acid structure analysis",
                "uri": "http://edamontology.org/topic_0097"
            }
        ]
    },
    "publication": [
        {
            "abstract": "RNA helicases are ubiquitous and essential enzymes that function in nearly all aspects of RNA metabolism. The RNA helicase database (www .rnahelicase.org) integrates the wealth of accumulating information on RNA helicases in a readily accessible format. The database is a portal that allows straightforward retrieval of comprehensive information on sequence, structure and on biochemical and cellular functions of all RNA helicases from the most widely used model organisms Escherichia coli, Saccharomyces cerevisiae, Caenorhabditis elegans, Drosophila melanogaster, mouse and human. Also included are RNA helicases from other organisms that are subject to specific investigation. The database is structured according to the most recent helicase classification into helicase superfamilies (SFs) and families, and thus emphasizes phyologenetic relations between RNA helicases as well. Information on individual RNA helicases can be accessed through various browsing routes or through text-based searches of the database. © The Author(s) 2010.",
            "authors": [
                "Jankowsky A.",
                "Guenther U.-P.",
                "Jankowsky E."
            ],
            "cit_count": 33,
            "journal": "Nucleic Acids Research",
            "pmid": "21112871",
            "title": "The RNA helicase database",
            "year": "2011-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:rna_helicase_database",
        "biotoolsID": "rna_helicase_database",
        "description": "Integrates information on RNA helicases. The database allows retrieval of comprehensive information on sequence, structure and on biochemical and cellular functions of all RNA helicases from the most widely used model organisms Escherichia coli, Saccharomyces cerevisiae, Caenorhabditis elegans, Drosophila melanogaster, mouse and human. The database is structured according to the most recent helicase classification into helicase superfamilies and families, emphasizes phyologenetic relations.",
        "homepage": "http://www.rnahelicase.org",
        "name": "RNA helicase database"
    }
}