{
    "additionDate": "2015-01-22T11:40:45Z",
    "biotoolsCURIE": "biotools:micrographite",
    "biotoolsID": "micrographite",
    "credit": [
        {
            "name": "ELIXIR-ITA-PADOVA",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        },
        {
            "email": "chiara.romualdi@unipd.it",
            "name": "Chiara Romualdi",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://romualdi.bio.unipd.it/"
        }
    ],
    "description": "R package for topological pathway analysis integrating gene and miRNA expression profiles using validated and/or predicted miRNA-target interactions. It is based on updated versions of graphite and CliPPER Bioconductor packages dedicated to pathway analyses recently proposed by our group.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://romualdi.bio.unipd.it/micrographite"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "note": "R package. It provides a list of functions to integrate validated and predicted miRNAs into graphite pathway topologies. It takes as input an expression matrix with matched miRNA and gene expression data (divided into two classes of samples) and a list of graphs (pathways). Then it performs a recursive topological pathway analysis, giving back the circuit associated the most to the phenotype",
            "operation": [
                {
                    "term": "Pathway or network analysis",
                    "uri": "http://edamontology.org/operation_2497"
                }
            ]
        }
    ],
    "homepage": "http://romualdi.bio.unipd.it/micrographite",
    "language": [
        "R"
    ],
    "lastUpdate": "2019-01-10T05:26:02Z",
    "license": "AGPL-3.0",
    "name": "micrographite",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "ELIXIR-ITA-PADOVA",
    "publication": [
        {
            "doi": "10.1093/nar/gku354",
            "metadata": {
                "abstract": "The production rate of gene expression data is nothing less than astounding. However, with the benefit of hindsight we can assert that, since we completely ignored the non-coding part of the transcriptome, we spent the last decade to study cell mechanisms having few data in our hands. In this scenario, microRNAs, which are key post-trascriptional regulators, deserve special attention. Given the state of knowledge about their biogenesis, mechanisms of action and the numerous experimentally validated target genes, miRNAs are also gradually appearing in the formal pathway representations such as KEGG and Reactome maps. However, the number of miRNAs annotated in pathway maps are very few and pathway analyses exploiting this new regulatory layer are still lacking. To fill these gaps, we present 'micrographite' a new pipeline to perform topological pathway analysis integrating gene and miRNA expression profiles. Here, micrographite is used to study and dissect the epithelial ovarian cancer gene and miRNA transcriptome defining and validating a new regulatory circuit related to ovarian cancer histotype specificity. © 2014 The Author(s) 2014.",
                "authors": [
                    {
                        "name": "Calura E."
                    },
                    {
                        "name": "Martini P."
                    },
                    {
                        "name": "Sales G."
                    },
                    {
                        "name": "Beltrame L."
                    },
                    {
                        "name": "Chiorino G."
                    },
                    {
                        "name": "D'Incalci M."
                    },
                    {
                        "name": "Marchini S."
                    },
                    {
                        "name": "Romualdi C."
                    }
                ],
                "citationCount": 28,
                "date": "2014-06-17T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "Wiring miRNAs to pathways: A topological approach to integrate miRNA and mRNA expression profiles"
            },
            "pmcid": "PMC4066781",
            "pmid": "24803669",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Functional genomics",
            "uri": "http://edamontology.org/topic_0085"
        }
    ],
    "validated": 1,
    "version": [
        "4.0"
    ]
}