{
    "accessibility": "Open access",
    "additionDate": "2022-03-07T09:55:29.293524Z",
    "biotoolsCURIE": "biotools:epifilter",
    "biotoolsID": "epifilter",
    "collectionID": [
        "COVID-19"
    ],
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "k.parag@imperial.ac.uk",
            "name": "Kris V. Parag",
            "orcidid": "https://orcid.org/0000-0002-7806-3605",
            "typeEntity": "Person"
        }
    ],
    "description": "Improved estimation of time-varying reproduction numbers at low case incidence and between epidemic waves.\n\nMain functions: epiFilter (or epiFilterSm) performs forward filtering to generate causal R estimates; epiSmooth performs backward smoothing to generate R estimates that use all possible information and recursPredict provides one-step-ahead predictions.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Filtering",
                    "uri": "http://edamontology.org/operation_3695"
                },
                {
                    "term": "Incident curve plotting",
                    "uri": "http://edamontology.org/operation_3503"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/kpzoo/EpiFilter",
    "language": [
        "MATLAB",
        "R"
    ],
    "lastUpdate": "2022-03-07T09:55:29.296127Z",
    "name": "EpiFilter",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PCBI.1009347",
            "metadata": {
                "abstract": "Copyright: © 2021 Kris V. Parag. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.We construct a recursive Bayesian smoother, termed EpiFilter, for estimating the effective reproduction number, R, from the incidence of an infectious disease in real time and retrospectively. Our approach borrows from Kalman filtering theory, is quick and easy to compute, generalisable, deterministic and unlike many current methods, requires no change-point or window size assumptions. We model R as a flexible, hidden Markov state process and exactly solve forward-backward algorithms, to derive R estimates that incorporate all available incidence information. This unifies and extends two popular methods, EpiEstim, which considers past incidence, and the Wallinga-Teunis method, which looks forward in time. We find that this combination of maximising information and minimising assumptions significantly reduces the bias and variance of R estimates. Moreover, these properties make EpiFilter more statistically robust in periods of low incidence, where several existing methods can become destabilised. As a result, EpiFilter offers improved inference of time-varying transmission patterns that are advantageous for assessing the risk of upcoming waves of infection or the influence of interventions, in real time and at various spatial scales.",
                "authors": [
                    {
                        "name": "Parag K.V."
                    }
                ],
                "citationCount": 2,
                "date": "2021-09-01T00:00:00Z",
                "journal": "PLoS Computational Biology",
                "title": "Improved estimation of time-varying reproduction numbers at low case incidence and between epidemic waves"
            },
            "pmcid": "PMC8448340",
            "pmid": "34492011"
        }
    ],
    "toolType": [
        "Workbench"
    ],
    "topic": [
        {
            "term": "Infectious disease",
            "uri": "http://edamontology.org/topic_3324"
        },
        {
            "term": "Public health and epidemiology",
            "uri": "http://edamontology.org/topic_3305"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ]
}
