{
    "additionDate": "2021-03-19T08:57:31Z",
    "biotoolsCURIE": "biotools:toxpanel",
    "biotoolsID": "toxpanel",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "pschyman@bhsai.org",
            "name": "Patric Schyman",
            "typeEntity": "Person"
        }
    ],
    "description": "A Gene-Set Analysis Tool to Assess Liver and Kidney Injuries.\n\nToxPanel is a web-based platform to calculate activation scores for liver and kidney injury gene sets for genome-wide analysis by using aggregated gene set fold-change values. Users can either apply our predefined gene sets to identify liver and kidney injury phenotypes or upload their own gene sets.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                },
                {
                    "term": "Gene-set enrichment analysis",
                    "uri": "http://edamontology.org/operation_2436"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://toxpanel.bhsai.org",
    "lastUpdate": "2021-04-23T16:49:19Z",
    "name": "ToxPanel",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.3389/FPHAR.2021.601511",
            "metadata": {
                "abstract": "© Copyright © 2021 Schyman, Xu, Desai and Wallqvist.Gene-set analysis is commonly used to identify trends in gene expression when cells, tissues, organs, or organisms are subjected to conditions that differ from those within the normal physiological range. However, tools for gene-set analysis to assess liver and kidney injury responses are less common. Furthermore, most websites for gene-set analysis lack the option for users to customize their gene-set database. Here, we present the ToxPanel website, which allows users to perform gene-set analysis to assess liver and kidney injuries using activation scores based on gene-expression fold-change values. The results are graphically presented to assess constituent injury phenotypes (histopathology), with interactive result tables that identify the main contributing genes to a given signal. In addition, ToxPanel offers the flexibility to analyze any set of custom genes based on gene fold-change values. ToxPanel is publically available online at https://toxpanel.bhsai.org. ToxPanel allows users to access our previously developed liver and kidney injury gene sets, which we have shown in previous work to yield robust results that correlate with the degree of injury. Users can also test and validate their customized gene sets using the ToxPanel website.",
                "authors": [
                    {
                        "name": "Desai V."
                    },
                    {
                        "name": "Schyman P."
                    },
                    {
                        "name": "Wallqvist A."
                    },
                    {
                        "name": "Xu Z."
                    }
                ],
                "date": "2021-02-09T00:00:00Z",
                "journal": "Frontiers in Pharmacology",
                "title": "TOXPANEL: A Gene-Set Analysis Tool to Assess Liver and Kidney Injuries"
            },
            "pmcid": "PMC7900624",
            "pmid": "33633572"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Physiology",
            "uri": "http://edamontology.org/topic_3300"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Toxicology",
            "uri": "http://edamontology.org/topic_2840"
        }
    ]
}
