{
    "accessibility": "Open access",
    "additionDate": "2022-04-22T12:20:29.525482Z",
    "biotoolsCURIE": "biotools:mixkernel",
    "biotoolsID": "mixkernel",
    "cost": "Free of charge",
    "description": "Kernel-based methods are powerful methods for integrating heterogeneous types of data. mixKernel aims at providing methods to combine kernel for unsupervised exploratory analysis. Different solutions are provided to compute a meta-kernel, in a consensus way or in a way that best preserves the original topology of the data. mixKernel also integrates kernel PCA to visualize similarities between samples in a non linear space and from the multiple source point of view. Functions to assess and display important variables are also provided in the package.",
    "documentation": [
        {
            "type": [
                "Installation instructions"
            ],
            "url": "http://mixkernel.clementine.wf/articles/a-mixKernelInstallation.html"
        },
        {
            "type": [
                "Training material"
            ],
            "url": "http://mixkernel.clementine.wf/articles/mixKernelUsersGuide.html"
        },
        {
            "type": [
                "User manual"
            ],
            "url": "http://mixkernel.clementine.wf/reference/index.html"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "https://cran.r-project.org/web/packages/mixKernel/index.html",
            "version": "0.8"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "homepage": "http://mixkernel.clementine.wf/",
    "language": [
        "Python",
        "R"
    ],
    "lastUpdate": "2024-11-24T20:10:12.680733Z",
    "license": "GPL-3.0",
    "maturity": "Mature",
    "name": "mixKernel",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "tuxette",
    "publication": [
        {
            "doi": "10.1093/nargab/lqac014",
            "metadata": {
                "abstract": "The substantial development of high-throughput biotechnologies has rendered large-scale multi-omics datasets increasingly available. New challenges have emerged to process and integrate this large volume of information, often obtained from widely heterogeneous sources. Kernel methods have proven successful to handle the analysis of different types of datasets obtained on the same individuals. However, they usually suffer from a lack of interpretability since the original description of the individuals is lost due to the kernel embedding. We propose novel feature selection methods that are adapted to the kernel framework and go beyond the well-established work in supervised learning by addressing the more difficult tasks of unsupervised learning and kernel output learning. The method is expressed under the form of a non-convex optimization problem with a 1 penalty, which is solved with a proximal gradient descent approach. It is tested on several systems biology datasets and shows good performances in selecting relevant and less redundant features compared to existing alternatives. It also proved relevant for identifying important governmental measures best explaining the time series of Covid-19 reproducing number evolution during the first months of 2020. The proposed feature selection method is embedded in the R package mixKernel version 0.8, published on CRAN. Installation instructions are available at http://mixkernel.clementine.wf/.",
                "authors": [
                    {
                        "name": "Brouard C."
                    },
                    {
                        "name": "Flamary R."
                    },
                    {
                        "name": "Mariette J."
                    },
                    {
                        "name": "Vialaneix N."
                    }
                ],
                "citationCount": 6,
                "date": "2022-03-01T00:00:00Z",
                "journal": "NAR Genomics and Bioinformatics",
                "title": "Feature selection for kernel methods in systems biology"
            },
            "pmcid": "PMC8900155",
            "pmid": "35265835",
            "type": [
                "Method"
            ]
        },
        {
            "doi": "10.1093/bioinformatics/btx682",
            "metadata": {
                "abstract": "Motivation Recent high-throughput sequencing advances have expanded the breadth of available omics datasets and the integrated analysis of multiple datasets obtained on the same samples has allowed to gain important insights in a wide range of applications. However, the integration of various sources of information remains a challenge for systems biology since produced datasets are often of heterogeneous types, with the need of developing generic methods to take their different specificities into account. Results We propose a multiple kernel framework that allows to integrate multiple datasets of various types into a single exploratory analysis. Several solutions are provided to learn either a consensus meta-kernel or a meta-kernel that preserves the original topology of the datasets. We applied our framework to analyse two public multi-omics datasets. First, the multiple metagenomic datasets, collected during the TARA Oceans expedition, was explored to demonstrate that our method is able to retrieve previous findings in a single kernel PCA as well as to provide a new image of the sample structures when a larger number of datasets are included in the analysis. To perform this analysis, a generic procedure is also proposed to improve the interpretability of the kernel PCA in regards with the original data. Second, the multi-omics breast cancer datasets, provided by The Cancer Genome Atlas, is analysed using a kernel Self-Organizing Maps with both single and multi-omics strategies. The comparison of these two approaches demonstrates the benefit of our integration method to improve the representation of the studied biological system. Availability and implementation Proposed methods are available in the R package mixKernel, released on CRAN. It is fully compatible with the mixOmics package and a tutorial describing the approach can be found on mixOmics web site http://mixomics.org/mixkernel/. Contact jerome.mariette@inra.fr or nathalie.villa-vialaneix@inra.fr Supplementary informationSupplementary dataare available at Bioinformatics online.",
                "authors": [
                    {
                        "name": "Mariette J."
                    },
                    {
                        "name": "Villa-Vialaneix N."
                    }
                ],
                "citationCount": 69,
                "date": "2018-03-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Unsupervised multiple kernel learning for heterogeneous data integration"
            },
            "pmid": "29077792",
            "type": [
                "Method"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Applied mathematics",
            "uri": "http://edamontology.org/topic_3569"
        },
        {
            "term": "Computational biology",
            "uri": "http://edamontology.org/topic_3307"
        },
        {
            "term": "Omics",
            "uri": "http://edamontology.org/topic_3391"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ],
    "version": [
        "0.8"
    ]
}
