{
    "additionDate": "2021-10-09T19:16:45.753600Z",
    "biotoolsCURIE": "biotools:metapred",
    "biotoolsID": "metapred",
    "confidence_flag": "tool",
    "description": "MetaPred is a meta-learning framework for Clinical Risk Prediction using limited patient Electronic Health Records (EHRs).",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Fold recognition",
                    "uri": "http://edamontology.org/operation_0303"
                },
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "https://github.com/sheryl-ai/MetaPred",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-10-09T19:16:45.756329Z",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/sheryl-ai/MetaPred/issues"
        }
    ],
    "name": "MetaPred",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1145/3292500.3330779",
            "metadata": {
                "abstract": "© 2019 Copyright is held by the owner/author(s). Publication rights licensed to ACM.In recent years, large amounts of health data, such as patient Electronic Health Records (EHR), are becoming readily available. This provides an unprecedented opportunity for knowledge discovery and data mining algorithms to dig insights from them, which can, later on, be helpful to the improvement of the quality of care delivery. Predictive modeling of clinical risks, including in-hospital mortality, hospital readmission, chronic disease onset, condition exacerbation, etc., from patient EHR, is one of the health data analytic problems that attract lots of the interests. The reason is not only because the problem is important in clinical settings, but also is challenging when working with EHR such as sparsity, irregularity, temporality, etc. Different from applications in other domains such as computer vision and natural language processing, the data samples in medicine (patients) are relatively limited, which creates lots of troubles for building effective predictive models, especially for complicated ones such as deep learning. In this paper, we propose MetaPred, a meta-learning framework for clinical risk prediction from longitudinal patient EHR. In particular, in order to predict the target risk with limited data samples, we train a meta-learner from a set of related risk prediction tasks which learns how a good predictor is trained. The meta-learned can then be directly used in target risk prediction, and the limited available samples in the target domain can be used for further fine-tuning the model performance. The effectiveness of MetaPred is tested on a real patient EHR repository from Oregon Health & Science University. We are able to demonstrate that with Convolutional Neural Network (CNN) and Recurrent Neural Network (RNN) as base predictors, MetaPred can achieve much better performance for predicting target risk with low resources comparing with the predictor trained on the limited samples available for this risk alone.",
                "authors": [
                    {
                        "name": "Dodge H.H."
                    },
                    {
                        "name": "Tang F."
                    },
                    {
                        "name": "Wang F."
                    },
                    {
                        "name": "Zhang X.S."
                    },
                    {
                        "name": "Zhou J."
                    }
                ],
                "citationCount": 17,
                "date": "2019-07-25T00:00:00Z",
                "journal": "Proceedings of the ACM SIGKDD International Conference on Knowledge Discovery and Data Mining",
                "title": "Metapred: Meta-learning for clinical risk prediction with limited patient electronic health records"
            },
            "pmcid": "PMC8046258",
            "pmid": "33859865",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Script",
        "Workbench"
    ],
    "topic": [
        {
            "term": "Biomedical science",
            "uri": "http://edamontology.org/topic_3344"
        },
        {
            "term": "Data mining",
            "uri": "http://edamontology.org/topic_3473"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Medical informatics",
            "uri": "http://edamontology.org/topic_3063"
        },
        {
            "term": "Medicine",
            "uri": "http://edamontology.org/topic_3303"
        }
    ]
}
