{
    "additionDate": "2019-11-14T18:25:02Z",
    "biotoolsCURIE": "biotools:EpiSmokEr",
    "biotoolsID": "EpiSmokEr",
    "confidence_flag": "tool",
    "description": "A robust classifier to determine smoking status from DNA methylation data | Aim: Smoking strongly influences DNA methylation, with current and never smokers exhibiting different methylation profiles. Methods: To advance the practical applicability of the smoking-associated methylation signals, we used machine learning methodology to train a classifier for smoking status prediction. Results: We show the prediction performance of our classifier on three independent whole-blood datasets demonstrating its robustness and global applicability. Furthermore, we examine the reasons for biologically meaningful misclassifications through comprehensive phenotypic evaluation. Conclusion: The major contribution of our classifier is its global applicability without a need for users to determine a threshold value for each dataset to predict the smoking status",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Post-translation modification site prediction",
                    "uri": "http://edamontology.org/operation_0417"
                }
            ]
        }
    ],
    "homepage": "https://github.com/sailalithabollepalli/EpiSmokEr",
    "language": [
        "R"
    ],
    "lastUpdate": "2020-12-25T15:31:00Z",
    "name": "EpiSmokEr",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.2217/EPI-2019-0206",
            "metadata": {
                "abstract": "© 2019 Future Medicine Ltd.Aim: Smoking strongly influences DNA methylation, with current and never smokers exhibiting different methylation profiles. Methods: To advance the practical applicability of the smoking-associated methylation signals, we used machine learning methodology to train a classifier for smoking status prediction. Results: We show the prediction performance of our classifier on three independent whole-blood datasets demonstrating its robustness and global applicability. Furthermore, we examine the reasons for biologically meaningful misclassifications through comprehensive phenotypic evaluation. Conclusion: The major contribution of our classifier is its global applicability without a need for users to determine a threshold value for each dataset to predict the smoking status. We provide an R package, EpiSmokEr (Epigenetic Smoking status Estimator), facilitating the use of our classifier to predict smoking status in future studies.",
                "authors": [
                    {
                        "name": "Anders S."
                    },
                    {
                        "name": "Bollepalli S."
                    },
                    {
                        "name": "Kaprio J."
                    },
                    {
                        "name": "Korhonen T."
                    },
                    {
                        "name": "Ollikainen M."
                    }
                ],
                "citationCount": 8,
                "date": "2019-10-01T00:00:00Z",
                "journal": "Epigenomics",
                "title": "EpiSmokEr: A robust classifier to determine smoking status from DNA methylation data"
            },
            "pmid": "31466478"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        },
        {
            "term": "Methylated DNA immunoprecipitation",
            "uri": "http://edamontology.org/topic_3674"
        }
    ],
    "validated": 1
}
