{
    "accessibility": "Open access (with restrictions)",
    "additionDate": "2021-05-05T10:51:33Z",
    "biotoolsCURIE": "biotools:simbiology-tmdd-model",
    "biotoolsID": "simbiology-tmdd-model",
    "collectionID": [
        "MATLAB",
        "File Exchange"
    ],
    "cost": "Free of charge (with restrictions)",
    "credit": [
        {
            "name": "Fulden Buyukozturk",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://www.mathworks.com/matlabcentral/profile/4222845-fulden-buyukozturk"
        }
    ],
    "description": "SimBiology MATLAB implementation of the Target-Mediated Drug Disposition (TMDD) model.",
    "download": [
        {
            "type": "Screenshot",
            "url": "https://www.mathworks.com//matlabcentral/mlc-downloads/downloads/submissions/32926/versions/2/screenshot.png"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "homepage": "https://www.mathworks.com/matlabcentral/fileexchange/32926-simbiology-model-for-target-mediated-drug-disposition-tmdd",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2021-05-13T17:23:58Z",
    "name": "SimBiology model for Target-Mediated Drug Disposition (TMDD)",
    "operatingSystem": [
        "Windows",
        "Linux",
        "Mac"
    ],
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1023/A:1014414520282",
            "metadata": {
                "abstract": "Drugs that bind with high affinity and to a significant extent (relative to dose) to a pharmacologic target such as an enzyme, receptor, or transporter may exhibit nonlinear pharmacokinetic (PK) behavior. Processes such as receptor-mediated endocytosis may result in drug elimination. A general PK model for characterizing such behavior is described and explored through computer simulations and applications to several therapeutic agents. Simulations show that model predicted plasma concentration vs. time profiles are expected to be polyexponential with steeper distribution phases for lower doses and similar terminal disposition phases. Noncompartmental parameters always show apparent Vss and CLD decreasing with dose, but apparent clearance decreases only when the binding process produces drug elimination. The proposed model well captured the time-course of drug concentrations for the aldose reductase inhibitor imirestat, the endothelin receptor antagonist bosentan, and recombinant human interferon-β 1a. This type of model has a mechanistic basis and considerable utility for fully describing the kinetics for various doses of relevant drugs.",
                "authors": [
                    {
                        "name": "Mager D.E."
                    },
                    {
                        "name": "Jusko W.J."
                    }
                ],
                "citationCount": 392,
                "date": "2001-12-01T00:00:00Z",
                "journal": "Journal of Pharmacokinetics and Pharmacodynamics",
                "title": "General pharmacokinetic model for drugs exhibiting target-mediated drug disposition"
            }
        }
    ],
    "toolType": [
        "Library"
    ],
    "version": [
        "1.0.0.1"
    ]
}