{
    "accessibility": "Open access",
    "additionDate": "2022-01-20T23:02:10.591895Z",
    "biotoolsCURIE": "biotools:vgea",
    "biotoolsID": "vgea",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "happic@run.edu.ng",
            "name": "Christian T. Happi",
            "typeEntity": "Person"
        },
        {
            "name": "Fehintola Ajogbasile"
        },
        {
            "name": "Judith Oguzie"
        },
        {
            "name": "Paul E. Oluniyi"
        }
    ],
    "description": "VGEA (Viral Genomes Easily Analyzed) is a pipeline for analysis of RNA virus next-generation sequencing data.",
    "download": [
        {
            "type": "Source code",
            "url": "https://github.com/pauloluniyi/VGEA/releases/tag/v1.1"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genome indexing",
                    "uri": "http://edamontology.org/operation_3211"
                },
                {
                    "term": "Read pre-processing",
                    "uri": "http://edamontology.org/operation_3219"
                },
                {
                    "term": "Sequence assembly",
                    "uri": "http://edamontology.org/operation_0310"
                },
                {
                    "term": "Sequence trimming",
                    "uri": "http://edamontology.org/operation_3192"
                }
            ]
        }
    ],
    "homepage": "https://github.com/pauloluniyi/VGEA",
    "language": [
        "Python",
        "Shell"
    ],
    "lastUpdate": "2022-01-20T23:02:10.595061Z",
    "license": "GPL-3.0",
    "name": "VGEA",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.7717/PEERJ.12129",
            "metadata": {
                "abstract": "Copyright 2021 Oluniyi et al.Next generation sequencing (NGS)-based studies have vastly increased our understanding of viral diversity. Viral sequence data obtained from NGS experiments are a rich source of information, these data can be used to study their epidemiology, evolution, transmission patterns, and can also inform drug and vaccine design. Viral genomes, however, represent a great challenge to bioinformatics due to their high mutation rate and forming quasispecies in the same infected host, bringing about the need to implement advanced bioinformatics tools to assemble consensus genomes well-representative of the viral population circulating in individual patients. Many tools have been developed to preprocess sequencing reads, carry-out de novo or reference-assisted assembly of viral genomes and assess the quality of the genomes obtained. Most of these tools however exist as standalone workflows and usually require huge computational resources. Here we present (Viral Genomes Easily Analyzed), a Snakemake workflow for analyzing RNA viral genomes. VGEA enables users to map sequencing reads to the human genome to remove human contaminants, split bam files into forward and reverse reads, carry out de novo assembly of forward and reverse reads to generate contigs, pre-process reads for quality and contamination, map reads to a reference tailored to the sample using corrected contigs supplemented by the user’s choice of reference sequences and evaluate/compare genome assemblies. We designed a project with the aim of creating a flexible, easy-to-use and all-in-one pipeline from existing/stand-alone bioinformatics tools for viral genome analysis that can be deployed on a personal computer. VGEA was built on the Snakemake workflow management system and utilizes existing tools for each step: fastp (Chen et al., 2018) for read trimming and read-level quality control, BWA (Li & Durbin, 2009) for mapping sequencing reads to the human reference genome, SAMtools (Li et al., 2009) for extracting unmapped reads and also for splitting bam files into fastq files, IVA (Hunt et al., 2015) for de novo assembly to generate contigs, shiver (Wymant et al., 2018) to pre-process reads for quality and contamination, then map to a reference tailored to the sample using corrected contigs supplemented with the user’s choice of existing reference sequences, SeqKit (Shen et al., 2016) for cleaning shiver assembly for QUAST, QUAST (Gurevich et al., 2013) to evaluate/assess the quality of genome assemblies and MultiQC (Ewels et al., 2016) for aggregation of the results from fastp, BWA and QUAST. Our pipeline was successfully tested and validated with SARS-CoV-2 (n = 20), HIV-1 (n = 20) and Lassa Virus (n = 20) datasets all of which have been made publicly available. VGEA is freely available on GitHub at: https://github.com/pauloluniyi/VGEA under the GNU General Public License.",
                "authors": [
                    {
                        "name": "Ajogbasile F."
                    },
                    {
                        "name": "Eromon P.E."
                    },
                    {
                        "name": "Folarin O."
                    },
                    {
                        "name": "Frost S.D.W."
                    },
                    {
                        "name": "Happi A."
                    },
                    {
                        "name": "Happi C.T."
                    },
                    {
                        "name": "Heeney J."
                    },
                    {
                        "name": "Kayode A."
                    },
                    {
                        "name": "Ogunsanya O."
                    },
                    {
                        "name": "Oguzie J."
                    },
                    {
                        "name": "Olumade T."
                    },
                    {
                        "name": "Oluniyi P.E."
                    },
                    {
                        "name": "Ugwu A."
                    },
                    {
                        "name": "Uwanibe J."
                    }
                ],
                "date": "2021-09-06T00:00:00Z",
                "journal": "PeerJ",
                "title": "VGEA: An RNA viral assembly toolkit"
            },
            "pmcid": "PMC8428259",
            "pmid": "34567846"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        },
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Virology",
            "uri": "http://edamontology.org/topic_0781"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ],
    "validated": 1
}
