
{
    "credit": [
        {
            "email": "dmpi@duke.edu",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://dmpi.duke.edu/"
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://dmpi.duke.edu/x-lrt"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Virulence prediction",
                    "uri": "http://edamontology.org/operation_3461"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Windows"
        ],
        "toolType": [
            "Desktop application"
        ],
        "topic": [
            {
                "term": "Pathology",
                "uri": "http://edamontology.org/topic_0634"
            },
            {
                "term": "Genetics",
                "uri": "http://edamontology.org/topic_3053"
            },
            {
                "term": "Biomarkers",
                "uri": "http://edamontology.org/topic_3360"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://www.mybiosoftware.com/x-lrt-1-0-estimate-genetic-risks-test-association-x-linked-markers.html"
        }
    ],
    "publication": [
        {
            "abstract": "Recently, there has been interest in family-based tests of association to identify X-chromosome genes. However, none of the approaches allow for estimation of genetic risks. We propose a likelihood approach to estimate disease-related marker relative risks and test genotype association using a case-parents design. The test uses nuclear families with a single affected proband and allows additional siblings and missing parental genotypes. Extension to a haplotype test is based on assumptions of random mating and multiplicative penetrance. We investigate power and type I error rate of the likelihood-based test, using simulated data and apply our method to marker data from the monoamine oxidase A&B genes in families with Parkinson disease. We show how efficiency with missing parental information can be improved with additional sibling genotype information. Our likelihood approach offers great flexibility for testing different penetrance relationships within and between sexes. In addition, estimation of disease-related marker relative risks provides a measure of the magnitude of X-linked genetic effects on complex disorders. © 2008 Wiley-Liss, Inc.",
            "authors": [
                "Zhang L.",
                "Martin E.R.",
                "Chung R.-H.",
                "Li Y.-J.",
                "Morris R.W."
            ],
            "cit_count": 10,
            "journal": "Genetic Epidemiology",
            "pmid": "18278816",
            "title": "X-LRT: A likelihood approach to estimate genetic risks and test association with X-linked markers using a case-parents design",
            "year": "2008-05-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:x-lrt",
        "biotoolsID": "x-lrt",
        "description": "Suite of family-based tests for detecting association of X-chromosome genes. This is a likelihood-based approach which can perform hypothesis testing as well as estimation of disease-related marker relative risks under a case-parent design. This test uses nuclear family with a single affected proband and allows additional siblings and missing parental genotypes. This program can test both single marker and haplotypes association.",
        "homepage": "http://dmpi.duke.edu/x-lrt",
        "name": "X-LRT"
    }
}