{
    "additionDate": "2022-11-02T07:53:38.905195Z",
    "biotoolsCURIE": "biotools:diffeoraptor",
    "biotoolsID": "diffeoraptor",
    "confidence_flag": "tool",
    "credit": [
        {
            "name": "Nima Masoumi"
        },
        {
            "name": "Yiming Xiao"
        }
    ],
    "description": "DiffeoRaptor, a diffeomorphic inter-modal/contrast image registration algorithm based on RaPTOR and geodesic shooting in bandlimited space.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/nimamasoumi/DiffeoRaptor",
    "lastUpdate": "2024-11-24T15:24:13.393098Z",
    "license": "Not licensed",
    "name": "DiffeoRaptor",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1007/s11548-022-02749-2",
            "metadata": {
                "abstract": "Purpose: Diffeomorphic image registration is essential in many medical imaging applications. Several registration algorithms of such type have been proposed, but primarily for intra-contrast alignment. Currently, efficient inter-modal/contrast diffeomorphic registration, which is vital in numerous applications, remains a challenging task. Methods: We proposed a novel inter-modal/contrast registration algorithm that leverages Robust PaTch-based cOrrelation Ratio metric to allow inter-modal/contrast image alignment and bandlimited geodesic shooting demonstrated in Fourier-Approximated Lie Algebras (FLASH) algorithm for fast diffeomorphic registration. Results: The proposed algorithm, named DiffeoRaptor, was validated with three public databases for the tasks of brain and abdominal image registration while comparing the results against three state-of-the-art techniques, including FLASH, NiftyReg, and Symmetric image Normalization (SyN). Conclusions: Our results demonstrated that DiffeoRaptor offered comparable or better registration performance in terms of registration accuracy. Moreover, DiffeoRaptor produces smoother deformations than SyN in inter-modal and contrast registration. The code for DiffeoRaptor is publicly available at https://github.com/nimamasoumi/DiffeoRaptor.",
                "authors": [
                    {
                        "name": "Ahmad M.O."
                    },
                    {
                        "name": "Masoumi N."
                    },
                    {
                        "name": "Rivaz H."
                    },
                    {
                        "name": "Xiao Y."
                    }
                ],
                "date": "2023-02-01T00:00:00Z",
                "journal": "International Journal of Computer Assisted Radiology and Surgery",
                "title": "DiffeoRaptor: diffeomorphic inter-modal image registration using RaPTOR"
            },
            "pmid": "36173541"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        },
        {
            "term": "Structure analysis",
            "uri": "http://edamontology.org/topic_0081"
        }
    ],
    "validated": 1
}
