{
    "additionDate": "2021-01-18T07:08:08Z",
    "biotoolsCURIE": "biotools:nbzimm",
    "biotoolsID": "nbzimm",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "nyi@uab.edu",
            "name": "Nengjun Yi",
            "typeEntity": "Person"
        }
    ],
    "description": "Fast zero-inflated negative binomial mixed modeling approach for analyzing longitudinal metagenomics data.\n\nNBZIMM: Negative Binomial and Zero-Inflated Mixed Models, with Applications to Microbiome Data Analysis.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Modelling and simulation",
                    "uri": "http://edamontology.org/operation_2426"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "http://github.com//nyiuab//NBZIMM",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-03-08T09:38:20Z",
    "name": "NBZIMM",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ973",
            "metadata": {
                "abstract": "© 2020 The Author(s) 2020. Published by Oxford University Press. All rights reserved. For permissions, please e-mail: journals.permissions@oup.com.Motivation: Longitudinal metagenomics data, including both 16S rRNA and whole-metagenome shotgun sequencing data, enhanced our abilities to understand the dynamic associations between the human microbiome and various diseases. However, analytic tools have not been fully developed to simultaneously address the main challenges of longitudinal metagenomics data, i.e. high-dimensionality, dependence among samples and zero-inflation of observed counts. Results: We propose a fast zero-inflated negative binomial mixed modeling (FZINBMM) approach to analyze high-dimensional longitudinal metagenomic count data. The FZINBMM approach is based on zero-inflated negative binomial mixed models (ZINBMMs) for modeling longitudinal metagenomic count data and a fast EM-IWLS algorithm for fitting ZINBMMs. FZINBMM takes advantage of a commonly used procedure for fitting linear mixed models, which allows us to include various types of fixed and random effects and within-subject correlation structures and quickly analyze many taxa. We found that FZINBMM remarkably outperformed in computational efficiency and was statistically comparable with two R packages, GLMMadaptive and glmmTMB, that use numerical integration to fit ZINBMMs. Extensive simulations and real data applications showed that FZINBMM outperformed other previous methods, including linear mixed models, negative binomial mixed models and zero-inflated Gaussian mixed models.",
                "authors": [
                    {
                        "name": "Zhang X."
                    },
                    {
                        "name": "Yi N."
                    }
                ],
                "citationCount": 6,
                "date": "2020-04-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Fast zero-inflated negative binomial mixed modeling approach for analyzing longitudinal metagenomics data"
            },
            "pmid": "31904815"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "Microbial ecology",
            "uri": "http://edamontology.org/topic_3697"
        },
        {
            "term": "Metagenomic sequencing",
            "uri": "http://edamontology.org/topic_3837"
        },
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ]
}