
{
    "credit": [
        {
            "name": "Paul Hoffman",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "https://github.com/mojaveazure"
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "https://github.com/mojaveazure/angsd-wrapper"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence analysis",
                    "uri": "http://edamontology.org/operation_2403"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux",
            "Mac"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Sequencing",
                "uri": "http://edamontology.org/topic_3168"
            },
            {
                "term": "Genomics",
                "uri": "http://edamontology.org/topic_0622"
            },
            {
                "term": "Population genetics",
                "uri": "http://edamontology.org/topic_3056"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© 2016 John Wiley & Sons Ltd High-throughput sequencing has changed many aspects of population genetics, molecular ecology and related fields, affecting both experimental design and data analysis. The software package angsd allows users to perform a number of population genetic analyses on high-throughput sequencing data. angsd uses probabilistic approaches which can directly make use of genotype likelihoods; thus, SNP calling is not required for comparative analyses. This takes advantage of all the sequencing data and produces more accurate results for samples with low sequencing depth. Here, we present angsd-wrapper, a set of wrapper scripts that provides a user-friendly interface for running angsd and visualizing results. angsd-wrapper supports multiple types of analyses including estimates of nucleotide sequence diversity neutrality tests, principal component analysis, estimation of admixture proportions for individual samples and calculation of statistics that quantify recent introgression. angsd-wrapper also provides interactive graphing of angsd results to enhance data exploration. We demonstrate the usefulness of angsd-wrapper by analysing resequencing data from populations of wild and domesticated Zea. angsd-wrapper is freely available from https://github.com/mojaveazure/angsd-wrapper.",
            "authors": [
                "Durvasula A.",
                "Hoffman P.J.",
                "Kent T.V.",
                "Liu C.",
                "Kono T.J.Y.",
                "Morrell P.L.",
                "Ross-Ibarra J."
            ],
            "cit_count": 2,
            "doi": "10.1111/1755-0998.12578",
            "journal": "Molecular Ecology Resources",
            "pmid": "27480660",
            "title": "angsd-wrapper: utilities for analysing next-generation sequencing data",
            "year": "2016-11-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:angsd-wrapper",
        "biotoolsID": "angsd-wrapper",
        "description": "ANGSD-wrapper is a utility developed to aid in the analysis of next generation sequencing data.",
        "homepage": "https://github.com/mojaveazure/angsd-wrapper",
        "name": "angsd-wrapper"
    }
}