{
    "additionDate": "2018-10-31T11:34:31Z",
    "biotoolsCURIE": "biotools:traitar",
    "biotoolsID": "traitar",
    "credit": [
        {
            "email": "Alice.McHardy@helmholtz-hzi.de",
            "name": "Alice McHardy",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Traitar is a fully automated software package for deriving phenotypes from a genome sequence.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/hzi-bifo/traitar/blob/master/README.md"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genetic variation analysis",
                    "uri": "http://edamontology.org/operation_3197"
                }
            ]
        }
    ],
    "homepage": "https://github.com/hzi-bifo/traitar",
    "language": [
        "Python"
    ],
    "lastUpdate": "2018-12-10T12:59:01Z",
    "license": "GPL-3.0",
    "name": "Traitar",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "daniel_stefan",
    "publication": [
        {
            "doi": "10.1128/mSystems.00101-16",
            "metadata": {
                "abstract": "Copyright © 2016 Weimann et al.The number of sequenced genomes is growing exponentially, profoundly shifting the bottleneck from data generation to genome interpretation. Traits are often used to characterize and distinguish bacteria and are likely a driving factor in microbial community composition, yet little is known about the traits of most microbes. We describe Traitar, the microbial trait analyzer, which is a fully automated software package for deriving phenotypes from a genome sequence. Traitar provides phenotype classifiers to predict 67 traits related to the use of various substrates as carbon and energy sources, oxygen requirement, morphology, antibiotic susceptibility, proteolysis, and enzymatic activities. Furthermore, it suggests protein families associated with the presence of particular phenotypes. Our method uses L1- regularized L2-loss support vector machines for phenotype assignments based on phyletic patterns of protein families and their evolutionary histories across a diverse set of microbial species. We demonstrate reliable phenotype assignment for Traitar to bacterial genomes from 572 species of eight phyla, also based on incomplete single-cell genomes and simulated draft genomes. We also showcase its application in metagenomics by verifying and complementing a manual metabolic reconstruction of two novel Clostridiales species based on draft genomes recovered from commercial biogas reactors. Traitar is available at https://github.com/hzi-bifo/traitar.",
                "authors": [
                    {
                        "name": "Weimann A."
                    },
                    {
                        "name": "Mooren K."
                    },
                    {
                        "name": "Frank J."
                    },
                    {
                        "name": "Pope P.B."
                    },
                    {
                        "name": "Bremges A."
                    },
                    {
                        "name": "McHardy A.C."
                    }
                ],
                "citationCount": 31,
                "date": "2016-11-01T00:00:00Z",
                "journal": "mSystems",
                "title": "From genomes to phenotypes: Traitar, the microbial trait analyzer"
            },
            "pmcid": "PMC5192078",
            "pmid": "28066816",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Microbiology",
            "uri": "http://edamontology.org/topic_3301"
        },
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        },
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        }
    ],
    "validated": 1
}