{
    "accessibility": "Open access",
    "additionDate": "2025-06-30T08:52:48.500476Z",
    "biotoolsCURIE": "biotools:fair_eva_4_eucaim",
    "biotoolsID": "fair_eva_4_eucaim",
    "collectionID": [
        "EUCAIM"
    ],
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Fernando Aguilar",
            "note": "This software started to be developed within IFCA-Advanced-Computing receives funding from the European Union’s Horizon 2020 research and innovation programme under grant agreement No 857647.",
            "orcidid": "https://orcid.org/0000-0001-9462-4831",
            "typeEntity": "Person"
        }
    ],
    "description": "FAIR EVA: Evaluator, Validator & Advisor has been developed to check the FAIRness level of digital objects from different repositories or data portals. It requires the object identifier (preferably persistent and unique identifier) and the repository to check. It also provides a generic and agnostic way to check digital objects.",
    "documentation": [
        {
            "note": "Documentation for the main package, EUCAIM plugin specific documentation not included.",
            "type": [
                "Quick start guide"
            ],
            "url": "https://github.com/IFCA-Advanced-Computing/FAIR_eva/blob/main/docs/index.md"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "homepage": "https://github.com/IFCA-Advanced-Computing/FAIR_eva",
    "language": [
        "Python"
    ],
    "lastUpdate": "2025-07-15T09:45:40.672775Z",
    "license": "Apache-2.0",
    "maturity": "Mature",
    "name": "FAIR_EVA",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "davrodgon",
    "publication": [
        {
            "doi": "10.1038/s41597-023-02652-8",
            "metadata": {
                "abstract": "The FAIR Principles are a set of good practices to improve the reproducibility and quality of data in an Open Science context. Different sets of indicators have been proposed to evaluate the FAIRness of digital objects, including datasets that are usually stored in repositories or data portals. However, indicators like those proposed by the Research Data Alliance are provided from a high-level perspective that can be interpreted and they are not always realistic to particular environments like multidisciplinary repositories. This paper describes FAIR EVA, a new tool developed within the European Open Science Cloud context that is oriented to particular data management systems like open repositories, which can be customized to a specific case in a scalable and automatic environment. It aims to be adaptive enough to work for different environments, repository software and disciplines, taking into account the flexibility of the FAIR Principles. As an example, we present DIGITAL.CSIC repository as the first target of the tool, gathering the particular needs of a multidisciplinary institution as well as its institutional repository.",
                "authors": [
                    {
                        "name": "Aguilar Gomez F."
                    },
                    {
                        "name": "Bernal I."
                    }
                ],
                "citationCount": 6,
                "date": "2023-12-01T00:00:00Z",
                "journal": "Scientific Data",
                "title": "FAIR EVA: Bringing institutional multidisciplinary repositories into the FAIR picture"
            }
        }
    ],
    "toolType": [
        "Script",
        "Web service"
    ],
    "topic": [
        {
            "term": "FAIR data",
            "uri": "http://edamontology.org/topic_4012"
        }
    ],
    "version": [
        "EUCAIM_plugin_1"
    ]
}
