
{
    "credit": [
        {
            "email": "skolnick@buffalo.edu",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "https://zhanglab.ccmb.med.umich.edu/SPICKER/readme"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Perl"
        ],
        "operatingSystem": [
            "Linux"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Proteins",
                "uri": "http://edamontology.org/topic_0078"
            },
            {
                "term": "Protein structure analysis",
                "uri": "http://edamontology.org/topic_2814"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://www.mybiosoftware.com/spicker-20101229-cluster-protein-structures-near-native-model-selection.html"
        }
    ],
    "publication": [
        {
            "abstract": "We have developed SP1CKER, a simple and efficient strategy to identify near-native folds by clustering protein structures generated during computer simulations. In general, the most populated clusters tend to be closer to the native conformation than the lowest energy structures. To assess the generality of the approach, we applied SPICKER to 1489 representative benchmark proteins ≤200 residues that cover the PDB at the level of 35% sequence identity; each contains up to 280,000 structure decoys generated using the recently developed TASSER (Threading ASSembly Refinement) algorithm. The best of the top five identified folds has a root-mean-square deviation from native (RMSD) in the top 1.4% of all decoys. For 78% of the proteins, the difference in RMSD from native to the identified models and RMSD from native to the absolutely best individual decoy is below 1 Å the majority belong to the targets with converged conformational distributions. Although native fold identification from divergent decoy structures remains a challenge, our overall results show significant improvement over our previous clustering algorithms. © 2004 Wiley Periodicals, Inc.",
            "authors": [
                "Zhang Y.",
                "Skolnick J."
            ],
            "cit_count": 241,
            "doi": "10.1002/jcc.20011",
            "journal": "Journal of Computational Chemistry",
            "title": "SPICKER: A clustering approach to identify near-native protein folds",
            "type": "Primary",
            "year": "2004-04-30"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:spicker",
        "biotoolsID": "spicker",
        "description": "A clustering algorithm to identify the near-native models from a pool of protein structure decoys.",
        "homepage": "http://zhanglab.ccmb.med.umich.edu/SPICKER/",
        "name": "SPICKER",
        "version": [
            "2.0"
        ]
    }
}