{
    "additionDate": "2024-06-19T08:35:26.825201Z",
    "biotoolsCURIE": "biotools:scalepopgen",
    "biotoolsID": "scalepopgen",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "ivica.medjugorac@gen.vetmed.uni-muenchen.de",
            "name": "Ivica Medugorac",
            "orcidid": "https://orcid.org/0000-0002-6891-3039",
            "typeEntity": "Person"
        }
    ],
    "description": "Bioinformatic workflow resources implemented in nextflow for comprehensive population genomic analyses.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Principal component visualisation",
                    "uri": "http://edamontology.org/operation_2939"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Popgen48/scalepopgen",
    "language": [
        "Python",
        "R"
    ],
    "lastUpdate": "2024-06-19T08:35:26.827316Z",
    "license": "MIT",
    "name": "scalepopgen",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/molbev/msae057",
            "metadata": {
                "abstract": "Population genomic analyses such as inference of population structure and identifying signatures of selection usually involve the application of a plethora of tools. The installation of tools and their dependencies, data transformation, or series of data preprocessing in a particular order sometimes makes the analyses challenging. While the usage of container-based technologies has significantly resolved the problems associated with the installation of tools and their dependencies, population genomic analyses requiring multistep pipelines or complex data transformation can greatly be facilitated by the application of workflow management systems such as Nextflow and Snakemake. Here, we present scalepopgen, a collection of fully automated workflows that can carry out widely used population genomic analyses on the biallelic single nucleotide polymorphism data stored in either variant calling format files or the plink-generated binary files. scalepopgen is developed in Nextflow and can be run locally or on high-performance computing systems using either Conda, Singularity, or Docker. The automated workflow includes procedures such as (i) filtering of individuals and genotypes; (ii) principal component analysis, admixture with identifying optimal K-values; (iii) running TreeMix analysis with or without bootstrapping and migration edges, followed by identification of an optimal number of migration edges; (iv) implementing single-population and pair-wise population comparison-based procedures to identify genomic signatures of selection. The pipeline uses various open-source tools; additionally, several Python and R scripts are also provided to collect and visualize the results. The tool is freely available at https://github.com/Popgen48/scalepopgen.",
                "authors": [
                    {
                        "name": "Medugorac I."
                    },
                    {
                        "name": "Pogorevc N."
                    },
                    {
                        "name": "Upadhyay M."
                    }
                ],
                "date": "2024-04-01T00:00:00Z",
                "journal": "Molecular Biology and Evolution",
                "title": "scalepopgen: Bioinformatic Workflow Resources Implemented in Nextflow for Comprehensive Population Genomic Analyses"
            },
            "pmcid": "PMC10994858",
            "pmid": "38507648"
        }
    ],
    "toolType": [
        "Workflow"
    ],
    "topic": [
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "Population genomics",
            "uri": "http://edamontology.org/topic_3796"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ]
}
