{
    "additionDate": "2022-06-25T08:33:25.869884Z",
    "biotoolsCURIE": "biotools:divil",
    "biotoolsID": "divil",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "tom.gebhardt@uni-rostock.de",
            "name": "Tom Gebhardt",
            "orcidid": "https://orcid.org/0000-0001-8119-6081",
            "typeEntity": "Person"
        }
    ],
    "description": "DiVil is a javascript based tool that produces interactive graphs",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://divil.bio.informatik.uni-rostock.de",
    "language": [
        "JavaScript"
    ],
    "lastUpdate": "2022-06-25T08:33:25.872782Z",
    "license": "Apache-2.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/Gebbi8/DiVil"
        }
    ],
    "name": "DiVil",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PONE.0265735",
            "metadata": {
                "abstract": "© 2022 Gebhardt et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.The evolution of biochemical models is difficult to track. At present, it is not possible to inspect the differences between model versions at the network level. Biochemical models are often constructed in a distributed, non-linear process: collaborators create model versions on different branches from novel information, model extensions, during curation and adaption. To discuss and align the versions, it is helpful to abstract the changes to the network level. The differences between two model versions can be detected by the software tool BiVeS. However, it cannot show the structural changes resulting from the differences. Here, we present a method to visualise the differences between model versions effectively. We developed a JSON schema to communicate the differences at the network level and extended BiVeS accordingly. Additionally, we developed DiVil, a web-based tool to represent the model and the differences as a standardised network using D3. It combines an automatic layout with an interactive user interface to improve the visualisation and to inspect the model. The network can be exported in standardised formats as images or markup language. Our method communicates the structural differences between model versions. It facilitates the discussion of changes and thus supports the collaborative and non-linear nature of model development.",
                "authors": [
                    {
                        "name": "Gebhardt T."
                    },
                    {
                        "name": "Scharm M."
                    },
                    {
                        "name": "Toure V."
                    },
                    {
                        "name": "Waltemath D."
                    },
                    {
                        "name": "Wolkenhauer O."
                    }
                ],
                "date": "2022-03-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "Exploring the evolution of biochemical models at the network level"
            },
            "pmcid": "PMC8936491",
            "pmid": "35312734"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Evolutionary biology",
            "uri": "http://edamontology.org/topic_3299"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Systems biology",
            "uri": "http://edamontology.org/topic_2259"
        }
    ]
}
