{
    "accessibility": "Open access",
    "additionDate": "2024-01-29T20:07:12.030437Z",
    "biotoolsCURIE": "biotools:idelucs",
    "biotoolsID": "idelucs",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "pmillana@uwaterloo.ca",
            "name": "Pablo Millan Arias",
            "orcidid": "https://orcid.org/0000-0002-8886-9389",
            "typeEntity": "Person"
        },
        {
            "name": "Kathleen A Hill",
            "typeEntity": "Person"
        },
        {
            "name": "Lila Kari",
            "typeEntity": "Person"
        }
    ],
    "description": "Deep learning interactive tool for alignment-free clustering of DNA sequences.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Kari-Genomics-Lab/iDeLUCS",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-01-29T20:12:33.161200Z",
    "license": "MIT",
    "name": "iDeLUCS",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAD508",
            "metadata": {
                "abstract": "Summary: We present an interactive Deep Learning-based software tool for Unsupervised Clustering of DNA Sequences (iDeLUCS), that detects genomic signatures and uses them to cluster DNA sequences, without the need for sequence alignment or taxonomic identifiers. iDeLUCS is scalable and user-friendly: its graphical user interface, with support for hardware acceleration, allows the practitioner to fine-tune the different hyper-parameters involved in the training process without requiring extensive knowledge of deep learning. The performance of iDeLUCS was evaluated on a diverse set of datasets: several real genomic datasets from organisms in kingdoms Animalia, Protista, Fungi, Bacteria, and Archaea, three datasets of viral genomes, a dataset of simulated metagenomic reads from microbial genomes, and multiple datasets of synthetic DNA sequences. The performance of iDeLUCS was compared to that of two classical clustering algorithms (k-means++ and GMM) and two clustering algorithms specialized in DNA sequences (MeShClust v3.0 and DeLUCS), using both intrinsic cluster evaluation metrics and external evaluation metrics. In terms of unsupervised clustering accuracy, iDeLUCS outperforms the two classical algorithms by an average of ∼20%, and the two specialized algorithms by an average of ∼12%, on the datasets of real DNA sequences analyzed. Overall, our results indicate that iDeLUCS is a robust clustering method suitable for the clustering of large and diverse datasets of unlabeled DNA sequences.",
                "authors": [
                    {
                        "name": "Hill K.A."
                    },
                    {
                        "name": "Kari L."
                    },
                    {
                        "name": "Millan Arias P."
                    }
                ],
                "citationCount": 1,
                "date": "2023-09-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "iDeLUCS: a deep learning interactive tool for alignment-free clustering of DNA sequences"
            },
            "pmcid": "PMC10483029",
            "pmid": "37589603"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ]
}
