
{
    "credit": [
    ],
    "download": [
        {
            "type": "Source code",
            "url": "https://github.com/YeoLab/Expedition"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Splicing model analysis",
                    "uri": "http://edamontology.org/operation_2499"
                }
            ]
        }
    ],
    "labels": {
        "cost": "Free of charge",
        "language": [
            "Python"
        ],
        "license": "BSD-3-Clause",
        "maturity": "Emerging",
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Suite"
        ],
        "topic": [
            {
                "term": "RNA splicing",
                "uri": "http://edamontology.org/topic_3320"
            }
        ]
    },
    "link": [
        {
            "type": "ISSUE_TRACKER",
            "url": "https://github.com/YeoLab/Expedition/issues"
        }
    ],
    "publication": [
        {
            "abstract": "© 2017 Elsevier Inc.Alternative splicing (AS) generates isoform diversity for cellular identity and homeostasis in multicellular life. Although AS variation has been observed among single cells, little is known about the biological or evolutionary significance of such variation. We developed Expedition, a computational framework consisting of outrigger, a de novo splice graph transversal algorithm to detect AS; anchor, a Bayesian approach to assign modalities; and bonvoyage, a visualization tool using non-negative matrix factorization to display modality changes. Applying Expedition to single pluripotent stem cells undergoing neuronal differentiation, we discover that up to 20% of AS exons exhibit bimodality. Bimodal exons are flanked by more conserved intronic sequences harboring distinct cis-regulatory motifs, constitute much of cell-type-specific splicing, are highly dynamic during cellular transitions, preserve reading frame, and reveal intricacy of cell states invisible to conventional gene expression analysis. Systematic AS characterization in single cells redefines our understanding of AS complexity in cell biology.",
            "authors": [
                "Song Y.",
                "Botvinnik O.B.",
                "Lovci M.T.",
                "Kakaradov B.",
                "Liu P.",
                "Xu J.L.",
                "Yeo G.W."
            ],
            "cit_count": 21,
            "doi": "10.1016/J.MOLCEL.2017.06.003",
            "journal": "Molecular Cell",
            "title": "Single-Cell Alternative Splicing Analysis with Expedition Reveals Splicing Dynamics during Neuron Differentiation",
            "type": "Primary",
            "year": "2017-07-06"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:Expedition",
        "biotoolsID": "Expedition",
        "description": "Suite for single-cell alternative splicing analysis. Consists of outrigger, anchor and bonvoyage.",
        "homepage": "https://github.com/YeoLab/Expedition",
        "name": "Expedition"
    }
}