{
    "additionDate": "2021-01-18T10:04:39Z",
    "biotoolsCURIE": "biotools:covxnet",
    "biotoolsID": "covxnet",
    "collectionID": [
        "COVID-19"
    ],
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "fattah@eee.buet.ac.bd",
            "name": "Shaikh Anowarul Fattah",
            "typeEntity": "Person"
        }
    ],
    "description": "CovXNet is a multi-dilation convolutional neural network for automatic COVID-19 and other pneumonia detection from chest X-ray images with transferable multi-receptive feature optimization.\n\nWith the recent outbreak of COVID-19, fast diagnostic testing has become one of the major challenges due to the critical shortage of test kit.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Phasing",
                    "uri": "http://edamontology.org/operation_3454"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Feature extraction",
                    "uri": "http://edamontology.org/operation_3937"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Perceptron21/CovXNet",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-02-18T14:10:16Z",
    "license": "Apache-2.0",
    "name": "CovXNet",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1016/J.COMPBIOMED.2020.103869",
            "metadata": {
                "abstract": "© 2020 Elsevier LtdWith the recent outbreak of COVID-19, fast diagnostic testing has become one of the major challenges due to the critical shortage of test kit. Pneumonia, a major effect of COVID-19, needs to be urgently diagnosed along with its underlying reasons. In this paper, deep learning aided automated COVID-19 and other pneumonia detection schemes are proposed utilizing a small amount of COVID-19 chest X-rays. A deep convolutional neural network (CNN) based architecture, named as CovXNet, is proposed that utilizes depthwise convolution with varying dilation rates for efficiently extracting diversified features from chest X-rays. Since the chest X-ray images corresponding to COVID-19 caused pneumonia and other traditional pneumonias have significant similarities, at first, a large number of chest X-rays corresponding to normal and (viral/bacterial) pneumonia patients are used to train the proposed CovXNet. Learning of this initial training phase is transferred with some additional fine-tuning layers that are further trained with a smaller number of chest X-rays corresponding to COVID-19 and other pneumonia patients. In the proposed method, different forms of CovXNets are designed and trained with X-ray images of various resolutions and for further optimization of their predictions, a stacking algorithm is employed. Finally, a gradient-based discriminative localization is integrated to distinguish the abnormal regions of X-ray images referring to different types of pneumonia. Extensive experimentations using two different datasets provide very satisfactory detection performance with accuracy of 97.4% for COVID/Normal, 96.9% for COVID/Viral pneumonia, 94.7% for COVID/Bacterial pneumonia, and 90.2% for multiclass COVID/normal/Viral/Bacterial pneumonias. Hence, the proposed schemes can serve as an efficient tool in the current state of COVID-19 pandemic. All the architectures are made publicly available at: https://github.com/Perceptron21/CovXNet.",
                "authors": [
                    {
                        "name": "Mahmud T."
                    },
                    {
                        "name": "Rahman M.A."
                    },
                    {
                        "name": "Fattah S.A."
                    }
                ],
                "citationCount": 25,
                "date": "2020-07-01T00:00:00Z",
                "journal": "Computers in Biology and Medicine",
                "title": "CovXNet: A multi-dilation convolutional neural network for automatic COVID-19 and other pneumonia detection from chest X-ray images with transferable multi-receptive feature optimization"
            },
            "pmcid": "PMC7305745",
            "pmid": "32658740"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Informatics",
            "uri": "http://edamontology.org/topic_0605"
        }
    ]
}