{
    "accessibility": "Open access",
    "additionDate": "2022-06-02T09:19:18.591420Z",
    "biotoolsCURIE": "biotools:cbpmanager",
    "biotoolsID": "cbpmanager",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "arsenij.ustjanzew@uni-mainz.de",
            "name": "Arsenij Ustjanzew",
            "orcidid": "https://orcid.org/0000-0002-1014-4521",
            "typeEntity": "Person"
        }
    ],
    "description": "This R package provides an R Shiny application that enables the user to generate, manage, and edit data and metadata files suitable for the import in cBioPortal for Cancer Genomics.",
    "documentation": [
        {
            "type": [
                "API documentation"
            ],
            "url": "https://arsenij-ust.github.io/cbpManager/"
        }
    ],
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Editing",
                    "uri": "http://edamontology.org/operation_3096"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://bioconductor.org/packages/cbpManager/",
    "language": [
        "Python",
        "R"
    ],
    "lastUpdate": "2022-06-02T09:19:18.594134Z",
    "license": "AGPL-3.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/arsenij-ust/cbpManager/"
        }
    ],
    "name": "cbpManager",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1186/S12911-021-01719-Z",
            "metadata": {
                "abstract": "© 2021, The Author(s).Background: Extensive sequencing of tumor tissues has greatly improved our understanding of cancer biology over the past years. The integration of genomic and clinical data is increasingly used to select personalized therapies in dedicated tumor boards (Molecular Tumor Boards) or to identify patients for basket studies. Genomic alterations and clinical information can be stored, integrated and visualized in the open-access resource cBioPortal for Cancer Genomics. cBioPortal can be run as a local instance enabling storage and analysis of patient data in single institutions, in the respect of data privacy. However, uploading clinical input data and genetic aberrations requires the elaboration of multiple data files and specific data formats, which makes it difficult to integrate this system into clinical practice. To solve this problem, we developed cbpManager. Results: cbpManager is an R package providing a web-based interactive graphical user interface intended to facilitate the maintenance of mutations data and clinical data, including patient and sample information, as well as timeline data. cbpManager enables a large spectrum of researchers and physicians, regardless of their informatics skills to intuitively create data files ready for upload in cBioPortal for Cancer Genomics on a daily basis or in batch. Due to its modular structure based on R Shiny, further data formats such as copy number and fusion data can be covered in future versions. Further, we provide cbpManager as a containerized solution, enabling a straightforward large-scale deployment in clinical systems and secure access in combination with ShinyProxy. cbpManager is freely available via the Bioconductor project at https://bioconductor.org/packages/cbpManager/ under the AGPL-3 license. It is already used at six University Hospitals in Germany (Mainz, Gießen, Lübeck, Halle, Freiburg, and Marburg). Conclusion: In summary, our package cbpManager is currently a unique software solution in the workflow with cBioPortal for Cancer Genomics, to assist the user in the interactive generation and management of study files suited for the later upload in cBioPortal.",
                "authors": [
                    {
                        "name": "Christoph J."
                    },
                    {
                        "name": "Desuki A."
                    },
                    {
                        "name": "Dolezilek A.C."
                    },
                    {
                        "name": "Faber J."
                    },
                    {
                        "name": "Kindler T."
                    },
                    {
                        "name": "Marini F."
                    },
                    {
                        "name": "Panholzer T."
                    },
                    {
                        "name": "Paret C."
                    },
                    {
                        "name": "Ritzel C."
                    },
                    {
                        "name": "Unberath P."
                    },
                    {
                        "name": "Ustjanzew A."
                    },
                    {
                        "name": "Wagner D.-C."
                    }
                ],
                "date": "2021-12-01T00:00:00Z",
                "journal": "BMC Medical Informatics and Decision Making",
                "title": "cbpManager: a web application to streamline the integration of clinical and genomic data in cBioPortal to support the Molecular Tumor Board"
            },
            "pmcid": "PMC8686377",
            "pmid": "34930224"
        }
    ],
    "toolType": [
        "Library",
        "Web application"
    ],
    "topic": [
        {
            "term": "Data security",
            "uri": "http://edamontology.org/topic_3263"
        },
        {
            "term": "Medical informatics",
            "uri": "http://edamontology.org/topic_3063"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Surgery",
            "uri": "http://edamontology.org/topic_3421"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ]
}
