{
    "additionDate": "2021-12-13T09:34:37.484507Z",
    "biotoolsCURIE": "biotools:tinker-hp",
    "biotoolsID": "tinker-hp",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "jean-philip.piquemal@sorbonne-universite.fr",
            "name": "Jean-Philip Piquemal",
            "orcidid": "https://orcid.org/0000-0001-6615-9426",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "louis.lagardere@sorbonne-universite.fr",
            "name": "Louis Lagardère",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Tinker-HP is a tool for high-performance massively parallel evolution of tinker on CPUs & GPUs. It is used to accelerating molecular dynamics simulations of large complex systems with advanced point dipole polarizable force fields using GPUs and multi-GPU systems.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Molecular dynamics",
                    "uri": "http://edamontology.org/operation_2476"
                },
                {
                    "term": "Phasing",
                    "uri": "http://edamontology.org/operation_3454"
                }
            ]
        }
    ],
    "homepage": "https://github.com/TinkerTools/tinker-hp",
    "language": [
        "C++",
        "Fortran"
    ],
    "lastUpdate": "2021-12-13T09:34:37.487683Z",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/TinkerTools/tinker-hp/issues"
        }
    ],
    "name": "Tinker-HP",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1021/ACS.JCTC.0C01164",
            "metadata": {
                "abstract": "© 2021 The Authors. Published by American Chemical Society.We present the extension of the Tinker-HP package (Lagardère, et al. Chem. Sci. 2018, 9, 956-972) to the use of Graphics Processing Unit (GPU) cards to accelerate molecular dynamics simulations using polarizable many-body force fields. The new high-performance module allows for an efficient use of single- and multiple-GPU architectures ranging from research laboratories to modern supercomputer centers. After detailing an analysis of our general scalable strategy that relies on OpenACC and CUDA, we discuss the various capabilities of the package. Among them, the multiprecision possibilities of the code are discussed. If an efficient double precision implementation is provided to preserve the possibility of fast reference computations, we show that a lower precision arithmetic is preferred providing a similar accuracy for molecular dynamics while exhibiting superior performances. As Tinker-HP is mainly dedicated to accelerate simulations using new generation point dipole polarizable force field, we focus our study on the implementation of the AMOEBA model. Testing various NVIDIA platforms including 2080Ti, 3090, V100, and A100 cards, we provide illustrative benchmarks of the code for single- and multicards simulations on large biosystems encompassing up to millions of atoms. The new code strongly reduces time to solution and offers the best performances to date obtained using the AMOEBA polarizable force field. Perspectives toward the strong-scaling performance of our multinode massive parallelization strategy, unsupervised adaptive sampling and large scale applicability of the Tinker-HP code in biophysics are discussed. The present software has been released in phase advance on GitHub in link with the High Performance Computing community COVID-19 research efforts and is free for Academics (see https://github.com/TinkerTools/tinker-hp).",
                "authors": [
                    {
                        "name": "Adjoua O."
                    },
                    {
                        "name": "Celerse F."
                    },
                    {
                        "name": "Dupays I."
                    },
                    {
                        "name": "Durocher A."
                    },
                    {
                        "name": "Inizan T.J."
                    },
                    {
                        "name": "Jolly L.-H."
                    },
                    {
                        "name": "Lagardere L."
                    },
                    {
                        "name": "Piquemal J.-P."
                    },
                    {
                        "name": "Ponder J.W."
                    },
                    {
                        "name": "Ren P."
                    },
                    {
                        "name": "Very T."
                    },
                    {
                        "name": "Wang Z."
                    }
                ],
                "citationCount": 7,
                "date": "2021-04-13T00:00:00Z",
                "journal": "Journal of Chemical Theory and Computation",
                "title": "Tinker-HP: Accelerating Molecular Dynamics Simulations of Large Complex Systems with Advanced Point Dipole Polarizable Force Fields Using GPUs and Multi-GPU Systems"
            },
            "pmcid": "PMC8047816",
            "pmid": "33755446",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Biophysics",
            "uri": "http://edamontology.org/topic_3306"
        },
        {
            "term": "Computer science",
            "uri": "http://edamontology.org/topic_3316"
        },
        {
            "term": "Evolutionary biology",
            "uri": "http://edamontology.org/topic_3299"
        },
        {
            "term": "Molecular dynamics",
            "uri": "http://edamontology.org/topic_0176"
        }
    ]
}
