
{
    "credit": [
        {
            "name": "Instruct",
            "typeEntity": "Institute",
            "typeRoles": [
                "Provider"
            ]
        },
        {
            "email": "ccisb@stfc.ac.uk",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://ccp4wiki.org/~ccp4wiki/wiki/index.php?title=Main_Page"
        }
    ],
    "function": [
        {
            "note": "The CCP4 WIKI is a community resource with helpful information for crystallographers and structural biologists.",
            "operation": [
                {
                    "term": "Diffraction data analysis",
                    "uri": "http://edamontology.org/operation_3445"
                }
            ]
        }
    ],
    "labels": {
        "collectionID": [
            "Instruct"
        ],
        "cost": "Free of charge",
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Database portal"
        ],
        "topic": [
            {
                "term": "Structural biology",
                "uri": "http://edamontology.org/topic_1317"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© 2015 CSIC.Collaborative Computational Project Number 4 (CCP4) in Protein Crystallography is a public resource for producing and supporting a world-leading, integrated Suite of programs that allows researchers to determine macromolecular structures by X-ray crystallography, and other biophysical techniques. CCP4 supports the widest possible researcher community, embracing academic, not for profit, and for profit research. The primary aims of CCP4 include development and support of the development of cutting edge approaches to experimental determination and analysis of protein structure, with integration of them into the suite for worldwide dissemination. In addition, CCP4 plays an important role in the education and training of scientists in experimental structural biology. In this paper, we overview CCP4’s 35-year long history and (technical) milestones of its evolution. We will also consider how a particular structure of CCP4 Suite and Collaboration has emerged, its main functionality, current state and plans for future.",
            "authors": [
                "Krissinel E."
            ],
            "cit_count": 0,
            "doi": "10.3989/arbor.2015.772n2006",
            "journal": "Arbor",
            "title": "CCP4 software suite: History, evolution, content, challenges and future developments CCP4 software suite: Historia, evolución, contenido, retos y perspectivas de futuro",
            "type": "Other",
            "year": "2015-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:ccp4_wiki",
        "biotoolsID": "ccp4_wiki",
        "description": "CCP4 Community Knowledge base.",
        "homepage": "http://ccp4wiki.org",
        "name": "CCP4 Wiki"
    }
}