{
    "additionDate": "2017-12-18T00:05:07Z",
    "biotoolsCURIE": "biotools:cerulean",
    "biotoolsID": "cerulean",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://cseweb.ucsd.edu/~kspham/"
        }
    ],
    "description": "Cerulean is a hybrid assembly using high throughput short and long reads",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://sourceforge.net/projects/ceruleanassembler/files/?source=navbar"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence assembly",
                    "uri": "http://edamontology.org/operation_0310"
                }
            ]
        }
    ],
    "homepage": "http://sourceforge.net/projects/ceruleanassembler/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2018-12-10T12:58:57Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/cerulean-hybrid-genome-assembler.html"
        }
    ],
    "name": "Cerulean",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1007/978-3-642-40453-5_27",
            "metadata": {
                "abstract": "Genome assembly using high throughput data with short reads, arguably, remains an unresolvable task in repetitive genomes, since when the length of a repeat exceeds the read length, it becomes difficult to unambiguously connect the flanking regions. The emergence of third generation sequencing (Pacific Biosciences) with long reads enables the opportunity to resolve complicated repeats that could not be resolved by the short read data. However, these long reads have high error rate and it is an uphill task to assemble the genome without using additional high quality short reads. Recently, Koren et al. 2012 [1] proposed an approach to use high quality short reads data to correct these long reads and, thus, make the assembly from long reads possible. However, due to the large size of both dataset (short and long reads), error-correction of these long reads requires excessively high computational resources, even on small bacterial genomes. In this work, instead of error correction of long reads, we first assemble the short reads and later map these long reads on the assembly graph to resolve repeats. Contribution: We present a hybrid assembly approach that is both computationally effective and produces high quality assemblies. Our algorithm first operates with a simplified version of the assembly graph consisting only of long contigs and gradually improves the assembly by adding smaller contigs in each iteration. In contrast to the state-of-the-art long reads error correction technique, which requires high computational resources and long running time on a supercomputer even for bacterial genome datasets, our software can produce comparable assembly using only a standard desktop in a short running time. © 2013 Springer-Verlag.",
                "authors": [
                    {
                        "name": "Deshpande V."
                    },
                    {
                        "name": "Fung E.D.K."
                    },
                    {
                        "name": "Pham S."
                    },
                    {
                        "name": "Bafna V."
                    }
                ],
                "citationCount": 30,
                "date": "2013-09-25T00:00:00Z",
                "journal": "Lecture Notes in Computer Science (including subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics)",
                "title": "Cerulean: A hybrid assembly using high throughput short and long reads"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Assembly",
            "uri": "http://edamontology.org/topic_0196"
        }
    ],
    "validated": 1,
    "version": [
        "0.1.1"
    ]
}