{
    "accessibility": "Open access",
    "additionDate": "2022-05-18T07:32:14.241840Z",
    "biotoolsCURIE": "biotools:atrialjsqnet",
    "biotoolsID": "atrialjsqnet",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "zxh@fudan.edu.cn",
            "name": "Xiahai Zhuang"
        },
        {
            "name": "Julia A. Schnabel"
        },
        {
            "name": "Lei Li"
        },
        {
            "name": "Veronika A. Zimmer"
        }
    ],
    "description": "AtrialJSQnet is a modified U-Net consisting of two decoders for LA segmentation and scar quantification, respectively.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Marie0909/AtrialJSQnet",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-05-18T07:32:14.244379Z",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "https://zmiclab.github.io/projects.html"
        }
    ],
    "name": "AtrialJSQnet",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1016/J.MEDIA.2021.102303",
            "metadata": {
                "abstract": "© 2021 Elsevier B.V.Left atrial (LA) and atrial scar segmentation from late gadolinium enhanced magnetic resonance imaging (LGE MRI) is an important task in clinical practice. The automatic segmentation is however still challenging due to the poor image quality, the various LA shapes, the thin wall, and the surrounding enhanced regions. Previous methods normally solved the two tasks independently and ignored the intrinsic spatial relationship between LA and scars. In this work, we develop a new framework, namely AtrialJSQnet, where LA segmentation, scar projection onto the LA surface, and scar quantification are performed simultaneously in an end-to-end style. We propose a mechanism of shape attention (SA) via an implicit surface projection to utilize the inherent correlation between LA cavity and scars. In specific, the SA scheme is embedded into a multi-task architecture to perform joint LA segmentation and scar quantification. Besides, a spatial encoding (SE) loss is introduced to incorporate continuous spatial information of the target in order to reduce noisy patches in the predicted segmentation. We evaluated the proposed framework on 60 post-ablation LGE MRIs from the MICCAI2018 Atrial Segmentation Challenge. Moreover, we explored the domain generalization ability of the proposed AtrialJSQnet on 40 pre-ablation LGE MRIs from this challenge and 30 post-ablation multi-center LGE MRIs from another challenge (ISBI2012 Left Atrium Fibrosis and Scar Segmentation Challenge). Extensive experiments on public datasets demonstrated the effect of the proposed AtrialJSQnet, which achieved competitive performance over the state-of-the-art. The relatedness between LA segmentation and scar quantification was explicitly explored and has shown significant performance improvements for both tasks. The code has been released via https://zmiclab.github.io/projects.html.",
                "authors": [
                    {
                        "name": "Li L."
                    },
                    {
                        "name": "Schnabel J.A."
                    },
                    {
                        "name": "Zhuang X."
                    },
                    {
                        "name": "Zimmer V.A."
                    }
                ],
                "citationCount": 2,
                "date": "2022-02-01T00:00:00Z",
                "journal": "Medical Image Analysis",
                "title": "AtrialJSQnet: A New framework for joint segmentation and quantification of left atrium and scars incorporating spatial and shape information"
            },
            "pmid": "34875581"
        }
    ],
    "toolType": [
        "Workbench"
    ],
    "topic": [
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        }
    ]
}
