
{
    "credit": [
        {
            "email": "karim.gharbi@ed.ac.uk",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "url": "https://www.wiki.ed.ac.uk/display/RADSequencing/Home?preview=/68630442/108236012/RADmanual.pdf"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence tag mapping",
                    "uri": "http://edamontology.org/operation_0527"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Perl"
        ],
        "operatingSystem": [
            "Linux",
            "Mac"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Sequencing",
                "uri": "http://edamontology.org/topic_3168"
            },
            {
                "term": "DNA",
                "uri": "http://edamontology.org/topic_0654"
            },
            {
                "term": "Genetics",
                "uri": "http://edamontology.org/topic_3053"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://www.mybiosoftware.com/radtools-1-2-4-software-restriction-site-dna-sequencing.html"
        }
    ],
    "publication": [
        {
            "abstract": "Single nucleotide polymorphism (SNP) discovery and genotyping are essential to genetic mapping. There remains a need for a simple, inexpensive platform that allows high-density SNP discovery and genotyping in large populations. Here we describe the sequencing of restriction-site associated DNA (RAD) tags, which identified more than 13,000 SNPs, and mapped three traits in two model organisms, using less than half the capacity of one Illumina sequencing run. We demonstrated that different marker densities can be attained by choice of restriction enzyme. Furthermore, we developed a barcoding system for sample multiplexing and fine mapped the genetic basis of lateral plate armor loss in threespine stickleback by identifying recombinant breakpoints in F2 individuals. Barcoding also facilitated mapping of a second trait, a reduction of pelvic structure, by in silico re-sorting of individuals. To further demonstrate the ease of the RAD sequencing approach we identified polymorphic markers and mapped an induced mutation in Neurospora crassa. Sequencing of RAD markers is an integrated platform for SNP discovery and genotyping. This approach should be widely applicable to genetic mapping in a variety of organisms.© 2008 Baird et al.",
            "authors": [
                "Baird N.A.",
                "Etter P.D.",
                "Atwood T.S.",
                "Currey M.C.",
                "Shiver A.L.",
                "Lewis Z.A.",
                "Selker E.U.",
                "Cresko W.A.",
                "Johnson E.A."
            ],
            "cit_count": 1488,
            "doi": "10.1371/journal.pone.0003376",
            "journal": "PLoS ONE",
            "title": "Rapid SNP discovery and genetic mapping using sequenced RAD markers",
            "type": "Primary",
            "year": "2008-10-13"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:radtools",
        "biotoolsID": "radtools",
        "description": "Software for processing RAD (Restriction site Associated DNA)Sequencing data. The software is a pipeline for transforming Illumina reads into candidate genetic markers.",
        "homepage": "https://www.wiki.ed.ac.uk/display/RADSequencing/Home",
        "name": "RADtools",
        "version": [
            "1.2.4"
        ]
    }
}