{
    "additionDate": "2021-01-18T07:11:11Z",
    "biotoolsCURIE": "biotools:udsmprot",
    "biotoolsID": "udsmprot",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "nils.strodthoff@hhi.fraunhofer.de",
            "name": "Nils Strodthoff",
            "orcidid": "https://orcid.org/0000-0003-4447-0162",
            "typeEntity": "Person"
        },
        {
            "email": "wojciech.samek@hhi.fraunhofer.de",
            "name": "Wojciech Samek",
            "typeEntity": "Person"
        }
    ],
    "description": "UDSMProt is an algorithm for the classification of proteins based on the sequence of amino acids alone. Its key component is a self-supervised pretraining step based on a language modeling task. The model is then subsequently finetuned to specific classification tasks. In our paper we considered enzyme class classification, gene ontology prediction and remote homology detection showcasing the excellent performance of UDSMProt.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Fold recognition",
                    "uri": "http://edamontology.org/operation_0303"
                },
                {
                    "term": "Protein modelling",
                    "uri": "http://edamontology.org/operation_0477"
                },
                {
                    "term": "Sequence classification",
                    "uri": "http://edamontology.org/operation_2995"
                }
            ]
        }
    ],
    "homepage": "https://github.com/nstrodt/UDSMProt",
    "language": [
        "Python",
        "Shell"
    ],
    "lastUpdate": "2021-03-06T14:47:37Z",
    "name": "UDSMProt",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAA003",
            "metadata": {
                "abstract": "© 2020 The Author(s) 2020. Published by Oxford University Press.Motivation: Inferring the properties of a protein from its amino acid sequence is one of the key problems in bioinformatics. Most state-of-The-Art approaches for protein classification are tailored to single classification tasks and rely on handcrafted features, such as position-specific-scoring matrices from expensive database searches. We argue that this level of performance can be reached or even be surpassed by learning a task-Agnostic representation once, using self-supervised language modeling, and transferring it to specific tasks by a simple fine-Tuning step. Results: We put forward a universal deep sequence model that is pre-Trained on unlabeled protein sequences from Swiss-Prot and fine-Tuned on protein classification tasks. We apply it to three prototypical tasks, namely enzyme class prediction, gene ontology prediction and remote homology and fold detection. The proposed method performs on par with state-of-The-Art algorithms that were tailored to these specific tasks or, for two out of three tasks, even outperforms them. These results stress the possibility of inferring protein properties from the sequence alone and, on more general grounds, the prospects of modern natural language processing methods in omics. Moreover, we illustrate the prospects for explainable machine learning methods in this field by selected case studies.",
                "authors": [
                    {
                        "name": "Samek W."
                    },
                    {
                        "name": "Strodthoff N."
                    },
                    {
                        "name": "Wagner P."
                    },
                    {
                        "name": "Wenzel M."
                    }
                ],
                "citationCount": 17,
                "date": "2020-04-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "UDSMProt: Universal deep sequence models for protein classification"
            },
            "pmcid": "PMC7178389",
            "pmid": "31913448"
        }
    ],
    "topic": [
        {
            "term": "Enzymes",
            "uri": "http://edamontology.org/topic_0821"
        },
        {
            "term": "Gene and protein families",
            "uri": "http://edamontology.org/topic_0623"
        },
        {
            "term": "Natural language processing",
            "uri": "http://edamontology.org/topic_0218"
        },
        {
            "term": "Ontology and terminology",
            "uri": "http://edamontology.org/topic_0089"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
