{
    "additionDate": "2021-11-29T07:09:25.136061Z",
    "biotoolsCURIE": "biotools:prolint",
    "biotoolsID": "prolint",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "besian.sejdiu@stjude.org",
            "name": "Besian I Sejdiu",
            "orcidid": "https://orcid.org/0000-0002-9913-4994",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "tieleman@ucalgary.ca",
            "name": "D Peter Tieleman",
            "orcidid": "https://orcid.org/0000-0001-5507-0688",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "ProLint is a user-friendly framework for the automated analysis and interactive visualization of Protein-Lipid interactions. The time requirement to analyze and interpret data generated through Molecular Dynamics (MD) simulations usually exceeds the time to set up and perform the simulations. Add to this the continuing trend of increased system sizes, simulated for longer time scales and the need for a much larger set of proteins, it becomes clear how analysis and visualization of lipid-protein interactions can become a significant bottleneck. ProLint aimes to bridge this widening gap between data generation and gaining insight on biologically-relevant interactions between.\nprolintpy is a lightweight python library that is used by the ProLint webserver on the backend to analyze Protein-Lipid interactions.. Use this tool if you want to customize analysis and visualization of lipid-protein interactions and want to scale-up your workflow beyond the capabilities of the ProLint webserver.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Molecular dynamics",
                    "uri": "http://edamontology.org/operation_2476"
                },
                {
                    "term": "Simulation analysis",
                    "uri": "http://edamontology.org/operation_0244"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "http://www.prolint.ca",
    "language": [
        "C",
        "C++",
        "JavaScript",
        "Python"
    ],
    "lastUpdate": "2021-11-29T07:09:25.138625Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/ProLint/ProLint/issues"
        },
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/ProLint/prolintpy/issues"
        },
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/ProLint/ProLint"
        },
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/ProLint/prolintpy"
        }
    ],
    "name": "ProLint",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/NAR/GKAB409",
            "metadata": {
                "abstract": "© 2021 The Author(s) 2021. Published by Oxford University Press on behalf of Nucleic Acids Research.The functional activity of membrane proteins is carried out in a complex lipid environment. Increasingly, it is becoming clear that lipids are an important player in regulating or generally modulating their activity. A routinely used method to gain insight into this interplay between lipids and proteins are Molecular Dynamics (MD) simulations, since they allow us to study interactions at atomic or near-atomic detail as a function of time. A major bottleneck, however, is analyzing and visualizing lipid-protein interactions, which, in practice, is a time-demanding task. Here, we present ProLint (www.prolint.ca), a webserver that completely automates analysis of MD generated files and visualization of lipid-protein interactions. Analysis is modular allowing users to select their preferred method, and visualization is entirely interactive through custom built applications that enable a detailed qualitative and quantitative exploration of lipid-protein interactions. ProLint also includes a database of published MD results that have been processed through the ProLint workflow and can be visualized by anyone regardless of their level of experience with MD. The automated analysis, feature-rich visualization, database integration, and open-source distribution with an easy to install process, will allow ProLint to become a routine workflow in lipid-protein interaction studies.",
                "authors": [
                    {
                        "name": "Sejdiu B.I."
                    },
                    {
                        "name": "Tieleman D.P."
                    }
                ],
                "citationCount": 3,
                "date": "2021-07-02T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "ProLint: A web-based framework for the automated data analysis and visualization of lipid-protein interactions"
            },
            "pmid": "34038536",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Library",
        "Web application"
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Lipids",
            "uri": "http://edamontology.org/topic_0153"
        },
        {
            "term": "Membrane and lipoproteins",
            "uri": "http://edamontology.org/topic_0820"
        },
        {
            "term": "Molecular dynamics",
            "uri": "http://edamontology.org/topic_0176"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ]
}
