{"credit":[{"name":"ELIXIR-ITA-MILANO","typeEntity":"Institute","typeRoles":["Provider"]},{"email":"giulio.pavesi@unimi.it","name":"Giulio Pavesi","typeEntity":"Person","typeRoles":["Primary contact"]},{"email":"federico.zambelli@unimi.it","name":"Federico Zambelli","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"http://159.149.160.51/modtools/"}],"function":[{"input":[{"data":{"term":"Nucleic acid sequence","uri":"http://edamontology.org/data_2977"}}],"operation":[{"term":"Sequence motif discovery","uri":"http://edamontology.org/operation_0238"}],"output":[{"data":{"term":"Sequence motif (nucleic acid)","uri":"http://edamontology.org/data_2070"}}]}],"labels":{"collectionID":["MoD Tools"],"language":["C"],"license":"GPL-3.0","maturity":"Mature","operatingSystem":["Linux","Mac"],"toolType":["Command-line tool"],"topic":[{"term":"Sequence sites, features and motifs","uri":"http://edamontology.org/topic_0160"}]},"publication":[{"abstract":"Background: This work addresses the problem of detecting conserved transcription factor binding sites and in general regulatory regions through the analysis of sequences from homologous genes, an approach that is becoming more and more widely used given the ever increasing amount of genomic data available. Results: We present an algorithm that identifies conserved transcription factor binding sites in a given sequence by comparing it to one or more homologs, adapting a framework we previously introduced for the discovery of sites in sequences from co-regulated genes. Differently from the most commonly used methods, the approach we present does not need or compute an alignment of the sequences investigated, nor resorts to descriptors of the binding specificity of known transcription factors. The main novel idea we introduce is a relative measure of conservation, assuming that true functional elements should present a higher level of conservation with respect to the rest of the sequence surrounding them. We present tests where we applied the algorithm to the identification of conserved annotated sites in homologous promoters, as well as in distal regions like enhancers. Conclusion: Results of the tests show how the algorithm can provide fast and reliable predictions of conserved transcription factor binding sites regulating the transcription of a gene, with better performances than other available methods for the same task. We also show examples on how the algorithm can be successfully employed when promoter annotations of the genes investigated are missing, or when regulatory sites and regions are located far away from the genes. © 2007 Pavesi et al; licensee BioMed Central Ltd.","authors":["Pavesi G.","Zambelli F.","Pesole G."],"cit_count":29,"doi":"10.1186/1471-2105-8-46","journal":"BMC Bioinformatics","title":"WeederH: An algorithm for finding conserved regulatory motifs and regions in homologous sequences","type":"Primary","year":"2007-03-09"}],"summary":{"biotoolsCURIE":"biotools:weederh","biotoolsID":"weederh","description":"Identifies conserved transcription factor binding sites in a given sequence by comparing it to one or more homologs.","homepage":"http://www.beaconlab.it/modtools","name":"WeederH","version":["1.0"]}}