{
    "accessibility": "Open access",
    "additionDate": "2023-09-15T18:04:08.621088Z",
    "biotoolsCURIE": "biotools:flexr",
    "biotoolsID": "flexr",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "marcus.fischer@stjude.org",
            "name": "Marcus Fischer",
            "orcidid": "https://orcid.org/0000-0002-7179-2581",
            "typeEntity": "Person"
        }
    ],
    "description": "Automated multi-conformer model building using electron-density map sampling.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Backbone modelling",
                    "uri": "http://edamontology.org/operation_0479"
                },
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                },
                {
                    "term": "Molecular dynamics",
                    "uri": "http://edamontology.org/operation_2476"
                },
                {
                    "term": "Side chain modelling",
                    "uri": "http://edamontology.org/operation_0480"
                }
            ]
        }
    ],
    "homepage": "https://github.com/TheFischerLab/FLEXR",
    "language": [
        "Python",
        "Ruby"
    ],
    "lastUpdate": "2023-09-15T18:04:08.623745Z",
    "license": "GPL-3.0",
    "name": "FLEXR",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1107/S2059798323002498",
            "metadata": {
                "abstract": "Protein conformational dynamics that may inform biology often lie dormant in high-resolution electron-density maps. While an estimated ∼18% of side chains in high-resolution models contain alternative conformations, these are underrepresented in current PDB models due to difficulties in manually detecting, building and inspecting alternative conformers. To overcome this challenge, we developed an automated multi-conformer modeling program, FLEXR. Using Ringer-based electron-density sampling, FLEXR builds explicit multi-conformer models for refinement. Thereby, it bridges the gap of detecting hidden alternate states in electron-density maps and including them in structural models for refinement, inspection and deposition. Using a series of high-quality crystal structures (0.8-1.85 Å resolution), we show that the multi-conformer models produced by FLEXR uncover new insights that are missing in models built either manually or using current tools. Specifically, FLEXR models revealed hidden side chains and backbone conformations in ligand-binding sites that may redefine protein-ligand binding mechanisms. Ultimately, the tool facilitates crystallographers with opportunities to include explicit multi-conformer states in their high-resolution crystallographic models. One key advantage is that such models may better reflect interesting higher energy features in electron-density maps that are rarely consulted by the community at large, which can then be productively used for ligand discovery downstream. FLEXR is open source and publicly available on GitHub at https://github.com/TheFischerLab/FLEXR.",
                "authors": [
                    {
                        "name": "Fischer M."
                    },
                    {
                        "name": "Stachowski T.R."
                    }
                ],
                "date": "2023-05-01T00:00:00Z",
                "journal": "Acta crystallographica. Section D, Structural biology",
                "title": "FLEXR: automated multi-conformer model building using electron-density map sampling"
            },
            "pmcid": "PMC10167668",
            "pmid": "37071395"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Molecular dynamics",
            "uri": "http://edamontology.org/topic_0176"
        },
        {
            "term": "Molecular modelling",
            "uri": "http://edamontology.org/topic_2275"
        },
        {
            "term": "X-ray diffraction",
            "uri": "http://edamontology.org/topic_2828"
        }
    ]
}
