{
    "additionDate": "2017-08-03T19:04:38Z",
    "biotoolsCURIE": "biotools:xstk",
    "biotoolsID": "xstk",
    "credit": [
        {
            "email": "daniel.frank@ucdenver.edu",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.phyloware.com/Phyloware/Contacts.html"
        }
    ],
    "description": "Suite of C and C++ libraries and command-line programs for DNA sequence analysis.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://www.phyloware.com/Phyloware/XSTK.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence analysis",
                    "uri": "http://edamontology.org/operation_2403"
                }
            ]
        }
    ],
    "homepage": "http://www.phyloware.com/Phyloware/XSTK.html",
    "language": [
        "C++"
    ],
    "lastUpdate": "2018-12-10T12:58:55Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/xstk-20080208-tools-nucleic-acids-sequence-analysis.html"
        }
    ],
    "name": "XSTK",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Background: Advances in automated DNA sequencing technology have greatly increased the scale of genomic and metagenomic studies. An increasingly popular means of increasing project throughput is by multiplexing samples during the sequencing phase. This can be achieved by covalently linking short, unique \"barcode\" DNA segments to genomic DNA samples, for instance through incorporation of barcode sequences in PCR primers. Although several strategies have been described to insure that barcode sequences are unique and robust to sequencing errors, these have not been integrated into the overall primer design process, thus potentially introducing bias into PCR amplification and/or sequencing steps. Results: Barcrawl is a software program that facilitates the design of barcoded primers, for multiplexed high-throughput sequencing. The program bartab can be used to deconvolute DNA sequence datasets produced by the use of multiple barcoded primers. This paper describes the functions implemented by barcrawl and bartab and presents a proof-of-concept case study of both programs in which barcoded rRNA primers were designed and validated by high-throughput sequencing. Conclusion: Barcrawl and bartab can benefit researchers who are engaged in metagenomic projects that employ multiplexed specimen processing. The source code is released under the GNU general public license and can be accessed at http://www.phyloware.com. © 2009 Frank; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Frank D.N."
                    }
                ],
                "citationCount": 121,
                "date": "2009-10-29T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "BARCRAWL and BARTAB: Software tools for the design and implementation of barcoded primers for highly multiplexed DNA sequencing"
            },
            "pmid": "19874596"
        }
    ],
    "toolType": [
        "Command-line tool",
        "Library"
    ],
    "topic": [
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "Nucleic acids",
            "uri": "http://edamontology.org/topic_0077"
        },
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ],
    "validated": 1
}