{
    "additionDate": "2021-01-18T08:00:48Z",
    "biotoolsCURIE": "biotools:sgrna-psm",
    "biotoolsID": "sgrna-psm",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "bliu@bliulab.net",
            "name": "Bin Liu",
            "typeEntity": "Person"
        }
    ],
    "description": "Predict sgRNAs On-Target Activity Based on Position-Specific Mismatch.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Editing",
                    "uri": "http://edamontology.org/operation_3096"
                },
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                },
                {
                    "term": "Feature extraction",
                    "uri": "http://edamontology.org/operation_3937"
                }
            ]
        }
    ],
    "homepage": "http://bliulab.net/sgRNA-PSM/",
    "lastUpdate": "2021-02-16T15:43:41Z",
    "name": "sgRNA-PSM",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1016/J.OMTN.2020.01.029",
            "metadata": {
                "abstract": "© 2020 The Author(s)As a key technique for the CRISPR-Cas9 system, identification of single-guide RNAs (sgRNAs) on-target activity is critical for both theoretical research (investigation of RNA functions) and real-world applications (genome editing and synthetic biology). Because of its importance, several computational predictors have been proposed to predict sgRNAs on-target activity. All of these methods have clearly contributed to the developments of this very important field. However, they are suffering from certain limitations. We proposed two new methods called “sgRNA-PSM” and “sgRNA-ExPSM” for sgRNAs on-target activity prediction via capturing the long-range sequence information and evolutionary information using a new way to reduce the dimension of the feature vector to avoid the risk of overfitting. Rigorous leave-one-gene-out cross-validation on a benchmark dataset with 11 human genes and 6 mouse genes, as well as an independent dataset, indicated that the two new methods outperformed other competing methods. To make it easier for users to use the proposed sgRNA-PSM predictor, we have established a corresponding web server, which is available at http://bliulab.net/sgRNA-PSM/.",
                "authors": [
                    {
                        "name": "Liu B."
                    },
                    {
                        "name": "Luo Z."
                    },
                    {
                        "name": "He J."
                    }
                ],
                "citationCount": 8,
                "date": "2020-06-05T00:00:00Z",
                "journal": "Molecular Therapy - Nucleic Acids",
                "title": "sgRNA-PSM: Predict sgRNAs On-Target Activity Based on Position-Specific Mismatch"
            },
            "pmcid": "PMC7083770",
            "pmid": "32199128"
        }
    ],
    "topic": [
        {
            "term": "Synthetic biology",
            "uri": "http://edamontology.org/topic_3895"
        },
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        },
        {
            "term": "Genetic engineering",
            "uri": "http://edamontology.org/topic_3912"
        }
    ]
}