{
    "additionDate": "2017-08-03T18:44:39Z",
    "biotoolsCURIE": "biotools:gpu-cassert",
    "biotoolsID": "gpu-cassert",
    "credit": [
        {
            "email": "dariusz.mrozek@polsl.pl",
            "name": "Dariusz Mrozek",
            "orcidid": "http://orcid.org/0000-0001-6764-6656",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://zti.polsl.pl/dmrozek/science/gpucassert/cassert.htm"
        }
    ],
    "description": "The GPU-based implementation of the CASSERT algorithm for protein 3D structure similarity searching. The algorithm is based on the two-phase alignment of protein structures when matching fragments of compared proteins.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://www.zti.aei.polsl.pl/w3/dmrozek/science/gpucassert/cassert.htm"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Structure alignment",
                    "uri": "http://edamontology.org/operation_0295"
                }
            ]
        }
    ],
    "homepage": "http://zti.polsl.pl/dmrozek/science/gpucassert/cassert.htm",
    "language": [
        "C",
        "C++"
    ],
    "lastUpdate": "2019-01-10T04:56:56Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/gpu-cassert-parallel-implementation-of-protein-3d-structure-similarity-searching-on-gpu-and-cuda.html"
        }
    ],
    "name": "GPU-CASSERT",
    "operatingSystem": [
        "Windows"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1007/s00894-014-2067-1",
            "metadata": {
                "abstract": "Searching for similar 3D protein structures is one of the primary processes employed in the field of structural bioinformatics. However, the computational complexity of this process means that it is constantly necessary to search for new methods that can perform such a process faster and more efficiently. Finding molecular substructures that complex protein structures have in common is still a challenging task, especially when entire databases containing tens or even hundreds of thousands of protein structures must be scanned. Graphics processing units (GPUs) and general purpose graphics processing units (GPGPUs) can perform many time-consuming and computationally demanding processes much more quickly than a classical CPU can. In this paper, we describe the GPU-based implementation of the CASSERT algorithm for 3D protein structure similarity searching. This algorithm is based on the two-phase alignment of protein structures when matching fragments of the compared proteins. The GPU (GeForce GTX 560Ti: 384 cores, 2GB RAM) implementation of CASSERT (\"GPU- CASSERT\") parallelizes both alignment phases and yields an average 180-fold increase in speed over its CPU-based, single-core implementation on an Intel Xeon E5620 (2.40GHz, 4 cores). In this paper, we show that massive parallelization of the 3D structure similarity search process on many-core GPU devices can reduce the execution time of the process, allowing it to be performed in real time. GPU-CASSERT is available at: http://zti.polsl.pl/ dmrozek/science/gpucassert/cassert.htm. © 2014 The Author(s).",
                "authors": [
                    {
                        "name": "Brozek M."
                    },
                    {
                        "name": "Malysiak-Mrozek B."
                    },
                    {
                        "name": "Mrozek D."
                    }
                ],
                "citationCount": 28,
                "date": "2014-01-01T00:00:00Z",
                "journal": "Journal of Molecular Modeling",
                "title": "Parallel implementation of 3D protein structure similarity searches using a GPU and the CUDA"
            },
            "pmcid": "PMC3936136",
            "pmid": "24481593",
            "type": [
                "Primary"
            ]
        },
        {
            "doi": "10.1007/978-3-642-38865-1_34",
            "metadata": {
                "abstract": "Protein structure alignment allows assessment of protein similarities and leads to the knowledge of the nature of proteins themselves. In this paper, we present a new version of the two-phase alignment algorithm for matching protein structures, called CASSERT. The algorithm can be used in scanning databases of protein structures while searching protein similarities. Effectiveness of the CASSERT was studied comparing its results to those returned by DALI algorithm. Performed tests confirm that the CASSERT algorithm exhibits high effectiveness in protein structure similarity searching and can be a useful tool in the identification of proteins and their functions. © Springer-Verlag Berlin Heidelberg 2013.",
                "authors": [
                    {
                        "name": "Malysiak-Mrozek B."
                    },
                    {
                        "name": "Mrozek D."
                    }
                ],
                "citationCount": 15,
                "date": "2013-01-01T00:00:00Z",
                "journal": "Communications in Computer and Information Science",
                "title": "CASSERT: A Two-Phase Alignment Algorithm for Matching 3D Structures of Proteins"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        },
        {
            "term": "Structural biology",
            "uri": "http://edamontology.org/topic_1317"
        },
        {
            "term": "Structure analysis",
            "uri": "http://edamontology.org/topic_0081"
        }
    ],
    "validated": 1
}
