{
    "additionDate": "2017-01-13T13:15:28Z",
    "biotoolsCURIE": "biotools:mirtools",
    "biotoolsID": "mirtools",
    "description": "Web server for microRNA data analysis, profiling and discovery based on high-throughput sequencing.",
    "editPermission": {
        "authors": [
            "ELIXIR-EE"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "miRNA expression analysis",
                    "uri": "http://edamontology.org/operation_3792"
                },
                {
                    "term": "Read mapping",
                    "uri": "http://edamontology.org/operation_3198"
                },
                {
                    "term": "RNA-Seq analysis",
                    "uri": "http://edamontology.org/operation_3680"
                }
            ]
        }
    ],
    "homepage": "http://centre.bioinformatics.zj.cn/mirtools/",
    "language": [
        "PHP",
        "Perl"
    ],
    "lastUpdate": "2019-07-23T08:36:23Z",
    "maturity": "Mature",
    "name": "MirTools",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "seqwiki_import",
    "publication": [
        {
            "metadata": {
                "abstract": "miRNAs are small, non-coding RNA that negatively regulate gene expression at post-transcriptional level, which play crucial roles in various physiological and pathological processes, such as development and tumorigenesis. Although deep sequencing technologies have been applied to investigate various small RNA transcriptomes, their computational methods are far away from maturation as compared to microarray-based approaches. In this study, a comprehensive web server mirTools was developed to allow researchers to comprehensively characterize small RNA transcriptome. With the aid of mirTools, users can: (i) filter low-quality reads and 3/50 adapters from raw sequenced data; (ii) align large-scale short reads to the reference genome and explore their length distribution; (iii) classify small RNA candidates into known categories, such as known miRNAs, non-coding RNA, genomic repeats and coding sequences; (iv) provide detailed annotation information for known miRNAs, such as miRNA/miRNA, absolute/relative reads count and the most abundant tag; (v) predict novel miRNAs that have not been characterized before; and (vi) identify differentially expressed miRNAs between samples based on two different counting strategies: total read tag counts and the most abundant tag counts. We believe that the integration of multiple computational approaches in mirTools will greatly facilitate current microRNA researches in multiple ways. mirTools can be accessed at http://centre.bioinformatics.zj.cn/mirtools/ and http://59.79.168.90/mirtools. © The Author(s) 2010. Published by Oxford University Press.",
                "authors": [
                    {
                        "name": "Zhu E."
                    },
                    {
                        "name": "Zhao F."
                    },
                    {
                        "name": "Xu G."
                    },
                    {
                        "name": "Hou H."
                    },
                    {
                        "name": "Zhou L."
                    },
                    {
                        "name": "Li X."
                    },
                    {
                        "name": "Sun Z."
                    },
                    {
                        "name": "Wu J."
                    }
                ],
                "citationCount": 92,
                "date": "2010-05-15T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "MirTools: MicroRNA profiling and discovery based on high-throughput sequencing"
            },
            "pmid": "20478827"
        }
    ],
    "toolType": [
        "Web service"
    ],
    "topic": [
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        },
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "RNA-seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ],
    "validated": 1
}