{
    "additionDate": "2017-08-03T18:52:40Z",
    "biotoolsCURIE": "biotools:nebula",
    "biotoolsID": "nebula",
    "collectionID": [
        "Nebula"
    ],
    "credit": [
        {
            "email": "galaxy.contact@curie.fr",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://bioinfo-out.curie.fr/"
        }
    ],
    "description": "Web service powered by Galaxy which allows users (Bioinformaticians as far as Biologists) to analyze their ChIP-seq data.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://nebula.curie.fr/static/nebula_tutorial.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein-nucleic acid binding site analysis",
                    "uri": "http://edamontology.org/operation_0389"
                }
            ]
        }
    ],
    "homepage": "https://nebula.curie.fr/",
    "homepage_status": 1,
    "language": [
        "Perl",
        "R"
    ],
    "lastUpdate": "2019-02-12T15:52:36Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/nebula-20130627-chip-seq-data-analysis.html"
        }
    ],
    "name": "Nebula",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Motivation: ChIP-seq consists of chromatin immunoprecipitation and deep sequencing of the extracted DNA fragments. It is the technique of choice for accurate characterization of the binding sites of transcription factors and other DNA-associated proteins. We present a web service, Nebula, which allows inexperienced users to perform a complete bioinformatics analysis of ChIP-seq data. Results: Nebula was designed for both bioinformaticians and biologists. It is based on the Galaxy open source framework. Galaxy already includes a large number of functionalities for mapping reads and peak calling. We added the following to Galaxy: (i) peak calling with FindPeaks and a module for immunoprecipitation quality control, (ii) de novo motif discovery with ChIPMunk, (iii) calculation of the density and the cumulative distribution of peak locations relative to gene transcription start sites, (iv) annotation of peaks with genomic features and (v) annotation of genes with peak information. Nebula generates the graphs and the enrichment statistics at each step of the process. During Steps 3-5, Nebula optionally repeats the analysis on a control dataset and compares these results with those from the main dataset. Nebula can also incorporate gene expression (or gene modulation) data during these steps. In summary, Nebula is an innovative web service that provides an advanced ChIP-seq analysis pipeline providing ready-to-publish results. © The Author 2012. Published by Oxford University Press. All rights reserved.",
                "authors": [
                    {
                        "name": "Barette C."
                    },
                    {
                        "name": "Barillot E."
                    },
                    {
                        "name": "Boeva V."
                    },
                    {
                        "name": "Guillouf C."
                    },
                    {
                        "name": "Lermine A."
                    }
                ],
                "citationCount": 24,
                "date": "2012-10-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Nebula-a web-server for advanced ChIP-seq data analysis"
            },
            "pmid": "22829625"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "ChIP-seq",
            "uri": "http://edamontology.org/topic_3169"
        },
        {
            "term": "DNA binding sites",
            "uri": "http://edamontology.org/topic_3125"
        },
        {
            "term": "Data architecture, analysis and design",
            "uri": "http://edamontology.org/topic_3365"
        }
    ],
    "validated": 1
}
