{"credit":[{"email":"jens.allmer@wur.nl","name":"Jens Allmer","typeEntity":"Person","typeRoles":["Primary contact"]}],"function":[{"operation":[{"term":"Analysis","uri":"http://edamontology.org/operation_2945"}]}],"labels":{"toolType":["Web application"],"topic":[{"term":"ChIP-seq","uri":"http://edamontology.org/topic_3169"},{"term":"Plant biology","uri":"http://edamontology.org/topic_0780"},{"term":"Transcription factors and regulatory sites","uri":"http://edamontology.org/topic_0749"},{"term":"Immunoprecipitation experiment","uri":"http://edamontology.org/topic_3656"},{"term":"Database management","uri":"http://edamontology.org/topic_3489"}]},"publication":[{"abstract":"Although several tools for the analysis of ChIP-seq data have been published recently, there is a growing demand, in particular in the plant research community, for computational resources with which such data can be processed, analyzed, stored, visualized and integrated within a single, user-friendly environment. To accommodate this demand, we have developed PRI-CAT (Plant Research International ChIP-seq analysis tool), a web-based workflow tool for the management and analysis of ChIP-seq experiments. PRI-CAT is currently focused on Arabidopsis, but will be extended with other plant species in the near future. Users can directly submit their sequencing data to PRI-CAT for automated analysis. A QuickLoad server compatible with genome browsers is implemented for the storage and visualization of DNA-binding maps. Submitted datasets and results can be made publicly available through PRI-CAT, a feature that will enable community-based integrative analysis and visualization of ChIP-seq experiments. Secondary analysis of data can be performed with the aid of GALAXY, an external framework for tool and data integration. PRI-CAT is freely available at http://www.ab.wur.nl/pricat. No login is required. © 2011 The Author(s).","authors":["Muino J.M.","Hoogstraat M.","Van Ham R.C.H.J.","Van Dijk A.D.J."],"cit_count":14,"journal":"Nucleic Acids Research","pmid":"21609962","title":"PRI-CAT: A web-tool for the analysis, storage and visualization of plant ChIP-seq experiments","year":"2011-07-01"}],"summary":{"biotoolsCURIE":"biotools:pri-cat","biotoolsID":"pri-cat","description":"PRI-CAT is a web-based workflow tool for the management and analysis of plant ChIP-seq experiments, with focus on Arabidopsis. Secondary analysis can be performed with the aid of GALAXY.","homepage":"http://www.ab.wur.nl/pricat","name":"PRI-CAT"}}