{
    "additionDate": "2018-10-15T16:34:03Z",
    "biotoolsCURIE": "biotools:scotti",
    "biotoolsID": "scotti",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://bitbucket.org/nicofmay/scotti/pull-requests/"
        }
    ],
    "description": "Structured COalescent Transmission Tree Inference. BEAST 2 package to reconstruct transmission trees from genetic data of the pathogen and epidemiological data simultaneously.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                },
                {
                    "term": "Modelling and simulation",
                    "uri": "http://edamontology.org/operation_2426"
                },
                {
                    "term": "Phylogenetic tree generation",
                    "uri": "http://edamontology.org/operation_0323"
                }
            ]
        }
    ],
    "homepage": "https://bitbucket.org/nicofmay/scotti/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2018-12-10T12:59:01Z",
    "license": "GPL-3.0",
    "name": "SCOTTI",
    "owner": "aotamendi.1",
    "publication": [
        {
            "doi": "10.1371/journal.pcbi.1005184",
            "metadata": {
                "abstract": "© 2016 Liu et al.The existence of over- and under-represented sequence motifs in genomes provides evidence of selective evolutionary pressures on biological mechanisms such as transcription, translation, ligand-substrate binding, and host immunity. In order to accurately identify motifs and other genome-scale patterns of interest, it is essential to be able to generate accurate null models that are appropriate for the sequences under study. While many tools have been developed to create random nucleotide sequences, protein coding sequences are subject to a unique set of constraints that complicates the process of generating appropriate null models. There are currently no tools available that allow users to create random coding sequences with specified amino acid composition and GC content for the purpose of hypothesis testing. Using the principle of maximum entropy, we developed a method that generates unbiased random sequences with pre-specified amino acid and GC content, which we have developed into a python package. Our method is the simplest way to obtain maximally unbiased random sequences that are subject to GC usage and primary amino acid sequence constraints. Furthermore, this approach can easily be expanded to create unbiased random sequences that incorporate more complicated constraints such as individual nucleotide usage or even di-nucleotide frequencies. The ability to generate correctly specified null models will allow researchers to accurately identify sequence motifs which will lead to a better understanding of biological processes as well as more effective engineering of biological systems.",
                "authors": [
                    {
                        "name": "Amaral L.A.N."
                    },
                    {
                        "name": "Hockenberry A.J."
                    },
                    {
                        "name": "Jewett M.C."
                    },
                    {
                        "name": "Lancichinetti A."
                    },
                    {
                        "name": "Liu S.S."
                    }
                ],
                "citationCount": 6,
                "date": "2016-11-01T00:00:00Z",
                "journal": "PLoS Computational Biology",
                "title": "NullSeq: A Tool for Generating Random Coding Sequences with Desired Amino Acid and GC Contents"
            },
            "pmcid": "PMC5106001",
            "pmid": "27835644",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Phylogenomics",
            "uri": "http://edamontology.org/topic_0194"
        },
        {
            "term": "Public health and epidemiology",
            "uri": "http://edamontology.org/topic_3305"
        }
    ],
    "validated": 1
}
