{
    "accessibility": "Open access",
    "additionDate": "2023-11-07T10:22:23.980179Z",
    "biotoolsCURIE": "biotools:cvd22",
    "biotoolsID": "cvd22",
    "collectionID": [
        "COVID-19"
    ],
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Ecir Uğur Küçüksille",
            "typeEntity": "Person"
        },
        {
            "name": "Kevser Kübra Kırboğa",
            "typeEntity": "Person"
        },
        {
            "name": "Muhammet Emin Naldan",
            "typeEntity": "Person"
        }
    ],
    "description": "Explainable artificial intelligence determination of the relationship of troponin to D-Dimer, mortality, and CK-MB in COVID-19 patients.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Dimensionality reduction",
                    "uri": "http://edamontology.org/operation_3935"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "https://cvd22covid.streamlitapp.com/",
    "lastUpdate": "2023-11-07T10:22:23.982613Z",
    "name": "CVD22",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1016/J.CMPB.2023.107492",
            "metadata": {
                "abstract": "Background and purpose: COVID-19, which emerged in Wuhan (China), is one of the deadliest and fastest-spreading pandemics as of the end of 2019. According to the World Health Organization (WHO), there are more than 100 million infectious cases worldwide. Therefore, research models are crucial for managing the pandemic scenario. However, because the behavior of this epidemic is so complex and difficult to understand, an effective model must not only produce accurate predictive results but must also have a clear explanation that enables human experts to act proactively. For this reason, an innovative study has been planned to diagnose Troponin levels in the COVID-19 process with explainable white box algorithms to reach a clear explanation. Methods: Using the pandemic data provided by Erzurum Training and Research Hospital (decision number: 2022/13-145), an interpretable explanation of Troponin data was provided in the COVID-19 process with SHApley Additive exPlanations (SHAP) algorithms. Five machine learning (ML) algorithms were developed. Model performances were determined based on training, test accuracies, precision, F1-score, recall, and AUC (Area Under the Curve) values. Feature importance was estimated according to Shapley values by applying the SHApley Additive exPlanations (SHAP) method to the model with high accuracy. The model created with Streamlit v.3.9 was integrated into the interface with the name CVD22. Results: Among the five-machine learning (ML) models created with pandemic data, the best model was selected with the values of 1.0, 0.83, 0.86, 0.83, 0.80, and 0.91 in train and test accuracy, precision, F1-score, recall, and AUC values, respectively. As a result of feature selection and SHApley Additive exPlanations (SHAP) algorithms applied to the XGBoost model, it was determined that DDimer mean, mortality, CKMB (creatine kinase myocardial band), and Glucose were the features with the highest importance over the model estimation. Conclusions: Recent advances in new explainable artificial intelligence (XAI) models have successfully made it possible to predict the future using large historical datasets. Therefore, throughout the ongoing pandemic, CVD22 (https://cvd22covid.streamlitapp.com/) can be used as a guide to help authorities or medical professionals make the best decisions quickly.",
                "authors": [
                    {
                        "name": "Aksakal E."
                    },
                    {
                        "name": "Gulcu O."
                    },
                    {
                        "name": "Isik M."
                    },
                    {
                        "name": "Kirboga K.K."
                    },
                    {
                        "name": "Kucuksille E.U."
                    },
                    {
                        "name": "Naldan M.E."
                    }
                ],
                "date": "2023-05-01T00:00:00Z",
                "journal": "Computer Methods and Programs in Biomedicine",
                "title": "CVD22: Explainable artificial intelligence determination of the relationship of troponin to D-Dimer, mortality, and CK-MB in COVID-19 patients"
            },
            "pmcid": "PMC10023204",
            "pmid": "36965300"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Critical care medicine",
            "uri": "http://edamontology.org/topic_3403"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        }
    ]
}
