{
    "additionDate": "2021-01-18T11:15:18Z",
    "biotoolsCURIE": "biotools:crisprsql",
    "biotoolsID": "crisprsql",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "florian.stortz@cs.ox.ac.uk",
            "name": "Florian Störtz",
            "typeEntity": "Person"
        }
    ],
    "description": "crisprSQL is a SQL-based database for CRISPR/Cas9 off-target cleavage assays. It is a one-stop source for epigenetically annotated, base-pair resolved cleavage frequency distributions. This hand-curated dataset can act as an insight into state-of-the-art technologies driving transgenics, inform guide RNA design for genome engineering, and serve as a shared, transparent basis for modelling off-target DNA cleavage of CRISPR/Cas. Attached gene IDs make the high-resolution data usable for informing knockout screens, functional genomics and transcriptomics research.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Editing",
                    "uri": "http://edamontology.org/operation_3096"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                }
            ]
        }
    ],
    "homepage": "http://www.crisprsql.com",
    "lastUpdate": "2021-02-18T15:41:04Z",
    "name": "crisprSQL",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/NAR/GKAA885",
            "metadata": {
                "abstract": "© The Author(s) 2020. Published by Oxford University Press on behalf of Nucleic Acids Research.With ongoing development of the CRISPR/Cas programmable nuclease system, applications in the area of in vivo therapeutic gene editing are increasingly within reach. However, non-negligible off-target effects remain a major concern for clinical applications. Even though a multitude of off-target cleavage datasets have been published, a comprehensive, transparent overview tool has not yet been established. Here, we present crisprSQL (http://www.crisprsql.com), an interactive and bioinformatically enhanced collection of CRISPR/Cas9 off-target cleavage studies aimed at enriching the fields of cleavage profiling, gene editing safety analysis and transcriptomics. The current version of crisprSQL contains cleavage data from 144 guide RNAs on 25,632 guide-target pairs from human and rodent cell lines, with interaction-specific references to epigenetic markers and gene names. The first curated database of this standard, it promises to enhance safety quantification research, inform experiment design and fuel development of computational off-target prediction algorithms.",
                "authors": [
                    {
                        "name": "Minary P."
                    },
                    {
                        "name": "Stortz F."
                    }
                ],
                "date": "2021-01-08T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "CrisprSQL: A novel database platform for CRISPR/Cas off-target cleavage assays"
            },
            "pmid": "33084893"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        },
        {
            "term": "Immunoproteins and antigens",
            "uri": "http://edamontology.org/topic_2830"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ]
}
