{
    "additionDate": "2021-01-18T07:36:02Z",
    "biotoolsCURIE": "biotools:aqua-hichip",
    "biotoolsID": "aqua-hichip",
    "confidence_flag": "tool",
    "credit": [
        {
            "name": "Benjamin Z. Stanton",
            "typeEntity": "Person"
        },
        {
            "name": "Berkley E. Gryder",
            "typeEntity": "Person"
        },
        {
            "name": "Javed Khan",
            "typeEntity": "Person"
        }
    ],
    "description": "Measurement of differential chromatin interactions with absolute quantification of architecture (AQuA-HiChIP).\n\nBioinformatic tools (R scripts) for the analysis of Absolute Quantification of Architecture (AQuA-HiChIP) style data.\n\nInduced chromatin interactions anchored with protein contacts will be readily differentiated using AQuA-HiChIP, but with normalizing by total interactive paired-end tags (PETs), differential interaction frequencies may produce false positives or false negatives.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Peak calling",
                    "uri": "http://edamontology.org/operation_3222"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/GryderArt/AQuA-HiChIP",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-01-28T18:14:25Z",
    "name": "AQuA-HiChIP",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1038/S41596-019-0285-9",
            "metadata": {
                "abstract": "© 2020, This is a U.S. government work and not under copyright protection in the U.S.; foreign copyright protection may apply.Methods developed to capture protein-anchored chromatin interactions (chromatin interaction analysis by paired-end tag sequencing and HiChIP) have yielded tremendous insights into the 3D folding principles of the genome, but are normalized by sequencing depth and therefore unable to accurately measure global changes in chromatin interactions and contact domain organization. We herein describe the protocol for absolute quantification of chromatin architecture (AQuA)–HiChIP, an advance that allows the absolute differences in protein-anchored chromatin interactions between samples to be determined. With our method, defined ratios of mouse and human fixed nuclei are mixed and subjected to endonuclease digestion. Chromatin contacts are captured by biotin-dATP incorporation and proximity ligation, followed by gentle shearing, ChIP, biotin capture and paired-end sequencing. 3D contacts are counted from paired-end tags (PETs) from the human genome and are normalized to the total PETs from the mouse genome. As orthogonal normalization allows observation of global changes, the approach will enable more quantitative insights into the topological determinants of transcriptional control and tissue-specific epigenetic memory. With our approach, we have discovered that rapid histone deacetylase inhibition disrupts super enhancer function by creating many new aberrant contacts. The code for data analysis is available at https://github.com/GryderArt/AQuA-HiChIP. This protocol reports both experimental and bioinformatic details to perform AQuA-HiChIP, going from cell culture to ranking chromatin interactions within 6 d.",
                "authors": [
                    {
                        "name": "Gryder B.E."
                    },
                    {
                        "name": "Khan J."
                    },
                    {
                        "name": "Stanton B.Z."
                    }
                ],
                "citationCount": 7,
                "date": "2020-03-01T00:00:00Z",
                "journal": "Nature Protocols",
                "title": "Measurement of differential chromatin interactions with absolute quantification of architecture (AQuA-HiChIP)"
            },
            "pmid": "32051612"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "ChIP-on-chip",
            "uri": "http://edamontology.org/topic_3179"
        },
        {
            "term": "ChIP-seq",
            "uri": "http://edamontology.org/topic_3169"
        },
        {
            "term": "Epigenomics",
            "uri": "http://edamontology.org/topic_3173"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ]
}
