{
    "additionDate": "2020-01-14T19:42:07Z",
    "biotoolsCURIE": "biotools:CDSeq",
    "biotoolsID": "CDSeq",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "kai.kang@nih.gov",
            "name": "Kai Kang",
            "orcidid": "https://orcid.org/0000-0002-4348-3941",
            "typeEntity": "Person"
        },
        {
            "email": "li3@niehs.nih.gov",
            "name": "Leping Li",
            "orcidid": "https://orcid.org/0000-0003-4208-0259",
            "typeEntity": "Person"
        }
    ],
    "description": "A novel complete deconvolution method for dissecting heterogeneous samples using gene expression data.\n\nCDSeq MATLAB code. CDSeq is a novel computational complete deconvolution method for dissecting tissue heterogeneity.\n\nCDSeq: A complete deconvolution method for dissecting tissue heterogeneity.\n\nAdded data-dilution option to speed up the algorithm. We provided explaination in the manuscript which you can find on bioRxiv. Check out the demo.m in CDSeq_012 for details",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Deisotoping",
                    "uri": "http://edamontology.org/operation_3629"
                },
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                },
                {
                    "term": "Sorting",
                    "uri": "http://edamontology.org/operation_3802"
                }
            ]
        }
    ],
    "homepage": "https://github.com/kkang7/CDSeq",
    "language": [
        "Shell",
        "MATLAB",
        "C++"
    ],
    "lastUpdate": "2021-03-21T12:17:59Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/kkang7/CDSeq_R_Package"
        }
    ],
    "name": "CDSeq",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PCBI.1007510",
            "metadata": {
                "abstract": "This is an open access article, free of all copyright, and may be freely reproduced, distributed, transmitted, modified, built upon, or otherwise used by anyone for any lawful purpose. The work is made available under the Creative Commons CC0 public domain dedication.Quantifying cell-type proportions and their corresponding gene expression profiles in tissue samples would enhance understanding of the contributions of individual cell types to the physiological states of the tissue. Current approaches that address tissue heterogeneity have drawbacks. Experimental techniques, such as fluorescence-activated cell sorting, and single cell RNA sequencing are expensive. Computational approaches that use expression data from heterogeneous samples are promising, but most of the current methods estimate either cell-type proportions or cell-type-specific expression profiles by requiring the other as input. Although such partial deconvolution methods have been successfully applied to tumor samples, the additional input required may be unavailable. We introduce a novel complete deconvolution method, CDSeq, that uses only RNA-Seq data from bulk tissue samples to simultaneously estimate both cell-type proportions and cell-type-specific expression profiles. Using several synthetic and real experimental datasets with known cell-type composition and cell-type-specific expression profiles, we compared CDSeq’s complete deconvolution performance with seven other established deconvolution methods. Complete deconvolution using CDSeq represents a substantial technical advance over partial deconvolution approaches and will be useful for studying cell mixtures in tissue samples. CDSeq is available at GitHub repository (MATLAB and Octave code): https://github.com/kkang7/ CDSeq.",
                "authors": [
                    {
                        "name": "Kang K."
                    },
                    {
                        "name": "Meng Q."
                    },
                    {
                        "name": "Shats I."
                    },
                    {
                        "name": "Umbach D.M."
                    },
                    {
                        "name": "Li M."
                    },
                    {
                        "name": "Li Y."
                    },
                    {
                        "name": "Li X."
                    },
                    {
                        "name": "Li L."
                    }
                ],
                "citationCount": 5,
                "date": "2019-01-01T00:00:00Z",
                "journal": "PLoS Computational Biology",
                "title": "CDSeq: A novel complete deconvolution method for dissecting heterogeneous samples using gene expression data"
            },
            "pmcid": "PMC6907860",
            "pmid": "31790389"
        },
        {
            "doi": "10.1101/2021.01.30.428954"
        }
    ],
    "topic": [
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        },
        {
            "term": "Physiology",
            "uri": "http://edamontology.org/topic_3300"
        }
    ],
    "validated": 1
}