
{
    "credit": [
        {
            "email": "ahmet.sacan@drexel.edu",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://sacan.biomed.drexel.edu/ahmet"
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://sacan.biomed.drexel.edu/unialign/"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Pairwise structure alignment",
                    "uri": "http://edamontology.org/operation_0503"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Proteins",
                "uri": "http://edamontology.org/topic_0078"
            },
            {
                "term": "Protein sites, features and motifs",
                "uri": "http://edamontology.org/topic_3510"
            },
            {
                "term": "Sequence analysis",
                "uri": "http://edamontology.org/topic_0080"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/unialign-protein-pairwise-structure-alignment-with-evolution-and-sequence-information.html"
        }
    ],
    "publication": [
        {
            "abstract": "© The Author 2015. Motivation: During the evolution, functional sites on the surface of the protein as well as the hydrophobic core maintaining the structural integrity are well-conserved. However, available protein structure alignment methods align protein structures based solely on the 3D geometric similarity, limiting their ability to detect functionally relevant correspondences between the residues of the proteins, especially for distantly related homologous proteins. Results: In this article, we propose a new protein pairwise structure alignment algorithm (UniAlign) that incorporates additional evolutionary information captured in the form of sequence similarity, sequence profiles and residue conservation. We define a per-residue score (UniScore) as a weighted sum of these and other features and develop an iterative optimization procedure to search for an alignment with the best overall UniScore. Our extensive experiments on CDD, HOMSTRAD and BAliBASE benchmark datasets show that UniAlign outperforms commonly used structure alignment methods. We further demonstrate UniAlign's ability to develop family-specific models to drastically improve the quality of the alignments.",
            "authors": [
                "Zhao C.",
                "Sacan A."
            ],
            "cit_count": 3,
            "journal": "Bioinformatics",
            "pmid": "26059715",
            "title": "UniAlign: Protein structure alignment meets evolution",
            "year": "2015-10-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:unialign",
        "biotoolsID": "unialign",
        "description": "Protein pairwise structure alignment algorithm that incorporates additional evolutionary information captured in the form of sequence similarity, sequence profiles, and residue conservation.",
        "homepage": "http://sacan.biomed.drexel.edu/unialign",
        "name": "UniAlign"
    }
}