{
    "accessibility": "Open access",
    "additionDate": "2024-01-30T10:58:39.932340Z",
    "biotoolsCURIE": "biotools:hibrowser",
    "biotoolsID": "hibrowser",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "jianliu@nankai.edu.cn",
            "name": "Jian Liu",
            "typeEntity": "Person"
        },
        {
            "email": "lujianguo@mail.sysu.edu.cn",
            "name": "Jianguo Lu",
            "typeEntity": "Person"
        }
    ],
    "description": "Interactive and dynamic browser for synchronous Hi-C data visualization.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://github.com/lyotvincent/HiBrowser",
    "lastUpdate": "2024-01-30T10:58:39.935196Z",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "https://hic.bioaimed.com/"
        }
    ],
    "name": "HiBrowser",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIB/BBAD283",
            "metadata": {
                "abstract": "With the development of chromosome conformation capture technology, the genome-wide investigation of higher-order chromatin structure by using high-throughput chromatin conformation capture (Hi-C) technology is emerging as an important component for understanding the mechanism of gene regulation. Considering genetic and epigenetic differences are typically used to explore the pathological reasons on the chromosome and gene level, visualizing multi-omics data and performing an intuitive analysis by using an interactive browser become a powerful and welcomed way. In this paper, we develop an effective sequence and chromatin interaction data display browser called HiBrowser for visualizing and analyzing Hi-C data and their associated genetic and epigenetic annotations. The advantages of HiBrowser are flexible multi-omics navigation, novel multidimensional synchronization comparisons and dynamic interaction system. In particular, HiBrowser first provides an out of the box web service and allows flexible and dynamic reconstruction of custom annotation tracks on demand during running. In order to conveniently and intuitively analyze the similarities and differences among multiple samples, such as visual comparisons of normal and tumor tissue samples, and pan genomes of multiple (consanguineous) species, HiBrowser develops a clone mode to synchronously display the genome coordinate positions or the same regions of multiple samples on the same page of visualization. HiBrowser also supports a pluralistic and precise search on correlation data of distal cis-regulatory elements and navigation to any region on Hi-C heatmap of interest according to the searching results. HiBrowser is a no-build tool, and could be easily deployed in local server. The source code is available at https://github.com/lyotvincent/HiBrowser.",
                "authors": [
                    {
                        "name": "Li P."
                    },
                    {
                        "name": "Liu H."
                    },
                    {
                        "name": "Liu J."
                    },
                    {
                        "name": "Lu J."
                    },
                    {
                        "name": "Sun J."
                    }
                ],
                "citationCount": 1,
                "date": "2023-09-01T00:00:00Z",
                "journal": "Briefings in Bioinformatics",
                "title": "HiBrowser: an interactive and dynamic browser for synchronous Hi-C data visualization"
            },
            "pmid": "37544661"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Chromosome conformation capture",
            "uri": "http://edamontology.org/topic_3940"
        },
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        }
    ]
}
