{
    "accessibility": "Open access",
    "additionDate": "2022-06-07T06:10:15.770178Z",
    "biotoolsCURIE": "biotools:cycpeptppb",
    "biotoolsID": "cycpeptppb",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "akiyama@c.titech.ac.jp",
            "name": "Yutaka Akiyama",
            "orcidid": "https://orcid.org/0000-0003-2863-8703",
            "typeEntity": "Person"
        }
    ],
    "description": "CycPeptPPB is a predictor of Plasma Protein Binding rate for cyclic peptide with high performance focusing on residue-level features and circularity.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Protein feature detection",
                    "uri": "http://edamontology.org/operation_3092"
                },
                {
                    "term": "Side chain modelling",
                    "uri": "http://edamontology.org/operation_0480"
                },
                {
                    "term": "Small molecule design",
                    "uri": "http://edamontology.org/operation_4009"
                }
            ]
        }
    ],
    "homepage": "https://github.com/akiyamalab/cycpeptppb",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-06-07T06:10:15.773354Z",
    "license": "BSD-3-Clause",
    "name": "CycPeptPPB",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAB726",
            "metadata": {
                "abstract": "© 2022 Oxford University Press. All rights reserved.Motivation: In recent years, cyclic peptide drugs have been receiving increasing attention because they can target proteins that are difficult to be tackled by conventional small-molecule drugs or antibody drugs. Plasma protein binding rate (%PPB) is a significant pharmacokinetic property of a compound in drug discovery and design. However, due to structural differences, previous computational prediction methods developed for small-molecule compounds cannot be successfully applied to cyclic peptides, and methods for predicting the PPB rate of cyclic peptides with high accuracy are not yet available. Results: Cyclic peptides are larger than small molecules, and their local structures have a considerable impact on PPB; thus, molecular descriptors expressing residue-level local features of cyclic peptides, instead of those expressing the entire molecule, as well as the circularity of the cyclic peptides should be considered. Therefore, we developed a prediction method named CycPeptPPB using deep learning that considers both factors. First, the macrocycle ring of cyclic peptides was decomposed residue by residue. The residue-based descriptors were arranged according to the sequence information of the cyclic peptide. Furthermore, the circular data augmentation method was used, and the circular convolution method CyclicConv was devised to express the cyclic structure. CycPeptPPB exhibited excellent performance, with mean absolute error (MAE) of 4.79% and correlation coefficient (R) of 0.92 for the public drug dataset, compared to the prediction performance of the existing PPB rate prediction software (MAE = 15:08%; R = 0:63).",
                "authors": [
                    {
                        "name": "Akiyama Y."
                    },
                    {
                        "name": "Li J."
                    },
                    {
                        "name": "Ohue M."
                    },
                    {
                        "name": "Yanagisawa K."
                    },
                    {
                        "name": "Yoshikawa Y."
                    }
                ],
                "date": "2022-02-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Plasma protein binding prediction focusing on residue-level features and circularity of cyclic peptides by deep learning"
            },
            "pmcid": "PMC8796384",
            "pmid": "34849593"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Drug discovery",
            "uri": "http://edamontology.org/topic_3336"
        },
        {
            "term": "Drug metabolism",
            "uri": "http://edamontology.org/topic_3375"
        },
        {
            "term": "Pharmacology",
            "uri": "http://edamontology.org/topic_0202"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ],
    "validated": 1
}
