{
    "accessibility": "Open access",
    "additionDate": "2020-01-14T19:46:13Z",
    "biotoolsCURIE": "biotools:Jaccard",
    "biotoolsID": "Jaccard",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "nchchung@gmail.com",
            "name": "Neo Christopher Chung",
            "orcidid": "https://orcid.org/0000-0001-6798-8867",
            "typeEntity": "Person"
        }
    ],
    "description": "Jaccard/Tanimoto similarity test and estimation methods for biological presence-absence data.\n\nTest Similarity Between Binary Data using Jaccard/Tanimoto Coefficients.\n\nCalculate statistical significance of Jaccard/Tanimoto similarity coefficients for binary data.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Statistical calculation",
                    "uri": "http://edamontology.org/operation_2238"
                }
            ]
        }
    ],
    "homepage": "https://cran.r-project.org/package=jaccard",
    "language": [
        "R"
    ],
    "lastUpdate": "2020-12-14T13:44:30Z",
    "license": "GPL-2.0",
    "name": "Jaccard",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12859-019-3118-5",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: A survey of presences and absences of specific species across multiple biogeographic units (or bioregions) are used in a broad area of biological studies from ecology to microbiology. Using binary presence-absence data, we evaluate species co-occurrences that help elucidate relationships among organisms and environments. To summarize similarity between occurrences of species, we routinely use the Jaccard/Tanimoto coefficient, which is the ratio of their intersection to their union. It is natural, then, to identify statistically significant Jaccard/Tanimoto coefficients, which suggest non-random co-occurrences of species. However, statistical hypothesis testing using this similarity coefficient has been seldom used or studied. Results: We introduce a hypothesis test for similarity for biological presence-absence data, using the Jaccard/Tanimoto coefficient. Several key improvements are presented including unbiased estimation of expectation and centered Jaccard/Tanimoto coefficients, that account for occurrence probabilities. The exact and asymptotic solutions are derived. To overcome a computational burden due to high-dimensionality, we propose the bootstrap and measurement concentration algorithms to efficiently estimate statistical significance of binary similarity. Comprehensive simulation studies demonstrate that our proposed methods produce accurate p-values and false discovery rates. The proposed estimation methods are orders of magnitude faster than the exact solution, particularly with an increasing dimensionality. We showcase their applications in evaluating co-occurrences of bird species in 28 islands of Vanuatu and fish species in 3347 freshwater habitats in France. The proposed methods are implemented in an open source R package called jaccard (https://cran.r-project.org/package=jaccard). Conclusion: We introduce a suite of statistical methods for the Jaccard/Tanimoto similarity coefficient for binary data, that enable straightforward incorporation of probabilistic measures in analysis for species co-occurrences. Due to their generality, the proposed methods and implementations are applicable to a wide range of binary data arising from genomics, biochemistry, and other areas of science.",
                "authors": [
                    {
                        "name": "Chung N.C."
                    },
                    {
                        "name": "Miasojedow Bl."
                    },
                    {
                        "name": "Startek M."
                    },
                    {
                        "name": "Gambin A."
                    }
                ],
                "citationCount": 7,
                "date": "2019-12-24T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Jaccard/Tanimoto similarity test and estimation methods for biological presence-absence data"
            },
            "pmcid": "PMC6929325",
            "pmid": "31874610"
        }
    ],
    "toolType": [
        "Command-line tool",
        "Library"
    ],
    "topic": [
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        },
        {
            "term": "Ecology",
            "uri": "http://edamontology.org/topic_0610"
        },
        {
            "term": "Biochemistry",
            "uri": "http://edamontology.org/topic_3292"
        },
        {
            "term": "Microbiology",
            "uri": "http://edamontology.org/topic_3301"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        }
    ],
    "validated": 1
}