{
    "additionDate": "2021-01-18T09:44:24Z",
    "biotoolsCURIE": "biotools:sinimin",
    "biotoolsID": "sinimin",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "karsten.borgwardt@bsse.ethz.ch",
            "name": "Karsten Borgwardt",
            "typeEntity": "Person"
        }
    ],
    "description": "Network-guided search for genetic heterogeneity between gene pairs.\n\nThis repository contains the code for the Significant Network Interval Mining approach, short SiNIMin, and its permutation-testing based counterpart SiNIMin-WY. The methods are described in Network-guided detection of candidate intervals that exhibit genetic heterogeneity (under review).",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                }
            ]
        }
    ],
    "homepage": "https://github.com/BorgwardtLab/SiNIMin",
    "language": [
        "C++"
    ],
    "lastUpdate": "2021-02-19T15:09:36Z",
    "license": "GPL-3.0",
    "name": "SiNIMin",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAA581",
            "metadata": {
                "abstract": "© The Author(s) 2020. Published by Oxford University Press.MOTIVATION: Correlating genetic loci with a disease phenotype is a common approach to improve our understanding of the genetics underlying complex diseases. Standard analyses mostly ignore two aspects, namely genetic heterogeneity and interactions between loci. Genetic heterogeneity, the phenomenon that genetic variants at different loci lead to the same phenotype, promises to increase statistical power by aggregating low-signal variants. Incorporating interactions between loci results in a computational and statistical bottleneck due to the vast amount of candidate interactions. RESULTS: We propose a novel method SiNIMin that addresses these two aspects by finding pairs of interacting genes that are, upon combination, associated with a phenotype of interest under a model of genetic heterogeneity. We guide the interaction search using biological prior knowledge in the form of protein-protein interaction networks. Our method controls type I error and outperforms state-of-the-art methods with respect to statistical power. Additionally, we find novel associations for multiple Arabidopsis thaliana phenotypes, and, with an adapted variant of SiNIMin, for a study of rare variants in migraine patients. AVAILABILITY AND IMPLEMENTATION: Code available at https://github.com/BorgwardtLab/SiNIMin. SUPPLEMENTARY INFORMATION: Supplementary data are available at Bioinformatics online.",
                "authors": [
                    {
                        "name": "Gumpinger A.C."
                    },
                    {
                        "name": "Rieck B."
                    },
                    {
                        "name": "Grimm D.G."
                    },
                    {
                        "name": "Borgwardt K."
                    }
                ],
                "date": "2021-04-09T00:00:00Z",
                "journal": "Bioinformatics (Oxford, England)",
                "title": "Network-guided search for genetic heterogeneity between gene pairs"
            },
            "pmid": "32573681"
        }
    ],
    "topic": [
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        },
        {
            "term": "Protein interaction experiment",
            "uri": "http://edamontology.org/topic_3957"
        },
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        }
    ]
}