{
    "additionDate": "2021-01-18T10:47:32Z",
    "biotoolsCURIE": "biotools:ncrdeep",
    "biotoolsID": "ncrdeep",
    "confidence_flag": "tool",
    "description": "Non-coding RNA classification with convolutional neural network.\n\nncRDeep: Non coding RNA classification with convolutional neural network.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein secondary structure prediction",
                    "uri": "http://edamontology.org/operation_0267"
                },
                {
                    "term": "RNA secondary structure alignment",
                    "uri": "http://edamontology.org/operation_0502"
                }
            ]
        }
    ],
    "homepage": "http://home.jbnu.ac.kr/NSCL/ncRDeep.htm",
    "lastUpdate": "2021-03-08T09:48:58Z",
    "name": "ncRDeep",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1016/J.COMPBIOLCHEM.2020.107364",
            "metadata": {
                "abstract": "© 2020 Elsevier LtdA non-coding RNA (ncRNA) is a kind of RNA that is not converted into protein, however, it is involved in many biological processes, diseases, and cancers. Numerous ncRNAs have been identified and classified with high throughput sequencing technology. Hence, accurate ncRNAs class prediction is important and necessary for further study of their functions. Several computation techniques have been employed to predict the class of ncRNAs. Recent classification methods used the secondary structure as their primary input. However, the computational tools of RNA secondary structure are not accurate enough which affects the final performance of ncRNAs predictors. In this paper, we propose a simple yet efficient method, called ncRDeep, for ncRNAs prediction. It uses a simple convolutional neural network and RNA sequence information only. The ncRDeep was evaluated on benchmark datasets and the comparison results showed that the ncRDeep outperforms the state-of-the-art methods significantly. More specifically, the average accuracy was improved by 8.32%. Finally, we built a freely accessible web server for the developed tool ncRDeep at http://home.jbnu.ac.kr/NSCL/ncRDeep.htm",
                "authors": [
                    {
                        "name": "Chantsalnyam T."
                    },
                    {
                        "name": "Lim D.Y."
                    },
                    {
                        "name": "Tayara H."
                    },
                    {
                        "name": "Chong K.T."
                    }
                ],
                "citationCount": 6,
                "date": "2020-10-01T00:00:00Z",
                "journal": "Computational Biology and Chemistry",
                "title": "ncRDeep: Non-coding RNA classification with convolutional neural network"
            },
            "pmid": "32890916"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        }
    ]
}