{
    "additionDate": "2021-01-18T09:32:49Z",
    "biotoolsCURIE": "biotools:tbtools",
    "biotoolsID": "tbtools",
    "confidence_flag": "tool",
    "description": "An Integrative Toolkit Developed for Interactive Analyses of Big Biological Data.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data handling",
                    "uri": "http://edamontology.org/operation_2409"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://github.com/CJ-Chen/TBtools/releases",
    "language": [
        "Java"
    ],
    "lastUpdate": "2021-02-26T17:30:19Z",
    "name": "TBtools",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1016/J.MOLP.2020.06.009",
            "metadata": {
                "abstract": "© 2020 The AuthorTBtools, a stand-alone bioinformatics software with a user-friendly interface is presented in this study. The toolkit incorporates over 130 functions, which are designed to meet the increasing demand for big-data analyses, ranging from bulk sequence processing to interactive data visualization. Its robustness has been validated by tens of thousands of users, making it a handy and useful toolkit for biologists. © 2020 The AuthorThe rapid development of high-throughput sequencing techniques has led biology into the big-data era. Data analyses using various bioinformatics tools rely on programming and command-line environments, which are challenging and time-consuming for most wet-lab biologists. Here, we present TBtools (a Toolkit for Biologists integrating various biological data-handling tools), a stand-alone software with a user-friendly interface. The toolkit incorporates over 130 functions, which are designed to meet the increasing demand for big-data analyses, ranging from bulk sequence processing to interactive data visualization. A wide variety of graphs can be prepared in TBtools using a new plotting engine (“JIGplot”) developed to maximize their interactive ability; this engine allows quick point-and-click modification of almost every graphic feature. TBtools is platform-independent software that can be run under all operating systems with Java Runtime Environment 1.6 or newer. It is freely available to non-commercial users at https://github.com/CJ-Chen/TBtools/releases.",
                "authors": [
                    {
                        "name": "Chen C."
                    },
                    {
                        "name": "Chen H."
                    },
                    {
                        "name": "Zhang Y."
                    },
                    {
                        "name": "Thomas H.R."
                    },
                    {
                        "name": "Frank M.H."
                    },
                    {
                        "name": "He Y."
                    },
                    {
                        "name": "Xia R."
                    }
                ],
                "citationCount": 735,
                "date": "2020-08-03T00:00:00Z",
                "journal": "Molecular Plant",
                "title": "TBtools: An Integrative Toolkit Developed for Interactive Analyses of Big Biological Data"
            },
            "pmid": "32585190"
        }
    ],
    "topic": [
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Gene and protein families",
            "uri": "http://edamontology.org/topic_0623"
        },
        {
            "term": "Bioinformatics",
            "uri": "http://edamontology.org/topic_0091"
        }
    ]
}