{
    "accessibility": "Open access",
    "additionDate": "2021-11-18T19:27:22.914853Z",
    "biotoolsCURIE": "biotools:arts_brain",
    "biotoolsID": "arts_brain",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "konstantinos_arfanakis@rush.edu",
            "name": "Konstantinos Arfanakis",
            "typeEntity": "Person"
        }
    ],
    "description": "ARTS is a fully automated biomarker that outputs a score linked to the likelihood a person suffers from arteriolosclerosis based on brain MRI data (3D T1w, T2w FLAIR, DTI data) and basic demographic information (age at MRI, sex). The higher the ARTS score, the higher the likelihood of arteriolosclerosis.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "Statistical calculation",
                    "uri": "http://edamontology.org/operation_2238"
                }
            ]
        }
    ],
    "homepage": "https://www.nitrc.org/projects/arts/",
    "lastUpdate": "2021-11-18T19:27:22.917368Z",
    "name": "ARTS",
    "operatingSystem": [
        "Mac",
        "Linux"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1016/J.NICL.2021.102768",
            "metadata": {
                "abstract": "© 2021 The Author(s)Brain arteriolosclerosis, one of the main pathologies of cerebral small vessel disease, is common in older adults and has been linked to lower cognitive and motor function and higher odds of dementia. In spite of its frequency and associated morbidity, arteriolosclerosis can only be diagnosed at autopsy. Therefore, the purpose of this work was to develop an in-vivo classifier of arteriolosclerosis based on brain MRI. First, an ex-vivo classifier of arteriolosclerosis was developed based on features related to white matter hyperintensities, diffusion anisotropy and demographics by applying machine learning to ex-vivo MRI and pathology data from 119 participants of the Rush Memory and Aging Project (MAP) and Religious Orders Study (ROS), two longitudinal cohort studies of aging that recruit non-demented older adults. The ex-vivo classifier showed good performance in predicting the presence of arteriolosclerosis, with an average area under the receiver operating characteristic curve AUC = 0.78. The ex-vivo classifier was then translated to in-vivo based on available in-vivo and ex-vivo MRI data on the same participants. The in-vivo classifier was named ARTS (short for ARTerioloSclerosis), is fully automated, and provides a score linked to the likelihood a person suffers from arteriolosclerosis. The performance of ARTS in predicting the presence of arteriolosclerosis in-vivo was tested in a separate, 91% dementia-free group of 79 MAP/ROS participants and exhibited an AUC = 0.79 in persons with antemortem intervals shorter than 2.4 years. This level of performance in mostly non-demented older adults is notable considering that arteriolosclerosis can only be diagnosed at autopsy. The scan-rescan reproducibility of the ARTS score was excellent, with an intraclass correlation of 0.99, suggesting that application of ARTS in longitudinal studies may show high sensitivity in detecting small changes. Finally, higher ARTS scores in non-demented older adults were associated with greater decline in cognition two years after baseline MRI, especially in perceptual speed which has been linked to arteriolosclerosis and small vessel disease. This finding was shown in a separate group of 369 non-demented MAP/ROS participants and was validated in 72 non-demented Black participants of the Minority Aging Research Study (MARS) and also in 244 non-demented participants of the Alzheimer's Disease Neuroimaging Initiative 2 and 3. The results of this work suggest that ARTS may have broad implications in the advancement of diagnosis, prevention and treatment of arteriolosclerosis. ARTS is publicly available at https://www.nitrc.org/projects/arts/.",
                "authors": [
                    {
                        "name": "Makkinejad N."
                    },
                    {
                        "name": "Evia A.M."
                    },
                    {
                        "name": "Tamhane A.A."
                    },
                    {
                        "name": "Javierre-Petit C."
                    },
                    {
                        "name": "Leurgans S.E."
                    },
                    {
                        "name": "Lamar M."
                    },
                    {
                        "name": "Barnes L.L."
                    },
                    {
                        "name": "Bennett D.A."
                    },
                    {
                        "name": "Schneider J.A."
                    },
                    {
                        "name": "Arfanakis K."
                    }
                ],
                "date": "2021-01-01T00:00:00Z",
                "journal": "NeuroImage: Clinical",
                "title": "ARTS: A novel In-vivo classifier of arteriolosclerosis for the older adult brain"
            },
            "pmcid": "PMC8329541",
            "pmid": "34330087"
        }
    ],
    "toolType": [
        "Workflow"
    ],
    "topic": [
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        },
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        }
    ]
}