{
    "accessibility": "Open access",
    "additionDate": "2017-01-13T13:13:28Z",
    "biotoolsCURIE": "biotools:abba",
    "biotoolsID": "abba",
    "cost": "Free of charge",
    "description": "Assembly Boosted By Amino acid sequence is a comparative gene assembler, which uses amino acid sequences from predicted proteins to help build a better assembly.",
    "download": [
        {
            "type": "Software package",
            "url": "ftp://ftp.cbcb.umd.edu/pub/data/dsommer/abba.tgz"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genome assembly",
                    "uri": "http://edamontology.org/operation_0525"
                },
                {
                    "term": "Mapping assembly",
                    "uri": "http://edamontology.org/operation_0523"
                },
                {
                    "term": "Scaffolding",
                    "uri": "http://edamontology.org/operation_3216"
                }
            ]
        }
    ],
    "homepage": "http://www.biofacebook.com/?p=250",
    "lastUpdate": "2020-06-16T10:55:24Z",
    "license": "Artistic-2.0",
    "maturity": "Mature",
    "name": "ABBA",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "seqwiki_import",
    "publication": [
        {
            "doi": "10.1371/journal.pcbi.1000186",
            "metadata": {
                "abstract": "Recent improvements in technology have made DNA sequencing dramatically faster and more efficient than ever before. The new technologies produce highly accurate sequences, but one drawback is that the most efficient technology produces the shortest read lengths. Short-read sequencing has been applied successfully to resequence the human genome and those of other species but not to whole-genome sequencing of novel organisms. Here we describe the sequencing and assembly of a novel clinical isolate of Pseudomonas aeruginosa, strain PAb1, using very short read technology. From 8,627,900 reads, each 33 nucleotides in length, we assembled the genome into one scaffold of 76 ordered contiguous sequences containing 6,290,005 nucleotides, including one contig spanning 512,638 nucleotides, plus an additional 436 unordered contigs containing 416,897 nucleotides. Our method includes a novel gene-boosting algorithm that uses amino acid sequences from predicted proteins to build a better assembly. This study demonstrates the feasibility of very short read sequencing for the sequencing of bacterial genomes, particularly those for which a related species has been sequenced previously, and expands the potential application of this new technology to most known prokaryotic species. © 2008 Salzberg et al.",
                "authors": [
                    {
                        "name": "Salzberg S.L."
                    },
                    {
                        "name": "Sommer D.D."
                    },
                    {
                        "name": "Puiu D."
                    },
                    {
                        "name": "Lee V.T."
                    }
                ],
                "citationCount": 41,
                "date": "2008-09-01T00:00:00Z",
                "journal": "PLoS Computational Biology",
                "title": "Gene-boosted assembly of a novel bacterial genome from very short reads"
            },
            "pmid": "18818729",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        }
    ],
    "validated": 1
}