{
    "additionDate": "2023-02-14T12:19:59.195740Z",
    "biotoolsCURIE": "biotools:covbinderinpdb",
    "biotoolsID": "covbinderinpdb",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "yingkai.zhang@nyu.edu",
            "name": "Yingkai Zhang",
            "typeEntity": "Person"
        }
    ],
    "description": "curated CovBinderInPDB database contains 7375 covalent modifications in which 2189 unique covalent binders target nine types of amino acid residues (Cys, Lys, Ser, Asp, Glu, His, Met, Thr, and Tyr) from 3555 complex structures of 1170 unique protein chains.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein design",
                    "uri": "http://edamontology.org/operation_4008"
                }
            ]
        }
    ],
    "homepage": "https://yzhang.hpc.nyu.edu/CovBinderInPDB",
    "language": [
        "JavaScript"
    ],
    "lastUpdate": "2024-11-24T15:01:06.884402Z",
    "license": "Not licensed",
    "name": "CovBinderInPDB",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1021/acs.jcim.2c01216",
            "metadata": {
                "abstract": "Covalent inhibition has emerged as a promising orthogonal approach for drug discovery, despite the significant challenge in achieving target specificity. To facilitate the structure-based rational design of target-specific covalent modulators, we developed an integrated computational protocol to curate covalent binders from the RCSB Protein Data Bank (PDB). Starting from the macromolecular crystallographic information files (mmCIF) in the PDB archive, covalent bond records, which indicate the side chain modification of amino acid residue by a covalent binder, were collected and cleaned. Then, residue-binder adducts, which are products of chemical reactions between targeted residues and covalent binders, were recovered with the help of the Chemical Component Dictionary in PDB. Finally, several strategies were employed to curate the pre-reaction forms of covalent binders from the adducts. Our curated CovBinderInPDB database contains 7375 covalent modifications in which 2189 unique covalent binders target nine types of amino acid residues (Cys, Lys, Ser, Asp, Glu, His, Met, Thr, and Tyr) from 3555 complex structures of 1170 unique protein chains. This database would set a solid foundation for developing and benchmarking computational strategies for covalent modulator design and is freely accessible at https://yzhang.hpc.nyu.edu/CovBinderInPDB.",
                "authors": [
                    {
                        "name": "Guo X.-K."
                    },
                    {
                        "name": "Zhang Y."
                    }
                ],
                "citationCount": 6,
                "date": "2022-12-12T00:00:00Z",
                "journal": "Journal of Chemical Information and Modeling",
                "title": "CovBinderInPDB: A Structure-Based Covalent Binder Database"
            },
            "pmcid": "PMC9772242",
            "pmid": "36453831"
        }
    ],
    "toolType": [
        "Database portal",
        "Web application"
    ],
    "topic": [
        {
            "term": "Drug discovery",
            "uri": "http://edamontology.org/topic_3336"
        },
        {
            "term": "Protein folding, stability and design",
            "uri": "http://edamontology.org/topic_0130"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
