{
    "additionDate": "2017-05-02T07:18:24Z",
    "biotoolsCURIE": "biotools:pepstr",
    "biotoolsID": "pepstr",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://crdd.osdd.net/raghava/contact.php"
        }
    ],
    "description": "The Pepstr server predicts the tertiary structure of small peptides with sequence length varying between 7 to 25 residues. The prediction strategy is based on the realization that β-turn is an important and consistent feature of small peptides in addition to regular structures. Thus, the methods uses both the regular secondary structure information predicted from PSIPRED and β-turns information predicted from BetaTurns.",
    "documentation": [
        {
            "type": "General",
            "url": "http://osddlinux.osdd.net/raghava/pepstrmod/help.php"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein secondary structure prediction (turns)",
                    "uri": "http://edamontology.org/operation_0469"
                },
                {
                    "term": "Protein secondary structure prediction (helices)",
                    "uri": "http://edamontology.org/operation_0468"
                },
                {
                    "term": "Protein secondary structure prediction (coils)",
                    "uri": "http://edamontology.org/operation_0470"
                },
                {
                    "term": "Protein secondary structure prediction",
                    "uri": "http://edamontology.org/operation_0267"
                },
                {
                    "term": "Protein structure prediction",
                    "uri": "http://edamontology.org/operation_0474"
                }
            ]
        }
    ],
    "homepage": "http://www.imtech.res.in/raghava/pepstr/",
    "lastUpdate": "2018-12-10T12:58:56Z",
    "link": [
        {
            "type": "Mirror",
            "url": "http://osddlinux.osdd.net/raghava/pepstrmod/"
        }
    ],
    "name": "PepStr",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "Among secondary structure elements, β-turns are ubiquitous and major feature of bioactive peptides. We analyzed 77 biologically active peptides with length varying from 9 to 20 residues. Out of 77 peptides, 58 peptides were found to contain at least one β-turn. Further, at the residue level, 34.9% of total peptide residues were found to be in β-turns, higher than the number of helical (32.3%) and β-sheet residues (6.9%). So, we utilized the predicted β-turns information to develop an improved method for predicting the three-dimensional (3D) structure of small peptides. In principle, we built four different structural models for each peptide. The first 'model I' was built by assigning all the peptide residues an extended conformation (φ = Ψ = 180°). Second 'model II' was built using the information of regular secondary structures (helices, β-strands and coil) predicted from PSIPRED. In third 'model III', secondary structure information including β-turn types predicted from BetaTurns method was used. The fourth 'model IV' had main-chain φ, Ψ angles of model III and side chain angles assigned using standard Dunbrack backbone dependent rotamer library. These models were further refined using AMBER package and the resultant Cα rmsd values were calculated. It was found that adding the β-turns to the regular secondary structures greatly reduces the rmsd values both before and after the energy minimization. Hence, the results indicate that regular and irregular secondary structures, particularly β-turns information can provide valuable and vital information in the tertiary structure prediction of small bioactive peptides. Based on the above study, a web server PEPstr (http://www.imtech.res. in/raghava/pepstr/) was developed for predicting the tertiary structure of small bioactive peptides. © 2007 Bentham Science Publishers Ltd.",
                "authors": [
                    {
                        "name": "Kaur H."
                    },
                    {
                        "name": "Garg A."
                    },
                    {
                        "name": "Raghava G.P.S."
                    }
                ],
                "citationCount": 115,
                "date": "2007-07-01T00:00:00Z",
                "journal": "Protein and Peptide Letters",
                "title": "PEPstr: A de novo method for tertiary structure prediction of small bioactive peptides"
            },
            "pmid": "17897087"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Structure prediction",
            "uri": "http://edamontology.org/topic_0082"
        },
        {
            "term": "Protein secondary structure",
            "uri": "http://edamontology.org/topic_3542"
        },
        {
            "term": "Protein structure analysis",
            "uri": "http://edamontology.org/topic_2814"
        },
        {
            "term": "Protein folds and structural domains",
            "uri": "http://edamontology.org/topic_0736"
        }
    ],
    "validated": 1
}