{
    "additionDate": "2020-03-30T08:51:38Z",
    "biotoolsCURIE": "biotools:arena3d",
    "biotoolsID": "arena3d",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Georgios Pavlopoulos",
            "orcidid": "http://orcid.org/0000-0002-4577-8276"
        }
    ],
    "description": "visualization of multi-layered networks in 3D",
    "editPermission": {
        "type": "private"
    },
    "homepage": "https://arena3d.org/",
    "language": [
        "Java"
    ],
    "lastUpdate": "2020-03-30T09:03:07Z",
    "license": "Freeware",
    "name": "Arena3D",
    "operatingSystem": [
        "Linux",
        "Windows"
    ],
    "owner": "g.pavlopoulos",
    "publication": [
        {
            "metadata": {
                "abstract": "Background: Complexity is a key problem when visualizing biological networks; as the number of entities increases, most graphical views become incomprehensible. Our goal is to enable many thousands of entities to be visualized meaningfully and with high performance. Results: We present a new visualization tool, Arena3D, which introduces a new concept of staggered layers in 3D space. Related data - such as proteins, chemicals, or pathways - can be grouped onto separate layers and arranged via layout algorithms, such as Fruchterman-Reingold, distance geometry, and a novel hierarchical layout. Data on a layer can be clustered via k-means, affinity propagation, Markov clustering, neighbor joining, tree clustering, or UPGMA ('unweighted pair-group method with arithmetic mean'). A simple input format defines the name and URL for each node, and defines connections or similarity scores between pairs of nodes. The use of Arena3D is illustrated with datasets related to Huntington's disease. Conclusion: Arena3D is a user friendly visualization tool that is able to visualize biological or any other network in 3D space. It is free for academic use and runs on any platform. It can be downloaded or lunched directly from http://arena3d.org. Java3D library and Java 1.5 need to be pre-installed for the software to run. © 2008 Pavlopoulos et al; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Pavlopoulos G.A."
                    },
                    {
                        "name": "O'Donoghue S.I."
                    },
                    {
                        "name": "Satagopam V.P."
                    },
                    {
                        "name": "Soldatos T.G."
                    },
                    {
                        "name": "Pafilis E."
                    },
                    {
                        "name": "Schneider R."
                    }
                ],
                "citationCount": 73,
                "date": "2008-11-28T00:00:00Z",
                "journal": "BMC Systems Biology",
                "title": "Arena3D: Visualization of biological networks in 3D"
            },
            "pmid": "19040715"
        },
        {
            "metadata": {
                "abstract": "Background: Elucidating the genotype-phenotype connection is one of the big challenges of modern molecular biology. To fully understand this connection, it is necessary to consider the underlying networks and the time factor. In this context of data deluge and heterogeneous information, visualization plays an essential role in interpreting complex and dynamic topologies. Thus, software that is able to bring the network, phenotypic and temporal information together is needed. Arena3D has been previously introduced as a tool that facilitates link discovery between processes. It uses a layered display to separate different levels of information while emphasizing the connections between them. We present novel developments of the tool for the visualization and analysis of dynamic genotype-phenotype landscapes.Results: Version 2.0 introduces novel features that allow handling time course data in a phenotypic context. Gene expression levels or other measures can be loaded and visualized at different time points and phenotypic comparison is facilitated through clustering and correlation display or highlighting of impacting changes through time. Similarity scoring allows the identification of global patterns in dynamic heterogeneous data. In this paper we demonstrate the utility of the tool on two distinct biological problems of different scales. First, we analyze a medium scale dataset that looks at perturbation effects of the pluripotency regulator Nanog in murine embryonic stem cells. Dynamic cluster analysis suggests alternative indirect links between Nanog and other proteins in the core stem cell network. Moreover, recurrent correlations from the epigenetic to the translational level are identified. Second, we investigate a large scale dataset consisting of genome-wide knockdown screens for human genes essential in the mitotic process. Here, a potential new role for the gene lsm14a in cytokinesis is suggested. We also show how phenotypic patterning allows for extensive comparison and identification of high impact knockdown targets.Conclusions: We present a new visualization approach for perturbation screens with multiple phenotypic outcomes. The novel functionality implemented in Arena3D enables effective understanding and comparison of temporal patterns within morphological layers, to help with the system-wide analysis of dynamic processes. Arena3D is available free of charge for academics as a downloadable standalone application from: http://arena3d.org/. © 2012 Secrier et al; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Secrier M."
                    },
                    {
                        "name": "Pavlopoulos G.A."
                    },
                    {
                        "name": "Aerts J."
                    },
                    {
                        "name": "Schneider R."
                    }
                ],
                "citationCount": 35,
                "date": "2012-03-22T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Arena3D: Visualizing time-driven phenotypic differences in biological systems"
            },
            "pmid": "22439608"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Data visualisation",
            "uri": "http://edamontology.org/topic_0092"
        }
    ],
    "validated": 1
}