{
    "additionDate": "2020-01-14T19:39:30Z",
    "biotoolsCURIE": "biotools:DTI-CDF",
    "biotoolsID": "DTI-CDF",
    "confidence_flag": "tool",
    "description": "A cascade deep forest model towards the prediction of drug-target interactions based on hybrid features. Drug-target interactions (DTIs) play a crucial role in target-based drug discovery and development",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Fold recognition",
                    "uri": "http://edamontology.org/operation_0303"
                },
                {
                    "term": "Transmembrane protein prediction",
                    "uri": "http://edamontology.org/operation_0269"
                }
            ]
        }
    ],
    "homepage": "https://github.com//a96123155/DTI-CDF",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-12-25T10:41:17Z",
    "name": "DTI-CDF",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIB/BBZ152",
            "metadata": {
                "abstract": "© 2019 The Author(s).Drug-target interactions (DTIs) play a crucial role in target-based drug discovery and development. Computational prediction of DTIs can effectively complement experimental wet-lab techniques for the identification of DTIs, which are typically time- A nd resource-consuming. However, the performances of the current DTI prediction approaches suffer from a problem of low precision and high false-positive rate. In this study, we aim to develop a novel DTI prediction method for improving the prediction performance based on a cascade deep forest (CDF) model, named DTI-CDF, with multiple similarity-based features between drugs and the similarity-based features between target proteins extracted from the heterogeneous graph, which contains known DTIs. In the experiments, we built five replicates of 10-fold cross-validation under three different experimental settings of data sets, namely, corresponding DTI values of certain drugs (SD), targets (ST), or drug-target pairs (SP) in the training sets are missed but existed in the test sets. The experimental results demonstrate that our proposed approach DTI-CDF achieves a significantly higher performance than that of the traditional ensemble learning-based methods such as random forest and XGBoost, deep neural network, and the state-of-the-art methods such as DDR. Furthermore, there are 1352 newly predicted DTIs which are proved to be correct by KEGG and DrugBank databases. The data sets and source code are freely available at https://github.com//a96123155/DTI-CDF.",
                "authors": [
                    {
                        "name": "Chu Y."
                    },
                    {
                        "name": "Kaushik A.C."
                    },
                    {
                        "name": "Wang X."
                    },
                    {
                        "name": "Wang W."
                    },
                    {
                        "name": "Zhang Y."
                    },
                    {
                        "name": "Shan X."
                    },
                    {
                        "name": "Salahub D.R."
                    },
                    {
                        "name": "Xiong Y."
                    },
                    {
                        "name": "Wei D.-Q."
                    }
                ],
                "citationCount": 32,
                "date": "2021-01-01T00:00:00Z",
                "journal": "Briefings in Bioinformatics",
                "title": "DTI-CDF: A cascade deep forest model towards the prediction of drug-target interactions based on hybrid features"
            },
            "pmid": "31885041"
        }
    ],
    "topic": [
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Drug discovery",
            "uri": "http://edamontology.org/topic_3336"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Drug metabolism",
            "uri": "http://edamontology.org/topic_3375"
        },
        {
            "term": "Pharmacology",
            "uri": "http://edamontology.org/topic_0202"
        }
    ],
    "validated": 1
}