{"credit":[{"email":"juanr.gonzalez@isglobal.org","name":"Juan R Gonzalez","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"https://github.com/isglobal-brge/CTDquerier"}],"function":[{"operation":[{"term":"Query and retrieval","uri":"http://edamontology.org/operation_0224"}]}],"labels":{"language":["R"],"operatingSystem":["Linux","Windows","Mac"],"toolType":["Library"],"topic":[{"term":"Toxicology","uri":"http://edamontology.org/topic_2840"},{"term":"Data acquisition","uri":"http://edamontology.org/topic_3077"}]},"publication":[{"abstract":"© The Author(s) 2018. Published by Oxford University Press. Summary: Biomedical studies currently include a large volume of genomic and environmental factors for studying the etiology of human diseases. R/Bioconductor projects provide several tools for performing enrichment analysis at gene-pathway level, allowing researchers to develop novel hypotheses. However, there is a need to perform similar analyses at the chemicals-genes or chemicals-diseases levels to provide complementary knowledge of the causal path between chemicals and diseases. While the Comparative Toxicogenomics Database™ (CTD) provides information about these relationships, there is no software for integrating it into R/Bioconductor analysis pipelines. CTDquerier helps users to easily download CTD data and integrate it in the R/Bioconductor framework. The package also contains functions for visualizing CTD data and performing enrichment analyses. We illustrate how to use the package with a real data analysis of asthma-related genes. CTDquerier is a flexible and easy-to-use Bioconductor package that provides novel hypothesis about the relationships between chemicals and diseases.","authors":["Hernandez-Ferrer C.","Gonzalez J.R."],"cit_count":0,"doi":"10.1093/bioinformatics/bty326","journal":"Bioinformatics","title":"CTDquerier: A bioconductor R package for comparative toxicogenomics database™ data extraction, visualization and enrichment of environmental and toxicological studies","year":"2018-01-01"}],"summary":{"biotoolsCURIE":"biotools:ctdquerier","biotoolsID":"ctdquerier","description":"Comparative Toxicogenomics Database data extraction, visualization and enrichment of environmental and toxicological studies.","homepage":"https://github.com/isglobal-brge/CTDquerier","name":"CTDquerier"}}