{
    "additionDate": "2019-11-14T19:33:06Z",
    "biotoolsCURIE": "biotools:EpiSAFARI",
    "biotoolsID": "EpiSAFARI",
    "confidence_flag": "tool",
    "description": "Sensitive detection of valleys in epigenetic signals for enhancing annotations of functional elements | EpiSAFARI: Sensitive Detection of Valley Shaped Patterns in Epigenetic Signal Profiles | EpiSAFARI is a command line tool for detection, annotation, and characterization of the valley shaped patterns within the functional genomics signal profiles. It takes:",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                },
                {
                    "term": "Peak calling",
                    "uri": "http://edamontology.org/operation_3222"
                },
                {
                    "term": "cis-regulatory element prediction",
                    "uri": "http://edamontology.org/operation_0441"
                }
            ]
        }
    ],
    "homepage": "https://github.com/harmancilab/EpiSAFARI",
    "language": [
        "C++"
    ],
    "lastUpdate": "2024-11-24T20:52:53.721826Z",
    "name": "EpiSAFARI",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btz702",
            "metadata": {
                "abstract": "Motivation: Functional genomics experiments generate genomewide signal profiles that are dense information sources for annotating the regulatory elements. These profiles measure epigenetic activity at the nucleotide resolution and they exhibit distinctive patterns as they fluctuate along the genome. Most notable of these patterns are the valley patterns that are prevalently observed in assays such as ChIP Sequencing and bisulfite sequencing. The genomic positions of valleys pinpoint locations of cis-regulatory elements such as enhancers and insulators. Systematic identification of the valleys provides novel information for delineating the annotation of regulatory elements. Nevertheless, the valleys are not reported by majority of the analysis pipelines. Results: We describe EpiSAFARI, a computational method for sensitive detection of valleys from diverse types of epigenetic profiles. EpiSAFARI employs a novel smoothing method for decreasing noise in signal profiles and accounts for technical factors such as sparse signals, mappability and nucleotide content. In performance comparisons, EpiSAFARI performs favorably in terms of accuracy. The histone modification valleys detected by EpiSAFARI exhibit high conservation, transcription factor binding and they are enriched in nascent transcription. In addition, the large clusters of histone valleys are found to be enriched at the promoters of the developmentally associated genes. Differential histone valleys exhibit concordance with differential DNase signal at cell line specific valleys. DNA methylation valleys exhibit elevated conservation and high transcription factor binding. Specifically, we observed enriched binding of transcription factors associated with chromatin structure around methyl-valleys.",
                "authors": [
                    {
                        "name": "Gopalakrishnan V."
                    },
                    {
                        "name": "Harmanci A."
                    },
                    {
                        "name": "Harmanci A.S."
                    },
                    {
                        "name": "Swaminathan J."
                    }
                ],
                "citationCount": 1,
                "date": "2020-02-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "EpiSAFARI: Sensitive detection of valleys in epigenetic signals for enhancing annotations of functional elements"
            },
            "pmcid": "PMC7703766",
            "pmid": "31501853"
        }
    ],
    "topic": [
        {
            "term": "ChIP-seq",
            "uri": "http://edamontology.org/topic_3169"
        },
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ],
    "validated": 1
}
