{
    "additionDate": "2022-01-03T09:22:42.919640Z",
    "biotoolsCURIE": "biotools:epigenetic-target-profiler",
    "biotoolsID": "epigenetic-target-profiler",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "medinajl@unam.mx",
            "name": "José L. Medina-Franco",
            "orcidid": "https://orcid.org/0000-0003-4940-1107",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "norberto.sc90@gmail.com",
            "name": "Norberto Sánchez-Cruz",
            "orcidid": "https://orcid.org/0000-0003-2707-3966",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Epigenetic Target Profiler is a web server to predict epigenetic targets of small molecules. The identification of protein targets of small molecules is essential for drug discovery. With the increasing amount of chemogenomic data in the public domain, multiple ligand-based models for target prediction have emerged. However, these models are generally biased by the number of known ligands for different targets, which involves an under-representation of epigenetic targets, and despite the increasing importance of epigenetic targets in drug discovery, there are no open tools for epigenetic target prediction. In this work, we introduce Epigenetic Target Profiler (ETP), a freely accessible and easy-to-use web application for the prediction of epigenetic targets of small molecules. For a query compound, ETP predicts its bioactivity profile over a panel of 55 different epigenetic targets",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Virtual screening",
                    "uri": "http://edamontology.org/operation_3938"
                },
                {
                    "term": "Fold recognition",
                    "uri": "http://edamontology.org/operation_0303"
                },
                {
                    "term": "Subcellular localisation prediction",
                    "uri": "http://edamontology.org/operation_2489"
                }
            ]
        }
    ],
    "homepage": "http://www.epigenetictargetprofiler.com",
    "lastUpdate": "2022-01-03T09:22:42.922179Z",
    "name": "Epigenetic Target Profiler",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1021/ACS.JCIM.1C00045",
            "metadata": {
                "abstract": "© 2021 American Chemical Society.The identification of protein targets of small molecules is essential for drug discovery. With the increasing amount of chemogenomic data in the public domain, multiple ligand-based models for target prediction have emerged. However, these models are generally biased by the number of known ligands for different targets, which involves an under-representation of epigenetic targets, and despite the increasing importance of epigenetic targets in drug discovery, there are no open tools for epigenetic target prediction. In this work, we introduce Epigenetic Target Profiler (ETP), a freely accessible and easy-to-use web application for the prediction of epigenetic targets of small molecules. For a query compound, ETP predicts its bioactivity profile over a panel of 55 different epigenetic targets. To that aim, ETP uses a consensus model based on two binary classification models for each target, relying on support vector machines and built on molecular fingerprints of different design. A distance-to-model parameter related to the reliability of the predictions is included to facilitate their interpretability and assist in the identification of small molecules with potential epigenetic activity. Epigenetic Target Profiler is freely available at http://www.epigenetictargetprofiler.com.",
                "authors": [
                    {
                        "name": "Sanchez-Cruz N."
                    },
                    {
                        "name": "Medina-Franco J.L."
                    }
                ],
                "citationCount": 5,
                "date": "2021-04-26T00:00:00Z",
                "journal": "Journal of Chemical Information and Modeling",
                "title": "Epigenetic Target Profiler: A Web Server to Predict Epigenetic Targets of Small Molecules"
            },
            "pmid": "33729791",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Drug discovery",
            "uri": "http://edamontology.org/topic_3336"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Molecular biology",
            "uri": "http://edamontology.org/topic_3047"
        }
    ]
}