{
    "additionDate": "2020-01-09T18:20:25Z",
    "biotoolsCURIE": "biotools:Cgrid",
    "biotoolsID": "Cgrid",
    "confidence_flag": "tool",
    "description": "A toolbox for creating Cartesian Geometric Representations with Isometric Dimensions (Cgrids). The Cgrid-toolbox can be used to generate rectangular representations of brain areas.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Fold recognition",
                    "uri": "http://edamontology.org/operation_0303"
                },
                {
                    "term": "Format detection",
                    "uri": "http://edamontology.org/operation_3357"
                }
            ]
        }
    ],
    "homepage": "https://github.com/mathijsraemaekers/Cgrid-toolbox",
    "lastUpdate": "2021-01-14T18:29:05Z",
    "license": "GPL-3.0",
    "name": "Cgrid",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1101/786368"
        },
        {
            "doi": "10.1016/j.jneumeth.2020.108738",
            "metadata": {
                "abstract": "© 2020Background: The folding of the human cortex complicates extraction of position information and recognition of patterns across the cortical surface. New Method: As straight lines correspond better to our intuitions in spatial orientation, we developed an approach for imposing Cartesian grids on portions of the cortical surface, which can then be represented in a rectangular matrix. These functions have been implemented in the Cgrid (Cartesian Geometric Representation with Isometric Dimensions) toolbox. Cgrids can be generated based on regions of interest, or combinations thereof, according to any one of the Freesurfer's annotation schemes. Results: The toolbox was evaluated using the surface reconstructions of T1-weighted images of 30 subjects, and 17 different Cgrids that in combination covered nearly the entire surface area of the brain. The vast majority of Cgrids (90.4 %) could be generated without issues. Comparison with Existing method(s): The toolbox facilitates spatial orientation and pattern recognition, in addition to allowing detailed comparison between the left and right hemisphere, and bringing existing volumetric tools to bear on surface-based data. The output of the toolbox is fully compatible with most existing fMRI/MRI analyses packages, and is immediately suitable as input for second level analysis. Conclusions: The toolbox has the potential for broad applicability, especially when ease of data handling and representation are critical factors. The toolbox can be downloaded from: https://github.com/mathijsraemaekers/Cgrid-toolbox.",
                "authors": [
                    {
                        "name": "Bruurmijn M."
                    },
                    {
                        "name": "Raemaekers M."
                    },
                    {
                        "name": "Ramsey N."
                    }
                ],
                "date": "2020-06-01T00:00:00Z",
                "journal": "Journal of Neuroscience Methods",
                "title": "The brain in a box: A toolbox for creating Cartesian geometric representations with isometric dimensions (Cgrids)"
            },
            "pmid": "32305449"
        }
    ],
    "topic": [
        {
            "term": "Data mining",
            "uri": "http://edamontology.org/topic_3473"
        },
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        },
        {
            "term": "Neurobiology",
            "uri": "http://edamontology.org/topic_3304"
        }
    ],
    "validated": 1
}
