{
    "accessibility": "Open access",
    "additionDate": "2022-05-15T11:46:02.935592Z",
    "biotoolsCURIE": "biotools:crpgcn",
    "biotoolsID": "crpgcn",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "zfkuangcn@163.com",
            "name": "Zhufang Kuang",
            "typeEntity": "Person"
        },
        {
            "name": "Lei Deng"
        },
        {
            "name": "Zhihao Ma"
        }
    ],
    "description": "Predicting circRNA-disease associations using graph convolutional network based on heterogeneous network.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Dimensionality reduction",
                    "uri": "http://edamontology.org/operation_3935"
                },
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Principal component analysis",
                    "uri": "http://edamontology.org/operation_3960"
                }
            ]
        }
    ],
    "homepage": "https://github.com/KajiMaCN/CRPGCN/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-05-15T11:46:02.939405Z",
    "license": "Apache-2.0",
    "name": "CRPGCN",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1186/S12859-021-04467-Z",
            "metadata": {
                "abstract": "© 2021, The Author(s).Background: The existing studies show that circRNAs can be used as a biomarker of diseases and play a prominent role in the treatment and diagnosis of diseases. However, the relationships between the vast majority of circRNAs and diseases are still unclear, and more experiments are needed to study the mechanism of circRNAs. Nowadays, some scholars use the attributes between circRNAs and diseases to study and predict their associations. Nonetheless, most of the existing experimental methods use less information about the attributes of circRNAs, which has a certain impact on the accuracy of the final prediction results. On the other hand, some scholars also apply experimental methods to predict the associations between circRNAs and diseases. But such methods are usually expensive and time-consuming. Based on the above shortcomings, follow-up research is needed to propose a more efficient calculation-based method to predict the associations between circRNAs and diseases. Results: In this study, a novel algorithm (method) is proposed, which is based on the Graph Convolutional Network (GCN) constructed with Random Walk with Restart (RWR) and Principal Component Analysis (PCA) to predict the associations between circRNAs and diseases (CRPGCN). In the construction of CRPGCN, the RWR algorithm is used to improve the similarity associations of the computed nodes with their neighbours. After that, the PCA method is used to dimensionality reduction and extract features, it makes the connection between circRNAs with higher similarity and diseases closer. Finally, The GCN algorithm is used to learn the features between circRNAs and diseases and calculate the final similarity scores, and the learning datas are constructed from the adjacency matrix, similarity matrix and feature matrix as a heterogeneous adjacency matrix and a heterogeneous feature matrix. Conclusions: After 2-fold cross-validation, 5-fold cross-validation and 10-fold cross-validation, the area under the ROC curve of the CRPGCN is 0.9490, 0.9720 and 0.9722, respectively. The CRPGCN method has a valuable effect in predict the associations between circRNAs and diseases.",
                "authors": [
                    {
                        "name": "Deng L."
                    },
                    {
                        "name": "Kuang Z."
                    },
                    {
                        "name": "Ma Z."
                    }
                ],
                "date": "2021-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "CRPGCN: predicting circRNA-disease associations using graph convolutional network based on heterogeneous network"
            },
            "pmcid": "PMC8588735",
            "pmid": "34772332"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Laboratory techniques",
            "uri": "http://edamontology.org/topic_3361"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        }
    ]
}
