{
    "additionDate": "2017-05-02T07:18:39Z",
    "biotoolsCURIE": "biotools:maxalign",
    "biotoolsID": "maxalign",
    "credit": [
        {
            "email": "rodrigo@cbs.dtu.dk",
            "name": "Scientific problems: Rodrigo Gouveia-Oliveira",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "pws@cbs.dtu.dk",
            "name": "Technical problems: Peter Wad Sackett",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "MaxAlign is a web server for maximizing usable data in an alignment. It maximizes the number of nucleotide (or amino acid) symbols present in gap-free columns by selecting the optimal subset of sequences to exclude from the alignment.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://www.cbs.dtu.dk/services/MaxAlign/instructions.php"
        },
        {
            "type": [
                "General"
            ],
            "url": "http://www.cbs.dtu.dk/services/MaxAlign/supplementary.php"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Tree-based sequence alignment",
                    "uri": "http://edamontology.org/operation_0499"
                },
                {
                    "term": "Sequence alignment analysis",
                    "uri": "http://edamontology.org/operation_0258"
                },
                {
                    "term": "Protein sequence analysis",
                    "uri": "http://edamontology.org/operation_2479"
                },
                {
                    "term": "Sequence alignment",
                    "uri": "http://edamontology.org/operation_0292"
                }
            ]
        }
    ],
    "homepage": "http://www.cbs.dtu.dk/services/MaxAlign/",
    "language": [
        "Perl"
    ],
    "lastUpdate": "2018-12-10T12:58:54Z",
    "license": "Other",
    "name": "MaxAlign",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "Background: The presence of gaps in an alignment of nucleotide or protein sequences is often an inconvenience for bioinformatical studies. In phylogenetic and other analyses, for instance, gapped columns are often discarded entirely from the alignment. Results: MaxAlign is a program that optimizes the alignment prior to such analyses. Specifically, it maximizes the number of nucleotide (or amino acid) symbols that are present in gap-free columns - the alignment area - by selecting the optimal subset of sequences to exclude from the alignment. MaxAlign can be used prior to phylogenetic and bioinformatical analyses as well as in other situations where this form of alignment improvement is useful. In this work we test MaxAlign's performance in these tasks and compare the accuracy of phylogenetic estimates including and excluding gapped columns from the analysis, with and without processing with MaxAlign. In this paper we also introduce a new simple measure of tree similarity, Normalized Symmetric Similarity (NSS) that we consider useful for comparing tree topologies. Conclusion: We demonstrate how MaxAlign is helpful in detecting misaligned or defective sequences without requiring manual inspection. We also show that it is not advisable to exclude gapped columns from phylogenetic analyses unless MaxAlign is used first. Finally, we find that the sequences removed by MaxAlign from an alignment tend to be those that would otherwise be associated with low phylogenetic accuracy, and that the presence of gaps in any given sequence does not seem to disturb the phylogenetic estimates of other sequences. The MaxAlign web-server is freely available online at http://www.cbs.dtu.dk/services/MaxAlign where supplementary information can also be found. The program is also freely available as a Perl stand-alone package. © 2007 Gouveia-Oliveira et al; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Gouveia-Oliveira R."
                    },
                    {
                        "name": "Sackett P.W."
                    },
                    {
                        "name": "Pedersen A.G."
                    }
                ],
                "citationCount": 73,
                "date": "2007-08-28T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "MaxAlign: Maximizing usable data in an alignment"
            },
            "pmid": "17725821"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "Phylogeny",
            "uri": "http://edamontology.org/topic_0084"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ],
    "validated": 1
}