{
    "additionDate": "2018-05-16T12:08:51Z",
    "biotoolsCURIE": "biotools:computel",
    "biotoolsID": "computel",
    "credit": [
        {
            "email": "aarakelyan@sci.am",
            "name": "Arsen Arakelyan",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Computation of Mean Telomere Length from Whole-Genome Next-Generation Sequencing Data.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/lilit-nersisyan/computel"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Nucleic acid feature detection",
                    "uri": "http://edamontology.org/operation_0415"
                }
            ]
        }
    ],
    "homepage": "https://github.com/lilit-nersisyan/computel",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-10T12:58:58Z",
    "name": "Computel",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PONE.0125201",
            "metadata": {
                "abstract": "© 2015 Nersisyan, Arakelyan.Telomeres are the ends of eukaryotic chromosomes, consisting of consecutive short repeats that protect chromosome ends from degradation. Telomeres shorten with each cell division, leading to replicative cell senescence. Deregulation of telomere length homeostasis is associated with the development of various age-related diseases and cancers. A number of experimental techniques exist for telomere length measurement; however, until recently, the absence of tools for extracting telomere lengths from high-throughput sequencing data has significantly obscured the association of telomere length with molecular processes in normal and diseased conditions. We have developed Computel, a program in R for computing mean telomere length from whole-genome next-generation sequencing data. Computel is open source, and is freely available at https://github.com/lilit-nersisyan/computel. It utilizes a short-read alignment-based approach and integrates various popular tools for sequencing data analysis. We validated it with synthetic and experimental data, and compared its performance with the previously available software. The results have shown that Computel outperforms existing software in accuracy, independence of results from sequencing conditions, stability against inherent sequencing errors, and better ability to distinguish pure telomeric sequences from interstitial telomeric repeats. By providing a highly reliable methodology for determining telomere lengths from whole-genome sequencing data, Computel should help to elucidate the role of telomeres in cellular health and disease.",
                "authors": [
                    {
                        "name": "Nersisyan L."
                    },
                    {
                        "name": "Arakelyan A."
                    }
                ],
                "citationCount": 19,
                "date": "2015-04-29T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "Computel: Computation of mean telomere length from whole-genome next-generation sequencing data"
            },
            "pmcid": "PMC4414351",
            "pmid": "25923330"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Whole genome sequencing",
            "uri": "http://edamontology.org/topic_3673"
        },
        {
            "term": "Sequence sites, features and motifs",
            "uri": "http://edamontology.org/topic_0160"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        }
    ],
    "validated": 1
}