{"credit":[{"name":"ugent.be","typeEntity":"Institute","typeRoles":["Provider"]},{"email":"yves.vandepeer@psb.vib-ugent.be","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"http://bioinformatics.psb.ugent.be/software/details/ProSOM"}],"function":[{"input":[{"data":{"term":"Nucleic acid sequence","uri":"http://edamontology.org/data_2977"}}],"operation":[{"term":"Promoter prediction","uri":"http://edamontology.org/operation_0440"}],"output":[{"data":{"term":"Sequence motif (nucleic acid)","uri":"http://edamontology.org/data_2070"}}]}],"labels":{"collectionID":["BIG N2N","VIB","Plant Systems Biology","UGent"],"language":["Java"],"operatingSystem":["Linux","Windows","Mac"],"toolType":["Desktop application"],"topic":[{"term":"Nucleic acid sites, features and motifs","uri":"http://edamontology.org/topic_3511"}]},"publication":[{"abstract":"Motivation: More and more genomes are being sequenced, and to keep up with the pace of sequencing projects, automated annotation techniques are required. One of the most challenging problems in genome annotation is the identification of the core promoter. Because the identification of the transcription initiation region is such a challenging problem, it is not yet a common practice to integrate transcription start site prediction in genome annotation projects. Nevertheless, better core promoter prediction can improve genome annotation and can be used to guide experimental work. Results: Comparing the average structural profile based on base stacking energy of transcribed, promoter and intergenic sequences demonstrates that the core promoter has unique features that cannot be found in other sequences. We show that unsupervised clustering by using self-organizing maps can clearly distinguish between the structural profiles of promoter sequences and other genomic sequences. An implementation of this promoter prediction program, called ProSOM, is available and has been compared with the state-of-the-art. We propose an objective, accurate and biologically sound validation scheme for core promoter predictors. ProSOM performs at least as well as the software currently available, but our technique is more balanced in terms of the number of predicted sites and the number of false predictions, resulting in a better all-round performance. Additional tests on the ENCODE regions of the human genome show that 98% of all predictions made by ProSOM can be associated with transcriptionally active regions, which demonstrates the high precision. © 2008 The Author(s).","authors":["Abeel T.","Saeys Y.","Rouze P.","Van de Peer Y."],"cit_count":58,"doi":"10.1093/bioinformatics/btn172","journal":"Bioinformatics","title":"ProSOM: Core promoter prediction based on unsupervised clustering of DNA physical profiles","type":"Primary","year":"2008-07-01"}],"summary":{"biotoolsCURIE":"biotools:prosom","biotoolsID":"prosom","description":"Promoter prediction program based on unsupervised clustering of physical properties of DNA.","homepage":"http://bioinformatics.psb.ugent.be/software/details/ProSOM","name":"ProSOM","version":["1"]}}