
{
    "credit": [
        {
            "email": "shapirbr@mail.nih.gov",
            "name": "Bruce A. Shapiro",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://www-lmmb.ncifcrf.gov/users/bshapiro/"
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "https://binkley2.ncifcrf.gov/users/bshapiro/software.html"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Prediction and recognition",
                    "uri": "http://edamontology.org/operation_2423"
                },
                {
                    "term": "Optimisation and refinement",
                    "uri": "http://edamontology.org/operation_2425"
                },
                {
                    "term": "Sequence assembly",
                    "uri": "http://edamontology.org/operation_0310"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "R",
            "C++"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Structure analysis",
                "uri": "http://edamontology.org/topic_0081"
            },
            {
                "term": "RNA",
                "uri": "http://edamontology.org/topic_0099"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://www.mybiosoftware.com/nanotiler-0-9-2-design-rna-nanostructures.html"
        }
    ],
    "publication": [
        {
            "abstract": "In the emerging field of RNA-based nanotechnology there is a need for automation of the structure design process. Our goal is to develop computer methods for aiding in this process. Towards that end, we created the RNAJunction database, which is a repository of RNA junctions, i.e. internal, multi-branch and kissing loops with emanating stem stubs, extracted from the larger RNA structures stored in the PDB database. These junctions can be used as building blocks for nanostructures. Two programs developed in our laboratory, NanoTiler and RNA2D3D, can combine such building blocks with idealized fragments of A-form helices to produce desired 3D nanostructures. Initially, the building blocks are treated as rigid objects and the resulting geometry is tested against the design objectives. Experimental data, however, shows that RNA accommodates its shape to the constraints of larger structural contexts. Therefore we are adding analysis of the flexibility of our building blocks to the full design process. Here we present an example of RNA-based nanostructure design, putting emphasis on the need to characterize the structural flexibility of the building blocks to induce ring closure in the automated exploration. We focus on the use of kissing loops (KL) in nanostructure design, since they have been shown to play an important role in RNA self-assembly. By using an experimentally proven system, the RNA tectosquare, we show that considering the flexibility of the KLs as well as distortions of helical regions may be necessary to achieve a realistic design. © 2011 Elsevier Inc.",
            "authors": [
                "Kasprzak W.",
                "Bindewald E.",
                "Kim T.-J.",
                "Jaeger L.",
                "Shapiro B.A."
            ],
            "cit_count": 26,
            "journal": "Methods",
            "pmid": "21163354",
            "title": "Use of RNA structure flexibility data in nanostructure modeling",
            "year": "2011-06-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:nanotiler",
        "biotoolsID": "nanotiler",
        "description": "Java application for the design of RNA nanostructures. Among other things, it can accomplish the following: 1) Detection, extraction and annotation of RNA structural elements, 2) Use of RNA building blocks for assemblying larger structures, 3) Combinatorial search of building blocks 4) Optimization of building block positions 5) Topology classification 6) Sequence Optimization (i.e. sequence design for self-assembly into the given topology).",
        "homepage": "https://binkley2.ncifcrf.gov/users/bshapiro/software.html",
        "name": "NanoTiler"
    }
}