
{
    "credit": [
    ],
    "labels": {
        "language": [
            "Java"
        ],
        "topic": [
            {
                "term": "Nutritional science",
                "uri": "http://edamontology.org/topic_3390"
            },
            {
                "term": "Agricultural science",
                "uri": "http://edamontology.org/topic_3810"
            },
            {
                "term": "Medical informatics",
                "uri": "http://edamontology.org/topic_3063"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© 2019 by the authors. Licensee MDPI, Basel, Switzerland.Dietary intake data are crucial for developing or evaluating nutrition interventions to improve the nutritional status of populations. The collection of accurate and reliable dietary data in developing countries, however, remains challenging. The emergence of new technologies, which facilitate electronic data capture, might address some of these challenges. This paper aims to describe an application developed to collect a multiple-pass 24-h dietary recall, using electronic data capture, and compare the results to those estimated using a paper-based method. In this study, a tablet-based application was developed, in the CommCare platform, to evaluate the effectiveness, for improving dietary adequacy, of a package of behavior change interventions to reduce stunting and anemia among 6–23-month-old children in East Java, Indonesia (Baduta project). Dietary intakes of energy and nutrients were estimated using electronic data capture in the cohort study of the Baduta project (n = 680). We compared these results with those estimated using paper-based data capture in the project’s end-line cross-sectional study (n = 2740). We found a higher percentage of children classified as acceptable energy reporters (reported energy intake within the 95% CI of Total Energy Expenditure) with the electronic data capture compared with paper-based data capture (i.e., 60.8%, 72.4% and 80.7% for 6–8-, 9–11-and 12–23-month-old children, respectively, vs. 40.9%, 56.9%, and 54.3%, respectively). The estimated mean energy and nutrient intakes were not significantly different between these dietary data capture methods. These results suggest dietary data collection, using a tablet-based application, is feasible and can improve the quality of dietary data collected in developing countries.",
            "authors": [
                "Htet M.K.",
                "Fahmida U.",
                "Do T.T.",
                "Dibley M.J.",
                "Ferguson E."
            ],
            "cit_count": 0,
            "doi": "10.3390/NU11122889",
            "journal": "Nutrients",
            "pmid": "31783608",
            "title": "The use of tablet-based multiple-pass 24-hour dietary recall application (MP24diet) to collect dietary intake of children under two years old in the prospective cohort study in Indonesia",
            "year": "2019-12-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:CommCare",
        "biotoolsID": "CommCare",
        "description": "The Use of Tablet-Based Multiple-Pass 24-Hour Dietary Recall Application (MP24Diet) to Collect Dietary Intake of Children under Two Years Old in the Prospective Cohort Study in Indonesia.\n\nPlease sign in below to continue.\n\nLearn more about how CommCare HQ can be your mobile solution for your frontline workforce.\n\nNo account? Sign up today, it's free!.\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'MP24Diet', 'multiple-pass 24-h dietary', 'dietary', 'Indonesia'",
        "homepage": "http://www.commcarehq.org",
        "name": "CommCare"
    }
}