{
    "additionDate": "2021-12-13T13:31:05.517285Z",
    "biotoolsCURIE": "biotools:vibiba",
    "biotoolsID": "vibiba",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "hans.neubauer@med.uni-duesseldorf.de",
            "name": "Hans Neubauer",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Virtual BioBanking (ViBiBa) for the DETECT multicenter trial program.",
    "editPermission": {
        "type": "private"
    },
    "homepage": "https://vibiba.com",
    "language": [
        "JavaScript",
        "PHP"
    ],
    "lastUpdate": "2021-12-13T13:31:05.519838Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/asperciesl/ViBiBa/issues"
        },
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/asperciesl/ViBiBa"
        }
    ],
    "name": "ViBiBa",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1016/J.TRANON.2021.101132",
            "metadata": {
                "abstract": "© 2021 The AuthorsBackground: Liquid Biopsy (LB) in the form of e.g., circulating tumor cells (CTCs) is a promising non-invasive approach to support current therapeutic cancer management. However, the proof of clinical utility of CTCs in informing therapeutic decision-making for e.g., breast cancer in clinical trials and associated translational research projects is facing the issues of low CTC positivity rates and low CTC numbers – even in the metastasized situation. To compensate for this dilemma, clinical CTC trials are designed as large multicenter endeavors with decentralized sample collection, processing and storage of products, making data management highly important to enable high-quality translational CTC research. Aim: In the DETECT clinical CTC trials we aimed at developing a custom-made, browser-based virtual database to harmonize and organize both decentralized processing and storage of LB specimens and to enable the collection of clinically meaningful LB sample. Methods: ViBiBa processes data from various sources, harmonizes the data and creates an easily searchable multilayered database. Results: An open-source virtual bio-banking web-application termed ViBiBa was created, which automatically processes data from multiple non-standardized sources. These data are automatically checked and merged into one centralized databank and are providing the opportunity to extract clinically relevant patient cohorts and CTC sample collections. ViBiBa, which is a highly flexible tool that allows for decentralized sample storage of liquid biopsy specimens, facilitates a solution which promotes collaboration in a user-friendly, federalist and highly structured way. The source code is available under the MIT license from https://vibiba.com or https://github.com/asperciesl/ViBiBa",
                "authors": [
                    {
                        "name": "Alberter B."
                    },
                    {
                        "name": "Asperger H."
                    },
                    {
                        "name": "Cieslik J.-P."
                    },
                    {
                        "name": "Fehm T."
                    },
                    {
                        "name": "Franken A."
                    },
                    {
                        "name": "Hartkopf A."
                    },
                    {
                        "name": "Janni W."
                    },
                    {
                        "name": "Koch A."
                    },
                    {
                        "name": "Kostler C."
                    },
                    {
                        "name": "Muller V."
                    },
                    {
                        "name": "Neubauer H."
                    },
                    {
                        "name": "Niederacher D."
                    },
                    {
                        "name": "Pantel K."
                    },
                    {
                        "name": "Polzer B."
                    },
                    {
                        "name": "Riethdorf S."
                    },
                    {
                        "name": "Schochter F."
                    },
                    {
                        "name": "Wiesmuller L."
                    }
                ],
                "date": "2021-08-01T00:00:00Z",
                "journal": "Translational Oncology",
                "title": "ViBiBa: Virtual BioBanking for the DETECT multicenter trial program - decentralized storage and processing"
            },
            "pmid": "34051621",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Biobank",
            "uri": "http://edamontology.org/topic_3337"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Preclinical and clinical studies",
            "uri": "http://edamontology.org/topic_3379"
        }
    ]
}
