{
    "accessibility": "Open access",
    "additionDate": "2022-12-31T01:48:54.201819Z",
    "biotoolsCURIE": "biotools:gravis",
    "biotoolsID": "gravis",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Chixiang Lu",
            "orcidid": "https://orcid.org/0000-0003-0665-2627"
        },
        {
            "name": "Hong-Yu Zhou",
            "orcidid": "https://orcid.org/0000-0002-1256-7050"
        },
        {
            "name": "Liansheng Wang",
            "orcidid": "https://orcid.org/0000-0002-2096-454X"
        },
        {
            "name": "Yizhou Yu",
            "orcidid": "https://orcid.org/0000-0002-0470-5548"
        }
    ],
    "description": "Grouping Augmented Views from Independent Sources for Dermatology Analysis.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                },
                {
                    "term": "Image annotation",
                    "uri": "http://edamontology.org/operation_3553"
                }
            ]
        }
    ],
    "homepage": "https://bit.ly/3xiFyjx",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-12-31T01:48:54.204465Z",
    "license": "Not licensed",
    "name": "GraVIS",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1109/TMI.2022.3216005",
            "metadata": {
                "abstract": "© 2022 IEEE.Self-supervised representation learning has been extremely successful in medical image analysis, as it requires no human annotations to provide transferable representations for downstream tasks. Recent self-supervised learning methods are dominated by noise-contrastive estimation (NCE, also known as contrastive learning), which aims to learn invariant visual representations by contrasting one homogeneous image pair with a large number of heterogeneous image pairs in each training step. Nonetheless, NCE-based approaches still suffer from one major problem that is one homogeneous pair is not enough to extract robust and invariant semantic information. Inspired by the archetypical triplet loss, we propose GraVIS, which is specifically optimized for learning self-supervised features from dermatology images, to group homogeneous dermatology images while separating heterogeneous ones. In addition, a hardness-aware attention is introduced and incorporated to address the importance of homogeneous image views with similar appearance instead of those dissimilar homogeneous ones. GraVIS significantly outperforms its transfer learning and self-supervised learning counterparts in both lesion segmentation and disease classification tasks, sometimes by 5 percents under extremely limited supervision. More importantly, when equipped with the pre-trained weights provided by GraVIS, a single model could achieve better results than winners that heavily rely on ensemble strategies in the well-known ISIC 2017 challenge.",
                "authors": [
                    {
                        "name": "Lu C."
                    },
                    {
                        "name": "Wang L."
                    },
                    {
                        "name": "Yu Y."
                    },
                    {
                        "name": "Zhou H.-Y."
                    }
                ],
                "date": "2022-12-01T00:00:00Z",
                "journal": "IEEE Transactions on Medical Imaging",
                "title": "GraVIS: Grouping Augmented Views From Independent Sources for Dermatology Analysis"
            },
            "pmid": "36260573"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Dermatology",
            "uri": "http://edamontology.org/topic_3404"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        }
    ],
    "validated": 1
}
