{
    "name": "LSNMF", 
    "description": "LSNMF (Least Squared Non-negative Matrix Factorization) is a modified version of NMF (non-negative matrix factorization), it focus on gene expression patterns analysis on microarray datasets. The major improvement of LSNMF algorithm over NMF is that it incorporate uncertainty estimates into the update rules, so it is much more stable over the possible noise in the datasets, and it also more sensitive to the real signals.", 
    "homepage": "http://bioinformatics.fccc.edu/software/OpenSource/LS-NMF/lsnmf.shtml", 
    "biotoolsID": "lsnmf", 
    "biotoolsCURIE": "biotools:lsnmf", 
    "version": [], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_2495", 
                    "term": "Microarray data analysis"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Command-line tool"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_0203", 
            "term": "Gene expression"
        }
    ], 
    "operatingSystem": [
        "Linux"
    ], 
    "language": [
        "C++"
    ], 
    "license": null, 
    "collectionID": [], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [
        {
            "url": "http://www.mybiosoftware.com/lsnmf-gene-expression-patterns-analysis-microarray-datasets.html", 
            "type": "Registry", 
            "note": null
        }
    ], 
    "download": [], 
    "documentation": [
        {
            "url": "http://bioinformatics.fccc.edu/software/OpenSource/LS-NMF/README.html", 
            "type": "General", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": "10.1186/1471-2105-7-175", 
            "pmid": null, 
            "pmcid": null, 
            "type": "Primary", 
            "version": null, 
            "metadata": {
                "title": "LS-NMF: A modified non-negative matrix factorization algorithm utilizing uncertainty estimates", 
                "abstract": "Background: Non-negative matrix factorisation (NMF), a machine learning algorithm, has been applied to the analysis of microarray data. A key feature of NMF is the ability to identify patterns that together explain the data as a linear combination of expression signatures. Microarray data generally includes individual estimates of uncertainty for each gene in each condition, however NMF does not exploit this information. Previous work has shown that such uncertainties can be extremely valuable for pattern recognition. Results: We have created a new algorithm, least squares non-negative matrix factorization, LS-NMF, which integrates uncertainty measurements of gene expression data into NMF updating rules. While the LS-NMF algorithm maintains the advantages of original NMF algorithm, such as easy implementation and a guaranteed locally optimal solution, the performance in terms of linking functionally related genes has been improved. LS-NMF exceeds NMF significantly in terms of identifying functionally related genes as determined from annotations in the MIPS database. Conclusion: Uncertainty measurements on gene expression data provide valuable information for data analysis, and use of this information in the LS-NMF algorithm significantly improves the power of the NMF technique. © 2006 Wang et al; licensee BioMed Central Ltd.", 
                "date": "2006-03-28T00:00:00Z", 
                "citationCount": 57, 
                "authors": [
                    {
                        "name": "Wang G."
                    }, 
                    {
                        "name": "Kossenkov A.V."
                    }, 
                    {
                        "name": "Ochs M.F."
                    }
                ], 
                "journal": "BMC Bioinformatics"
            }
        }
    ], 
    "credit": [
        {
            "name": null, 
            "email": null, 
            "url": "http://bioinformatics.fccc.edu/", 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "mbs_import", 
    "additionDate": "2017-12-18T00:08:20Z", 
    "lastUpdate": "2018-12-10T12:58:57Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 1, 
    "homepage_status": 0, 
    "elixir_badge": 0
}