
{
    "credit": [
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence merging",
                    "uri": "http://edamontology.org/operation_0232"
                },
                {
                    "term": "Sequence tagged site (STS) mapping",
                    "uri": "http://edamontology.org/operation_2871"
                },
                {
                    "term": "Exonic splicing enhancer prediction",
                    "uri": "http://edamontology.org/operation_0446"
                }
            ]
        }
    ],
    "labels": {
        "topic": [
            {
                "term": "Machine learning",
                "uri": "http://edamontology.org/topic_3474"
            },
            {
                "term": "RNA splicing",
                "uri": "http://edamontology.org/topic_3320"
            },
            {
                "term": "Gene transcripts",
                "uri": "http://edamontology.org/topic_3512"
            },
            {
                "term": "Mapping",
                "uri": "http://edamontology.org/topic_0102"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© 2019 Elsevier Inc.A novel method is proposed to detect the acceptor and donor splice sites using chaos game representation and artificial neural network. In order to achieve high accuracy, inputs to the neural network, or feature vector, shall reflect the true nature of the DNA segments. Therefore it is important to have one-to-one numerical representation, i.e. a feature vector should be able to represent the original data. Chaos game representation (CGR) is an iterative mapping technique that assigns each nucleotide in a DNA sequence to a respective position on the plane in a one-to-one manner. Using CGR, a DNA sequence can be mapped to a numerical sequence that reflects the true nature of the original sequence. In this research, we propose to use CGR as feature input to a neural network to detect splice sites on the NN269 dataset. Computational experiments indicate that this approach gives good accuracy while being simpler than other methods in the literature, with only one neural network component. The code and data for our method can be accessed from this link: https://github.com/thoang3/portfolio/tree/SpliceSites_ANN_CGR.",
            "authors": [
                "Hoang T.",
                "Yin C.",
                "Yau S.S.-T."
            ],
            "cit_count": 0,
            "doi": "10.1016/J.YGENO.2019.10.018",
            "journal": "Genomics",
            "pmid": "31704313",
            "title": "Splice sites detection using chaos game representation and neural network",
            "year": "2019-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:CGR",
        "biotoolsID": "CGR",
        "description": "Splice sites detection using chaos game representation and neural network.\n\nEmail: hoangthanhtungvn@gmail.com.\n\nProject description: We propose to use chaos game representation and neural network for splice sites detection. DNA sequences are mapped to numerical sequences using chaos game representation. Numerical sequences are used as feature inputs to neural networks for splice sites classification",
        "homepage": "https://github.com/thoang3/portfolio/tree/SpliceSites_ANN_CGR",
        "name": "CGR"
    }
}