{
    "additionDate": "2017-08-03T18:59:47Z",
    "biotoolsCURIE": "biotools:slink",
    "biotoolsID": "slink",
    "credit": [
        {
            "email": "weeks@pitt.edu",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "The program does calculations by simulating genotypes at one locus given the phenotypes at another locus linked with the first locus.",
    "documentation": [
        {
            "type": "General",
            "url": "https://watson.hgen.pitt.edu/docs/SLink.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Linkage analysis",
                    "uri": "http://edamontology.org/operation_0283"
                },
                {
                    "term": "Modelling and simulation",
                    "uri": "http://edamontology.org/operation_2426"
                }
            ]
        }
    ],
    "homepage": "http://watson.hgen.pitt.edu/docs/SLink.html",
    "language": [
        "Pascal"
    ],
    "lastUpdate": "2018-12-10T12:58:51Z",
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/slink-3-00-simulation-program-linkage-analysis.html"
        }
    ],
    "name": "SLINK",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Simulation of genotypes in pedigrees is an important tool to evaluate the power of a linkage or an association study and to assess the empirical significance of results. SLINK is a widely-used package for pedigree simulations, but its implementation has not previously been described in a published paper. SLINK was initially derived from the LINKAGE programs. Over the 20 years since its release, SLINK has been modified to incorporate faster algorithms, notably from the linkage analysis package FASTLINK, also derived from LINKAGE. While SLINK can simulate genotypes on pedigrees of high complexity, one limitation of SLINK, as with most methods based on peeling algorithms to evaluate pedigree likelihoods, is the small number of linked markers that can be generated. The software package SUP includes an elegant wrapper for SLINK that circumvents the limitation on number of markers by using descent markers generated by SLINK to simulate a much larger number of markers on the same chromosome, linked and possibly associated with a trait locus. We have released new coordinated versions of SLINK (3.0; available from http://watson.hgen.pitt.edu) and SUP (v090804; available from http://mlemire.freeshell.org/software or http://watson.hgen.pitt.edu) that integrate the two software packages. Thereby, we have removed some of the previous limitations on the joint functionality of the programs, such as the number of founders in a pedigree. We review the history of SLINK and describe how SLINK and SUP are now coordinated to permit the simulation of large numbers of markers linked and possibly associated with a trait in large pedigrees. Copyright © 2011 S. Karger AG, Basel.",
                "authors": [
                    {
                        "name": "Schaffer A.A."
                    },
                    {
                        "name": "Lemire M."
                    },
                    {
                        "name": "Ott J."
                    },
                    {
                        "name": "Lathrop G.M."
                    },
                    {
                        "name": "Weeks D.E."
                    }
                ],
                "citationCount": 9,
                "date": "2011-07-01T00:00:00Z",
                "journal": "Human Heredity",
                "title": "Coordinated conditional simulation with SLINK and SUP of many markers linked or associated to a trait in large pedigrees"
            },
            "pmid": "21734403"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Simulation experiment",
            "uri": "http://edamontology.org/topic_3524"
        }
    ],
    "validated": 1
}