{
    "additionDate": "2020-01-14T19:57:52Z",
    "biotoolsCURIE": "biotools:ChemEnv",
    "biotoolsID": "ChemEnv",
    "confidence_flag": "tool",
    "description": "A Fast and Robust Coordination Environment Identification Tool.\n\nCoordination or local environments have been used to describe, analyze, and understand crystal structures for more than a century. Here, we present a new tool called <i>ChemEnv< i>, which can identify coordination environments in a fast and robust manner. In contrast to previous tools, the assessment of the coordination environments is not biased by small distortions of the crystal structure. Its robust and fast implementation enables the analysis of large databases of structures. The code is available open source within the <i>pymatgen< i> package and the software can as well be used through a web app available on http: crystaltoolkit.org through the Materials Project.",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://doi.org/10.26434/CHEMRXIV.11294480.V1",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T15:19:58.073909Z",
    "name": "ChemEnv",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1107/s2052520620007994",
            "metadata": {
                "abstract": "Coordination or local environments have been used to describe, analyze and understand crystal structures for more than a century. Here, a new tool called ChemEnv, which can identify coordination environments in a fast and robust manner, is presented. In contrast to previous tools, the assessment of the coordination environments is not biased by small distortions of the crystal structure. Its robust and fast implementation enables the analysis of large databases of structures. The code is available open source within the pymatgen package and the software can also be used through a web app available on http://crystaltoolkit.org through the Materials Project.",
                "authors": [
                    {
                        "name": "George J."
                    },
                    {
                        "name": "Gonze X."
                    },
                    {
                        "name": "Hautier G."
                    },
                    {
                        "name": "Horton M."
                    },
                    {
                        "name": "Persson K.A."
                    },
                    {
                        "name": "Rignanese G.M."
                    },
                    {
                        "name": "Schenk S."
                    },
                    {
                        "name": "Waroquiers D."
                    }
                ],
                "citationCount": 23,
                "date": "2020-08-01T00:00:00Z",
                "journal": "Acta crystallographica Section B, Structural science, crystal engineering and materials",
                "title": "ChemEnv: a fast and robust coordination environment identification tool"
            },
            "pmcid": "PMC7412753",
            "pmid": "32831287"
        }
    ],
    "validated": 1
}
