{
    "accessibility": "Open access",
    "additionDate": "2022-03-23T16:52:02.248316Z",
    "biotoolsCURIE": "biotools:panseq",
    "biotoolsID": "panseq",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Andre Villegas"
        },
        {
            "name": "Andrew Kropinski"
        },
        {
            "name": "James E Thomas"
        },
        {
            "name": "Victor PJ Gannon"
        }
    ],
    "description": "Panseq determines the core and accessory regions among a collection of genomic sequences based on user-defined parameters. It readily extracts regions unique to a genome or group of genomes, identifies SNPs within shared core genomic regions, constructs files for use in phylogeny programs based on both the presence/absence of accessory regions and SNPs within core regions.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genome comparison",
                    "uri": "http://edamontology.org/operation_3209"
                },
                {
                    "term": "Sequence analysis",
                    "uri": "http://edamontology.org/operation_2403"
                }
            ]
        }
    ],
    "homepage": "https://github.com/chadlaing/Panseq",
    "lastUpdate": "2022-03-23T16:52:02.251897Z",
    "license": "GPL-3.0",
    "name": "panseq",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1186/1471-2105-11-461",
            "metadata": {
                "abstract": "Background: The pan-genome of a bacterial species consists of a core and an accessory gene pool. The accessory genome is thought to be an important source of genetic variability in bacterial populations and is gained through lateral gene transfer, allowing subpopulations of bacteria to better adapt to specific niches. Low-cost and high-throughput sequencing platforms have created an exponential increase in genome sequence data and an opportunity to study the pan-genomes of many bacterial species. In this study, we describe a new online pan-genome sequence analysis program, Panseq.Results: Panseq was used to identify Escherichia coli O157:H7 and E. coli K-12 genomic islands. Within a population of 60 E. coli O157:H7 strains, the existence of 65 accessory genomic regions identified by Panseq analysis was confirmed by PCR. The accessory genome and binary presence/absence data, and core genome and single nucleotide polymorphisms (SNPs) of six L. monocytogenes strains were extracted with Panseq and hierarchically clustered and visualized. The nucleotide core and binary accessory data were also used to construct maximum parsimony (MP) trees, which were compared to the MP tree generated by multi-locus sequence typing (MLST). The topology of the accessory and core trees was identical but differed from the tree produced using seven MLST loci. The Loci Selector module found the most variable and discriminatory combinations of four loci within a 100 loci set among 10 strains in 1 s, compared to the 449 s required to exhaustively search for all possible combinations; it also found the most discriminatory 20 loci from a 96 loci E. coli O157:H7 SNP dataset.Conclusion: Panseq determines the core and accessory regions among a collection of genomic sequences based on user-defined parameters. It readily extracts regions unique to a genome or group of genomes, identifies SNPs within shared core genomic regions, constructs files for use in phylogeny programs based on both the presence/absence of accessory regions and SNPs within core regions and produces a graphical overview of the output. Panseq also includes a loci selector that calculates the most variable and discriminatory loci among sets of accessory loci or core gene SNPs. © 2010 Laing et al; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Buchanan C."
                    },
                    {
                        "name": "Gannon V.P.J."
                    },
                    {
                        "name": "Kropinski A."
                    },
                    {
                        "name": "Laing C."
                    },
                    {
                        "name": "Taboada E.N."
                    },
                    {
                        "name": "Thomas J.E."
                    },
                    {
                        "name": "Villegas A."
                    },
                    {
                        "name": "Zhang Y."
                    }
                ],
                "citationCount": 178,
                "date": "2010-09-15T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Pan-genome sequence analysis using Panseq: An online tool for the rapid analysis of core and accessory genomic regions"
            },
            "pmcid": "PMC2949892",
            "pmid": "20843356"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        }
    ]
}
