{
    "additionDate": "2021-01-18T08:02:10Z",
    "biotoolsCURIE": "biotools:srax",
    "biotoolsID": "srax",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "lgpanunzi@gmail.com",
            "name": "Leonardo G. Panunzi",
            "typeEntity": "Person"
        }
    ],
    "description": "A Novel Comprehensive Resistome Analysis Tool.\nsraX is designed to read assembled sequence files in FASTA format and systematically detect the presence of AMR determinants and, ultimately, describe the repertoire of antibiotic resistance genes (ARGs) within a collection of genomes (the “resistome” analysis).",
    "download": [
        {
            "type": "Container file",
            "url": "https://hub.docker.com/r/lgpdevtools/srax"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Antimicrobial resistance prediction",
                    "uri": "http://edamontology.org/operation_3482"
                },
                {
                    "term": "Sequence assembly",
                    "uri": "http://edamontology.org/operation_0310"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                }
            ]
        }
    ],
    "homepage": "https://github.com/lgpdevtools/srax",
    "language": [
        "Perl",
        "R",
        "Shell"
    ],
    "lastUpdate": "2021-02-21T15:14:30Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "https://anaconda.org/lgpdevtools/srax"
        }
    ],
    "name": "sraX",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.3389/FMICB.2020.00052",
            "metadata": {
                "abstract": "© Copyright © 2020 Panunzi.The accurate identification of the assortment of antibiotic resistance genes within a collection of genomes enables the discernment of intricate antimicrobial resistance (AMR) patterns while depicting the diversity of resistome profiles of the analyzed samples. The availability of large amount of sequence data, owing to the advancement of novel sequencing technologies, have conceded exciting possibilities for developing suitable AMR exploration tools. However, the level of complexity of bioinformatic analyses has raised as well, since the achievement of desired results involves executing several challenging steps. Here, sraX is proposed as a fully automated analytical pipeline for performing a precise resistome analysis. Our nominated tool is capable of scrutinizing hundreds of bacterial genomes in-parallel for detecting and annotating putative resistant determinants. Particularly, sraX presents unique features: genomic context analysis, validation of known mutations conferring resistance, illustration of drug classes and type of mutated loci proportions and integration of results into a single hyperlinked navigable HTML-formatted file. Furthermore, sraX also exhibits relevant operational features since the complete analysis is accomplished by executing a single-command step. The capacity and efficacy of sraX was demonstrated by re-analyzing 197 strains belonging to Enterococcus spp., from which we confirmed 99.15% of all detection events that were reported in the original study. sraX can be downloaded from https://github.com/lgpdevtools/srax.",
                "authors": [
                    {
                        "name": "Panunzi L.G."
                    }
                ],
                "citationCount": 4,
                "date": "2020-02-05T00:00:00Z",
                "journal": "Frontiers in Microbiology",
                "title": "sraX: A Novel Comprehensive Resistome Analysis Tool"
            },
            "pmcid": "PMC7025521",
            "pmid": "32117104"
        }
    ],
    "topic": [
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Whole genome sequencing",
            "uri": "http://edamontology.org/topic_3673"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ]
}