{
    "additionDate": "2020-01-14T09:50:15Z",
    "biotoolsCURIE": "biotools:IDEAS",
    "biotoolsID": "IDEAS",
    "confidence_flag": "very low",
    "credit": [
        {
            "name": "Yu Zhang",
            "typeEntity": "Person"
        },
        {
            "email": "mahony@psu.edu",
            "name": "Shaun Mahony",
            "orcidid": "https://orcid.org/0000-0002-2641-1807",
            "typeEntity": "Person"
        }
    ],
    "description": "Direct prediction of regulatory elements from partial data without imputation.\n\nUCSC Genome Browser trackhub definition files for IDEAS segmentation results.\n\nhg19 [http://genome.ucsc.edu/cgi-bin/hgTracks?db=hg19&hubUrl=https://seqcode.github.io/IDEAS-trackhubs/Roadmap2018_127cell_12mark_incomplete/hub_ideas_roadmap127_2019.txt].\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'segmentation', 'imputation', 'propagates', 'regulatory'",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Peak calling",
                    "uri": "http://edamontology.org/operation_3222"
                },
                {
                    "term": "Imputation",
                    "uri": "http://edamontology.org/operation_3557"
                },
                {
                    "term": "Genome visualisation",
                    "uri": "http://edamontology.org/operation_3208"
                },
                {
                    "term": "Transcriptional regulatory element prediction",
                    "uri": "http://edamontology.org/operation_0438"
                }
            ]
        }
    ],
    "homepage": "https://github.com/seqcode/IDEAS-trackhubs",
    "lastUpdate": "2020-01-14T09:50:15Z",
    "license": "MIT",
    "name": "IDEAS",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PCBI.1007399",
            "metadata": {
                "abstract": "© 2019 Zhang, Mahony. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Genome segmentation approaches allow us to characterize regulatory states in a given cell type using combinatorial patterns of histone modifications and other regulatory signals. In order to analyze regulatory state differences across cell types, current genome segmentation approaches typically require that the same regulatory genomics assays have been performed in all analyzed cell types. This necessarily limits both the numbers of cell types that can be analyzed and the complexity of the resulting regulatory states, as only a small number of histone modifications have been profiled across many cell types. Data imputation approaches that aim to estimate missing regulatory signals have been applied before genome segmentation. However, this approach is computationally costly and propagates any errors in imputation to produce incorrect genome segmentation results downstream. We present an extension to the IDEAS genome segmentation platform which can perform genome segmentation on incomplete regulatory genomics dataset collections without using imputation. Instead of relying on imputed data, we use an expectation-maximization approach to estimate marginal density functions within each regulatory state. We demonstrate that our genome segmentation results compare favorably with approaches based on imputation or other strategies for handling missing data. We further show that our approach can accurately impute missing data after genome segmentation, reversing the typical order of imputation/genome segmentation pipelines. Finally, we present a new 2D genome segmentation analysis of 127 human cell types studied by the Roadmap Epigenomics Consortium. By using an expanded set of chromatin marks that have been profiled in subsets of these cell types, our new segmentation results capture a more complex picture of combinatorial regulatory patterns that appear on the human genome.",
                "authors": [
                    {
                        "name": "Zhang Y."
                    },
                    {
                        "name": "Mahony S."
                    }
                ],
                "citationCount": 2,
                "date": "2019-01-01T00:00:00Z",
                "journal": "PLoS Computational Biology",
                "title": "Direct prediction of regulatory elements from partial data without imputation"
            },
            "pmcid": "PMC6855516",
            "pmid": "31682602"
        }
    ],
    "topic": [
        {
            "term": "Epigenomics",
            "uri": "http://edamontology.org/topic_3173"
        },
        {
            "term": "Gene regulation",
            "uri": "http://edamontology.org/topic_0204"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ]
}