{
    "additionDate": "2019-11-14T19:58:53Z",
    "biotoolsCURIE": "biotools:2018_YPIC_Challenge",
    "biotoolsID": "2018_YPIC_Challenge",
    "confidence_flag": "medium",
    "credit": [
        {
            "email": "wout.bittremieux@uantwerpen.be",
            "name": "Wout Bittremieux",
            "typeEntity": "Person"
        }
    ],
    "description": "> MEDIUM CONFIDENCE! | A Case Study in Characterizing an Unknown Protein Sample | YPIC challenge 2018 data analysis",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Post-translation modification site prediction",
                    "uri": "http://edamontology.org/operation_0417"
                },
                {
                    "term": "Ab initio structure prediction",
                    "uri": "http://edamontology.org/operation_0476"
                },
                {
                    "term": "de Novo sequencing",
                    "uri": "http://edamontology.org/operation_3644"
                }
            ]
        }
    ],
    "homepage": "https://github.com/bittremieux/ypic_challenge_2018",
    "lastUpdate": "2019-11-14T19:58:53Z",
    "license": "Apache-2.0",
    "name": "2018 YPIC Challenge",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1021/ACS.JPROTEOME.9B00384",
            "metadata": {
                "abstract": "© 2019 American Chemical Society.For the 2018 YPIC Challenge, contestants were invited to try to decipher two unknown English questions encoded by a synthetic protein expressed in Escherichia coli. In addition to deciphering the sentence, contestants were asked to determine the three-dimensional structure and detect any post-translation modifications left by the host organism. We present our experimental and computational strategy to characterize this sample by identifying the unknown protein sequence and detecting the presence of post-translational modifications. The sample was acquired with dynamic exclusion disabled to increase the signal-to-noise ratio of the measured molecules, after which spectral clustering was used to generate high-quality consensus spectra. De novo spectrum identification was used to determine the synthetic protein sequence, and any post-translational modifications introduced by E. coli on the synthetic protein were analyzed via spectral networking. This workflow resulted in a de novo sequence coverage of 70%, on par with sequence database searching performance. Additionally, the spectral networking analysis indicated that no systematic modifications were introduced on the synthetic protein by E. coli. The strategy presented here can be directly used to analyze samples for which no protein sequence information is available or when the identity of the sample is unknown. All software and code to perform the bioinformatics analysis is available as open source, and self-contained Jupyter notebooks are provided to fully recreate the analysis.",
                "authors": [
                    {
                        "name": "Pino L."
                    },
                    {
                        "name": "Lin A."
                    },
                    {
                        "name": "Bittremieux W."
                    }
                ],
                "citationCount": 2,
                "date": "2019-11-01T00:00:00Z",
                "journal": "Journal of Proteome Research",
                "title": "2018 YPIC Challenge: A Case Study in Characterizing an Unknown Protein Sample"
            },
            "pmcid": "PMC6824964",
            "pmid": "31556620"
        }
    ],
    "topic": [
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Protein modifications",
            "uri": "http://edamontology.org/topic_0601"
        }
    ]
}