{
    "additionDate": "2021-01-18T11:32:38Z",
    "biotoolsCURIE": "biotools:codaloss",
    "biotoolsID": "codaloss",
    "confidence_flag": "tool",
    "credit": [
        {
            "name": "Liang Chen",
            "typeEntity": "Person"
        },
        {
            "name": "Shun He",
            "typeEntity": "Person"
        },
        {
            "name": "Minghua Deng",
            "typeEntity": "Person"
        }
    ],
    "description": "Codaloss: direct interaction network inference for compositional data. One essential step in the analysis of microbiome compositional data is inferring the direct interaction network among microbial species. Here, we propose a novel loss function called codaloss for direct microbes interaction network estimation under the sparsity assumptions. We develop an alternating direction optimization algorithm to obtain sparse solution of codaloss as estimator. Compared to other state-of-the-art methods, our model makes less assumptions about the microbial networks and outperforms them in network inference.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                }
            ]
        }
    ],
    "homepage": "https://github.com/xuebaliang/Codaloss",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-02-14T16:19:56Z",
    "name": "codaloss",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1142/S0219720020500377",
            "metadata": {
                "abstract": "© 2020 World Scientific Publishing Europe Ltd.16S rRNA gene sequencing and whole microbiome sequencing make it possible and stable to quantitatively analyze the composition of microbial communities and the relationship among microbial communities, microbes, and hosts. One essential step in the analysis of microbiome compositional data is inferring the direct interaction network among microbial species, bringing to light the potential underlying mechanism that regulates interaction in their communities. However, standard statistical analysis may obtain spurious results due to compositional nature of microbiome data; therefore, network recovery of microbial communities remains challenging. Here, we propose a novel loss function called codaloss for direct microbes interaction network estimation under the sparsity assumptions. We develop an alternating direction optimization algorithm to obtain sparse solution of codaloss as estimator. Compared to other state-of-the-art methods, our model makes less assumptions about the microbial networks. The simulation and real microbiome data results show that our method outperforms other methods in network inference. An implementation of codaloss is available from https://github.com/xuebaliang/Codaloss.",
                "authors": [
                    {
                        "name": "Chen L."
                    },
                    {
                        "name": "He S."
                    },
                    {
                        "name": "Zhai Y."
                    },
                    {
                        "name": "Deng M."
                    }
                ],
                "date": "2020-12-01T00:00:00Z",
                "journal": "Journal of Bioinformatics and Computational Biology",
                "title": "Direct interaction network inference for compositional data via codaloss"
            },
            "pmid": "33106076"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Microbial ecology",
            "uri": "http://edamontology.org/topic_3697"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        }
    ]
}