{
    "additionDate": "2019-11-14T19:30:09Z",
    "biotoolsCURIE": "biotools:NExUS",
    "biotoolsID": "NExUS",
    "confidence_flag": "tool",
    "description": "Bayesian simultaneous network estimation across unequal sample sizes | --> 'Data_generate.m' generates the precision matrices and dataset corresponding to that as described in the simulation study | --> 'NExUS.m' computes the estimated partial correlation matrices corresponding to the dataset.Variable 'Partial_corr_mean' (which is a 3D array) gives the all estimated partial correlation matrices. Variable 'lambda_2_square_mean' provides the similarity index for each pair of categories | --> In case of real data, note that it is recommended to normalize the sample corresponding to each variable in the data to have mean 0 and variance 1",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Network simulation",
                    "uri": "http://edamontology.org/operation_3562"
                }
            ]
        }
    ],
    "homepage": "https://github.com/priyamdas2/NExUS",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2021-01-04T08:12:11Z",
    "name": "NExUS",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ636",
            "metadata": {
                "abstract": "© 2019 The Author(s) 2019. Published by Oxford University Press. All rights reserved.Motivation: Network-based analyses of high-throughput genomics data provide a holistic, systems-level understanding of various biological mechanisms for a common population. However, when estimating multiple networks across heterogeneous sub-populations, varying sample sizes pose a challenge in the estimation and inference, as network differences may be driven by differences in power. We are particularly interested in addressing this challenge in the context of proteomic networks for related cancers, as the number of subjects available for rare cancer (sub-)types is often limited. Results: We develop NExUS (Network Estimation across Unequal Sample sizes), a Bayesian method that enables joint learning of multiple networks while avoiding artefactual relationship between sample size and network sparsity. We demonstrate through simulations that NExUS outperforms existing network estimation methods in this context, and apply it to learn network similarity and shared pathway activity for groups of cancers with related origins represented in The Cancer Genome Atlas (TCGA) proteomic data.",
                "authors": [
                    {
                        "name": "Das P."
                    },
                    {
                        "name": "Peterson C.B."
                    },
                    {
                        "name": "Do K.-A."
                    },
                    {
                        "name": "Akbani R."
                    },
                    {
                        "name": "Baladandayuthapani V."
                    }
                ],
                "date": "2020-02-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "NExUS: Bayesian simultaneous network estimation across unequal sample sizes"
            },
            "pmid": "31504175"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        }
    ],
    "validated": 1
}