{
    "additionDate": "2017-08-03T18:53:45Z",
    "biotoolsCURIE": "biotools:pcatag",
    "biotoolsID": "pcatag",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www-genepi.med.utah.edu/genepi.html"
        }
    ],
    "description": "Software that performs tSNP selection using principal component analysis (PCA).",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://www-genepi.med.utah.edu/PCAtag/readme.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Analysis",
                    "uri": "http://edamontology.org/operation_2945"
                },
                {
                    "term": "Principal component plotting",
                    "uri": "http://edamontology.org/operation_2939"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "SNP annotation",
                    "uri": "http://edamontology.org/operation_3661"
                }
            ]
        }
    ],
    "homepage": "http://www-genepi.med.utah.edu/PCAtag/index.html",
    "language": [
        "R",
        "Java"
    ],
    "lastUpdate": "2018-12-10T12:58:49Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/pcatag-2-1-selecte-tagging-snps-principal-component-analysis.html"
        }
    ],
    "name": "PCAtag",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Candidate gene association studies often utilize one single nucleotide polymorphism (SNP) for analysis, with an initial report typically not being replicated by subsequent studies. The failure to replicate may result from incomplete or poor identification of disease-related variants or haplotypes, possibly due to naive SNP selection. A method for identification of linkage disequilibrium (LD) groups and selection of SNPs that capture sufficient intra-genic genetic diversity is described. We assume all SNPs with minor allele frequency above a pre-determined frequency have been identified. Principal component analysis (PCA) is applied to evaluate multivariate SNP correlations to infer groups of SNPs in LD (LD-groups) and to establish an optimal set of group-tagging SNPs (gtSNPs) that provide the most comprehensive coverage of intragenic diversity while minimizing the resources necessary to perform an informative association analysis. This PCA method differs from haplotype block (HB) and haplotype-tagging SNP (htSNP) methods, in that an LD-group of SNPs need not be a contiguous DNA fragment. Results of the PCA method compared well with existing htSNP methods while also providing advantages over those methods, including an indication of the optimal number of SNPs needed. Further, evaluation of the method over multiple replicates of simulated data indicated PCA to be a robust method for SNP selection. Our findings suggest that PCA may be a powerful tool for establishing an optimal SNP set that maximizes the amount of genetic variation captured for a candidate gene using a minimal number of SNPs. © 2003 Wiley-Liss, Inc.",
                "authors": [
                    {
                        "name": "Horne B.D."
                    },
                    {
                        "name": "Camp N.J."
                    }
                ],
                "citationCount": 79,
                "date": "2004-01-01T00:00:00Z",
                "journal": "Genetic Epidemiology",
                "title": "Principal Component Analysis for Selection of Optimal SNP-Sets That Capture Intragenic Genetic Variation"
            },
            "pmid": "14691953"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        },
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        }
    ],
    "validated": 1
}