{
    "accessibility": "Open access",
    "additionDate": "2023-08-24T08:22:53.525084Z",
    "biotoolsCURIE": "biotools:encpdock",
    "biotoolsID": "encpdock",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "nemo8130@gmail.com",
            "name": "Sankar Basu",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "name": "Debasish Mukherjee",
            "typeEntity": "Person"
        },
        {
            "name": "Gargi Biswas",
            "typeEntity": "Person"
        },
        {
            "name": "Nalok Dutta",
            "typeEntity": "Person"
        },
        {
            "name": "Prithwi Ghosh",
            "typeEntity": "Person"
        }
    ],
    "description": "Web-interface for direct conjoint comparative analyses of complementarity and binding energetics in inter-protein associations.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://scinetmol.in/EnCPdock/help.php"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Atomic coordinate",
                        "uri": "http://edamontology.org/data_1743"
                    }
                }
            ],
            "operation": [
                {
                    "term": "Protein interaction prediction",
                    "uri": "http://edamontology.org/operation_2492"
                },
                {
                    "term": "Protein-protein docking",
                    "uri": "http://edamontology.org/operation_3899"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "http://www.scinetmol.in/EnCPdock/",
    "lastUpdate": "2023-08-24T08:22:53.527539Z",
    "license": "Other",
    "name": "EnCPdock",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1007/s00894-023-05626-0",
            "metadata": {
                "abstract": "Context: Protein–protein interaction (PPI) is a key component linked to virtually all cellular processes. Be it an enzyme catalysis (‘classic type functions’ of proteins) or a signal transduction (‘non-classic’), proteins generally function involving stable or quasi-stable multi-protein associations. The physical basis for such associations is inherent in the combined effect of shape and electrostatic complementarities (Sc, EC) of the interacting protein partners at their interface, which provides indirect probabilistic estimates of the stability and affinity of the interaction. While Sc is a necessary criterion for inter-protein associations, EC can be favorable as well as disfavored (e.g., in transient interactions). Estimating equilibrium thermodynamic parameters (∆G binding, K d) by experimental means is costly and time consuming, thereby opening windows for computational structural interventions. Attempts to empirically probe ∆G binding from coarse-grain structural descriptors (primarily, surface area based terms) have lately been overtaken by physics-based, knowledge-based and their hybrid approaches (MM/PBSA, FoldX, etc.) that directly compute ∆G binding without involving intermediate structural descriptors. Methods: Here, we present EnCPdock (https://www.scinetmol.in/EnCPdock/), a user-friendly web-interface for the direct conjoint comparative analyses of complementarity and binding energetics in proteins. EnCPdock returns an AI-predicted ∆G binding computed by combining complementarity (Sc, EC) and other high-level structural descriptors (input feature vectors), and renders a prediction accuracy comparable to the state-of-the-art. EnCPdock further locates a PPI complex in terms of its {Sc, EC} values (taken as an ordered pair) in the two-dimensional complementarity plot (CP). In addition, it also generates mobile molecular graphics of the interfacial atomic contact network for further analyses. EnCPdock also furnishes individual feature trends along with the relative probability estimates (Prfmax) of the obtained feature-scores with respect to the events of their highest observed frequencies. Together, these functionalities are of real practical use for structural tinkering and intervention as might be relevant in the design of targeted protein-interfaces. Combining all its features and applications, EnCPdock presents a unique online tool that should be beneficial to structural biologists and researchers across related fraternities.",
                "authors": [
                    {
                        "name": "Basu S."
                    },
                    {
                        "name": "Biswas G."
                    },
                    {
                        "name": "Dutta N."
                    },
                    {
                        "name": "Ghosh P."
                    },
                    {
                        "name": "Mukherjee D."
                    }
                ],
                "date": "2023-08-01T00:00:00Z",
                "journal": "Journal of Molecular Modeling",
                "title": "EnCPdock: a web-interface for direct conjoint comparative analyses of complementarity and binding energetics in inter-protein associations"
            },
            "pmid": "37423912"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Molecular modelling",
            "uri": "http://edamontology.org/topic_2275"
        },
        {
            "term": "Protein folds and structural domains",
            "uri": "http://edamontology.org/topic_0736"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ]
}
