{
    "additionDate": "2019-09-17T18:03:39Z",
    "biotoolsCURIE": "biotools:Mass_Spec_Studio",
    "biotoolsID": "Mass_Spec_Studio",
    "cost": "Free of charge (with restrictions)",
    "description": "An extensible, vendor-agnostic application for mass spectrometry analysis. \n\nCurrent analysis packages include protein-protein crosslinking (XL), hydrogen/deuterium exchange (HX), covalent labelling quantification and normalization (CLEAN).",
    "documentation": [
        {
            "note": "A short tutorial for the crosslink (XL) analysis package.; Tutorial",
            "type": [
                "Training material"
            ],
            "url": "https://mssdownloads.s3-us-west-2.amazonaws.com/documents/MSStudio-XL-tutorial-1.pdf"
        }
    ],
    "download": [
        {
            "type": "Binaries",
            "url": "https://www.msstudio.ca/downloads/crosslinking/",
            "version": "2.3.0"
        }
    ],
    "editPermission": {
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data handling",
                    "uri": "http://edamontology.org/operation_2409"
                },
                {
                    "term": "Mass spectrum visualisation",
                    "uri": "http://edamontology.org/operation_3694"
                },
                {
                    "term": "Protein interaction prediction",
                    "uri": "http://edamontology.org/operation_2492"
                },
                {
                    "term": "Protein structure validation",
                    "uri": "http://edamontology.org/operation_0321"
                }
            ]
        }
    ],
    "homepage": "https://www.msstudio.ca",
    "language": [
        "C#"
    ],
    "lastUpdate": "2019-09-17T18:22:42Z",
    "license": "Apache-2.0",
    "maturity": "Mature",
    "name": "Mass Spec Studio",
    "operatingSystem": [
        "Windows"
    ],
    "owner": "vsarpe",
    "publication": [
        {
            "doi": "10.1016/j.str.2014.08.013",
            "metadata": {
                "abstract": "© 2014 Elsevier Ltd. All rights reserved.The integration of biophysical data from multiple sources is critical for developing accurate structural models of large multiprotein systems and their regulators. Mass spectrometry (MS) can be used to measure the insertion location for a wide range of topographically sensitive chemical probes, and such insertion data provide a rich, but disparate set of modeling restraints. We have developed a software platform that integrates the analysis of label-based MS and tandem MS (MS2) data with protein modeling activities (Mass Spec Studio). Analysis packages can mine any labeling data from any mass spectrometer in a proteomics-grade manner, and link labeling methods with data-directed protein interaction modeling using HADDOCK. Support is provided for hydrogen/deuterium exchange (HX) and covalent labeling chemistries, including novel acquisition strategies such as targeted HX-MS2 and data-independent HX-MS2. The latter permits the modeling of highly complex systems, which we demonstrate by the analysis of microtubule interactions.",
                "authors": [
                    {
                        "name": "Baker C.A.H."
                    },
                    {
                        "name": "Bonvin A.M.J.J."
                    },
                    {
                        "name": "Burns K.M."
                    },
                    {
                        "name": "Buse J."
                    },
                    {
                        "name": "Rey M."
                    },
                    {
                        "name": "Sarpe V."
                    },
                    {
                        "name": "Schriemer D.C."
                    },
                    {
                        "name": "Van Dijk M."
                    },
                    {
                        "name": "Wordeman L."
                    }
                ],
                "citationCount": 54,
                "date": "2014-10-07T00:00:00Z",
                "journal": "Structure",
                "title": "Mass Spec Studio for integrative structural biology"
            },
            "pmcid": "PMC4391204",
            "pmid": "25242457",
            "type": [
                "Primary"
            ],
            "version": "1.3.2"
        },
        {
            "doi": "10.1074/mcp.O116.058685",
            "metadata": {
                "abstract": "© 2016 by The American Society for Biochemistry and Molecular Biology, Inc.The Mass Spec Studio package was designed to support the extraction of hydrogen-deuterium exchange and covalent labeling data for a range of mass spectrometry (MS)-based workflows, to integrate with restraint-driven protein modeling activities. In this report, we present an extension of the underlying Studio framework and provide a plug-in for crosslink (XL) detection. To accommodate flexibility in XL methods and applications, while maintaining efficient data processing, the plug-in employs a peptide library reduction strategy via a presearch of the tandem-MS data. We demonstrate that prescoring linear unmodified peptide tags using a probabilistic approach substantially reduces search space by requiring both crosslinked peptides to generate sparse data attributable to their linear forms. The method demonstrates highly sensitive crosslink peptide identification with a low false positive rate. Integration with a Haddock plug-in provides a resource that can combine multiple sources of data for protein modeling activities. We generated a structural model of porcine transferrin bound to TbpB, a membranebound receptor essential for iron acquisition in Actinobacillus pleuropneumoniae. Using mutational data and crosslinking restraints, we confirm the mechanism by which TbpB recognizes the iron-loaded form of transferrin, and note the requirement for disparate sources of restraint data for accurate model construction. The software plugin is freely available at www.msstudio. ca. Molecular & Cellular Proteomics 15: 10.1074/mcp. O116.058685, 3071-3080, 2016.",
                "authors": [
                    {
                        "name": "Hepburn M."
                    },
                    {
                        "name": "Ostan N."
                    },
                    {
                        "name": "Rafiei A."
                    },
                    {
                        "name": "Sarpe V."
                    },
                    {
                        "name": "Schriemer D.C."
                    },
                    {
                        "name": "Schryvers A.B."
                    }
                ],
                "citationCount": 21,
                "date": "2016-09-01T00:00:00Z",
                "journal": "Molecular and Cellular Proteomics",
                "title": "High sensitivity crosslink detection coupled with integrative structure modeling in the mass spec studio"
            },
            "pmcid": "PMC5013318",
            "pmid": "27412762",
            "type": [
                "Usage"
            ],
            "version": "2.0.0"
        },
        {
            "doi": "10.1021/acs.analchem.9b01625",
            "metadata": {
                "abstract": "© 2019 American Chemical Society.Covalent labeling with mass spectrometry (CL-MS) provides a direct measure of the chemical and structural features of proteins with the potential for resolution at the amino-acid level. Unfortunately, most applications of CL-MS are limited to narrowly defined differential analyses, where small numbers of residues are compared between two or more protein states. Extending the utility of high-resolution CL-MS for structure-based applications requires more robust computational routines and the development of methodology capable of reporting of labeling yield accurately. Here, we provide a substantial improvement in the analysis of CL-MS data with the development of an extended plug-in built within the Mass Spec Studio development framework (MSS-CLEAN). All elements of data analysis - from database search to site-resolved and normalized labeling output - are accommodated, as illustrated through the nonselective labeling of the human kinesin Eg5 with photoconverted 3,3′-azibutan-1-ol. In developing the new features within the CL-MS plug-in, we identified additional complexities associated with the application of CL reagents, arising primarily from digestion-induced bias in yield measurements and ambiguities in site localization. A strategy is presented involving the use of redundant site labeling data from overlapping peptides, the imputation of missing data, and a normalization routine to determine relative protection factors. These elements together provide for a robust structural interpretation of CL-MS/MS data while minimizing the over-reporting of labeling site resolution. Finally, to minimize bias, we recommend that digestion strategies for the generation of useful overlapping peptides involve the application of complementary enzymes that drive digestion to completion.",
                "authors": [
                    {
                        "name": "Sarpe V."
                    },
                    {
                        "name": "Schriemer D.C."
                    },
                    {
                        "name": "Ziemianowicz D.S."
                    }
                ],
                "citationCount": 9,
                "date": "2019-07-02T00:00:00Z",
                "journal": "Analytical Chemistry",
                "title": "Quantitative Analysis of Protein Covalent Labeling Mass Spectrometry Data in the Mass Spec Studio"
            },
            "pmid": "31198032",
            "type": [
                "Usage"
            ],
            "version": "2.2.0"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Protein structure analysis",
            "uri": "http://edamontology.org/topic_2814"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ],
    "version": [
        "2.3.0"
    ]
}
