{
    "additionDate": "2017-12-18T00:09:49Z",
    "biotoolsCURIE": "biotools:nust",
    "biotoolsID": "nust",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.lcqb.upmc.fr/"
        }
    ],
    "description": "NuST is a set of tools and data sets that can be used to analyze the aggregation of a set of genes along the genome coordinate, at different scales of observation.",
    "documentation": [
        {
            "type": "General",
            "url": "http://www.lcqb.upmc.fr/nust/help/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                }
            ]
        }
    ],
    "homepage": "http://www.lcqb.upmc.fr/nust/",
    "language": [
        "Perl"
    ],
    "lastUpdate": "2018-12-10T12:58:52Z",
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/nust-nucleoid-survey-tool.html"
        }
    ],
    "name": "NuST",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/bts201",
            "metadata": {
                "abstract": "Different experimental results suggest the presence of an interplay between global transcriptional regulation and chromosome spatial organization in bacteria. The identification and clear visualization of spatial clusters of contiguous genes targeted by specific DNA-binding proteins or sensitive to nucleoid perturbations can elucidate links between nucleoid structure and gene expression patterns. Similarly, statistical analysis to assess correlations between results from independent experiments can provide the integrated analysis needed in this line of research. NuST (Nucleoid Survey tools), based on the Escherichia coli genome, gives the non-expert the possibility to analyze the aggregation of genes or loci sets along the genome coordinate, at different scales of observation. It is useful to discover correlations between different sources of data (e.g. expression, binding or genomic data) and genome organization. A user can use it on datasets in the form of gene lists coming from his/her own experiments or bioinformatic analyses, but also make use of the internal database, which collects data from many published studies. © The Author 2012.",
                "authors": [
                    {
                        "name": "Scolari V.F."
                    },
                    {
                        "name": "Zarei M."
                    },
                    {
                        "name": "Osella M."
                    },
                    {
                        "name": "Cosentino M."
                    }
                ],
                "citationCount": 8,
                "date": "2012-06-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "NuST: Analysis of the interplay between nucleoid organization and gene expression"
            },
            "type": "Primary"
        },
        {
            "doi": "10.1039/C0MB00213E",
            "metadata": {
                "abstract": "Focusing on the DNA-bridging nucleoid proteins Fis and H-NS, and integrating several independent experimental and bioinformatic data sources, we investigate the links between chromosomal spatial organization and global transcriptional regulation. By means of a novel multi-scale spatial aggregation analysis, we uncover the existence of contiguous clusters of nucleoid-perturbation sensitive genes along the genome, whose expression is affected by a combination of topological DNA state and nucleoid-shaping protein occupancy. The clusters correlate well with the macrodomain structure of the genome. The most significant of them lay symmetrically at the edges of the Ter macrodomain and involve all of the flagellar and chemotaxis machinery, in addition to key regulators of biofilm formation, suggesting that the regulation of the physical state of the chromosome by the nucleoid proteins plays an important role in coordinating the transcriptional response leading to the switch between a motile and a biofilm lifestyle. © The Royal Society of Chemistry 2011.",
                "authors": [
                    {
                        "name": "Scolari V.F."
                    },
                    {
                        "name": "Bassetti B."
                    },
                    {
                        "name": "Sclavi B."
                    },
                    {
                        "name": "Lagomarsino M.C."
                    }
                ],
                "citationCount": 19,
                "date": "2011-03-01T00:00:00Z",
                "journal": "Molecular BioSystems",
                "title": "Gene clusters reflecting macrodomain structure respond to nucleoid perturbations"
            }
        },
        {
            "doi": "10.1039/C3MB25364C",
            "metadata": {
                "abstract": "The H-NS chromosome-organizing protein in E. coli can stabilize genomic DNA loops, and form oligomeric structures connected to repression of gene expression. Motivated by the link between chromosome organization, protein binding and gene expression, we analyzed publicly available genomic data sets of various origins, from genome-wide protein binding profiles to evolutionary information, exploring the connections between chromosomal organization, gene-silencing, pseudo-gene localization and horizontal gene transfer. We report the existence of transcriptionally silent contiguous areas corresponding to large regions of H-NS protein binding along the genome, their position indicates a possible relationship with the known large-scale features of chromosome organization. © 2013 The Royal Society of Chemistry.",
                "authors": [
                    {
                        "name": "Zarei M."
                    },
                    {
                        "name": "Sclavi B."
                    },
                    {
                        "name": "Lagomarsino M.C."
                    }
                ],
                "citationCount": 13,
                "date": "2013-04-01T00:00:00Z",
                "journal": "Molecular BioSystems",
                "title": "Gene silencing and large-scale domain structure of the E. coli genome"
            }
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        }
    ],
    "validated": 1
}