{
    "additionDate": "2019-11-14T18:36:07Z",
    "biotoolsCURIE": "biotools:COXMEG",
    "biotoolsID": "COXMEG",
    "confidence_flag": "tool",
    "description": "Genome-wide association analysis of age-at-onset traits using Cox mixed-effects models | Abstract Age-at-onset is one of the critical phenotypes in cohort studies of age-related diseases. Large-scale genome-wide association studies (GWAS) of age-at-onset can provide more insights into genetic effects on disease progression, and transitions between different stages. Moreover, proportional hazards or Cox regression generally achieves higher statistical power in a cohort study than a binary trait using logistic regression. Although mixed-effects models are widely used in GWAS to correct for population stratification and family structure, application of Cox mixed-effects models (CMEMs) to large-scale GWAS are so far hindered by intractable computational intensity. In this work, we propose COXMEG, an efficient R package for conducting GWAS of age-at-onset using CMEMs",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "https://CRAN.R-project.org/package=coxmeg",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-01-14T14:41:57Z",
    "name": "COXMEG",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1101/729285"
        },
        {
            "doi": "10.1534/genetics.119.302940",
            "metadata": {
                "abstract": "Copyright © 2020 by the Genetics Society of America.Age-at-onset is one of the critical traits in cohort studies of age-related diseases. Large-scale genome-wide association studies (GWAS) of age-at-onset traits can provide more insights into genetic effects on disease progression and transitions between stages. Moreover, proportional hazards (or Cox) regression models can achieve higher statistical power in a cohort study than a casecontrol trait using logistic regression. Although mixed-effects models are widely used in GWAS to correct for sample dependence, application of Cox mixed-effects models (CMEMs) to large-scale GWAS is so far hindered by intractable computational cost. In this work, we propose COXMEG, an efficient R package for conducting GWAS of age-at-onset traits using CMEMs. COXMEG introduces fast estimation algorithms for general sparse relatedness matrices including, but not limited to, block-diagonal pedigree-based matrices. COXMEG also introduces a fast and powerful score test for dense relatedness matrices, accounting for both population stratification and family structure. In addition, COXMEG generalizes existing algorithms to support positive semidefinite relatedness matrices, which are common in twin and family studies. Our simulation studies suggest that COXMEG, depending on the structure of the relatedness matrix, is orders of magnitude computationally more efficient than coxme and coxph with frailty for GWAS. We found that using sparse approximation of relatedness matrices yielded highly comparable results in controlling false-positive rate and retaining statistical power for an ethnically homogeneous family-based sample. By applying COXMEG to a study of Alzheimer's disease (AD) with a Late-Onset Alzheimer's Disease Family Study from the National Institute on Aging sample comprising 3456 non-Hispanic whites and 287 African Americans, we identified the APOE e4 variant with strong statistical power (P = 1e2101), far more significant than that reported in a previous study using a transformed variable and a marginal Cox model. Furthermore, we identified novel SNP rs36051450 (P = 2e29) near GRAMD1B, the minor allele of which significantly reduced the hazards of AD in both genders. These results demonstrated that COXMEG greatly facilitates the application of CMEMs in GWAS of age-at-onset traits.",
                "authors": [
                    {
                        "name": "He L."
                    },
                    {
                        "name": "Kulminski A.M."
                    }
                ],
                "citationCount": 3,
                "date": "2020-05-01T00:00:00Z",
                "journal": "Genetics",
                "title": "Fast algorithms for conducting large-scale gwas of age-at-onset traits using cox mixed-effects models"
            },
            "pmcid": "PMC7198273",
            "pmid": "32132097"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "GWAS study",
            "uri": "http://edamontology.org/topic_3517"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        }
    ],
    "validated": 1
}