{"credit":[{"email":"raetsch@inf.ethz.ch","name":"Gunnar Rätsch","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"http://www.mgene.org/web"}],"function":[{"operation":[{"term":"Protein modelling","uri":"http://edamontology.org/operation_0477"},{"term":"Gene prediction","uri":"http://edamontology.org/operation_2454"},{"term":"Protein secondary structure prediction","uri":"http://edamontology.org/operation_0267"},{"term":"DNA structure prediction","uri":"http://edamontology.org/operation_2442"},{"term":"PCR primer design","uri":"http://edamontology.org/operation_0308"}]}],"labels":{"operatingSystem":["Linux","Windows","Mac"],"toolType":["Web application"],"topic":[{"term":"Model organisms","uri":"http://edamontology.org/topic_0621"},{"term":"Gene structure","uri":"http://edamontology.org/topic_0114"},{"term":"DNA","uri":"http://edamontology.org/topic_0654"},{"term":"Structure prediction","uri":"http://edamontology.org/topic_0082"},{"term":"Proteins","uri":"http://edamontology.org/topic_0078"}]},"publication":[{"abstract":"We describe mGene.web, a web service for the genome-wide prediction of protein coding genes from eukaryotic DNA sequences. It offers pre-trained models for the recognition of gene structures including untranslated regions in an increasing number of organisms. With mGene.web, users have the additional possibility to train the system with their own data for other organisms on the push of a button, a functionality that will greatly accelerate the annotation of newly sequenced genomes. The system is built in a highly modular way, such that individual components of the framework, like the promoter prediction tool or the splice site predictor, can be used autonomously. The underlying gene finding system mGene is based on discriminative machine learning techniques and its high accuracy has been demonstrated in an international competition on nematode genomes. mGene.web is available at http://www.mgene.org/web, it is free of charge and can be used for eukaryotic genomes of small to moderate size (several hundred Mbp).","authors":["Schweikert G.","Behr J.","Zien A.","Zeller G.","Ong C.S.","Sonnenburg S.","Ratsch G."],"cit_count":16,"journal":"Nucleic Acids Research","pmid":"19494180","title":"mGene.web: A web service for accurate computational gene finding","year":"2009-08-04"},{"abstract":"We present a highly accurate gene-prediction system for eukaryotic genomes, called mGene. It combines in an unprecedented manner the flexibility of generalized hidden Markov models (gHMMs) with the predictive power of modern machine learning methods, such as Support Vector Machines (SVMs). Its excellent performance was proved in an objective competition based on the genome of the nematode Caenorhabditis elegans. Considering the average of sensitivity and specificity, the developmental version of mGene exhibited the best prediction performance on nucleotide, exon, and transcript level for ab initio and multiple-genome gene-prediction tasks. The fully developed version shows superior performance in 10 out of 12 evaluation criteria compared with the other participating gene finders, including Fgenesh++ and Augustus. An in-depth analysis of mGene's genome-wide predictions revealed that ≈2200 predicted genes were not contained in the current genome annotation. Testing a subset of 57 of these genes by RT-PCR and sequencing, we confirmed expression for 24 (42%) of them. mGene missed 300 annotated genes, out of which 205 were unconfirmed. RT-PCR testing of 24 of these genes resulted in a success rate of merely 8%. These findings suggest that even the gene catalog of a well-studied organism such as C. elegans can be substantially improved by mGene's predictions. We also provide gene predictions for the four nematodes C. briggsae, C. brenneri, C. japonica, and C. remanei. Comparing the resulting proteomes among these organisms and to the known protein universe, we identified many species-specific gene inventions. In a quality assessment of several available annotations for these genomes, we find that mGene's predictions are most accurate. © 2009 by Cold Spring Harbor Laboratory Press.","authors":["Schweikert G.","Zien A.","Zeller G.","Behr J.","Dieterich C.","Cheng S.O.","Philips P.","De Bona F.","Hartmann L.","Bohlen A.","Kruger N.","Sonnenburg S.","Ratsch G."],"cit_count":55,"journal":"Genome Research","pmid":"19564452","title":"mGene: Accurate SVM-based gene finding with an application to nematode genomes","year":"2009-11-01"}],"summary":{"biotoolsCURIE":"biotools:mgene.web","biotoolsID":"mgene.web","description":"Web server for the genome wide prediction of protein coding genes from eukaryotic DNA sequences based on pre-computed models of gene structures. Users may also compute their own model using their own data.","homepage":"http://www.mgene.org/web","name":"mGene.web"}}