{
    "additionDate": "2021-01-18T10:09:06Z",
    "biotoolsCURIE": "biotools:rad",
    "biotoolsID": "rad",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "russells@andrew.cmu.edu",
            "name": "Russell Schwartz",
            "typeEntity": "Person"
        }
    ],
    "description": "Robust and accurate deconvolution of tumor populations uncovers evolutionary mechanisms of breast cancer metastasis.\n\nRobust and Accurate Deconvolution (RAD).\n\nRAD is a toolkit that unmixes bulk tumor samples. Given a non-negative bulk RNA expression matrix B \\in R_+^{m x n}, where each row i is a gene, each column j is a tumor sample, our goal is to infer an expression profile matrix C \\in R_+^{m x k}, where each column l is a cell community, and a fraction matrix F \\in R_+^{k x n}, such that:.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Deisotoping",
                    "uri": "http://edamontology.org/operation_3629"
                },
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                }
            ]
        }
    ],
    "homepage": "https://github.com/CMUSchwartzLab/RAD",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-02-03T13:44:31Z",
    "license": "MIT",
    "name": "RAD",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAA396",
            "metadata": {
                "abstract": "© The Author(s) 2020. Published by Oxford University Press.Motivation: Cancer develops and progresses through a clonal evolutionary process. Understanding progression to metastasis is of particular clinical importance, but is not easily analyzed by recent methods because it generally requires studying samples gathered years apart, for which modern single-cell sequencing is rarely an option. Revealing the clonal evolution mechanisms in the metastatic transition thus still depends on unmixing tumor subpopulations from bulk genomic data. Methods: We develop a novel toolkit called robust and accurate deconvolution (RAD) to deconvolve biologically meaningful tumor populations from multiple transcriptomic samples spanning the two progression states. RAD uses gene module compression to mitigate considerable noise in RNA, and a hybrid optimizer to achieve a robust and accurate solution. Finally, we apply a phylogenetic algorithm to infer how associated cell populations adapt across the metastatic transition via changes in expression programs and cell-type composition. Results: We validated the superior robustness and accuracy of RAD over alternative algorithms on a real dataset, and validated the effectiveness of gene module compression on both simulated and real bulk RNA data. We further applied the methods to a breast cancer metastasis dataset, and discovered common early events that promote tumor progression and migration to different metastatic sites, such as dysregulation of ECM-receptor, focal adhesion and PI3k-Akt pathways. Availability and implementation: The source code of the RAD package, models, experiments and technical details such as parameters, is available at https://github.com/CMUSchwartzLab/RAD.",
                "authors": [
                    {
                        "name": "Tao Y."
                    },
                    {
                        "name": "Lei H."
                    },
                    {
                        "name": "Fu X."
                    },
                    {
                        "name": "Lee A.V."
                    },
                    {
                        "name": "Ma J."
                    },
                    {
                        "name": "Schwartz R."
                    }
                ],
                "date": "2021-01-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Robust and accurate deconvolution of tumor populations uncovers evolutionary mechanisms of breast cancer metastasis"
            },
            "pmcid": "PMC7355293",
            "pmid": "32657393"
        }
    ],
    "topic": [
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ]
}