{
    "additionDate": "2017-08-03T18:59:19Z",
    "biotoolsCURIE": "biotools:sdphapinfer",
    "biotoolsID": "sdphapinfer",
    "credit": [
        {
            "email": "kmchao@csie.ntu.edu.tw",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.csie.ntu.edu.tw/~kmchao/"
        }
    ],
    "description": "The tool formulates the haplotype inference problem as the following integer quadratic programming (IQP) problem. The objective function is to minimize the number of haplotypes, and the constraint functions are to resolve each genotype.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://www.csie.ntu.edu.tw/~kmchao/tools/HapInfer/index.htm#SDPHapInfer"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Haplotype mapping",
                    "uri": "http://edamontology.org/operation_0487"
                }
            ]
        }
    ],
    "homepage": "http://www.csie.ntu.edu.tw/~kmchao/tools/HapInfer/index.htm#SDPHapInfer",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2018-12-10T12:58:50Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/sdphapinfer-longhapinfer-software-haplotype-inference.html"
        }
    ],
    "name": "SDPHapInfer",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "This paper studies haplotype inference by maximum parsimony using population data. We define the optimal haplotype inference (OHI) problem as given a set of genotypes and a set of related haplotypes, find a minimum subset of haplotypes that can resolve all the genotypes. We prove that OHI is NP-hard and can be formulated as an integer quadratic programming (IQP) problem. To solve the IQP problem, we propose an iterative semi-definite programming-based approximation algorithm, (called SDPHapInfer). We show that this algorithm finds a solution within a factor of O(log n) of the optimal solution, where n is the number of genotypes. This algorithm has been implemented and tested on a variety of simulated and biological data. In comparison with three other methods, (1) HAPAR, which was implemented based on the branching and bound algorithm, (2) HAPLOTYPER, which was implemented based on the expectation-maximization algorithm, and (3) PHASE, which combined the Gibbs sampling algorithm with an approximate coalescent prior, the experimental results indicate that SDPHapInfer and HAPLOTYPER have similar error rates. In addition, the results generated by PHASE have lower error rates on some data but higher error rates on others. The error rates of HAPAR are higher than the others on biological data. In terms of efficiency, SDPHapInfer, HAPLOTYPER, and PHASE output a solution in a stable and consistent way, and they run much faster than HAPAR when the number of genotypes becomes large. © Mary Ann Liebert, Inc.",
                "authors": [
                    {
                        "name": "Chao K.-M."
                    },
                    {
                        "name": "Chen T."
                    },
                    {
                        "name": "Huang Y.-T."
                    }
                ],
                "citationCount": 32,
                "date": "2005-12-01T00:00:00Z",
                "journal": "Journal of Computational Biology",
                "title": "An approximation algorithm for haplotype inference by maximum parsimony"
            },
            "pmid": "16379533"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        }
    ],
    "validated": 1
}
