{
    "additionDate": "2017-01-17T15:02:51Z",
    "biotoolsCURIE": "biotools:biseq",
    "biotoolsID": "biseq",
    "collectionID": [
        "BioConductor"
    ],
    "credit": [
        {
            "email": "katjah@stanford.edu",
            "name": "Katja Hebestreit",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "This package provides useful classes and functions to handle and analyze targeted bisulfite sequencing (BS) data such as reduced-representation bisulfite sequencing (RRBS) data. In particular, it implements an algorithm to detect differentially methylated regions (DMRs). The package takes already aligned BS data from one or multiple samples.",
    "documentation": [
        {
            "type": "User manual",
            "url": "http://bioconductor.org/packages/release/bioc/html/BiSeq.html"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://bioconductor/packages/release/bioc/src/contrib/BiSeq_1.14.0.tar.gz"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Methylation analysis",
                    "uri": "http://edamontology.org/operation_3204"
                }
            ]
        }
    ],
    "homepage": "http://bioconductor.org/packages/release/bioc/html/BiSeq.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-10T12:58:50Z",
    "license": "GPL-3.0",
    "name": "BiSeq",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "bioconductor_import",
    "publication": [
        {
            "doi": "10.1093/bib/bbv095",
            "metadata": {
                "abstract": "© The Author 2015. Published by Oxford University Press. In the biology of tissue development and diseases, DNA methylation plays an important role. For a deeper understanding, it is crucial to accurately compare DNA methylation patterns between groups of samples representing different conditions. A widely used method to investigate DNA methylation in the CpG context is bisulfite sequencing, which produces data on the single-nucleotide scale. While there are benefits to analyzing CpG sites on a basepair level, there are both biological and statistical reasons to test entire genomic regions for differential methylation. However, the analysis of DNA methylation is hampered by the lack of best practice standards. Here, we compared multiple approaches for testing predefined genomic regions for differential DNA methylation in bisulfite sequencing data. Nine methods were evaluated: BiSeq, COHCAP, Goeman's Global Test, Limma, methylKit/eDMR, RADMeth and three log-linear regression approaches with different distribution assumptions. We applied these methods to simulated data and determined their sensitivity and specificity. This revealed performance differences, which were also seen when applied to real data. Methods that first test single CpG sites and then test regions based on transformed CpG-wise P-values performed better than methods that summarize methylation levels or raw reads. Interestingly, smoothing of methylation levels had a negligible impact. In particular, Global Test, BiSeq and RADMeth/z-test outperformed the other methods we evaluated, providing valuable guidance for more accurate analysis of DNA methylation.",
                "authors": [
                    {
                        "name": "Klein H-U."
                    },
                    {
                        "name": "Hebestreit K."
                    }
                ],
                "citationCount": 11,
                "date": "2016-09-01T00:00:00Z",
                "journal": "Briefings in Bioinformatics",
                "title": "An evaluation of methods to test predefined genomic regions for differential methylation in bisulfite sequencing data"
            },
            "type": "Review"
        },
        {
            "doi": "10.1093/bib/bbv095",
            "type": "Primary"
        }
    ],
    "toolType": [
        "Command-line tool",
        "Library"
    ],
    "topic": [
        {
            "term": "Methylated DNA immunoprecipitation",
            "uri": "http://edamontology.org/topic_3674"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ],
    "validated": 1,
    "version": [
        "1.14.0"
    ]
}