{
    "accessibility": "Open access",
    "additionDate": "2021-12-06T19:23:18.483356Z",
    "biotoolsCURIE": "biotools:isfrag",
    "biotoolsID": "isfrag",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "thuan@chem.ubc.ca",
            "name": "Tao Huan",
            "orcidid": "https://orcid.org/0000-0001-6295-2435"
        },
        {
            "name": "Huaxu Yu"
        },
        {
            "name": "Jian Guo"
        },
        {
            "name": "Sam Shen"
        },
        {
            "name": "Shipei Xing",
            "orcidid": "https://orcid.org/0000-0001-6227-6959"
        }
    ],
    "description": "De Novo Recognition of In-Source Fragments for Liquid Chromatography-Mass Spectrometry Data.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Feature extraction",
                    "uri": "http://edamontology.org/operation_3937"
                },
                {
                    "term": "Natural product identification",
                    "uri": "http://edamontology.org/operation_3803"
                },
                {
                    "term": "Pathway visualisation",
                    "uri": "http://edamontology.org/operation_3926"
                },
                {
                    "term": "Protein identification",
                    "uri": "http://edamontology.org/operation_3767"
                }
            ]
        }
    ],
    "homepage": "https://github.com/HuanLab/ISFrag",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-12-06T19:25:16.486756Z",
    "license": "MIT",
    "name": "ISFrag",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1021/ACS.ANALCHEM.1C01644",
            "metadata": {
                "abstract": "© 2021 American Chemical Society.In-source fragmentation (ISF) is a naturally occurring phenomenon during electrospray ionization (ESI) in liquid chromatography-mass spectrometry (LC-MS) analysis. ISF leads to false metabolite annotation in untargeted metabolomics, prompting misinterpretation of the underlying biological mechanisms. Conventional metabolomic data cleaning mainly focuses on the annotation of adducts and isotopes, and the recognition of ISF features is mainly based on common neutral losses and the LC coelution pattern. In this work, we recognized three increasingly important patterns of ISF features, including (1) coeluting with their precursor ions, (2) being in the tandem MS (MS2) spectra of their precursor ions, and (3) sharing similar MS2 fragmentation patterns with their precursor ions. Based on these patterns, we developed an R package, ISFrag, to comprehensively recognize all possible ISF features from LC-MS data generated from full-scan, data-dependent acquisition, and data-independent acquisition modes without the assistance of common neutral loss information or MS2 spectral library. Tested using metabolite standards, we achieved a 100% correct recognition of level 1 ISF features and over 80% correct recognition for level 2 ISF features. Further application of ISFrag on untargeted metabolomics data allows us to identify ISF features that can potentially cause false metabolite annotation at an omics-scale. With the help of ISFrag, we performed a systematic investigation of how ISF features are influenced by different MS parameters, including capillary voltage, end plate offset, ion energy, and \"collision energy\". Our results show that while increasing energies can increase the number of real metabolic features and ISF features, the percentage of ISF features might not necessarily increase. Finally, using ISFrag, we created an ISF pathway to visualize the relationships between multiple ISF features that belong to the same precursor ion. ISFrag is freely available on GitHub (https://github.com/HuanLab/ISFrag).",
                "authors": [
                    {
                        "name": "Guo J."
                    },
                    {
                        "name": "Huan T."
                    },
                    {
                        "name": "Shen S."
                    },
                    {
                        "name": "Xing S."
                    },
                    {
                        "name": "Yu H."
                    }
                ],
                "date": "2021-07-27T00:00:00Z",
                "journal": "Analytical Chemistry",
                "title": "ISFrag: De Novo Recognition of In-Source Fragments for Liquid Chromatography-Mass Spectrometry Data"
            },
            "pmid": "34270210"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Endocrinology and metabolism",
            "uri": "http://edamontology.org/topic_3407"
        },
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
