{
    "additionDate": "2017-08-03T18:53:08Z",
    "biotoolsCURIE": "biotools:ova",
    "biotoolsID": "ova",
    "credit": [
        {
            "email": "umaan@leeds.ac.uk",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://dna.leeds.ac.uk/"
        }
    ],
    "description": "Online variant filtering and prioritisation application. Ontology Variant Analysis Tool can filter your VCF files on a wide array of criteria. Remaining genes are prioritisated based on their functional and phenotypic profile similarity to a user supplied phenotype.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://dna2.leeds.ac.uk:8080/OVA/index.jsp"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genetic variation analysis",
                    "uri": "http://edamontology.org/operation_3197"
                }
            ]
        }
    ],
    "homepage": "http://dna2.leeds.ac.uk:8080/OVA/index.jsp",
    "language": [
        "JavaScript"
    ],
    "lastUpdate": "2018-12-10T12:58:49Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/ova-ontology-variant-analysis-tool.html"
        }
    ],
    "name": "OVA",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "© The Author 2015. Published by Oxford University Press. All rights reserved.Motivation: Exome sequencing has become a de facto standard method for Mendelian disease gene discovery in recent years, yet identifying disease-causing mutations among thousands of candidate variants remains a non-trivial task. Results: Here we describe a new variant prioritization tool, OVA (ontology variant analysis), in which user-provided phenotypic information is exploited to infer deeper biological context. OVA combines a knowledge-based approach with a variant-filtering framework. It reduces the number of candidate variants by considering genotype and predicted effect on protein sequence, and scores the remainder on biological relevance to the query phenotype. We take advantage of several ontologies in order to bridge knowledge across multiple biomedical domains and facilitate computational analysis of annotations pertaining to genes, diseases, phenotypes, tissues and pathways. In this way, OVA combines information regarding molecular and physical phenotypes and integrates both human and model organism data to effectively prioritize variants. By assessing performance on both known and novel disease mutations, we show that OVA performs biologically meaningful candidate variant prioritization and can be more accurate than another recently published candidate variant prioritization tool.",
                "authors": [
                    {
                        "name": "Antanaviciute A."
                    },
                    {
                        "name": "Watson C.M."
                    },
                    {
                        "name": "Harrison S.M."
                    },
                    {
                        "name": "Lascelles C."
                    },
                    {
                        "name": "Crinnion L."
                    },
                    {
                        "name": "Markham A.F."
                    },
                    {
                        "name": "Bonthron D.T."
                    },
                    {
                        "name": "Carr I.M."
                    }
                ],
                "citationCount": 13,
                "date": "2015-06-18T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "OVA: Integrating molecular and physical phenotype data from multiple biomedical domain ontologies with variant filtering for enhanced variant prioritization"
            },
            "pmid": "26272982"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Function analysis",
            "uri": "http://edamontology.org/topic_1775"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        }
    ],
    "validated": 1
}