{
    "additionDate": "2018-07-07T16:09:03Z",
    "biotoolsCURIE": "biotools:snovault",
    "biotoolsID": "snovault",
    "credit": [
        {
            "email": "cherry@stanford.edu",
            "name": "J. Michael Cherry",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "The tool supports metadata and file submission, a database used for metadata storage, web pages for displaying the metadata and a robust API for querying the metadata.",
    "documentation": [
        {
            "type": "General",
            "url": "https://github.com/ENCODE-DCC/snovault/blob/master/README.rst"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data handling",
                    "uri": "http://edamontology.org/operation_2409"
                }
            ]
        }
    ],
    "homepage": "https://github.com/ENCODE-DCC/snovault/",
    "language": [
        "JavaScript",
        "Python"
    ],
    "lastUpdate": "2018-12-10T12:58:59Z",
    "name": "SnoVault",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "migle_sur",
    "publication": [
        {
            "doi": "10.1371/journal.pone.0175310",
            "metadata": {
                "abstract": "© 2017 Hitz et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited. The Encyclopedia of DNA elements (ENCODE) project is an ongoing collaborative effort to create a comprehensive catalog of functional elements initiated shortly after the completion of the Human Genome Project. The current database exceeds 6500 experiments across more than 450 cell lines and tissues using a wide array of experimental techniques to study the chromatin structure, regulatory and transcriptional landscape of the H. sapiens andM. musculus genomes. All ENCODE experimental data, metadata, and associated computational analyses are submitted to the ENCODE Data Coordination Center (DCC) for validation, tracking, storage, unified processing, and distribution to community resources and the scientific community. As the volume of data increases, the identification and organization of experimental details becomes increasingly intricate and demands careful curation. The ENCODE DCC has created a general purpose software system, known as SnoVault, that supports metadata and file submission, a database used for metadata storage, web pages for displaying the metadata and a robust API for querying the metadata. The software is fully open-source, code and installation instructions can be found at: http://github.com/ENCODE-DCC/snovault/ (for the generic database) and http://github.com/ENCODE-DCC/encoded/ to store genomic data in the manner of ENCODE. The core database engine, SnoVault (which is completely independent of ENCODE, genomic data, or bioinformatic data) has been released as a separate Python package.",
                "authors": [
                    {
                        "name": "Hitz B.C."
                    },
                    {
                        "name": "Rowe L.D."
                    },
                    {
                        "name": "Podduturi N.R."
                    },
                    {
                        "name": "Glick D.I."
                    },
                    {
                        "name": "Baymuradov U.K."
                    },
                    {
                        "name": "Malladi V.S."
                    },
                    {
                        "name": "Chan E.T."
                    },
                    {
                        "name": "Davidson J.M."
                    },
                    {
                        "name": "Gabdank I."
                    },
                    {
                        "name": "Narayana A.K."
                    },
                    {
                        "name": "Onate K.C."
                    },
                    {
                        "name": "Hilton J."
                    },
                    {
                        "name": "Ho M.C."
                    },
                    {
                        "name": "Lee B.T."
                    },
                    {
                        "name": "Miyasato S.R."
                    },
                    {
                        "name": "Dreszer T.R."
                    },
                    {
                        "name": "Sloan C.A."
                    },
                    {
                        "name": "Strattan J.S."
                    },
                    {
                        "name": "Tanaka F.Y."
                    },
                    {
                        "name": "Hong E.L."
                    },
                    {
                        "name": "Cherry J.M."
                    }
                ],
                "citationCount": 2,
                "date": "2017-04-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "SnoVault and encodeD: A novel object-based storage system and applications to ENCODE metadata"
            },
            "type": "Primary"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Data submission, annotation and curation",
            "uri": "http://edamontology.org/topic_0219"
        }
    ],
    "validated": 1
}