{
    "additionDate": "2017-01-13T13:13:56Z",
    "biotoolsCURIE": "biotools:bwa-sw",
    "biotoolsID": "bwa-sw",
    "collectionID": [
        "BWA"
    ],
    "credit": [
        {
            "email": "me@liheng.org",
            "name": "Heng Li",
            "orcidid": "http://orcid.org/0000-0003-4874-2874",
            "typeEntity": "Person",
            "typeRole": [
                "Contributor"
            ],
            "url": "http://www.liheng.org/"
        },
        {
            "email": "bio-bwa-help@sourceforge.net",
            "name": "bwa team",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Fast, accurate, memory-efficient aligner for long sequencing reads",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://bio-bwa.sourceforge.net/bwa.shtml"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Read mapping",
                    "uri": "http://edamontology.org/operation_3198"
                }
            ]
        }
    ],
    "homepage": "http://bio-bwa.sourceforge.net/",
    "language": [
        "C"
    ],
    "lastUpdate": "2021-04-15T19:26:38Z",
    "license": "MIT",
    "maturity": "Mature",
    "name": "BWA-SW",
    "operatingSystem": [
        "Linux"
    ],
    "otherID": [
        {
            "type": "rrid",
            "value": "RRID:SCR_010910"
        }
    ],
    "owner": "seqwiki_import",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btp698",
            "metadata": {
                "abstract": "Motivation: Many programs for aligning short sequencing reads to a reference genome have been developed in the last 2 years. Most of them are very efficient for short reads but inefficient or not applicable for reads >200 bp because the algorithms are heavily and specifically tuned for short queries with low sequencing error rate. However, some sequencing platforms already produce longer reads and others are expected to become available soon. For longer reads, hashingbased software such as BLAT and SSAHA2 remain the only choices. Nonetheless, these methods are substantially slower than short-read aligners in terms of aligned bases per unit time. Results: We designed and implemented a new algorithm, Burrows-Wheeler Aligner's Smith-Waterman Alignment (BWA-SW), to align long sequences up to 1Mb against a large sequence database (e.g. the human genome) with a few gigabytes of memory. The algorithm is as accurate as SSAHA2, more accurate than BLAT, and is several to tens of times faster than both. Availability: http://bio-bwa.sourceforge.net. Contact: rd@sanger.ac.uk © The Author(s) 2010. Published by Oxford University Press.",
                "authors": [
                    {
                        "name": "Durbin R."
                    },
                    {
                        "name": "Li H."
                    }
                ],
                "citationCount": 5369,
                "date": "2010-01-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Fast and accurate long-read alignment with Burrows-Wheeler transform"
            },
            "pmcid": "PMC2828108",
            "pmid": "20080505",
            "type": [
                "Primary"
            ]
        },
        {
            "doi": "10.1186/1471-2164-15-264",
            "metadata": {
                "abstract": "Background: The rapid evolution in high-throughput sequencing (HTS) technologies has opened up new perspectives in several research fields and led to the production of large volumes of sequence data. A fundamental step in HTS data analysis is the mapping of reads onto reference sequences. Choosing a suitable mapper for a given technology and a given application is a subtle task because of the difficulty of evaluating mapping algorithms.Results: In this paper, we present a benchmark procedure to compare mapping algorithms used in HTS using both real and simulated datasets and considering four evaluation criteria: computational resource and time requirements, robustness of mapping, ability to report positions for reads in repetitive regions, and ability to retrieve true genetic variation positions. To measure robustness, we introduced a new definition for a correctly mapped read taking into account not only the expected start position of the read but also the end position and the number of indels and substitutions. We developed CuReSim, a new read simulator, that is able to generate customized benchmark data for any kind of HTS technology by adjusting parameters to the error types. CuReSim and CuReSimEval, a tool to evaluate the mapping quality of the CuReSim simulated reads, are freely available. We applied our benchmark procedure to evaluate 14 mappers in the context of whole genome sequencing of small genomes with Ion Torrent data for which such a comparison has not yet been established.Conclusions: A benchmark procedure to compare HTS data mappers is introduced with a new definition for the mapping correctness as well as tools to generate simulated reads and evaluate mapping quality. The application of this procedure to Ion Torrent data from the whole genome sequencing of small genomes has allowed us to validate our benchmark procedure and demonstrate that it is helpful for selecting a mapper based on the intended application, questions to be addressed, and the technology used. This benchmark procedure can be used to evaluate existing or in-development mappers as well as to optimize parameters of a chosen mapper for any application and any sequencing platform. © 2014 Caboche et al.; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Audebert C."
                    },
                    {
                        "name": "Caboche S."
                    },
                    {
                        "name": "Hot D."
                    },
                    {
                        "name": "Lemoine Y."
                    }
                ],
                "citationCount": 55,
                "date": "2014-04-05T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "Comparison of mapping algorithms used in high-throughput sequencing: Application to Ion Torrent data"
            },
            "pmcid": "PMC4051166",
            "pmid": "24708189",
            "type": [
                "Benchmarking study"
            ]
        },
        {
            "doi": "10.1093/bioinformatics/btu146",
            "metadata": {
                "abstract": "Motivation: Next-generation sequencing has become an important tool in molecular biology. Various protocols to investigate genomic, transcriptomic and epigenomic features across virtually all species and tissues have been devised. For most of these experiments, one of the first crucial steps of bioinformatic analysis is the mapping of reads to reference genomes. Results: Here, we present thorough benchmarks of our read aligner segemehl in comparison with other state-of-the-art methods. Furthermore, we introduce the tool lack to rescue unmapped RNA-seq reads which works in conjunction with segemehl and many other frequently used split-read aligners. © The Author 2014.",
                "authors": [
                    {
                        "name": "Hoffmann S."
                    },
                    {
                        "name": "Otto C."
                    },
                    {
                        "name": "Stadler P.F."
                    }
                ],
                "citationCount": 46,
                "date": "2014-07-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Lacking alignments? The next-generation sequencing mapper segemehl revisited"
            },
            "pmid": "24626854",
            "type": [
                "Benchmarking study"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        }
    ],
    "validated": 1
}
