{
    "accessibility": [],
    "additionDate": "2017-12-18T00:10:25Z",
    "biotoolsCURIE": "biotools:popi",
    "biotoolsID": "popi",
    "collectionID": [],
    "confidence_flag": null,
    "cost": null,
    "credit": [
        {
            "email": null,
            "gridid": null,
            "name": null,
            "note": null,
            "orcidid": null,
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://140.113.239.45/"
        }
    ],
    "description": "POPI is a SVM-based prediction server using informative physicochemical properties for predicting immunogenicity of binding peptides of MHC class I and II.",
    "documentation": [
        {
            "note": null,
            "type": "General",
            "url": "http://iclab.life.nctu.edu.tw/POPI/help.php"
        }
    ],
    "download": [],
    "editPermission": {
        "authors": [],
        "type": "private"
    },
    "elixirNode": [],
    "elixirPlatform": [],
    "elixir_badge": 0,
    "function": [
        {
            "cmd": null,
            "input": [],
            "note": null,
            "operation": [
                {
                    "term": "Protein sequence analysis",
                    "uri": "http://edamontology.org/operation_2479"
                }
            ],
            "output": []
        },
        {
            "cmd": null,
            "input": [],
            "note": null,
            "operation": [
                {
                    "term": "Prediction",
                    "uri": "http://edamontology.org/operation_2423"
                }
            ],
            "output": []
        }
    ],
    "homepage": "http://iclab.life.nctu.edu.tw/POPI/",
    "homepage_status": 1,
    "language": [],
    "lastUpdate": "2018-12-10T12:58:58Z",
    "license": null,
    "link": [
        {
            "note": null,
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/popi-2-1-web-server-for-predicting-immunogenicity-of-mhc-class-i-and-ii-binding-peptides.html"
        }
    ],
    "maturity": null,
    "name": "POPI",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "otherID": [],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btm061",
            "metadata": {
                "abstract": "Motivation: Both modeling of antigen-processing pathway including major histocompatibility complex (MHC) binding and immunogenicity prediction of those MHC-binding peptides are essential to develop a computer-aided system of peptide-based vaccine design that is one goal of immunoinformatics. Numerous studies have dealt with modeling the immunogenic pathway but not the intractable problem of immunogenicity prediction due to complex effects of many intrinsic and extrinsic factors. Moderate affinity of the MHC-peptide complex is essential to induce immune responses, but the relationship between the affinity and peptide immunogenicity is too weak to use for predicting immunogenicity. This study focuses on mining informative physicochemical properties from known experimental immunogenicity data to understand immune responses and predict immunogenicity of MHC-binding peptides accurately. Results: This study proposes a computational method to mine a feature set of informative physicochemical properties from MHC class I binding peptides to design a support vector machine (SVM) based system (named POPI) for the prediction of peptide immunogenicity. High performance of POPI arises mainly from an inheritable bi-objective genetic algorithm, which aims to automatically determine the best number m out of 531 physicochemical properties, identify these m properties and tune SVM parameters simultaneously. The dataset consisting of 428 human MHC class I binding peptides belonging to four classes of immunogenicity was established from MHCPEP, a database of MHC-binding peptides (Brusic et al, 1998). POPI, utilizing the m = 23 selected properties, performs well with the accuracy of 64.72% using leave-one-out cross-validation, compared with two sequence alignment-based prediction methods ALIGN (54.91%) and PSI-BLAST (53.23%). POPI is the first computational system for prediction of peptide immunogenicity based on physicochemical properties. © The Author 2007. Published by Oxford University Press. All rights reserved.",
                "authors": [
                    {
                        "name": "Tung C.-W."
                    },
                    {
                        "name": "Ho S.-Y."
                    }
                ],
                "citationCount": 71,
                "date": "2007-04-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "POPI: Predicting immunogenicity of MHC class I binding peptides by mining informative physicochemical properties"
            },
            "note": null,
            "pmcid": null,
            "pmid": null,
            "type": "Primary",
            "version": null
        }
    ],
    "relation": [],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Peptides",
            "uri": "http://edamontology.org/topic_0154"
        }
    ],
    "validated": 1,
    "version": [
        "2.1"
    ]
}