{"credit":[{"email":"chunhsi.huang@uconn.edu","name":"Chun-Hsi Huang","typeEntity":"Person","typeRoles":["Primary contact"]},{"email":"chihlee0214@gmail.com","typeEntity":"Person","typeRoles":["Primary contact"]}],"download":[{"type":"Source code","url":"http://biogrid-lasagna.engr.uconn.edu/lasagna_search/downloads/offline_scanning.tar.gz"}],"function":[{"operation":[{"term":"Protein binding site prediction","uri":"http://edamontology.org/operation_2575"}]},{"operation":[{"term":"Pathway or network comparison","uri":"http://edamontology.org/operation_0277"}]},{"operation":[{"term":"Gene regulatory network analysis","uri":"http://edamontology.org/operation_1781"}]}],"labels":{"operatingSystem":["Windows","Mac"],"toolType":["Script","Web application"],"topic":[{"term":"Transcription factors and regulatory sites","uri":"http://edamontology.org/topic_0749"},{"term":"Molecular interactions, pathways and networks","uri":"http://edamontology.org/topic_0602"},{"term":"ChIP-seq","uri":"http://edamontology.org/topic_3169"}]},"publication":[{"abstract":"The release of ChIP-seq data from the ENCyclopedia Of DNA Elements (ENCODE) and Model Organism ENCyclopedia Of DNA Elements (modENCODE) projects has significantly increased the amount of transcription factor (TF) binding affinity information available to researchers. However, scientists still routinely use TF binding site (TFBS) search tools to scan unannotated sequences for TFBSs, particularly when searching for lesser-known TFs or TFs in organisms for which ChIP-seq data are unavailable. The sequence analysis often involves multiple steps such as TF model collection, promoter sequence retrieval, and visualization; thus, several different tools are required. We have developed a novel integrated web tool named LASAGNA-Search that allows users to perform TFBS searches without leaving the web site. LASAGNA-Search uses the LASAGNA (Length-Aware Site Alignment Guided by Nucleotide Association) algorithm for TFBS alignment. Important features of LASAGNA-Search include (i) acceptance of unaligned variable-length TFBSs, (ii) a collection of 1726 TF models, (iii) automatic promoter sequence retrieval, (iv) visualization in the UCSC Genome Browser, and (v) gene regulatory network inference and visualization based on binding specificities. LASAGNA-Search is freely available at http://biogrid.engr.uconn.edu/lasa-gna_search/.","authors":["Lee C.","Huang C.-H."],"cit_count":46,"doi":"10.2144/000113999","journal":"BioTechniques","title":"LASAGNA-search: An integrated web tool for transcription factor binding site search and visualization","year":"2013-03-01"}],"summary":{"biotoolsCURIE":"biotools:lasagna-search","biotoolsID":"lasagna-search","description":"Length-Aware Site Alignment Guided by Nucleotide Association algorithm for Transcription Factor Binding Site alignment. Search include (i) acceptance of unaligned variable-length TFBSs, (ii) a collection of 1726 TF models, (iii) automatic promoter sequence retrieval, (iv) visualization in the UCSC Genome Browser, and (v) gene regulatory network inference and visualization based on binding specificities.","homepage":"http://biogrid-lasagna.engr.uconn.edu/lasagna_search/","name":"LASAGNA-Search"}}