{
    "additionDate": "2019-11-14T19:35:27Z",
    "biotoolsCURIE": "biotools:WBNPMD",
    "biotoolsID": "WBNPMD",
    "confidence_flag": "high",
    "credit": [
        {
            "email": "syp@gdut.edu.cn",
            "name": "Yuping Sun",
            "orcidid": "https://orcid.org/0000-0003-3010-329X",
            "typeEntity": "Person"
        }
    ],
    "description": "weighted bipartite network projection for microRNA-disease association prediction | BACKGROUND:Recently, numerous biological experiments have indicated that microRNAs (miRNAs) play critical roles in exploring the pathogenesis of various human diseases. Since traditional experimental methods for miRNA-disease associations detection are costly and time-consuming, it becomes urgent to design efficient and robust computational techniques for identifying undiscovered interactions. METHODS:In this paper, we proposed a computation framework named weighted bipartite network projection for miRNA-disease association prediction (WBNPMD). In this method, transfer weights were constructed by combining the known miRNA and disease similarities, and the initial information was properly configured. Then the two-step bipartite network algorithm was implemented to infer potential miRNA-disease associations",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "miRNA target prediction",
                    "uri": "http://edamontology.org/operation_0463"
                },
                {
                    "term": "miRNA expression analysis",
                    "uri": "http://edamontology.org/operation_3792"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Dicrop/WBNPMD",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2019-11-14T19:35:27Z",
    "name": "WBNPMD",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12967-019-2063-4",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Recently, numerous biological experiments have indicated that microRNAs (miRNAs) play critical roles in exploring the pathogenesis of various human diseases. Since traditional experimental methods for miRNA-disease associations detection are costly and time-consuming, it becomes urgent to design efficient and robust computational techniques for identifying undiscovered interactions. Methods: In this paper, we proposed a computation framework named weighted bipartite network projection for miRNA-disease association prediction (WBNPMD). In this method, transfer weights were constructed by combining the known miRNA and disease similarities, and the initial information was properly configured. Then the two-step bipartite network algorithm was implemented to infer potential miRNA-disease associations. Results: The proposed WBNPMD was applied to the known miRNA-disease association data, and leave-one-out cross-validation (LOOCV) and fivefold cross-validation were implemented to evaluate the performance of WBNPMD. As a result, our method achieved the AUCs of 0.9321 and $0.9173 \\pm 0.0005$ 0.9173 ± 0.0005 in LOOCV and fivefold cross-validation, and outperformed other four state-of-The-Art methods. We also carried out two kinds of case studies on prostate neoplasm, colorectal neoplasm, and lung neoplasm, and most of the top 50 predicted miRNAs were confirmed to have an association with the corresponding diseases based on dbDeMC, miR2Disease, and HMDD V3.0 databases. Conclusions: The experimental results demonstrate that WBNPMD can accurately infer potential miRNA-disease associations. We anticipated that the proposed WBNPMD could serve as a powerful tool for potential miRNA-disease associations excavation.",
                "authors": [
                    {
                        "name": "Xie G."
                    },
                    {
                        "name": "Fan Z."
                    },
                    {
                        "name": "Sun Y."
                    },
                    {
                        "name": "Wu C."
                    },
                    {
                        "name": "Ma L."
                    }
                ],
                "date": "2019-09-23T00:00:00Z",
                "journal": "Journal of Translational Medicine",
                "title": "WBNPMD: Weighted bipartite network projection for microRNA-disease association prediction"
            },
            "pmcid": "PMC6757419",
            "pmid": "31547811"
        }
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        }
    ]
}