{
    "additionDate": "2020-01-09T17:32:38Z",
    "biotoolsCURIE": "biotools:ChromaClade",
    "biotoolsID": "ChromaClade",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "c.monit.12@ucl.ac.uk",
            "name": "Christopher Monit",
            "orcidid": "https://orcid.org/0000-0002-1717-0431",
            "typeEntity": "Person"
        }
    ],
    "description": "A combined visualisation of phylogenetic and sequence data.\n\nCombined visualisation of phylogenetic and sequence data. Please see 'release' tab for executables and documentation below.\n\nChromaClade is a desktop bioinformatics application that produces visualisations combining sequence and phylogenetic data. It annotates taxon names in a phylogenetic tree with amino acids found at individual sites in a corresponding sequence alignment. Residue-specific colour codes enable easy inspection by eye and the resulting trees can be viewed in any of several popular tree-viewing programs",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Phylogenetic tree annotation",
                    "uri": "http://edamontology.org/operation_0558"
                },
                {
                    "term": "Phylogenetic tree visualisation",
                    "uri": "http://edamontology.org/operation_0567"
                },
                {
                    "term": "Sequence visualisation",
                    "uri": "http://edamontology.org/operation_0564"
                }
            ]
        }
    ],
    "homepage": "http://github.com/chrismonit/chroma_clade",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-12-11T20:30:30Z",
    "license": "Apache-2.0",
    "name": "ChromaClade",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12862-019-1518-9",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Studying site-specific amino acid frequencies by eye can reveal biologically significant variability and lineage-specific adaptation. This so-called 'sequence gazing' often informs bioinformatics and experimental research. But it is important to also account for the underlying phylogeny, since similarities may be due to common descent rather than selection pressure, and because it is important to distinguish between founder effects and convergent evolution. We set out to combine phylogenetic and sequence data to produce evolutionarily insightful visualisations. Results: We present ChromaClade, a convenient tool with a graphical user-interface that works in concert with popular tree viewers to produce colour-annotated phylogenies highlighting residues found in each taxon and at each site in a sequence alignment. Colouring branches according to residues found at descendent tips also quickly identifies lineage-specific residues and those internal branches where key substitutions have occurred. We demonstrate applications of ChromaClade to human immunodeficiency virus and influenza A virus datasets, illustrating cases of conservative, adaptive and convergent evolution. Conclusions: We find this to be a powerful approach for visualising site-wise residue distributions and detecting evolutionary patterns, especially in large datasets. ChromaClade is available for Windows, macOS and Unix or Linux; program executables and source code are available at github.com/chrismonit/chroma_clade.",
                "authors": [
                    {
                        "name": "Goldstein R.A."
                    },
                    {
                        "name": "Monit C."
                    },
                    {
                        "name": "Towers G.J."
                    }
                ],
                "citationCount": 1,
                "date": "2019-10-15T00:00:00Z",
                "journal": "BMC Evolutionary Biology",
                "title": "ChromaClade: Combined visualisation of phylogenetic and sequence data"
            },
            "pmcid": "PMC6792252",
            "pmid": "31615393"
        }
    ],
    "topic": [
        {
            "term": "Human biology",
            "uri": "http://edamontology.org/topic_2815"
        },
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ],
    "validated": 1
}
