{
    "additionDate": "2021-01-18T08:39:24Z",
    "biotoolsCURIE": "biotools:terokit",
    "biotoolsID": "terokit",
    "confidence_flag": "tool",
    "description": "A Database-Driven Web Server for Terpenome Research.\n\n\nTerpenome defines as all terpenoid-like and terpenoid-derived compounds, including the terpenoids, steroids and their derivatives. Terpenoids represent the most chemically and structurally diverse family of natural products. There is a growing concern about terpenome by the Pharmaceutical Chemist because of their huge medicinal value, with artemisinin and paclitaxel for representative. By utilizing the tenet of enzyme catalysis in all living organisms, all the natural terpenome are derived from the two essential C5 isoprene units, IPP and DAMPP (see left figures). TeroKit is a webserver-based multi-scale kit conducive to the research of terpenome. It contains a database with annotated data of more than 120,000 terpenome compounds. TeroKit provides the online retrieval and analysis of chemical space, target identification and biosynthetic pathway (under construction) for terpenome.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Scaffolding",
                    "uri": "http://edamontology.org/operation_3216"
                },
                {
                    "term": "Natural product identification",
                    "uri": "http://edamontology.org/operation_3803"
                },
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                }
            ]
        }
    ],
    "homepage": "http://terokit.qmclab.com/",
    "lastUpdate": "2021-02-27T08:53:33Z",
    "name": "TeroKit",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1021/ACS.JCIM.0C00141",
            "metadata": {
                "abstract": "Copyright © 2020 American Chemical Society.Natural products are the major resource of drug discovery, and terpenoids represent the largest family of natural products. Terpenome is defined as all terpenoid-like and terpenoid-derived natural compounds, including the terpenoids, steroids, and their derivatives. Herein, aiming to navigate the chemical and biological space of terpenome, the first comprehensive database dedicated to terpenome research has been developed by collecting over 110 »000 terpenome molecules from various resources, distributed in 14 »351 species, belonging to 1109 families, and showing activity against 1366 biological targets. Much of the publically available information or computationally predicted properties for each terpenome molecule is annotated and integrated into TeroKit (http://terokit.qmclab.com/), serving as free Web server for academic use. Moreover, several practical toolkits, such as target profiling and conformer generation modules, are also implemented to facilitate the drug discovery of terpenome.",
                "authors": [
                    {
                        "name": "Zeng T."
                    },
                    {
                        "name": "Liu Z."
                    },
                    {
                        "name": "Zhuang J."
                    },
                    {
                        "name": "Jiang Y."
                    },
                    {
                        "name": "He W."
                    },
                    {
                        "name": "Diao H."
                    },
                    {
                        "name": "Lv N."
                    },
                    {
                        "name": "Jian Y."
                    },
                    {
                        "name": "Liang D."
                    },
                    {
                        "name": "Qiu Y."
                    },
                    {
                        "name": "Zhang R."
                    },
                    {
                        "name": "Zhang F."
                    },
                    {
                        "name": "Tang X."
                    },
                    {
                        "name": "Wu R."
                    }
                ],
                "citationCount": 7,
                "date": "2020-04-27T00:00:00Z",
                "journal": "Journal of Chemical Information and Modeling",
                "title": "Tero Kit: A Database-Driven Web Server for Terpenome Research"
            },
            "pmid": "32286817"
        }
    ],
    "topic": [
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Drug discovery",
            "uri": "http://edamontology.org/topic_3336"
        },
        {
            "term": "Medicine",
            "uri": "http://edamontology.org/topic_3303"
        },
        {
            "term": "Enzymes",
            "uri": "http://edamontology.org/topic_0821"
        },
        {
            "term": "Molecular biology",
            "uri": "http://edamontology.org/topic_3047"
        }
    ]
}