{
    "additionDate": "2021-01-18T09:58:13Z",
    "biotoolsCURIE": "biotools:galgo",
    "biotoolsID": "galgo",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "martin.guerrero@fcm.uncu.edu.ar",
            "name": "M E Guerrero-Gimenez",
            "typeEntity": "Person"
        }
    ],
    "description": "A bi-objective evolutionary meta-heuristic identifies robust transcriptomic classifiers associated with patient outcome across multiple cancer types.\n\nGalgo: An evolutionary machine learning algorithm for the identification and study of prognostic gene expression signatures in cancer.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Expression profile clustering",
                    "uri": "http://edamontology.org/operation_0313"
                },
                {
                    "term": "Gene-set enrichment analysis",
                    "uri": "http://edamontology.org/operation_2436"
                },
                {
                    "term": "Sorting",
                    "uri": "http://edamontology.org/operation_3802"
                }
            ]
        }
    ],
    "homepage": "http://www.github.com/harpomaxx/galgo",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-01-22T17:34:32Z",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "https://harpomaxx.github.io/galgo/"
        },
        {
            "type": [
                "Repository"
            ],
            "url": "http://www.github.com/martinguerrero89/galgo"
        },
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/harpomaxx/GSgalgoR/"
        }
    ],
    "name": "Galgo",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAA619",
            "metadata": {
                "abstract": "© 2020 The Author(s).Motivation: Statistical and machine-learning analyses of tumor transcriptomic profiles offer a powerful resource to gain deeper understanding of tumor subtypes and disease prognosis. Currently, prognostic gene-expression signatures do not exist for all cancer types, and most developed to date have been optimized for individual tumor types. In Galgo, we implement a bi-objective optimization approach that prioritizes gene signature cohesiveness and patient survival in parallel, which provides greater power to identify tumor transcriptomic phenotypes strongly associated with patient survival. Results: To compare the predictive power of the signatures obtained by Galgo with previously studied subtyping methods, we used a meta-analytic approach testing a total of 35 large population-based transcriptomic biobanks of four different cancer types. Galgo-generated colorectal and lung adenocarcinoma signatures were stronger predictors of patient survival compared to published molecular classification schemes. One Galgo-generated breast cancer signature outperformed PAM50, AIMS, SCMGENE and IntClust subtyping predictors. In high-grade serous ovarian cancer, Galgo signatures obtained similar predictive power to a consensus classification method. In all cases, Galgo subtypes reflected enrichment of gene sets related to the hallmarks of the disease, which highlights the biological relevance of the partitions found.",
                "authors": [
                    {
                        "name": "Catania C.A."
                    },
                    {
                        "name": "Ciocca D.R."
                    },
                    {
                        "name": "Fernandez-Munoz J.M."
                    },
                    {
                        "name": "Guerrero-Gimenez M.E."
                    },
                    {
                        "name": "Holton K.M."
                    },
                    {
                        "name": "Lang B.J."
                    },
                    {
                        "name": "Zoppino F.C.M."
                    }
                ],
                "date": "2020-10-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Galgo: A bi-objective evolutionary meta-heuristic identifies robust transcriptomic classifiers associated with patient outcome across multiple cancer types"
            },
            "pmid": "32638009"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Biobank",
            "uri": "http://edamontology.org/topic_3337"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ],
    "validated": 1
}
