{
    "additionDate": "2021-03-19T08:41:25Z",
    "biotoolsCURIE": "biotools:g-tric",
    "biotoolsID": "g-tric",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "sacmadeira@ciencias.ulisboa.pt",
            "name": "Sara C. Madeira",
            "typeEntity": "Person"
        }
    ],
    "description": "Generating three-way synthetic datasets with triclustering solutions.\n\nThree-dimensional dataset generator with triclustering solutions.\n\nRunnable JAR to run the G-Tric's GUI version.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "Validation",
                    "uri": "http://edamontology.org/operation_2428"
                },
                {
                    "term": "Heat map generation",
                    "uri": "http://edamontology.org/operation_0531"
                }
            ]
        }
    ],
    "homepage": "https://github.com/jplobo1313/G-Tric",
    "language": [
        "Java"
    ],
    "lastUpdate": "2021-03-22T12:16:40Z",
    "name": "G-Tric",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1186/S12859-020-03925-4",
            "metadata": {
                "abstract": "© 2020, The Author(s).Background: Three-way data started to gain popularity due to their increasing capacity to describe inherently multivariate and temporal events, such as biological responses, social interactions along time, urban dynamics, or complex geophysical phenomena. Triclustering, subspace clustering of three-way data, enables the discovery of patterns corresponding to data subspaces (triclusters) with values correlated across the three dimensions (observations × features × contexts). With increasing number of algorithms being proposed, effectively comparing them with state-of-the-art algorithms is paramount. These comparisons are usually performed using real data, without a known ground-truth, thus limiting the assessments. In this context, we propose a synthetic data generator, G-Tric, allowing the creation of synthetic datasets with configurable properties and the possibility to plant triclusters. The generator is prepared to create datasets resembling real 3-way data from biomedical and social data domains, with the additional advantage of further providing the ground truth (triclustering solution) as output. Results: G-Tric can replicate real-world datasets and create new ones that match researchers needs across several properties, including data type (numeric or symbolic), dimensions, and background distribution. Users can tune the patterns and structure that characterize the planted triclusters (subspaces) and how they interact (overlapping). Data quality can also be controlled, by defining the amount of missing, noise or errors. Furthermore, a benchmark of datasets resembling real data is made available, together with the corresponding triclustering solutions (planted triclusters) and generating parameters. Conclusions: Triclustering evaluation using G-Tric provides the possibility to combine both intrinsic and extrinsic metrics to compare solutions that produce more reliable analyses. A set of predefined datasets, mimicking widely used three-way data and exploring crucial properties was generated and made available, highlighting G-Tric’s potential to advance triclustering state-of-the-art by easing the process of evaluating the quality of new triclustering approaches.",
                "authors": [
                    {
                        "name": "Lobo J."
                    },
                    {
                        "name": "Henriques R."
                    },
                    {
                        "name": "Madeira S.C."
                    }
                ],
                "date": "2021-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "G-Tric: generating three-way synthetic datasets with triclustering solutions"
            },
            "pmcid": "PMC7789692",
            "pmid": "33413095"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        }
    ]
}