{
    "additionDate": "2019-11-14T18:06:16Z",
    "biotoolsCURIE": "biotools:ACTINN",
    "biotoolsID": "ACTINN",
    "confidence_flag": "tool",
    "description": "Automated Identification of Cell Types in Single Cell RNA Sequencing | Automated Cell Type Identification using Neural Networks | ACTINN (Automated Cell Type Identification using Neural Networks) is a bioinformatic tool to quickly and accurately identify cell types in scRNA-Seq. For details, please read the paper: https://academic.oup.com/bioinformatics/advance-article/doi/10.1093/bioinformatics/btz592/5540320 All datasets used in the paper are available here: https://figshare.com/articles/ACTINN/8967116",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                }
            ]
        }
    ],
    "homepage": "https://github.com/mafeiyang/ACTINN",
    "language": [
        "R",
        "Python"
    ],
    "lastUpdate": "2020-12-01T14:29:31.627634Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/mafeiyang/ACTINN"
        }
    ],
    "name": "ACTINN",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ592",
            "metadata": {
                "abstract": "© 2019 The Author(s) . Published by Oxford University Press. All rights reserved.Cell type identification is one of the major goals in single cell RNA sequencing (scRNA-seq). Current methods for assigning cell types typically involve the use of unsupervised clustering, the identification of signature genes in each cluster, followed by a manual lookup of these genes in the literature and databases to assign cell types. However, there are several limitations associated with these approaches, such as unwanted sources of variation that influence clustering and a lack of canonical markers for certain cell types. Here, we present ACTINN (Automated Cell Type Identification using Neural Networks), which employs a neural network with three hidden layers, trains on datasets with predefined cell types and predicts cell types for other datasets based on the trained parameters. Results: We trained the neural network on a mouse cell type atlas (Tabula Muris Atlas) and a human immune cell dataset, and used it to predict cell types for mouse leukocytes, human PBMCs and human T cell sub types. The results showed that our neural network is fast and accurate, and should therefore be a useful tool to complement existing scRNA-seq pipelines.",
                "authors": [
                    {
                        "name": "Ma F."
                    },
                    {
                        "name": "Pellegrini M."
                    }
                ],
                "citationCount": 6,
                "date": "2020-01-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "ACTINN: Automated identification of cell types in single cell RNA sequencing"
            },
            "pmid": "31359028"
        }
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ]
}