{
    "additionDate": "2023-04-20T14:34:23.576277Z",
    "biotoolsCURIE": "biotools:gothresher",
    "biotoolsID": "gothresher",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "idoerg@iastate.edu",
            "name": "Iddo Friedberg",
            "typeEntity": "Person"
        }
    ],
    "description": "A program to remove annotation biases from protein function annotation datasets.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Filtering",
                    "uri": "http://edamontology.org/operation_3695"
                },
                {
                    "term": "Gene functional annotation",
                    "uri": "http://edamontology.org/operation_3672"
                },
                {
                    "term": "Protein function prediction",
                    "uri": "http://edamontology.org/operation_1777"
                }
            ]
        }
    ],
    "homepage": "https://anaconda.org/bioconda/gothresher",
    "language": [
        "Python"
    ],
    "lastUpdate": "2023-04-20T14:34:23.578871Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/FriedbergLab/GOThresher"
        },
        {
            "type": [
                "Repository"
            ],
            "url": "https://pypi.org/project/gothresher/"
        }
    ],
    "name": "GOThresher",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btad048",
            "metadata": {
                "abstract": "MOTIVATION: Advances in sequencing technologies have led to a surge in genomic data, although the functions of many gene products coded by these genes remain unknown. While in-depth, targeted experiments that determine the functions of these gene products are crucial and routinely performed, they fail to keep up with the inflow of novel genomic data. In an attempt to address this gap, high-throughput experiments are being conducted in which a large number of genes are investigated in a single study. The annotations generated as a result of these experiments are generally biased towards a small subset of less informative Gene Ontology (GO) terms. Identifying and removing biases from protein function annotation databases is important since biases impact our understanding of protein function by providing a poor picture of the annotation landscape. Additionally, as machine learning methods for predicting protein function are becoming increasingly prevalent, it is essential that they are trained on unbiased datasets. Therefore, it is not only crucial to be aware of biases, but also to judiciously remove them from annotation datasets. RESULTS: We introduce GOThresher, a Python tool that identifies and removes biases in function annotations from protein function annotation databases. AVAILABILITY AND IMPLEMENTATION: GOThresher is written in Python and released via PyPI https://pypi.org/project/gothresher/ and on the Bioconda Anaconda channel https://anaconda.org/bioconda/gothresher. The source code is hosted on GitHub https://github.com/FriedbergLab/GOThresher and distributed under the GPL 3.0 license. SUPPLEMENTARY INFORMATION: Supplementary data are available at Bioinformatics online.",
                "authors": [
                    {
                        "name": "Banerjee S."
                    },
                    {
                        "name": "Friedberg I."
                    },
                    {
                        "name": "Hu X."
                    },
                    {
                        "name": "Joshi P."
                    },
                    {
                        "name": "Khade P.M."
                    }
                ],
                "date": "2023-01-01T00:00:00Z",
                "journal": "Bioinformatics (Oxford, England)",
                "title": "GOThresher: a program to remove annotation biases from protein function annotation datasets"
            },
            "pmid": "36688705"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Ontology and terminology",
            "uri": "http://edamontology.org/topic_0089"
        },
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        }
    ]
}
