{
    "accessibility": "Open access",
    "additionDate": "2023-02-15T12:25:18.401388Z",
    "biotoolsCURIE": "biotools:phenotrack3d",
    "biotoolsID": "phenotrack3d",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "christian.fournier@inrae.fr",
            "name": "Christian Fournier",
            "typeEntity": "Person"
        },
        {
            "email": "christophe.pradal@cirad.fr",
            "name": "Christophe Pradal",
            "typeEntity": "Person"
        },
        {
            "name": "Benoit Daviet"
        },
        {
            "name": "Romain Fernandez"
        }
    ],
    "description": "An automatic high-throughput phenotyping pipeline to track maize organs over time.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Sequence alignment",
                    "uri": "http://edamontology.org/operation_0292"
                }
            ]
        }
    ],
    "homepage": "https://github.com/openalea/phenotrack3d",
    "language": [
        "Python"
    ],
    "lastUpdate": "2023-02-15T12:25:18.403958Z",
    "license": "Other",
    "name": "PhenoTrack3D",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1186/S13007-022-00961-4",
            "metadata": {
                "abstract": "© 2022, The Author(s).Background: High-throughput phenotyping platforms allow the study of the form and function of a large number of genotypes subjected to different growing conditions (GxE). A number of image acquisition and processing pipelines have been developed to automate this process, for micro-plots in the field and for individual plants in controlled conditions. Capturing shoot development requires extracting from images both the evolution of the 3D plant architecture as a whole, and a temporal tracking of the growth of its organs. Results: We propose PhenoTrack3D, a new pipeline to extract a 3D + t reconstruction of maize. It allows the study of plant architecture and individual organ development over time during the entire growth cycle. The method tracks the development of each organ from a time-series of plants whose organs have already been segmented in 3D using existing methods, such as Phenomenal [Artzet et al. in BioRxiv 1:805739, 2019] which was chosen in this study. First, a novel stem detection method based on deep-learning is used to locate precisely the point of separation between ligulated and growing leaves. Second, a new and original multiple sequence alignment algorithm has been developed to perform the temporal tracking of ligulated leaves, which have a consistent geometry over time and an unambiguous topological position. Finally, growing leaves are back-tracked with a distance-based approach. This pipeline is validated on a challenging dataset of 60 maize hybrids imaged daily from emergence to maturity in the PhenoArch platform (ca. 250,000 images). Stem tip was precisely detected over time (RMSE < 2.1 cm). 97.7% and 85.3% of ligulated and growing leaves respectively were assigned to the correct rank after tracking, on 30 plants × 43 dates. The pipeline allowed to extract various development and architecture traits at organ level, with good correlation to manual observations overall, on random subsets of 10–355 plants. Conclusions: We developed a novel phenotyping method based on sequence alignment and deep-learning. It allows to characterise the development of maize architecture at organ level, automatically and at a high-throughput. It has been validated on hundreds of plants during the entire development cycle, showing its applicability on GxE analyses of large maize datasets.",
                "authors": [
                    {
                        "name": "Cabrera-Bosquet L."
                    },
                    {
                        "name": "Daviet B."
                    },
                    {
                        "name": "Fernandez R."
                    },
                    {
                        "name": "Fournier C."
                    },
                    {
                        "name": "Pradal C."
                    }
                ],
                "date": "2022-12-01T00:00:00Z",
                "journal": "Plant Methods",
                "title": "PhenoTrack3D: an automatic high-throughput phenotyping pipeline to track maize organs over time"
            },
            "pmcid": "PMC9730636",
            "pmid": "36482291"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Agricultural science",
            "uri": "http://edamontology.org/topic_3810"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ]
}
