
{
    "credit": [
        {
            "name": "binf.ku.dk",
            "typeEntity": "Institute",
            "typeRoles": [
                "Provider"
            ]
        },
        {
            "email": "thamelry@binf.ku.dk",
            "name": "Thomas Hamelryck",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://sourceforge.net/projects/barnacle-rna/files/Documentation/Barnacle-0.2.pdf/download"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "RNA structure prediction",
                    "uri": "http://edamontology.org/operation_2441"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Python"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Library"
        ],
        "topic": [
            {
                "term": "Nucleic acid structure analysis",
                "uri": "http://edamontology.org/topic_0097"
            }
        ]
    },
    "publication": [
        {
            "abstract": "The increasing importance of non-coding RNA in biology and medicine has led to a growing interest in the problem of RNA 3-D structure prediction. As is the case for proteins, RNA 3-D structure prediction methods require two key ingredients: an accurate energy function and a conformational sampling procedure. Both are only partly solved problems. Here, we focus on the problem of conformational sampling. The current state of the art solution is based on fragment assembly methods, which construct plausible conformations by stringing together short fragments obtained from experimental structures. However, the discrete nature of the fragments necessitates the use of carefully tuned, unphysical energy functions, and their non-probabilistic nature impairs unbiased sampling. We offer a solution to the sampling problem that removes these important limitations: a probabilistic model of RNA structure that allows efficient sampling of RNA conformations in continuous space, and with associated probabilities. We show that the model captures several key features of RNA structure, such as its rotameric nature and the distribution of the helix lengths. Furthermore, the model readily generates native-like 3-D conformations for 9 out of 10 test structures, solely using coarse-grained base-pairing information. In conclusion, the method provides a theoretical and practical solution for a major bottleneck on the way to routine prediction and simulation of RNA structure and dynamics in atomic detail. © 2009 Frellsen et al.",
            "authors": [
                "Frellsen J.",
                "Moltke I.",
                "Thiim M.",
                "Mardia K.V.",
                "Ferkinghoff-Borg J.",
                "Hamelryck T."
            ],
            "cit_count": 59,
            "doi": "10.1371/journal.pcbi.1000406",
            "journal": "PLoS Computational Biology",
            "title": "A probabilistic model of RNA conformational space",
            "type": "Primary",
            "year": "2009-06-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:barnacle",
        "biotoolsID": "barnacle",
        "description": "Python library for RNA 3D structure prediction. It can be used for probabilistic sampling of RNA structures that are compatible with a given nucleotide sequence and that are RNA like on a local length scale.",
        "homepage": "http://sourceforge.net/projects/barnacle-rna/",
        "name": "BARNACLE",
        "version": [
            "0.21"
        ]
    }
}