{
    "additionDate": "2023-01-28T10:38:36.212207Z",
    "biotoolsCURIE": "biotools:diamin",
    "biotoolsID": "diamin",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "simona.rombo@unipa.it",
            "name": "Simona E. Rombo",
            "orcidid": "https://orcid.org/0000-0003-3833-835X",
            "typeEntity": "Person"
        },
        {
            "email": "umberto.ferraro@uniroma1.it",
            "name": "Umberto Ferraro Petrillo",
            "typeEntity": "Person"
        }
    ],
    "description": "DIAMIN is a high-level software library to facilitate the development of distributed applications for the efficient analysis of large-scale molecular interaction networks.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                },
                {
                    "term": "Protein-protein interaction analysis",
                    "uri": "http://edamontology.org/operation_2949"
                }
            ]
        }
    ],
    "homepage": "https://github.com/ldirocco/DIAMIN",
    "language": [
        "Java",
        "Scala"
    ],
    "lastUpdate": "2023-01-28T10:38:36.215212Z",
    "license": "GPL-3.0",
    "name": "DIAMIN",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1186/S12859-022-05026-W",
            "metadata": {
                "abstract": "© 2022, The Author(s).Background: Huge amounts of molecular interaction data are continuously produced and stored in public databases. Although many bioinformatics tools have been proposed in the literature for their analysis, based on their modeling through different types of biological networks, several problems still remain unsolved when the problem turns on a large scale. Results: We propose DIAMIN, that is, a high-level software library to facilitate the development of applications for the efficient analysis of large-scale molecular interaction networks. DIAMIN relies on distributed computing, and it is implemented in Java upon the framework Apache Spark. It delivers a set of functionalities implementing different tasks on an abstract representation of very large graphs, providing a built-in support for methods and algorithms commonly used to analyze these networks. DIAMIN has been tested on data retrieved from two of the most used molecular interactions databases, resulting to be highly efficient and scalable. As shown by different provided examples, DIAMIN can be exploited by users without any distributed programming experience, in order to perform various types of data analysis, and to implement new algorithms based on its primitives. Conclusions: The proposed DIAMIN has been proved to be successful in allowing users to solve specific biological problems that can be modeled relying on biological networks, by using its functionalities. The software is freely available and this will hopefully allow its rapid diffusion through the scientific community, to solve both specific data analysis and more complex tasks.",
                "authors": [
                    {
                        "name": "Di Rocco L."
                    },
                    {
                        "name": "Ferraro Petrillo U."
                    },
                    {
                        "name": "Rombo S.E."
                    }
                ],
                "date": "2022-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "DIAMIN: a software library for the distributed analysis of large-scale molecular interaction networks"
            },
            "pmcid": "PMC9652854",
            "pmid": "36368948"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Biological databases",
            "uri": "http://edamontology.org/topic_3071"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Literature and language",
            "uri": "http://edamontology.org/topic_3068"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ]
}
