
{
    "credit": [
        {
            "email": "jonathan.lees@ucl.ac.uk",
            "name": "Jonathan Lees",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://gene3d.biochem.ucl.ac.uk/about"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence annotation",
                    "uri": "http://edamontology.org/operation_0361"
                },
                {
                    "term": "Gene functional annotation",
                    "uri": "http://edamontology.org/operation_3672"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Protein folds and structural domains",
                "uri": "http://edamontology.org/topic_0736"
            },
            {
                "term": "Proteins",
                "uri": "http://edamontology.org/topic_0078"
            },
            {
                "term": "Protein structure analysis",
                "uri": "http://edamontology.org/topic_2814"
            },
            {
                "term": "Sequence analysis",
                "uri": "http://edamontology.org/topic_0080"
            }
        ]
    },
    "publication": [
        {
            "abstract": "The Gene3D structural domain database provides domain annotations for 7 million proteins, based on the manually curated structural domain superfamilies in CATH. These annotations are integrated with functional, genomic and molecular information from external resources, such as GO, EC, UniProt and the NCBI Taxonomy database. We have constructed a set of web services that provide programmatic access to this integrated database, as well as the Gene3D domain recognition tool (Gene3DScan) and protein sequence annotation pipeline for analysing novel protein sequences. Example queries include retrieving all curated GO terms for a domain superfamily or all the multi-domain architectures for the human genome. The services can be accessed using simple HTTP calls and are able to return results in a range of formats for quick downloading and easy parsing, graphical rendering and data storage. Hence, they provide a simple, but flexible means of integrating domain annotations and associated data sets into locally run pipelines and analysis software. The services can be found at http://gene3d.biochem.ucl.ac.uk/WebServices/. © 2011 The Author(s).",
            "authors": [
                "Yeats C.",
                "Lees J.",
                "Carter P.",
                "Sillitoe I.",
                "Orengo C."
            ],
            "cit_count": 11,
            "journal": "Nucleic Acids Research",
            "pmid": "21646335",
            "title": "The Gene3D Web Services: A platform for identifying, annotating and comparing structural domains in protein sequences",
            "year": "2011-07-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:gene3d",
        "biotoolsID": "gene3d",
        "description": "The Gene3D web services provide programmatic access to the CATH-Gene3D annotation resources and in-house software tools. These services include Gene3DScan for identifying structural domains within protein sequences, access to pre-calculated annotations for the major sequence databases, and linked functional annotation from UniProt, GO and KEGG.",
        "homepage": "http://gene3d.biochem.ucl.ac.uk/Gene3D/",
        "name": "Gene3D"
    }
}