{
    "additionDate": "2017-03-25T16:29:49Z",
    "biotoolsCURIE": "biotools:psipred",
    "biotoolsID": "psipred",
    "credit": [
        {
            "email": "psipred@cs.ucl.ac.uk",
            "name": "psipred team",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "The PSIPRED Protein Analysis Workbench unites many available analysis tools into a single web based framework. An excellent tool for prediction of secondary structure, with access to GenTHREADER for protein fold recognition and MEMSAT-2 transmembrane topology prediction.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://bioinf.cs.ucl.ac.uk/index.php?id=779"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein secondary structure prediction (turns)",
                    "uri": "http://edamontology.org/operation_0469"
                },
                {
                    "term": "Protein fold recognition",
                    "uri": "http://edamontology.org/operation_0303"
                },
                {
                    "term": "Protein secondary structure prediction",
                    "uri": "http://edamontology.org/operation_0267"
                }
            ]
        }
    ],
    "homepage": "http://bioinf.cs.ucl.ac.uk/psipred/",
    "lastUpdate": "2018-12-10T12:58:57Z",
    "name": "PSIPRED",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "The PSIPRED protein structure prediction server allows users to submit a protein sequence, perform a prediction of their choice and receive the results of the prediction both textually via e-mail and graphically via the web. The user may select one of three prediction methods to apply to their sequence: PSIPRED, a highly accurate secondary structure prediction method; MEMSAT 2, a new version of a widely used transmembrane topology prediction method; or GenTHREADER, a sequence profile based fold recognition method. Availability: Freely available to non-commercial users at http://globin.bio.warwick.ac.uk/psipred/.",
                "authors": [
                    {
                        "name": "McGuffin L.J."
                    },
                    {
                        "name": "Bryson K."
                    },
                    {
                        "name": "Jones D.T."
                    }
                ],
                "citationCount": 2411,
                "date": "2000-01-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "The PSIPRED protein structure prediction server"
            },
            "pmid": "10869041"
        },
        {
            "metadata": {
                "abstract": "A two-stage neural network has been used to predict protein secondary structure based on the position specific scoring matrices generated by PSI-BLAST. Despite the simplicity and convenience of the approach used, the results are found to be superior to those produced by other methods, including the popular PHD method according to our own benchmarking results and the results from the recent Critical Assessment of Techniques for Protein Structure Prediction experiment (CASP3), where the method was evaluated by stringent blind testing. Using a new testing set based on a set of 187 unique folds, and three-way cross-validation based on structural similarity criteria rather than sequence similarity criteria used previously (no similar folds were present in both the testing and training sets) the method presented here (PSIPRED) achieved an average Q3 score of between 76.5% to 78.3% depending on the precise definition of observed secondary structure used, which is the highest published score for any method to date. Given the success of the method in CASP3, it is reasonable to be confident that the evaluation presented here gives a fair indication of the performance of the method in general.",
                "authors": [
                    {
                        "name": "Jones D.T."
                    }
                ],
                "citationCount": 4004,
                "date": "1999-09-17T00:00:00Z",
                "journal": "Journal of Molecular Biology",
                "title": "Protein secondary structure prediction based on position-specific scoring matrices"
            },
            "pmid": "10493868"
        },
        {
            "metadata": {
                "abstract": "Here, we present the new UCL Bioinformatics Group's PSIPRED Protein Analysis Workbench. The Workbench unites all of our previously available analysis methods into a single web-based framework. The new web portal provides a greatly streamlined user interface with a number of new features to allow users to better explore their results. We offer a number of additional services to enable computationally scalable execution of our prediction methods; these include SOAP and XML-RPC web server access and new HADOOP packages. All software and services are available via the UCL Bioinformatics Group website at http://bioinf.cs.ucl.ac.uk/.",
                "authors": [
                    {
                        "name": "Buchan D.W."
                    },
                    {
                        "name": "Minneci F."
                    },
                    {
                        "name": "Nugent T.C."
                    },
                    {
                        "name": "Bryson K."
                    },
                    {
                        "name": "Jones D.T."
                    }
                ],
                "citationCount": 904,
                "date": "2013-01-01T00:00:00Z",
                "journal": "Nucleic acids research",
                "title": "Scalable web services for the PSIPRED Protein Analysis Workbench."
            },
            "pmid": "23748958"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Structure prediction",
            "uri": "http://edamontology.org/topic_0082"
        },
        {
            "term": "Protein folds and structural domains",
            "uri": "http://edamontology.org/topic_0736"
        },
        {
            "term": "Protein secondary structure",
            "uri": "http://edamontology.org/topic_3542"
        },
        {
            "term": "Protein folding, stability and design",
            "uri": "http://edamontology.org/topic_0130"
        },
        {
            "term": "Protein structure analysis",
            "uri": "http://edamontology.org/topic_2814"
        }
    ],
    "validated": 1
}