
{
    "credit": [
        {
            "email": "i.m.carr@leeds.ac.uk",
            "name": "Ian Carr",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "User manual",
            "url": "http://dna.leeds.ac.uk/illuminator/guide/"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "DNA mapping",
                    "uri": "http://edamontology.org/operation_2520"
                },
                {
                    "term": "Sequence alignment",
                    "uri": "http://edamontology.org/operation_0292"
                }
            ]
        }
    ],
    "labels": {
        "maturity": "Mature",
        "toolType": [
            "Desktop application"
        ],
        "topic": [
            {
                "term": "Mapping",
                "uri": "http://edamontology.org/topic_0102"
            }
        ]
    },
    "publication": [
        {
            "abstract": "Current methods for sequencing clonal populations of DNA molecules yield several gigabases of data per day, typically comprising reads of <. 100 nt. Such datasets permit widespread genome resequencing and transcriptome analysis or other quantitative tasks. However, this huge capacity can also be harnessed for the resequencing of smaller (gene-sized) target regions, through the simultaneous parallel analysis of multiple subjects, using sample \"tagging\" or \"indexing\". These methods promise to have a huge impact on diagnostic mutation analysis and candidate gene testing. Here we describe a software package developed for such studies, offering the ability to resolve pooled samples carrying barcode tags and to align reads to a reference sequence using a mutation-tolerant process. The program, Illuminator, can identify rare sequence variants, including insertions and deletions, and permits interactive data analysis on standard desktop computers. It facilitates the effective analysis of targeted clonal sequencer data without dedicated computational infrastructure or specialized training. © 2011 Elsevier Inc.",
            "authors": [
                "Carr I.M.",
                "Morgan J.E.",
                "Diggle C.P.",
                "Sheridan E.",
                "Markham A.F.",
                "Logan C.V.",
                "Inglehearn C.F.",
                "Taylor G.R.",
                "Bonthron D.T."
            ],
            "cit_count": 4,
            "journal": "Genomics",
            "pmid": "21621601",
            "title": "Illuminator, a desktop program for mutation detection using short-read clonal sequencing",
            "year": "2011-10-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:illuminator",
        "biotoolsID": "illuminator",
        "description": "Software for machines running Windows to identify variants in Illumina short read data.",
        "homepage": "http://dna.leeds.ac.uk/illuminator/.",
        "name": "Illuminator"
    }
}