{
    "additionDate": "2017-01-13T13:14:00Z",
    "biotoolsCURIE": "biotools:chipmeta",
    "biotoolsID": "chipmeta",
    "credit": [
        {
            "email": "qin@umich.edu",
            "name": "Zhaohui S. Qin",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "ghoshd@psu.edu",
            "name": "Debashis Ghosh",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Combining data from ChIP-seq and ChIP-chip.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://sourceforge.net/projects/chipmeta/files/?source=navbar"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Peak calling",
                    "uri": "http://edamontology.org/operation_3222"
                }
            ]
        }
    ],
    "homepage": "https://sourceforge.net/projects/chipmeta/",
    "language": [
        "C"
    ],
    "lastUpdate": "2018-12-10T12:58:52Z",
    "name": "ChIPmeta",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "seqwiki_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Motivation: Chromatin immunoprecipitation (ChIP) experiments followed by array hybridization, or ChIP-chip, is a powerful approach for identifying transcription factor binding sites (TFBS) and has been widely used. Recently, massively parallel sequencing coupled with ChIP experiments (ChIP-seq) has been increasingly used as an alternative to ChIP-chip, offering cost-effective genome-wide coverage and resolution up to a single base pair. For many well-studied TFs, both ChIP-seq and ChIP-chip experiments have been applied and their data are publicly available. Previous analyses have revealed substantial technology-specific binding signals despite strong correlation between the two sets of results. Therefore, it is of interest to see whether the two data sources can be combined to enhance the detection of TFBS. Results: In this work, hierarchical hidden Markov model (HHMM) is proposed for combining data from ChIP-seq and ChIP-chip. In HHMM, inference results from individual HMMs in ChIP-seq and ChIP-chip experiments are summarized by a higher level HMM. Simulation studies show the advantage of HHMM when data from both technologies co-exist. Analysis of two well-studied TFs, NRSF and CCCTC-binding factor (CTCF), also suggests that HHMM yields improved TFBS identification in comparison to analyses using individual data sources or a simple merger of the two. © The Author 2009. Published by Oxford University Press. All rights reserved.",
                "authors": [
                    {
                        "name": "Choi H."
                    },
                    {
                        "name": "Nesvizhskii A.I."
                    },
                    {
                        "name": "Ghosh D."
                    },
                    {
                        "name": "Qin Z.S."
                    }
                ],
                "citationCount": 23,
                "date": "2009-07-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Hierarchical hidden Markov model with application to joint analysis of ChIP-chip and ChIP-seq data"
            },
            "pmid": "19447789"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "ChIP-seq",
            "uri": "http://edamontology.org/topic_3169"
        },
        {
            "term": "ChIP-on-chip",
            "uri": "http://edamontology.org/topic_3179"
        }
    ],
    "validated": 1
}