{
    "additionDate": "2021-01-18T10:05:36Z",
    "biotoolsCURIE": "biotools:cglmm",
    "biotoolsID": "cglmm",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "hatang@indiana.edu",
            "name": "Haixu Tang",
            "typeEntity": "Person"
        }
    ],
    "description": "cGLMM is a R method for privacy-preserving construction of generalized linear mixed model for biomedical computation.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Imputation",
                    "uri": "http://edamontology.org/operation_3557"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                },
                {
                    "term": "Sequence assembly",
                    "uri": "http://edamontology.org/operation_0310"
                }
            ]
        }
    ],
    "homepage": "https://github.com/huthvincent/cGLMM",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-03-11T13:52:44Z",
    "name": "cGLMM",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAA478",
            "metadata": {
                "abstract": "VC The Author(s) 2020. Published by Oxford University Press.Motivation: The generalized linear mixed model (GLMM) is an extension of the generalized linear model (GLM) in which the linear predictor takes random effects into account. Given its power of precisely modeling the mixed effects from multiple sources of random variations, the method has been widely used in biomedical computation, for instance in the genome-wide association studies (GWASs) that aim to detect genetic variance significantly associated with phenotypes such as human diseases. Collaborative GWAS on large cohorts of patients across multiple institutions is often impeded by the privacy concerns of sharing personal genomic and other health data. To address such concerns, we present in this paper a privacy-preserving Expectation–Maximization (EM) algorithm to build GLMM collaboratively when input data are distributed to multiple participating parties and cannot be transferred to a central server. We assume that the data are horizontally partitioned among participating parties: i.e. each party holds a subset of records (including observational values of fixed effect variables and their corresponding outcome), and for all records, the outcome is regulated by the same set of known fixed effects and random effects. Results: Our collaborative EM algorithm is mathematically equivalent to the original EM algorithm commonly used in GLMM construction. The algorithm also runs efficiently when tested on simulated and real human genomic data, and thus can be practically used for privacy-preserving GLMM construction. We implemented the algorithm for collaborative GLMM (cGLMM) construction in R. The data communication was implemented using the rsocket package. Availability and implementation: The software is released in open source at https://github.com/huthvincent/ cGLMM.",
                "authors": [
                    {
                        "name": "Zhu R."
                    },
                    {
                        "name": "Jiang C."
                    },
                    {
                        "name": "Wang X."
                    },
                    {
                        "name": "Wang S."
                    },
                    {
                        "name": "Zheng H."
                    },
                    {
                        "name": "Tang H."
                    }
                ],
                "date": "2020-01-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Privacy-preserving construction of generalized linear mixed model for biomedical computation"
            },
            "pmcid": "PMC7355231",
            "pmid": "32657380"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "GWAS study",
            "uri": "http://edamontology.org/topic_3517"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Mathematics",
            "uri": "http://edamontology.org/topic_3315"
        }
    ]
}