{
    "accessibility": "Open access",
    "additionDate": "2023-11-28T18:51:12.437476Z",
    "biotoolsCURIE": "biotools:osppc",
    "biotoolsID": "osppc",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "xqguo@henu.edu.cn",
            "name": "Xiangqian Guo",
            "typeEntity": "Person"
        },
        {
            "name": "Lu Zhang",
            "typeEntity": "Person"
        },
        {
            "name": "Qiang Wang",
            "typeEntity": "Person"
        }
    ],
    "description": "A web server for online survival analysis using proteome of pan-cancers, including TCGA (The Cancer Genome Atlas) RPPAs (Reverse-Phase Protein Arrays) data and CPTAC (the National Cancer Institute’s Clinical Proteomic Tumor Analysis Consortium) mass spectrometry data, and provides 5 types of survival terms for about 8,000 patients of 33 distinct malignancies.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Differential gene expression profiling",
                    "uri": "http://edamontology.org/operation_3223"
                },
                {
                    "term": "Differential protein expression profiling",
                    "uri": "http://edamontology.org/operation_3741"
                },
                {
                    "term": "Scatter plot plotting",
                    "uri": "http://edamontology.org/operation_2940"
                }
            ]
        }
    ],
    "homepage": "http://bioinfo.henu.edu.cn/Protein/OSppc.html",
    "lastUpdate": "2023-11-28T18:51:12.440050Z",
    "name": "OSppc",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1016/J.JPROT.2022.104810",
            "metadata": {
                "abstract": "Prognostic biomarker, as a feasible and objective indicator, is valuable in the assessment of cancer risk. With the development of high-throughput sequencing technology, the screening of prognostic biomarkers has become easy, but it is difficult to screen prognostic markers based on proteomic data. In this study we developed a tool named Online consensus Survival analysis web server based on Proteome of Pan-cancers, abbreviated as OSppc, to evaluate the prognostic values of protein biomarkers. >8000 cancer cases with proteomic data, transcriptomic data and clinical follow-up information were collected from TCGA and CPTAC. 14,038 proteins (including proteins and their phosphorylated forms) analyzed by reverse-phase protein arrays and mass spectrometry in 33 types of cancers were collected. In OSppc, three analysis modules are provided, including Survival Analysis, Differential Analysis and Correlation Analysis. Survival analysis module exhibits HR with 95% CI and KM curves with log-rank p value of protein and mRNA levels of input genes. Differential analysis module shows the box plots of protein expression levels in different tissues. Correlation analysis module provides scatter plot with pearson's and spearman's correlation coefficient of the protein and its corresponding mRNA. OSppc can be accessed at http://bioinfo.henu.edu.cn/Protein/OSppc.html. Significance: OSppc can analyze the association between protein, mRNA and prognosis, the correlation between proteome data and gene expression profiles, the differential expression of proteome data between subgroups such as normal and cancer as well. OSppc is registration-free and very valuable to evaluate the prognostic potency of protein of interests. OSppc is very valuable for researchers and clinicians to screen, develop and validate potential protein prognostic biomarkers in pan-cancers, and offers the opportunities to investigate the clinical important functional genes and therapeutic targets of cancers.",
                "authors": [
                    {
                        "name": "Chen T."
                    },
                    {
                        "name": "Guo X."
                    },
                    {
                        "name": "Han Y."
                    },
                    {
                        "name": "Huang Y."
                    },
                    {
                        "name": "Wang Q."
                    },
                    {
                        "name": "Zhang L."
                    }
                ],
                "citationCount": 1,
                "date": "2023-02-20T00:00:00Z",
                "journal": "Journal of Proteomics",
                "title": "OSppc: A web server for online survival analysis using proteome of pan-cancers"
            },
            "pmid": "36587732"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ]
}
