{
    "additionDate": "2021-01-18T08:45:14Z",
    "biotoolsCURIE": "biotools:asap-sml",
    "biotoolsID": "asap-sml",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "Soha.Hassoun@tufts.edu",
            "name": "Soha Hassoun",
            "orcidid": "https://orcid.org/0000-0001-9477-2199",
            "typeEntity": "Person"
        }
    ],
    "description": "Antibody Sequence Analysis Pipeline Using Statistical Testing and Machine Learning (ASAP-SML) is a pipeline to identify distinguishing features in targeting antibody set when compared to a reference non-targeting set. The pipeline first extracts germline, CDR canonical structure, isoelectric point and frequent positional motifs features from sequences and creates an antibody feature fingerprint. Machine-learning and statistical significance testing are applied to antibody sequences and feature fingerprints to identify distinguishing feature values and combinations thereof. When applied to an MMP-targeting set, ASAP identifies salient features and recommends features to use when designing novel MPP-targeting antibody sequences.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Feature extraction",
                    "uri": "http://edamontology.org/operation_3937"
                },
                {
                    "term": "Statistical calculation",
                    "uri": "http://edamontology.org/operation_2238"
                },
                {
                    "term": "Sequence motif analysis",
                    "uri": "http://edamontology.org/operation_2404"
                }
            ]
        }
    ],
    "homepage": "https://github.com/HassounLab/ASAP-SML",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-01-28T20:03:38Z",
    "license": "MIT",
    "name": "ASAP-SML",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PCBI.1007779",
            "metadata": {
                "abstract": "© 2020 Li et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Antibodies are capable of potently and specifically binding individual antigens and, in some cases, disrupting their functions. The key challenge in generating antibody-based inhibitors is the lack of fundamental information relating sequences of antibodies to their unique properties as inhibitors. We develop a pipeline, Antibody Sequence Analysis Pipeline using Statistical testing and Machine Learning (ASAP-SML), to identify features that distinguish one set of antibody sequences from antibody sequences in a reference set. The pipeline extracts feature fingerprints from sequences. The fingerprints represent germline, CDR canonical structure, isoelectric point and frequent positional motifs. Machine learning and statistical significance testing techniques are applied to antibody sequences and extracted feature fingerprints to identify distinguishing feature values and combinations thereof. To demonstrate how it works, we applied the pipeline on sets of antibody sequences known to bind or inhibit the activities of matrix metalloproteinases (MMPs), a family of zinc-dependent enzymes that promote cancer progression and undesired inflammation under pathological conditions, against reference datasets that do not bind or inhibit MMPs. ASAP-SML identifies features and combinations of feature values found in the MMP-targeting sets that are distinct from those in the reference sets.",
                "authors": [
                    {
                        "name": "Li X."
                    },
                    {
                        "name": "van Deventer J.A."
                    },
                    {
                        "name": "Hassoun S."
                    }
                ],
                "citationCount": 1,
                "date": "2020-04-01T00:00:00Z",
                "journal": "PLoS Computational Biology",
                "title": "ASAP-SML: An antibody sequence analysis pipeline using statistical testing and machine learning"
            },
            "pmcid": "PMC7205315",
            "pmid": "32339164"
        }
    ],
    "toolType": [
        "Workflow"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Immunoproteins and antigens",
            "uri": "http://edamontology.org/topic_2830"
        },
        {
            "term": "Sequence sites, features and motifs",
            "uri": "http://edamontology.org/topic_0160"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        }
    ]
}