{
    "additionDate": "2019-11-14T19:41:30Z",
    "biotoolsCURIE": "biotools:OGRDB",
    "biotoolsID": "OGRDB",
    "confidence_flag": "tool",
    "description": "A reference database of inferred immune receptor genes | Welcome to OGRDB - the curated Open Germline Receptor Database! | OGRDB is now accepting V- and J- sequence inferences from the human BCR light and heavy chain. Analysis scripts and submission pages have been updated accordingly",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                }
            ]
        }
    ],
    "homepage": "https://ogrdb.airr-community.org",
    "lastUpdate": "2021-01-04T13:07:20Z",
    "name": "OGRDB",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/NAR/GKZ822",
            "metadata": {
                "abstract": "© 2019 The Author(s). Published by Oxford University Press on behalf of Nucleic Acids Research.High-throughput sequencing of the adaptive immune receptor repertoire (AIRR-seq) is providing unprecedented insights into the immune response to disease and into the development of immune disorders. The accurate interpretation of AIRR-seq data depends on the existence of comprehensive germline gene reference sets. Current sets are known to be incomplete and unrepresentative of the degree of polymorphism and diversity in human and animal populations. A key issue is the complexity of the genomic regions in which they lie, which, because of the presence of multiple repeats, insertions and deletions, have not proved tractable with short-read whole genome sequencing. Recently, tools and methods for inferring such gene sequences from AIRR-seq datasets have become available, and a community approach has been developed for the expert review and publication of such inferences. Here, we present OGRDB, the Open Germline Receptor Database (https://ogrdb.airr-community.org), a public resource for the submission, review and publication of previously unknown receptor germline sequences together with supporting evidence.",
                "authors": [
                    {
                        "name": "Lees W."
                    },
                    {
                        "name": "Busse C.E."
                    },
                    {
                        "name": "Corcoran M."
                    },
                    {
                        "name": "Ohlin M."
                    },
                    {
                        "name": "Scheepers C."
                    },
                    {
                        "name": "Matsen F.A."
                    },
                    {
                        "name": "Yaari G."
                    },
                    {
                        "name": "Watson C.T."
                    },
                    {
                        "name": "Collins A."
                    },
                    {
                        "name": "Shepherd A.J."
                    }
                ],
                "citationCount": 8,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "OGRDB: A reference database of inferred immune receptor genes"
            },
            "pmid": "31566225"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Allergy, clinical immunology and immunotherapeutics",
            "uri": "http://edamontology.org/topic_3400"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Immunology",
            "uri": "http://edamontology.org/topic_0804"
        }
    ],
    "validated": 1
}