{
    "additionDate": "2015-03-05T12:48:13Z",
    "biotoolsCURIE": "biotools:ccpn",
    "biotoolsID": "ccpn",
    "collectionID": [
        "Instruct"
    ],
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Instruct",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        },
        {
            "email": "ccisb@stfc.ac.uk",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "A graphical NMR assignment and data analysis program.",
    "documentation": [
        {
            "type": "User manual",
            "url": "https://www.ccpn.ac.uk/v3-software/tutorials"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "note": "A graphical NMR assignment and data analysis program. Also serves as a data model viewer and editor, and as a hub for launching pipeline software and analyzing the results. Analysis will run under Linux, Unix, MacOSX, and Windows. Integrated programs include ARIA, HADDOCK, CING, DANGLE, MARS, CcpNmr FormatConverter, and the ECI deposition interface.",
            "operation": [
                {
                    "term": "Structure visualisation",
                    "uri": "http://edamontology.org/operation_0570"
                }
            ]
        }
    ],
    "homepage": "http://www.ccpn.ac.uk/v3-software",
    "lastUpdate": "2018-12-10T12:58:54Z",
    "link": [
        {
            "type": "Repository",
            "url": "http://www.ccpn.ac.uk/v2-software"
        }
    ],
    "name": "CcpNmr Analysis",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "Instruct",
    "publication": [
        {
            "doi": "10.1002/prot.20449",
            "metadata": {
                "abstract": "To address data management and data exchange problems in the nuclear magnetic resonance (NMR) community, the Collaborative Computing Project for the NMR community (CCPN) created a \"Data Model\" that describes all the different types of information needed in an NMR structural study, from molecular structure and NMR parameters to coordinates. This paper describes the development of a set of software applications that use the Data Model and its associated libraries, thus validating the approach. These applications are freely available and provide a pipeline for high-throughput analysis of NMR data. Three programs work directly with the Data Model: CcpNmr Analysis, an entirely new analysis and interactive display program, the CcpNmr FormatConverter, which allows transfer of data from programs commonly used in NMR to and from the Data Model, and the CLOUDS software for automated structure calculation and assignment (Carnegie Mellon University), which was rewritten to interact directly with the Data Model The ARIA 2.0 software for structure calculation (Institut Pasteur) and the QUEEN program for validation of restraints (University of Nijmegen) were extended to provide conversion of their data to the Data Model. During these developments the Data Model has been thoroughly tested and used, demonstrating that applications can successfully exchange data via the Data Model. The software architecture developed by CCPN is now ready for new developments, such as integration with additional software applications and extensions of the Data Model into other areas of research. © 2005 Wiley-Liss, Inc.",
                "authors": [
                    {
                        "name": "Vranken W.F."
                    },
                    {
                        "name": "Boucher W."
                    },
                    {
                        "name": "Stevens T.J."
                    },
                    {
                        "name": "Fogh R.H."
                    },
                    {
                        "name": "Pajon A."
                    },
                    {
                        "name": "Llinas M."
                    },
                    {
                        "name": "Ulrich E.L."
                    },
                    {
                        "name": "Markley J.L."
                    },
                    {
                        "name": "Ionides J."
                    },
                    {
                        "name": "Laue E.D."
                    }
                ],
                "citationCount": 1491,
                "date": "2005-06-01T00:00:00Z",
                "journal": "Proteins: Structure, Function and Genetics",
                "title": "The CCPN data model for NMR spectroscopy: Development of a software pipeline"
            },
            "type": "Primary"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Structural biology",
            "uri": "http://edamontology.org/topic_1317"
        },
        {
            "term": "NMR",
            "uri": "http://edamontology.org/topic_0593"
        }
    ],
    "validated": 1,
    "version": [
        "1"
    ]
}