
{
    "credit": [
        {
            "email": "tdr-targetgroup@sanger.ac.uk",
            "name": "TDR-Target Group",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "url": "http://tdrtargets.org/manual"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Protein subcellular localisation prediction",
                    "uri": "http://edamontology.org/operation_2489"
                },
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                },
                {
                    "term": "Gene-set enrichment analysis",
                    "uri": "http://edamontology.org/operation_2436"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Database portal"
        ],
        "topic": [
            {
                "term": "Small molecules",
                "uri": "http://edamontology.org/topic_0154"
            },
            {
                "term": "Model organisms",
                "uri": "http://edamontology.org/topic_0621"
            },
            {
                "term": "Pathology",
                "uri": "http://edamontology.org/topic_0634"
            },
            {
                "term": "Medicinal chemistry",
                "uri": "http://edamontology.org/topic_0209"
            },
            {
                "term": "Drug discovery",
                "uri": "http://edamontology.org/topic_3336"
            }
        ]
    },
    "publication": [
        {
            "abstract": "The TDR Targets Database (http://tdrtargets.org) has been designed and developed as an online resource to facilitate the rapid identification and prioritization of molecular targets for drug development, focusing on pathogens responsible for neglected human diseases. The database integrates pathogen specific genomic information with functional data (e.g. expression, phylogeny, essentiality) for genes collected from various sources, including literature curation. This information can be browsed and queried using an extensive web interface with functionalities for combining, saving, exporting and sharing the query results. Target genes can be ranked and prioritized using numerical weights assigned to the criteria used for querying. In this report we describe recent updates to the TDR Targets database, including the addition of new genomes (specifically helminths), and integration of chemical structure, property and bioactivity information for biological ligands, drugs and inhibitors and cheminformatic tools for querying and visualizing these chemical data. These changes greatly facilitate exploration of linkages (both known and predicted) between genes and small molecules, yielding insight into whether particular proteins may be druggable, effectively allowing the navigation of chemical space in a genomics context. © The Author(s) 2011. Published by Oxford University Press.",
            "authors": [
                "Magarinos M.P.",
                "Carmona S.J.",
                "Crowther G.J.",
                "Ralph S.A.",
                "Roos D.S.",
                "Shanmugam D.",
                "Van Voorhis W.C.",
                "Aguero F."
            ],
            "cit_count": 60,
            "journal": "Nucleic Acids Research",
            "pmid": "22116064",
            "title": "TDR targets: A chemogenomics resource for neglected diseases",
            "year": "2012-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:tdr_targets",
        "biotoolsID": "tdr_targets",
        "description": "Tropical Disease Research (TDR) Database: Designed and developed to facilitate the rapid identification and prioritization of molecular targets for drug development, focusing on pathogens responsible for neglected human diseases. The database integrates pathogen specific genomic information with functional data for genes collected from various sources, including literature curation. Information can be browsed and queried.",
        "homepage": "http://tdrtargets.org/",
        "name": "TDR Targets"
    }
}