{
    "name": "LobSTR", 
    "description": "lobSTR is an alignment and genotyping tool for profiling short tandem repeats from next generation sequencing data", 
    "homepage": "http://lobstr.teamerlich.org/", 
    "biotoolsID": "lobstr", 
    "biotoolsCURIE": "biotools:lobstr", 
    "version": [], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_0380", 
                    "term": "Repeat sequence organisation analysis"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Workflow"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_3168", 
            "term": "Sequencing"
        }
    ], 
    "operatingSystem": [
        "Linux"
    ], 
    "language": [
        "R", 
        "C++", 
        "Python"
    ], 
    "license": null, 
    "collectionID": [], 
    "maturity": "Mature", 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [], 
    "download": [], 
    "documentation": [
        {
            "url": "http://lobstr.teamerlich.org/documentation.html", 
            "type": "General", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": null, 
            "pmid": "22522390", 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "lobSTR: A short tandem repeat profiler for personal genomes", 
                "abstract": "Short tandem repeats (STRs) have a wide range of applications, including medical genetics, forensics, and genetic genealogy. High-throughput sequencing (HTS) has the potential to profile hundreds of thousands of STR loci. However, mainstream bioinformatics pipelines are inadequate for the task. These pipelines treat STR mapping as gapped alignment, which results in cumbersome processing times and a biased sampling of STR alleles. Here, we present lobSTR, a novel method for profiling STRs in personal genomes. lobSTR harnesses concepts from signal processing and statistical learning to avoid gapped alignment and to address the specific noise patterns in STR calling. The speed and reliability of lobSTR exceed the performance of current mainstream algorithms for STR profiling. We validated lobSTR's accuracy by measuring its consistency in calling STRs from whole-genome sequencing of two biological replicates from the same individual, by tracing Mendelian inheritance patterns in STR alleles in whole-genome sequencing of a HapMap trio, and by comparing lobSTR results to traditional molecular techniques. Encouraged by the speed and accuracy of lobSTR, we used the algorithm to conduct a comprehensive survey of STR variations in a deeply sequenced personal genome. We traced the mutation dynamics of close to 100,000 STR loci and observed more than 50,000 STR variations in a single genome. lobSTR's implementation is an end-to-end solution. The package accepts raw sequencing reads and provides the user with the genotyping results. It is written in C/C++, includes multi-threading capabilities, and is compatible with the BAM format.", 
                "date": "2012-06-01T00:00:00Z", 
                "citationCount": 133, 
                "authors": [
                    {
                        "name": "Gymrek M."
                    }, 
                    {
                        "name": "Golan D."
                    }, 
                    {
                        "name": "Rosset S."
                    }, 
                    {
                        "name": "Erlich Y."
                    }
                ], 
                "journal": "Genome Research"
            }
        }
    ], 
    "credit": [
        {
            "name": "lobSTR user group mailing list", 
            "email": "lobstr-user-group@googlegroups.com", 
            "url": null, 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }, 
        {
            "name": "Melissa Gymrek", 
            "email": null, 
            "url": "https://github.com/mgymrek", 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "seqwiki_import", 
    "additionDate": "2017-01-13T13:15:14Z", 
    "lastUpdate": "2018-12-10T12:58:56Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 1, 
    "homepage_status": 0, 
    "elixir_badge": 0
}