{
    "additionDate": "2020-01-09T17:36:28Z",
    "biotoolsCURIE": "biotools:T-lex3",
    "biotoolsID": "T-lex3",
    "confidence_flag": "tool",
    "description": "an accurate tool to genotype and estimate population frequencies of transposable elements using the latest short-read whole genome sequencing data.\n\nRelease 3: Maria Bogaerts maria.bogaerts@ibe.upf-csic.es, Josefa Gonzalez josefa.gonzalez@ibe.upf-csic.es.\n\nT-lex is a computational pipeline that detects presence and/or absence of annotated individual transposable elements (TEs) using next-generation sequencing (NGS) data.\n\nProblems during installation? Try our DOCKER file.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Read mapping",
                    "uri": "http://edamontology.org/operation_3198"
                }
            ]
        }
    ],
    "homepage": "https://github.com/GonzalezLab/T-lex3",
    "language": [
        "Perl"
    ],
    "lastUpdate": "2020-12-27T13:57:16Z",
    "license": "GPL-3.0",
    "name": "T-lex3",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ727",
            "metadata": {
                "abstract": "© 2020 Oxford University Press. All rights reserved.Motivation: Transposable elements (TEs) constitute a significant proportion of the majority of genomes sequenced to date. TEs are responsible for a considerable fraction of the genetic variation within and among species. Accurate genotyping of TEs in genomes is therefore crucial for a complete identification of the genetic differences among individuals, populations and species. Results: In this work, we present a new version of T-lex, a computational pipeline that accurately genotypes and estimates the population frequencies of reference TE insertions using short-read high-throughput sequencing data. In this new version, we have re-designed the T-lex algorithm to integrate the BWA-MEM short-read aligner, which is one of the most accurate short-read mappers and can be launched on longer short-reads (e.g. reads >150 bp). We have added new filtering steps to increase the accuracy of the genotyping, and new parameters that allow the user to control both the minimum and maximum number of reads, and the minimum number of strains to genotype a TE insertion. We also showed for the first time that T-lex3 provides accurate TE calls in a plant genome. Availability and implementation: To test the accuracy of T-lex3, we called 1630 individual TE insertions in Drosophila melanogaster, 1600 individual TE insertions in humans, and 3067 individual TE insertions in the rice genome. We showed that this new version of T-lex is a broadly applicable and accurate tool for genotyping and estimating TE frequencies in organisms with different genome sizes and different TE contents. T-lex3 is available at Github: https://github.com/GonzalezLab/T-lex3.",
                "authors": [
                    {
                        "name": "Bogaerts-Marquez M."
                    },
                    {
                        "name": "Barron M.G."
                    },
                    {
                        "name": "Fiston-Lavier A.-S."
                    },
                    {
                        "name": "Vendrell-Mir P."
                    },
                    {
                        "name": "Castanera R."
                    },
                    {
                        "name": "Casacuberta J.M."
                    },
                    {
                        "name": "Gonzalez J."
                    }
                ],
                "citationCount": 4,
                "date": "2020-02-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "T-lex3: An accurate tool to genotype and estimate population frequencies of transposable elements using the latest short-read whole genome sequencing data"
            },
            "pmid": "31580402"
        }
    ],
    "topic": [
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        }
    ],
    "validated": 1
}