{
    "additionDate": "2018-06-18T19:40:46Z",
    "biotoolsCURIE": "biotools:netprophet",
    "biotoolsID": "netprophet",
    "credit": [
        {
            "email": "brent@wustl.edu",
            "name": "Michael R Brent",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Mapping transcription factor networks by exploiting scalable data resources.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/yiming-kang/NetProphet_2.0"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genetic mapping",
                    "uri": "http://edamontology.org/operation_0282"
                }
            ]
        }
    ],
    "homepage": "https://github.com/yiming-kang/NetProphet_2.0",
    "language": [
        "R",
        "Python"
    ],
    "lastUpdate": "2018-12-10T12:58:59Z",
    "name": "NetProphet",
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btx563",
            "metadata": {
                "abstract": "© The Author 2017. Published by Oxford University Press.Motivation Cells process information, in part, through transcription factor (TF) networks, which control the rates at which individual genes produce their products. A TF network map is a graph that indicates which TFs bind and directly regulate each gene. Previous work has described network mapping algorithms that rely exclusively on gene expression data and â integrative' algorithms that exploit a wide range of data sources including chromatin immunoprecipitation sequencing (ChIP-seq) of many TFs, genome-wide chromatin marks, and binding specificities for many TFs determined in vitro. However, such resources are available only for a few major model systems and cannot be easily replicated for new organisms or cell types. Results We present NetProphet 2.0, a â data light' algorithm for TF network mapping, and show that it is more accurate at identifying direct targets of TFs than other, similarly data light algorithms. In particular, it improves on the accuracy of NetProphet 1.0, which used only gene expression data, by exploiting three principles. First, combining multiple approaches to network mapping from expression data can improve accuracy relative to the constituent approaches. Second, TFs with similar DNA binding domains bind similar sets of target genes. Third, even a noisy, preliminary network map can be used to infer DNA binding specificities from promoter sequences and these inferred specificities can be used to further improve the accuracy of the network map. Availability and implementation Source code and comprehensive documentation are freely available at https://github.com/yiming-kang/NetProphet-2.0. Contact brent@wustl.edu Supplementary informationSupplementary dataare available at Bioinformatics online.",
                "authors": [
                    {
                        "name": "Kang Y."
                    },
                    {
                        "name": "Liow H.-H."
                    },
                    {
                        "name": "Maier E.J."
                    },
                    {
                        "name": "Brent M.R."
                    }
                ],
                "date": "2018-01-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "NetProphet 2.0: Mapping transcription factor networks by exploiting scalable data resources"
            }
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        }
    ],
    "validated": 1,
    "version": [
        "2.0"
    ]
}