{
    "additionDate": "2021-01-18T09:12:19Z",
    "biotoolsCURIE": "biotools:coltapp",
    "biotoolsID": "coltapp",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "clement.vulin@usz.ch",
            "name": "Clément Vulin",
            "typeEntity": "Person"
        }
    ],
    "description": "ColTapp is an automated image analysis application for efficient microbial colony growth dynamics quantification.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                },
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                }
            ]
        }
    ],
    "homepage": "https://coltapp.github.io/",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2021-02-17T09:00:38Z",
    "name": "ColTapp",
    "operatingSystem": [
        "Mac",
        "Windows"
    ],
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1101/2020.05.27.119040"
        },
        {
            "doi": "10.1038/s41598-020-72979-4",
            "metadata": {
                "abstract": "© 2020, The Author(s).Populations of genetically identical bacteria are phenotypically heterogeneous, giving rise to population functionalities that would not be possible in homogeneous populations. For instance, a proportion of non-dividing bacteria could persist through antibiotic challenges and secure population survival. This heterogeneity can be studied in complex environmental or clinical samples by spreading the bacteria on agar plates and monitoring time to growth resumption in order to infer their metabolic state distribution. We present ColTapp, the Colony Time-lapse application for bacterial colony growth quantification. Its intuitive graphical user interface allows users to analyze time-lapse images of agar plates to monitor size, color and morphology of colonies. Additionally, images at isolated timepoints can be used to estimate lag time. Using ColTapp, we analyze a dataset of Staphylococcus aureus time-lapse images including populations with heterogeneous lag time. Colonies on dense plates reach saturation early, leading to overestimation of lag time from isolated images. We show that this bias can be corrected by taking into account the area available to each colony on the plate. We envision that in clinical settings, improved analysis of colony growth dynamics may help treatment decisions oriented towards personalized antibiotic therapies.",
                "authors": [
                    {
                        "name": "Bar J."
                    },
                    {
                        "name": "Boumasmoud M."
                    },
                    {
                        "name": "Kouyos R.D."
                    },
                    {
                        "name": "Vulin C."
                    },
                    {
                        "name": "Zinkernagel A.S."
                    }
                ],
                "citationCount": 4,
                "date": "2020-12-01T00:00:00Z",
                "journal": "Scientific Reports",
                "title": "Efficient microbial colony growth dynamics quantification with ColTapp, an automated image analysis application"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Cytometry",
            "uri": "http://edamontology.org/topic_3934"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Physics",
            "uri": "http://edamontology.org/topic_3318"
        }
    ]
}
