{
    "additionDate": "2019-11-14T19:41:17Z",
    "biotoolsCURIE": "biotools:CiiiDER",
    "biotoolsID": "CiiiDER",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "paul.hertzog@hudson.org.au",
            "name": "Paul J. Hertzog",
            "orcidid": "https://orcid.org/0000-0002-1373-8472",
            "typeEntity": "Person"
        }
    ],
    "description": "A tool for predicting and analysing transcription factor binding sites | CIIIDER is a user-friendly tool for predicting and analysing transcription factor binding sites, designed with biologists in mind | Transcription factor binding site prediction and visualisation software",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Transcription factor binding site prediction",
                    "uri": "http://edamontology.org/operation_0445"
                },
                {
                    "term": "Protein-protein binding site prediction",
                    "uri": "http://edamontology.org/operation_2464"
                },
                {
                    "term": "Nucleic acids-binding site prediction",
                    "uri": "http://edamontology.org/operation_0420"
                }
            ]
        }
    ],
    "homepage": "http://www.ciiider.org",
    "language": [
        "Java"
    ],
    "lastUpdate": "2020-12-11T20:49:53Z",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "https://gitlab.erc.monash.edu.au/ciiid/ciiider"
        }
    ],
    "name": "CiiiDER",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PONE.0215495",
            "metadata": {
                "abstract": "© 2019 Gearing et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.The availability of large amounts of high-throughput genomic, transcriptomic and epigenomic data has provided opportunity to understand regulation of the cellular transcriptome with an unprecedented level of detail. As a result, research has advanced from identifying gene expression patterns associated with particular conditions to elucidating signalling pathways that regulate expression. There are over 1,000 transcription factors (TFs) in vertebrates that play a role in this regulation. Determining which of these are likely to be controlling a set of genes can be assisted by computational prediction, utilising experimentally verified binding site motifs. Here we present CiiiDER, an integrated computational toolkit for transcription factor binding analysis, written in the Java programming language, to make it independent of computer operating system. It is operated through an intuitive graphical user interface with interactive, high-quality visual outputs, making it accessible to all researchers. CiiiDER predicts transcription factor binding sites (TFBSs) across regulatory regions of interest, such as promoters and enhancers derived from any species. It can perform an enrichment analysis to identify TFs that are significantly over- or under-represented in comparison to a bespoke background set and thereby elucidate pathways regulating sets of genes of pathophysiological importance.",
                "authors": [
                    {
                        "name": "Gearing L.J."
                    },
                    {
                        "name": "Cumming H.E."
                    },
                    {
                        "name": "Chapman R."
                    },
                    {
                        "name": "Finkel A.M."
                    },
                    {
                        "name": "Woodhouse I.B."
                    },
                    {
                        "name": "Luu K."
                    },
                    {
                        "name": "Gould J.A."
                    },
                    {
                        "name": "Forster S.C."
                    },
                    {
                        "name": "Hertzog P.J."
                    }
                ],
                "citationCount": 15,
                "date": "2019-09-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "CiIIder: A tool for predicting and analysing transcription factor binding sites"
            },
            "pmcid": "PMC6726224",
            "pmid": "31483836"
        }
    ],
    "topic": [
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "Gene regulation",
            "uri": "http://edamontology.org/topic_0204"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ],
    "validated": 1
}