
{
    "credit": [
        {
            "email": "fpoitevi@pasteur.fr",
            "name": "Poitevin F.",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://lorentz.dynstr.pasteur.fr/aquasaxs.php"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Diffraction data integration",
                    "uri": "http://edamontology.org/operation_3453"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "X-ray diffraction",
                "uri": "http://edamontology.org/topic_2828"
            },
            {
                "term": "Molecular modelling",
                "uri": "http://edamontology.org/topic_2275"
            }
        ]
    },
    "publication": [
        {
            "abstract": "Small Angle X-ray Scattering (SAXS) techniques are becoming more and more useful for structural biologists and biochemists, thanks to better access to dedicated synchrotron beamlines, better detectors and the relative easiness of sample preparation. The ability to compute the theoretical SAXS profile of a given structural model, and to compare this profile with the measured scattering intensity, yields crucial structural informations about the macromolecule under study and/or its complexes in solution. An important contribution to the profile, besides the macromolecule itself and its solvent-excluded volume, is the excess density due to the hydration layer. AquaSAXS takes advantage of recently developed methods, such as AquaSol, that give the equilibrium solvent density map around macromolecules, to compute an accurate SAXS/WAXS profile of a given structure and to compare it to the experimental one. Here, we describe the interface architecture and capabilities of the AquaSAXS web server (http://lorentz.dynstr.pasteur.fr/aquasaxs.php). © 2011 The Author(s).",
            "authors": [
                "Poitevin F.",
                "Orland H.",
                "Doniach S.",
                "Koehl P.",
                "Delarue M."
            ],
            "cit_count": 65,
            "journal": "Nucleic Acids Research",
            "pmid": "21665925",
            "title": "AquaSAXS: A web server for computation and fitting of SAXS profiles with non-uniformally hydrated atomic models",
            "year": "2011-07-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:aquasaxs",
        "biotoolsID": "aquasaxs",
        "description": "AquaSAXS is a web server for computation of and fitting of small angle x-ray scattering (SAXS) profiles with non-uniformally hydrated atomic models.",
        "homepage": "http://lorentz.dynstr.pasteur.fr/aquasaxs.php",
        "name": "AquaSAXS"
    }
}