{
    "additionDate": "2021-01-18T10:43:16Z",
    "biotoolsCURIE": "biotools:sylaras",
    "biotoolsID": "sylaras",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "gregory_baker2@hms.harvard.edu",
            "name": "Gregory J. Baker",
            "typeEntity": "Person"
        },
        {
            "email": "peter_sorger@hms.harvard.edu",
            "name": "Peter K. Sorger",
            "typeEntity": "Person"
        }
    ],
    "description": "SYLARAS (SYstemic Lymphoid Architecture Response ASsessment) is a preclinical research platform for the interrogation of systemic immune response to disease and therapy. The approach combines multiplex immunophenotyping with biological computation to transform complex single-cell datasets into a visual compendium of the time and tissue-dependent changes occurring in immune cell frequency and/or function in response to an arbitrary immune stimulus (e.g. tumor model, infectious or autoimmune disease, vaccine, immunotherapy, etc.).",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                },
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://github.com/gjbaker/sylaras",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-02-24T13:55:45Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "https://www.sylaras.org"
        }
    ],
    "name": "SYLARAS",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1016/J.CELS.2020.08.001",
            "metadata": {
                "abstract": "© 2020 The AuthorsAccurately profiling systemic immune responses to cancer initiation and progression is necessary for understanding tumor surveillance and, ultimately, improving therapy. Here, we describe the SYLARAS software tool (systemic lymphoid architecture response assessment) and a dataset collected with SYLARAS that describes the frequencies of immune cells in primary and secondary lymphoid organs and in the tumor microenvironment of mice engrafted with a standard syngeneic glioblastoma (GBM) model. The data resource involves profiles of 5 lymphoid tissues in 48 mice and shows that GBM causes wide-spread changes in the local and systemic immune architecture. We use SYLARAS to identify a subset of CD45R/B220+ CD8+ T cells that is depleted from circulation but accumulates in the tumor mass and confirm this finding using multiplexed immunofluorescence microscopy. SYLARAS is freely available for download at (https://github.com/gjbaker/sylaras). A record of this paper's transparent peer review process is included in the Supplemental Information. © 2020 The AuthorsLocalized tumors such as glioblastoma alter the composition of the immune system in peripheral organs including the spleen, lymph nodes, bone marrow, and thymus. SYLARAS enables efficient, systematic analysis of immune system architecture across many organs and samples to reveal subtle, recurrent changes on a background of between-sample biological variability.",
                "authors": [
                    {
                        "name": "Baker G.J."
                    },
                    {
                        "name": "Davis S.H."
                    },
                    {
                        "name": "Moore J.K."
                    },
                    {
                        "name": "Muhlich J.L."
                    },
                    {
                        "name": "Palaniappan S.K."
                    },
                    {
                        "name": "Santagata S."
                    },
                    {
                        "name": "Sorger P.K."
                    }
                ],
                "date": "2020-09-23T00:00:00Z",
                "journal": "Cell Systems",
                "title": "SYLARAS: A Platform for the Statistical Analysis and Visual Display of Systemic Immunoprofiling Data and Its Application to Glioblastoma"
            },
            "pmcid": "PMC7565356",
            "pmid": "32898474"
        }
    ],
    "topic": [
        {
            "term": "Cytometry",
            "uri": "http://edamontology.org/topic_3934"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Immunology",
            "uri": "http://edamontology.org/topic_0804"
        }
    ]
}
