{
    "additionDate": "2015-11-06T08:26:10Z",
    "biotoolsCURIE": "biotools:mobidb",
    "biotoolsID": "mobidb",
    "cost": "Free of charge",
    "credit": [
        {
            "gridid": "grid.5608.b",
            "name": "University of Padua, Department of Biomedical Sciences, BioComputing UP lab",
            "rorid": "00240q980",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ],
            "url": "https://biocomputingup.it/"
        },
        {
            "name": "ELIXIR-ITA-PADOVA",
            "typeEntity": "Project",
            "typeRole": [
                "Support"
            ],
            "url": "http://elixir.bio.unipd.it/"
        },
        {
            "email": "silvio.tosatto@unipd.it",
            "name": "Silvio C.E. Tosatto",
            "orcidid": "https://orcid.org/0000-0003-4525-7793",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://biocomputingup.it/"
        },
        {
            "name": "Damiano Piovesan",
            "orcidid": "https://orcid.org/0000-0001-8210-2390",
            "typeEntity": "Person"
        },
        {
            "name": "Francesco Tabaro",
            "orcidid": "https://orcid.org/0000-0002-7559-5585",
            "typeEntity": "Person"
        },
        {
            "name": "Lisanna Paladin",
            "orcidid": "https://orcid.org/0000-0003-0011-9397",
            "typeEntity": "Person"
        },
        {
            "name": "Marco Necci",
            "orcidid": "https://orcid.org/0000-0001-9377-482X"
        }
    ],
    "description": "Database of protein disorder and mobility annotations.",
    "documentation": [
        {
            "type": [
                "API documentation"
            ],
            "url": "https://mobidb.org/help/apidoc"
        },
        {
            "type": [
                "General"
            ],
            "url": "https://mobidb.org/about/mobidb"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "elixirCommunity": [
        "Intrinsically Disordered Proteins"
    ],
    "elixirNode": [
        "Italy"
    ],
    "elixirPlatform": [
        "Data"
    ],
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "UniProt accession",
                        "uri": "http://edamontology.org/data_3021"
                    }
                },
                {
                    "data": {
                        "term": "UniProt keyword",
                        "uri": "http://edamontology.org/data_2007"
                    },
                    "format": [
                        {
                            "term": "plain text format (unformatted)",
                            "uri": "http://edamontology.org/format_1964"
                        }
                    ]
                }
            ],
            "note": "Intrinsic disorder annotations of proteins RESTful access: use the following url:\nhttps://mobidb.org/api/download?free_text=p53",
            "operation": [
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                },
                {
                    "term": "Protein structure analysis",
                    "uri": "http://edamontology.org/operation_2406"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Sequence features",
                        "uri": "http://edamontology.org/data_1255"
                    },
                    "format": [
                        {
                            "term": "JSON",
                            "uri": "http://edamontology.org/format_3464"
                        },
                        {
                            "term": "HTML",
                            "uri": "http://edamontology.org/format_2331"
                        }
                    ]
                }
            ]
        }
    ],
    "homepage": "https://mobidb.org/",
    "lastUpdate": "2021-07-05T12:13:15Z",
    "license": "CC-BY-4.0",
    "maturity": "Mature",
    "name": "MobiDB",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "otherID": [
        {
            "type": "rrid",
            "value": "RRID:SCR_014542"
        }
    ],
    "owner": "ELIXIR-ITA-PADOVA",
    "publication": [
        {
            "doi": "10.1093/nar/gku982",
            "metadata": {
                "abstract": "© The Author(s) 2014.MobiDB (http://mobidb.bio.unipd.it/) is a database of intrinsically disordered and mobile proteins. Intrinsically disordered regions are key for the function of numerous proteins. Here we provide a new version of MobiDB, a centralized source aimed at providing the most complete picture on different flavors of disorder in protein structures covering all UniProt sequences (currently over 80 million). The database features three levels of annotation: manually curated, indirect and predicted. Manually curated data is extracted from the DisProt database. Indirect data is inferred from PDB structures that are considered an indication of intrinsic disorder. The 10 predictors currently included (three ESpritz flavors, two IUPred flavors, two DisEMBL flavors, GlobPlot, VSL2b and JRONN) enable MobiDB to provide disorder annotations for every protein in absence of more reliable data. The new version also features a consensus annotation and classification for long disordered regions. In order to complement the disorder annotations, MobiDB features additional annotations from external sources. Annotations from the UniProt database include post-translational modifications and linear motifs. Pfam annotations are displayed in graphical form and are link-enabled, allowing the user to visit the corresponding Pfam page for further information. Experimental protein-protein interactions from STRING are also classified for disorder content.",
                "authors": [
                    {
                        "name": "Potenza E."
                    },
                    {
                        "name": "Di Domenico T."
                    },
                    {
                        "name": "Walsh I."
                    },
                    {
                        "name": "Tosatto S.C.E."
                    }
                ],
                "citationCount": 139,
                "date": "2015-01-28T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "MobiDB 2.0: An improved database of intrinsically disordered and mobile proteins"
            },
            "pmid": "25361972",
            "type": [
                "Other"
            ],
            "version": "2"
        },
        {
            "doi": "10.1093/bioinformatics/bts327",
            "metadata": {
                "abstract": "Motivation: Disordered protein regions are key to the function of numerous processes within an organism and to the determination of a protein's biological role. The most common source for protein disorder annotations, DisProt, covers only a fraction of the available sequences. Alternatively, the Protein Data Bank (PDB) has been mined for missing residues in X-ray crystallographic structures. Herein, we provide a centralized source for data on different flavours of disorder in protein structures, MobiDB, building on and expanding the content provided by already existing sources. In addition to the DisProt and PDB X-ray structures, we have added experimental information from NMR structures and five different flavours of two disorder predictors (ESpritz and IUpred). These are combined into a weighted consensus disorder used to classify disordered regions into flexible and constrained disorder. Users are encouraged to submit manual annotations through a submission form. MobiDB features experimental annotations for 17 285 proteins, covering the entire PDB and predictions for the SwissProt database, with 565 200 annotated sequences. Depending on the disorder flavour, 6-20% of the residues are predicted as disordered. © The Author 2012. Published by Oxford University Press. All rights reserved.",
                "authors": [
                    {
                        "name": "Di domenico T."
                    },
                    {
                        "name": "Walsh I."
                    },
                    {
                        "name": "Martin A.J.M."
                    },
                    {
                        "name": "Tosatto S.C.E."
                    }
                ],
                "citationCount": 110,
                "date": "2012-08-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "MobiDB: A comprehensive database of intrinsic protein disorder annotations"
            },
            "pmid": "22661649",
            "type": [
                "Other"
            ],
            "version": "1"
        },
        {
            "doi": "10.1093/nar/gkx1071",
            "metadata": {
                "abstract": "© The Author(s) 2017. Published by Oxford University Press on behalf of Nucleic Acids Research.The MobiDB (URL: mobidb.bio.unipd.it) database of protein disorder and mobility annotations has been significantly updated and upgraded since its last major renewal in 2014. Several curated datasets for intrinsic disorder and folding upon binding have been integrated from specialized databases. The indirect evidence has also been expanded to better capture information available in the PDB, such as high temperature residues in X-ray structures and overall conformational diversity. Novel nuclear magnetic resonance chemical shift data provides an additional experimental information layer on conformational dynamics. Predictions have been expanded to provide new types of annotation on backbone rigidity, secondary structure preference and disordered binding regions. MobiDB 3.0 contains information for the complete UniProt protein set and synchronization has been improved by covering all UniParc sequences. An advanced search function allows the creation of a wide array of custom-made datasets for download and further analysis. A large amount of information and cross-links to more specialized databases are intended to make MobiDB the central resource for the scientific community working on protein intrinsic disorder and mobility.",
                "authors": [
                    {
                        "name": "Piovesan D."
                    },
                    {
                        "name": "Tabaro F."
                    },
                    {
                        "name": "Paladin L."
                    },
                    {
                        "name": "Necci M."
                    },
                    {
                        "name": "Micetic I."
                    },
                    {
                        "name": "Camilloni C."
                    },
                    {
                        "name": "Davey N."
                    },
                    {
                        "name": "Dosztanyi Z."
                    },
                    {
                        "name": "Meszaros B."
                    },
                    {
                        "name": "Monzon A.M."
                    },
                    {
                        "name": "Parisi G."
                    },
                    {
                        "name": "Schad E."
                    },
                    {
                        "name": "Sormanni P."
                    },
                    {
                        "name": "Tompa P."
                    },
                    {
                        "name": "Vendruscolo M."
                    },
                    {
                        "name": "Vranken W.F."
                    },
                    {
                        "name": "Tosatto S.C.E."
                    }
                ],
                "citationCount": 109,
                "date": "2018-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "MobiDB 3.0: More annotations for intrinsic disorder, conformational diversity and interactions in proteins"
            },
            "pmid": "29136219",
            "type": [
                "Other"
            ],
            "version": "3"
        },
        {
            "doi": "10.1093/nar/gkaa1058",
            "metadata": {
                "abstract": "© The Author(s) 2020. Published by Oxford University Press on behalf of Nucleic Acids Research. This is an Open Access article distributed under the terms of the Creative Commons Attribution License (http://creativecommons.org/licenses/by/4.0/), which permits unrestricted reuse, distribution, and reproduction in any medium, provided the original work is properly cited.The MobiDB database (URL: https://mobidb.org/) provides predictions and annotations for intrinsically disordered proteins. Here, we report recent developments implemented in MobiDB version 4, regarding the database format, with novel types of annotations and an improved update process. The new website includes a re-designed user interface, a more effective search engine and advanced API for programmatic access. The new database schema gives more flexibility for the users, as well as simplifying the maintenance and updates. In addition, the new entry page provides more visualisation tools including customizable feature viewer and graphs of the residue contact maps. MobiDB v4 annotates the binding modes of disordered proteins, whether they undergo disorder-to-order transitions or remain disordered in the bound state. In addition, disordered regions undergoing liquid-liquid phase separation or post-translational modifications are defined. The integrated information is presented in a simplified interface, which enables faster searches and allows large customized datasets to be downloaded in TSV, Fasta or JSON formats. An alternative advanced interface allows users to drill deeper into features of interest. A new statistics page provides information at database and proteome levels. The new MobiDB version presents state-of-the-art knowledge on disordered proteins and improves data accessibility for both computational and experimental users.",
                "authors": [
                    {
                        "name": "Piovesan D."
                    },
                    {
                        "name": "Necci M."
                    },
                    {
                        "name": "Escobedo N."
                    },
                    {
                        "name": "Monzon A.M."
                    },
                    {
                        "name": "Hatos A."
                    },
                    {
                        "name": "Micetic I."
                    },
                    {
                        "name": "Quaglia F."
                    },
                    {
                        "name": "Paladin L."
                    },
                    {
                        "name": "Ramasamy P."
                    },
                    {
                        "name": "Dosztanyi Z."
                    },
                    {
                        "name": "Vranken W.F."
                    },
                    {
                        "name": "Davey N.E."
                    },
                    {
                        "name": "Parisi G."
                    },
                    {
                        "name": "Fuxreiter M."
                    },
                    {
                        "name": "Tosatto S.C.E."
                    }
                ],
                "citationCount": 3,
                "date": "2021-01-08T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "MobiDB: Intrinsically disordered proteins in 2021"
            },
            "pmcid": "PMC7779018",
            "pmid": "33237329",
            "type": [
                "Primary"
            ],
            "version": "4"
        }
    ],
    "toolType": [
        "Web API",
        "Web application",
        "Database portal"
    ],
    "topic": [
        {
            "term": "Protein structure analysis",
            "uri": "http://edamontology.org/topic_2814"
        },
        {
            "term": "Protein disordered structure",
            "uri": "http://edamontology.org/topic_3538"
        }
    ],
    "validated": 1,
    "version": [
        "4"
    ]
}