
{
    "credit": [
        {
            "email": "gordon@cshl.edu",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://hannonlab.cshl.edu/fastx_toolkit/galaxy.html"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Read pre-processing",
                    "uri": "http://edamontology.org/operation_3219"
                },
                {
                    "term": "Sequence editing",
                    "uri": "http://edamontology.org/operation_0231"
                }
            ]
        }
    ],
    "labels": {
        "collectionID": [
            "ELIXIR Trainer Tools",
            "FASTX-Toolkit",
            "Animal and Crop Genomics"
        ],
        "language": [
            "Shell",
            "C++",
            "C"
        ],
        "license": "AGPL-3.0",
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web application",
            "Suite"
        ],
        "topic": [
            {
                "term": "Sequence analysis",
                "uri": "http://edamontology.org/topic_0080"
            }
        ]
    },
    "link": [
        {
            "type": "REPOSITORY",
            "url": "https://github.com/agordon/fastx_toolkit"
        },
        {
            "type": "ISSUE_TRACKER",
            "url": "https://github.com/agordon/fastx_toolkit/issues"
        }
    ],
    "publication": [
        {
            "abstract": "The FASTA package of sequence comparison programs has been expanded to include FASTX and FASTY, which compare a DNA sequence to a protein sequence database, translating the DNA sequence in three frames and aligning the translated DNA sequence to each sequence in the protein database, allowing gaps and frameshifts. Also new are TFASTX and TFASTY, which compare a protein sequence to a DNA sequence database, translating each sequence in the DNA database in six frames and scoring alignments with gaps and frameshifts. FASTX and TFASTX allow only frameshifts between codons, while FASTY and TFASTY allow substitutions or frameshifts within a codon. We examined the performance of FASTX and FASTY using different gap-opening, gap-extension, frameshift, and nucleotide substitution penalties. In general, FASTX and FASTY perform equivalently when query sequences contain 0-10% errors. We also evaluated the statistical estimates reported by FASTX and FASTY. These estimates are quite accurate, except when an out-of-frame translation produces a low-complexity protein sequence. We used FASTX to scan the Mycoplasma genitalium, Haemophilus influenzae, and Methanococcus jannaschii genomes for unidentified or misidentified protein-coding genes. We found at least 9 new protein-coding genes in the three genomes and at least 35 genes with potentially incorrect boundaries.",
            "authors": [
                "Pearson W.R.",
                "Wood T.",
                "Zhang Z.",
                "Miller W."
            ],
            "cit_count": 413,
            "doi": "10.1006/geno.1997.4995",
            "journal": "Genomics",
            "title": "Comparison of DNA sequences with protein sequences",
            "type": "Review",
            "year": "1997-11-15"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:fastx-toolkit",
        "biotoolsID": "fastx-toolkit",
        "description": "Collection of command line tools for Short-Reads FASTA/FASTQ files preprocessing.",
        "homepage": "http://hannonlab.cshl.edu/fastx_toolkit/",
        "name": "FASTX-Toolkit"
    }
}