{
    "accessibility": "Open access",
    "additionDate": "2022-10-09T15:52:35.879336Z",
    "biotoolsCURIE": "biotools:rtdsm",
    "biotoolsID": "rtdsm",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "haley.patrick@mail.mcgill.ca",
            "name": "Haley M. Patrick"
        },
        {
            "name": "John Kildea"
        }
    ],
    "description": "Open-source software for radiotherapy dose-surface map generation and analysis.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                }
            ]
        }
    ],
    "homepage": "https://github.com/McGillMedPhys/rtdsm",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-10-09T15:52:35.881676Z",
    "license": "GPL-3.0",
    "name": "rtdsm",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1002/MP.15900",
            "metadata": {
                "abstract": "© 2022 American Association of Physicists in Medicine.Background: Dose-outcome studies in radiation oncology have historically excluded spatial information due to dose-volume histograms being the most dominant source of dosimetric information. In recent years, dose-surface maps (DSMs) have become increasingly popular for characterization of spatial dose distributions and identification of radiosensitive subregions for hollow organs. However, methodological variations and lack of open-source, publicly offered code-sharing between research groups have limited reproducibility and wider adoption. Purpose: This paper presents rtdsm, an open-source software for DSM calculation with the intent to improve the reproducibility of and the access to DSM-based research in medical physics and radiation oncology. Methods: A literature review was conducted to identify essential functionalities and prevailing calculation approaches to guide development. The described software has been designed to calculate DSMs from DICOM data with a high degree of user customizability and to facilitate DSM feature analysis. Core functionalities include DSM calculation, equivalent dose conversions, common DSM feature extraction, and simple DSM accumulation. Results: A number of use cases were used to qualitatively and quantitatively demonstrate the use and usefulness of rtdsm. Specifically, two DSM slicing methods, planar and noncoplanar, were implemented and tested, and the effects of method choice on output DSMs were demonstrated. An example comparison of DSMs from two different treatments was used to highlight the use cases of various built-in analysis functions for equivalent dose conversion and DSM feature extraction. Conclusions: We developed and implemented rtdsm as a standalone software that provides all essential functionalities required to perform a DSM-based study. It has been made freely accessible under an open-source license on Github to encourage collaboration and community use.",
                "authors": [
                    {
                        "name": "Kildea J."
                    },
                    {
                        "name": "Patrick H.M."
                    }
                ],
                "date": "2022-01-01T00:00:00Z",
                "journal": "Medical Physics",
                "title": "Technical Note: rtdsm—An open-source software for radiotherapy dose-surface map generation and analysis"
            },
            "pmid": "35912447"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        }
    ]
}
