{
    "additionDate": "2017-09-29T03:08:50Z",
    "biotoolsCURIE": "biotools:cocin",
    "biotoolsID": "cocin",
    "credit": [
        {
            "email": "s.srihari@uq.edu.au",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "name": "Sriganesh Srihari"
        }
    ],
    "description": "Identifying conserved protein complexes between species by constructing interolog networks.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Prediction and recognition",
                    "uri": "http://edamontology.org/operation_2423"
                }
            ]
        }
    ],
    "homepage": "https://sites.google.com/site/cocinhy/",
    "lastUpdate": "2018-12-10T12:58:55Z",
    "name": "COCIN",
    "owner": "sriganeshms",
    "publication": [
        {
            "metadata": {
                "abstract": "Background: Protein complexes conserved across species indicate processes that are core to cellular machinery (e.g. cell-cycle or DNA damage-repair complexes conserved across human and yeast). While numerous computational methods have been devised to identify complexes from the protein interaction (PPI) networks of individual species, these are severely limited by noise and errors (false positives) in currently available datasets. Our analysis using human and yeast PPI networks revealed that these methods missed several important complexes including those conserved between the two species (e.g. the MLH1-MSH2-PMS2-PCNA mismatch-repair complex). Here, we note that much of the functionalities of yeast complexes have been conserved in human complexes not only through sequence conservation of proteins but also of critical functional domains. Therefore, integrating information of domain conservation might throw further light on conservation patterns between yeast and human complexes.Results: We identify conserved complexes by constructing an interolog network (IN) leveraging on the functional conservation of proteins between species through domain conservation (from Ensembl) in addition to sequence similarity. We employ 'state-of-the-art' methods to cluster the interolog network, and map these clusters back to the original PPI networks to identify complexes conserved between the species. Evaluation of our IN-based approach (called COCIN) on human and yeast interaction data identifies several additional complexes (76% recall) compared to direct complex detection from the original PINs (54% recall). Our analysis revealed that the IN-construction removes several non-conserved interactions many of which are false positives, thereby improving complex prediction. In fact removing non-conserved interactions from the original PINs also resulted in higher number of conserved complexes, thereby validating our IN-based approach. These complexes included the mismatch repair complex, MLH1-MSH2-PMS2-PCNA, and other important ones namely, RNA polymerase-II, EIF3 and MCM complexes, all of which constitute core cellular processes known to be conserved across the two species.Conclusions: Our method based on integrating domain conservation and sequence similarity to construct interolog networks helps to identify considerably more conserved complexes between the PPI networks from two species compared to direct complex prediction from the PPI networks. We observe from our experiments that protein complexes are not conserved from yeast to human in a straightforward way, that is, it is not the case that a yeast complex is a (proper) sub-set of a human complex with a few additional proteins present in the human complex. Instead complexes have evolved multifold with considerable re-organization of proteins and re-distribution of their functions across complexes. This finding can have significant implications on attempts to extrapolate other kinds of relationships such as synthetic lethality from yeast to human, for example in the identification of novel cancer targets. Availability: http://www.comp.nus.edu.sg/~leonghw/COCIN/. © 2013 Nguyen et al.; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Leong H.W."
                    },
                    {
                        "name": "Nguyen P.-V."
                    },
                    {
                        "name": "Srihari S."
                    }
                ],
                "citationCount": 19,
                "date": "2013-10-22T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Identifying conserved protein complexes between species by constructing interolog networks"
            },
            "pmid": "24564762"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Computational biology",
            "uri": "http://edamontology.org/topic_3307"
        }
    ],
    "validated": 1,
    "version": [
        "v1"
    ]
}
