{
    "additionDate": "2022-10-03T06:28:03.312780Z",
    "biotoolsCURIE": "biotools:egpred",
    "biotoolsID": "egpred",
    "credit": [
        {
            "name": "Gajendra P.S. Raghava",
            "url": "https://webs.iiitd.edu.in/raghava/egpred/"
        }
    ],
    "description": "EGPred implements a new strategy where the specificity is maintained while the sensitivity is increased on combining ab initio predictions with BLASTX exons that are filtered using criteria such as length of HSP alignment, percent identity, score, expectation value, and similarity to intron sequences.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://webs.iiitd.edu.in/raghava/egpred/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Analysis",
                    "uri": "http://edamontology.org/operation_2945"
                }
            ]
        }
    ],
    "homepage": "https://webs.iiitd.edu.in/raghava/egpred/",
    "lastUpdate": "2022-10-03T06:28:15.613902Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "https://webs.iiitd.edu.in/raghava/egpred/"
        }
    ],
    "name": "egpred",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "raghavagps",
    "publication": [
        {
            "doi": "10.1101/gr.2524704",
            "metadata": {
                "abstract": "EGPred is a Web-based server that combines ab initio methods and similarity searches to predict genes, particularly exon regions, with high accuracy. The EGPred program proceeds in the following steps: (1) an initial BLASTX search of genomic sequence against the RefSeq database is used to identify protein hits with an E-value <1; (2) a second BLASTX search of genomic sequence against the hits from the previous run with relaxed parameters (E-values <10) helps to retrieve all probable coding exon regions; (3) a BLASTN search of genomic sequence against the intron database is then used to detect probable intron regions; (4) the probable intron and exon regions are compared to filter/remove wrong exons; (5) the NNSPLICE program is then used to reassign splicing signal site positions in the remaining probable coding exons; and (6) finally ab initio predictions are combined with exons derived from the fifth step based oil the relative strength of start/stop and splice signal sites as obtained from ab initio and similarity search. The combination method increases the exon level performance of five different ab initio programs by 4%-10% when evaluated on the HMR195 data set. Similar improvement is observed when ab initio programs are evaluated on the Burset/Guigo data set. Finally, EGPred is demonstrated on an ∼95-Mbp fragment of human chromosome 13. The list of predicted genes from this analysis are available in the supplementary material. The EGPred program is computationally intensive due to multiple BLAST runs during each analysis. The EGPred server is available at http://www.imtech.res.in/raghava/egpred/. © 2004 by Cold Spring Harbor Laboratory Press.",
                "authors": [
                    {
                        "name": "Issac B."
                    },
                    {
                        "name": "Raghava G.P.S."
                    }
                ],
                "citationCount": 9,
                "date": "2004-09-01T00:00:00Z",
                "journal": "Genome Research",
                "title": "EGPred: Prediction of eukaryotic genes using Ab initio methods after combining with sequence similarity approaches"
            },
            "pmcid": "PMC515322",
            "pmid": "15342559"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Computational biology",
            "uri": "http://edamontology.org/topic_3307"
        }
    ]
}
