{
    "additionDate": "2021-01-18T11:20:33Z",
    "biotoolsCURIE": "biotools:m5cpred-svm",
    "biotoolsID": "m5cpred-svm",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "xlzhu_mdl@hotmail.com",
            "name": "Xiaolei Zhu",
            "orcidid": "https://orcid.org/0000-0002-1967-2806",
            "typeEntity": "Person"
        },
        {
            "email": "bishoudong@163.com",
            "name": "Shoudong Bi",
            "typeEntity": "Person"
        }
    ],
    "description": "A novel method for predicting m5C sites of RNA.\n\nm5CPred-SVM: A webserver for predicting m5C sites of RNA based on SVM.\n\nA webserver for m5C Sites Identification of RNA. m5CPred-SVM was developed by using support vector machine based on six different kinds of features extracted from RNA sequences. Now it is for three different species including H. sapiens, M. musculus and A. thaliana. The benchmark datasets can be download here. The input for the server is the RNA sequence. More details can be found in the tutorial.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "PTM site prediction",
                    "uri": "http://edamontology.org/operation_0417"
                },
                {
                    "term": "Splice site prediction",
                    "uri": "http://edamontology.org/operation_0433"
                },
                {
                    "term": "trans-regulatory element prediction",
                    "uri": "http://edamontology.org/operation_0443"
                }
            ]
        }
    ],
    "homepage": "http://zhulab.ahu.edu.cn/m5CPred-SVM",
    "lastUpdate": "2021-02-19T08:19:19Z",
    "name": "m5CPred-SVM",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.21203/RS.3.RS-39526/V3"
        },
        {
            "doi": "10.1186/S12859-020-03828-4",
            "metadata": {
                "abstract": "© 2020, The Author(s).Background: As one of the most common post-transcriptional modifications (PTCM) in RNA, 5-cytosine-methylation plays important roles in many biological functions such as RNA metabolism and cell fate decision. Through accurate identification of 5-methylcytosine (m5C) sites on RNA, researchers can better understand the exact role of 5-cytosine-methylation in these biological functions. In recent years, computational methods of predicting m5C sites have attracted lots of interests because of its efficiency and low-cost. However, both the accuracy and efficiency of these methods are not satisfactory yet and need further improvement. Results: In this work, we have developed a new computational method, m5CPred-SVM, to identify m5C sites in three species, H. sapiens, M. musculus and A. thaliana. To build this model, we first collected benchmark datasets following three recently published methods. Then, six types of sequence-based features were generated based on RNA segments and the sequential forward feature selection strategy was used to obtain the optimal feature subset. After that, the performance of models based on different learning algorithms were compared, and the model based on the support vector machine provided the highest prediction accuracy. Finally, our proposed method, m5CPred-SVM was compared with several existing methods, and the result showed that m5CPred-SVM offered substantially higher prediction accuracy than previously published methods. It is expected that our method, m5CPred-SVM, can become a useful tool for accurate identification of m5C sites. Conclusion: In this study, by introducing position-specific propensity related features, we built a new model, m5CPred-SVM, to predict RNA m5C sites of three different species. The result shows that our model outperformed the existing state-of-art models. Our model is available for users through a web server at https://zhulab.ahu.edu.cn/m5CPred-SVM.",
                "authors": [
                    {
                        "name": "Bi S."
                    },
                    {
                        "name": "Chen X."
                    },
                    {
                        "name": "Chen Y."
                    },
                    {
                        "name": "Liu Y."
                    },
                    {
                        "name": "Xiong Y."
                    },
                    {
                        "name": "Zhu X."
                    }
                ],
                "date": "2020-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "m5CPred-SVM: a novel method for predicting m5C sites of RNA"
            },
            "pmcid": "PMC7602301",
            "pmid": "33126851"
        }
    ],
    "toolType": [
        "Web service"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        },
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Zoology",
            "uri": "http://edamontology.org/topic_3500"
        }
    ]
}
