{
    "additionDate": "2022-10-03T09:48:05.294423Z",
    "biotoolsCURIE": "biotools:dbbip",
    "biotoolsID": "dbbip",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "jfxia@ahu.edu.cn",
            "name": "Junfeng Xia",
            "orcidid": "https://orcid.org/0000-0003-3024-1705",
            "typeEntity": "Person"
        }
    ],
    "description": "A comprehensive bipolar disorder database for genetic research.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Collapsing methods",
                    "uri": "http://edamontology.org/operation_3791"
                },
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                }
            ]
        }
    ],
    "homepage": "http://dbbip.xialab.info",
    "language": [
        "JavaScript"
    ],
    "lastUpdate": "2022-10-03T09:48:05.296893Z",
    "license": "Not licensed",
    "name": "dbBIP",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1093/DATABASE/BAAC049",
            "metadata": {
                "abstract": "© 2022 The Author(s).Bipolar disorder (BIP) is one of the most common hereditary psychiatric disorders worldwide. Elucidating the genetic basis of BIP will play a pivotal role in mechanistic delineation. Genome-wide association studies (GWAS) have successfully reported multiple susceptibility loci conferring BIP risk, thus providing insight into the effects of its underlying pathobiology. However, difficulties remain in the extrication of important and biologically relevant data from genetic discoveries related to psychiatric disorders such as BIP. There is an urgent need for an integrated and comprehensive online database with unified access to genetic and multi-omics data for in-depth data mining. Here, we developed the dbBIP, a database for BIP genetic research based on published data. The dbBIP consists of several modules, i.e.: (i) single nucleotide polymorphism (SNP) module, containing large-scale GWAS genetic summary statistics and functional annotation information relevant to risk variants; (ii) gene module, containing BIP-related candidate risk genes from various sources and (iii) analysis module, providing a simple and user-friendly interface to analyze one's own data. We also conducted extensive analyses, including functional SNP annotation, integration (including summary-data-based Mendelian randomization and transcriptome-wide association studies), co-expression, gene expression, tissue expression, protein-protein interaction and brain expression quantitative trait loci analyses, thus shedding light on the genetic causes of BIP. Finally, we developed a graphical browser with powerful search tools to facilitate data navigation and access. The dbBIP provides a comprehensive resource for BIP genetic research as well as an integrated analysis platform for researchers and can be accessed online at http://dbbip.xialab.info. Database URL: http://dbbip.xialab.info",
                "authors": [
                    {
                        "name": "Kong H."
                    },
                    {
                        "name": "Li X."
                    },
                    {
                        "name": "Luo X."
                    },
                    {
                        "name": "Ma S."
                    },
                    {
                        "name": "Wu Y."
                    },
                    {
                        "name": "Xia J."
                    },
                    {
                        "name": "Yan W."
                    },
                    {
                        "name": "Zhang M."
                    }
                ],
                "date": "2022-01-01T00:00:00Z",
                "journal": "Database",
                "title": "dbBIP: a comprehensive bipolar disorder database for genetic research"
            },
            "pmcid": "PMC9250320",
            "pmid": "35779245"
        }
    ],
    "toolType": [
        "Database portal",
        "Web application"
    ],
    "topic": [
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Data mining",
            "uri": "http://edamontology.org/topic_3473"
        },
        {
            "term": "GWAS study",
            "uri": "http://edamontology.org/topic_3517"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Psychiatry",
            "uri": "http://edamontology.org/topic_3419"
        }
    ]
}
