{
    "additionDate": "2021-01-18T12:12:03Z",
    "biotoolsCURIE": "biotools:xg-ac4c",
    "biotoolsID": "xg-ac4c",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "hilaltayara@jbnu.ac.kr",
            "name": "Hilal Tayara",
            "typeEntity": "Person"
        },
        {
            "email": "kitchong@jbnu.ac.kr",
            "name": "Kil To Chong",
            "typeEntity": "Person"
        }
    ],
    "description": "identification of N4-acetylcytidine (ac4C) in mRNA using eXtreme gradient boosting with electron-ion interaction pseudopotentials.\n\nXG-ac4C: Identification of N4-acetylcytidine (ac4C) in mRNA by using eXtreme Gradient Boosting method with electron-ion interaction pseudopotentials.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Feature extraction",
                    "uri": "http://edamontology.org/operation_3937"
                }
            ]
        }
    ],
    "homepage": "http://nsclbio.jbnu.ac.kr/tools/xgac4c/",
    "lastUpdate": "2021-03-18T11:06:02Z",
    "name": "XG-ac4C",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1038/S41598-020-77824-2",
            "metadata": {
                "abstract": "© 2020, The Author(s).N4-acetylcytidine (ac4C) is a post-transcriptional modification in mRNA which plays a major role in the stability and regulation of mRNA translation. The working mechanism of ac4C modification in mRNA is still unclear and traditional laboratory experiments are time-consuming and expensive. Therefore, we propose an XG-ac4C machine learning model based on the eXtreme Gradient Boost classifier for the identification of ac4C sites. The XG-ac4C model uses a combination of electron-ion interaction pseudopotentials and electron-ion interaction pseudopotentials of trinucleotide of the nucleotides in ac4C sites. Moreover, Shapley additive explanations and local interpretable model-agnostic explanations are applied to understand the importance of features and their contribution to the final prediction outcome. The obtained results demonstrate that XG-ac4C outperforms existing state-of-the-art methods. In more detail, the proposed model improves the area under the precision-recall curve by 9.4% and 9.6% in cross-validation and independent tests, respectively. Finally, a user-friendly web server based on the proposed model for ac4C site identification is made freely available at http://nsclbio.jbnu.ac.kr/tools/xgac4c/.",
                "authors": [
                    {
                        "name": "Alam W."
                    },
                    {
                        "name": "Chong K.T."
                    },
                    {
                        "name": "Tayara H."
                    }
                ],
                "citationCount": 5,
                "date": "2020-12-01T00:00:00Z",
                "journal": "Scientific Reports",
                "title": "XG-ac4C: identification of N4-acetylcytidine (ac4C) in mRNA using eXtreme gradient boosting with electron-ion interaction pseudopotentials"
            },
            "pmcid": "PMC7708984",
            "pmid": "33262392"
        }
    ],
    "topic": [
        {
            "term": "Bioinformatics",
            "uri": "http://edamontology.org/topic_0091"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Protein expression",
            "uri": "http://edamontology.org/topic_0108"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ]
}
