{
    "additionDate": "2015-01-22T11:40:47Z",
    "biotoolsCURIE": "biotools:clipper",
    "biotoolsID": "clipper",
    "credit": [
        {
            "name": "ELIXIR-ITA-PADOVA",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        },
        {
            "email": "chiara.romualdi@unipd.it",
            "name": "Chiara Romualdi",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://romualdi.bio.unipd.it/"
        }
    ],
    "description": "This tool is for topological gene set analysis. It implements a two-step empirical approach based on the exploitation of graph decomposition into a junction tree to reconstruct the most relevant signal path.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://www.bioconductor.org/packages/release/bioc/manuals/clipper/man/clipper.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "note": "Bioconductor package. It implements a novel method for topological Pathway Analysis. It takes as input a gene expression matrix (divided into two classes of samples) and a list of graphs (pathways). Then, using the test on the mean and concentration matrices it identifies the portion of each pathway associated the most to the phenotype.",
            "operation": [
                {
                    "term": "Pathway or network analysis",
                    "uri": "http://edamontology.org/operation_2497"
                }
            ]
        }
    ],
    "homepage": "http://www.bioconductor.org/packages/release/bioc/html/clipper.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2019-01-09T15:53:14Z",
    "license": "AGPL-3.0",
    "name": "clipper",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "ELIXIR-ITA-PADOVA",
    "publication": [
        {
            "doi": "10.1093/nar/gks866",
            "metadata": {
                "abstract": "Gene set analysis using biological pathways has become a widely used statistical approach for gene expression analysis. A biological pathway can be represented through a graph where genes and their interactions are, respectively, nodes and edges of the graph. From a biological point of view only some portions of a pathway are expected to be altered; however, few methods using pathway topology have been proposed and none of them tries to identify the signal paths, within a pathway, mostly involved in the biological problem. Here, we present a novel algorithm for pathway analysis clipper, that tries to fill in this gap. clipper implements a two-step empirical approach based on the exploitation of graph decomposition into a junction tree to reconstruct the most relevant signal path. In the first step clipper selects significant pathways according to statistical tests on the means and the concentration matrices of the graphs derived from pathway topologies. Then, it identifies within these pathways the signal paths having the greatest association with a specific phenotype. We test our approach on simulated and two real expression datasets. Our results demonstrate the efficacy of clipper in the identification of signal transduction paths totally coherent with the biological problem. © 2012 The Author(s). Published by Oxford University Press.",
                "authors": [
                    {
                        "name": "Martini P."
                    },
                    {
                        "name": "Sales G."
                    },
                    {
                        "name": "Massa M.S."
                    },
                    {
                        "name": "Chiogna M."
                    },
                    {
                        "name": "Romualdi C."
                    }
                ],
                "citationCount": 74,
                "date": "2013-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "Along signal paths: An empirical gene set approach exploiting pathway topology"
            },
            "pmcid": "PMC3592432",
            "pmid": "23002139",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Functional genomics",
            "uri": "http://edamontology.org/topic_0085"
        }
    ],
    "validated": 1,
    "version": [
        "1.6.2"
    ]
}