{
    "additionDate": "2019-11-14T18:21:09Z",
    "biotoolsCURIE": "biotools:asltbx",
    "biotoolsID": "asltbx",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "marco.loggia@mgh.harvard.edu",
            "name": "Marco Luciano Loggia",
            "typeEntity": "Person"
        }
    ],
    "description": "Imaging Clinically Relevant Pain States Using Arterial Spin Labeling | The Center for Functional Neuroimaging at the University of Pennsylvania provides unification for currently distributed medical center efforts in physiological and clinical brain imaging and advance the general interests of the brain imaging community through targeted methods development, symposia and colloquia, handling of regulatory issues, and fund-raising efforts | Updated manual, ASL MoCo code, and asl_perf_subtract.m. Major new features include: | asl_perf_subtract.m has been updated with new parameters (T1b, T2wm, Rwm-blood) from the latest literature. CBF quantification for PASL using voxelwise M0 value has been updated. Please see the document therein for the details | Made a new version for SPM12. Major new features include: | 1) wraper functors for most of the processing steps,",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://cfn.upenn.edu/~zewang/ASLtbx_manual.pdf"
        }
    ],
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                }
            ]
        }
    ],
    "homepage": "https://cfn.upenn.edu/~zewang/ASLtbx.php",
    "lastUpdate": "2020-12-02T15:24:40Z",
    "name": "ASLtbx",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1097/PR9.0000000000000750",
            "metadata": {
                "abstract": "Copyright © 2019 The Author(s).Arterial spin labeling (ASL) is a perfusion-based functional magnetic resonance imaging technique that uses water in arterial blood as a freely diffusible tracer to measure regional cerebral blood flow noninvasively. To date, its application to the study of pain has been relatively limited. Yet, ASL possesses key features that make it uniquely positioned to study pain in certain paradigms. For instance, ASL is sensitive to very slowly fluctuating brain signals (in the order of minutes or longer). This characteristic makes ASL particularly suitable for the evaluation of brain mechanisms of tonic experimental, postsurgical, and ongoing/or continuously varying pain in chronic or acute pain conditions (whereas blood-oxygen level-dependent functional magnetic resonance is better suited to detect brain responses to short-lasting or phasic/evoked pain). Unlike positron emission tomography or other perfusion techniques, ASL allows the estimation of regional cerebral blood flow without requiring the administration of radioligands or contrast agents. Thus, ASL is well suited for within-subject longitudinal designs (eg, to study evolution of pain states over time, or of treatment effects in clinical trials). Arterial spin labeling is also highly versatile, allowing for novel paradigms exploring a flexible array of pain states, plus it can be used to simultaneously estimate not only pain-related alterations in perfusion but also functional connectivity. In conclusion, ASL can be successfully applied in pain paradigms that would be either challenging or impossible to implement using other techniques. Particularly when used in concert with other neuroimaging techniques, ASL can be a powerful tool in the pain imager's toolbox.",
                "authors": [
                    {
                        "name": "Howard M.A."
                    },
                    {
                        "name": "Loggia M.L."
                    },
                    {
                        "name": "Segerdahl A.R."
                    },
                    {
                        "name": "Tracey I."
                    }
                ],
                "citationCount": 4,
                "date": "2019-07-01T00:00:00Z",
                "journal": "Pain Reports",
                "title": "Imaging clinically relevant pain states using arterial spin labeling"
            },
            "pmcid": "PMC6690842",
            "pmid": "31406952"
        }
    ],
    "topic": [
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        },
        {
            "term": "Pain medicine",
            "uri": "http://edamontology.org/topic_3401"
        }
    ],
    "validated": 1
}
