{
    "additionDate": "2019-11-14T19:43:06Z",
    "biotoolsCURIE": "biotools:HSIC_Lasso",
    "biotoolsID": "HSIC_Lasso",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "myamada@i.kyoto-u.ac.jp",
            "name": "Makoto Yamada",
            "typeEntity": "Person"
        }
    ],
    "description": "Model-free biomarker detection for ultra-high dimensional data | Versatile Nonlinear Feature Selection Algorithm for High-dimensional Data | Supervised, nonlinear feature selection method for high-dimensional datasets | pyHSICLasso is a package of the Hilbert Schmidt Independence Criterion Lasso (HSIC Lasso), which is a black box (nonlinear) feature selection method considering the nonlinear input and output relationship. HSIC Lasso can be regarded as a convex variant of widely used minimum redundancy maximum relevance (mRMR) feature selection algorithm | pyHSICLasso is a package of the Hilbert Schmidt Independence Criterion Lasso (HSIC Lasso), which is a nonlinear feature selection method considering the nonlinear input and output relationship",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Imputation",
                    "uri": "http://edamontology.org/operation_3557"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "https://github.com/riken-aip/pyHSICLasso",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-12-10T09:52:44Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://pypi.org/project/pyHSICLasso"
        }
    ],
    "name": "HSIC Lasso",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ333",
            "metadata": {
                "abstract": "© 2019 The Author(s) 2019. Published by Oxford University Press.Motivation: Finding non-linear relationships between biomolecules and a biological outcome is computationally expensive and statistically challenging. Existing methods have important drawbacks, including among others lack of parsimony, non-convexity and computational overhead. Here we propose block HSIC Lasso, a non-linear feature selector that does not present the previous drawbacks. Results: We compare block HSIC Lasso to other state-of-the-art feature selection techniques in both synthetic and real data, including experiments over three common types of genomic data: gene-expression microarrays, single-cell RNA sequencing and genome-wide association studies. In all cases, we observe that features selected by block HSIC Lasso retain more information about the underlying biology than those selected by other techniques. As a proof of concept, we applied block HSIC Lasso to a single-cell RNA sequencing experiment on mouse hippocampus. We discovered that many genes linked in the past to brain development and function are involved in the biological differences between the types of neurons.",
                "authors": [
                    {
                        "name": "Climente-Gonzalez H."
                    },
                    {
                        "name": "Azencott C.-A."
                    },
                    {
                        "name": "Kaski S."
                    },
                    {
                        "name": "Yamada M."
                    }
                ],
                "citationCount": 7,
                "date": "2019-07-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Block HSIC Lasso: Model-free biomarker detection for ultra-high dimensional data"
            },
            "pmcid": "PMC6612810",
            "pmid": "31510671"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        },
        {
            "term": "GWAS study",
            "uri": "http://edamontology.org/topic_3517"
        }
    ],
    "validated": 1
}