{
    "additionDate": "2018-10-20T14:53:13Z",
    "biotoolsCURIE": "biotools:smallanimalmrghifu",
    "biotoolsID": "smallanimalmrghifu",
    "credit": [
        {
            "email": "megan.poorman@vanderbilt.edu",
            "name": "Megan E. Poorman",
            "orcidid": "http://orcid.org/0000-0001-5474-8776",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "smallAnimalMRgHIFU is a hardware and software package that includes closed-loop feedback controlled thermometry code and CAD drawings for a therapy table designed for a preclinical MRI scanner.",
    "documentation": [
        {
            "type": [
                "Training material"
            ],
            "url": "https://github.com/poormanme/smallAnimalMRgHIFU/blob/master/INSTRUCTIONS.md"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                }
            ]
        }
    ],
    "homepage": "https://github.com/poormanme/smallAnimalMRgHIFU",
    "language": [
        "MATLAB",
        "C"
    ],
    "lastUpdate": "2019-01-13T17:23:40Z",
    "license": "CC-BY-NC-4.0",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/poormanme/smallAnimalMRgHIFU/issues"
        }
    ],
    "name": "smallAnimalMRgHIFU",
    "operatingSystem": [
        "Windows"
    ],
    "owner": "daniel_stefan",
    "publication": [
        {
            "doi": "10.1186/s40349-016-0066-7",
            "metadata": {
                "abstract": "© 2016 The Author(s).Background: MR-guided focused ultrasound or high-intensity focused ultrasound (MRgFUS/MRgHIFU) is a non-invasive therapeutic modality with many potential applications in areas such as cancer therapy, drug delivery, and blood-brain barrier opening. However, the large financial costs involved in developing preclinical MRgFUS systems represent a barrier to research groups interested in developing new techniques and applications. We aim to mitigate these challenges by detailing a validated, open-source preclinical MRgFUS system capable of delivering thermal and mechanical FUS in a quantifiable and repeatable manner under real-time MRI guidance. Methods: A hardware and software package was developed that includes closed-loop feedback controlled thermometry code and CAD drawings for a therapy table designed for a preclinical MRI scanner. For thermal treatments, the modular software uses a proportional integral derivative controller to maintain a precise focal temperature rise in the target given input from MR phase images obtained concurrently. The software computes the required voltage output and transmits it to a FUS transducer that is embedded in the delivery table within the magnet bore. The delivery table holds the FUS transducer, a small animal and its monitoring equipment, and a transmit/receive RF coil. The transducer is coupled to the animal via a water bath and is translatable in two dimensions from outside the magnet. The transducer is driven by a waveform generator and amplifier controlled by real-time software in Matlab. MR acoustic radiation force imaging is also implemented to confirm the position of the focus for mechanical and thermal treatments. Results: The system was validated in tissue-mimicking phantoms and in vivo during murine tumor hyperthermia treatments. Sonications were successfully controlled over a range of temperatures and thermal doses for up to 20 min with minimal temperature overshoot. MR thermometry was validated with an optical temperature probe, and focus visualization was achieved with acoustic radiation force imaging. Conclusions: We developed an MRgFUS platform for small-animal treatments that robustly delivers accurate, precise, and controllable sonications over extended time periods. This system is an open source and could increase the availability of low-cost small-animal systems to interdisciplinary researchers seeking to develop new MRgFUS applications and technology.",
                "authors": [
                    {
                        "name": "Poorman M.E."
                    },
                    {
                        "name": "Chaplin V.L."
                    },
                    {
                        "name": "Wilkens K."
                    },
                    {
                        "name": "Dockery M.D."
                    },
                    {
                        "name": "Giorgio T.D."
                    },
                    {
                        "name": "Grissom W.A."
                    },
                    {
                        "name": "Caskey C.F."
                    }
                ],
                "citationCount": 15,
                "date": "2016-01-01T00:00:00Z",
                "journal": "Journal of Therapeutic Ultrasound",
                "title": "Open-source, small-animal magnetic resonance-guided focused ultrasound system"
            },
            "pmcid": "PMC5011339",
            "pmid": "27597889",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Plug-in",
        "Desktop application"
    ],
    "topic": [
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        }
    ],
    "validated": 1
}