
{
    "credit": [
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Modelling and simulation",
                    "uri": "http://edamontology.org/operation_2426"
                }
            ]
        }
    ],
    "labels": {
        "topic": [
            {
                "term": "Molecular interactions, pathways and networks",
                "uri": "http://edamontology.org/topic_0602"
            },
            {
                "term": "Imaging",
                "uri": "http://edamontology.org/topic_3382"
            },
            {
                "term": "Environmental science",
                "uri": "http://edamontology.org/topic_3855"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© 2019 Biophysical SocietyRecent experimental and computational developments have been pushing the limits of live-cell single-molecule imaging, enabling the monitoring of intermolecular interactions in their native environment with high spatiotemporal resolution. However, interactions are captured only for the labeled subset of molecules, which tends to be a small fraction. As a result, it has remained a challenge to calculate molecular interaction kinetics, in particular association rates, from live-cell single-molecule tracking data. To overcome this challenge, we developed a mathematical modeling-based Framework for the Inference of in Situ Interaction Kinetics (FISIK) from single-molecule imaging data with substoichiometric labeling. FISIK consists of (I) devising a mathematical model of molecular movement and interactions, mimicking the biological system and data-acquisition setup, and (II) estimating the unknown model parameters, including molecular association and dissociation rates, by fitting the model to experimental single-molecule data. Due to the stochastic nature of the model and data, we adapted the method of indirect inference for model calibration. We validated FISIK using a series of tests in which we simulated trajectories of diffusing molecules that interact with each other, considering a wide range of model parameters, and including resolution limitations, tracking errors, and mismatches between the model and the biological system it mimics. We found that FISIK has the sensitivity to determine association and dissociation rates, with accuracy and precision depending on the labeled fraction of molecules and the extent of molecule tracking errors. For cases where the labeled fraction is too low (e.g., to afford accurate tracking), combining dynamic but sparse single-molecule imaging data with almost-whole population oligomer distribution data improves FISIK's performance. All in all, FISIK is a promising approach for the derivation of molecular interaction kinetics in their native environment from single-molecule imaging data with substoichiometric labeling.",
            "authors": [
                "de Oliveira L.R.",
                "Jaqaman K."
            ],
            "cit_count": 0,
            "doi": "10.1016/J.BPJ.2019.07.050",
            "journal": "Biophysical Journal",
            "pmid": "31443908",
            "title": "FISIK: Framework for the Inference of In Situ Interaction Kinetics from Single-Molecule Imaging Data",
            "year": "2019-09-17"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:FISIK",
        "biotoolsID": "FISIK",
        "description": "> MEDIUM CONFIDENCE! | > HOMEPAGE MISSING! | Framework for the Inference of In Situ Interaction Kinetics from Single-Molecule Imaging Data | Recent experimental and computational developments have been pushing the limits of live-cell single-molecule imaging, enabling the monitoring of intermolecular interactions in their native environment with high spatiotemporal resolution. However, interactions are captured only for the labeled subset of molecules, which tends to be a small fraction. As a result, it has remained a challenge to calculate molecular interaction kinetics, in particular association rates, from live-cell single-molecule tracking data. To overcome this challenge, we developed a mathematical modeling-based Framework for the Inference of in Situ Interaction Kinetics (FISIK) from single-molecule imaging data with substoichiometric labeling",
        "homepage": "https://www.ncbi.nlm.nih.gov/pubmed/?term=31443908",
        "name": "FISIK"
    }
}