{
    "accessibility": "Open access",
    "additionDate": "2022-06-28T10:51:05.381031Z",
    "biotoolsCURIE": "biotools:vectormap-gr",
    "biotoolsID": "vectormap-gr",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "bio1763@gmail.com",
            "name": "Emmanouil A. Fotakis",
            "orcidid": "https://orcid.org/0000-0002-1290-7211",
            "typeEntity": "Person"
        },
        {
            "name": "Anastasia Kampouraki",
            "orcidid": "https://orcid.org/0000-0001-6702-2544"
        },
        {
            "name": "George Koliopoulos",
            "orcidid": "https://orcid.org/0000-0003-3228-0695"
        },
        {
            "name": "Konstantinos Mavridis",
            "orcidid": "https://orcid.org/0000-0001-9544-9510"
        }
    ],
    "description": "A local scale operational management tool for entomological monitoring, to support vector control activities in Greece and the Mediterranean Basin.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Phasing",
                    "uri": "http://edamontology.org/operation_3454"
                },
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                },
                {
                    "term": "Validation",
                    "uri": "http://edamontology.org/operation_2428"
                }
            ]
        }
    ],
    "homepage": "http://vectormap.si.edu/",
    "lastUpdate": "2024-11-24T15:59:29.878472Z",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "https://vectormap-gr.com/"
        }
    ],
    "name": "VectorMap-GR",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1016/j.crpvbd.2021.100053",
            "metadata": {
                "abstract": "Over the past decade, Greece and other Mediterranean countries have witnessed the emergence and resurgence of several vector-borne diseases (VBDs), posing important public health challenges and threatening the tourist industry. An essential prerequisite for the design and execution of efficient and sustainable context-specific VBD control programmes is the establishment of integrative entomological and epidemiological surveillance systems. However, the monitoring and management of surveillance datasets (often chronologically fragmented, scattered in regional health district offices and partially accessible upon requisition), as well as their transformation into actionable information, is a complex undertaking. In light of aiding and optimizing vector control efforts in the Mediterranean Basin, we developed VectorMap-GR, an online, open access, operational management tool for entomological and complementary epidemiological monitoring data. The toolʼs key components are a set of controlled vocabularies (ontologies) running throughout the system, the systemʼs database and a map interface for data querying and display. The tool supports transformation of raw data into operationally relevant information (i.e. customized maps, charts, tables and reports) in a highly interactive fashion achieved through query filters and the ArcGIS technology embedded in the system. End-users may search for and obtain information on (i) the mosquito fauna composition, abundance and spatiotemporal dynamics; (ii) the mosquito insecticide resistance status and underlying resistance mechanisms; (iii) the occurrence of VBD pathogens and infections in vectors, animals and humans; and (iv) operationally relevant physical feature georeferenced datasets (e.g. mosquito breeding sites). VectorMap-GR was pilot implemented during 2018–2020 in a mosquito control programme in the Region of Crete (southern Greece). The programmeʼs control efforts coupled with VectorMap-GR pilot implementation phase, very likely contributed to the reduction of vector population numbers and the prevention of human VBD occurrences, recorded in this period.",
                "authors": [
                    {
                        "name": "Chaskopoulou A."
                    },
                    {
                        "name": "Fotakis E.A."
                    },
                    {
                        "name": "Kampouraki A."
                    },
                    {
                        "name": "Kioulos I."
                    },
                    {
                        "name": "Koliopoulos G."
                    },
                    {
                        "name": "Kouleris T."
                    },
                    {
                        "name": "Mavridis K."
                    },
                    {
                        "name": "Orfanos M."
                    },
                    {
                        "name": "Stamatelopoulos P."
                    },
                    {
                        "name": "Tsiropoulos Z."
                    },
                    {
                        "name": "Vontas J."
                    }
                ],
                "citationCount": 3,
                "date": "2021-01-01T00:00:00Z",
                "journal": "Current Research in Parasitology and Vector-Borne Diseases",
                "title": "VectorMap-GR: A local scale operational management tool for entomological monitoring, to support vector control activities in Greece and the Mediterranean Basin"
            },
            "pmcid": "PMC8906066",
            "pmid": "35284881"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Agricultural science",
            "uri": "http://edamontology.org/topic_3810"
        },
        {
            "term": "Ecology",
            "uri": "http://edamontology.org/topic_0610"
        },
        {
            "term": "Ontology and terminology",
            "uri": "http://edamontology.org/topic_0089"
        },
        {
            "term": "Public health and epidemiology",
            "uri": "http://edamontology.org/topic_3305"
        },
        {
            "term": "Zoology",
            "uri": "http://edamontology.org/topic_3500"
        }
    ],
    "validated": 1
}
