{
    "accessibility": "Open access",
    "additionDate": "2021-12-02T17:11:40.829131Z",
    "biotoolsCURIE": "biotools:mirra",
    "biotoolsID": "mirra",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "Olivier.Pieters@ugent.be",
            "name": "Olivier Pieters",
            "orcidid": "https://orcid.org/0000-0002-5473-4849",
            "typeEntity": "Person"
        },
        {
            "name": "Emiel Deprost",
            "orcidid": "https://orcid.org/0000-0001-5323-5506"
        },
        {
            "name": "Emiel Deprost",
            "orcidid": "https://orcid.org/0000-0001-5323-5506"
        },
        {
            "name": "Jonas Van Der Donckt",
            "orcidid": "https://orcid.org/0000-0003-1440-7410"
        },
        {
            "name": "Lore Brosens",
            "orcidid": "https://orcid.org/0000-0001-6999-075X"
        }
    ],
    "description": "A Modular and Cost-Effective Microclimate Monitoring System for Real-Time Remote Applications.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/opieters/MIRRA/tree/main/webserver/documentation"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/opieters/MIRRA",
    "language": [
        "C++",
        "Python"
    ],
    "lastUpdate": "2021-12-02T17:13:06.545724Z",
    "license": "Apache-2.0",
    "name": "MIRRA",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.3390/S21134615",
            "metadata": {
                "abstract": "Monitoring climate change, and its impacts on ecological, agricultural, and other societal systems, is often based on temperature data derived from official weather stations. Yet, these data do not capture most microclimates, influenced by soil, vegetation and topography, operating at spatial scales relevant to the majority of organisms on Earth. Detecting and attributing climate change impacts with confidence and certainty will only be possible by a better quantification of temperature changes in forests, croplands, mountains, shrublands, and other remote habitats. There is an urgent need for a novel, miniature and simple device filling the gap between low-cost devices with manual data download (no instantaneous data) and high-end, expensive weather stations with real-time data access. Here, we develop an integrative real-time monitoring system for microclimate measurements: MIRRA (Microclimate Instrument for Real-time Remote Applications) to tackle this problem. The goal of this platform is the design of a miniature and simple instrument for near instantaneous, long-term and remote measurements of microclimates. To that end, we optimised power consumption and transfer data using a cellular uplink. MIRRA is modular, enabling the use of different sensors (e.g., air and soil temperature, soil moisture and radiation) depending upon the application, and uses an innovative node system highly suitable for remote locations. Data from separate sensor modules are wirelessly sent to a gateway, thus avoiding the drawbacks of cables. With this sensor technology for the long-term, low-cost, real-time and remote sensing of microclimates, we lay the foundation and open a wide range of possibilities to map microclimates in different ecosystems, feeding a next generation of models. MIRRA is, however, not limited to microclimate monitoring thanks to its modular and wireless design. Within limits, it is suitable or any application requiring real-time data logging of power-efficient sensors over long periods of time. We compare the performance of this system to a reference system in real-world conditions in the field, indicating excellent correlation with data collected by established data loggers. This proof-of-concept forms an important foundation to creating the next version of MIRRA, fit for large scale deployment and possible commercialisation. In conclusion, we developed a novel wireless cost-effective sensor system for microclimates.",
                "authors": [
                    {
                        "name": "Brosens L."
                    },
                    {
                        "name": "De Frenne P."
                    },
                    {
                        "name": "De Swaef T."
                    },
                    {
                        "name": "Deprost E."
                    },
                    {
                        "name": "Pieters O."
                    },
                    {
                        "name": "Sanczuk P."
                    },
                    {
                        "name": "Van Der Donckt J."
                    },
                    {
                        "name": "Vangansbeke P."
                    },
                    {
                        "name": "Wyffels F."
                    }
                ],
                "date": "2021-07-05T00:00:00Z",
                "journal": "Sensors (Basel, Switzerland)",
                "title": "MIRRA: A Modular and Cost-Effective Microclimate Monitoring System for Real-Time Remote Applications"
            },
            "pmcid": "PMC8271970",
            "pmid": "34283163"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Agricultural science",
            "uri": "http://edamontology.org/topic_3810"
        },
        {
            "term": "Data acquisition",
            "uri": "http://edamontology.org/topic_3077"
        },
        {
            "term": "Ecology",
            "uri": "http://edamontology.org/topic_0610"
        }
    ]
}
