{
    "additionDate": "2021-01-18T11:02:13Z",
    "biotoolsCURIE": "biotools:gcwgan",
    "biotoolsID": "gcwgan",
    "confidence_flag": "tool",
    "credit": [
        {
            "name": "Mostafa Karimi",
            "typeEntity": "Person"
        },
        {
            "email": "yshen@tamu.edu",
            "name": "Shaowen Zhu",
            "typeEntity": "Person"
        },
        {
            "name": "Yue Cao",
            "typeEntity": "Person"
        }
    ],
    "description": "De Novo Protein Design for Novel Folds Using Guided Conditional Wasserstein Generative Adversarial Networks.\n\nk.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Fold recognition",
                    "uri": "http://edamontology.org/operation_0303"
                },
                {
                    "term": "Protein folding analysis",
                    "uri": "http://edamontology.org/operation_2415"
                },
                {
                    "term": "Ab initio structure prediction",
                    "uri": "http://edamontology.org/operation_0476"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Shen-Lab/gcWGAN",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-01-22T18:00:41Z",
    "license": "GPL-3.0",
    "name": "gcWGAN",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1021/ACS.JCIM.0C00593",
            "metadata": {
                "abstract": "© 2020 American Chemical Society. All rights reserved.Although massive data is quickly accumulating on protein sequence and structure, there is a small and limited number of protein architectural types (or structural folds). This study is addressing the following question: how well could one reveal underlying sequence-structure relationships and design protein sequences for an arbitrary, potentially novel, structural fold? In response to the question, we have developed novel deep generative models, namely, semisupervised gcWGAN (guided, conditional, Wasserstein Generative Adversarial Networks). To overcome training difficulties and improve design qualities, we build our models on conditional Wasserstein GAN (WGAN) that uses Wasserstein distance in the loss function. Our major contributions include (1) constructing a low-dimensional and generalizable representation of the fold space for the conditional input, (2) developing an ultrafast sequence-to-fold predictor (or oracle) and incorporating its feedback into WGAN as a loss to guide model training, and (3) exploiting sequence data with and without paired structures to enable a semisupervised training strategy. Assessed by the oracle over 100 novel folds not in the training set, gcWGAN generates more successful designs and covers 3.5 times more target folds compared to a competing data-driven method (cVAE). Assessed by sequence- and structure-based predictors, gcWGAN designs are physically and biologically sound. Assessed by a structure predictor over representative novel folds, including one not even part of basis folds, gcWGAN designs have comparable or better fold accuracy yet much more sequence diversity and novelty than cVAE. The ultrafast data-driven model is further shown to boost the success of a principle-driven de novo method (RosettaDesign), through generating design seeds and tailoring design space. In conclusion, gcWGAN explores uncharted sequence space to design proteins by learning generalizable principles from current sequence-structure data. Data, source codes, and trained models are available at https://github.com/Shen-Lab/gcWGAN.",
                "authors": [
                    {
                        "name": "Karimi M."
                    },
                    {
                        "name": "Zhu S."
                    },
                    {
                        "name": "Cao Y."
                    },
                    {
                        "name": "Shen Y."
                    }
                ],
                "citationCount": 8,
                "date": "2020-12-28T00:00:00Z",
                "journal": "Journal of Chemical Information and Modeling",
                "title": "De Novo Protein Design for Novel Folds Using Guided Conditional Wasserstein Generative Adversarial Networks"
            },
            "pmcid": "PMC7775287",
            "pmid": "32945673"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Protein folding, stability and design",
            "uri": "http://edamontology.org/topic_0130"
        },
        {
            "term": "Protein folds and structural domains",
            "uri": "http://edamontology.org/topic_0736"
        },
        {
            "term": "Physics",
            "uri": "http://edamontology.org/topic_3318"
        },
        {
            "term": "Structure prediction",
            "uri": "http://edamontology.org/topic_0082"
        }
    ],
    "validated": 1
}