{
    "additionDate": "2024-06-17T10:37:52.995904Z",
    "biotoolsCURIE": "biotools:evoaug_tf",
    "biotoolsID": "evoaug_tf",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "koo@cshl.edu",
            "name": "Peter K Koo",
            "orcidid": "https://orcid.org/0000-0001-8722-0038",
            "typeEntity": "Person"
        }
    ],
    "description": "Extending evolution-inspired data augmentations for genomic deep learning to TensorFlow.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://evoaug-tf.readthedocs.io"
        }
    ],
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://github.com/p-koo/evoaug-tf",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T13:55:10.564199Z",
    "license": "MIT",
    "name": "EvoAug-TF",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btae092",
            "metadata": {
                "abstract": "Summary: Deep neural networks (DNNs) have been widely applied to predict the molecular functions of the non-coding genome. DNNs are data hungry and thus require many training examples to fit data well. However, functional genomics experiments typically generate limited amounts of data, constrained by the activity levels of the molecular function under study inside the cell. Recently, EvoAug was introduced to train a genomic DNN with evolution-inspired augmentations. EvoAug-trained DNNs have demonstrated improved generalization and interpretability with attribution analysis. However, EvoAug only supports PyTorch-based models, which limits its applications to a broad class of genomic DNNs based in TensorFlow. Here, we extend EvoAug’s functionality to TensorFlow in a new package, we call EvoAug-TF. Through a systematic benchmark, we find that EvoAug-TF yields comparable performance with the original EvoAug package. Availability and implementation: EvoAug-TF is freely available for users and is distributed under an open-source MIT license. Researchers can access the open-source code on GitHub (https://github.com/p-koo/evoaug-tf). The pre-compiled package is provided via PyPI (https://pypi.org/project/evoaug-tf) with in-depth documentation on ReadTheDocs (https://evoaug-tf.readthedocs.io). The scripts for reproducing the results are available at (https://github.com/p-koo/evoaug-tf_analysis).",
                "authors": [
                    {
                        "name": "Koo P.K."
                    },
                    {
                        "name": "Muthukumar S."
                    },
                    {
                        "name": "Yu Y."
                    }
                ],
                "citationCount": 1,
                "date": "2024-03-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "EvoAug-TF: extending evolution-inspired data augmentations for genomic deep learning to TensorFlow"
            },
            "pmcid": "PMC10918628",
            "pmid": "38366935"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "ChIP-seq",
            "uri": "http://edamontology.org/topic_3169"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Structural variation",
            "uri": "http://edamontology.org/topic_3175"
        }
    ]
}
