{
    "accessibility": "Open access",
    "additionDate": "2022-04-03T22:22:12.080722Z",
    "biotoolsCURIE": "biotools:ipdb",
    "biotoolsID": "ipdb",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "brienoenriquezma@upmc.edu",
            "name": "Miguel A. Brieño-Enriquez",
            "typeEntity": "Person"
        },
        {
            "email": "jdelmazo@cib.csic.es",
            "name": "Jesús del Mazo",
            "typeEntity": "Person"
        },
        {
            "name": "Eduardo Larriba"
        },
        {
            "name": "Odei Barreñada"
        }
    ],
    "description": "A PIWI-bound piRNAs database to mining NGS sncRNA data and beyond.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "miRNA expression analysis",
                    "uri": "http://edamontology.org/operation_3792"
                },
                {
                    "term": "miRNA target prediction",
                    "uri": "http://edamontology.org/operation_0463"
                }
            ]
        }
    ],
    "homepage": "https://ipdb2.shinyapps.io/ipdb2/",
    "language": [
        "Perl",
        "R",
        "Shell"
    ],
    "lastUpdate": "2022-04-03T22:22:12.083153Z",
    "license": "Not licensed",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/OdBT/piRNA-IPdb_v2"
        }
    ],
    "name": "IPdb",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1186/S12864-021-08071-6",
            "metadata": {
                "abstract": "© 2021, The Author(s).Background: PIWI-interacting RNAs (piRNAs) are an abundant single-stranded type of small non-coding RNAs (sncRNAs), which initially were discovered in gonadal cells, with a role as defenders of genomic integrity in the germline, acting against the transposable elements. With a regular size range of 21-35 nt, piRNAs are associated with a PIWI-clade of Argonaute family proteins. The most widely accepted mechanisms of biogenesis for piRNAs involve the transcription of longer precursors of RNAs to be processed, by complexes of proteins, to functional size, preferentially accommodating uridine residues at the 5’ end and 3’ methylation to increase the stability of these molecules. piRNAs have also been detected in somatic cells, with diverse potential functions, indicating their high plasticity and pleiotropic activity. Discovered about two decades ago, piRNAs are a large and versatile type of sncRNA and that remain insufficiently identified and analyzed, through next-generation sequencing (NGS), to evaluate their processing, functions, and biogenesis in different cell types and during development. piRNAs’ distinction from other sncRNAs has led to controversial results and interpretation difficulties when using existing databases because of the heterogeneity of the criteria used in making the distinction. Description: We present “piRNA-IPdb”, a database based uniquely on datasets obtaining after the defining characteristic of piRNAs: those small RNAs bound to PIWI proteins. We selected and analyzed sequences from piRBase that exclusively cover the binding to PIWI. We pooled a total of 18,821,815 sequences from RNA-seq after immunoprecipitation that included the binding to any of the mouse PIWI proteins (MILI, MIWI, or MIWI2). Conclusions: In summary, we present the characteristics and potential use of piRNA-IPdb database for the analysis of bona fide piRNAs.",
                "authors": [
                    {
                        "name": "Barrenada O."
                    },
                    {
                        "name": "Brieno-Enriquez M.A."
                    },
                    {
                        "name": "Larriba E."
                    },
                    {
                        "name": "Mazo J."
                    }
                ],
                "date": "2021-12-01T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "piRNA-IPdb: a PIWI-bound piRNAs database to mining NGS sncRNA data and beyond"
            },
            "pmcid": "PMC8549166",
            "pmid": "34702185"
        }
    ],
    "toolType": [
        "Database portal",
        "Web application"
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Zoology",
            "uri": "http://edamontology.org/topic_3500"
        }
    ]
}
