{
    "additionDate": "2021-01-18T07:03:17Z",
    "biotoolsCURIE": "biotools:flowmapr",
    "biotoolsID": "flowmapr",
    "confidence_flag": "tool",
    "credit": [
        {
            "name": "Eli R. Zunder",
            "typeEntity": "Person"
        }
    ],
    "description": "FLOWMAPR is an R package  for extensible analysis of single-cell datasets including FCS files generated from mass/flow cytometry or data.frames of other single-cell data processed in R.\nIt is a graph-based, force-directed layout algorithm for trajectory mapping in single-cell time course datasets.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Scaffolding",
                    "uri": "http://edamontology.org/operation_3216"
                },
                {
                    "term": "Parsing",
                    "uri": "http://edamontology.org/operation_1812"
                },
                {
                    "term": "Formatting",
                    "uri": "http://edamontology.org/operation_0335"
                },
                {
                    "term": "Dimensionality reduction",
                    "uri": "http://edamontology.org/operation_3935"
                }
            ]
        }
    ],
    "homepage": "https://github.com/zunderlab/FLOWMAP/",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-03-11T10:06:29Z",
    "license": "MIT",
    "name": "FLOWMAPR",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1038/S41596-019-0246-3",
            "metadata": {
                "abstract": "© 2020, The Author(s), under exclusive licence to Springer Nature Limited.High-dimensional single-cell technologies present new opportunities for biological discovery, but the complex nature of the resulting datasets makes it challenging to perform comprehensive analysis. One particular challenge is the analysis of single-cell time course datasets: how to identify unique cell populations and track how they change across time points. To facilitate this analysis, we developed FLOW-MAP, a graphical user interface (GUI)-based software tool that uses graph layout analysis with sequential time ordering to visualize cellular trajectories in high-dimensional single-cell datasets obtained from flow cytometry, mass cytometry or single-cell RNA sequencing (scRNAseq) experiments. Here we provide a detailed description of the FLOW-MAP algorithm and how to use the open-source R package FLOWMAPR via its GUI or with text-based commands. This approach can be applied to many dynamic processes, including in vitro stem cell differentiation, in vivo development, oncogenesis, the emergence of drug resistance and cell signaling dynamics. To demonstrate our approach, we perform a step-by-step analysis of a single-cell mass cytometry time course dataset from mouse embryonic stem cells differentiating into the three germ layers: endoderm, mesoderm and ectoderm. In addition, we demonstrate FLOW-MAP analysis of a previously published scRNAseq dataset. Using both synthetic and experimental datasets for comparison, we perform FLOW-MAP analysis side by side with other single-cell analysis methods, to illustrate when it is advantageous to use the FLOW-MAP approach. The protocol takes between 30 min and 1.5 h to complete.",
                "authors": [
                    {
                        "name": "Ko M.E."
                    },
                    {
                        "name": "Williams C.M."
                    },
                    {
                        "name": "Fread K.I."
                    },
                    {
                        "name": "Goggin S.M."
                    },
                    {
                        "name": "Rustagi R.S."
                    },
                    {
                        "name": "Fragiadakis G.K."
                    },
                    {
                        "name": "Nolan G.P."
                    },
                    {
                        "name": "Zunder E.R."
                    }
                ],
                "citationCount": 2,
                "date": "2020-02-01T00:00:00Z",
                "journal": "Nature Protocols",
                "title": "FLOW-MAP: a graph-based, force-directed layout algorithm for trajectory mapping in single-cell time course datasets"
            },
            "pmid": "31932774"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Cytometry",
            "uri": "http://edamontology.org/topic_3934"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Systems biology",
            "uri": "http://edamontology.org/topic_2259"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ]
}