{
    "additionDate": "2018-10-03T07:58:20Z",
    "biotoolsCURIE": "biotools:biovenn",
    "biotoolsID": "biovenn",
    "collectionID": [
        "overlap",
        "combinatorics",
        "visualization"
    ],
    "credit": [
        {
            "email": "tim.hulsen@philips.com",
            "name": "Tim Hulsen",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "BioVenn is an easy-to-use web application to generate area-proportional Venn diagrams from lists of biological identifiers. It supports a wide range of identifiers from the most used biological databases currently available. Its implementation on the World Wide Web makes it available for use on any computer with internet connection, independent of operating system and without the need to install programs locally. BioVenn is freely accessible at http://www.biovenn.nl.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                },
                {
                    "term": "Comparison",
                    "uri": "http://edamontology.org/operation_2424"
                },
                {
                    "term": "ID mapping",
                    "uri": "http://edamontology.org/operation_3282"
                }
            ]
        }
    ],
    "homepage": "https://www.biovenn.nl",
    "lastUpdate": "2020-09-11T09:57:12Z",
    "link": [
        {
            "note": "BioVenn Web interface",
            "type": [
                "Other"
            ],
            "url": "https://www.biovenn.nl"
        },
        {
            "note": "BioVenn R package",
            "type": [
                "Other"
            ],
            "url": "https://cran.r-project.org/package=BioVenn"
        },
        {
            "note": "BioVenn Python package",
            "type": [
                "Other"
            ],
            "url": "https://pypi.org/project/BioVenn/"
        }
    ],
    "name": "BioVenn",
    "owner": "thulsen",
    "publication": [
        {
            "doi": "10.1186/1471-2164-9-488",
            "metadata": {
                "abstract": "Background: In many genomics projects, numerous lists containing biological identifiers are produced. Often it is useful to see the overlap between different lists, enabling researchers to quickly observe similarities and differences between the data sets they are analyzing. One of the most popular methods to visualize the overlap and differences between data sets is the Venn diagram: a diagram consisting of two or more circles in which each circle corresponds to a data set, and the overlap between the circles corresponds to the overlap between the data sets. Venn diagrams are especially useful when they are 'area-proportional' i.e. the sizes of the circles and the overlaps correspond to the sizes of the data sets. Currently there are no programs available that can create area-proportional Venn diagrams connected to a wide range of biological databases. Results: We designed a web application named BioVenn to summarize the overlap between two or three lists of identifiers, using area-proportional Venn diagrams. The user only needs to input these lists of identifiers in the textboxes and push the submit button. Parameters like colors and text size can be adjusted easily through the web interface. The position of the text can be adjusted by 'drag-and-drop' principle. The output Venn diagram can be shown as an SVG or PNG image embedded in the web application, or as a standalone SVG or PNG image. The latter option is useful for batch queries. Besides the Venn diagram, BioVenn outputs lists of identifiers for each of the resulting subsets. If an identifier is recognized as belonging to one of the supported biological databases, the output is linked to that database. Finally, BioVenn can map Affymetrix and EntrezGene identifiers to Ensembl genes. Conclusion: BioVenn is an easy-to-use web application to generate area-proportional Venn diagrams from lists of biological identifiers. It supports a wide range of identifiers from the most used biological databases currently available. Its implementation on the World Wide Web makes it available for use on any computer with internet connection, independent of operating system and without the need to install programs locally. BioVenn is freely accessible at http://www.cmbi.ru.nl/cdd/ biovenn/. © 2008 Hulsen et al; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Hulsen T."
                    },
                    {
                        "name": "de Vlieg J."
                    },
                    {
                        "name": "Alkema W."
                    }
                ],
                "citationCount": 734,
                "date": "2008-10-16T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "BioVenn - A web application for the comparison and visualization of biological lists using area-proportional Venn diagrams"
            },
            "pmcid": "PMC2584113",
            "pmid": "18925949",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Computational biology",
            "uri": "http://edamontology.org/topic_3307"
        },
        {
            "term": "Data visualisation",
            "uri": "http://edamontology.org/topic_0092"
        },
        {
            "term": "Bioinformatics",
            "uri": "http://edamontology.org/topic_0091"
        },
        {
            "term": "Comparative genomics",
            "uri": "http://edamontology.org/topic_0797"
        }
    ],
    "validated": 1,
    "version": [
        "1.0"
    ]
}