{
    "additionDate": "2019-11-14T18:45:59Z",
    "biotoolsCURIE": "biotools:cv_event_predict",
    "biotoolsID": "cv_event_predict",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "daijo@fujita-hu.ac.jp",
            "name": "Daijo Inaguma",
            "orcidid": "https://orcid.org/0000-0002-3977-5933",
            "typeEntity": "Person"
        }
    ],
    "description": "Prediction model for cardiovascular events or all-cause mortality in incident dialysis patients | Some variables including age, comorbidity of diabetes, and so on at dialysis initiation are associated with patient prognosis. Cardiovascular (CV) events are a major cause of death, and adequate models that predict prognosis in dialysis patients are warranted. Therefore, we created models using some variables at dialysis initiation. We used a database of 1,520 consecutive dialysis patients (median age, 70 years; 492 women [32.4%]) from a multicenter prospective cohort study. We established the primary endpoint as a composite of the incidence of first CV events or all-cause death. A multivariable Cox proportional hazard regression model was used to construct a model. We considered a complex and a simple model",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Incident curve plotting",
                    "uri": "http://edamontology.org/operation_3503"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "https://statacademy.shinyapps.io/App_inaguma_20190717/",
    "language": [
        "R"
    ],
    "lastUpdate": "2020-12-09T13:03:54Z",
    "name": "CV event predict",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PONE.0221352",
            "metadata": {
                "abstract": "© 2019 Inaguma et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Some variables including age, comorbidity of diabetes, and so on at dialysis initiation are associated with patient prognosis. Cardiovascular (CV) events are a major cause of death, and adequate models that predict prognosis in dialysis patients are warranted. Therefore, we created models using some variables at dialysis initiation. We used a database of 1,520 consecutive dialysis patients (median age, 70 years; 492 women [32.4%]) from a multicenter prospective cohort study. We established the primary endpoint as a composite of the incidence of first CV events or all-cause death. A multivariable Cox proportional hazard regression model was used to construct a model. We considered a complex and a simple model. We used area under the receiver operating characteristic curve (AUROC) to assess and compare the predictive performances of the prediction models and evaluated the improvement in discrimination using the complex model versus the simple model using net reclassification improvement (NRI). We then assessed integrated discrimination improvement (IDI) to evaluate improvements in average sensitivity and specificity. Of 392 deaths, 152 were CV-related. Totally, 506 CV events occurred during the follow-up period (median 1,285 days). Finally, 692 patients reached the primary endpoint. Baseline data were set at dialysis initiation. AUROC for the primary endpoint was 0.737 (95% confidence interval [CI], 0.712–0.761) in the simple model and 0.765 (95% CI, 0.741–0.788) in the complex model. There were significant intergroup differences in NRI (0.44; 95% CI, 0.34–0.53; p < 0.001) and IDI (0.02; 95% CI, 0.02–0.03; p < 0.001). We prepared a Shiny R application for each model to automatically calculate the predicted occurrence probability (https://statacademy.shinyapps.io/App_inaguma_20190717/). The complex model made more accurate predictions than the simple model. However, the intergroup difference was not significant. Hence, the simple model was more useful than the complex model. The tool was useful in a real-world clinical setting because it required only routinely available variables. Moreover, we emphasized that the tool could predict the incidence of CV events or all-cause mortality for individual patients. In the future, we must confirm its external validity in other prospective cohorts.",
                "authors": [
                    {
                        "name": "Inaguma D."
                    },
                    {
                        "name": "Morii D."
                    },
                    {
                        "name": "Kabata D."
                    },
                    {
                        "name": "Yoshida H."
                    },
                    {
                        "name": "Tanaka A."
                    },
                    {
                        "name": "Koshi-Ito E."
                    },
                    {
                        "name": "Takahashi K."
                    },
                    {
                        "name": "Hayashi H."
                    },
                    {
                        "name": "Koide S."
                    },
                    {
                        "name": "Tsuboi N."
                    },
                    {
                        "name": "Hasegawa M."
                    },
                    {
                        "name": "Shintani A."
                    },
                    {
                        "name": "Yuzawa Y."
                    }
                ],
                "citationCount": 1,
                "date": "2019-08-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "Prediction model for cardiovascular events or all-cause mortality in incident dialysis patients"
            },
            "pmcid": "PMC6705850",
            "pmid": "31437231"
        }
    ],
    "topic": [
        {
            "term": "Cardiology",
            "uri": "http://edamontology.org/topic_3335"
        },
        {
            "term": "Geriatric medicine",
            "uri": "http://edamontology.org/topic_3399"
        },
        {
            "term": "Urology and nephrology",
            "uri": "http://edamontology.org/topic_3422"
        }
    ],
    "validated": 1
}