{
    "additionDate": "2017-01-13T13:14:12Z",
    "biotoolsCURIE": "biotools:cptra",
    "biotoolsID": "cptra",
    "description": "Integrated transcriptome analysis from Sanger, 454, Solexa, SOLiD, etc reads.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                },
                {
                    "term": "RNA-Seq quantification",
                    "uri": "http://edamontology.org/operation_3800"
                },
                {
                    "term": "Sequence tag mapping",
                    "uri": "http://edamontology.org/operation_0527"
                }
            ]
        }
    ],
    "homepage": "https://www.mybiosoftware.com/cptra-20090207-cross-platform-transcriptome-analysis.html",
    "language": [
        "Python"
    ],
    "lastUpdate": "2019-07-13T14:32:20Z",
    "name": "CPTRA",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "seqwiki_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Background: Next-generation sequencing techniques enable several novel transcriptome profiling approaches. Recent studies indicated that digital gene expression profiling based on short sequence tags has superior performance as compared to other transcriptome analysis platforms including microarrays. However, the transcriptomic analysis with tag-based methods often depends on available genome sequence. The use of tag-based methods in species without genome sequence should be complemented by other methods such as cDNA library sequencing. The combination of different next generation sequencing techniques like 454 pyrosequencing and Illumina Genome Analyzer (Solexa) will enable high-throughput and accurate global gene expression profiling in species with limited genome information. The combination of transcriptome data acquisition methods requires cross-platform transcriptome data analysis platforms, including a new software package for data processing. Results: Here we presented a software package, CPTRA: Cross-Platform TRanscriptome Analysis, to analyze transcriptome profiling data from separate methods. The software package is available at http://people.tamu.edu/~syuan/cptra/cptra.html. It was applied to the case study of non-target site glyphosate resistance in horseweed; and the data was mined to discover resistance target gene(s). For the software, the input data included a long-read sequence dataset with proper annotation, and a short-read sequence tag dataset for the quantification of transcripts. By combining the two datasets, the software carries out the unique sequence tag identification, tag counting for transcript quantification, and cross-platform sequence matching functions, whereby the short sequence tags can be annotated with a function, level of expression, and Gene Ontology (GO) classification. Multiple sequence search algorithms were implemented and compared. The analysis highlighted the importance of transport genes in glyphosate resistance and identified several candidate genes for down-stream analysis. Conclusion: CPTRA is a powerful software package for next generation sequencing-based transcriptome profiling in species with limited genome information. According to our case study, the strategy can greatly broaden the application of the next generation sequencing for transcriptome analysis in species without reference genome sequence. © 2009 Zhou et al; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Peng Y."
                    },
                    {
                        "name": "Sammons R.D."
                    },
                    {
                        "name": "Stewart Jr C.N."
                    },
                    {
                        "name": "Su Z."
                    },
                    {
                        "name": "Tranel P.J."
                    },
                    {
                        "name": "Yuan J.S."
                    },
                    {
                        "name": "Zhou X."
                    }
                ],
                "citationCount": 17,
                "date": "2009-10-08T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Novel software package for cross-platform transcriptome analysis (CPTRA)"
            },
            "pmid": "19811681"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "RNA-seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ],
    "validated": 1
}
