{
    "name": "eTBLAST", 
    "description": "Textual similarity search engine. This server can parse and summarize the results of an abstract similarity search to find appropriate journals for publication, authors with expertise in a given field, and documents similar to a submitted query.", 
    "homepage": "http://etest.vbi.vt.edu/etblast3/", 
    "biotoolsID": "etblast", 
    "biotoolsCURIE": "biotools:etblast", 
    "version": [], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_2421", 
                    "term": "Database search"
                }, 
                {
                    "uri": "http://edamontology.org/operation_2409", 
                    "term": "Data handling"
                }, 
                {
                    "uri": "http://edamontology.org/operation_0360", 
                    "term": "Structural similarity search"
                }, 
                {
                    "uri": "http://edamontology.org/operation_0224", 
                    "term": "Query and retrieval"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Web application"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_0218", 
            "term": "Natural language processing"
        }, 
        {
            "uri": "http://edamontology.org/topic_3068", 
            "term": "Literature and language"
        }
    ], 
    "operatingSystem": [], 
    "language": [], 
    "license": null, 
    "collectionID": [], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [], 
    "download": [], 
    "documentation": [], 
    "publication": [
        {
            "doi": null, 
            "pmid": "16926219", 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "Text similarity: An alternative way to search MEDLINE", 
                "abstract": "Motivation: The most widely used literature search techniques, such as those offered by NCBI's PubMed system, require significant effort on the part of the searcher, and inexperienced searchers do not use these systems as effectively as experienced users. Improved literature search engines can save researchers time and effort by making it easier to locate the most important and relevant literature. Results: We have created and optimized a new, hybrid search system for Medline that takes natural text as input and then delivers results with high precision and recall. The combination of a fast, low-sensitivity weighted keyword-based first pass algorithm to cast a wide net to gather an initial set of literature, followed by a unique sentence-alignment based similarity algorithm to rank order those results was developed that is sensitive, fast and easy to use. Several text similarity search algorithms, both standard and novel, were implemented and tested in order to determine which obtained the best results in information retrieval exercises. © 2006 Oxford University Press.", 
                "date": "2006-09-15T00:00:00Z", 
                "citationCount": 69, 
                "authors": [
                    {
                        "name": "Lewis J."
                    }, 
                    {
                        "name": "Ossowski S."
                    }, 
                    {
                        "name": "Hicks J."
                    }, 
                    {
                        "name": "Errami M."
                    }, 
                    {
                        "name": "Garner H.R."
                    }
                ], 
                "journal": "Bioinformatics"
            }
        }, 
        {
            "doi": null, 
            "pmid": "17452348", 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "ETBLAST: A web server to identify expert reviewers, appropriate journals and similar publications", 
                "abstract": "Authors, editors and reviewers alike use the biomedical literature to identify appropriate journals in which to publish, potential reviewers for papers or grants, and collaborators (or competitors) with similar interests. Traditionally, this process has either relied upon personal expertise and knowledge or upon a somewhat unsystematic and laborious process of manually searching through the literature for trends. To help with these tasks, we report three utilities that parse and summarize the results of an abstract similarity search to find appropriate journals for publication, authors with expertise in a given field, and documents similar to a submitted query. The utilities are based upon a program, eTBLAST, designed to identify similar documents within literature databases such as (but not limited to) MEDLINE. These services are freely accessible through the Internet at http://invention.swmed.edu/etblast/ etblast.shtml, where users can upload a file or paste text such as an abstract into the browser interface. © 2007 The Author(s).", 
                "date": "2007-07-01T00:00:00Z", 
                "citationCount": 46, 
                "authors": [
                    {
                        "name": "Errami M."
                    }, 
                    {
                        "name": "Wren J.D."
                    }, 
                    {
                        "name": "Hicks J.M."
                    }, 
                    {
                        "name": "Garner H.R."
                    }
                ], 
                "journal": "Nucleic Acids Research"
            }
        }
    ], 
    "credit": [], 
    "owner": "ELIXIR-EE", 
    "additionDate": "2017-03-24T11:45:04Z", 
    "lastUpdate": "2018-12-10T12:58:40Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 1, 
    "homepage_status": 1, 
    "elixir_badge": 0
}