{
    "additionDate": "2019-11-14T19:45:29Z",
    "biotoolsCURIE": "biotools:Transitivity",
    "biotoolsID": "Transitivity",
    "confidence_flag": "tool",
    "description": "A Code for Computing Kinetic and Related Parameters in Chemical Transformations and Transport Phenomena | Recent advances in phenomenological descriptions of the kinetics of rate processes (Aquilanti et al., 2010, 2017, 2018) motivated this code based on detailed formulations given in previous works | Theoretical and Computational Chemistry",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Enzyme kinetics calculation",
                    "uri": "http://edamontology.org/operation_0334"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "http://www.vhcsgroup.com/transitivity",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-12-30T15:08:31Z",
    "name": "Transitivity",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.3390/MOLECULES24193478",
            "metadata": {
                "abstract": "© 2019 by the authors.The Transitivity function, defined in terms of the reciprocal of the apparent activation energy, measures the propensity for a reaction to proceed and can provide a tool for implementing phenomenological kinetic models. Applications to systems which deviate from the Arrhenius law at low temperature encouraged the development of a user-friendly graphical interface for estimating the kinetic and thermodynamic parameters of physical and chemical processes. Here, we document the Transitivity code, written in Python, a free open-source code compatible with Windows, Linux and macOS platforms. Procedures are made available to evaluate the phenomenology of the temperature dependence of rate constants for processes from the Arrhenius and Transitivity plots. Reaction rate constants can be calculated by the traditional Transition-State Theory using a set of one-dimensional tunneling corrections (Bell (1935), Bell (1958), Skodje and Truhlar and, in particular, the deformed (d-TST) approach). To account for the solvent effect on reaction rate constant, implementation is given of the Kramers and of Collins–Kimball formulations. An input file generator is provided to run various molecular dynamics approaches in CPMD code. Examples are worked out and made available for testing. The novelty of this code is its general scope and particular exploit of d-formulations to cope with non-Arrhenius behavior at low temperatures, a topic which is the focus of recent intense investigations. We expect that this code serves as a quick and practical tool for data documentation from electronic structure calculations: It presents a very intuitive graphical interface which we believe to provide an excellent working tool for researchers and as courseware to teach statistical thermodynamics, thermochemistry, kinetics, and related areas.",
                "authors": [
                    {
                        "name": "Machado H.G."
                    },
                    {
                        "name": "Sanches-Neto F.O."
                    },
                    {
                        "name": "Coutinho N.D."
                    },
                    {
                        "name": "Mundim K.C."
                    },
                    {
                        "name": "Palazzetti F."
                    },
                    {
                        "name": "Carvalho-Silva V.H."
                    }
                ],
                "citationCount": 7,
                "date": "2019-09-25T00:00:00Z",
                "journal": "Molecules",
                "title": "“Transitivity”: A code for computing kinetic and related parameters in chemical transformations and transport phenomena"
            },
            "pmid": "31557893"
        }
    ],
    "topic": [
        {
            "term": "Chemistry",
            "uri": "http://edamontology.org/topic_3314"
        },
        {
            "term": "Enzymes",
            "uri": "http://edamontology.org/topic_0821"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        }
    ],
    "validated": 1
}