{
    "additionDate": "2018-05-23T15:15:02Z",
    "biotoolsCURIE": "biotools:testdose",
    "biotoolsID": "testdose",
    "credit": [
        {
            "email": "manuel.bardies@inserm.fr",
            "name": "M. Bardies",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "l-ferrer@nantes.fnclcc.fr",
            "name": "L. Ferrer",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "daphnee.villoing@inserm.fr",
            "name": "D. Villoing",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Nuclear medicine software based on Monte Carlo modeling for generating gamma camera acquisitions and dosimetry.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://dositest.fr/overview.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                }
            ]
        }
    ],
    "homepage": "http://www.dositest.com/",
    "lastUpdate": "2018-12-10T12:58:58Z",
    "name": "TestDose",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1118/1.4934828",
            "metadata": {
                "abstract": "© 2015 American Association of Physicists in Medicine. Purpose: The TestDose platform was developed to generate scintigraphic imaging protocols and associated dosimetry by Monte Carlo modeling. TestDose is part of a broader project (www.dositest. com) whose aim is to identify the biases induced by different clinical dosimetry protocols. Methods: The TestDose software allows handling the whole pipeline from virtual patient generation to resulting planar and SPECT images and dosimetry calculations. The originality of their approach relies on the implementation of functional segmentation for the anthropomorphic model representing a virtual patient. Two anthropomorphic models are currently available: 4D XCAT and ICRP 110. A pharmacokinetic model describes the biodistribution of a given radiopharmaceutical in each defined compartment at various time-points. The Monte Carlo simulation toolkit GATE offers the possibility to accurately simulate scintigraphic images and absorbed doses in volumes of interest. The TestDose platform relies on GATE to reproduce precisely any imaging protocol and to provide reference dosimetry. For image generation, TestDose stores user's imaging requirements and generates automatically command files used as input for GATE. Each compartment is simulated only once and the resulting output is weighted using pharmacokinetic data. Resulting compartment projections are aggregated to obtain the final image. For dosimetry computation, emission data are stored in the platform database and relevant GATE input files are generated for the virtual patient model and associated pharmacokinetics. Results: Two samples of software runs are given to demonstrate the potential of TestDose. A clinical imaging protocol for the Octreoscan. therapeutical treatment was implemented using the 4D XCAT model. Whole-body \"step and shoot\" acquisitions at different times postinjection and one SPECT acquisition were generated within reasonable computation times. Based on the same Octreoscan.kinetics, a dosimetry computation performed on the ICRP 110 model is also presented. Conclusions: The proposed platform offers a generic framework to implement any scintigraphic imaging protocols and voxel/organ-based dosimetry computation. Thanks to the modular nature of TestDose, other imaging modalities could be supported in the future such as positron emission tomography.",
                "authors": [
                    {
                        "name": "Garcia M.-P."
                    },
                    {
                        "name": "McKay E."
                    },
                    {
                        "name": "Villoing D."
                    },
                    {
                        "name": "Ferrer L."
                    },
                    {
                        "name": "Cremonesi M."
                    },
                    {
                        "name": "Botta F."
                    },
                    {
                        "name": "Ferrari M."
                    },
                    {
                        "name": "Bardies M."
                    }
                ],
                "citationCount": 5,
                "date": "2015-12-01T00:00:00Z",
                "journal": "Medical Physics",
                "title": "TestDose: A nuclear medicine software based on Monte Carlo modeling for generating gamma camera acquisitions and dosimetry"
            },
            "pmid": "26632045"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "NMR",
            "uri": "http://edamontology.org/topic_0593"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        },
        {
            "term": "Tomography",
            "uri": "http://edamontology.org/topic_3452"
        }
    ],
    "validated": 1
}