{"credit":[{"email":"rokofler@gmail.com","name":"Robert Kofler","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"https://sourceforge.net/p/popoolation/wiki/browse_pages/"}],"function":[{"operation":[{"term":"Genetic variation analysis","uri":"http://edamontology.org/operation_3197"}]}],"labels":{"language":["R","Perl"],"operatingSystem":["Linux","Mac"],"toolType":["Workflow"],"topic":[{"term":"Population genetics","uri":"http://edamontology.org/topic_3056"},{"term":"Genetics","uri":"http://edamontology.org/topic_3053"}]},"publication":[{"abstract":"Recent statistical analyses suggest that sequencing of pooled samples provides a cost effective approach to determine genome-wide population genetic parameters. Here we introduce PoPoolation, a toolbox specifically designed for the population genetic analysis of sequence data from pooled individuals. PoPoolation calculates estimates of θWatterson, θ π, and Tajima's D that account for the bias introduced by pooling and sequencing errors, as well as divergence between species. Results of genome-wide analyses can be graphically displayed in a sliding window plot. PoPoolation is written in Perl and R and it builds on commonly used data formats. Its source code can be downloaded from http://code.google.com/p/popoolation/. Furthermore, we evaluate the influence of mapping algorithms, sequencing errors, and read coverage on the accuracy of population genetic parameter estimates from pooled data © 2011 Kofler et al.","authors":["Kofler R.","Orozco-terWengel P.","de Maio N.","Pandey R.V.","Nolte V.","Futschik A.","Kosiol C.","Schlotterer C."],"cit_count":204,"journal":"PLoS ONE","pmid":"21253599","title":"Popoolation: A toolbox for population genetic analysis of next generation sequencing data from pooled individuals","year":"2011-02-01"}],"summary":{"biotoolsCURIE":"biotools:popoolation","biotoolsID":"popoolation","description":"Toolbox specifically designed for the population genetic analysis of sequence data from pooled individuals.","homepage":"https://sourceforge.net/projects/popoolation/","name":"PoPoolation"}}