{"credit":[],"labels":{"topic":[{"term":"Dermatology","uri":"http://edamontology.org/topic_3404"},{"term":"Allergy, clinical immunology and immunotherapeutics","uri":"http://edamontology.org/topic_3400"},{"term":"Geriatric medicine","uri":"http://edamontology.org/topic_3399"}]},"publication":[{"abstract":"The University of California, Davis, School of Medicine, Department of Dermatology, is recruiting for four academic dermatologists in the Clinical X series or Health Sciences Clinical Professor (HSCP) series at the Assistant/Associate/Full Professor level based on experience and qualifications. These positions are for general medical dermatologists. The appointments may be made up to 100%. Basic Qualifications: Candidates must possess an MD or MD/PhD, can be board eligible, but must be board-certified in dermatology at the time of starting employment and must be eligible for medical licensure in the State of California. • Successful completion of an approved dermatology residency training program (ACGME accredited) • Demonstrated proficiency in the teaching of students and housestaff • Service including committees, leadership ability, and community outreach • Ability to work cooperatively and collegially within a diverse environment • Ability to adhere to policies and procedures, and leadership experience and abilities • Selected candidates will be expected to participate in clinical care, teaching, research and university service Preferred Qualifications: Subspecialty expertise or experience in the following areas of dermatology are not required but would be preferred: hidradenitis suppurativa, cosmetic dermatology, melanoma and atopic dermatitis. For first consideration, applications should be received by September 15, 2019; however, the positions will be open until filled through December 17, 2019. The following information is required: Cover Letter, Curriculum Vitae, contact information for at least 3 references and Statement of Contributions to Diversity. Please visit http://academicaffairs.ucdavis.edu/diversity/equity_inclusion/index.html for information about why diversity statements are requested and guidelines for writing a diversity statement. Please upload this information and apply online at https://recruit.ucdavis.edu/apply/JPF02549. The positions are located in Sacramento, California. The Department of Dermatology (http://www.ucdmc.ucdavis.edu/dermatology) is a major clinical care, research, and teaching department in the School of Medicine. Our faculty are engaged in multiple collaborations with other Schools and UC Davis campus departments, research centers, clinical centers, and primary care networks, and thus all positions require flexibility in local job locations in addition to the Department of Dermatology. This includes the Veteran's Administration, UCD Medical Center Campus, and other community centers. UC Davis commits to inclusion excellence by advancing equity, diversity and inclusion in all that we do. We are an Affirmative Action/Equal Opportunity employer, and particularly encourage applications from members of historically underrepresented racial/ethnic groups, women, individuals with disabilities, veterans, LGBTQ community members, and others who demonstrate the ability to help us achieve our vision of a diverse and inclusive community. For the complete University of California nondiscrimination and affirmative action policy, see: http://policy.ucop.edu/doc/4000376/NondiscrimAffirmAct. If you need accommodation due to a disability, please contact the recruiting department. Under Federal law, the University of California may employ only individuals who are legally able to work in the United States as established by providing documents as specified in the Immigration Reform and Control Act of 1986. Certain UCSC positions funded by federal contracts or sub-contracts require the selected candidates to pass an E-Verify check. More information is available at http://www.uscis.gov/e-verify. UC Davis is a smoke &amp; tobacco-free campus (http://breathefree.ucdavis.edu).","authors":["Department Of Dermatology U.D.S.O.M."],"cit_count":0,"journal":"Dermatology online journal","pmid":"31553870","title":"Advertisement for Assistant/Associate/Full ClinX/HSCP (4 Positions) UC Davis School of Medicine, Department of Dermatology","year":"2019-08-15"}],"summary":{"biotoolsCURIE":"biotools:Dermatology","biotoolsID":"Dermatology","description":"> LOW CONFIDENCE! | > CORRECT NAME OF TOOL COULD ALSO BE 'JPF02549', 'E-Verify', 'Act', 'equity_inclusion' | Advertisement for Assistant/Associate/Full ClinX/HSCP (4 Positions) UC Davis School of Medicine, Department of Dermatology | Our team of board-certified dermatologists treats common conditions such as acne, eczema and skin allergies, as well as complex and uncommon skin disorders | Our Experts in Dermatological Care | Welcome to the Department of Dermatology | Patients throughout the region count on the UC Davis Department of Dermatology to treat their common conditions such as acne, eczema and skin allergies, as well as complex and uncommon skin disorders | Call for an Appointment: 916-734-6111","homepage":"http://www.ucdmc.ucdavis.edu/dermatology","name":"Dermatology"}}