{
    "additionDate": "2021-01-18T12:35:38Z",
    "biotoolsCURIE": "biotools:gcnet",
    "biotoolsID": "gcnet",
    "confidence_flag": "tool",
    "description": "Global Context Networks.\n\nGCNet is initially described in arxiv. Via absorbing advantages of Non-Local Networks (NLNet) and Squeeze-Excitation Networks (SENet), GCNet provides a simple, fast and effective approach for global context modeling, which generally outperforms both NLNet and SENet on major benchmarks for various recognition tasks.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                },
                {
                    "term": "Backbone modelling",
                    "uri": "http://edamontology.org/operation_0479"
                },
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                }
            ]
        }
    ],
    "homepage": "https://github.com/xvjiarui/GCNet",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-01-22T17:57:32Z",
    "license": "Apache-2.0",
    "name": "GCNet",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1109/TPAMI.2020.3047209",
            "metadata": {
                "abstract": "IEEEThe Non-Local Network (NLNet) presents a pioneering approach for capturing long-range dependencies within an image, via aggregating query-specific global context to each query position. However, through a rigorous empirical analysis, we have found that the global contexts modeled by the non-local network are almost the same for different query positions. In this paper, we take advantage of this finding to create a simplified network based on a query-independent formulation, which maintains the accuracy of NLNet but with significantly less computation. We further replace the one layer transformation function by bottlenecked two layers, which further significantly reduce the parameter number. The resulting network element, called the global context (GC) block, effectively models global context in a lightweight manner, allowing it to be applied at multiple layers of a backbone network to form a global context network (GCNet). Experiments show that GCNet generally outperforms NLNet on major benchmarks for various recognition tasks. The code and network configurations are available at \\url{https://github.com/xvjiarui/GCNet}.",
                "authors": [
                    {
                        "name": "Cao Y."
                    },
                    {
                        "name": "Hu H."
                    },
                    {
                        "name": "Lin S."
                    },
                    {
                        "name": "Wei F."
                    },
                    {
                        "name": "Xu J."
                    }
                ],
                "date": "2020-01-01T00:00:00Z",
                "journal": "IEEE Transactions on Pattern Analysis and Machine Intelligence",
                "title": "Global Context Networks"
            },
            "pmid": "33360983"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        }
    ],
    "validated": 1
}
