{
    "additionDate": "2018-05-08T14:52:14Z",
    "biotoolsCURIE": "biotools:selphi",
    "biotoolsID": "selphi",
    "collectionID": [
        "Proteomics"
    ],
    "credit": [
        {
            "email": "epetsalakis@gmail.com",
            "name": "Support",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Correlation-based identification of kinase-associated networks from global phospho-proteomics data sets.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://rothwebprod.mshri.on.ca:8081/docs"
        }
    ],
    "editPermission": {
        "authors": [
            "proteomics.bio.tools"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Pathway or network analysis",
                    "uri": "http://edamontology.org/operation_2497"
                }
            ]
        }
    ],
    "homepage": "http://rothwebprod.mshri.on.ca:8081/",
    "lastUpdate": "2019-03-26T08:38:22Z",
    "name": "SELPHI",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1093/NAR/GKV459",
            "metadata": {
                "abstract": "© 2015 The Author(s).While phospho-proteomics studies have shed light on the dynamics of cellular signaling, they mainly describe global effects and rarely explore mechanistic details, such as kinase/substrate relationships. Tools and databases, such as NetworKIN and PhosphoSitePlus, provide valuable regulatory details on signaling networks but rely on prior knowledge. They therefore provide limited information on less studied kinases and fewer unexpected relationships given that better studied signaling events can mask condition- or cell-specific 'network wiring'. SELPHI is a web-based tool providing in-depth analysis of phospho-proteomics data that is intuitive and accessible to non-bioinformatics experts. It uses correlation analysis of phospho-sites to extract kinase/phosphatase and phospho-peptide associations, and highlights the potential flow of signaling in the system under study. We illustrate SELPHI via analysis of phospho-proteomics data acquired in the presence of erlotinib-a tyrosine kinase inhibitor (TKI)-in cancer cells expressing TKIresistant and -sensitive variants of the Epidermal Growth Factor Receptor. In this data set, SELPHI revealed information overlooked by the reporting study, including the known role of MET and EPHA2 kinases in conferring resistance to erlotinib in TKI sensitive strains. SELPHI can significantly enhance the analysis of phospho-proteomics data contributing to improved understanding of sample-specific signaling networks. SELPHI is freely available via http://llama.mshri.on.ca/SELPHI.",
                "authors": [
                    {
                        "name": "Petsalaki E."
                    },
                    {
                        "name": "Helbig A.O."
                    },
                    {
                        "name": "Gopal A."
                    },
                    {
                        "name": "Pasculescu A."
                    },
                    {
                        "name": "Roth F.P."
                    },
                    {
                        "name": "Pawson T."
                    }
                ],
                "citationCount": 13,
                "date": "2015-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "SELPHI: Correlation-based identification of kinase-associated networks from global phospho-proteomics data sets"
            },
            "pmcid": "PMC4489257",
            "pmid": "25948583"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Enzymes",
            "uri": "http://edamontology.org/topic_0821"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ],
    "validated": 1
}