{
    "additionDate": "2021-01-18T10:01:39Z",
    "biotoolsCURIE": "biotools:crisprland",
    "biotoolsID": "crisprland",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "kannanr@eecs.berkeley.edu",
            "name": "Kannan Ramchandran",
            "typeEntity": "Person"
        }
    ],
    "description": "CRISPRLand, relies on an unexploited observation about the nature of the repair process: the landscape of the DNA repair is highly sparse in the (Walsh–Hadamard) spectral domain. This observation enables our framework to address key shortcomings that limit the interpretability and scaling of current deep-learning-based DNA repair models. In particular. ur proposed framework is based on a divide-and-conquer strategy that uses a fast peeling algorithm to learn the DNA repair models. CRISPRLand captures lower-degree features around the cut site, which enrich for short insertions and deletions as well as higher-degree microhomology patterns that enrich for longer deletions.",
    "editPermission": {
        "type": "private"
    },
    "homepage": "https://github.com/UCBASiCS/CRISPRLand",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-02-18T15:37:03Z",
    "name": "CRISPRLand",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAA505",
            "metadata": {
                "abstract": "© The Author(s) 2020. Published by Oxford University Press.We propose a new spectral framework for reliable training, scalable inference and interpretable explanation of the DNA repair outcome following a Cas9 cutting. Our framework, dubbed CRISPRLAND, relies on an unexploited observation about the nature of the repair process: the landscape of the DNA repair is highly sparse in the (Walsh-Hadamard) spectral domain. This observation enables our framework to address key shortcomings that limit the interpretability and scaling of current deep-learning-based DNA repair models. In particular, CRISPRLAND reduces the time to compute the full DNA repair landscape from a striking 5230 years to 1 week and the sampling complexity from 1012 to 3 million guide RNAs with only a small loss in accuracy (R2R2 ∼ 0.9). Our proposed framework is based on a divide-and-conquer strategy that uses a fast peeling algorithm to learn the DNA repair models. CRISPRLAND captures lower-degree features around the cut site, which enrich for short insertions and deletions as well as higher-degree microhomology patterns that enrich for longer deletions.",
                "authors": [
                    {
                        "name": "Aghazadeh A."
                    },
                    {
                        "name": "Ocal O."
                    },
                    {
                        "name": "Ramchandran K."
                    }
                ],
                "date": "2020-01-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "CRISPRLAND: Interpretable large-scale inference of DNA repair landscape based on a spectral approach"
            },
            "pmcid": "PMC7355252",
            "pmid": "32657417"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        }
    ]
}
