{
    "additionDate": "2020-01-14T19:41:58Z",
    "biotoolsCURIE": "biotools:perfectphyloR",
    "biotoolsID": "perfectphyloR",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "jgraham@sfu.ca",
            "name": "Jinko Graham",
            "typeEntity": "Person"
        }
    ],
    "description": "An R package for reconstructing perfect phylogenies.\n\nReconstruct Perfect Phylogenies from DNA Sequence Data.\n\nThe R package perfectphyloR reconstructs perfect phylogenies underlying a sample of DNA sequences, at a focal single-nucleotide variant (SNV). A perfect phylogeny is a rooted binary tree that recursively partitions DNA sequences. Their nested partition structures provide insight into the pattern of ancestry of DNA sequence data. For example, disease sequences may cluster together in a local partition indicating that they arise from a common ancestral haplotypes. Therefore, the availability of an R package that reconstructs perfect phylogenies should be useful to researchers seeking the ancestral structure of their sequence data",
    "download": [
        {
            "type": "Source code",
            "url": "https://github.com/cbhagya/perfectphyloR/tree/master/data"
        }
    ],
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Dendrogram visualisation",
                    "uri": "http://edamontology.org/operation_2938"
                },
                {
                    "term": "Ancestral reconstruction",
                    "uri": "http://edamontology.org/operation_3745"
                }
            ]
        }
    ],
    "homepage": "https://github.com/cbhagya/perfectphyloR/",
    "language": [
        "R",
        "C++"
    ],
    "lastUpdate": "2020-12-02T09:44:33.173879Z",
    "name": "perfectphyloR",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12859-019-3313-4",
            "metadata": {
                "abstract": "© 2019 Karunarathna and Graham.Background: A perfect phylogeny is a rooted binary tree that recursively partitions sequences. The nested partitions of a perfect phylogeny provide insight into the pattern of ancestry of genetic sequence data. For example, sequences may cluster together in a partition indicating that they arise from a common ancestral haplotype. Results: We present an R package perfectphyloR to reconstruct the local perfect phylogenies underlying a sample of binary sequences. The package enables users to associate the reconstructed partitions with a user-defined partition. We describe and demonstrate the major functionality of the package. Conclusion: The perfectphyloR package should be of use to researchers seeking insight into the ancestral structure of their sequence data. The reconstructed partitions have many applications, including the mapping of trait-influencing variants.",
                "authors": [
                    {
                        "name": "Karunarathna C.B."
                    },
                    {
                        "name": "Graham J."
                    }
                ],
                "date": "2019-12-23T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "PerfectphyloR: An R package for reconstructing perfect phylogenies"
            },
            "pmcid": "PMC6929499",
            "pmid": "31870286"
        }
    ],
    "topic": [
        {
            "term": "Phylogeny",
            "uri": "http://edamontology.org/topic_0084"
        },
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        }
    ]
}