{
    "accessibility": "Open access",
    "additionDate": "2022-02-06T15:37:17.946897Z",
    "biotoolsCURIE": "biotools:brain_uk",
    "biotoolsID": "brain_uk",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "j.nicoll@soton.ac.uk",
            "name": "James A. R. Nicoll",
            "orcidid": "https://orcid.org/0000-0002-9444-7246"
        }
    ],
    "description": "Accessing NHS tissue archives for neuroscience research.",
    "editPermission": {
        "type": "public"
    },
    "homepage": "http://www.brain-uk.org",
    "lastUpdate": "2022-02-06T15:37:17.949777Z",
    "name": "BRAIN UK",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1111/NAN.12766",
            "metadata": {
                "abstract": "© 2021 The Authors. Neuropathology and Applied Neurobiology published by John Wiley & Sons Ltd on behalf of British Neuropathological Society.The purpose of BRAIN UK (the UK BRain Archive Information Network) is to make the very extensive and comprehensive National Health Service (NHS) Neuropathology archives available to the national and international neuroscience research community. The archives comprise samples of tumours and a wide range of other neurological disorders, not only from the brain but also spinal cord, peripheral nerve, muscle, eye and other organs when relevant. BRAIN UK was founded after the recognition of the importance of this large tissue resource, which was not previously readily accessible for research use. BRAIN UK has successfully engaged the majority of the regional clinical neuroscience centres in the United Kingdom to produce a centralised database of the extensive autopsy and biopsy archive. Together with a simple application process and its broad ethical approval, BRAIN UK offers researchers easy access to most of the national archives of neurological tissues and tumours (http://www.brain-uk.org). The range of tissues available reflects the spectrum of disease in society, including many conditions not covered by disease-specific brain banks, and also allows relatively large numbers of cases of uncommon conditions to be studied. BRAIN UK has supported 141 studies (2010–2020) that have generated 70 publications employing methodology as diverse as morphometrics, genetics, proteomics and methylomics. Tissue samples that would otherwise have been unused have supported valuable neuroscience research. The importance of this unique resource will only increase as molecular techniques applicable to human tissues continue to develop and technical advances permit large-scale high-throughput studies.",
                "authors": [
                    {
                        "name": "Bloom T."
                    },
                    {
                        "name": "Boche D."
                    },
                    {
                        "name": "Clarke A."
                    },
                    {
                        "name": "Hilton D."
                    },
                    {
                        "name": "Nicoll J.A.R."
                    }
                ],
                "date": "2021-01-01T00:00:00Z",
                "journal": "Neuropathology and Applied Neurobiology",
                "title": "BRAIN UK: Accessing NHS tissue archives for neuroscience research"
            },
            "pmid": "34528715"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Neurobiology",
            "uri": "http://edamontology.org/topic_3304"
        },
        {
            "term": "Neurology",
            "uri": "http://edamontology.org/topic_3334"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        }
    ],
    "validated": 1
}
