{"credit":[{"typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://www.bioinf.uni-freiburg.de/"}],"documentation":[{"type":"GENERAL","url":"http://www.bioinf.uni-freiburg.de/Software/GraphClust/README"}],"function":[{"operation":[{"term":"Clustering","uri":"http://edamontology.org/operation_3432"}]}],"labels":{"operatingSystem":["Linux","Mac"],"toolType":["Command-line tool"],"topic":[{"term":"Sequences","uri":"http://edamontology.org/topic_0080"},{"term":"RNA","uri":"http://edamontology.org/topic_0099"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/graphclust-0-7-4-structural-clustering-local-rna-secondary-structures.html"}],"publication":[{"abstract":"Motivation: Clustering according to sequence-structure similarity has now become a generally accepted scheme for ncRNA annotation. Its application to complete genomic sequences as well as whole transcriptomes is therefore desirable but hindered by extremely high computational costs. Results: We present a novel linear-time, alignment-free method for comparing and clustering RNAs according to sequence and structure. The approach scales to datasets of hundreds of thousands of sequences. The quality of the retrieved clusters has been benchmarked against known ncRNA datasets and is comparable to state-of-the-art sequence-structure methods although achieving speedups of several orders of magnitude. A selection of applications aiming at the detection of novel structural ncRNAs are presented. Exemplarily, we predicted local structural elements specific to lincRNAs likely functionally associating involved transcripts to vital processes of the human nervous system. In total, we predicted 349 local structural RNA elements. © The Author(s) 2012.","authors":["Heyne S.","Costa F.","Rose D.","Backofen R."],"cit_count":35,"doi":"10.1093/bioinformatics/bts224","journal":"Bioinformatics","title":"Graphclust: Alignment-free structural clustering of local RNA secondary structures","type":"Primary","year":"2012-06-01"}],"summary":{"biotoolsCURIE":"biotools:graphclust","biotoolsID":"graphclust","description":"GraphClust can be used for structural clustering of RNA sequences. Especially it can be used for clustering of very large dataset with thousands of RNAs.","homepage":"http://www.bioinf.uni-freiburg.de/Software/GraphClust/","name":"GraphClust","version":["0.7.6"]}}