{
    "additionDate": "2017-12-18T00:05:39Z",
    "biotoolsCURIE": "biotools:dnaclust",
    "biotoolsID": "dnaclust",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://cbcb.umd.edu/"
        }
    ],
    "description": "DNACLUST is a tool for clustering millions of short DNA sequences. The clusters are created in such a way that the “radius” of each clusters is no more than the specified threshold.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://dnaclust.sourceforge.net/manpage.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                }
            ]
        }
    ],
    "homepage": "http://dnaclust.sourceforge.net/",
    "language": [
        "C++"
    ],
    "lastUpdate": "2018-12-10T12:58:57Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/dnaclust-r1-cluster-millions-short-dna-sequences.html"
        }
    ],
    "name": "DNACLUST",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1186/1471-2105-12-271",
            "metadata": {
                "abstract": "Background: Clustering is a fundamental operation in the analysis of biological sequence data. New DNA sequencing technologies have dramatically increased the rate at which we can generate data, resulting in datasets that cannot be efficiently analyzed by traditional clustering methods.This is particularly true in the context of taxonomic profiling of microbial communities through direct sequencing of phylogenetic markers (e.g. 16S rRNA) - the domain that motivated the work described in this paper. Many analysis approaches rely on an initial clustering step aimed at identifying sequences that belong to the same operational taxonomic unit (OTU). When defining OTUs (which have no universally accepted definition), scientists must balance a trade-off between computational efficiency and biological accuracy, as accurately estimating an environment's phylogenetic composition requires computationally-intensive analyses. We propose that efficient and mathematically well defined clustering methods can benefit existing taxonomic profiling approaches in two ways: (i) the resulting clusters can be substituted for OTUs in certain applications; and (ii) the clustering effectively reduces the size of the data-sets that need to be analyzed by complex phylogenetic pipelines (e.g., only one sequence per cluster needs to be provided to downstream analyses).Results: To address the challenges outlined above, we developed DNACLUST, a fast clustering tool specifically designed for clustering highly-similar DNA sequences.Given a set of sequences and a sequence similarity threshold, DNACLUST creates clusters whose radius is guaranteed not to exceed the specified threshold. Underlying DNACLUST is a greedy clustering strategy that owes its performance to novel sequence alignment and k-mer based filtering algorithms.DNACLUST can also produce multiple sequence alignments for every cluster, allowing users to manually inspect clustering results, and enabling more detailed analyses of the clustered data.Conclusions: We compare DNACLUST to two popular clustering tools: CD-HIT and UCLUST. We show that DNACLUST is about an order of magnitude faster than CD-HIT and UCLUST (exact mode) and comparable in speed to UCLUST (approximate mode). The performance of DNACLUST improves as the similarity threshold is increased (tight clusters) making it well suited for rapidly removing duplicates and near-duplicates from a dataset, thereby reducing the size of the data being analyzed through more elaborate approaches. © 2011 Ghodsi et al; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Ghodsi M."
                    },
                    {
                        "name": "Liu B."
                    },
                    {
                        "name": "Pop M."
                    }
                ],
                "citationCount": 111,
                "date": "2011-06-30T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "DNACLUST: Accurate and efficient clustering of phylogenetic marker genes"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Sequences",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        }
    ],
    "validated": 1,
    "version": [
        "r3"
    ]
}