{
    "additionDate": "2017-08-03T18:53:06Z",
    "biotoolsCURIE": "biotools:orman",
    "biotoolsID": "orman",
    "credit": [
        {
            "email": "cenk@cs.sfu.ca",
            "name": "S. Cenk Sahinalp",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://compbio.cs.sfu.ca/"
        }
    ],
    "description": "Tool for resolving multi-mappings within an RNA-Seq SAM file.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://sfu-compbio.github.io/orman/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Prediction and recognition",
                    "uri": "http://edamontology.org/operation_2423"
                }
            ]
        }
    ],
    "homepage": "http://sfu-compbio.github.io/orman/",
    "lastUpdate": "2018-12-10T12:58:45Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/orman-1-2-optimal-resolution-of-ambiguous-rna-seq-multi-mappings-in-the-presence-of-novel-isoforms.html"
        }
    ],
    "name": "ORMAN",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Motivation: RNA-Seq technology is promising to uncover many novel alternative splicing events, gene fusions and other variations in RNA transcripts. For an accurate detection and quantification of transcripts, it is important to resolve the mapping ambiguity for those RNA-Seq reads that can be mapped to multiple loci:417% of the reads from mouse RNA-Seq data and 50% of the reads from some plant RNASeq data have multiple mapping loci. In this study, we show how to resolve the mapping ambiguity in the presence of novel transcriptomic events such as exon skipping and novel indels towards accurate downstream analysis. We introduce ORMAN (Optimal Resolution of Multimapping Ambiguity of RNASeq Reads), which aims to compute the minimum number of potential transcript products for each gene and to assign each multimapping read to one of these transcripts based on the estimated distribution of the region covering the read. ORMAN achieves this objective through a combinatorial optimization formulation, which is solved through wellknown approximation algorithms, integer linear programs and heuristics. Results: On a simulated RNA-Seq dataset including a random subset of transcripts from the UCSC database, the performance of several state-of-the-art methods for identifying and quantifying novel transcripts, such as Cufflinks, IsoLasso and CLIIQ, is significantly improved through the use of ORMAN. Furthermore, in an experiment using real RNA-Seq reads, we show that ORMAN is able to resolve multimapping to produce coverage values that are similar to the original distribution, even in genes with highly nonuniform coverage. © 2013 The Author 2013. Published by Oxford University Press. All rights reserved.",
                "authors": [
                    {
                        "name": "Dao P."
                    },
                    {
                        "name": "Numanagic I."
                    },
                    {
                        "name": "Lin Y.-Y."
                    },
                    {
                        "name": "Hach F."
                    },
                    {
                        "name": "Karakoc E."
                    },
                    {
                        "name": "Donmez N."
                    },
                    {
                        "name": "Collins C."
                    },
                    {
                        "name": "Eichler E.E."
                    },
                    {
                        "name": "Sahinalp S.C."
                    }
                ],
                "citationCount": 6,
                "date": "2014-03-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "ORMAN: Optimal resolution of ambiguous RNA-Seq multimappings in the presence of novel isoforms"
            },
            "pmid": "24130305"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ],
    "validated": 1
}