{
    "accessibility": "Open access",
    "additionDate": "2019-07-04T15:03:29Z",
    "biotoolsCURIE": "biotools:GlycanFormatConverter",
    "biotoolsID": "GlycanFormatConverter",
    "cost": "Free of charge",
    "description": "Conversion tool for translating the complexities of glycans.",
    "editPermission": {
        "type": "private"
    },
    "homepage": "https://github.com/glycoinfo/GlycanFormatConverter",
    "language": [
        "Java"
    ],
    "lastUpdate": "2020-06-16T10:55:23Z",
    "license": "GPL-2.0",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/glycoinfo/GlycanFormatConverter/issues"
        }
    ],
    "maturity": "Mature",
    "name": "GlycanFormatConverter",
    "operatingSystem": [
        "Mac"
    ],
    "owner": "Ruta",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/bty990",
            "metadata": {
                "abstract": "© 2018 The Author(s) 2018. Published by Oxford University Press.Motivation: Glycans are biomolecules that take an important role in the biological processes of living organisms. They form diverse, complicated structures such as branched and cyclic forms. Web3 Unique Representation of Carbohydrate Structures (WURCS) was proposed as a new linear notation for uniquely representing glycans during the GlyTouCan project. WURCS defines rules for complex glycan structures that other text formats did not support, and so it is possible to represent a wide variety glycans. However, WURCS uses a complicated nomenclature, so it is not human-readable. Therefore, we aimed to support the interpretation of WURCS by converting WURCS to the most basic and widely used format IUPAC. Results: In this study, we developed GlycanFormatConverter and succeeded in converting WURCS to the three kinds of IUPAC formats (IUPAC-Extended, IUPAC-Condensed and IUPAC-Short). Furthermore, we have implemented functionality to import IUPAC-Extended, KEGG Chemical Function (KCF) and LinearCode formats and to export WURCS. We have thoroughly tested our GlycanFormatConverter and were able to show that it was possible to convert all the glycans registered in the GlyTouCan repository, with exceptions owing only to the limitations of the original format. The source code for this conversion tool has been released as an open source tool.",
                "authors": [
                    {
                        "name": "Tsuchiya S."
                    },
                    {
                        "name": "Yamada I."
                    },
                    {
                        "name": "Aoki-Kinoshita K.F."
                    }
                ],
                "citationCount": 7,
                "date": "2019-07-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "GlycanFormatConverter: A conversion tool for translating the complexities of glycans"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Carbohydrates",
            "uri": "http://edamontology.org/topic_0152"
        },
        {
            "term": "Protein expression",
            "uri": "http://edamontology.org/topic_0108"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ],
    "validated": 1
}