{
    "additionDate": "2021-11-29T08:02:29.381683Z",
    "biotoolsCURIE": "biotools:ptmviz",
    "biotoolsID": "ptmviz",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "sbyrum@uams.edu",
            "name": "Stephanie D. Byrum",
            "orcidid": "https://orcid.org/0000-0002-1783-3610",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "PTMViz is a tool for analyzing and visualizing histone post translational modification data. PTMViz is a histone post tranliastional modification analysis tool built within the shiny graphical user interface of the R programming language. Within PTMViz the user can create figures and scrutinize thier data using one of two functions: Protein) The protein function lets the user view thier data in an interactive volcano plot and heatmap as well as a provided data table of its differential analysis results, and PTM) The PTM function will return an interactive data table, barachart figures, and a differential analysis of the provided histone ptm data.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "PTM identification",
                    "uri": "http://edamontology.org/operation_3645"
                },
                {
                    "term": "PTM site prediction",
                    "uri": "http://edamontology.org/operation_0417"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://github.com/ByrumLab/PTMViz",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-11-29T08:02:29.384127Z",
    "license": "Apache-2.0",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/ByrumLab/PTMViz/issues"
        }
    ],
    "name": "PTMViz",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1186/S12859-021-04166-9",
            "metadata": {
                "abstract": "© 2021, The Author(s).Background: Histone post-translational modifications (PTMs) play an important role in our system by regulating the structure of chromatin and therefore contribute to the regulation of gene and protein expression. Irregularities in histone PTMs can lead to a variety of different diseases including various forms of cancer. Histone modifications are analyzed using high resolution mass spectrometry, which generate large amounts of data that requires sophisticated bioinformatics tools for analysis and visualization. PTMViz is designed for downstream differential abundance analysis and visualization of both protein and/or histone modifications. Results: PTMViz provides users with data tables and visualization plots of significantly differentiated proteins and histone PTMs between two sample groups. All the data is packaged into interactive data tables and graphs using the Shiny platform to help the user explore the results in a fast and efficient manner to assess if changes in the system are due to protein abundance changes or epigenetic changes. In the example data provided, we identified several proteins differentially regulated in the dopaminergic pathway between mice treated with methamphetamine compared to a saline control. We also identified histone post-translational modifications including histone H3K9me, H3K27me3, H4K16ac, and that were regulated due to drug exposure. Conclusions: Histone modifications play an integral role in the regulation of gene expression. PTMViz provides an interactive platform for analyzing proteins and histone post-translational modifications from mass spectrometry data in order to quickly identify differentially expressed proteins and PTMs.",
                "authors": [
                    {
                        "name": "Bolden C."
                    },
                    {
                        "name": "Byrum S.D."
                    },
                    {
                        "name": "Chappell K."
                    },
                    {
                        "name": "Graw S."
                    },
                    {
                        "name": "Peterson E.C."
                    },
                    {
                        "name": "Storey A.J."
                    },
                    {
                        "name": "Washam C.L."
                    }
                ],
                "date": "2021-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "PTMViz: a tool for analyzing and visualizing histone post translational modification data"
            },
            "pmcid": "PMC8157737",
            "pmid": "34039258",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        },
        {
            "term": "Protein modifications",
            "uri": "http://edamontology.org/topic_0601"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        }
    ]
}
