{
    "additionDate": "2017-05-01T15:56:19Z",
    "biotoolsCURIE": "biotools:pknot-v2",
    "biotoolsID": "pknot-v2",
    "description": "pKNOT (Protein Knot) is a tool that can detect knots in proteins as well as providing information on knotted proteins in PDB. pKNOT-v2 has been updated with a homology modeling tool such that the server can now accept protein sequences in addition to 3D structures or PDB IDs and return knot analysis.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein modelling",
                    "uri": "http://edamontology.org/operation_0477"
                },
                {
                    "term": "Protein folding analysis",
                    "uri": "http://edamontology.org/operation_2415"
                },
                {
                    "term": "Structure visualisation",
                    "uri": "http://edamontology.org/operation_0570"
                },
                {
                    "term": "Protein structure analysis",
                    "uri": "http://edamontology.org/operation_2406"
                }
            ]
        }
    ],
    "homepage": "http://pknot.life.nctu.edu.tw/",
    "homepage_status": 1,
    "lastUpdate": "2018-12-10T12:58:44Z",
    "name": "pKNOT-v2",
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "Knotted proteins are more commonly observed in recent years due to the enormously growing number of structures in the Protein Data Bank (PDB). Studies show that the knot regions contribute to both ligand binding and enzyme activity in proteins such as the chromophore-binding domain of phytochrome, ketol-acid reductoisomerase or SpoU methyltransferase. However, there are still many misidentified knots published in the literature due to the absence of a convenient web tool available to the general biologists. Here, we present the first web server to detect the knots in proteins as well as provide information on knotted proteins in PDB-the protein KNOT (pKNOT) web server. In pKNOT, users can either input PDB ID or upload protein coordinates in the PDB format. The pKNOT web server will detect the knots in the protein using the Taylor's smoothing algorithm. All the detected knots can be visually inspected using a Java-based 3D graphics viewer. We believe that the pKNOT web server will be useful to both biologists in general and structural biologists in particular. © 2007 The Author(s).",
                "authors": [
                    {
                        "name": "Lai Y.-L."
                    },
                    {
                        "name": "Yen S.-C."
                    },
                    {
                        "name": "Yu S.-H."
                    },
                    {
                        "name": "Hwang J.-K."
                    }
                ],
                "citationCount": 32,
                "date": "2007-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "PKNOT: The protein KNOT web server"
            },
            "pmid": "17526524"
        },
        {
            "metadata": {
                "abstract": "Knotted proteins have recently received lots of attention due to their interesting topological novelty as well as its puzzling folding mechanisms. We previously published a pKNOT server, which provides a structural database of knotted proteins, analysis tools for detecting and analyzing knotted regions from structures as well as a Java-based 3D graphics viewer for visualizing knotted structures. However, there lacks a convenient platform performing similar tasks directly from 'protein sequences'. In the current version of the web server, referred to as pKNOT v.2, we implement a homology modeling tool such that the server can now accept protein sequences in addition to 3D structures or Protein Data Bank (PDB) IDs and return knot analysis. In addition, we have updated the database of knotted proteins from the current PDB with a combination of automatic and manual procedure. We believe that the updated pKNOT server with its extended functionalities will provide better service to biologists interested in the research of knotted proteins. The pKNOT v.2 is available from http://pknot.life.nctu.edu.tw/. © 2012 The Author(s).",
                "authors": [
                    {
                        "name": "Lai Y.-L."
                    },
                    {
                        "name": "Chen C.-C."
                    },
                    {
                        "name": "Hwang J.-K."
                    }
                ],
                "citationCount": 23,
                "date": "2012-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "pKNOT v.2: the protein KNOT web server"
            },
            "pmid": "22693223"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Protein folds and structural domains",
            "uri": "http://edamontology.org/topic_0736"
        },
        {
            "term": "Molecular modelling",
            "uri": "http://edamontology.org/topic_2275"
        },
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        },
        {
            "term": "Protein folding, stability and design",
            "uri": "http://edamontology.org/topic_0130"
        },
        {
            "term": "Protein structure analysis",
            "uri": "http://edamontology.org/topic_2814"
        }
    ],
    "validated": 1
}