{
    "accessibility": "Open access",
    "additionDate": "2023-03-18T09:09:17.367328Z",
    "biotoolsCURIE": "biotools:draw",
    "biotoolsID": "draw",
    "collectionID": [
        "COVID-19"
    ],
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "mohsen.hooshmand@iasbs.ac.ir",
            "name": "Mohsen Hooshmand",
            "typeEntity": "Person"
        }
    ],
    "description": "The DRaW is a convolutional neural network to predict new virus-antiviral interactions VAIs from approved antivirals.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Plasmid map drawing",
                    "uri": "http://edamontology.org/operation_0578"
                },
                {
                    "term": "Restriction map drawing",
                    "uri": "http://edamontology.org/operation_0575"
                },
                {
                    "term": "Virtual screening",
                    "uri": "http://edamontology.org/operation_3938"
                }
            ]
        }
    ],
    "homepage": "http://github.com/BioinformaticsIASBS/DRaW",
    "language": [
        "Python"
    ],
    "lastUpdate": "2023-03-18T09:09:17.371602Z",
    "license": "Not licensed",
    "name": "DRaW",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1186/S12859-023-05181-8",
            "metadata": {
                "abstract": "Background: Due to the high resource consumption of introducing a new drug, drug repurposing plays an essential role in drug discovery. To do this, researchers examine the current drug-target interaction (DTI) to predict new interactions for the approved drugs. Matrix factorization methods have much attention and utilization in DTIs. However, they suffer from some drawbacks. Methods: We explain why matrix factorization is not the best for DTI prediction. Then, we propose a deep learning model (DRaW) to predict DTIs without having input data leakage. We compare our model with several matrix factorization methods and a deep model on three COVID-19 datasets. In addition, to ensure the validation of DRaW, we evaluate it on benchmark datasets. Furthermore, as an external validation, we conduct a docking study on the COVID-19 recommended drugs. Results: In all cases, the results confirm that DRaW outperforms matrix factorization and deep models. The docking results approve the top-ranked recommended drugs for COVID-19. Conclusions: In this paper, we show that it may not be the best choice to use matrix factorization in the DTI prediction. Matrix factorization methods suffer from some intrinsic issues, e.g., sparsity in the domain of bioinformatics applications and fixed-unchanged size of the matrix-related paradigm. Therefore, we propose an alternative method (DRaW) that uses feature vectors rather than matrix factorization and demonstrates better performance than other famous methods on three COVID-19 and four benchmark datasets.",
                "authors": [
                    {
                        "name": "Gharaghani S."
                    },
                    {
                        "name": "Hashemi S.M."
                    },
                    {
                        "name": "Hooshmand M."
                    },
                    {
                        "name": "Zabihian A."
                    }
                ],
                "date": "2023-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "DRaW: prediction of COVID-19 antivirals by deep learning—an objection on using matrix factorization"
            },
            "pmcid": "PMC9931173",
            "pmid": "36793010"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Drug discovery",
            "uri": "http://edamontology.org/topic_3336"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Molecular modelling",
            "uri": "http://edamontology.org/topic_2275"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
