{
    "accessibility": "Open access",
    "additionDate": "2022-10-28T08:17:12.411941Z",
    "biotoolsCURIE": "biotools:turboputative",
    "biotoolsID": "turboputative",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "alessia.ferrarini@cnic.es",
            "name": "Alessia Ferrarini",
            "typeEntity": "Person"
        },
        {
            "email": "annalaura.mastrangelo@cnic.es",
            "name": "Annalaura Mastrangelo",
            "typeEntity": "Person"
        },
        {
            "name": "Jesús Vázquez"
        },
        {
            "name": "Jose Manuel Rodriguez"
        },
        {
            "name": "Rafael Barrero-Rodríguez"
        },
        {
            "name": "Rocío Tarifa"
        }
    ],
    "description": "A web server for data handling and metabolite classification in untargeted metabolomics.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data handling",
                    "uri": "http://edamontology.org/operation_2409"
                },
                {
                    "term": "Natural product identification",
                    "uri": "http://edamontology.org/operation_3803"
                },
                {
                    "term": "Pathway analysis",
                    "uri": "http://edamontology.org/operation_3928"
                }
            ]
        }
    ],
    "homepage": "https://proteomics.cnic.es/TurboPutative/",
    "language": [
        "JavaScript",
        "Python"
    ],
    "lastUpdate": "2022-10-28T08:17:12.414542Z",
    "license": "CC-BY-NC-ND-4.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/CNIC-Proteomics/TurboPutative-web"
        }
    ],
    "name": "TurboPutative",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.3389/FMOLB.2022.952149",
            "metadata": {
                "abstract": "Copyright © 2022 Barrero-Rodríguez, Rodriguez, Tarifa, Vázquez, Mastrangelo and Ferrarini.Untargeted metabolomics aims at measuring the entire set of metabolites in a wide range of biological samples. However, due to the high chemical diversity of metabolites that range from small to large and more complex molecules (i.e., amino acids/carbohydrates vs. phospholipids/gangliosides), the identification and characterization of the metabolome remain a major bottleneck. The first step of this process consists of searching the experimental monoisotopic mass against databases, thus resulting in a highly redundant/complex list of candidates. Despite the progress in this area, researchers are still forced to manually explore the resulting table in order to prioritize the most likely identifications for further biological interpretation or confirmation with standards. Here, we present TurboPutative (https://proteomics.cnic.es/TurboPutative/), a flexible and user-friendly web-based platform composed of four modules (Tagger, REname, RowMerger, and TPMetrics) that streamlines data handling, classification, and interpretability of untargeted LC-MS-based metabolomics data. Tagger classifies the different compounds and provides preliminary insights into the biological system studied. REname improves putative annotation handling and visualization, allowing the recognition of isomers and equivalent compounds and redundant data removal. RowMerger reduces the dataset size, facilitating the manual comparison among annotations. Finally, TPMetrics combines different datasets with feature intensity and relevant information for the researcher and calculates a score based on adduct probability and feature correlations, facilitating further identification, assessment, and interpretation of the results. The TurboPutative web application allows researchers in the metabolomics field that are dealing with massive datasets containing multiple putative annotations to reduce the number of these entries by 80%–90%, thus facilitating the extrapolation of biological knowledge and improving metabolite prioritization for subsequent pathway analysis. TurboPutative comprises a rapid, automated, and customizable workflow that can also be included in programmed bioinformatics pipelines through its RESTful API services. Users can explore the performance of each module through demo datasets supplied on the website. The platform will help the metabolomics community to speed up the arduous task of manual data curation that is required in the first steps of metabolite identification, improving the generation of biological knowledge.",
                "authors": [
                    {
                        "name": "Barrero-Rodriguez R."
                    },
                    {
                        "name": "Ferrarini A."
                    },
                    {
                        "name": "Mastrangelo A."
                    },
                    {
                        "name": "Rodriguez J.M."
                    },
                    {
                        "name": "Tarifa R."
                    },
                    {
                        "name": "Vazquez J."
                    }
                ],
                "date": "2022-09-08T00:00:00Z",
                "journal": "Frontiers in Molecular Biosciences",
                "title": "TurboPutative: A web server for data handling and metabolite classification in untargeted metabolomics"
            },
            "pmcid": "PMC9493301",
            "pmid": "36158581"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Carbohydrates",
            "uri": "http://edamontology.org/topic_0152"
        },
        {
            "term": "Lipids",
            "uri": "http://edamontology.org/topic_0153"
        },
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ],
    "validated": 1
}
