{
    "additionDate": "2021-01-18T10:16:57Z",
    "biotoolsCURIE": "biotools:molaical",
    "biotoolsID": "molaical",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "baiqf@lzu.edu.cn",
            "name": "Qifeng Bai",
            "orcidid": "https://orcid.org/0000-0001-7296-6187",
            "typeEntity": "Person"
        },
        {
            "email": "xjyao@lzu.edu.cn",
            "name": "Xiaojun Yao",
            "typeEntity": "Person"
        }
    ],
    "description": "A soft tool for 3D drug design of protein targets by artificial intelligence and classical algorithm.\n\nMolAICal is a drug design software combined by artificial intelligence and classical programming. MolAICal is freely for education, academic and other non-profit purposes. If you want to use MolAICal for any commercial purpose, you should contact with licensors (Email: molaical@yeah.net).",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Virtual screening",
                    "uri": "http://edamontology.org/operation_3938"
                },
                {
                    "term": "Protein-protein docking",
                    "uri": "http://edamontology.org/operation_3899"
                },
                {
                    "term": "Molecular dynamics",
                    "uri": "http://edamontology.org/operation_2476"
                }
            ]
        }
    ],
    "homepage": "https://molaical.github.io",
    "lastUpdate": "2021-02-26T09:23:13Z",
    "name": "MolAICal",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1093/BIB/BBAA161",
            "metadata": {
                "abstract": "© The Author(s) 2020. Published by Oxford University Press. All rights reserved. For Permissions, please email: journals.permissions@oup.com.Deep learning is an important branch of artificial intelligence that has been successfully applied into medicine and two-dimensional ligand design. The three-dimensional (3D) ligand generation in the 3D pocket of protein target is an interesting and challenging issue for drug design by deep learning. Here, the MolAICal software is introduced to supply a way for generating 3D drugs in the 3D pocket of protein targets by combining with merits of deep learning model and classical algorithm. The MolAICal software mainly contains two modules for 3D drug design. In the first module of MolAICal, it employs the genetic algorithm, deep learning model trained by FDA-approved drug fragments and Vinardo score fitting on the basis of PDBbind database for drug design. In the second module, it uses deep learning generative model trained by drug-like molecules of ZINC database and molecular docking invoked by Autodock Vina automatically. Besides, the Lipinski's rule of five, Pan-assay interference compounds (PAINS), synthetic accessibility (SA) and other user-defined rules are introduced for filtering out unwanted ligands in MolAICal. To show the drug design modules of MolAICal, the membrane protein glucagon receptor and non-membrane protein SARS-CoV-2 main protease are chosen as the investigative drug targets. The results show MolAICal can generate the various and novel ligands with good binding scores and appropriate XLOGP values. We believe that MolAICal can use the advantages of deep learning model and classical programming for designing 3D drugs in protein pocket. MolAICal is freely for any nonprofit purpose and accessible at https://molaical.github.io.",
                "authors": [
                    {
                        "name": "Bai Q."
                    },
                    {
                        "name": "Tan S."
                    },
                    {
                        "name": "Xu T."
                    },
                    {
                        "name": "Liu H."
                    },
                    {
                        "name": "Huang J."
                    },
                    {
                        "name": "Yao X."
                    }
                ],
                "citationCount": 10,
                "date": "2021-05-20T00:00:00Z",
                "journal": "Briefings in bioinformatics",
                "title": "MolAICal: a soft tool for 3D drug design of protein targets by artificial intelligence and classical algorithm"
            },
            "pmcid": "PMC7454275",
            "pmid": "32778891"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Medicinal chemistry",
            "uri": "http://edamontology.org/topic_0209"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Molecular modelling",
            "uri": "http://edamontology.org/topic_2275"
        },
        {
            "term": "Drug metabolism",
            "uri": "http://edamontology.org/topic_3375"
        }
    ]
}