{"credit":[{"name":"ugent.be","typeEntity":"Institute","typeRoles":["Provider"]},{"email":"Tim.Demeyer@ugent.be","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"http://www.mexpress.be/about"}],"function":[{"input":[{"data":{"term":"Gene identifier","uri":"http://edamontology.org/data_1025"}}],"operation":[{"term":"Database search","uri":"http://edamontology.org/operation_2421"}]}],"labels":{"collectionID":["BIG N2N","UGent"],"operatingSystem":["Linux","Windows","Mac"],"toolType":["Web application"],"topic":[{"term":"Epigenomics","uri":"http://edamontology.org/topic_3173"},{"term":"Transcriptomics","uri":"http://edamontology.org/topic_3308"}]},"publication":[{"abstract":"© 2015 Koch et al.Background: In recent years, increasing amounts of genomic and clinical cancer data have become publically available through large-scale collaborative projects such as The Cancer Genome Atlas (TCGA). However, as long as these datasets are difficult to access and interpret, they are essentially useless for a major part of the research community and their scientific potential will not be fully realized. To address these issues we developed MEXPRESS, a straightforward and easy-to-use web tool for the integration and visualization of the expression, DNA methylation and clinical TCGA data on a single-gene level ( http://mexpress.be ). Results: In comparison to existing tools, MEXPRESS allows researchers to quickly visualize and interpret the different TCGA datasets and their relationships for a single gene, as demonstrated for GSTP1 in prostate adenocarcinoma. We also used MEXPRESS to reveal the differences in the DNA methylation status of the PAM50 marker gene MLPH between the breast cancer subtypes and how these differences were linked to the expression of MPLH. Conclusions: We have created a user-friendly tool for the visualization and interpretation of TCGA data, offering clinical researchers a simple way to evaluate the TCGA data for their genes or candidate biomarkers of interest.","authors":["Koch A.","De Meyer T.","Jeschke J.","Van Criekinge W."],"cit_count":43,"doi":"10.1186/s12864-015-1847-z","journal":"BMC Genomics","title":"MEXPRESS: Visualizing expression, DNA methylation and clinical TCGA data","type":"Primary","year":"2015-08-26"}],"summary":{"biotoolsCURIE":"biotools:mexpress","biotoolsID":"mexpress","description":"TCGA data mining tool.","homepage":"http://www.mexpress.be","name":"MEXPRESS","version":["1"]}}