{
    "additionDate": "2017-08-03T18:35:44Z",
    "biotoolsCURIE": "biotools:ambient",
    "biotoolsID": "ambient",
    "credit": [
        {
            "name": "William Bryant",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://sourceforge.net/u/willabryant/profile/"
        }
    ],
    "description": "The Active Modules for Bipartite Networks is a Python module that uses simulated annealing to find areas of a metabolic network (modules) that have some consistent characteristic. It does not require predefined pathways and gives highly specific predictions of affected areas of metabolism.",
    "documentation": [
        {
            "type": "General",
            "url": "https://sourceforge.net/projects/ambient-bio/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Metabolic network modelling",
                    "uri": "http://edamontology.org/operation_3660"
                }
            ]
        }
    ],
    "homepage": "http://sourceforge.net/projects/ambient-bio/?source=navbar",
    "language": [
        "Python"
    ],
    "lastUpdate": "2018-12-10T12:58:56Z",
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/ambient-1-3-find-active-modules-metabolic-networks-high-throughput-data.html"
        }
    ],
    "name": "AMBIENT",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Background: With the continued proliferation of high-throughput biological experiments, there is a pressing need for tools to integrate the data produced in ways that produce biologically meaningful conclusions. Many microarray studies have analysed transcriptomic data from a pathway perspective, for instance by testing for KEGG pathway enrichment in sets of upregulated genes. However, the increasing availability of species-specific metabolic models provides the opportunity to analyse these data in a more objective, system-wide manner.Results: Here we introduce ambient (Active Modules for Bipartite Networks), a simulated annealing approach to the discovery of metabolic subnetworks (modules) that are significantly affected by a given genetic or environmental change. The metabolic modules returned by ambient are connected parts of the bipartite network that change coherently between conditions, providing a more detailed view of metabolic changes than standard approaches based on pathway enrichment.Conclusions: ambient is an effective and flexible tool for the analysis of high-throughput data in a metabolic context. The same approach can be applied to any system in which reactions (or metabolites) can be assigned a score based on some biological observation, without the limitation of predefined pathways. A Python implementation of ambient is available at http://www.theosysbio.bio.ic.ac.uk/ambient. © 2013 Bryant et al.; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Bryant W.A."
                    },
                    {
                        "name": "Sternberg M.J.E."
                    },
                    {
                        "name": "Pinney J.W."
                    }
                ],
                "citationCount": 9,
                "date": "2013-03-25T00:00:00Z",
                "journal": "BMC Systems Biology",
                "title": "AMBIENT: Active Modules for Bipartite Networks - using high-throughput transcriptomic data to dissect metabolic response"
            },
            "pmid": "23531303"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Systems biology",
            "uri": "http://edamontology.org/topic_2259"
        },
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ],
    "validated": 1
}