{
    "name": "RAP", 
    "description": "It is a web tool that performs a quite complete and customizable RNA-Seq pipeline and provides an easy and intuitive access through a web interface to intermediate and final results. The main aim of RAP is to provide to users information about gene and transcript expression, differential expression, alternative splicing, polyA signals, fusion transcripts, etc.", 
    "homepage": "https://bioinformatics.cineca.it/rap", 
    "biotoolsID": "rap", 
    "biotoolsCURIE": "biotools:rap", 
    "version": [
        "1"
    ], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_3198", 
                    "term": "Read mapping"
                }
            ], 
            "input": [
                {
                    "data": {
                        "uri": "http://edamontology.org/data_2975", 
                        "term": "Nucleic acid sequence (raw)"
                    }, 
                    "format": []
                }
            ], 
            "output": [], 
            "note": "RAP is a web tool that performs a complete RNA-Seq pipeline", 
            "cmd": null
        }
    ], 
    "toolType": [
        "Web application"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_0091", 
            "term": "Bioinformatics"
        }, 
        {
            "uri": "http://edamontology.org/topic_3168", 
            "term": "Sequencing"
        }, 
        {
            "uri": "http://edamontology.org/topic_3308", 
            "term": "Transcriptomics"
        }
    ], 
    "operatingSystem": [
        "Linux", 
        "Windows", 
        "Mac"
    ], 
    "language": [], 
    "license": null, 
    "collectionID": [], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [], 
    "download": [], 
    "documentation": [], 
    "publication": [
        {
            "doi": "10.1186/1471-2164-16-S6-S3", 
            "pmid": null, 
            "pmcid": null, 
            "type": "Primary", 
            "version": null, 
            "metadata": {
                "title": "RAP: RNA-Seq Analysis Pipeline, a new cloud-based NGS web application", 
                "abstract": "© D'Antonio et al.; licensee BioMed Central Ltd. 2015. Background The study of RNA has been dramatically improved by the introduction of Next Generation Sequencing platforms allowing massive and cheap sequencing of selected RNA fractions, also providing information on strand orientation (RNA-Seq). The complexity of transcriptomes and of their regulative pathways make RNA-Seq one of most complex field of NGS applications, addressing several aspects of the expression process (e.g. identification and quantification of expressed genes and transcripts, alternative splicing and polyadenylation, fusion genes and trans-splicing, post-transcriptional events, etc.). Moreover, the huge volume of data generated by NGS platforms introduces unprecedented computational and technological challenges to efficiently analyze and store sequence data and results. Methods In order to provide researchers with an effective and friendly resource for analyzing RNA-Seq data, we present here RAP (RNA-Seq Analysis Pipeline), a cloud computing web application implementing a complete but modular analysis workflow. This pipeline integrates both state-of-the-art bioinformatics tools for RNA-Seq analysis and in-house developed scripts to offer to the user a comprehensive strategy for data analysis. RAP is able to perform quality checks (adopting FastQC and NGS QC Toolkit), identify and quantify expressed genes and transcripts (with Tophat, Cufflinks and HTSeq), detect alternative splicing events (using SpliceTrap) and chimeric transcripts (with ChimeraScan). This pipeline is also able to identify splicing junctions and constitutive or alternative polyadenylation sites (implementing custom analysis modules) and call for statistically significant differences in genes and transcripts expression, splicing pattern and polyadenylation site usage (using Cuffdiff2 and DESeq). Results Through a user friendly web interface, the RAP workflow can be suitably customized by the user and it is automatically executed on our cloud computing environment. This strategy allows to access to bioinformatics tools and computational resources without specific bioinformatics and IT skills. RAP provides a set of tabular and graphical results that can be helpful to browse, filter and export analyzed data, according to the user needs.", 
                "date": "2015-01-01T00:00:00Z", 
                "citationCount": 29, 
                "authors": [
                    {
                        "name": "D'Antonio M."
                    }, 
                    {
                        "name": "De Meo P.D."
                    }, 
                    {
                        "name": "Pallocca M."
                    }, 
                    {
                        "name": "Picardi E."
                    }, 
                    {
                        "name": "D'Erchia A.M."
                    }, 
                    {
                        "name": "Calogero R.A."
                    }, 
                    {
                        "name": "Castrignano T."
                    }, 
                    {
                        "name": "Pesole G."
                    }
                ], 
                "journal": "BMC Genomics"
            }
        }
    ], 
    "credit": [
        {
            "name": "ELIXIR-ITA-CINECA", 
            "email": null, 
            "url": null, 
            "orcidid": null, 
            "typeEntity": "Institute", 
            "typeRole": [
                "Provider"
            ], 
            "note": null
        }, 
        {
            "name": "Graziano Pesole", 
            "email": "graziano.pesole@uniba.it", 
            "url": null, 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "ELIXIR-ITA-CINECA", 
    "additionDate": "2015-01-22T11:47:13Z", 
    "lastUpdate": "2018-12-10T12:58:59Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 1, 
    "homepage_status": 0, 
    "elixir_badge": 0
}