{
    "additionDate": "2023-09-07T12:57:16.987265Z",
    "biotoolsCURIE": "biotools:human-gpdb",
    "biotoolsID": "human-gpdb",
    "collectionID": [
        "gpcr"
    ],
    "description": "Human-gpDB is a publicly accessible, relational database of human G-Proteins and their interactions with human GPCRs and Effectors. The database currently holds information about 713 human GPCRs, 36 human G-Proteins and 99 human Effectors. The collection of the information about the interactions between these molecules was done manually and the current status of Human-gpDB reveals information about 1663 connections between GPCRs and G-Proteins and 1618 connections between G-Proteins and Effectors. The sequences of G-Proteins and GPCRs are classified according to a hierarchy of different classes, families and sub-families, whereas the Effectors sequences are classified in families, subfamilies and types, based on extensive literature search. The classification of GPCRs follows the IUPHAR classification, while the Effectors classification is a unique feature and is based on their function.",
    "editPermission": {
        "authors": [
            "mbermudez1"
        ],
        "type": "group"
    },
    "homepage": "https://human-gpdb.lcsb.uni.lu/",
    "lastUpdate": "2024-11-24T14:15:33.906543Z",
    "name": "human-gpDB",
    "owner": "laasfeld",
    "publication": [
        {
            "doi": "10.1093/database/baq019",
            "metadata": {
                "abstract": "G-protein coupled receptors (GPCRs) are a major family of membrane receptors in eukaryotic cells. They play a crucial role in the communication of a cell with the environment. Ligands bind to GPCRs on the outside of the cell, activating them by causing a conformational change, and allowing them to bind to G-proteins. Through their interaction with G-proteins, several effector molecules are activated leading to many kinds of cellular and physiological responses. The great importance of GPCRs and their corresponding signal transduction pathways is indicated by the fact that they take part in many diverse disease processes and that a large part of efforts towards drug development today is focused on them. We present Human-gpDB, a database which currently holds information about 713 human GPCRs, 36 human G-proteins and 99 human effectors. The collection of information about the interactions between these molecules was done manually and the current version of Human-gpDB holds information for about 1663 connections between GPCRs and G-proteins and 1618 connections between G-proteins and effectors. Major advantages of Human-gpDB are the integration of several external data sources and the support of advanced visualization techniques. Human-gpDB is a simple, yet a powerful tool for researchers in the life sciences field as it integrates an up-to-date, carefully curated collection of human GPCRs, G-proteins, effectors and their interactions. The database may be a reference guide for medical and pharmaceutical research, especially in the areas of understanding human diseases and chemical and drug discovery. Database URLs: http://schneider.embl.de/human_gpdb; http://bioinformatics.biol.uoa.gr/human_gpdb/",
                "authors": [
                    {
                        "name": "Bagos P.G."
                    },
                    {
                        "name": "Hamodrakas S.J."
                    },
                    {
                        "name": "Papandreou N.C."
                    },
                    {
                        "name": "Pavlopoulos G.A."
                    },
                    {
                        "name": "Satagopam V.P."
                    },
                    {
                        "name": "Schneider R."
                    },
                    {
                        "name": "Stampolakis C.K."
                    },
                    {
                        "name": "Theodoropoulou M.C."
                    }
                ],
                "citationCount": 21,
                "date": "2010-01-01T00:00:00Z",
                "journal": "Database : the journal of biological databases and curation",
                "title": "GPCRs, G-proteins, effectors and their interactions: human-gpDB, a database employing visualization tools and data integration techniques."
            },
            "pmcid": "PMC2931634",
            "pmid": "20689020",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Bioinformatics portal",
        "Database portal",
        "Web application"
    ],
    "topic": [
        {
            "term": "Molecular biology",
            "uri": "http://edamontology.org/topic_3047"
        },
        {
            "term": "Pharmacology",
            "uri": "http://edamontology.org/topic_0202"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "Systems medicine",
            "uri": "http://edamontology.org/topic_3396"
        }
    ]
}
