{
    "additionDate": "2017-08-03T19:00:01Z",
    "biotoolsCURIE": "biotools:snphunter",
    "biotoolsID": "snphunter",
    "credit": [
        {
            "email": "tniu@hsph.harvard.edu",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Tool for SNP Search and downloading with local management. It also offers flanking sequence downloading and automatic SNP filtering.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://www.softsea.com/review/SNPHunter.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "SNP detection",
                    "uri": "http://edamontology.org/operation_0484"
                }
            ]
        }
    ],
    "homepage": "http://www.softsea.com/review/SNPHunter.html",
    "language": [
        "Visual Basic"
    ],
    "lastUpdate": "2018-12-10T12:58:51Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/snphunter-1-75-dbsnp-search-management.html"
        }
    ],
    "name": "SNPHunter",
    "operatingSystem": [
        "Windows"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Background: Single nucleotide polymorphisms (SNPs) provide an important tool in pinpointing susceptibility genes for complex diseases and in unveiling human molecular evolution. Selection and retrieval of an optimal SNP set from publicly available databases have emerged as the foremost bottlenecks in designing large-scale linkage disequilibrium studies, particularly in case-control settings. Results: We describe the architectural structure and implementations of a novel software program, SNPHunter, which allows for both ad hoc-mode and batch-mode SNP search, automatic SNP filtering, and retrieval of SNP data, including physical position, function class, flanking sequences at user-defined lengths, and heterozygosity from NCBI dbSNP. The SNP data extracted from dbSNP via SNPHunter can be exported and saved in plain text format for further downstream analyses. As an illustration, we applied SNPHunter for selecting SNPs for 10 major candidate genes for type 2 diabetes, including CAPN10, FABP4, IL6, NOS3, PPARG, TNF, UCP2, CRP, ESR1, and AR. Conclusion: SNPHunter constitutes an efficient and user-friendly tool for SNP screening, selection, and acquisition. The executable and user's manual are available at http://www.hsph.harvard.edu/ppg/software.htm. © 2005 Wang et al; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Wang L."
                    },
                    {
                        "name": "Liu S."
                    },
                    {
                        "name": "Niu T."
                    },
                    {
                        "name": "Xu X."
                    }
                ],
                "citationCount": 22,
                "date": "2005-03-18T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "SNPHunter: A bioinformatic software for single nucleotide polymorphism data acquisition and management"
            },
            "pmid": "15774022"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        }
    ],
    "validated": 1
}