{
    "additionDate": "2018-08-06T09:24:13Z",
    "biotoolsCURIE": "biotools:diffmeanvar",
    "biotoolsID": "diffmeanvar",
    "credit": [
        {
            "email": "stwxq@channing.harvard.edu",
            "name": "Weiliang Qiu",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "A collection of functions to detect gene probes with different means or variances between two groups in (epi)-genomic data analysis, including classical F test and Levene's test for equal variance, likelihood ratio test for equal mean and equal variance.",
    "documentation": [
        {
            "type": "User manual",
            "url": "https://cran.r-project.org/web/packages/diffMeanVar/diffMeanVar.pdf"
        }
    ],
    "download": [
        {
            "type": "Software package",
            "url": "https://cran.r-project.org/src/contrib/diffMeanVar_0.0.6.tar.gz"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Statistical calculation",
                    "uri": "http://edamontology.org/operation_2238"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Methylation analysis",
                    "uri": "http://edamontology.org/operation_3204"
                }
            ]
        }
    ],
    "homepage": "https://cran.r-project.org/web/packages/diffMeanVar/index.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-10T12:59:01Z",
    "license": "GPL-2.0",
    "name": "diffMeanVar",
    "operatingSystem": [
        "Windows",
        "Mac"
    ],
    "owner": "shadi.m",
    "publication": [
        {
            "doi": "10.1186/s12859-018-2185-3",
            "metadata": {
                "abstract": "© 2018 The Author(s). Background: Recently differential variability has been showed to be valuable in evaluating the association of DNA methylation to the risks of complex human diseases. The statistical tests based on both differential methylation level and differential variability can be more powerful than those based only on differential methylation level. Anh and Wang (2013) proposed a joint score test (AW) to simultaneously detect for differential methylation and differential variability. However, AW's method seems to be quite conservative and has not been fully compared with existing joint tests. Results: We proposed three improved joint score tests, namely iAW.Lev, iAW.BF, and iAW.TM, and have made extensive comparisons with the joint likelihood ratio test (jointLRT), the Kolmogorov-Smirnov (KS) test, and the AW test. Systematic simulation studies showed that: 1) the three improved tests performed better (i.e., having larger power, while keeping nominal Type I error rates) than the other three tests for data with outliers and having different variances between cases and controls; 2) for data from normal distributions, the three improved tests had slightly lower power than jointLRT and AW. The analyses of two Illumina HumanMethylation27 data sets GSE37020 and GSE20080 and one Illumina Infinium MethylationEPIC data set GSE107080 demonstrated that three improved tests had higher true validation rates than those from jointLRT, KS, and AW. Conclusions: The three proposed joint score tests are robust against the violation of normality assumption and presence of outlying observations in comparison with other three existing tests. Among the three proposed tests, iAW.BF seems to be the most robust and effective one for all simulated scenarios and also in real data analyses.",
                "authors": [
                    {
                        "name": "Li X."
                    },
                    {
                        "name": "Fu Y."
                    },
                    {
                        "name": "Wang X."
                    },
                    {
                        "name": "Qiu W."
                    }
                ],
                "date": "2018-05-18T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Robust joint score tests in the application of DNA methylation data analysis"
            },
            "type": "Primary"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        }
    ],
    "validated": 1,
    "version": [
        "0.0.6"
    ]
}