{
    "additionDate": "2017-01-17T15:02:34Z",
    "biotoolsCURIE": "biotools:proper",
    "biotoolsID": "proper",
    "collectionID": [
        "BioConductor"
    ],
    "credit": [
        {
            "email": "hao.wu@emory.edu",
            "name": "Hao Wu",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "This package provide simulation based methods for evaluating the statistical power in differential expression analysis from RNA-seq data.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://bioconductor.org/packages/release/bioc/html/PROPER.html"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://bioconductor/packages/release/bioc/src/contrib/PROPER_1.6.0.tar.gz"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Differential gene expression analysis",
                    "uri": "http://edamontology.org/operation_3223"
                }
            ]
        }
    ],
    "homepage": "http://bioconductor.org/packages/release/bioc/html/PROPER.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2019-01-10T15:37:32Z",
    "license": "GPL-3.0",
    "name": "PROPER",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "bioconductor_import",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btu640",
            "metadata": {
                "abstract": "© The Author 2014. Published by Oxford University Press. All rights reserved.Motivation: RNA-seq has become a routine technique in differential expression (DE) identification. Scientists face a number of experimental design decisions, including the sample size. The power for detecting differential expression is affected by several factors, including the fraction of DE genes, distribution of the magnitude of DE, distribution of gene expression level, sequencing coverage and the choice of type I error control. The complexity and flexibility of RNA-seq experiments, the high-throughput nature of transcriptome-wide expression measurements and the unique characteristics of RNA-seq data make the power assessment particularly challenging. Results: We propose prospective power assessment instead of a direct sample size calculation by making assumptions on all of these factors. Our power assessment tool includes two components: (i) a semi-parametric simulation that generates data based on actual RNAseq experiments with flexible choices on baseline expressions, biological variations and patterns of DE; and (ii) a power assessment component that provides a comprehensive view of power. We introduce the concepts of stratified power and false discovery cost, and demonstrate the usefulness of our method in experimental design (such as sample size and sequencing depth), as well as analysis plan (gene filtering).",
                "authors": [
                    {
                        "name": "Wu H."
                    },
                    {
                        "name": "Wang C."
                    },
                    {
                        "name": "Wu Z."
                    }
                ],
                "citationCount": 30,
                "date": "2015-01-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "PROPER: Comprehensive power evaluation for differential expression using RNA-seq"
            },
            "pmcid": "PMC4287952",
            "pmid": "25273110",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool",
        "Library"
    ],
    "topic": [
        {
            "term": "RNA-seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ],
    "validated": 1,
    "version": [
        "1.6.0"
    ]
}