{
    "additionDate": "2017-08-03T18:59:07Z",
    "biotoolsCURIE": "biotools:swap-assembler",
    "biotoolsID": "swap-assembler",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://sourceforge.net/u/jtmeng/profile/"
        }
    ],
    "description": "A scalable and fully parallelized genome assembler designed for massive sequencing data. Intend of using traditional de Bruijn Graph, it adopts multi-step bi-directed graph (MSG). With MSG, the standard genome assembly (SGA) is equivalent to the edge merging operations in a semi-group.",
    "documentation": [
        {
            "type": "General",
            "url": "https://sourceforge.net/projects/swapassembler/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genome assembly",
                    "uri": "http://edamontology.org/operation_0525"
                }
            ]
        }
    ],
    "homepage": "https://sourceforge.net/projects/swapassembler/",
    "language": [
        "C++"
    ],
    "lastUpdate": "2018-12-10T12:58:49Z",
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/swap-assembler-a-scalable-and-fully-parallelized-genome-assembler.html"
        }
    ],
    "name": "SWAP-Assembler",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "© 2014 Meng et al.; licensee BioMed Central Ltd. Background: There is a widening gap between the throughput of massive parallel sequencing machines and the ability to analyze these sequencing data. Traditional assembly methods requiring long execution time and large amount of memory on a single workstation limit their use on these massive data. Results: This paper presents a highly scalable assembler named as SWAP-Assembler for processing massive sequencing data using thousands of cores, where SWAP is an acronym for Small World Asynchronous Parallel model. In the paper, a mathematical description of multi-step bi-directed graph (MSG) is provided to resolve the computational interdependence on merging edges, and a highly scalable computational framework for SWAP is developed to automatically preform the parallel computation of all operations. Graph cleaning and contig extension are also included for generating contigs with high quality. Experimental results show that SWAP-Assembler scales up to 2048 cores on Yanhuang dataset using only 26 minutes, which is better than several other parallel assemblers, such as ABySS, Ray, and PASHA. Results also show that SWAP-Assembler can generate high quality contigs with good N50 size and low error rate, especially it generated the longest N50 contig sizes for Fish and Yanhuang datasets. Conclusions: In this paper, we presented a highly scalable and efficient genome assembly software, SWAP-Assembler. Compared with several other assemblers, it showed very good performance in terms of scalability and contig quality. This software is available at: https://sourceforge.net/projects/swapassembler",
                "authors": [
                    {
                        "name": "Meng J."
                    },
                    {
                        "name": "Wang B."
                    },
                    {
                        "name": "Wei Y."
                    },
                    {
                        "name": "Feng S."
                    },
                    {
                        "name": "Balaji P."
                    }
                ],
                "citationCount": 16,
                "date": "2014-09-10T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "SWAP-Assembler: Scalable and efficient genome assembly towards thousands of cores"
            },
            "pmid": "25253533"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        }
    ],
    "validated": 1
}