{
    "additionDate": "2024-03-06T13:33:44.751332Z",
    "biotoolsCURIE": "biotools:hogimine",
    "biotoolsID": "hogimine",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "borgwardt@biochem.mpg.de",
            "name": "Karsten Borgwardt",
            "orcidid": "https://orcid.org/0000-0001-7221-2393",
            "typeEntity": "Person"
        },
        {
            "email": "pellizzoni@biochem.mpg.de",
            "name": "Paolo Pellizzoni",
            "typeEntity": "Person"
        }
    ],
    "description": "Higher-order genetic interaction discovery with network-based biological priors.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "SNP detection",
                    "uri": "http://edamontology.org/operation_0484"
                }
            ]
        }
    ],
    "homepage": "https://github.com/BorgwardtLab/HOGImine",
    "language": [
        "C",
        "C++",
        "Python"
    ],
    "lastUpdate": "2024-11-24T14:12:07.816451Z",
    "license": "GPL-3.0",
    "name": "HOGImine",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btad273",
            "metadata": {
                "abstract": "Motivation: Complex phenotypes, such as many common diseases and morphological traits, are controlled by multiple genetic factors, namely genetic mutations and genes, and are influenced by environmental conditions. Deciphering the genetics underlying such traits requires a systemic approach, where many different genetic factors and their interactions are considered simultaneously. Many association mapping techniques available nowadays follow this reasoning, but have some severe limitations. In particular, they require binary encodings for the genetic markers, forcing the user to decide beforehand whether to use, e.g. a recessive or a dominant encoding. Moreover, most methods cannot include any biological prior or are limited to testing only lower-order interactions among genes for association with the phenotype, potentially missing a large number of marker combinations. Results: We propose HOGImine, a novel algorithm that expands the class of discoverable genetic meta-markers by considering higher-order interactions of genes and by allowing multiple encodings for the genetic variants. Our experimental evaluation shows that the algorithm has a substantially higher statistical power compared to previous methods, allowing it to discover genetic mutations statistically associated with the phenotype at hand that could not be found before. Our method can exploit prior biological knowledge on gene interactions, such as protein–protein interaction networks, genetic pathways, and protein complexes, to restrict its search space. Since computing higher-order gene interactions poses a high computational burden, we also develop a more efficient search strategy and support computation to make our approach applicable in practice, leading to substantial runtime improvements compared to state-of-the-art methods.",
                "authors": [
                    {
                        "name": "Borgwardt K."
                    },
                    {
                        "name": "Muzio G."
                    },
                    {
                        "name": "Pellizzoni P."
                    }
                ],
                "citationCount": 2,
                "date": "2023-06-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Higher-order genetic interaction discovery with network-based biological priors"
            },
            "pmcid": "PMC10311320",
            "pmid": "37387173"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ]
}
