{
    "additionDate": "2021-01-18T08:56:57Z",
    "biotoolsCURIE": "biotools:cov-seq",
    "biotoolsID": "cov-seq",
    "collectionID": [
        "COVID-19"
    ],
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "jollier.liu@gmail.com",
            "name": "Boxiang Liu",
            "typeEntity": "Person"
        }
    ],
    "description": "CoV-Seq is a suite of tools and datasets for analysis and visualization of genomes of SARS-CoV-2, the virus that causes COVID-19. Sequences are collected from four major repositories: GISAID, NCBI, EMBL and CNGB.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genome visualisation",
                    "uri": "http://edamontology.org/operation_3208"
                },
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                },
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                },
                {
                    "term": "Coding region prediction",
                    "uri": "http://edamontology.org/operation_0436"
                }
            ]
        }
    ],
    "homepage": "http://covseq.baidu.com/",
    "language": [
        "Python",
        "JavaScript"
    ],
    "lastUpdate": "2021-02-17T18:56:41Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/boxiangliu/covseq"
        }
    ],
    "name": "CoV-Seq",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1101/2020.05.01.071050"
        },
        {
            "doi": "10.2196/22299",
            "metadata": {
                "abstract": "© Boxiang Liu, Kaibo Liu, He Zhang, Liang Zhang, Yuchen Bian, Liang Huang. Originally published in the Journal of Medical Internet Research (http://www.jmir.org), 02.10.2020. This is an open-access article distributed under the terms of the Creative Commons Attribution License (https://creativecommons.org/licenses/by/4.0/)Background: COVID-19 became a global pandemic not long after its identification in late 2019. The genomes of SARS-CoV-2 are being rapidly sequenced and shared on public repositories. To keep up with these updates, scientists need to frequently refresh and reclean data sets, which is an ad hoc and labor-intensive process. Further, scientists with limited bioinformatics or programming knowledge may find it difficult to analyze SARS-CoV-2 genomes. Objective: To address these challenges, we developed CoV-Seq, an integrated web server that enables simple and rapid analysis of SARS-CoV-2 genomes. Methods: CoV-Seq is implemented in Python and JavaScript. The web server and source code URLs are provided in this article. Results: Given a new sequence, CoV-Seq automatically predicts gene boundaries and identifies genetic variants, which are displayed in an interactive genome visualizer and are downloadable for further analysis. A command-line interface is available for high-throughput processing. In addition, we aggregated all publicly available SARS-CoV-2 sequences from the Global Initiative on Sharing Avian Influenza Data (GISAID), National Center for Biotechnology Information (NCBI), European Nucleotide Archive (ENA), and China National GeneBank (CNGB), and extracted genetic variants from these sequences for download and downstream analysis. The CoV-Seq database is updated weekly. Conclusions: We have developed CoV-Seq, an integrated web service for fast and easy analysis of custom SARS-CoV-2 sequences. The web server provides an interactive module for the analysis of custom sequences and a weekly updated database of genetic variants of all publicly accessible SARS-CoV-2 sequences. We believe CoV-Seq will help improve our understanding of the genetic underpinnings of COVID-19.",
                "authors": [
                    {
                        "name": "Liu B."
                    },
                    {
                        "name": "Liu K."
                    },
                    {
                        "name": "Zhang H."
                    },
                    {
                        "name": "Zhang L."
                    },
                    {
                        "name": "Bian Y."
                    },
                    {
                        "name": "Huang L."
                    }
                ],
                "date": "2020-10-02T00:00:00Z",
                "journal": "Journal of Medical Internet Research",
                "title": "CoV-Seq, a new tool for SARS-CoV-2 genome analysis and visualization: Development and usability study"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Whole genome sequencing",
            "uri": "http://edamontology.org/topic_3673"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        }
    ]
}