{
    "additionDate": "2018-09-01T10:24:25Z",
    "biotoolsCURIE": "biotools:s2rsldb",
    "biotoolsID": "s2rsldb",
    "credit": [
        {
            "email": "eamata@unict.it",
            "name": "Emanuele Amata",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Sigma-2 receptor selective Ligands Database is an online ligand database consisting of the Sigma-2 selective receptor ligand published since 1993. The S2RSLDB is based on structural 2D information as well as pharmacological and computed physicochemical properties and experimental procedures, retrieved from the literature.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://www.researchdsf.unict.it/S2RSLDB/pages/about.php"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                }
            ]
        }
    ],
    "homepage": "http://www.researchdsf.unict.it/S2RSLDB/",
    "lastUpdate": "2018-12-10T12:59:01Z",
    "name": "S2RSLDB",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1186/s13321-017-0191-5",
            "metadata": {
                "abstract": "© 2017 The Author(s).Background: Sigma (σ) receptors are accepted as a particular receptor class consisting of two subtypes: sigma-1 (σ1) and sigma-2 (σ2). The two receptor subtypes have specific drug actions, pharmacological profiles and molecular characteristics. The σ2 receptor is overexpressed in several tumor cell lines, and its ligands are currently under investigation for their role in tumor diagnosis and treatment. The σ2 receptor structure has not been disclosed, and researchers rely on σ2 receptor radioligand binding assay to understand the receptor's pharmacological behavior and design new lead compounds. Description: Here we present the sigma-2 Receptor Selective Ligands Database (S2RSLDB) a manually curated database of the σ2 receptor selective ligands containing more than 650 compounds. The database is built with chemical structure information, radioligand binding affinity data, computed physicochemical properties, and experimental radioligand binding procedures. The S2RSLDB is freely available online without account login and having a powerful search engine the user may build complex queries, sort tabulated results, generate color coded 2D and 3D graphs and download the data for additional screening. Conclusion: The collection here reported is extremely useful for the development of new ligands endowed of σ2 receptor affinity, selectivity, and appropriate physicochemical properties. The database will be updated yearly and in the near future, an online submission form will be available to help with keeping the database widely spread in the research community and continually updated. The database is available at http://www.researchdsf.unict.it/S2RSLDB. Graphical abstract:",
                "authors": [
                    {
                        "name": "Amata E."
                    },
                    {
                        "name": "Marrazzo A."
                    },
                    {
                        "name": "Miceli C."
                    },
                    {
                        "name": "Modica M.N."
                    },
                    {
                        "name": "Nastasi G."
                    },
                    {
                        "name": "Pittala V."
                    },
                    {
                        "name": "Prezzavento O."
                    },
                    {
                        "name": "Rescifina A."
                    },
                    {
                        "name": "Romeo G."
                    }
                ],
                "citationCount": 25,
                "date": "2017-01-21T00:00:00Z",
                "journal": "Journal of Cheminformatics",
                "title": "S2RSLDB: A comprehensive manually curated, internet-accessible database of the sigma-2 receptor selective ligands"
            }
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Cheminformatics",
            "uri": "http://edamontology.org/topic_2258"
        },
        {
            "term": "Immunoproteins, genes and antigens",
            "uri": "http://edamontology.org/topic_2830"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        }
    ],
    "validated": 1
}
