{
    "additionDate": "2020-01-14T09:44:52Z",
    "biotoolsCURIE": "biotools:multiple_tools_explore",
    "biotoolsID": "multiple_tools_explore",
    "confidence_flag": "tool",
    "description": "Discovery of disease- and drug-specific pathways through community structures of a literature network.\n\nLiterature mining and automated hypothesis-generation with.\n\nMeTeOR, or the MeSH Term Objective Reasoning network, is a network representation of genes, drugs, and diseases built on MeSH terms curated by the National Library of Medicine.\n\nMeTeOR mines the PubMed literature, revealing knowledge previously hidden in a sea of information",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Pathway or network prediction",
                    "uri": "http://edamontology.org/operation_3439"
                },
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "Text mining",
                    "uri": "http://edamontology.org/operation_0306"
                }
            ]
        }
    ],
    "homepage": "http://meteor.lichtargelab.org",
    "lastUpdate": "2020-12-29T10:52:25Z",
    "name": "multiple tools explore",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ857",
            "metadata": {
                "abstract": "© The Author(s) 2019.Motivation: In light of the massive growth of the scientific literature, text mining is increasingly used to extract biological pathways. Though multiple tools explore individual connections between genes, diseases and drugs, few extensively synthesize pathways for specific diseases and drugs. Results: Through community detection of a literature network, we extracted 3444 functional gene groups that represented biological pathways for specific diseases and drugs. The network linked Medical Subject Headings (MeSH) terms of genes, diseases and drugs that co-occurred in publications. The resulting communities detected highly associated genes, diseases and drugs. These significantly matched current knowledge of biological pathways and predicted future ones in time-stamped experiments. Likewise, disease- and drug-specific communities also recapitulated known pathways for those given diseases and drugs. Moreover, diseases sharing communities had high comorbidity with each other and drugs sharing communities had many common side effects, consistent with related mechanisms. Indeed, the communities robustly recovered mutual targets for drugs [area under Receiver Operating Characteristic curve (AUROC)¼0.75] and shared pathogenic genes for diseases (AUROC¼0.82). These data show that literature communities inform not only just known biological processes but also suggest novel disease- and drug-specific mechanisms that may guide disease gene discovery and drug repurposing.",
                "authors": [
                    {
                        "name": "Pham M."
                    },
                    {
                        "name": "Wilson S."
                    },
                    {
                        "name": "Govindarajan H."
                    },
                    {
                        "name": "Lin C.-H."
                    },
                    {
                        "name": "Lichtarge O."
                    }
                ],
                "citationCount": 1,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Discovery of disease- And drug-specific pathways through community structures of a literature network"
            },
            "pmid": "31738408"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Informatics",
            "uri": "http://edamontology.org/topic_0605"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Drug discovery",
            "uri": "http://edamontology.org/topic_3336"
        }
    ],
    "validated": 1
}