{
    "additionDate": "2021-01-18T10:05:26Z",
    "biotoolsCURIE": "biotools:omicson",
    "biotoolsID": "omicson",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "mpiwowar@cm-uj.krakow.pl",
            "name": "Monika Piwowar",
            "orcidid": "https://orcid.org/0000-0003-4645-8730",
            "typeEntity": "Person"
        }
    ],
    "description": "Integration of omics data with molecular networks and statistical procedures.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Expression correlation analysis",
                    "uri": "http://edamontology.org/operation_3463"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                },
                {
                    "term": "Dimensionality reduction",
                    "uri": "http://edamontology.org/operation_3935"
                }
            ]
        }
    ],
    "homepage": "https://github.com/cmujzbit/OmicsON",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-03-13T19:08:14Z",
    "name": "OmicsON",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PONE.0235398",
            "metadata": {
                "abstract": "© 2020 Turek et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.A huge amount of atomized biological data collected in various databases and the need for a description of their relation by theoretical methods causes the development of data integration methods. The omics data analysis by integration of biological knowledge with mathematical procedures implemented in the OmicsON R library is presented in the paper. OmicsON is a tool for the integration of two sets of data: transcriptomics and metabolomics. In the workflow of the library, the functional grouping and statistical analysis are applied. Subgroups among the transcriptomic and metabolomics sets are created based on the biological knowledge stored in Reactome and String databases. It gives the possibility to analyze such sets of data by multivariate statistical procedures like Canonical Correlation Analysis (CCA) or Partial Least Squares (PLS). The integration of metabolomic and transcriptomic data based on the methodology contained in OmicsON helps to easily obtain information on the connection of data from two different sets. This information can significantly help in assessing the relationship between gene expression and metabolite concentrations, which in turn facilitates the biological interpretation of the analyzed process.",
                "authors": [
                    {
                        "name": "Turek C."
                    },
                    {
                        "name": "Wrobel S."
                    },
                    {
                        "name": "Piwowar M."
                    }
                ],
                "date": "2020-07-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "OmicsON - Integration of omics data with molecular networks and statistical procedures"
            },
            "pmcid": "PMC7390260",
            "pmid": "32726348"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        },
        {
            "term": "Lipids",
            "uri": "http://edamontology.org/topic_0153"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ]
}