{
    "accessibility": "Open access",
    "additionDate": "2022-09-28T11:47:40.877142Z",
    "biotoolsCURIE": "biotools:tex",
    "biotoolsID": "tex",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "liweizhong@mail.sysu.edu.cn",
            "name": "Weizhong Li",
            "orcidid": "https://orcid.org/0000-0002-9003-7733",
            "typeEntity": "Person"
        },
        {
            "name": "Chenghao Lin"
        },
        {
            "name": "Haiyue Zhang"
        },
        {
            "name": "Kang Chen"
        },
        {
            "name": "Minglei Yang"
        },
        {
            "name": "Yanni Wang"
        }
    ],
    "description": "Identification of a cytokine-dominated immunosuppressive class in squamous cell lung carcinoma with implications for immunotherapy resistance.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Differential gene expression profiling",
                    "uri": "http://edamontology.org/operation_3223"
                },
                {
                    "term": "Expression correlation analysis",
                    "uri": "http://edamontology.org/operation_3463"
                },
                {
                    "term": "Gene-set enrichment analysis",
                    "uri": "http://edamontology.org/operation_2436"
                }
            ]
        }
    ],
    "homepage": "http://liwzlab.cn/tex",
    "lastUpdate": "2022-09-28T11:47:40.879731Z",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "http://lilab2.sysu.edu.cn/tex/#-en"
        }
    ],
    "name": "tex",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1186/S13073-022-01079-X",
            "metadata": {
                "abstract": "© 2022, The Author(s).Background: Immune checkpoint blockade (ICB) therapy has revolutionized the treatment of lung squamous cell carcinoma (LUSC). However, a significant proportion of patients with high tumour PD-L1 expression remain resistant to immune checkpoint inhibitors. To understand the underlying resistance mechanisms, characterization of the immunosuppressive tumour microenvironment and identification of biomarkers to predict resistance in patients are urgently needed. Methods: Our study retrospectively analysed RNA sequencing data of 624 LUSC samples. We analysed gene expression patterns from tumour microenvironment by unsupervised clustering. We correlated the expression patterns with a set of T cell exhaustion signatures, immunosuppressive cells, clinical characteristics, and immunotherapeutic responses. Internal and external testing datasets were used to validate the presence of exhausted immune status. Results: Approximately 28 to 36% of LUSC patients were found to exhibit significant enrichments of T cell exhaustion signatures, high fraction of immunosuppressive cells (M2 macrophage and CD4 Treg), co-upregulation of 9 inhibitory checkpoints (CTLA4, PDCD1, LAG3, BTLA, TIGIT, HAVCR2, IDO1, SIGLEC7, and VISTA), and enhanced expression of anti-inflammatory cytokines (e.g. TGFβ and CCL18). We defined this immunosuppressive group of patients as exhausted immune class (EIC). Although EIC showed a high density of tumour-infiltrating lymphocytes, these were associated with poor prognosis. EIC had relatively elevated PD-L1 expression, but showed potential resistance to ICB therapy. The signature of 167 genes for EIC prediction was significantly enriched in melanoma patients with ICB therapy resistance. EIC was characterized by a lower chromosomal alteration burden and a unique methylation pattern. We developed a web application (http://lilab2.sysu.edu.cn/tex & http://liwzlab.cn/tex) for researchers to further investigate potential association of ICB resistance based on our multi-omics analysis data. Conclusions: We introduced a novel LUSC immunosuppressive class which expressed high PD-L1 but showed potential resistance to ICB therapy. This comprehensive characterization of immunosuppressive tumour microenvironment in LUSC provided new insights for further exploration of resistance mechanisms and optimization of immunotherapy strategies.",
                "authors": [
                    {
                        "name": "Chen K."
                    },
                    {
                        "name": "Li W."
                    },
                    {
                        "name": "Lin C."
                    },
                    {
                        "name": "Wang Y."
                    },
                    {
                        "name": "Yang M."
                    },
                    {
                        "name": "Zhang H."
                    }
                ],
                "date": "2022-12-01T00:00:00Z",
                "journal": "Genome Medicine",
                "title": "Identification of a cytokine-dominated immunosuppressive class in squamous cell lung carcinoma with implications for immunotherapy resistance"
            },
            "pmcid": "PMC9264601",
            "pmid": "35799269"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Allergy, clinical immunology and immunotherapeutics",
            "uri": "http://edamontology.org/topic_3400"
        },
        {
            "term": "Epigenomics",
            "uri": "http://edamontology.org/topic_3173"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
