{
    "additionDate": "2021-01-18T10:20:13Z",
    "biotoolsCURIE": "biotools:recomia",
    "biotoolsID": "recomia",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "elin.tragardh@med.lu.se",
            "name": "Elin Trägårdh",
            "orcidid": "https://orcid.org/0000-0002-7116-303X",
            "typeEntity": "Person"
        }
    ],
    "description": "RECOMIA provides academic researchers with AI-based tools for automated quantification of CT, PET/CT, SPECT/CT and MR.\n\nThe Research Consortium for Medical Image Analysis (RECOMIA) is a not for profit organization with the objective of promoting research in the fields of artificial intelligence (AI) and medical imaging.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                },
                {
                    "term": "Image annotation",
                    "uri": "http://edamontology.org/operation_3553"
                }
            ]
        }
    ],
    "homepage": "http://www.recomia.org",
    "lastUpdate": "2021-02-04T16:32:12Z",
    "name": "RECOMIA",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1186/S40658-020-00316-9",
            "metadata": {
                "abstract": "© 2020, The Author(s).Background: Artificial intelligence (AI) is about to transform medical imaging. The Research Consortium for Medical Image Analysis (RECOMIA), a not-for-profit organisation, has developed an online platform to facilitate collaboration between medical researchers and AI researchers. The aim is to minimise the time and effort researchers need to spend on technical aspects, such as transfer, display, and annotation of images, as well as legal aspects, such as de-identification. The purpose of this article is to present the RECOMIA platform and its AI-based tools for organ segmentation in computed tomography (CT), which can be used for extraction of standardised uptake values from the corresponding positron emission tomography (PET) image. Results: The RECOMIA platform includes modules for (1) local de-identification of medical images, (2) secure transfer of images to the cloud-based platform, (3) display functions available using a standard web browser, (4) tools for manual annotation of organs or pathology in the images, (5) deep learning-based tools for organ segmentation or other customised analyses, (6) tools for quantification of segmented volumes, and (7) an export function for the quantitative results. The AI-based tool for organ segmentation in CT currently handles 100 organs (77 bones and 23 soft tissue organs). The segmentation is based on two convolutional neural networks (CNNs): one network to handle organs with multiple similar instances, such as vertebrae and ribs, and one network for all other organs. The CNNs have been trained using CT studies from 339 patients. Experienced radiologists annotated organs in the CT studies. The performance of the segmentation tool, measured as mean Dice index on a manually annotated test set, with 10 representative organs, was 0.93 for all foreground voxels, and the mean Dice index over the organs were 0.86 (0.82 for the soft tissue organs and 0.90 for the bones). Conclusion: The paper presents a platform that provides deep learning-based tools that can perform basic organ segmentations in CT, which can then be used to automatically obtain the different measurement in the corresponding PET image. The RECOMIA platform is available on request at www.recomia.org for research purposes.",
                "authors": [
                    {
                        "name": "Tragardh E."
                    },
                    {
                        "name": "Borrelli P."
                    },
                    {
                        "name": "Kaboteh R."
                    },
                    {
                        "name": "Gillberg T."
                    },
                    {
                        "name": "Ulen J."
                    },
                    {
                        "name": "Enqvist O."
                    },
                    {
                        "name": "Edenbrandt L."
                    }
                ],
                "citationCount": 2,
                "date": "2020-12-01T00:00:00Z",
                "journal": "EJNMMI Physics",
                "title": "RECOMIA—a cloud-based platform for artificial intelligence research in nuclear medicine and radiology"
            },
            "pmcid": "PMC7403290",
            "pmid": "32754893"
        }
    ],
    "topic": [
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        },
        {
            "term": "Tomography",
            "uri": "http://edamontology.org/topic_3452"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Medicine",
            "uri": "http://edamontology.org/topic_3303"
        },
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        }
    ]
}