{
    "accessibility": "Open access",
    "additionDate": "2022-03-13T18:38:43.105494Z",
    "biotoolsCURIE": "biotools:specollate",
    "biotoolsID": "specollate",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "fsaeed@fiu.edu",
            "name": "Fahad Saeed",
            "orcidid": "https://orcid.org/0000-0002-3410-9552",
            "typeEntity": "Person"
        },
        {
            "name": "Muhammad Usman Tariq",
            "orcidid": "https://orcid.org/0000-0003-4643-3875"
        }
    ],
    "description": "Deep cross-modal similarity network for mass spectrometry data based peptide deductions.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Peptide identification",
                    "uri": "http://edamontology.org/operation_3631"
                },
                {
                    "term": "Spectrum calculation",
                    "uri": "http://edamontology.org/operation_3860"
                }
            ]
        }
    ],
    "homepage": "https://deepspecs.github.io/",
    "lastUpdate": "2022-03-13T18:38:43.107989Z",
    "license": "Not licensed",
    "name": "SpeCollate",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PONE.0259349",
            "metadata": {
                "abstract": "© 2021 Tariq, Saeed. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Historically, the database search algorithms have been the de facto standard for inferring peptides from mass spectrometry (MS) data. Database search algorithms deduce peptides by transforming theoretical peptides into theoretical spectra and matching them to the experimental spectra. Heuristic similarity-scoring functions are used to match an experimental spectrum to a theoretical spectrum. However, the heuristic nature of the scoring functions and the simple transformation of the peptides into theoretical spectra, along with noisy mass spectra for the less abundant peptides, can introduce a cascade of inaccuracies. In this paper, we design and implement a Deep Cross-Modal Similarity Network called SpeCollate, which overcomes these inaccuracies by learning the similarity function between experimental spectra and peptides directly from the labeled MS data. SpeCollate transforms spectra and peptides into a shared Euclidean subspace by learning fixed size embeddings for both. Our proposed deep-learning network trains on sextuplets of positive and negative examples coupled with our custom-designed SNAP-loss function. Online hardest negative mining is used to select the appropriate negative examples for optimal training performance. We use 4.8 million sextuplets obtained from the NIST and MassIVE peptide libraries to train the network and demonstrate that for closed search, SpeCollate is able to perform better than Crux and MSFragger in terms of the number of peptide-spectrum matches (PSMs) and unique peptides identified under 1% FDR for real-world data. SpeCollate also identifies a large number of peptides not reported by either Crux or MSFragger. To the best of our knowledge, our proposed SpeCollate is the first deep-learning network that can determine the cross-modal similarity between peptides and mass-spectra for MS-based proteomics. We believe SpeCollate is significant progress towards developing machine-learning solutions for MS-based omics data analysis. SpeCollate is available at https://deepspecs.github.io/.",
                "authors": [
                    {
                        "name": "Saeed F."
                    },
                    {
                        "name": "Tariq M.U."
                    }
                ],
                "citationCount": 1,
                "date": "2021-10-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "SpeCollate: Deep cross-modal similarity network for mass spectrometry data based peptide deductions"
            },
            "pmcid": "PMC8555789",
            "pmid": "34714871"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ],
    "validated": 1
}
