{
    "additionDate": "2021-01-18T12:17:06Z",
    "biotoolsCURIE": "biotools:ewasex",
    "biotoolsID": "ewasex",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "qtan@health.sdu.dk",
            "name": "Qihua Tan",
            "typeEntity": "Person"
        }
    ],
    "description": "EWASex is an efficient R-package to predict sex in epigenome-wide association studies.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "PTM site prediction",
                    "uri": "http://edamontology.org/operation_0417"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Silver-Hawk/EWASex",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-03-08T10:11:55Z",
    "name": "EWASex",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAA949",
            "metadata": {
                "abstract": "© The Author(s) 2020. Published by Oxford University Press. All rights reserved. For permissions, please e-mail: journals.permissions@oup.com.Epigenome-Wide Association Study (EWAS) has become a powerful approach to identify epigenetic variations associated with diseases or health traits. Sex is an important variable to include in EWAS to ensure unbiased data processing and statistical analysis. We introduce the R-package EWASex, which allows for fast and highly accurate sex-estimation using DNA methylation data on a small set of CpG sites located on the X-chromosome under stable X-chromosome inactivation in females. Results: We demonstrate that EWASex outperforms the current state of the art tools by using different EWAS datasets. With EWASex, we offer an efficient way to predict and to verify sex that can be easily implemented in any EWAS using blood samples or even other tissue types. It comes with pre-trained weights to work without prior sex labels and without requiring access to RAW data, which is a necessity for all currently available methods. Availability and implementation: The EWASex R-package along with tutorials, documentation and source code are available at https://github.com/Silver-Hawk/EWASex.",
                "authors": [
                    {
                        "name": "Baumbach J."
                    },
                    {
                        "name": "Li S."
                    },
                    {
                        "name": "Li W."
                    },
                    {
                        "name": "Lund J.B."
                    },
                    {
                        "name": "Mohammadnejad A."
                    },
                    {
                        "name": "Tan Q."
                    }
                ],
                "date": "2021-07-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "EWASex: An efficient R-package to predict sex in epigenome-wide association studies"
            },
            "pmid": "33313760"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        }
    ]
}
