{
    "additionDate": "2017-12-18T00:06:36Z",
    "biotoolsCURIE": "biotools:funmap",
    "biotoolsID": "funmap",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://statgen.psu.edu/index.html"
        }
    ],
    "description": "The Funmap package is developed to identify quantitative trait loci (QTL) for a longitudinal, or vectorized, phenotypic trait as based on the Funmap model",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://statgen.psu.edu/software/funmap/Funmap-intro-v2.2.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Functional mapping",
                    "uri": "http://edamontology.org/operation_0282"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Mapping",
                    "uri": "http://edamontology.org/operation_2429"
                }
            ]
        }
    ],
    "homepage": "http://statgen.psu.edu/software/funmap.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2019-01-15T03:17:01Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/funmap-2-2-1-functional-mapping-package.html"
        }
    ],
    "name": "Funmap",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Unlike a character measured at a finite set of landmark points, function-valued traits are those that change as a function of some independent and continuous variable. These traits, also called infinite-dimensional characters, can be described as the character process and include a number of biologically, economically, or biomedically important features, such as growth trajectories, allometric scalings, and norms of reaction. Here we present a new statistical infrastructure for mapping quantitative trait loci (QTL) underlying the character process. This strategy, termed functional mapping, integrates mathematical relationships of different traits or variables within the genetic mapping framework. Logistic mapping proposed in this article can be viewed as an example of functional mapping. Logistic mapping is based on a universal biological law that for each and every living organism growth over time follows an exponential growth curve (e.g., logistic or S-shaped). A maximum-likelihood approach based on a logistic-mixture model, implemented with the EM algorithm, is developed to provide the estimates of QTL positions, QTL effects, and other model parameters responsible for growth trajectories. Logistic mapping displays a tremendous potential to increase the power of QTL detection, the precision of parameter estimation, and the resolution of QTL localization due to the small number of parameters to be estimated, the pleiotropic effect of a QTL on growth, and/or residual correlations of growth at different ages. More importantly, logistic mapping allows for testing numerous biologically important hypotheses concerning the genetic basis of quantitative variation, thus gaining an insight into the critical role of development in shaping plant and animal evolution and domestication. The power of logistic mapping is demonstrated by an example of a forest tree, in which one QTL affecting stem growth processes is detected on a linkage group using our method, whereas it cannot be detected using current methods. The advantages of functional mapping are also discussed.",
                "authors": [
                    {
                        "name": "Chang-Xing Ma."
                    },
                    {
                        "name": "Casella G."
                    },
                    {
                        "name": "Wu R."
                    }
                ],
                "citationCount": 223,
                "date": "2002-08-01T00:00:00Z",
                "journal": "Genetics",
                "title": "Functional mapping of quantitative trait loci underlying the character process: A theoretical framework"
            },
            "pmcid": "PMC1462199",
            "pmid": "12196415",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        }
    ],
    "validated": 1,
    "version": [
        "2.2.1"
    ]
}