{
    "additionDate": "2017-01-17T14:55:40Z",
    "biotoolsCURIE": "biotools:fithic",
    "biotoolsID": "fithic",
    "collectionID": [
        "BioConductor"
    ],
    "credit": [
        {
            "email": "rut003@ucsd.edu",
            "name": "Ruyu Tan",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Tool for assigning statistical confidence estimates to intra-chromosomal contact maps produced by genome-wide genome architecture assays such as Hi-C.",
    "documentation": [
        {
            "type": "User manual",
            "url": "http://bioconductor.org/packages/release/bioc/html/FitHiC.html"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://bioconductor/packages/release/bioc/src/contrib/FitHiC_1.0.0.tar.gz"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Statistical calculation",
                    "uri": "http://edamontology.org/operation_2238"
                }
            ]
        }
    ],
    "homepage": "http://bioconductor.org/packages/release/bioc/html/FitHiC.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-14T10:59:59Z",
    "license": "GPL-2.0",
    "name": "FitHiC",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "bioconductor_import",
    "publication": [
        {
            "doi": "10.1101/gr.160374.113",
            "metadata": {
                "abstract": "Our current understanding of how DNA is packed in the nucleus is most accurate at the fine scale of individual nucleosomes and at the large scale of chromosome territories. However, accurate modeling of DNA architecture at the intermediate scale of ∼50 kb-10 Mb is crucial for identifying functional interactions among regulatory elements and their target promoters. We describe a method, Fit-Hi-C, that assigns statistical confidence estimates to mid-range intra-chromosomal contacts by jointly modeling the random polymer looping effect and previously observed technical biases in Hi-C data sets. We demonstrate that our proposed approach computes accurate empirical null models of contact probability without any distribution assumption, corrects for binning artifacts, and provides improved statistical power relative to a previously described method. High-confidence contacts identified by Fit-Hi-C preferentially link expressed gene promoters to active enhancers identified by chromatin signatures in human embryonic stem cells (ESCs), capture 77% ofRNA polymerase II-mediated enhancer-promoter interactions identified using ChIA-PET in mouse ESCs, and confirm previously validated, cell line-specific interactions in mouse cortex cells. We observe that insulators and heterochromatin regions are hubs for high-confidence contacts, while promoters and strong enhancers are involved in fewer contacts. We also observe that binding peaks of master pluripotency factors such as NANOG and POU5F1 are highly enriched in high-confidence contacts for human ESCs. Furthermore, we show that pairs of loci linked by high-confidence contacts exhibit similar replication timing in human and mouse ESCs and preferentially lie within the boundaries of topological domains for human and mouse cell lines. © 2014 Ay et al.",
                "authors": [
                    {
                        "name": "Ay F."
                    },
                    {
                        "name": "Bailey T.L."
                    },
                    {
                        "name": "Noble W.S."
                    }
                ],
                "citationCount": 98,
                "date": "2014-01-01T00:00:00Z",
                "journal": "Genome Research",
                "title": "Statistical confidence estimation for Hi-C data reveals regulatory chromatin contacts"
            },
            "type": "Primary"
        },
        {
            "doi": "10.1101/gr.160374",
            "type": "Primary"
        }
    ],
    "toolType": [
        "Command-line tool",
        "Library"
    ],
    "topic": [
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        }
    ],
    "validated": 1,
    "version": [
        "1.0.0"
    ]
}