{
    "additionDate": "2022-03-14T07:30:16.901130Z",
    "biotoolsCURIE": "biotools:aln2tbl",
    "biotoolsID": "aln2tbl",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "jpons@imedea.uib-csic.es",
            "name": "Joan Pons",
            "orcidid": "https://orcid.org/0000-0002-4683-8840",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Aln2tbl is a Python script for building a mitochondrial features table from a assembly alignment in fasta format. The sequencing, annotation and analysis of complete mitochondrial genomes is an important research tool in phylogeny and evolution. Starting with the primary sequence, genes features are generally annotated automatically to obtain preliminary annotations in the form of a feature table. Further manual curation in a graphic alignment editor is nevertheless necessary to revise annotations. As such, the automatically generated feature table is invalidated and has to be modified manually before submission to data banks.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                },
                {
                    "term": "Sequence annotation",
                    "uri": "http://edamontology.org/operation_0361"
                },
                {
                    "term": "Sequence assembly",
                    "uri": "http://edamontology.org/operation_0310"
                }
            ]
        }
    ],
    "homepage": "https://github.com/IMEDEA/mitogenomics",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-03-14T07:30:16.904489Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/IMEDEA/mitogenomics/issues"
        }
    ],
    "name": "Aln2tbl",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1080/23802359.2021.1966334",
            "metadata": {
                "abstract": "© 2021 The Author(s). Published by Informa UK Limited, trading as Taylor & Francis Group.The sequencing, annotation and analysis of complete mitochondrial genomes is an important research tool in phylogeny and evolution. Starting with the primary sequence, genes/features are generally annotated automatically to obtain preliminary annotations in the form of a feature table. Further manual curation in a graphic alignment editor is nevertheless necessary to revise annotations. As such, the automatically generated feature table is invalidated and has to be modified manually before submission to data banks. We developed aln2tbl.py, a python script that recreates a feature table from a manually refined alignment of genes mapped on the mitochondrial genome in fasta format. The feature table is populated with notes and annotations specific to mitochondrial genomes. The table can be used to create a sqn file to be submitted directly to data banks. In summary, our scripts fills one gap in the available toolbox and, combined with other software, allows the automation of the entire process, from primary sequence to annotated genome submission, even if a manual curation step is conducted in a visual sequence editor.",
                "authors": [
                    {
                        "name": "Bover P."
                    },
                    {
                        "name": "Ensenyat J.J."
                    },
                    {
                        "name": "Nardi F."
                    },
                    {
                        "name": "Pons J."
                    },
                    {
                        "name": "Serra M."
                    }
                ],
                "date": "2021-01-01T00:00:00Z",
                "journal": "Mitochondrial DNA Part B: Resources",
                "title": "Aln2tbl: building a mitochondrial features table from a assembly alignment in fasta format"
            },
            "pmcid": "PMC8386716",
            "pmid": "34447886",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Phylogeny",
            "uri": "http://edamontology.org/topic_0084"
        },
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        }
    ]
}
