
{
    "credit": [
        {
            "email": "nfo@profilegrid.org",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://www.profilegrid.org/contact.shtml"
        }
    ],
    "documentation": [
        {
            "type": "Training material",
            "url": "http://www.profilegrid.org/examples.shtml"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Multiple sequence alignment",
                    "uri": "http://edamontology.org/operation_0492"
                },
                {
                    "term": "Sequence visualisation",
                    "uri": "http://edamontology.org/operation_0564"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Java"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Desktop application"
        ],
        "topic": [
            {
                "term": "Sequence analysis",
                "uri": "http://edamontology.org/topic_0080"
            },
            {
                "term": "Data visualisation",
                "uri": "http://edamontology.org/topic_0092"
            },
            {
                "term": "Genetics",
                "uri": "http://edamontology.org/topic_3053"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/jprofilegrid-2-0-4-multiple-sequence-alignment-tool-generates-profilegrids.html"
        }
    ],
    "publication": [
        {
            "abstract": "Background: Multiple sequence alignments are a fundamental tool for the comparative analysis of proteins and nucleic acids. However, large data sets are no longer manageable for visualization and investigation using the traditional stacked sequence alignment representation. Results: We introduce ProfileGrids that represent a multiple sequence alignment as a matrix color-coded according to the residue frequency occurring at each column position. JProfileGrid is a Java application for computing and analyzing ProfileGrids. A dynamic interaction with the alignment information is achieved by changing the ProfileGrid color scheme, by extracting sequence subsets at selected residues of interest, and by relating alignment information to residue physical properties. Conserved family motifs can be identified by the overlay of similarity plot calculations on a ProfileGrid. Figures suitable for publication can be generated from the saved spreadsheet output of the colored matrices as well as by the export of conservation information for use in the PyMOL molecular visualization program. We demonstrate the utility of ProfileGrids on 300 bacterial homologs of the RecA family - a universally conserved protein involved in DNA recombination and repair. Careful attention was paid to curating the collected RecA sequences since ProfileGrids allow the easy identification of rare residues in an alignment. We relate the RecA alignment sequence conservation to the following three topics: the recently identified DNA binding residues, the unexplored MAW motif, and a unique Bacillus subtilis RecA homolog sequence feature. Conclusion: ProfileGrids allow large protein families to be visualized more effectively than the traditional stacked sequence alignment form. This new graphical representation facilitates the determination of the sequence conservation at residue positions of interest, enables the examination of structural patterns by using residue physical properties, and permits the display of rare sequence features within the context of an entire alignment. JProfileGrid is free for non-commercial use and is available from http://www.profilegrid.org. Furthermore, we present a curated RecA protein collection that is more diverse than previous data sets; and, therefore, this RecA ProfileGrid is a rich source of information for nanoanatomy analysis. © 2008 Roca et al; licensee BioMed Central Ltd.",
            "authors": [
                "Roca A.I.",
                "Almada A.E.",
                "Abajian A.C."
            ],
            "cit_count": 6,
            "journal": "BMC Bioinformatics",
            "pmid": "19102758",
            "title": "ProfileGrids as a new visual representation of large multiple sequence alignments: A case study of the RecA protein family",
            "year": "2008-12-22"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:jprofilegrid",
        "biotoolsID": "jprofilegrid",
        "description": "Java-based multiple sequence alignment tool that generates ProfileGrids for analysis and export. ProfileGrids are a new paradigm for visualizing and analyzing MSAs in a concise representation. For a protein sequence, a ProfileGrid matrix contains positional amino acid counts highlighted according to the frequency of the characters in the alignment.",
        "homepage": "http://www.profilegrid.org/",
        "name": "JProfileGrid"
    }
}