{
    "additionDate": "2022-01-17T12:48:49.517779Z",
    "biotoolsCURIE": "biotools:digepred",
    "biotoolsID": "digepred",
    "collectionID": [
        "Rare Disease"
    ],
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "jens@meilerlab.org",
            "name": "Jens Meiler",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "tony@capralab.org",
            "name": "John A. Capra",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "DiGePred is a tool for identifying digenic disease genes via machine learning in the Undiagnosed Diseases Network. Rare diseases affect millions of people worldwide, and discovering their genetic causes is challenging. More than half of the individuals analyzed by the Undiagnosed Diseases Network (UDN) remain undiagnosed. The central hypothesis of this work is that many of these rare genetic disorders are caused by multiple variants in more than one gene. However, given the large number of variants in each individual genome, experimentally evaluating combinations of variants for potential to cause disease is currently infeasible.",
    "editPermission": {
        "type": "private"
    },
    "homepage": "https://github.com/CapraLab/DiGePred",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-01-17T12:49:00.829804Z",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/CapraLab/DiGePred/issues"
        }
    ],
    "name": "DiGePred",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1016/J.AJHG.2021.08.010",
            "metadata": {
                "abstract": "© 2021 American Society of Human GeneticsRare diseases affect millions of people worldwide, and discovering their genetic causes is challenging. More than half of the individuals analyzed by the Undiagnosed Diseases Network (UDN) remain undiagnosed. The central hypothesis of this work is that many of these rare genetic disorders are caused by multiple variants in more than one gene. However, given the large number of variants in each individual genome, experimentally evaluating combinations of variants for potential to cause disease is currently infeasible. To address this challenge, we developed the digenic predictor (DiGePred), a random forest classifier for identifying candidate digenic disease gene pairs by features derived from biological networks, genomics, evolutionary history, and functional annotations. We trained the DiGePred classifier by using DIDA, the largest available database of known digenic-disease-causing gene pairs, and several sets of non-digenic gene pairs, including variant pairs derived from unaffected relatives of UDN individuals. DiGePred achieved high precision and recall in cross-validation and on a held-out test set (PR area under the curve > 77%), and we further demonstrate its utility by using digenic pairs from the recent literature. In contrast to other approaches, DiGePred also appropriately controls the number of false positives when applied in realistic clinical settings. Finally, to enable the rapid screening of variant gene pairs for digenic disease potential, we freely provide the predictions of DiGePred on all human gene pairs. Our work enables the discovery of genetic causes for rare non-monogenic diseases by providing a means to rapidly evaluate variant gene pairs for the potential to cause digenic disease.",
                "authors": [
                    {
                        "name": "Capra J.A."
                    },
                    {
                        "name": "Cogan J.D."
                    },
                    {
                        "name": "Hamid R."
                    },
                    {
                        "name": "Meiler J."
                    },
                    {
                        "name": "Mukherjee S."
                    },
                    {
                        "name": "Newman J.H."
                    },
                    {
                        "name": "Phillips J.A."
                    }
                ],
                "date": "2021-10-07T00:00:00Z",
                "journal": "American Journal of Human Genetics",
                "title": "Identifying digenic disease genes via machine learning in the Undiagnosed Diseases Network"
            },
            "pmcid": "PMC8546038",
            "pmid": "34529933",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Rare diseases",
            "uri": "http://edamontology.org/topic_3325"
        }
    ]
}
