{"credit":[{"email":"ivan.costa@rwth-aachen.de","name":"Ivan G Costa","typeEntity":"Person","typeRoles":["Primary contact"]}],"function":[{"operation":[{"term":"Peak calling","uri":"http://edamontology.org/operation_3222"}]}],"labels":{"language":["Python"],"maturity":"Mature","toolType":["Suite"],"topic":[{"term":"Genomics","uri":"http://edamontology.org/topic_0622"},{"term":"Gene regulation","uri":"http://edamontology.org/topic_0204"}]},"publication":[{"abstract":"φC31 integrase is a sequence-specific phage recombinase that can recombine two short DNA sequences called attB and attP. The enzyme can also promote genomic integration of plasmids carrying attB into native mammalian sequences having partial identity to attP. To increase the efficiency of integration, we mutated the φC31 integrase gene and screened the mutants in human cells in an assay for higher recombination frequency between attB and attP. We report in this article the isolation of a mutant, P2 that has twice the chromosomal integration frequency of wild-type φC31 integrase, at both a preintegrated chromosomal attP site and at endogenous pseudo attP sequences in cultured human cells. In mouse liver, P2-mediated integration provided therapeutic long-term levels of human factor IX that were double those generated by wild-type φC31 integrase. We also describe an additional mutant, P3 that combines the mutations of P2 with further changes and possesses an elevated specificity for integration at a chromosomally placed attP site in human cells. Forty-four percent of colonies carrying integration events mediated by P3 have integration at the placed attP site. These mutant integrases are useful for gene therapy and genome modification, and they demonstrate the feasibility of engineering φC31 integrase toward more desirable properties.","authors":["Keravala A.","Lee S.","Thyagarajan B.","Olivares E.C.","Gabrovsky V.E.","Woodard L.E.","Calos M.P."],"cit_count":55,"journal":"Molecular Therapy","pmid":"19002165","title":"Mutational derivatives of PhiC31 integrase with increased efficiency and specificity","year":"2009-01-01"}],"summary":{"biotoolsCURIE":"biotools:odin","biotoolsID":"odin","description":"ODIN is an HMM-based approach to detect and analyse differential peaks in pairs of ChIP-seq data.","homepage":"http://costalab.org/publications-2/odin/","name":"ODIN"}}