{"credit":[{"name":"Olivier Martin","typeEntity":"Person","typeRoles":["Primary contact"],"url":"https://sourceforge.net/u/voltigeur/profile/"}],"documentation":[{"type":"GENERAL","url":"http://associationviewer.vital-it.ch/usage.php"}],"function":[{"operation":[{"term":"Annotation","uri":"http://edamontology.org/operation_0226"}]}],"labels":{"language":["Java"],"operatingSystem":["Linux","Windows","Mac"],"toolType":["Web application"],"topic":[{"term":"Genomics","uri":"http://edamontology.org/topic_0622"}]},"publication":[{"abstract":"We present a tool designed for visualization of large-scale genetic and genomic data exemplified by results from genome-wide association studies. This software provides an integrated framework to facilitate the interpretation of SNP association studies in genomic context. Gene annotations can be retrieved from Ensembl, linkage disequilibrium data downloaded from HapMap and custom data imported in BED or WIG format. AssociationViewer integrates functionalities that enable the aggregation or intersection of data tracks. It implements an efficient cache system and allows the display of several, very large-scale genomic datasets. Availability: The Java code for AssociationViewer is distributed under the GNU General Public Licence and has been tested on Microsoft Windows XP, MacOSX and GNU/Linux operating systems. It is available from the SourceForge repository. This also includes Java webstart, documentation and example datafiles. © 2009 The Author(s).","authors":["Martin O.","Valsesia A.","Telenti A.","Xenarios I.","Stevenson B.J."],"cit_count":1,"doi":"10.1093/bioinformatics/btp017","journal":"Bioinformatics","title":"AssociationViewer: A scalable and integrated software tool for visualization of large-scale variation data in genomic context","type":"Primary","year":"2009-03-01"}],"summary":{"biotoolsCURIE":"biotools:association_viewer","biotoolsID":"association_viewer","description":"AssociationViewer is a Java application used to display SNPs in a genetic context. Supplementary data (such as genes or LD plots) is downloaded from various public data sources on the fly and saved locally in a cache. Custom data can be added as supplementary tracks.","homepage":"http://associationviewer.vital-it.ch/","name":"Association Viewer"}}