{
    "additionDate": "2021-01-18T07:31:37Z",
    "biotoolsCURIE": "biotools:winbest-kit",
    "biotoolsID": "winbest-kit",
    "confidence_flag": "tool",
    "credit": [
        {
            "name": "Tatsuya Sekiguchi",
            "typeEntity": "Person"
        }
    ],
    "description": "Biochemical reaction simulator that can define and customize algebraic equations and events as GUI components.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Metabolic network modelling",
                    "uri": "http://edamontology.org/operation_3660"
                }
            ]
        }
    ],
    "homepage": "http://winbest-kit.org/",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2021-03-14T12:26:24Z",
    "name": "WinBEST-KIT",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1142/S0219720019500367",
            "metadata": {
                "abstract": "© 2019 World Scientific Publishing Europe Ltd.We previously developed Windows-based Biochemical Engineering System analyzing Tool-KIT (WinBEST-KIT), a biochemical reaction simulator for analyzing large-scale and complicated biochemical reaction networks. One particularly notable feature is the ability for users to define original mathematical equations for representing unknown kinetic mechanisms and customize them as GUI components for representing reaction steps. Many simulators support System Biology Markup Language SBML; however, since the definition of the algebraic equations (AssignmentRule) and the events are made through an interface that is distinct from the definition of the reaction steps, there are tough works to define them. Accordingly, we have developed a new version of WinBEST-KIT that allows users to define the algebraic equations and the events through the same interface as those used in the definition of the reaction steps and customize them as GUI components appearing in the symbol selection area. The customized algebraic equations and events can thus be visually arranged at any time and any place. It also allows users to easily understand the roles of the algebraic equations and the events. We have also implemented other useful features, including importing/exporting of SBML format files, exporting to MATLAB, and merging the existing models into the model currently being created. The current version of WinBEST-KIT is freely available at http://winbest-kit.org/.",
                "authors": [
                    {
                        "name": "Sekiguchi T."
                    },
                    {
                        "name": "Hamada H."
                    },
                    {
                        "name": "Okamoto M."
                    }
                ],
                "citationCount": 1,
                "date": "2019-12-01T00:00:00Z",
                "journal": "Journal of Bioinformatics and Computational Biology",
                "title": "WinBEST-KIT: Biochemical reaction simulator that can define and customize algebraic equations and events as GUI components"
            },
            "pmid": "32019416"
        }
    ],
    "topic": [
        {
            "term": "Mathematics",
            "uri": "http://edamontology.org/topic_3315"
        },
        {
            "term": "Biochemistry",
            "uri": "http://edamontology.org/topic_3292"
        },
        {
            "term": "Systems biology",
            "uri": "http://edamontology.org/topic_2259"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Endocrinology and metabolism",
            "uri": "http://edamontology.org/topic_3407"
        }
    ]
}