{
    "additionDate": "2022-09-28T11:08:50.607933Z",
    "biotoolsCURIE": "biotools:algpred2",
    "biotoolsID": "algpred2",
    "credit": [
        {
            "name": "Gajendra P.S. Raghava",
            "url": "https://webs.iiitd.edu.in/raghava/algpred2/"
        }
    ],
    "description": "AlgPred 2.0 is an updated version of our old server AlgPred developed for predicting allergenic proteins",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://webs.iiitd.edu.in/raghava/algpred2/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein function prediction",
                    "uri": "http://edamontology.org/operation_1777"
                }
            ]
        }
    ],
    "homepage": "https://webs.iiitd.edu.in/raghava/algpred2/",
    "lastUpdate": "2024-11-24T15:34:45.623616Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "https://webs.iiitd.edu.in/raghava/algpred2/"
        }
    ],
    "name": "algpred2",
    "owner": "raghavagps",
    "publication": [
        {
            "doi": "10.1093/bib/bbaa294",
            "metadata": {
                "abstract": "AlgPred 2.0 is a web server developed for predicting allergenic proteins and allergenic regions in a protein. It is an updated version of AlgPred developed in 2006. The dataset used for training, testing and validation consists of 10 075 allergens and 10 075 non-allergens. In addition, 10 451 experimentally validated immunoglobulin E (IgE) epitopes were used to identify antigenic regions in a protein. All models were trained on 80% of data called training dataset, and the performance of models was evaluated using 5-fold cross-validation technique. The performance of the final model trained on the training dataset was evaluated on 20% of data called validation dataset; no two proteins in any two sets have more than 40% similarity. First, a Basic Local Alignment Search Tool (BLAST) search has been performed against the dataset, and allergens were predicted based on the level of similarity with known allergens. Second, IgE epitopes obtained from the IEDB database were searched in the dataset to predict allergens based on their presence in a protein. Third, motif-based approaches like multiple EM for motif elicitation/motif alignment and search tool have been used to predict allergens. Fourth, allergen prediction models have been developed using a wide range of machine learning techniques. Finally, the ensemble approach has been used for predicting allergenic protein by combining prediction scores of different approaches. Our best model achieved maximum performance in terms of area under receiver operating characteristic curve 0.98 with Matthew's correlation coefficient 0.85 on the validation dataset. A web server AlgPred 2.0 has been developed that allows the prediction of allergens, mapping of IgE epitope, motif search and BLAST search (https://webs.iiitd.edu.in/raghava/algpred2/).",
                "authors": [
                    {
                        "name": "Arora C."
                    },
                    {
                        "name": "Dhall A."
                    },
                    {
                        "name": "Pande A."
                    },
                    {
                        "name": "Patiyal S."
                    },
                    {
                        "name": "Raghava G.P.S."
                    },
                    {
                        "name": "Sharma N."
                    }
                ],
                "citationCount": 149,
                "date": "2021-07-01T00:00:00Z",
                "journal": "Briefings in Bioinformatics",
                "title": "AlgPred 2.0: An improved method for predicting allergenic proteins and mapping of IgE epitopes"
            },
            "pmid": "33201237"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Computational biology",
            "uri": "http://edamontology.org/topic_3307"
        }
    ]
}
