{
    "additionDate": "2023-01-28T12:59:46.000759Z",
    "biotoolsCURIE": "biotools:farnet",
    "biotoolsID": "farnet",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "aoyueyuan@qq.com",
            "name": "Yueyuan Ao",
            "typeEntity": "Person"
        },
        {
            "email": "hwu@uestc.edu.cn",
            "name": "Hong Wu",
            "typeEntity": "Person"
        }
    ],
    "description": "A novel deep network named feature aggregation and refinement network (FARNet) for automatically detecting anatomical landmarks.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "https://github.com/JuvenileInWind/FARNet",
    "language": [
        "Python"
    ],
    "lastUpdate": "2023-01-28T12:59:46.003693Z",
    "license": "Not licensed",
    "name": "FARNet",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1007/S10278-022-00718-4",
            "metadata": {
                "abstract": "© 2022, The Author(s) under exclusive licence to Society for Imaging Informatics in Medicine.Localization of anatomical landmarks is essential for clinical diagnosis, treatment planning, and research. This paper proposes a novel deep network named feature aggregation and refinement network (FARNet) for automatically detecting anatomical landmarks. FARNet employs an encoder-decoder structure architecture. To alleviate the problem of limited training data in the medical domain, we adopt a backbone network pre-trained on natural images as the encoder. The decoder includes a multi-scale feature aggregation module for multi-scale feature fusion and a feature refinement module for high-resolution heatmap regression. Coarse-to-fine supervisions are applied to the two modules to facilitate end-to-end training. We further propose a novel loss function named Exponential Weighted Center loss for accurate heatmap regression, which focuses on the losses from the pixels near landmarks and suppresses the ones from far away. We evaluate FARNet on three publicly available anatomical landmark detection datasets, including cephalometric, hand, and spine radiographs. Our network achieves state-of-the-art performances on all three datasets. Code is available at https://github.com/JuvenileInWind/FARNet.",
                "authors": [
                    {
                        "name": "Ao Y."
                    },
                    {
                        "name": "Wu H."
                    }
                ],
                "date": "2022-01-01T00:00:00Z",
                "journal": "Journal of Digital Imaging",
                "title": "Feature Aggregation and Refinement Network for 2D Anatomical Landmark Detection"
            },
            "pmid": "36401132"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        },
        {
            "term": "Medicine",
            "uri": "http://edamontology.org/topic_3303"
        }
    ]
}
