{
    "accessibility": "Open access",
    "additionDate": "2020-02-28T17:09:38Z",
    "biotoolsCURIE": "biotools:Data_Stewardship_Wizard",
    "biotoolsID": "Data_Stewardship_Wizard",
    "collectionID": [
        "ELIXIR-CZ"
    ],
    "cost": "Free of charge",
    "credit": [
        {
            "email": "marek.suchanek@ds-wizard.org",
            "name": "Marek Suchánek",
            "orcidid": "https://orcid.org/0000-0001-7525-9218",
            "typeEntity": "Person",
            "typeRole": [
                "Developer",
                "Documentor",
                "Primary contact"
            ]
        },
        {
            "name": "Robert Pergl",
            "orcidid": "https://orcid.org/0000-0003-2980-4400",
            "typeEntity": "Person",
            "typeRole": [
                "Contributor",
                "Primary contact",
                "Support"
            ]
        },
        {
            "name": "Vojtěch Knaisl",
            "orcidid": "https://orcid.org/0000-0003-0103-8468",
            "typeEntity": "Person",
            "typeRole": [
                "Developer"
            ]
        },
        {
            "name": "Jan Slifka",
            "orcidid": "https://orcid.org/0000-0002-4941-0575",
            "typeRole": [
                "Developer"
            ]
        },
        {
            "name": "Rob Hooft",
            "orcidid": "https://orcid.org/0000-0001-6825-9439",
            "typeRole": [
                "Contributor"
            ]
        }
    ],
    "description": "The Data Stewardship Wizard is an international project to help serious researchers and data stewards with building smart Data Management Plans for FAIR Open Science.",
    "documentation": [
        {
            "type": [
                "Installation instructions"
            ],
            "url": "https://guide.ds-wizard.org/miscellaneous/self-hosted-dsw/deployment"
        },
        {
            "type": [
                "Release notes"
            ],
            "url": "https://guide.ds-wizard.org/miscellaneous/development/roadmap"
        },
        {
            "type": [
                "User manual"
            ],
            "url": "https://guide.ds-wizard.org/"
        }
    ],
    "editPermission": {
        "authors": [
            "ELIXIR-CZ"
        ],
        "type": "group"
    },
    "elixirNode": [
        "Czech Republic",
        "Netherlands"
    ],
    "elixirPlatform": [
        "Interoperability"
    ],
    "homepage": "https://ds-wizard.org",
    "language": [
        "Elm",
        "Haskell",
        "Python"
    ],
    "lastUpdate": "2022-06-13T13:28:03.215609Z",
    "license": "Apache-2.0",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/ds-wizard/ds-wizard/issues"
        },
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/ds-wizard"
        },
        {
            "type": [
                "Service"
            ],
            "url": "https://ds-wizard.org"
        },
        {
            "type": [
                "Social media"
            ],
            "url": "https://twitter.com/dswizard_org"
        }
    ],
    "maturity": "Mature",
    "name": "Data Stewardship Wizard",
    "owner": "marek.suchanek",
    "publication": [
        {
            "doi": "10.1016/j.ipm.2020.102480",
            "metadata": {
                "abstract": "© 2021 Elsevier LtdThis paper explores the openly available DMP tools and forms a comparative analysis aimed at assisting researchers and data managers to formulate effective data management plans. Based on a literature review 14 DMP tools were selected and were evaluated using 45 selected parameters. The study enlists and enunciates the features of DMP tools, spots several gaps in DMP practices, and provides a few recommendations that can improve the existing tools and DMP practices. Compared to other related works, present work sheds extra light on percentage coverage of parameters by each tool and percentage coverage of tools by each parameter. It is identified that selected tools cover 50%–84% parameters, whereas 78% parameters are covered by half the selected DMP tools. Moreover, 28% of the tools cover 60% of the DMP assisting parameters. Additionally, co-occurrence of parameters and correlation among the tools are illustrated using matrices. It was found that co-occurrence of data description/summary/collection, documentation and metadata, findability, and accessibility parameters are relatively higher and all the selected tools are positively correlated to each other. The study is impactful for the researchers, librarians, data managers, and funding agencies for selecting an appropriate DMP tool as per their requirement.",
                "authors": [
                    {
                        "name": "Gajbe S.B."
                    },
                    {
                        "name": "Gopalji"
                    },
                    {
                        "name": "Singh R.K."
                    },
                    {
                        "name": "Tiwari A."
                    }
                ],
                "citationCount": 3,
                "date": "2021-05-01T00:00:00Z",
                "journal": "Information Processing and Management",
                "title": "Evaluation and analysis of Data Management Plan tools: A parametric approach"
            },
            "type": [
                "Review"
            ]
        },
        {
            "doi": "10.1162/dint_a_00043",
            "metadata": {
                "abstract": "© 2019 Chinese Academy of Sciences Published under a Creative Commons Attribution 4.0 International (CC BY 4.0) license.Effective stewardship of data is a critical precursor to making data FAIR. The goal of this paper is to bring an overview of current state of the art of data management and data stewardship planning solutions (DMP). We begin by arguing why data management is an important vehicle supporting adoption and implementation of the FAIR principles, we describe the background, context and historical development, as well as major driving forces, being research initiatives and funders. Then we provide an overview of the current leading DMP tools in the form of a table presenting the key characteristics. Next, we elaborate on emerging common standards for DMPs, especially the topic of machine-actionable DMPs. As sound DMP is not only a precursor of FAIR data stewardship, but also an integral part of it, we discuss its positioning in the emerging FAIR tools ecosystem. Capacity building and training activities are an important ingredient in the whole effort. Although not being the primary goal of this paper, we touch also the topic of research workforce support, as tools can be just as much effective as their users are competent to use them properly. We conclude by discussing the relations of DMP to FAIR principles, as there are other important connections than just being a precursor.",
                "authors": [
                    {
                        "name": "Davis R.I."
                    },
                    {
                        "name": "Hooft R."
                    },
                    {
                        "name": "Jones S."
                    },
                    {
                        "name": "Lee T."
                    },
                    {
                        "name": "Miksa T."
                    },
                    {
                        "name": "Pergl R."
                    },
                    {
                        "name": "Samors R."
                    },
                    {
                        "name": "Ungvari J."
                    }
                ],
                "citationCount": 15,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Data Intelligence",
                "title": "Data management planning: How requirements and solutions are beginning to converge"
            },
            "type": [
                "Review"
            ]
        },
        {
            "doi": "10.5334/dsj-2019-059",
            "metadata": {
                "abstract": "© 2019 The Author(s).The Data Stewardship Wizard is a tool for data management planning that is focused on getting the most value out of data management planning for the project itself rather than on fulfilling obligations. It is based on FAIR Data Stewardship, in which each data-related decision in a project acts to optimize the Findability, Accessibility, Interoperability and/or Reusability of the data. The background to this philosophy is that the first reuser of the data is the researcher themselves. The tool encourages the consulting of expertise and experts, can help researchers avoid risks they did not know they would encounter by confronting them with practical experience from others, and can help them discover helpful technologies they did not know existed. In this paper, we discuss the context and motivation for the tool, we explain its architecture and we present key functions, such as the knowledge model evolvability and migrations, assembling data management plans, metrics and evaluation of data management plans.",
                "authors": [
                    {
                        "name": "Hooft R."
                    },
                    {
                        "name": "Knaisl V."
                    },
                    {
                        "name": "Pergl R."
                    },
                    {
                        "name": "Slifka J."
                    },
                    {
                        "name": "Suchanek M."
                    }
                ],
                "citationCount": 9,
                "date": "2019-12-01T00:00:00Z",
                "journal": "Data Science Journal",
                "title": "“Data Stewardship Wizard”: A Tool Bringing Together Researchers, Data Stewards, and Data Experts around Data Management Planning"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Informatics",
            "uri": "http://edamontology.org/topic_0605"
        }
    ]
}
