{
    "additionDate": "2021-01-18T10:06:34Z",
    "biotoolsCURIE": "biotools:orfquant",
    "biotoolsID": "orfquant",
    "confidence_flag": "tool",
    "credit": [
        {
            "name": "Lorenzo Calviello",
            "typeEntity": "Person"
        },
        {
            "name": "Uwe Ohler",
            "typeEntity": "Person"
        }
    ],
    "description": "Quantification of translation uncovers the functions of the alternative transcriptome.\n\nAn R package for Splice-aware quantification of translation using Ribo-seq data.\n\nORFquant is an R package that aims at detecting and quantifiying ORF translation on complex transcriptomes using Ribo-seq data. This package uses syntax and functions present in Bioconductor packages like GenomicFeatures, rtracklayer or BSgenome. ORFquant aims at quantifying translation at the single ORF level taking into account the presence of multiple transcripts expressed by each gene. To do so, the ORFquant pipeline consists of transcript filtering, de-novo ORF finding, ORF quantification and ORF annotation. A variety of annotation methods, both in transcript and genomic space, is performed for each ORF, to yield a more complete picture of alternative splice sites usage, uORF translation, translation on NMD candidates and more.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Alternative splicing prediction",
                    "uri": "http://edamontology.org/operation_0264"
                },
                {
                    "term": "Coding region prediction",
                    "uri": "http://edamontology.org/operation_0436"
                },
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                }
            ]
        }
    ],
    "homepage": "https://github.com/lcalviell/ORFquant",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-03-15T09:33:59Z",
    "license": "GPL-3.0",
    "name": "ORFquant",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1038/S41594-020-0450-4",
            "metadata": {
                "abstract": "© 2020, The Author(s), under exclusive licence to Springer Nature America, Inc.Translation has a fundamental function in defining the fate of the transcribed genome. RNA-sequencing (RNA-seq) data enable the quantification of complex transcript mixtures, often detecting several transcript isoforms of unknown functions for one gene. Here, we describe ORFquant, a method to annotate and quantify translation at the level of single open reading frames (ORFs), using information from Ribo-seq data. By developing an approach for transcript filtering, we quantify translation transcriptome-wide, revealing translated ORFs on multiple isoforms per gene. For most genes, one ORF represents the dominant translation product, but we also detect genes with translated ORFs on multiple transcript isoforms, including targets of RNA surveillance mechanisms. Measuring translation across human cell lines reveals the extent of gene-specific differences in protein production, supported by steady-state protein abundance estimates. Computational analysis of Ribo-seq data with ORFquant (https://github.com/lcalviell/ORFquant) provides insights into the heterogeneous functions of complex transcriptomes.",
                "authors": [
                    {
                        "name": "Calviello L."
                    },
                    {
                        "name": "Hirsekorn A."
                    },
                    {
                        "name": "Ohler U."
                    }
                ],
                "citationCount": 1,
                "date": "2020-08-01T00:00:00Z",
                "journal": "Nature Structural and Molecular Biology",
                "title": "Quantification of translation uncovers the functions of the alternative transcriptome"
            },
            "pmid": "32601440"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Protein expression",
            "uri": "http://edamontology.org/topic_0108"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ]
}
