{
    "additionDate": "2015-01-22T11:35:47Z",
    "biotoolsCURIE": "biotools:rnaprofile",
    "biotoolsID": "rnaprofile",
    "collectionID": [
        "MoD Tools"
    ],
    "credit": [
        {
            "email": "giulio.pavesi@unimi.it",
            "name": "Giulio Pavesi",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "name": "ELIXIR-ITA-MILANO",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        }
    ],
    "description": "An algorithm that takes as input a set of unaligned RNA sequences expected to share a common motif, and outputs the regions that are most conserved throughout the sequences, according to a similarity measure that takes into account both the sequence of the regions and the secondary structure they can form according to base-pairing and thermodynamic rules.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://159.149.160.51/modtools/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "RNA secondary structure alignment",
                    "uri": "http://edamontology.org/operation_0502"
                }
            ]
        }
    ],
    "homepage": "http://www.beaconlab.it/modtools",
    "language": [
        "C"
    ],
    "lastUpdate": "2018-12-10T12:58:50Z",
    "license": "GPL-3.0",
    "maturity": "Mature",
    "name": "RNAprofile",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "ELIXIR-ITA-MILANO",
    "publication": [
        {
            "doi": "10.1093/nar/gkh650",
            "metadata": {
                "abstract": "The recent interest sparked due to the discovery of a variety of functions for non-coding RNA molecules has highlighted the need for suitable tools for the analysis and the comparison of RNA sequences. Many trans-acting non-coding RNA genes and cis-acting RNA regulatory elements present motifs, conserved both in structure and sequence, that can be hardly detected by primary sequence analysis alone. We present an algorithm that takes as input a set of unaligned RNA sequences expected to share a common motif, and outputs the regions that are most conserved throughout the sequences, according to a similarity measure that takes into account both the sequence of the regions and the secondary structure they can form according to base-pairing and thermodynamic rules. Only a single parameter is needed as input, which denotes the number of distinct hairpins the motif has to contain. No further constraints on the size, number and position of the single elements comprising the motif are required. The algorithm can be split into two parts: first, it extracts from each input sequence a set of candidate regions whose predicted optimal secondary structure contains the number of hairpins given as input. Then, the regions selected are compared with each other to find the groups of most similar ones, formed by a region taken from each sequence. To avoid exhaustive enumeration of the search space and to reduce the execution time, a greedy heuristic is introduced for this task. We present different experiments, which show that the algorithm is capable of characterizing and discovering known regulatory motifs in mRNA like the iron responsive element (IRE) and selenocysteine insertion sequence (SECIS) stem-loop structures. We also show how it can be applied to corrupted datasets in which a motif does not appear in all the input sequences, as well as to the discovery of more complex motifs in the non-coding RNA. © Oxford University Press 2004; all rights reserved.",
                "authors": [
                    {
                        "name": "Mauri G."
                    },
                    {
                        "name": "Pavesi G."
                    },
                    {
                        "name": "Pesole G."
                    },
                    {
                        "name": "Stefani M."
                    }
                ],
                "citationCount": 44,
                "date": "2004-08-16T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "RNAProfile: An algorithm for finding conserved secondary structure motifs in unaligned RNA sequences"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Nucleic acid structure analysis",
            "uri": "http://edamontology.org/topic_0097"
        }
    ],
    "validated": 1,
    "version": [
        "2.2"
    ]
}
