{
    "additionDate": "2021-01-18T07:38:39Z",
    "biotoolsCURIE": "biotools:compacta",
    "biotoolsID": "compacta",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "octavio.martinez@cinvestav.mx",
            "name": "Octavio Martínez",
            "typeEntity": "Person"
        },
        {
            "email": "angela.hayano@unison.mx",
            "name": "Corina Hayano-Kanashiro",
            "orcidid": "https://orcid.org/0000-0001-7846-6124",
            "typeEntity": "Person"
        }
    ],
    "description": "Compacta is a fast contig clustering tool for de novo assembled transcriptomes. Compacta is designed to reduce the number of contigs given by the assembler to a smaller set of representative sequences, preserving the information about relative expression given by the reads. Compacta output can then be employed in downstream analyses for contig identification and differential gene expression.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "De-novo assembly",
                    "uri": "http://edamontology.org/operation_0524"
                },
                {
                    "term": "Transcriptome assembly",
                    "uri": "http://edamontology.org/operation_3258"
                },
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                }
            ]
        }
    ],
    "homepage": "https://github.com/bioCompU/Compacta",
    "language": [
        "C++",
        "Shell"
    ],
    "lastUpdate": "2021-02-17T13:33:37Z",
    "license": "GPL-3.0",
    "name": "Compacta",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1186/S12864-020-6528-X",
            "metadata": {
                "abstract": "© 2020 The Author(s).Background: RNA-Seq is the preferred method to explore transcriptomes and to estimate differential gene expression. When an organism has a well-characterized and annotated genome, reads obtained from RNA-Seq experiments can be directly mapped to that genome to estimate the number of transcripts present and relative expression levels of these transcripts. However, for unknown genomes, de novo assembly of RNA-Seq reads must be performed to generate a set of contigs that represents the transcriptome. These contig sets contain multiple transcripts, including immature mRNAs, spliced transcripts and allele variants, as well as products of close paralogs or gene families that can be difficult to distinguish. Thus, tools are needed to select a set of less redundant contigs to represent the transcriptome for downstream analyses. Here we describe the development of Compacta to produce contig sets from de novo assemblies. Results: Compacta is a fast and flexible computational tool that allows selection of a representative set of contigs from de novo assemblies. Using a graph-based algorithm, Compacta groups contigs into clusters based on the proportion of shared reads. The user can determine the minimum coverage of the contigs to be clustered, as well as a threshold for the proportion of shared reads in the clustered contigs, thus providing a dynamic range of transcriptome compression that can be adapted according to experimental aims. We compared the performance of Compacta against state of the art clustering algorithms on assemblies from Arabidopsis, mouse and mango, and found that Compacta yielded more rapid results and had competitive precision and recall ratios. We describe and demonstrate a pipeline to tailor Compacta parameters to specific experimental aims. Conclusions: Compacta is a fast and flexible algorithm for the determination of optimum contig sets that represent the transcriptome for downstream analyses.",
                "authors": [
                    {
                        "name": "Razo-Mendivil F.G."
                    },
                    {
                        "name": "Martinez O."
                    },
                    {
                        "name": "Hayano-Kanashiro C."
                    }
                ],
                "date": "2020-02-11T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "Compacta: A fast contig clustering tool for de novo assembled transcriptomes"
            },
            "pmcid": "PMC7014741",
            "pmid": "32046653"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        }
    ]
}