{
    "accessibility": [],
    "additionDate": "2017-08-03T19:07:05Z",
    "biotoolsCURIE": "biotools:mirtrail",
    "biotoolsID": "mirtrail",
    "collectionID": [],
    "confidence_flag": null,
    "cost": null,
    "credit": [
        {
            "email": "mirtrail@bioinf.uni-sb.de",
            "gridid": null,
            "name": null,
            "note": null,
            "orcidid": null,
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.ccb.uni-saarland.de/"
        }
    ],
    "description": "Web-based application to analyse the interactions between miRNAs and predicated target genes via their transcripts (mRNAs).",
    "documentation": [
        {
            "note": null,
            "type": "User manual",
            "url": "http://mirtrail.bioinf.uni-sb.de/tutorial.php"
        },
        {
            "note": null,
            "type": "General",
            "url": "http://mirtrail.bioinf.uni-sb.de/about.php"
        }
    ],
    "download": [],
    "editPermission": {
        "authors": [],
        "type": "private"
    },
    "elixirNode": [],
    "elixirPlatform": [],
    "elixir_badge": 0,
    "function": [
        {
            "cmd": null,
            "input": [],
            "note": null,
            "operation": [
                {
                    "term": "Pathway or network prediction",
                    "uri": "http://edamontology.org/operation_3439"
                }
            ],
            "output": []
        }
    ],
    "homepage": "http://mirtrail.bioinf.uni-sb.de/",
    "homepage_status": 0,
    "language": [
        "PHP",
        "C++"
    ],
    "lastUpdate": "2018-12-10T12:58:50Z",
    "license": null,
    "link": [
        {
            "note": null,
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/mirtrail-analysis-of-relationships-between-mirnas-and-mrnas.html"
        }
    ],
    "maturity": null,
    "name": "miRTrail",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "otherID": [],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": null,
            "metadata": {
                "abstract": "Background: Expression profiling provides new insights into regulatory and metabolic processes and in particular into pathogenic mechanisms associated with diseases. Besides genes, non-coding transcripts as microRNAs (miRNAs) gained increasing relevance in the last decade. To understand the regulatory processes of miRNAs on genes, integrative computer-aided approaches are essential, especially in the light of complex human diseases as cancer.Results: Here, we present miRTrail, an integrative tool that allows for performing comprehensive analyses of interactions of genes and miRNAs based on expression profiles. The integrated analysis of mRNA and miRNA data should generate more robust and reliable results on deregulated pathogenic processes and may also offer novel insights into the regulatory interactions between miRNAs and genes. Our web-server excels in carrying out gene sets analysis, analysis of miRNA sets as well as the combination of both in a systems biology approach. To this end, miRTrail integrates information on 20.000 genes, almost 1.000 miRNAs, and roughly 280.000 putative interactions, for Homo sapiens and accordingly for Mus musculus and Danio rerio. The well-established, classical Chi-squared test is one of the central techniques of our tool for the joint consideration of miRNAs and their targets. For interactively visualizing obtained results, it relies on the network analyzers and viewers BiNA or Cytoscape-web, also enabling direct access to relevant literature. We demonstrated the potential of miRTrail by applying our tool to mRNA and miRNA data of malignant melanoma. MiRTrail identified several deregulated miRNAs that target deregulated mRNAs including miRNAs hsa-miR-23b and hsa-miR-223, which target the highest numbers of deregulated mRNAs and regulate the pathway \"basal cell carcinoma\". In addition, both miRNAs target genes like PTCH1 and RASA1 that are involved in many oncogenic processes.Conclusions: The application on melanoma samples demonstrates that the miRTrail platform may open avenues for investigating the regulatory interactions between genes and miRNAs for a wide range of human diseases. Moreover, miRTrail cannot only be applied to microarray based expression profiles, but also to NGS-based transcriptomic data. The program is freely available as web-server at mirtrail.bioinf.uni-sb.de. © 2012 Laczny et al.; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Laczny C."
                    },
                    {
                        "name": "Leidinger P."
                    },
                    {
                        "name": "Haas J."
                    },
                    {
                        "name": "Ludwig N."
                    },
                    {
                        "name": "Backes C."
                    },
                    {
                        "name": "Gerasch A."
                    },
                    {
                        "name": "Kaufmann M."
                    },
                    {
                        "name": "Vogel B."
                    },
                    {
                        "name": "Katus H.A."
                    },
                    {
                        "name": "Meder B."
                    },
                    {
                        "name": "Stahler C."
                    },
                    {
                        "name": "Meese E."
                    },
                    {
                        "name": "Lenhof H.-P."
                    },
                    {
                        "name": "Keller A."
                    }
                ],
                "citationCount": 26,
                "date": "2012-02-22T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "miRTrail - a comprehensive webserver for analyzing gene and miRNA patterns to enhance the understanding of regulatory mechanisms in diseases"
            },
            "note": null,
            "pmcid": null,
            "pmid": "22356618",
            "type": null,
            "version": null
        }
    ],
    "relation": [],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ],
    "validated": 1,
    "version": []
}