{
    "additionDate": "2021-01-18T11:25:29Z",
    "biotoolsCURIE": "biotools:fast-gbs",
    "biotoolsID": "fast-gbs",
    "confidence_flag": "tool",
    "description": "Fast-GBS is an analysis toolkit for genotyping-by-sequencing data. Genotyping-by-sequencing (GBS) is a rapid, flexible, low-cost, and robust genotyping method that simultaneously discovers variants and calls genotypes within a broad range of samples. These characteristics make GBS an excellent tool for many applications and research questions from conservation biology to functional genomics in both model and non-model species. Continued improvement of GBS relies on a more comprehensive understanding of data analysis, development of fast and efficient bioinformatics pipelines, accurate missing data imputation, and active post-release support.",
    "download": [
        {
            "type": "Container file",
            "url": "https://hub.docker.com/repository/docker/jelar5/fast-gbs_v2"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Imputation",
                    "uri": "http://edamontology.org/operation_3557"
                },
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                }
            ]
        }
    ],
    "homepage": "https://bitbucket.org/jerlar73/fast-gbs_v2/src/master/",
    "lastUpdate": "2024-11-24T20:39:39.982654Z",
    "name": "Fast-GBS",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1186/s12859-016-1431-9",
            "metadata": {
                "abstract": "Background: Next-generation sequencing (NGS) technologies have accelerated considerably the investigation into the composition of genomes and their functions. Genotyping-by-sequencing (GBS) is a genotyping approach that makes use of NGS to rapidly and economically scan a genome. It has been shown to allow the simultaneous discovery and genotyping of thousands to millions of SNPs across a wide range of species. For most users, the main challenge in GBS is the bioinformatics analysis of the large amount of sequence information derived from sequencing GBS libraries in view of calling alleles at SNP loci. Herein we describe a new GBS bioinformatics pipeline, Fast-GBS, designed to provide highly accurate genotyping, to require modest computing resources and to offer ease of use. Results: Fast-GBS is built upon standard bioinformatics language and file formats, is capable of handling data from different sequencing platforms, is capable of detecting different kinds of variants (SNPs, MNPs, and Indels). To illustrate its performance, we called variants in three collections of samples (soybean, barley, and potato) that cover a range of different genome sizes, levels of genome complexity, and ploidy. Within these small sets of samples, we called 35 k, 32 k and 38 k SNPs for soybean, barley and potato, respectively. To assess genotype accuracy, we compared these GBS-derived SNP genotypes with independent data sets obtained from whole-genome sequencing or SNP arrays. This analysis yielded estimated accuracies of 98.7, 95.2, and 94% for soybean, barley, and potato, respectively. Conclusions: We conclude that Fast-GBS provides a highly efficient and reliable tool for calling SNPs from GBS data.",
                "authors": [
                    {
                        "name": "Abed A."
                    },
                    {
                        "name": "Bastien M."
                    },
                    {
                        "name": "Belzile F."
                    },
                    {
                        "name": "Laroche J."
                    },
                    {
                        "name": "Torkamaneh D."
                    }
                ],
                "citationCount": 88,
                "date": "2017-01-03T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Fast-GBS: A new pipeline for the efficient and highly accurate calling of SNPs from genotyping-by-sequencing data"
            },
            "pmcid": "PMC5210301",
            "pmid": "28049422",
            "type": [
                "Primary"
            ],
            "version": "1.0"
        },
        {
            "doi": "10.1139/gen-2020-0077",
            "metadata": {
                "abstract": "Genotyping-by-sequencing (GBS) is a rapid, flexible, low-cost, and robust genotyping method that simultaneously discovers variants and calls genotypes within a broad range of samples. These characteristics make GBS an excellent tool for many applications and research questions from conservation biology to functional genomics in both model and non-model species. Continued improvement of GBS relies on a more comprehensive understanding of data analysis, development of fast and efficient bioinformatics pipelines, accurate missing data imputation, and active post-release support. Here, we present the second generation of Fast-GBS (v2.0) that offers several new options (e.g., processing paired-end reads and imputation of missing data) and features (e.g., summary statistics of genotypes) to improve the GBS data analysis process. The performance assessment analysis showed that Fast-GBS v2.0 outperformed other available analytical pipelines, such as GBS-SNP-CROP and Gb-eaSy. Fast-GBS v2.0 provides an analysis platform that can be run with different types of sequencing data, modest computational resources, and allows for missing-data imputation for various species in different contexts.",
                "authors": [
                    {
                        "name": "Belzile F."
                    },
                    {
                        "name": "Laroche J."
                    },
                    {
                        "name": "Torkamaneh D."
                    }
                ],
                "citationCount": 20,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Genome",
                "title": "Fast-gbs v2.0: An analysis toolkit for genotyping-by-sequencing data"
            },
            "pmid": "33006480",
            "type": [
                "Primary"
            ],
            "version": "1.0"
        }
    ],
    "topic": [
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ],
    "version": [
        "2.0"
    ]
}
