{
    "additionDate": "2018-08-20T14:29:46Z",
    "biotoolsCURIE": "biotools:mdd-carb",
    "biotoolsID": "mdd-carb",
    "credit": [
        {
            "email": "francis@saturn.yzu.edu.tw",
            "name": "Support",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Web server for identifying carbonylation sites. Protein carbonylation, is an irreversible non-enzymatic post-translational modification (PTM) which is often used as a marker of oxidative stress. Despite the used of Protein Carbonylation as a biomarker of oxidative stress, the substrate motif of carbonylation remains unknown.",
    "documentation": [
        {
            "type": "General",
            "url": "http://140.138.150.145/~mddcarb/mddcarb/introduction.php"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein feature detection",
                    "uri": "http://edamontology.org/operation_3092"
                }
            ]
        }
    ],
    "homepage": "http://140.138.150.145/~mddcarb/mddcarb/index.php",
    "lastUpdate": "2018-12-10T12:59:01Z",
    "name": "MDD-carb",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1186/s12918-017-0511-4",
            "metadata": {
                "abstract": "© 2017 The Author(s).Background: Carbonylation, which takes place through oxidation of reactive oxygen species (ROS) on specific residues, is an irreversibly oxidative modification of proteins. It has been reported that the carbonylation is related to a number of metabolic or aging diseases including diabetes, chronic lung disease, Parkinson's disease, and Alzheimer's disease. Due to the lack of computational methods dedicated to exploring motif signatures of protein carbonylation sites, we were motivated to exploit an iterative statistical method to characterize and identify carbonylated sites with motif signatures. Results: By manually curating experimental data from research articles, we obtained 332, 144, 135, and 140 verified substrate sites for K (lysine), R (arginine), T (threonine), and P (proline) residues, respectively, from 241 carbonylated proteins. In order to examine the informative attributes for classifying between carbonylated and non-carbonylated sites, multifarious features including composition of twenty amino acids (AAC), composition of amino acid pairs (AAPC), position-specific scoring matrix (PSSM), and positional weighted matrix (PWM) were investigated in this study. Additionally, in an attempt to explore the motif signatures of carbonylation sites, an iterative statistical method was adopted to detect statistically significant dependencies of amino acid compositions between specific positions around substrate sites. Profile hidden Markov model (HMM) was then utilized to train a predictive model from each motif signature. Moreover, based on the method of support vector machine (SVM), we adopted it to construct an integrative model by combining the values of bit scores obtained from profile HMMs. The combinatorial model could provide an enhanced performance with evenly predictive sensitivity and specificity in the evaluation of cross-validation and independent testing. Conclusion: This study provides a new scheme for exploring potential motif signatures at substrate sites of protein carbonylation. The usefulness of the revealed motifs in the identification of carbonylated sites is demonstrated by their effective performance in cross-validation and independent testing. Finally, these substrate motifs were adopted to build an available online resource (MDD-Carb, http://csb.cse.yzu.edu.tw/MDDCarb/) and are also anticipated to facilitate the study of large-scale carbonylated proteomes.",
                "authors": [
                    {
                        "name": "Kao H.-J."
                    },
                    {
                        "name": "Weng S.-L."
                    },
                    {
                        "name": "Huang K.-Y."
                    },
                    {
                        "name": "Kaunang F.J."
                    },
                    {
                        "name": "Hsu J.B.-K."
                    },
                    {
                        "name": "Huang C.-H."
                    },
                    {
                        "name": "Lee T.-Y."
                    }
                ],
                "citationCount": 3,
                "date": "2017-12-21T00:00:00Z",
                "journal": "BMC Systems Biology",
                "title": "MDD-carb: A combinatorial model for the identification of protein carbonylation sites with substrate motifs"
            }
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Systems biology",
            "uri": "http://edamontology.org/topic_2259"
        },
        {
            "term": "Sequence sites, features and motifs",
            "uri": "http://edamontology.org/topic_0160"
        },
        {
            "term": "Protein sites, features and motifs",
            "uri": "http://edamontology.org/topic_3510"
        }
    ],
    "validated": 1
}