{
    "name": "ReMus", 
    "description": "REinforced Merging techniques for Unique peptide Segments (ReMus) is designed for identification of the locations and compositions of unique peptide segments from a set of protein family sequences.", 
    "homepage": "http://biotools.cs.ntou.edu.tw/Remus.asp", 
    "biotoolsID": "remus", 
    "biotoolsCURIE": "biotools:remus", 
    "version": [], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_0232", 
                    "term": "Sequence merging"
                }, 
                {
                    "uri": "http://edamontology.org/operation_3643", 
                    "term": "Tag-based peptide identification"
                }, 
                {
                    "uri": "http://edamontology.org/operation_3631", 
                    "term": "Peptide identification"
                }, 
                {
                    "uri": "http://edamontology.org/operation_3767", 
                    "term": "Protein identification"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Web application"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_0154", 
            "term": "Small molecules"
        }, 
        {
            "uri": "http://edamontology.org/topic_0623", 
            "term": "Gene and protein families"
        }, 
        {
            "uri": "http://edamontology.org/topic_0121", 
            "term": "Proteomics"
        }, 
        {
            "uri": "http://edamontology.org/topic_0157", 
            "term": "Sequence composition, complexity and repeats"
        }, 
        {
            "uri": "http://edamontology.org/topic_0080", 
            "term": "Sequence analysis"
        }
    ], 
    "operatingSystem": [
        "Linux", 
        "Windows", 
        "Mac"
    ], 
    "language": [
        "PHP"
    ], 
    "license": null, 
    "collectionID": [
        "Proteomics"
    ], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [], 
    "download": [], 
    "documentation": [], 
    "publication": [
        {
            "doi": null, 
            "pmid": "16568543", 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "Unique peptide identification of RNaseA superfamily sequences based on reinforced merging algorithms", 
                "abstract": "Human ribonuclease A (RNaseA) superfamily consists of eight RNases with high similarity in which RNase2 and RNase3 share 76.7% identity. The evolutionary variation of RNases results in differential structures and functions of the enzymes. To distinguish the characteristics of each RNase, we developed reinforced merging algorithms (RMA) to rapidly identify the unique peptide motifs for each member of the highly conserved human RNaseA superfamily. Many motifs in RNase3 identified by RMA correlated well with the antigenic regions predicted by DNAStar. Two unique peptide motifs were experimentally confirmed to contain epitopes for monoclonal antibodies (mAbs) specifically against RNase3. Further analysis of homologous RNases in different species revealed that the unique peptide motifs were located at the correspondent positions, and one of these motifs indeed matched the epitope for a specific anti-bovine pancreatic RNaseA (bpRNaseA) antibody. Our method provides a useful tool for identification of unique peptide motifs for further experimental design. © Imperial College Press.", 
                "date": "2006-04-03T00:00:00Z", 
                "citationCount": 2, 
                "authors": [
                    {
                        "name": "Pai T.-W."
                    }, 
                    {
                        "name": "Su B.-H."
                    }, 
                    {
                        "name": "Wu P.-C."
                    }, 
                    {
                        "name": "Chang M.D.-T."
                    }, 
                    {
                        "name": "Chang H.-T."
                    }, 
                    {
                        "name": "Fan T.-C."
                    }, 
                    {
                        "name": "Liu S.-H."
                    }
                ], 
                "journal": "Journal of Bioinformatics and Computational Biology"
            }
        }, 
        {
            "doi": null, 
            "pmid": "16844991", 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "REMUS: A tool for identification of unique peptide segments as epitopes", 
                "abstract": "We provide a 'REMUS' (reinforced merging techniques for unique peptide segments) web server for identification of the locations and compositions of unique peptide segments from a set of protein family sequences. Different levels of uniqueness are determined according to substitutional relationship in the amino acids, frequency of appearance and biological properties such as priority for serving as candidates for epitopes where antibodies recognize. REMUS also provides interactive visualization of 3D structures for allocation and comparison of the identified unique peptide segments. Accuracy of the algorithm was found to be 70% in terms of mapping a unique peptide segment as an epitope. The REMUS web server is available at http://biotools.cs.ntou.edu.tw/ REMUS and the PC version software can be freely downloaded either at http://bioinfo.life.nthu.edu.tw/REMUS or http://spider.cs.ntou.edu.tw/ BioTools/REMUS. User guide and working examples for PC version are available at http://spider.cs.ntou.edu.tw/ BioTools/REMUS-DOCS.html, and details of the proposed algorithm can be referred to the documents as described previously. © The Author 2006. Published by Oxford University Press. All rights reserved.", 
                "date": "2006-07-01T00:00:00Z", 
                "citationCount": 14, 
                "authors": [
                    {
                        "name": "Pai T.-W."
                    }, 
                    {
                        "name": "Chang M.D.-T."
                    }, 
                    {
                        "name": "Tzou W.-S."
                    }, 
                    {
                        "name": "Su B.-H."
                    }, 
                    {
                        "name": "Wu P.-C."
                    }, 
                    {
                        "name": "Chang H.-T."
                    }, 
                    {
                        "name": "Chou W.-I."
                    }
                ], 
                "journal": "Nucleic Acids Research"
            }
        }, 
        {
            "doi": null, 
            "pmid": "16433931", 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "A reinforced merging methodology for mapping unique peptide motifs in members of protein families", 
                "abstract": "Background: Members of a protein family often have highly conserved sequences; most of these sequences carry identical biological functions and possess similar three-dimensional (3-D) structures. However, enzymes with high sequence identity may acquire differential functions other than the common catalytic ability. It is probable that each of their variable regions consists of a unique peptide motif (UPM), which selectively interacts with other cellular proteins, rendering additional biological activities. The ability to identify and localize such UPMs is paramount in recognizing the characteristic role of each member of a protein family. Results: We have developed a reinforced merging algorithm (RMA) with which non-gapped UPMs were identified in a variety of query protein sequences including members of human ribonuclease A (RNaseA), epidermal growth factor receptor (EGFR), matrix metalloproteinase (MMP), and Smaand-Mad related protein families (Smad). The UPMs generally occupy specific positions in the resolved 3-D structures, especially the loop regions on the structural surfaces. These motifs coincide with the recognition sites for antibodies, as the epitopes of four monoclonal antibodies and two polyclonal antibodies were shown to overlap with the UPMs. Most of the UPMs were found to correlate well with the potential antigenic regions predicted by PROTEAN. Furthermore, an accuracy of 70% can be achieved in terms of mapping a UPM to an epitope. Conclusion: Our study provides a bioinformatic approach for searching and predicting potential epitopes and interacting motifs that distinguish different members of a protein family. © 2006 Chang et al; license BioMed Central Ltd.", 
                "date": "2006-01-25T00:00:00Z", 
                "citationCount": 11, 
                "authors": [
                    {
                        "name": "Chang H.-T."
                    }, 
                    {
                        "name": "Pai T.-W."
                    }, 
                    {
                        "name": "Fan T.-C."
                    }, 
                    {
                        "name": "Su B.-H."
                    }, 
                    {
                        "name": "Wu P.-C."
                    }, 
                    {
                        "name": "Tang C.-Y."
                    }, 
                    {
                        "name": "Chang C.-T."
                    }, 
                    {
                        "name": "Liu S.-H."
                    }, 
                    {
                        "name": "Chang M.D.-T."
                    }
                ], 
                "journal": "BMC Bioinformatics"
            }
        }
    ], 
    "credit": [
        {
            "name": "ReMus team", 
            "email": "twp@mail.ntou.edu.tw", 
            "url": null, 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "ELIXIR-EE", 
    "additionDate": "2017-02-10T14:14:33Z", 
    "lastUpdate": "2019-03-26T08:37:32Z", 
    "editPermission": {
        "type": "group", 
        "authors": [
            "proteomics.bio.tools"
        ]
    }, 
    "validated": 0, 
    "homepage_status": 0, 
    "elixir_badge": 0
}