{
    "additionDate": "2021-10-26T15:20:23.647622Z",
    "biotoolsCURIE": "biotools:TXG-MAPr",
    "biotoolsID": "TXG-MAPr",
    "collectionID": [
        "TransQST"
    ],
    "description": "In the TXG-MAPr, users can analyze dose- and time-response curves, compound correlation plots and functional annotation of the WGCNA modules to derive mechanistic information of the toxicity. In addition, we included the prediction of transcription factor activities, as well as physical interactions between downstream proteins encoded by the transcriptome, which might be useful in analyzing the perturbations triggered by exposure with toxic compounds. Users can investigate module perturbation of the TG-GATEs compounds by looking at the module eigengene scores (EGS)",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Analysis",
                    "uri": "http://edamontology.org/operation_2945"
                }
            ]
        }
    ],
    "homepage": "https://txg-mapr.eu/",
    "lastUpdate": "2021-11-02T14:54:03.778433Z",
    "name": "TXG-MAPr",
    "owner": "rsmsheriff",
    "publication": [
        {
            "doi": "10.1007/s00204-021-03141-w",
            "metadata": {
                "abstract": "© 2021, The Author(s).Mechanism-based risk assessment is urged to advance and fully permeate into current safety assessment practices, possibly at early phases of drug safety testing. Toxicogenomics is a promising source of mechanisms-revealing data, but interpretative analysis tools specific for the testing systems (e.g. hepatocytes) are lacking. In this study, we present the TXG-MAPr webtool (available at https://txg-mapr.eu/WGCNA_PHH/TGGATEs_PHH/), an R-Shiny-based implementation of weighted gene co-expression network analysis (WGCNA) obtained from the Primary Human Hepatocytes (PHH) TG-GATEs dataset. The 398 gene co-expression networks (modules) were annotated with functional information (pathway enrichment, transcription factor) to reveal their mechanistic interpretation. Several well-known stress response pathways were captured in the modules, were perturbed by specific stressors and showed preservation in rat systems (rat primary hepatocytes and rat in vivo liver), with the exception of DNA damage and oxidative stress responses. A subset of 87 well-annotated and preserved modules was used to evaluate mechanisms of toxicity of endoplasmic reticulum (ER) stress and oxidative stress inducers, including cyclosporine A, tunicamycin and acetaminophen. In addition, module responses can be calculated from external datasets obtained with different hepatocyte cells and platforms, including targeted RNA-seq data, therefore, imputing biological responses from a limited gene set. As another application, donors’ sensitivity towards tunicamycin was investigated with the TXG-MAPr, identifying higher basal level of intrinsic immune response in donors with pre-existing liver pathology. In conclusion, we demonstrated that gene co-expression analysis coupled to an interactive visualization environment, the TXG-MAPr, is a promising approach to achieve mechanistic relevant, cross-species and cross-platform evaluation of toxicogenomic data.",
                "authors": [
                    {
                        "name": "Callegaro G."
                    },
                    {
                        "name": "Kunnen S.J."
                    },
                    {
                        "name": "Trairatphisan P."
                    },
                    {
                        "name": "Grosdidier S."
                    },
                    {
                        "name": "Niemeijer M."
                    },
                    {
                        "name": "den Hollander W."
                    },
                    {
                        "name": "Guney E."
                    },
                    {
                        "name": "Pinero Gonzalez J."
                    },
                    {
                        "name": "Furlong L."
                    },
                    {
                        "name": "Webster Y.W."
                    },
                    {
                        "name": "Saez-Rodriguez J."
                    },
                    {
                        "name": "Sutherland J.J."
                    },
                    {
                        "name": "Mollon J."
                    },
                    {
                        "name": "Stevens J.L."
                    },
                    {
                        "name": "van de Water B."
                    }
                ],
                "date": "2021-12-01T00:00:00Z",
                "journal": "Archives of Toxicology",
                "title": "The human hepatocyte TXG-MAPr: gene co-expression network modules to support mechanism-based risk assessment"
            },
            "type": [
                "Primary"
            ]
        }
    ]
}