{
    "additionDate": "2021-01-18T09:58:39Z",
    "biotoolsCURIE": "biotools:teacon",
    "biotoolsID": "teacon",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "zyh163@tom.com",
            "name": "Youhua Zhang",
            "typeEntity": "Person"
        },
        {
            "email": "lou_biocc@yeah.net",
            "name": "Shihua Zhang",
            "typeEntity": "Person"
        }
    ],
    "description": "a database of gene co-expression network for tea plant (Camellia sinensis).\n\nTea plant (Camellia sinensis) is one of the world’s most important beverage crops with essential economic and health benefits. However, the functional exploration of tea genes related to important agronomic traits, such as secondary metabolism, leaf yield, and stress resistance, is now significantly lagging, which puts an obstacle for applied genetic improvement and molecular breeding in tea plant. Here, a database of gene co-expression network for tea plant (TeaCoN) was developed to serve as a solid platform for candidate gene screening and functional exploration of important agronomical traits in tea plant.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Expression correlation analysis",
                    "uri": "http://edamontology.org/operation_3463"
                },
                {
                    "term": "Gene-set enrichment analysis",
                    "uri": "http://edamontology.org/operation_2436"
                },
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                }
            ]
        }
    ],
    "homepage": "http://teacon.wchoda.com",
    "lastUpdate": "2021-02-26T17:55:47Z",
    "name": "TeaCoN",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1186/S12864-020-06839-W",
            "metadata": {
                "abstract": "© 2020 The Author(s).Background: Tea plant (Camellia sinensis) is one of the world's most important beverage crops due to its numerous secondary metabolites conferring tea quality and health effects. However, only a small fraction of tea genes (especially for those metabolite-related genes) have been functionally characterized to date. A cohesive bioinformatics platform is thus urgently needed to aid in the functional determination of the remaining genes. Description: TeaCoN, a database of gene co-expression network for tea plant, was established to provide genome-wide associations in gene co-expression to survey gene modules (i.e., co-expressed gene sets) for a function of interest. TeaCoN featured a comprehensive collection of 261 high-quality RNA-Seq experiments that covered a wide range of tea tissues as well as various treatments for tea plant. In the current version of TeaCoN, 31,968 (94% coverage of the genome) tea gene models were documented. Users can retrieve detailed co-expression information for gene(s) of interest in four aspects: 1) co-expressed genes with the corresponding Pearson correlation coefficients (PCC-values) and statistical P-values, 2) gene information (gene ID, description, symbol, alias, chromosomal location, GO and KEGG annotation), 3) expression profile heatmap of co-expressed genes across seven main tea tissues (e.g., leaf, bud, stem, root), and 4) network visualization of co-expressed genes. We also implemented a gene co-expression analysis, BLAST search function, GO and KEGG enrichment analysis, and genome browser to facilitate use of the database. Conclusion: The TeaCoN project can serve as a beneficial platform for candidate gene screening and functional exploration of important agronomical traits in tea plant. TeaCoN is freely available at http://teacon.wchoda.com.",
                "authors": [
                    {
                        "name": "Zhang R."
                    },
                    {
                        "name": "Ma Y."
                    },
                    {
                        "name": "Hu X."
                    },
                    {
                        "name": "Chen Y."
                    },
                    {
                        "name": "He X."
                    },
                    {
                        "name": "Wang P."
                    },
                    {
                        "name": "Chen Q."
                    },
                    {
                        "name": "Ho C.-T."
                    },
                    {
                        "name": "Wan X."
                    },
                    {
                        "name": "Zhang Y."
                    },
                    {
                        "name": "Zhang S."
                    }
                ],
                "citationCount": 4,
                "date": "2020-07-03T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "TeaCoN: A database of gene co-expression network for tea plant (Camellia sinensis)"
            },
            "pmcid": "PMC7333269",
            "pmid": "32620074"
        }
    ],
    "topic": [
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        },
        {
            "term": "Agricultural science",
            "uri": "http://edamontology.org/topic_3810"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        }
    ]
}