{
    "accessibility": "Open access",
    "additionDate": "2022-04-28T15:18:17.156564Z",
    "biotoolsCURIE": "biotools:fastcore",
    "biotoolsID": "fastcore",
    "collectionID": [
        "PerMedCoE"
    ],
    "cost": "Free of charge",
    "description": "Fast Reconstruction of Compact Context-Specific Metabolic Network Models",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/migp11/pyfastcore"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "https://github.com/migp11/pyfastcore"
        }
    ],
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://github.com/migp11/pyfastcore",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-04-28T16:00:31.481166Z",
    "license": "Freeware",
    "name": "FastCore",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "tntiniak",
    "publication": [
        {
            "doi": "10.1371/journal.pcbi.1003424",
            "metadata": {
                "abstract": "Systemic approaches to the study of a biological cell or tissue rely increasingly on the use of context-specific metabolic network models. The reconstruction of such a model from high-throughput data can routinely involve large numbers of tests under different conditions and extensive parameter tuning, which calls for fast algorithms. We present FASTCORE, a generic algorithm for reconstructing context-specific metabolic network models from global genome-wide metabolic network models such as Recon X. FASTCORE takes as input a core set of reactions that are known to be active in the context of interest (e.g., cell or tissue), and it searches for a flux consistent subnetwork of the global network that contains all reactions from the core set and a minimal set of additional reactions. Our key observation is that a minimal consistent reconstruction can be defined via a set of sparse modes of the global network, and FASTCORE iteratively computes such a set via a series of linear programs. Experiments on liver data demonstrate speedups of several orders of magnitude, and significantly more compact reconstructions, over a rival method. Given its simplicity and its excellent performance, FASTCORE can form the backbone of many future metabolic network reconstruction algorithms. © 2014 Vlassis et al.",
                "authors": [
                    {
                        "name": "Pacheco M.P."
                    },
                    {
                        "name": "Sauter T."
                    },
                    {
                        "name": "Vlassis N."
                    }
                ],
                "citationCount": 121,
                "date": "2014-01-01T00:00:00Z",
                "journal": "PLoS Computational Biology",
                "title": "Fast Reconstruction of Compact Context-Specific Metabolic Network Models"
            }
        }
    ]
}
