{
    "additionDate": "2022-09-30T11:58:15.178105Z",
    "biotoolsCURIE": "biotools:dynamic_nomogram",
    "biotoolsID": "dynamic_nomogram",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "dxzhao@jlu.edu.cn",
            "name": "Dongxu Zhao",
            "typeEntity": "Person"
        },
        {
            "name": "Yuexin Tong"
        }
    ],
    "description": "A web-based nomogram for accurately predicting probabilities of overall survival in elderly patients with chondrosarcoma (CHS), which will contribute to personalized survival assessment and clinical management.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Incident curve plotting",
                    "uri": "http://edamontology.org/operation_3503"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                },
                {
                    "term": "Validation",
                    "uri": "http://edamontology.org/operation_2428"
                }
            ]
        }
    ],
    "homepage": "https://nomoresearch.shinyapps.io/elderlywithCHS/",
    "language": [
        "R"
    ],
    "lastUpdate": "2024-11-24T15:33:19.718803Z",
    "license": "Not licensed",
    "name": "Dynamic Nomogram",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.3389/fpubh.2022.901680",
            "metadata": {
                "abstract": "Background: Chondrosarcoma is the most common primary bone sarcoma among elderly population. This study aims to explore independent prognostic factors and develop prediction model in elderly patients with CHS. Methods: This study retrospectively analyzed the clinical data of elderly patients diagnosed as CHS between 2004 and 2018 from the Surveillance, Epidemiology, and End Results (SEER) database. We randomly divided enrolled patients into training and validation group, univariate and multivariate Cox regression analyses were used to determine independent prognostic factors. Based on the identified variables, the nomogram was developed and verified to predict the 12-, 24-, and 36-month overall survival (OS) of elderly patients with CHS. A k-fold cross-validation method (k=10) was performed to validate the newly proposed model. The discrimination, calibration and clinical utility of the nomogram were assessed using the Harrells concordance index (C-index), receiver operating characteristic (ROC) curve and the area under the curve (AUC), calibration curve, decision curve analysis (DCA), the integrated discrimination improvement (IDI) and net reclassification index (NRI). Furthermore, a web-based survival calculator was developed based on the nomogram. Results: The study finally included 595 elderly patients with CHS and randomized them into the training group (419 cases) and validation group (176 cases) at a ratio of 7:3. Age, sex, grade, histology, M stage, surgery and tumor size were identified as independent prognostic factors of this population. The novel nomogram displayed excellent predictive performance, which can be accessible by https://nomoresearch.shinyapps.io/elderlywithCHS/, with a C-index of 0.800 for the training group and 0.789 for the validation group. The value AUC values at 12-, 24-, and 36-month of 0.866, 0.855, and 0.860 in the training group and of 0.839, 0.856, and 0.840 in the validation group, respectively. The calibration curves exhibited good concordance from the predicted survival probabilities to actual observation. The ROC curves, IDI, NRI, and DCA showed the nomogram was superior to the existing AJCC staging system. Conclusion: This study developed a novel web-based nomogram for accurately predicting probabilities of OS in elderly patients with CHS, which will contribute to personalized survival assessment and clinical management for elderly patients with CHS.",
                "authors": [
                    {
                        "name": "Cui Y."
                    },
                    {
                        "name": "Gong Y."
                    },
                    {
                        "name": "Jiang L."
                    },
                    {
                        "name": "Pi Y."
                    },
                    {
                        "name": "Tong Y."
                    },
                    {
                        "name": "Zhao D."
                    }
                ],
                "citationCount": 13,
                "date": "2022-06-30T00:00:00Z",
                "journal": "Frontiers in Public Health",
                "title": "Clinical Characteristics, Prognostic Factor and a Novel Dynamic Prediction Model for Overall Survival of Elderly Patients With Chondrosarcoma: A Population-Based Study"
            },
            "pmcid": "PMC9279667",
            "pmid": "35844853"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Geriatric medicine",
            "uri": "http://edamontology.org/topic_3399"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Public health and epidemiology",
            "uri": "http://edamontology.org/topic_3305"
        },
        {
            "term": "Surgery",
            "uri": "http://edamontology.org/topic_3421"
        }
    ],
    "validated": 1
}
