{
    "additionDate": "2021-01-18T10:30:37Z",
    "biotoolsCURIE": "biotools:crhp-finder",
    "biotoolsID": "crhp-finder",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "melodiyem@gmail.com",
            "name": "Melodi Yusibova",
            "typeEntity": "Person"
        },
        {
            "name": "Henrik Hasman",
            "typeEntity": "Person"
        }
    ],
    "description": "CRHP Finder is a webtool for the detection of clarithromycin resistance in Helicobacter pylori from whole-genome sequencing data.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Antimicrobial resistance prediction",
                    "uri": "http://edamontology.org/operation_3482"
                },
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                }
            ]
        }
    ],
    "homepage": "https://cge.cbs.dtu.dk/services/CRHP-Finder/",
    "lastUpdate": "2021-02-18T15:01:31Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://bitbucket.org/genomicepidemiology/crhp-finder.git"
        }
    ],
    "name": "CRHP Finder",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1111/HEL.12752",
            "metadata": {
                "abstract": "© 2020 John Wiley & Sons LtdBackground: Resistance to clarithromycin in Helicobacter pylori (H pylori) is mediated by mutations in the domain V of the 23S rRNA gene (A2142G, A2143G, A2142C). Other polymorphisms in the 23S rRNA gene have been reported to cause low-level clarithromycin resistance but their importance is still under debate. In this study, we aimed to develop and evaluate the CRHP Finder webtool for detection of the most common mutations mediating clarithromycin resistance from whole-genome sequencing (WGS) data. Moreover, we included an analysis of 23 H pylori strains from Danish patients between January 2017 and September 2019 in Copenhagen, Denmark. Materials and Methods: The CRHP Finder detects the fraction of each of the four nucleotides in nucleotide positions 2142, 2143, 2182, 2244 and 2712 of the 23S rRNA gene in H pylori (E coli numbering) by aligning raw sequencing reads (fastq format) with k-mer alignment (KMA). The nucleotide distribution in each position is compared to previously described point mutations mediating clarithromycin resistance in H pylori, and a genotypic prediction of the clarithromycin resistance phenotype is presented as output. For validation of the CRHP webtool, 137 fastq paired-end sequencing datasets originating from a well-characterized strain collection of H pylori were analyzed. Results: The CRHP Finder correctly identified all resistance mutations reported in the sequencing data of 137 H pylori strains. In the 23 Danish H pylori strains, CRHP Finder detected A2143G (13%) in all resistant strains, and T2182C (13%) and C2244T (4,3%) nucleotide exchanges in only susceptible strains. Conclusion: In this study, we present the validation of the first webtool for H pylori resistance prediction based on the detection of 23S rRNA mutations (A2142C, A2142G, A2143G, T2182C, C2244T, T2712C) from WGS data of H pylori.",
                "authors": [
                    {
                        "name": "Yusibova M."
                    },
                    {
                        "name": "Hasman H."
                    },
                    {
                        "name": "Clausen P.T.L.C."
                    },
                    {
                        "name": "Imkamp F."
                    },
                    {
                        "name": "Wagner K."
                    },
                    {
                        "name": "Andersen L.P."
                    }
                ],
                "date": "2020-12-01T00:00:00Z",
                "journal": "Helicobacter",
                "title": "CRHP Finder, a webtool for the detection of clarithromycin resistance in Helicobacter pylori from whole-genome sequencing data"
            },
            "pmid": "32844531"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Whole genome sequencing",
            "uri": "http://edamontology.org/topic_3673"
        },
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        }
    ]
}