{
    "accessibility": "Open access",
    "additionDate": "2022-07-17T09:29:40.675229Z",
    "biotoolsCURIE": "biotools:automrm",
    "biotoolsID": "automrm",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "buescher@ie-freiburg.mpg.de",
            "name": "Joerg M. Buescher",
            "orcidid": "https://orcid.org/0000-0002-6547-0076",
            "typeEntity": "Person"
        }
    ],
    "description": "An R Package for Fully Automatic LC-QQQ-MS Data Preprocessing Powered by Machine Learning.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data handling",
                    "uri": "http://edamontology.org/operation_2409"
                },
                {
                    "term": "Peak detection",
                    "uri": "http://edamontology.org/operation_3215"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://gitlab.gwdg.de/joerg.buescher/automrm",
    "language": [
        "R"
    ],
    "lastUpdate": "2022-07-17T09:29:40.678669Z",
    "license": "MIT",
    "name": "automRm",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1021/ACS.ANALCHEM.1C05224",
            "metadata": {
                "abstract": "© 2022 The Authors. Published by American Chemical Society.Preprocessing of liquid chromatography-mass spectrometry (LC-MS) raw data facilitates downstream statistical and biological data analyses. In the case of targeted LC-MS data, consistent recognition of chromatographic peaks is a main challenge, in particular, for low abundant signals. Fully automatic preprocessing is faster than manual peak review and does not depend on the individual operator. Here, we present the R package automRm for fully automatic preprocessing of LC-MS data recorded in MRM mode. Using machine learning (ML) for detection of chromatographic peaks and quality control of reported results enables the automatic recognition of complex patterns in raw data. In addition, this approach renders automRm generally applicable to a wide range of analytical methods including hydrophilic interaction liquid chromatography (HILIC), which is known for sample-to-sample variations in peak shape and retention time. We demonstrate the impact of the choice of training data set, of the applied ML algorithm, and of individual peak characteristics on automRm's ability to correctly report chromatographic peaks. Next, we show that automRm can replicate results obtained by manual peak review on published data. Moreover, automRm outperforms alternative software solutions regarding the variation in peak integration among replicate measurements and the number of correctly reported peaks when applied to a HILIC-MS data set. The R package is freely available from gitlab (https://gitlab.gwdg.de/joerg.buescher/automrm).",
                "authors": [
                    {
                        "name": "Buescher J.M."
                    },
                    {
                        "name": "Eilertz D."
                    },
                    {
                        "name": "Mitterer M."
                    }
                ],
                "citationCount": 1,
                "date": "2022-04-26T00:00:00Z",
                "journal": "Analytical Chemistry",
                "title": "AutomRm: An R Package for Fully Automatic LC-QQQ-MS Data Preprocessing Powered by Machine Learning"
            },
            "pmcid": "PMC9047440",
            "pmid": "35412809"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Data mining",
            "uri": "http://edamontology.org/topic_3473"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "NMR",
            "uri": "http://edamontology.org/topic_0593"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        }
    ]
}
