{
    "additionDate": "2021-03-19T09:04:01Z",
    "biotoolsCURIE": "biotools:mad-hidtree",
    "biotoolsID": "mad-hidtree",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "pzhao@noble.org",
            "name": "Patrick Xuechun Zhao",
            "typeEntity": "Person"
        }
    ],
    "description": "Distinguishing HapMap Accessions Through Recursive Set Partitioning in Hierarchical Decision Trees.\n\nA Tool for Multiple Accessions' Distinguishing through Hierarchical Decision Tree.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Haplotype mapping",
                    "uri": "http://edamontology.org/operation_0487"
                },
                {
                    "term": "PCR primer design",
                    "uri": "http://edamontology.org/operation_0308"
                },
                {
                    "term": "SNP detection",
                    "uri": "http://edamontology.org/operation_0484"
                }
            ]
        }
    ],
    "homepage": "https://bioinfo.noble.org/MAD-HiDTree/",
    "language": [
        "C"
    ],
    "lastUpdate": "2021-05-04T06:43:20Z",
    "name": "MAD-HiDTree",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.3389/FPLS.2021.628421",
            "metadata": {
                "abstract": "© Copyright © 2021 Zhang, Kang, Cheng, Wen, Zhang, Torres-Jerez, Krom, Udvardi, Scheible and Zhao.The HapMap (haplotype map) projects have produced valuable genetic resources in life science research communities, allowing researchers to investigate sequence variations and conduct genome-wide association study (GWAS) analyses. A typical HapMap project may require sequencing hundreds, even thousands, of individual lines or accessions within a species. Due to limitations in current sequencing technology, the genotype values for some accessions cannot be clearly called. Additionally, allelic heterozygosity can be very high in some lines, causing genetic and sometimes phenotypic segregation in their descendants. Genetic and phenotypic segregation degrades the original accession’s specificity and makes it difficult to distinguish one accession from another. Therefore, it is vitally important to determine and validate HapMap accessions before one conducts a GWAS analysis. However, to the best of our knowledge, there are no prior methodologies or tools that can readily distinguish or validate multiple accessions in a HapMap population. We devised a bioinformatics approach to distinguish multiple HapMap accessions using only a minimum number of genetic markers. First, we assign each candidate marker with a distinguishing score (DS), which measures its capability in distinguishing accessions. The DS score prioritizes those markers with higher percentages of homozygous genotypes (allele combinations), as they can be stably passed on to offspring. Next, we apply the “set-partitioning” concept to select optimal markers by recursively partitioning accession sets. Subsequently, we build a hierarchical decision tree in which a specific path represents the selected markers and the homogenous genotypes that can be used to distinguish one accession from others in the HapMap population. Based on these algorithms, we developed a web tool named MAD-HiDTree (Multiple Accession Distinguishment-Hierarchical Decision Tree), designed to analyze a user-input genotype matrix and construct a hierarchical decision tree. Using genetic marker data extracted from the Medicago truncatula HapMap population, we successfully constructed hierarchical decision trees by which the original 262 M. truncatula accessions could be efficiently distinguished. PCR experiments verified our proposed method, confirming that MAD-HiDTree can be used for the identification of a specific accession. MAD-HiDTree was developed in C/C++ in Linux. Both the source code and test data are publicly available at https://bioinfo.noble.org/MAD-HiDTree/.",
                "authors": [
                    {
                        "name": "Cheng X."
                    },
                    {
                        "name": "Kang Y."
                    },
                    {
                        "name": "Krom N."
                    },
                    {
                        "name": "Scheible W.-R."
                    },
                    {
                        "name": "Torres-Jerez I."
                    },
                    {
                        "name": "Udvardi M.K."
                    },
                    {
                        "name": "Wen J."
                    },
                    {
                        "name": "Zhang H."
                    },
                    {
                        "name": "Zhang W."
                    },
                    {
                        "name": "Zhao P.X."
                    }
                ],
                "date": "2021-02-03T00:00:00Z",
                "journal": "Frontiers in Plant Science",
                "title": "Distinguishing HapMap Accessions Through Recursive Set Partitioning in Hierarchical Decision Trees"
            },
            "pmcid": "PMC7886675",
            "pmid": "33613609"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "GWAS study",
            "uri": "http://edamontology.org/topic_3517"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "PCR experiment",
            "uri": "http://edamontology.org/topic_3519"
        }
    ]
}
