{
    "additionDate": "2021-01-18T12:06:57Z",
    "biotoolsCURIE": "biotools:profatigue",
    "biotoolsID": "profatigue",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "martagciaglez@gmail.com",
            "name": "Marta García-González",
            "typeEntity": "Person"
        }
    ],
    "description": "Optimized Planning and Evaluation of Dental Implant Fatigue Testing.\n\nSoftware for fitting fatigue data.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://meteo.unican.es/temp/castie/Profatigue.html",
    "lastUpdate": "2021-01-27T17:37:35Z",
    "name": "ProFatigue",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.3390/BIOLOGY9110372",
            "metadata": {
                "abstract": "© 2020 by the authors. Licensee MDPI, Basel, Switzerland.Mechanical complications in implant-supported fixed dental prostheses are often related to implant and prosthetic design. Although the current ISO 14801 provides a framework for the evaluation of dental implant mechanical reliability, strict adherence to it may be difficult to achieve due to the large number of test specimens which it requires as well as the fact that it does not offer any probabilistic reference for determining the endurance limit. In order to address these issues, a new software program called ProFatigue is presented as a potentially powerful tool to optimize fatigue testing of implant-supported prostheses. The present work provides a brief description of some concepts such as load, fatigue and stress-number of cycles to failure curves (S-N curves), before subsequently describing the current regulatory situation. After analyzing the two most recent versions of the ISO recommendation (from 2008 and 2016), some limitations inherent to the experimental methods which they propose are highlighted. Finally, the main advantages and instructions for the correct implementation of the ProFatigue free software are given. This software will contribute to improving the performance of fatigue testing in a more accurate and optimized way, helping researchers to gain a better understanding of the behavior of dental implants in this type of mechanical test.",
                "authors": [
                    {
                        "name": "Garcia-Gonzalez M."
                    },
                    {
                        "name": "Blason-Gonzalez S."
                    },
                    {
                        "name": "Garcia-Garcia I."
                    },
                    {
                        "name": "Lamela-Rey M.J."
                    },
                    {
                        "name": "Fernandez-Canteli A."
                    },
                    {
                        "name": "Alvarez-Arenal A."
                    }
                ],
                "date": "2020-11-01T00:00:00Z",
                "journal": "Biology",
                "title": "Optimized planning and evaluation of dental implant fatigue testing: A specific software application"
            },
            "pmcid": "PMC7693306",
            "pmid": "33142807"
        }
    ],
    "topic": [
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        },
        {
            "term": "Software engineering",
            "uri": "http://edamontology.org/topic_3372"
        },
        {
            "term": "Physics",
            "uri": "http://edamontology.org/topic_3318"
        }
    ]
}