{
    "additionDate": "2017-01-17T15:03:42Z",
    "biotoolsCURIE": "biotools:pathvar",
    "biotoolsID": "pathvar",
    "collectionID": [
        "BioConductor"
    ],
    "credit": [
        {
            "email": "sezimmer@einstein.yu.edu",
            "name": "Samuel Zimmerman",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "This package contains the functions to find the pathways that have significantly different variability than a reference gene set. It also finds the categories from this pathway that are significant where each category is a cluster of genes. The genes are separated into clusters by their level of variability.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://bioconductor.org/packages/release/bioc/html/pathVar.html"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://bioconductor/packages/release/bioc/src/contrib/pathVar_1.4.0.tar.gz"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Pathway or network comparison",
                    "uri": "http://edamontology.org/operation_0277"
                }
            ]
        }
    ],
    "homepage": "http://bioconductor.org/packages/release/bioc/html/pathVar.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-10T12:58:54Z",
    "license": "GPL-2.0",
    "name": "pathVar",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "bioconductor_import",
    "publication": [
        {
            "doi": "10.7717/peerj.3334",
            "metadata": {
                "abstract": "© 2017 de Torrente et al.Identifying the pathways that control a cellular phenotype is the first step to building a mechanistic model. Recent examples in developmental biology, cancer genomics, and neurological disease have demonstrated how changes in the variability of gene expression can highlight important genes that are under different degrees of regulatory control. Simple statistical tests exist to identify differentially-variable genes; however, methods for investigating how changes in gene expression variability in the context of pathways and gene sets are under-explored. Here we present pathVar, a new method that provides functional interpretation of gene expression variability changes at the level of pathways and gene sets. pathVar is based on a multinomial exact test, or an asymptotic Chi-squared test as a more computationally-efficient alternative. The method can be used for gene expression studies from any technology platform in all biological settings either with a single phenotypic group, or two-group comparisons. To demonstrate its utility, we applied the method to a diverse set of diseases, species and samples. Results from pathVar are benchmarked against analyses based on average expression and two methods of GSEA, and demonstrate that analyses using both statistics are useful for understanding transcriptional regulation. We also provide recommendations for the choice of variability statistic that have been informed through analyses on simulations and real data. Based on the datasets selected, we show how pathVar can be used to gain insight into expression variability of single cell versus bulk samples, different stem cell populations, and cancer versus normal tissue comparisons.",
                "authors": [
                    {
                        "name": "de Torrente L."
                    },
                    {
                        "name": "Zimmerman S."
                    },
                    {
                        "name": "Taylor D."
                    },
                    {
                        "name": "Hasegawa Y."
                    },
                    {
                        "name": "Wells C.A."
                    },
                    {
                        "name": "Mar J.C."
                    }
                ],
                "citationCount": 4,
                "date": "2017-01-01T00:00:00Z",
                "journal": "PeerJ",
                "title": "pathVar: A new method for pathway-based interpretation of gene expression variability"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool",
        "Library"
    ],
    "topic": [
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ],
    "validated": 1,
    "version": [
        "1.4.0"
    ]
}