
{
    "credit": [
        {
            "email": "mgerlich@ipb-halle.de",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "https://msbi.ipb-halle.de/MetFusion/"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Spectral analysis",
                    "uri": "http://edamontology.org/operation_3214"
                }
            ]
        }
    ],
    "labels": {
        "collectionID": [
            "EBI Training Tools"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Proteomics",
                "uri": "http://edamontology.org/topic_0121"
            },
            {
                "term": "Metabolomics",
                "uri": "http://edamontology.org/topic_3172"
            }
        ]
    },
    "publication": [
        {
            "abstract": "Mass spectrometry (MS) is an important analytical technique for the detection and identification of small compounds. The main bottleneck in the interpretation of metabolite profiling or screening experiments is the identification of unknown compounds from tandem mass spectra. Spectral libraries for tandem MS, such as MassBank or NIST, contain reference spectra for many compounds, but their limited chemical coverage reduces the chance for a correct and reliable identification of unknown spectra outside the database domain. On the other hand, compound databases like PubChem or ChemSpider have a much larger coverage of the chemical space, but they cannot be queried with spectral information directly. Recently, computational mass spectrometry methods and in silico fragmentation prediction allow users to search such databases of chemical structures. We present a new strategy called MetFusion to combine identification results from several resources, in particular, from the in silico fragmenter MetFrag with the spectral library MassBank to improve compound identification. We evaluate the performance on a set of 1062 spectra and achieve an improved ranking of the correct compound from rank 28 using MetFrag alone, to rank 7 with MetFusion, even if the correct compound and similar compounds are absent from the spectral library. On the basis of the evaluation, we extrapolate the performance of MetFusion to the KEGG compound database. Copyright © 2013 John Wiley & Sons, Ltd.",
            "authors": [
                "Gerlich M.",
                "Neumann S."
            ],
            "cit_count": 98,
            "doi": "10.1002/jms.3123",
            "journal": "Journal of Mass Spectrometry",
            "title": "MetFusion: Integration of compound identification strategies",
            "year": "2013-03-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:metfusion",
        "biotoolsID": "metfusion",
        "description": "Approach to combine the knowledge from spectral databases like MassBank with the multitude of candidates generated by fragmenters such as MetFrag.",
        "homepage": "http://msbi.ipb-halle.de/MetFusion/",
        "name": "MetFusion"
    }
}