{
    "additionDate": "2022-09-29T07:18:51.508098Z",
    "biotoolsCURIE": "biotools:biadb",
    "biotoolsID": "biadb",
    "credit": [
        {
            "name": "Dr Gajendra P.S. Raghava",
            "url": "https://webs.iiitd.edu.in/raghava/biadb/index.html"
        }
    ],
    "description": "A Database for Benzylisoquinoline Alkaloids is an attempt to gather the scattered information related to the BIA's.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://webs.iiitd.edu.in/raghava/biadb/index.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Analysis",
                    "uri": "http://edamontology.org/operation_2945"
                }
            ]
        }
    ],
    "homepage": "https://webs.iiitd.edu.in/raghava/biadb/index.html",
    "lastUpdate": "2022-09-29T07:18:59.768347Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "https://webs.iiitd.edu.in/raghava/biadb/index.html"
        }
    ],
    "name": "BIAdb",
    "owner": "raghavagps",
    "publication": [
        {
            "doi": "10.1186/1471-2210-10-4",
            "metadata": {
                "abstract": "Background: Benzylisoquinoline is the structural backbone of many alkaloids with a wide variety of structures including papaverine, noscapine, codeine, morphine, apomorphine, berberine, protopine and tubocurarine. Many benzylisoquinoline alkaloids have been reported to show therapeutic properties and to act as novel medicines. Thus it is important to collect and compile benzylisoquinoline alkaloids in order to explore their usage in medicine.Description: We extract information about benzylisoquinoline alkaloids from various sources like PubChem, KEGG, KNApSAcK and manual curation from literature. This information was processed and compiled in order to create a comprehensive database of benzylisoquinoline alkaloids, called BIAdb. The current version of BIAdb contains information about 846 unique benzylisoquinoline alkaloids, with multiple entries in term of source, function leads to total number of 2504 records. One of the major features of this database is that it provides data about 627 different plant species as a source of benzylisoquinoline and 114 different types of function performed by these compounds. A large number of online tools have been integrated, which facilitate user in exploring full potential of BIAdb. In order to provide additional information, we give external links to other resources/databases. One of the important features of this database is that it is tightly integrated with Drugpedia, which allows managing data in fixed/flexible format.Conclusions: A database of benzylisoquinoline compounds has been created, which provides comprehensive information about benzylisoquinoline alkaloids. This database will be very useful for those who are working in the field of drug discovery based on natural products. This database will also serve researchers working in the field of synthetic biology, as developing medicinally important alkaloids using synthetic process are one of important challenges. This database is available from http://crdd.osdd.net/raghava/biadb/. © 2010 Singla et al; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Kaur J."
                    },
                    {
                        "name": "Panwar B."
                    },
                    {
                        "name": "Raghava G.P.S."
                    },
                    {
                        "name": "Sharma A."
                    },
                    {
                        "name": "Singla D."
                    }
                ],
                "citationCount": 29,
                "date": "2010-03-05T00:00:00Z",
                "journal": "BMC Pharmacology",
                "title": "BIAdb: A curated database of benzylisoquinoline alkaloids"
            }
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Computational biology",
            "uri": "http://edamontology.org/topic_3307"
        }
    ]
}
