{
    "accessibility": "Open access",
    "additionDate": "2018-07-25T16:40:23Z",
    "biotoolsCURIE": "biotools:jcdsa",
    "biotoolsID": "jcdsa",
    "credit": [
        {
            "email": "zhaoxudong@nefu.edu.cn",
            "name": "Xudong Zhao",
            "orcidid": "https://orcid.org/0000-0003-2272-6278",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Joint covariate detection tool for survival analysis on tumor expression profiles.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://bio-nefu.com/docs/joint-covariate-detection-for-survial-analysis"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene expression profiling",
                    "uri": "http://edamontology.org/operation_0314"
                }
            ]
        }
    ],
    "homepage": "http://bio-nefu.com/resource/jcdsa",
    "language": [
        "MATLAB",
        "Python"
    ],
    "lastUpdate": "2020-06-16T10:55:21Z",
    "license": "GPL-2.0",
    "name": "JCDSA",
    "operatingSystem": [
        "Linux",
        "Windows"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1186/s12859-018-2213-3",
            "metadata": {
                "abstract": "© 2018 The Author(s).Background: Survival analysis on tumor expression profiles has always been a key issue for subsequent biological experimental validation. It is crucial how to select features which closely correspond to survival time. Furthermore, it is important how to select features which best discriminate between low-risk and high-risk group of patients. Common features derived from the two aspects may provide variable candidates for prognosis of cancer. Results: Based on the provided two-step feature selection strategy, we develop a joint covariate detection tool for survival analysis on tumor expression profiles. Significant features, which are not only consistent with survival time but also associated with the categories of patients with different survival risks, are chosen. Using the miRNA expression data (Level 3) of 548 patients with glioblastoma multiforme (GBM) as an example, miRNA candidates for prognosis of cancer are selected. The reliability of selected miRNAs using this tool is demonstrated by 100 simulations. Furthermore, It is discovered that significant covariates are not directly composed of individually significant variables. Conclusions: Joint covariate detection provides a viewpoint for selecting variables which are not individually but jointly significant. Besides, it helps to select features which are not only consistent with survival time but also associated with prognosis risk. The software is available at http://bio-nefu.com/resource/jcdsa.",
                "authors": [
                    {
                        "name": "Wu Y."
                    },
                    {
                        "name": "Liu Y."
                    },
                    {
                        "name": "Wang Y."
                    },
                    {
                        "name": "Shi Y."
                    },
                    {
                        "name": "Zhao X."
                    }
                ],
                "citationCount": 2,
                "date": "2018-05-29T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "JCDSA: A joint covariate detection tool for survival analysis on tumor expression profiles"
            },
            "pmcid": "PMC5975448",
            "pmid": "29843599",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Regenerative medicine",
            "uri": "http://edamontology.org/topic_3395"
        }
    ],
    "validated": 1
}