{
    "additionDate": "2020-01-14T08:51:48Z",
    "biotoolsCURIE": "biotools:metaSPARSim",
    "biotoolsID": "metaSPARSim",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "barbara.dicamillo@unipd.it",
            "name": "Barbara Di Camillo",
            "typeEntity": "Person"
        }
    ],
    "description": "A 16S rRNA gene sequencing count data simulator.\n\nA rule-based model of insulin signalling pathway.\n\nDi Camillo B, Sambo F, Toffolo G, Cobelli C. ABACUS: an entropy based cumulative bivariate statistic robust to rare variants and different direction of genotype effect. Bioinformatics 30(3):384-391.\n\nPatuzzi I., Baruzzo G., Losasso C., Ricci A., Di Camillo B. \"metaSPARSim: a 16S rRNA gene sequencing count data simulator\", Submitted to BMC Bioinformatics, October 2018",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Network simulation",
                    "uri": "http://edamontology.org/operation_3562"
                },
                {
                    "term": "Imputation",
                    "uri": "http://edamontology.org/operation_3557"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                }
            ]
        }
    ],
    "homepage": "http://sysbiobig.dei.unipd.it/?q=Software#metaSPARSimand",
    "lastUpdate": "2020-12-28T09:33:26Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://gitlab.com/sysbiobig/metasparsim"
        },
        {
            "type": [
                "Repository"
            ],
            "url": "https://gitlab.com/sysbiobig/metasparsimunder"
        }
    ],
    "name": "metaSPARSim",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12859-019-2882-6",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: In the last few years, 16S rRNA gene sequencing (16S rDNA-seq) has seen a surprisingly rapid increase in election rate as a methodology to perform microbial community studies. Despite the considerable popularity of this technique, an exiguous number of specific tools are currently available for proper 16S rDNA-seq count data preprocessing and simulation. Indeed, the great majority of tools have been developed adapting methodologies previously used for bulk RNA-seq data, with poor assessment of their applicability in the metagenomics field. For such tools and the few ones specifically developed for 16S rDNA-seq data, performance assessment is challenging, mainly due to the complex nature of the data and the lack of realistic simulation models. In fact, to the best of our knowledge, no software thought for data simulation are available to directly obtain synthetic 16S rDNA-seq count tables that properly model heavy sparsity and compositionality typical of these data. Results: In this paper we present metaSPARSim, a sparse count matrix simulator intended for usage in development of 16S rDNA-seq metagenomic data processing pipelines. metaSPARSim implements a new generative process that models the sequencing process with a Multivariate Hypergeometric distribution in order to realistically simulate 16S rDNA-seq count table, resembling real experimental data compositionality and sparsity. It provides ready-to-use count matrices and comes with the possibility to reproduce different pre-coded scenarios and to estimate simulation parameters from real experimental data. The tool is made available at http://sysbiobig.dei.unipd.it/?q=Software#metaSPARSim and https://gitlab.com/sysbiobig/metasparsim. Conclusion: metaSPARSim is able to generate count matrices resembling real 16S rDNA-seq data. The availability of count data simulators is extremely valuable both for methods developers, for which a ground truth for tools validation is needed, and for users who want to assess state of the art analysis tools for choosing the most accurate one. Thus, we believe that metaSPARSim is a valuable tool for researchers involved in developing, testing and using robust and reliable data analysis methods in the context of 16S rRNA gene sequencing.",
                "authors": [
                    {
                        "name": "Patuzzi I."
                    },
                    {
                        "name": "Baruzzo G."
                    },
                    {
                        "name": "Losasso C."
                    },
                    {
                        "name": "Ricci A."
                    },
                    {
                        "name": "Di Camillo B."
                    }
                ],
                "citationCount": 2,
                "date": "2019-11-22T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "MetaSPARSim: A 16S rRNA gene sequencing count data simulator"
            },
            "pmcid": "PMC6873395",
            "pmid": "31757204"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "Microbial ecology",
            "uri": "http://edamontology.org/topic_3697"
        },
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ],
    "validated": 1
}