
{
    "credit": [
        {
            "email": "darby@mail.ncku.edu.tw",
            "name": "AH-DB team",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://ahdb.ee.ncku.edu.tw/help.html"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Protein structure analysis",
                    "uri": "http://edamontology.org/operation_2406"
                },
                {
                    "term": "Protein structure assignment",
                    "uri": "http://edamontology.org/operation_0320"
                },
                {
                    "term": "ID mapping",
                    "uri": "http://edamontology.org/operation_3282"
                },
                {
                    "term": "Mapping",
                    "uri": "http://edamontology.org/operation_2429"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Database portal"
        ],
        "topic": [
            {
                "term": "Mapping",
                "uri": "http://edamontology.org/topic_0102"
            },
            {
                "term": "Proteins",
                "uri": "http://edamontology.org/topic_0078"
            },
            {
                "term": "Experimental design and studies",
                "uri": "http://edamontology.org/topic_3678"
            },
            {
                "term": "Protein structure analysis",
                "uri": "http://edamontology.org/topic_2814"
            },
            {
                "term": "Structure prediction",
                "uri": "http://edamontology.org/topic_0082"
            }
        ]
    },
    "publication": [
        {
            "abstract": "This work presents the Apo-Holo DataBase (AH-DB, http://ahdb.ee.ncku.edu. tw/ and http://ahdb.csbb. ntu.edu.tw/), which provides corresponding pairs of protein structures before and after binding. Conformational transitions are commonly observed in various protein interactions that are involved in important biological functions. For example, copper-zinc superoxide dismutase (SOD1), which destroys free superoxide radicals in the body, undergoes a large conformational transition from an 'open' state (apo structure) to a 'closed' state (holo structure). Many studies have utilized collections of apo-holo structure pairs to investigate the conformational transitions and critical residues. However, the collection process is usually complicated, varies from study to study and produces a small-scale data set. AH-DB is designed to provide an easy and unified way to prepare such data, which is generated by identifying/mapping molecules in different Protein Data Bank (PDB) entries. Conformational transitions are identified based on a refined alignment scheme to overcome the challenge that many structures in the PDB database are only protein fragments and not complete proteins. There are 746 314 apo-holo pairs in AH-DB, which is about 30 times those in the second largest collection of similar data. AH-DB provides sophisticated interfaces for searching apo-holo structure pairs and exploring conformational transitions from apo structures to the corresponding holo structures. © The Author(s) 2011.",
            "authors": [
                "Chang D.T.-H.",
                "Yao T.-J.",
                "Fan C.-Y.",
                "Chiang C.-Y.",
                "Bai Y.-H."
            ],
            "cit_count": 10,
            "journal": "Nucleic Acids Research",
            "pmid": "22084200",
            "title": "AH-DB: Collecting protein structure pairs before and after binding",
            "year": "2012-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:ah-db",
        "biotoolsID": "ah-db",
        "description": "Database of protein structure pairs (apo-holo structure pairs) before and after binding. AH-DB is designed to provide an easy and unified way to prepare apo-holo structure pair data for studies. Data is generated by identifying/mapping molecules in Protein Data Bank (PDB) entries.",
        "homepage": "http://ahdb.ee.ncku.edu.tw/",
        "name": "AH-DB"
    }
}