{
    "additionDate": "2021-01-18T10:54:21Z",
    "biotoolsCURIE": "biotools:isoresolve",
    "biotoolsID": "isoresolve",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "jxwang@mail.csu.edu.cn",
            "name": "Jianxin Wang",
            "typeEntity": "Person"
        }
    ],
    "description": "Predicting Splice Isoform Functions by Integrating Gene and Isoform-level Features with Domain Adaptation.\n\nIsoResolve is a computational approach for isoform function prediction by leveraging the information of gene function prediction models with domain adaptation (DA). IsoResolve treats gene- level and isoform-level features as source and target domain, respectively. It employs DA to project the two domains to a latent variable (LV) space in such a way that the LVs projected from the gene and isoform domain features are of approximately the same distribution, enabling that the gene domain information can be leveraged for predicting isoform functions.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Alternative splicing prediction",
                    "uri": "http://edamontology.org/operation_0264"
                },
                {
                    "term": "Fold recognition",
                    "uri": "http://edamontology.org/operation_0303"
                },
                {
                    "term": "Splice site prediction",
                    "uri": "http://edamontology.org/operation_0433"
                }
            ]
        }
    ],
    "homepage": "https://github.com/genemine/IsoResolve",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T20:44:31.442605Z",
    "name": "IsoResolve",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btaa829",
            "metadata": {
                "abstract": "Motivation: High resolution annotation of gene functions is a central goal in functional genomics. A single gene may produce multiple isoforms with different functions through alternative splicing. Conventional approaches, however, consider a gene as a single entity without differentiating these functionally different isoforms. Towards understanding gene functions at higher resolution, recent efforts have focused on predicting the functions of isoforms. However, the performance of existing methods is far from satisfactory mainly because of the lack of isoform-level functional annotation. Results: We present IsoResolve, a novel approach for isoform function prediction, which leverages the information from gene function prediction models with domain adaptation (DA). IsoResolve treats gene-level and isoform-level features as source and target domains, respectively. It uses DA to project the two domains into a latent variable space in such a way that the latent variables from the two domains have similar distribution, which enables the gene domain information to be leveraged for isoform function prediction. We systematically evaluated the performance of IsoResolve in predicting functions. Compared with five state-of-the-art methods, IsoResolve achieved significantly better performance. IsoResolve was further validated by case studies of genes with isoform-level functional annotation.",
                "authors": [
                    {
                        "name": "Li H.-D."
                    },
                    {
                        "name": "Omenn G.S."
                    },
                    {
                        "name": "Wang J."
                    },
                    {
                        "name": "Wu F.-X."
                    },
                    {
                        "name": "Yang C."
                    },
                    {
                        "name": "Yang M."
                    },
                    {
                        "name": "Zhang Z."
                    }
                ],
                "citationCount": 10,
                "date": "2021-02-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "IsoResolve: Predicting splice isoform functions by integrating gene and isoform-level features with domain adaptation"
            },
            "pmcid": "PMC8088322",
            "pmid": "32966552"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Functional genomics",
            "uri": "http://edamontology.org/topic_0085"
        },
        {
            "term": "Gene structure",
            "uri": "http://edamontology.org/topic_0114"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "RNA splicing",
            "uri": "http://edamontology.org/topic_3320"
        }
    ]
}
