{
    "additionDate": "2021-01-18T08:30:12Z",
    "biotoolsCURIE": "biotools:tfmotifview",
    "biotoolsID": "tfmotifview",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "anais.bardet@unistra.fr",
            "name": "Anaïs Flore Bardet",
            "orcidid": "https://orcid.org/0000-0003-2306-7809",
            "typeEntity": "Person"
        }
    ],
    "description": "a webserver for the visualization of transcription factor motifs in genomic regions.\n\nTFmotifView is a web server that allows to study the distribution of known transcription factor (TF) motifs in genomic regions. Based on genomic regions of interest and selected TF motifs (settings), TFmotifView performs an overlap of the genomic regions with TF motif occurrences from the JASPAR database to generate three different outputs: (1) an enrichment table and scatterplot calculating the significance of motif occurrences in genomic regions compared to control regions, (2) a genomic view of the organisation of TF motifs in each genomic region including an option to export the motif positions into the UCSC genome browser, and (3) a metaplot summarising the position of TF motifs relative to the center of the regions.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence motif recognition",
                    "uri": "http://edamontology.org/operation_0239"
                },
                {
                    "term": "Genome visualisation",
                    "uri": "http://edamontology.org/operation_3208"
                },
                {
                    "term": "Peak calling",
                    "uri": "http://edamontology.org/operation_3222"
                }
            ]
        }
    ],
    "homepage": "http://bardet.u-strasbg.fr/tfmotifview/",
    "lastUpdate": "2021-02-27T09:02:15Z",
    "name": "TFmotifView",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1093/NAR/GKAA252",
            "metadata": {
                "abstract": "© The Author(s) 2020. Published by Oxford University Press on behalf of Nucleic Acids Research.Transcription factors (TFs) regulate the expression of gene expression. The binding specificities of many TFs have been deciphered and summarized as position-weight matrices, also called TF motifs. Despite the availability of hundreds of known TF motifs in databases, it remains non-trivial to quickly query and visualize the enrichment of known TF motifs in genomic regions of interest. Towards this goal, we developed TFmotifView, a web server that allows to study the distribution of known TF motifs in genomic regions. Based on input genomic regions and selected TF motifs, TFmotifView performs an overlap of the genomic regions with TF motif occurrences identified using a dynamic P-value threshold. TFmotifView generates three different outputs: (i) an enrichment table and scatterplot calculating the significance of TF motif occurrences in genomic regions compared to control regions, (ii) a genomic view of the organisation of TF motifs in each genomic region and (iii) a metaplot summarizing the position of TF motifs relative to the center of the regions. TFmotifView will contribute to the integration of TF motif information with a wide range of genomic datasets towards the goal to better understand the regulation of gene expression by transcription factors. TFmotifView is freely available at http://bardet.u-strasbg.fr/tfmotifview/.",
                "authors": [
                    {
                        "name": "Leporcq C."
                    },
                    {
                        "name": "Spill Y."
                    },
                    {
                        "name": "Balaramane D."
                    },
                    {
                        "name": "Toussaint C."
                    },
                    {
                        "name": "Weber M."
                    },
                    {
                        "name": "Bardet A.F."
                    }
                ],
                "citationCount": 2,
                "date": "2021-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "TFmotifView: A webserver for the visualization of transcription factor motifs in genomic regions"
            },
            "pmcid": "PMC7319436",
            "pmid": "32324215"
        }
    ],
    "topic": [
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "Gene regulation",
            "uri": "http://edamontology.org/topic_0204"
        },
        {
            "term": "ChIP-seq",
            "uri": "http://edamontology.org/topic_3169"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        }
    ]
}