{
    "additionDate": "2019-11-14T18:10:57Z",
    "biotoolsCURIE": "biotools:MPRAscore",
    "biotoolsID": "MPRAscore",
    "confidence_flag": "tool",
    "description": "Robust and non-parametric analysis of massively parallel reporter assays | MPRAscore: Robust and non-parametric analysis of massively parallel reporter assays (MPRA) | MPRAscore infers allele-specific effects on transcription from MPRA data. MPRAscore uses a weighted, variance-regularized method to calculate variant effect sizes robustly, and a permutation approach to test for significance without assuming normality or independence",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://github.com/abhisheknrl/MPRAscore",
    "language": [
        "C++"
    ],
    "lastUpdate": "2020-12-29T10:24:24Z",
    "name": "MPRAscore",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ591",
            "metadata": {
                "abstract": "© 2019 The Author(s) . Published by Oxford University Press. All rights reserved.Massively parallel reporter assays (MPRA) enable systematic screening of DNA sequence variants for effects on transcriptional activity. However, convenient analysis tools are still needed. Results: We introduce MPRAscore, a novel tool to infer allele-specific effects on transcription from MPRA data. MPRAscore uses a weighted, variance-regularized method to calculate variant effect sizes robustly, and a permutation approach to test for significance without assuming normality or independence.",
                "authors": [
                    {
                        "name": "Ajore R."
                    },
                    {
                        "name": "Nilsson B."
                    },
                    {
                        "name": "Niroula A."
                    }
                ],
                "citationCount": 2,
                "date": "2019-12-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "MPRAscore: Robust and non-parametric analysis of massively parallel reporter assays"
            },
            "pmid": "31359027"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        }
    ],
    "validated": 1
}
