
{
    "credit": [
        {
            "email": "anna.gogleva@slcu.cam.ac.uk",
            "name": "Anna Gogleva",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "https://github.com/gogleva/SecretSanta"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Protein function prediction",
                    "uri": "http://edamontology.org/operation_1777"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "R"
        ],
        "operatingSystem": [
            "Linux",
            "Mac"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Protein targeting and localisation",
                "uri": "http://edamontology.org/topic_0140"
            },
            {
                "term": "Membrane and lipoproteins",
                "uri": "http://edamontology.org/topic_0820"
            },
            {
                "term": "Molecular interactions, pathways and networks",
                "uri": "http://edamontology.org/topic_0602"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© The Author(s) 2018. Published by Oxford University Press. All rights reserved. Motivation: The secretome denotes the collection of secreted proteins exported outside of the cell. The functional roles of secreted proteins include the maintenance and remodelling of the extracellular matrix as well as signalling between host and non-host cells. These features make secretomes rich reservoirs of biomarkers for disease classification and host?pathogen interaction studies. Common biomarkers are extracellular proteins secreted via classical pathways that can be predicted from sequence by annotating the presence or absence of N-terminal signal peptides. Several heterogeneous command line tools and web-interfaces exist to identify individual motifs, signal sequences and domains that are either characteristic or strictly excluded from secreted proteins. However, a single flexible secretome-prediction workflow that combines all analytic steps is still missing. Results: To bridge this gap the SecretSanta package implements wrapper and parser functions around established command line tools for the integrative prediction of extracellular proteins that are secreted via classical pathways. The modularity of SecretSanta enables users to create tailored pipelines and apply them across the whole tree of life to facilitate comparison of secretomes across multiple species or under various conditions.",
            "authors": [
                "Gogleva A.",
                "Drost H.-G.",
                "Schornack S."
            ],
            "cit_count": 1,
            "doi": "10.1093/bioinformatics/bty088",
            "journal": "Bioinformatics",
            "title": "SecretSanta: Flexible pipelines for functional secretome prediction",
            "year": "2018-07-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:secretsanta",
        "biotoolsID": "secretsanta",
        "description": "Flexible pipelines for functional secretome prediction.",
        "homepage": "https://github.com/gogleva/SecretSanta",
        "name": "SecretSanta"
    }
}