{
    "name": "McSNP", 
    "description": "McSNP is a relatively cheap and handy genotyping technique as it is an extension of the RT-PCR technique. It make use of the difference in melting temperature of PCR products for different alleles.", 
    "homepage": "http://www.bioinformatics.org/mcsnp/wiki/", 
    "biotoolsID": "McSNP", 
    "biotoolsCURIE": "biotools:McSNP", 
    "version": [
        "1.0"
    ], 
    "otherID": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_3196", 
                    "term": "Genotyping"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Desktop application"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_0625", 
            "term": "Genotyping"
        }, 
        {
            "uri": "http://edamontology.org/topic_2885", 
            "term": "SNP"
        }, 
        {
            "uri": "http://edamontology.org/topic_3053", 
            "term": "Genetics"
        }
    ], 
    "operatingSystem": [
        "Linux", 
        "Windows", 
        "Mac"
    ], 
    "language": [
        "Java"
    ], 
    "license": null, 
    "collectionID": [], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [
        {
            "url": "http://www.mybiosoftware.com/mcsnp-1-0-melting-curve-snp.html", 
            "type": "Registry", 
            "note": null
        }
    ], 
    "download": [], 
    "documentation": [
        {
            "url": "https://www.bioinformatics.org/mcsnp/wiki/PmWiki/DocumentationIndex", 
            "type": "General", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": "10.1186/2043-9113-1-3", 
            "pmid": null, 
            "pmcid": null, 
            "type": "Primary", 
            "version": null, 
            "metadata": {
                "title": "A base-calling algorithm for Tm-shifted melting curve SNP assay", 
                "abstract": "Background: Tm-shifted melting curve SNP assays are a class of homogeneous, low-cost genotyping assays. Alleles manifest themselves as signal peaks in the neighbourhood of theoretical allele-specific melting temperatures. Base calling for these assays has mostly relied on unsupervised algorithm or human visual inspection to date. However, a practical clinical test needs to handle one or few individual samples at a time. This could pose a challenge for unsupervised algorithms which usually require a large number of samples to define alleles-representing signal clusters on the fly.Methods: We presented a supervised base-calling algorithm and software for Tm-shifted melting curve SNP assays. The algorithm comprises a peak detection procedure and an ordinal regression model. The peak detection procedure is required for building models as well as handling new samples. Ordinal regression is proposed because signal intensities of alleles AA, AB, and BB usually follow an ordinal pattern with the heterozygous allele lie between two distinct homozygous alleles. Coefficients of the ordinal regression model are first trained and then used for base calling.Results: A dataset of 12 SNPs of 44 unrelated persons was used for a demonstration purpose. The call rate is 99.6%. Among the base calls, 99.1% are identical to those made by the sequencing method. A small fraction of the melting curve signals (0.4%) is declared as no call for further human inspection. A software was implemented using the Java language, providing a graphical user interface for the visualization and handling of multiple melting curve signals.Conclusions: Tm-shifted melting curve SNP assays, together with the proposed base calling algorithm and software, provide a practical solution for genetic tests on a clinical setting. The software is available in http://www.bioinformatics.org/mcsnp/wiki/Main/HomePage. © 2011 Liang et al; licensee BioMed Central Ltd.", 
                "date": "2011-01-20T00:00:00Z", 
                "citationCount": 1, 
                "authors": [
                    {
                        "name": "Liang K.-H."
                    }, 
                    {
                        "name": "Fen J.-J."
                    }, 
                    {
                        "name": "Chang H.-H."
                    }, 
                    {
                        "name": "Wang H.-W."
                    }, 
                    {
                        "name": "Hwang Y."
                    }
                ], 
                "journal": "Journal of Clinical Bioinformatics"
            }
        }
    ], 
    "credit": [
        {
            "name": null, 
            "email": null, 
            "url": "https://sites.google.com/site/sbmscience/", 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "mbs_import", 
    "additionDate": "2017-12-18T00:09:15Z", 
    "lastUpdate": "2018-12-10T12:58:57Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 0, 
    "homepage_status": 0
}