{
    "accessibility": "Open access",
    "additionDate": "2023-02-13T03:15:28.020344Z",
    "biotoolsCURIE": "biotools:roiformsi",
    "biotoolsID": "roiformsi",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "ang.guo@siat.ac.cn",
            "name": "Ang Guo",
            "orcidid": "https://orcid.org/0009-0006-0472-1528"
        },
        {
            "name": "Fang Li",
            "orcidid": "https://orcid.org/0000-0003-1186-6857"
        },
        {
            "name": "Qian Luo",
            "orcidid": "https://orcid.org/0000-0003-2051-487X"
        },
        {
            "name": "Zhiyu Chen",
            "orcidid": "https://orcid.org/0000-0002-0637-4914"
        }
    ],
    "description": "Spatial segmentation, obtained by clustering MSI pixels according to their mass spectral similarities, is a popular approach to automate ROI definition. Here we report a multimodal fusion strategy to enable an objective and trustworthy selection of \\#Clusters by utilizing additional information from corresponding histology images. Our work will greatly facilitate MSI-mediated spatial lipidomics, metabolomics, and proteomics research by providing intelligent software to automatically and reliably generate ROIs.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                },
                {
                    "term": "Spectral analysis",
                    "uri": "http://edamontology.org/operation_3214"
                }
            ]
        }
    ],
    "homepage": "https://github.com/guoang4github/ROIforMSI/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2023-05-01T10:40:35.122733Z",
    "license": "GPL-3.0",
    "name": "ROIforMSI",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "guoang681",
    "publication": [
        {
            "doi": "10.1093/gigascience/giad021",
            "metadata": {
                "abstract": "Mass spectrometry imaging (MSI), which localizes molecules in a tag-free, spatially resolved manner, is a powerful tool for the understanding of underlying biochemical mechanisms of biological phenomena. When analyzing MSI data, it is essential to delineate regions of interest (ROIs) that correspond to tissue areas of different anatomical or pathological labels. Spatial segmentation, obtained by clustering MSI pixels according to their mass spectral similarities, is a popular approach to automate ROI definition. However, how to select the number of clusters (#Clusters), which determines the granularity of segmentation, remains to be resolved, and an inappropriate #Clusters may lead to ROIs not biologically real. Here we report a multimodal fusion strategy to enable an objective and trustworthy selection of #Clusters by utilizing additional information from corresponding histology images. A deep learning-based algorithm is proposed to extract \"histomorphological feature spectra\" across an entire hematoxylin and eosin image. Clustering is then similarly performed to produce histology segmentation. Since ROIs originating from instrumental noise or artifacts would not be reproduced cross-modally, the consistency between histology and MSI segmentation becomes an effective measure of the biological validity of the results. So, #Clusters that maximize the consistency is deemed as most probable. We validated our strategy on mouse kidney and renal tumor specimens by producing multimodally corroborated ROIs that agreed excellently with ground truths. Downstream analysis based on the said ROIs revealed lipid molecules highly specific to tissue anatomy or pathology. Our work will greatly facilitate MSI-mediated spatial lipidomics, metabolomics, and proteomics research by providing intelligent software to automatically and reliably generate ROIs.",
                "authors": [
                    {
                        "name": "Chen Z."
                    },
                    {
                        "name": "Guo A."
                    },
                    {
                        "name": "Li F."
                    },
                    {
                        "name": "Luo Q."
                    }
                ],
                "date": "2022-12-28T00:00:00Z",
                "journal": "GigaScience",
                "title": "Delineating regions of interest for mass spectrometry imaging by multimodally corroborated spatial segmentation"
            },
            "pmcid": "PMC10087011",
            "pmid": "37039115"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Lipids",
            "uri": "http://edamontology.org/topic_0153"
        },
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        }
    ]
}
