{
    "additionDate": "2019-11-14T18:14:35Z",
    "biotoolsCURIE": "biotools:DUETT",
    "biotoolsID": "DUETT",
    "confidence_flag": "tool",
    "description": "DUETT quantitatively identifies known and novel events in nascent RNA structural dynamics from chemical probing data | MOTIVATION:RNA molecules can undergo complex structural dynamics, especially during transcription, which influence their biological functions. Recently developed high-throughput chemical probing experiments that study RNA cotranscriptional folding generate nucleotide-resolution 'reactivities' for each length of a growing nascent RNA that reflect structural dynamics. However, the manual annotation and qualitative interpretation of reactivity across these large datasets can be nuanced, laborious, and difficult for new practitioners. We developed a quantitative and systematic approach to automatically detect RNA folding events from these datasets to reduce human bias error, standardize event discovery, and generate hypotheses about RNA folding trajectories for further analysis and experimental validation",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Fold recognition",
                    "uri": "http://edamontology.org/operation_0303"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Simulation analysis",
                    "uri": "http://edamontology.org/operation_0244"
                }
            ]
        }
    ],
    "homepage": "https://github.com/BagheriLab/DUETT",
    "language": [
        "R"
    ],
    "lastUpdate": "2024-11-24T20:53:09.668208Z",
    "name": "DUETT",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btz449",
            "metadata": {
                "abstract": "Motivation: RNA molecules can undergo complex structural dynamics, especially during transcription, which influence their biological functions. Recently developed high-throughput chemical probing experiments that study RNA cotranscriptional folding generate nucleotide-resolution 'reactivities' for each length of a growing nascent RNA that reflect structural dynamics. However, the manual annotation and qualitative interpretation of reactivity across these large datasets can be nuanced, laborious, and difficult for new practitioners. We developed a quantitative and systematic approach to automatically detect RNA folding events from these datasets to reduce human bias/error, standardize event discovery and generate hypotheses about RNA folding trajectories for further analysis and experimental validation. Results: Detection of Unknown Events with Tunable Thresholds (DUETT) identifies RNA structural transitions in cotranscriptional RNA chemical probing datasets. DUETT employs a feedback control-inspired method and a linear regression approach and relies on interpretable and independently tunable parameter thresholds to match qualitative user expectations with quantitatively identified folding events. We validate the approach by identifying known RNA structural transitions within the cotranscriptional folding pathways of the Escherichia coli signal recognition particle RNA and the Bacillus cereus crcB fluoride riboswitch. We identify previously overlooked features of these datasets such as heightened reactivity patterns in the signal recognition particle RNA about 12 nt lengths before base-pair rearrangement. We then apply a sensitivity analysis to identify tradeoffs when choosing parameter thresholds. Finally, we show that DUETT is tunable across a wide range of contexts, enabling flexible application to study broad classes of RNA folding mechanisms.",
                "authors": [
                    {
                        "name": "Bagheri N."
                    },
                    {
                        "name": "Lucks J.B."
                    },
                    {
                        "name": "Xue A.Y."
                    },
                    {
                        "name": "Yu A.M."
                    }
                ],
                "citationCount": 4,
                "date": "2019-12-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "DUETT quantitatively identifies known and novel events in nascent RNA structural dynamics from chemical probing data"
            },
            "pmcid": "PMC6954663",
            "pmid": "31389563"
        }
    ],
    "topic": [
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        },
        {
            "term": "Structure prediction",
            "uri": "http://edamontology.org/topic_0082"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ],
    "validated": 1
}
