{
    "name": "Redi", 
    "description": "The software simulates biochemical systems at the mesoscopic scale of interaction based on the stochastic model of reaction-diffusion systems, in which the diffusion coefficients are function of the local concentration, viscosity and frictional forces.", 
    "homepage": "http://www.cosbi.eu/research/prototypes/redi", 
    "biotoolsID": "Redi", 
    "biotoolsCURIE": "biotools:Redi", 
    "version": [], 
    "otherID": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_2426", 
                    "term": "Modelling and simulation"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Desktop application"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_2259", 
            "term": "Systems biology"
        }, 
        {
            "uri": "http://edamontology.org/topic_3292", 
            "term": "Biochemistry"
        }, 
        {
            "uri": "http://edamontology.org/topic_3369", 
            "term": "Chemical biology"
        }, 
        {
            "uri": "http://edamontology.org/topic_3524", 
            "term": "Simulation experiment"
        }
    ], 
    "operatingSystem": [
        "Windows"
    ], 
    "language": [
        "C++", 
        "C#", 
        "Visual Basic"
    ], 
    "license": null, 
    "collectionID": [], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [
        {
            "url": "http://www.mybiosoftware.com/redi-reaction-diffusion-simulator.html", 
            "type": "Registry", 
            "note": null
        }
    ], 
    "download": [], 
    "documentation": [
        {
            "url": "http://www.cosbi.eu/stories/prototypes/downloads/Redi/quickstart.pdf", 
            "type": "General", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": null, 
            "pmid": "21098882", 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "Stochastic simulation of the spatio-temporal dynamics of reaction-diffusion systems: the case for the bicoid gradient.", 
                "abstract": "Reaction-diffusion systems are mathematical models that describe how the concentrations of substances distributed in space change under the influence of local chemical reactions, and diffusion which causes the substances to spread out in space. The classical representation of a reaction-diffusion system is given by semi-linear parabolic partial differential equations, whose solution predicts how diffusion causes the concentration field to change with time. This change is proportional to the diffusion coefficient. If the solute moves in a homogeneous system in thermal equilibrium, the diffusion coefficients are constants that do not depend on the local concentration of solvent and solute. However, in nonhomogeneous and structured media the assumption of constant intracellular diffusion coefficient is not necessarily valid, and, consequently, the diffusion coefficient is a function of the local concentration of solvent and solutes. In this paper we propose a stochastic model of reaction-diffusion systems, in which the diffusion coefficients are function of the local concentration, viscosity and frictional forces. We then describe the software tool Redi (REaction-DIffusion simulator) which we have developed in order to implement this model into a Gillespie-like stochastic simulation algorithm. Finally, we show the ability of our model implemented in the Redi tool to reproduce the observed gradient of the bicoid protein in the Drosophila Melanogaster embryo. With Redi, we were able to simulate with an accuracy of 1% the experimental spatio-temporal dynamics of the bicoid protein, as recorded in time-lapse experiments obtained by direct measurements of transgenic bicoidenhanced green fluorescent protein.", 
                "date": "2010-12-01T00:00:00Z", 
                "citationCount": 8, 
                "authors": [
                    {
                        "name": "Lecca P."
                    }, 
                    {
                        "name": "Ihekwaba A.E."
                    }, 
                    {
                        "name": "Dematte L."
                    }, 
                    {
                        "name": "Priami C."
                    }
                ], 
                "journal": "Journal of integrative bioinformatics"
            }
        }
    ], 
    "credit": [
        {
            "name": null, 
            "email": "redi@cosbi.eu", 
            "url": "http://www.cosbi.eu/", 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "mbs_import", 
    "additionDate": "2017-08-03T18:58:31Z", 
    "lastUpdate": "2018-12-10T12:58:50Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 0, 
    "homepage_status": 0
}