{
    "accessibility": "Open access",
    "additionDate": "2022-06-15T11:10:54.559421Z",
    "biotoolsCURIE": "biotools:mitodataclean",
    "biotoolsID": "mitodataclean",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "xingjl@fmmu.edu.cn",
            "name": "Jinliang Xing",
            "orcidid": "https://orcid.org/0000-0002-7010-1822"
        },
        {
            "name": "Xiwen Gu"
        },
        {
            "name": "Qichao Huang",
            "orcidid": "https://orcid.org/0000-0002-1071-1696"
        }
    ],
    "description": "A machine learning approach for the accurate identification of cross-contamination-derived tumor mitochondrial DNA mutations.",
    "editPermission": {
        "type": "private"
    },
    "homepage": "https://github.com/3150129019/mitoDataclean",
    "language": [
        "R"
    ],
    "lastUpdate": "2022-06-15T11:10:54.561949Z",
    "license": "Not licensed",
    "name": "mitoDataclean",
    "operatingSystem": [
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1002/IJC.33927",
            "metadata": {
                "abstract": "© 2022 UICCNext-generation sequencing (NGS) of mitochondrial DNA (mtDNA) has widespread applications in aging and cancer studies. However, cross-contamination of mtDNA constitutes a major concern. Previous methods for the detection of mtDNA contamination mainly focus on haplogroup-level phylogeny, but neglect haplotype-level differences, leading to limited sensitivity and accuracy. In our study, we present mitoDataclean, a random-forest-based machine learning package for accurate identification of cross-contamination, evaluation of contamination levels and detection of contamination-derived variants in mtDNA NGS data. Comprehensive optimization of mitoDataclean revealed that training simulation with mixtures of small haplogroup distance and low polymorphic difference was critical for optimal modeling. Compared to existing methods, mitoDataclean exhibited significantly improved sensitivity and accuracy for the detection of sample contamination in simulated data. In addition, mitoDataclean achieved area under the curve values of 0.91 and 0.97 for discerning genuine and contamination-derived mtDNA variants in a simulated Western dataset and private sequencing contamination data, respectively, suggesting that this tool may be applicable for different populations and samples with different sources of contamination. Finally, mitoDataclean was further evaluated in several private and public datasets and showed a robust ability for contamination detection. Altogether, our study demonstrates that mitoDataclean may be used for accurate detection of contaminated samples and contamination-derived variants in mtDNA NGS data.",
                "authors": [
                    {
                        "name": "Gu X."
                    },
                    {
                        "name": "Guo S."
                    },
                    {
                        "name": "Guo W."
                    },
                    {
                        "name": "Guo X."
                    },
                    {
                        "name": "Huang Q."
                    },
                    {
                        "name": "Ji X."
                    },
                    {
                        "name": "Liu Y."
                    },
                    {
                        "name": "Su L."
                    },
                    {
                        "name": "Xing J."
                    },
                    {
                        "name": "Zhang H."
                    },
                    {
                        "name": "Zhou K."
                    }
                ],
                "date": "2022-05-15T00:00:00Z",
                "journal": "International Journal of Cancer",
                "title": "mitoDataclean: A machine learning approach for the accurate identification of cross-contamination-derived tumor mitochondrial DNA mutations"
            },
            "pmid": "35001369"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Phylogeny",
            "uri": "http://edamontology.org/topic_0084"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ]
}
