{
    "accessibility": "Open access",
    "additionDate": "2023-04-30T19:08:32.768454Z",
    "biotoolsCURIE": "biotools:symbac",
    "biotoolsID": "symbac",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Somenath Bakshi",
            "orcidid": "https://orcid.org/0000-0003-3864-2546"
        },
        {
            "name": "Georgeos Hardo",
            "orcidid": "https://orcid.org/0000-0003-0037-1293",
            "typeEntity": "Person"
        }
    ],
    "description": "SyMBac is a tool to generate synthetic phase contrast or fluorescence images of bacteria. Currently the tool supports bacteria growing in the mother machine and in monolayers as microcolonies.\nThis allows easy and rapid creation of training data, matching your experimental images, allowing you to train any model for cell segmentation or tracking.",
    "documentation": [
        {
            "type": [
                "API documentation"
            ],
            "url": "https://symbac.readthedocs.io/en/latest/"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "https://github.com/georgeoshardo/SyMBac"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "homepage": "https://symbac.readthedocs.io/en/latest/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2023-04-30T19:29:42.331559Z",
    "license": "GPL-2.0",
    "maturity": "Emerging",
    "name": "SyMBac",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "georgeos",
    "publication": [
        {
            "doi": "10.1186/s12915-022-01453-6",
            "metadata": {
                "abstract": "Background: Deep-learning–based image segmentation models are required for accurate processing of high-throughput timelapse imaging data of bacterial cells. However, the performance of any such model strictly depends on the quality and quantity of training data, which is difficult to generate for bacterial cell images. Here, we present a novel method of bacterial image segmentation using machine learning models trained with Synthetic Micrographs of Bacteria (SyMBac). Results: We have developed SyMBac, a tool that allows for rapid, automatic creation of arbitrary amounts of training data, combining detailed models of cell growth, physical interactions, and microscope optics to create synthetic images which closely resemble real micrographs, and is capable of training accurate image segmentation models. The major advantages of our approach are as follows: (1) synthetic training data can be generated virtually instantly and on demand; (2) these synthetic images are accompanied by perfect ground truth positions of cells, meaning no data curation is required; (3) different biological conditions, imaging platforms, and imaging modalities can be rapidly simulated, meaning any change in one’s experimental setup no longer requires the laborious process of manually generating new training data for each change. Deep-learning models trained with SyMBac data are capable of analysing data from various imaging platforms and are robust to drastic changes in cell size and morphology. Our benchmarking results demonstrate that models trained on SyMBac data generate more accurate cell identifications and precise cell masks than those trained on human-annotated data, because the model learns the true position of the cell irrespective of imaging artefacts. We illustrate the approach by analysing the growth and size regulation of bacterial cells during entry and exit from dormancy, which revealed novel insights about the physiological dynamics of cells under various growth conditions. Conclusions: The SyMBac approach will help to adapt and improve the performance of deep-learning–based image segmentation models for accurate processing of high-throughput timelapse image data.",
                "authors": [
                    {
                        "name": "Bakshi S."
                    },
                    {
                        "name": "Hardo G."
                    },
                    {
                        "name": "Noka M."
                    }
                ],
                "citationCount": 1,
                "date": "2022-12-01T00:00:00Z",
                "journal": "BMC Biology",
                "title": "Synthetic Micrographs of Bacteria (SyMBac) allows accurate segmentation of bacterial cells using deep neural networks"
            },
            "pmcid": "PMC9710168",
            "pmid": "36447211",
            "type": [
                "Method"
            ]
        }
    ],
    "relation": [
        {
            "biotoolsID": "cellmodeller",
            "type": "uses"
        },
        {
            "biotoolsID": "omnipose",
            "type": "uses"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Biology",
            "uri": "http://edamontology.org/topic_3070"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Light microscopy",
            "uri": "http://edamontology.org/topic_3385"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        }
    ],
    "version": [
        "0.3.7"
    ]
}
