{
    "accessibility": "Open access",
    "additionDate": "2023-01-17T00:16:20.718687Z",
    "biotoolsCURIE": "biotools:airrscape",
    "biotoolsID": "airrscape",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "eric.waltari@czbiohub.org",
            "name": "Eric Waltari",
            "orcidid": "http://orcid.org/0000-0001-6930-9645",
            "typeEntity": "Person"
        },
        {
            "email": "john.pak@czbiohub.org",
            "name": "John E. Pak",
            "orcidid": "http://orcid.org/0000-0002-2998-9735",
            "typeEntity": "Person"
        },
        {
            "name": "Joan Wong",
            "orcidid": "http://orcid.org/0000-0002-7849-6320"
        },
        {
            "name": "Krista M. McCutcheon",
            "orcidid": "http://orcid.org/0000-0003-1942-5175"
        },
        {
            "name": "Saba Nafees",
            "orcidid": "http://orcid.org/0000-0002-3292-7703"
        }
    ],
    "description": "An interactive tool for exploring B-cell receptor repertoires and antibody responses.\n\nTo run AIRRscape, clone the repo and open the app.R file in your RStudio, then click \"Run App\". As a Shiny app, it can run as a window of RStudio, or as a tab in a web browser (recommended).",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                },
                {
                    "term": "Peptide immunogenicity prediction",
                    "uri": "http://edamontology.org/operation_0252"
                },
                {
                    "term": "Side chain modelling",
                    "uri": "http://edamontology.org/operation_0480"
                }
            ]
        }
    ],
    "homepage": "https://ewaltari.shinyapps.io/airrscape2/",
    "language": [
        "R"
    ],
    "lastUpdate": "2023-01-17T00:16:20.722128Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/czbiohub/AIRRscape"
        }
    ],
    "name": "AIRRscape",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1371/journal.pcbi.1010052",
            "metadata": {
                "abstract": "© 2022 Waltari et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.The sequencing of antibody repertoires of B-cells at increasing coverage and depth has led to the identification of vast numbers of immunoglobulin heavy and light chains. However, the size and complexity of these Adaptive Immune Receptor Repertoire sequencing (AIRR-seq) datasets makes it difficult to perform exploratory analyses. To aid in data exploration, we have developed AIRRscape, an R Shiny-based interactive web browser application that enables B-cell receptor (BCR) and antibody feature discovery through comparisons among multiple repertoires. Using AIRR-seq data as input, AIRRscape starts by aggregating and sorting repertoires into interactive and explorable bins of germline V-gene, germline J-gene, and CDR3 length, providing a high-level view of the entire repertoire. Interesting subsets of repertoires can be quickly identified and selected, and then network topologies of CDR3 motifs can be generated for further exploration. Here we demonstrate AIRRscape using patient BCR repertoires and sequences of published monoclonal antibodies to investigate patterns of humoral immunity to three viral pathogens: SARS-CoV-2, HIV-1, and DENV (dengue virus). AIRRscape reveals convergent antibody sequences among datasets for all three pathogens, although HIV-1 antibody datasets display limited convergence and idiosyncratic responses. We have made AIRRscape available as a web-based Shiny application, along with code on GitHub to encourage its open development and use by immuno-informaticians, virologists, immunologists, vaccine developers, and other scientists that are interested in exploring and comparing multiple immune receptor repertoires.",
                "authors": [
                    {
                        "name": "McCutcheon K.M."
                    },
                    {
                        "name": "Nafees S."
                    },
                    {
                        "name": "Pak J.E."
                    },
                    {
                        "name": "Waltari E."
                    },
                    {
                        "name": "Wong J."
                    }
                ],
                "date": "2022-09-01T00:00:00Z",
                "journal": "PLoS Computational Biology",
                "title": "AIRRscape: An interactive tool for exploring B-cell receptor repertoires and antibody responses"
            },
            "pmcid": "PMC9524643",
            "pmid": "36126074"
        }
    ],
    "toolType": [
        "Script",
        "Web application"
    ],
    "topic": [
        {
            "term": "Immunogenetics",
            "uri": "http://edamontology.org/topic_3930"
        },
        {
            "term": "Immunoproteins and antigens",
            "uri": "http://edamontology.org/topic_2830"
        },
        {
            "term": "Sequence sites, features and motifs",
            "uri": "http://edamontology.org/topic_0160"
        },
        {
            "term": "Vaccinology",
            "uri": "http://edamontology.org/topic_3966"
        }
    ]
}
