{
    "accessibility": "Open access",
    "additionDate": "2022-03-10T16:59:05.970312Z",
    "biotoolsCURIE": "biotools:triophaser",
    "biotoolsID": "triophaser",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "stephen_piccolo@byu.edu",
            "name": "Stephen R. Piccolo",
            "orcidid": "https://orcid.org/0000-0003-2001-5640",
            "typeEntity": "Person"
        },
        {
            "name": "Dustin B. Miller"
        }
    ],
    "description": "Using Mendelian inheritance logic to improve genomic phasing of trios",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Haplotype mapping",
                    "uri": "http://edamontology.org/operation_0487"
                },
                {
                    "term": "Phasing",
                    "uri": "http://edamontology.org/operation_3454"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/dmiller903/trioPhaser",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-03-10T16:59:05.973934Z",
    "license": "MIT",
    "name": "trioPhaser",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1186/S12859-021-04470-4",
            "metadata": {
                "abstract": "© 2021, The Author(s).Background: When analyzing DNA sequence data of an individual, knowing which nucleotide was inherited from each parent can be beneficial when trying to identify certain types of DNA variants. Mendelian inheritance logic can be used to accurately phase (haplotype) the majority (67–83%) of an individual's heterozygous nucleotide positions when genotypes are available for both parents (trio). However, when all members of a trio are heterozygous at a position, Mendelian inheritance logic cannot be used to phase. For such positions, a computational phasing algorithm can be used. Existing phasing algorithms use a haplotype reference panel, sequencing reads, and/or parental genotypes to phase an individual; however, they are limited in that they can only phase certain types of variants, require a specific genotype build, require large amounts of storage capacity, and/or require long run times. We created trioPhaser to address these challenges. Results: trioPhaser uses gVCF files from an individual and their parents as initial input, and then outputs a phased VCF file. Input trio data are first phased using Mendelian inheritance logic. Then, the positions that cannot be phased using inheritance information alone are phased by the SHAPEIT4 phasing algorithm. Using whole-genome sequencing data of 52 trios, we show that trioPhaser, on average, increases the total number of phased positions by 21.0% and 10.5%, respectively, when compared to the number of positions that SHAPEIT4 or Mendelian inheritance logic can phase when either is used alone. In addition, we show that the accuracy of the phased calls output by trioPhaser are similar to linked-read and read-backed phasing. Conclusion: trioPhaser is a containerized software tool that uses both Mendelian inheritance logic and SHAPEIT4 to phase trios when gVCF files are available. By implementing both phasing methods, more variant positions are phased compared to what either method is able to phase alone.",
                "authors": [
                    {
                        "name": "Miller D.B."
                    },
                    {
                        "name": "Piccolo S.R."
                    }
                ],
                "date": "2021-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "trioPhaser: using Mendelian inheritance logic to improve genomic phasing of trios"
            },
            "pmcid": "PMC8607709",
            "pmid": "34809557"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Quantitative genetics",
            "uri": "http://edamontology.org/topic_3055"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ]
}
