{
    "additionDate": "2019-11-14T19:34:35Z",
    "biotoolsCURIE": "biotools:mycelyso",
    "biotoolsID": "mycelyso",
    "confidence_flag": "high",
    "credit": [
        {
            "email": "k.noeh@fz-juelich.de",
            "name": "Katharina Nöh",
            "orcidid": "https://orcid.org/0000-0002-5407-2275",
            "typeEntity": "Person"
        }
    ],
    "description": "high-throughput analysis of Streptomyces mycelium live cell imaging data | To quickly get a grasp what results can be generated with mycelyso, please take a look at the static demo page of mycelyso Inspector generated with the example dataset",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                }
            ]
        }
    ],
    "homepage": "https://github.com/modsim/mycelyso",
    "language": [
        "Python"
    ],
    "lastUpdate": "2019-11-14T19:34:35Z",
    "license": "BSD-2-Clause",
    "name": "mycelyso",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12859-019-3004-1",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Streptomycetes are filamentous microorganisms of high biotechnological relevance, especially for the production of antibiotics. In submerged cultures, the productivity of these microorganisms is closely linked to their growth morphology. Microfluidic lab-on-a-chip cultivation systems, coupled with automated time-lapse imaging, generate spatio-temporal insights into the mycelium development of streptomycetes, therewith extending the biotechnological toolset by spatio-temporal screening under well-controlled and reproducible conditions. However, the analysis of the complex mycelial structure formation is limited by the extent of manual interventions required during processing of the acquired high-volume image data. These interventions typically lead to high evaluation times and, therewith, limit the analytic throughput and exploitation of microfluidic-based screenings. Results: We present the tool mycelyso (MYCElium anaLYsis SOftware), an image analysis system tailored to fully automated hyphae-level processing of image stacks generated by time-lapse microscopy. With mycelyso, the developing hyphal streptomycete network is automatically segmented and tracked over the cultivation period. Versatile key growth parameters such as mycelium network structure, its development over time, and tip growth rates are extracted. Results are presented in the web-based exploration tool mycelyso Inspector, allowing for user friendly quality control and downstream evaluation of the extracted information. In addition, 2D and 3D visualizations show temporal tracking for detailed inspection of morphological growth behaviors. For ease of getting started with mycelyso, bundled Windows packages as well as Docker images along with tutorial videos are available. Conclusion: mycelyso is a well-documented, platform-independent open source toolkit for the automated end-to-end analysis of Streptomyces image stacks. The batch-analysis mode facilitates the rapid and reproducible processing of large microfluidic screenings, and easy extraction of morphological parameters. The objective evaluation of image stacks is possible by reproducible evaluation workflows, useful to unravel correlations between morphological, molecular and process parameters at the hyphae- and mycelium-levels with statistical power.",
                "authors": [
                    {
                        "name": "Sachs C.C."
                    },
                    {
                        "name": "Koepff J."
                    },
                    {
                        "name": "Wiechert W."
                    },
                    {
                        "name": "Grunberger A."
                    },
                    {
                        "name": "Noh K."
                    }
                ],
                "date": "2019-09-04T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Mycelyso - High-throughput analysis of Streptomyces mycelium live cell imaging data"
            },
            "pmcid": "PMC6727546",
            "pmid": "31484491"
        }
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Biotechnology",
            "uri": "http://edamontology.org/topic_3297"
        },
        {
            "term": "Agricultural science",
            "uri": "http://edamontology.org/topic_3810"
        }
    ]
}