{"credit":[{"name":"Emilio Palumbo","typeEntity":"Person","typeRoles":["Developer"]},{"name":"R.Guigo Group: CRG. Barcelona. Spain","typeEntity":"Institute","typeRoles":["Provider"]},{"name":"crg.eu","typeEntity":"Institute","typeRoles":["Provider"]},{"email":"Emilio.Palumbo@crg.eu","name":"Emilio Palumbo","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"http://grape-pipeline.readthedocs.org/en/latest/"}],"download":[{"type":"Source code","url":"https://github.com/grape-pipeline/grape"}],"function":[{"operation":[{"term":"Nucleic acid sequence analysis","uri":"http://edamontology.org/operation_2478"},{"term":"Visualisation","uri":"http://edamontology.org/operation_0337"}]}],"labels":{"cost":"Free of charge","language":["Python"],"license":"GPL-3.0","operatingSystem":["Linux"],"toolType":["Command-line tool"],"topic":[{"term":"Sequence analysis","uri":"http://edamontology.org/topic_0080"}]},"link":[{"type":"REPOSITORY","url":"https://github.com/grape-pipeline/grape"}],"publication":[{"abstract":"Motivation: The avalanche of data arriving since the development of NGS technologies have prompted the need for developing fast, accurate and easily automated bioinformatic tools capable of dealing with massive datasets. Among the most productive applications of NGS technologies is the sequencing of cellular RNA, known as RNA-Seq. Although RNA-Seq provides similar or superior dynamic range than microarrays at similar or lower cost, the lack of standard and user-friendly pipelines is a bottleneck preventing RNA-Seq from becoming the standard for transcriptome analysis.Results: In this work we present a pipeline for processing and analyzing RNA-Seq data, that we have named Grape (Grape RNA-Seq Analysis Pipeline Environment). Grape supports raw sequencing reads produced by a variety of technologies, either in FASTA or FASTQ format, or as prealigned reads in SAM/BAM format. A minimal Grape configuration consists of the file location of the raw sequencing reads, the genome of the species and the corresponding gene and transcript annotation.Grape first runs a set of quality control steps, and then aligns the reads to the genome, a step that is omitted for prealigned read formats. Grape next estimates gene and transcript expression levels, calculates exon inclusion levels and identifies novel transcripts.Grape can be run on a single computer or in parallel on a computer cluster. It is distributed with specific mapping and quantification tools, but given its modular design, any tool supporting popular data interchange formats can be integrated. © 2013 The Author 2013. Published by Oxford University Press.","authors":["Knowles D.G.","Roder M.","Merkel A.","Guigo R."],"cit_count":17,"doi":"10.1093/bioinformatics/btt016","journal":"Bioinformatics","title":"Grape RNA-Seq analysis pipeline environment","type":"Primary","year":"2013-03-01"}],"summary":{"biotoolsCURIE":"biotools:grape_2.0","biotoolsID":"grape_2.0","description":"GRAPE 2.0 provides an extensive pipeline for RNA-Seq analyses. It allows the creation of an automated and integrated workflow to manage, analyse and visualize RNA-Seq data.","homepage":"https://github.com/grape-pipeline/grape","name":"GRAPE 2.0","version":["2.0"]}}