{
    "additionDate": "2021-01-18T12:32:55Z",
    "biotoolsCURIE": "biotools:pvnet",
    "biotoolsID": "pvnet",
    "confidence_flag": "tool",
    "description": "Pixel-wise Voting Network for 6DoF Object Pose Estimation.\n\nWe add a jupyter notebook visualization.ipynb for the keypoint detection pipeline of PVNet, aiming to make it easier for readers to understand our paper.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "https://github.com/zju3dv/pvnet",
    "language": [
        "C++"
    ],
    "lastUpdate": "2021-01-30T14:13:26Z",
    "license": "Apache-2.0",
    "name": "PVNet",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1109/TPAMI.2020.3047388",
            "metadata": {
                "abstract": "IEEEThis paper addresses the problem of instance-level 6DoF object pose estimation} from a single RGB image. Many recent works have shown that a two-stage approach, which first detects keypoints and then solves a Perspective-n-Point (PnP) problem for pose estimation, achieves remarkable performance. However, most of these methods only localize a set of sparse keypoints by regressing their image coordinates or heatmaps, which are sensitive to occlusion and truncation. Instead, we introduce a Pixel-wise Voting Network (PVNet) to regress pixel-wise vectors pointing to the keypoints and use these vectors to vote for keypoint locations. This creates a flexible representation for localizing occluded or truncated keypoints. Another important feature of this representation is that it provides uncertainties of keypoint locations that can be further leveraged by the PnP solver. Experiments show that the proposed approach outperforms the state of the art on the LINEMOD, Occluded LINEMOD, YCB-Video, and Tless datasets, while being efficient for real-time pose estimation. We further create a Truncated LINEMOD dataset to validate the robustness of our approach against truncation. The code is available at https://github.com/zju3dv/pvnet.",
                "authors": [
                    {
                        "name": "Peng S."
                    },
                    {
                        "name": "Zhou X."
                    },
                    {
                        "name": "Liu Y."
                    },
                    {
                        "name": "Lin H."
                    },
                    {
                        "name": "Huang Q."
                    },
                    {
                        "name": "Bao H."
                    }
                ],
                "date": "2020-01-01T00:00:00Z",
                "journal": "IEEE Transactions on Pattern Analysis and Machine Intelligence",
                "title": "PVNet: Pixel-wise Voting Network for 6DoF Object Pose Estimation"
            },
            "pmid": "33360984"
        }
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        }
    ]
}