{
    "additionDate": "2021-01-18T07:28:31Z",
    "biotoolsCURIE": "biotools:rainbowr",
    "biotoolsID": "rainbowr",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "aiwata@mail.ecc.u-tokyo.ac.jp",
            "name": "Hiroyoshi Iwata",
            "orcidid": "https://orcid.org/0000-0002-6747-7036",
            "typeEntity": "Person"
        }
    ],
    "description": "Haplotype-based genome-wide association study using a novel SNP-set method.\n\nGenome-Wide Association Study with SNP-Set Methods.\n\nBy using 'RAINBOWR' (Reliable Association INference By Optimizing Weights with R), users can test multiple SNPs (Single Nucleotide Polymorphisms) simultaneously by kernel-based (SNP-set) methods.\n\nReliable Association INference By Optimizing Weights with R.\n\nSupplementary data and scripts used in the article Kosuke Hamazaki and Hiroyoshi Iwata, “RAINBOW: Haplotype-based genome-wide association study using a novel SNP-set method”, PLOS Computational Biology, 16(2): e1007663, 2020.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Haplotype mapping",
                    "uri": "http://edamontology.org/operation_0487"
                },
                {
                    "term": "Collapsing methods",
                    "uri": "http://edamontology.org/operation_3791"
                }
            ]
        }
    ],
    "homepage": "https://cran.r-project.org/web/packages/RAINBOWR/index.html",
    "language": [
        "R",
        "C++"
    ],
    "lastUpdate": "2021-02-03T13:54:47Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/KosukeHamazaki/RAINBOWR"
        },
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/KosukeHamazaki/HGRAINBOW"
        }
    ],
    "name": "RAINBOWR",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PCBI.1007663",
            "metadata": {
                "abstract": "© 2020 Hamazaki, Iwata. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Difficulty in detecting rare variants is one of the problems in conventional genome-wide association studies (GWAS). The problem is closely related to the complex gene compositions comprising multiple alleles, such as haplotypes. Several single nucleotide polymorphism (SNP) set approaches have been proposed to solve this problem. These methods, however, have been rarely discussed in connection with haplotypes. In this study, we developed a novel SNP-set method named “RAINBOW” and applied the method to haplotype-based GWAS by regarding a haplotype block as a SNP-set. Combining haplotype block estimation and SNP-set GWAS, haplotype-based GWAS can be conducted without prior information of haplotypes. We prepared 100 datasets of simulated phenotypic data and real marker genotype data of Oryza sativa subsp. indica, and performed GWAS of the datasets. We compared the power of our method, the conventional single-SNP GWAS, the conventional haplotype-based GWAS, and the conventional SNP-set GWAS. Our proposed method was shown to be superior to these in three aspects: (1) controlling false positives; (2) in detecting causal variants without relying on the linkage disequilibrium if causal variants were genotyped in the dataset; and (3) it showed greater power than the other methods, i.e., it was able to detect causal variants that were not detected by the others, primarily when the causal variants were located very close to each other, and the directions of their effects were opposite. By using the SNP-set approach as in this study, we expect that detecting not only rare variants but also genes with complex mechanisms, such as genes with multiple causal variants, can be realized. RAINBOW was implemented as an R package named “RAINBOWR” and is available from CRAN (https://cran.r-project.org/web/packages/RAINBOWR/index.html) and GitHub (https://github.com/KosukeHamazaki/RAINBOWR).",
                "authors": [
                    {
                        "name": "Hamazaki K."
                    },
                    {
                        "name": "Iwata H."
                    }
                ],
                "citationCount": 7,
                "date": "2020-01-01T00:00:00Z",
                "journal": "PLoS Computational Biology",
                "title": "Rainbow: Haplotype-based genome-wide association study using a novel SNP-set method"
            },
            "pmcid": "PMC7046296",
            "pmid": "32059004"
        }
    ],
    "topic": [
        {
            "term": "GWAS study",
            "uri": "http://edamontology.org/topic_3517"
        },
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        }
    ]
}