{
    "accessibility": "Open access",
    "additionDate": "2022-02-06T22:28:52.200279Z",
    "biotoolsCURIE": "biotools:pyplutchik",
    "biotoolsID": "pyplutchik",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "alfonso.semeraro@unito.it",
            "name": "Alfonso Semeraro",
            "typeEntity": "Person"
        },
        {
            "name": "Giancarlo Ruffo"
        },
        {
            "name": "Salvatore Vilella",
            "orcidid": "https://orcid.org/0000-0002-7666-0318"
        }
    ],
    "description": "PyPlutchik is a module for visualizing the emotional fingerprint of corpora and text annotated with the Plutchik's model of emotions.",
    "documentation": [
        {
            "type": [
                "General",
                "User manual"
            ],
            "url": "https://github.com/alfonsosemeraro/pyplutchik/blob/master/Documentation.md"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "http://github.com/alfonsosemeraro/pyplutchik",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-02-06T22:28:52.203984Z",
    "license": "Not licensed",
    "name": "PyPlutchik",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PONE.0256503",
            "metadata": {
                "abstract": "© 2021 Semeraro et al.The increasing availability of textual corpora and data fetched from social networks is fuel-ling a huge production of works based on the model proposed by psychologist Robert Plutchik, often referred simply as the “Plutchik Wheel”. Related researches range from annotation tasks description to emotions detection tools. Visualisation of such emotions is traditionally carried out using the most popular layouts, as bar plots or tables, which are however sub-optimal. The classic representation of the Plutchik’s wheel follows the principles of proximity and opposition between pairs of emotions: spatial proximity in this model is also a semantic proximity, as adjacent emotions elicit a complex emotion (a primary dyad) when triggered together; spatial opposition is a semantic opposition as well, as positive emotions are opposite to negative emotions. The most common layouts fail to preserve both features, not to mention the need of visually allowing comparisons between different corpora in a blink of an eye, that is hard with basic design solutions. We introduce PyPlutchik the Pyplutchik package is available as a Github repository (http://github.com/alfonsosemeraro/ pyplutchik) or through the installation commands pip or conda. For any enquiry about usage or installation feel free to contact the corresponding author, a Python module specifically designed for the visualisation of Plutchik’s emotions in texts or in corpora. PyPlutchik draws the Plutchik’s flower with each emotion petal sized after how much that emotion is detected or annotated in the corpus, also representing three degrees of intensity for each of them. Notably, PyPlutchik allows users to display also primary, secondary, tertiary and opposite dyads in a compact, intuitive way. We substantiate our claim that PyPlutchik outperforms other classic visualisations when displaying Plutchik emotions and we showcase a few examples that display our module’s most compelling features.",
                "authors": [
                    {
                        "name": "Ruffo G."
                    },
                    {
                        "name": "Semeraro A."
                    },
                    {
                        "name": "Vilella S."
                    }
                ],
                "citationCount": 1,
                "date": "2021-09-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "PyPlutchik: Visualising and comparing emotion-annotated corpora"
            },
            "pmcid": "PMC8409663",
            "pmid": "34469455"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Data visualisation",
            "uri": "http://edamontology.org/topic_0092"
        },
        {
            "term": "Literature and language",
            "uri": "http://edamontology.org/topic_3068"
        },
        {
            "term": "Psychiatry",
            "uri": "http://edamontology.org/topic_3419"
        }
    ],
    "validated": 1
}
