{
    "additionDate": "2020-01-14T19:38:15Z",
    "biotoolsCURIE": "biotools:KBCommons",
    "biotoolsID": "KBCommons",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "joshitr@health.missouri.edu",
            "name": "Trupti Joshi",
            "typeEntity": "Person"
        }
    ],
    "description": "a universal framework for multi-omics data integration and biological discoveries.\n\nTowards this, we have expanded our in-house developed Soybean Knowledge Base (SoyKB), a comprehensive all-inclusive web resource for soybean to other organisms via Knowledge Base Commons (KBCommons) without the need for reinventing the wheel.\n\nAdvancement of next generation sequencing and high-throughput technologies has resulted in generation of multi-level of 'OMICS' data for many organisms",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Principal component visualisation",
                    "uri": "http://edamontology.org/operation_2939"
                },
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                },
                {
                    "term": "Scatter plot plotting",
                    "uri": "http://edamontology.org/operation_2940"
                }
            ]
        }
    ],
    "homepage": "http://kbcommons.org/",
    "lastUpdate": "2020-12-14T14:14:55Z",
    "name": "KBCommons",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12864-019-6287-8",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Knowledge Base Commons (KBCommons) v1.1 is a universal and all-inclusive web-based framework providing generic functionalities for storing, sharing, analyzing, exploring, integrating and visualizing multiple organisms' genomics and integrative omics data. KBCommons is designed and developed to integrate diverse multi-level omics data and to support biological discoveries for all species via a common platform. Methods: KBCommons has four modules including data storage, data processing, data accessing, and web interface for data management and retrieval. It provides a comprehensive framework for new plant-specific, animal-specific, virus-specific, bacteria-specific or human disease-specific knowledge base (KB) creation, for adding new genome versions and additional multi-omics data to existing KBs, and for exploring existing datasets within current KBs. Results: KBCommons has an array of tools for data visualization and data analytics such as multiple gene/metabolite search, gene family/Pfam/Panther function annotation search, miRNA/metabolite/trait/SNP search, differential gene expression analysis, and bulk data download capacity. It contains a highly reliable data privilege management system to make users' data publicly available easily and to share private or pre-publication data with members in their collaborative groups safely and securely. It allows users to conduct data analysis using our in-house developed workflow functionalities that are linked to XSEDE high performance computing resources. Using KBCommons' intuitive web interface, users can easily retrieve genomic data, multi-omics data and analysis results from workflow according to their requirements and interests. Conclusions: KBCommons addresses the needs of many diverse research communities to have a comprehensive multi-level OMICS web resource for data retrieval, sharing, analysis and visualization. KBCommons can be publicly accessed through a dedicated link for all organisms at http://kbcommons.org/.",
                "authors": [
                    {
                        "name": "Zeng S."
                    },
                    {
                        "name": "Lyu Z."
                    },
                    {
                        "name": "Narisetti S.R.K."
                    },
                    {
                        "name": "Xu D."
                    },
                    {
                        "name": "Joshi T."
                    }
                ],
                "citationCount": 4,
                "date": "2019-12-20T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "Knowledge Base Commons (KBCommons) v1.1: A universal framework for multi-omics data integration and biological discoveries"
            },
            "pmcid": "PMC6923931",
            "pmid": "31856718"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Epigenomics",
            "uri": "http://edamontology.org/topic_3173"
        },
        {
            "term": "Phenomics",
            "uri": "http://edamontology.org/topic_3298"
        },
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        }
    ],
    "validated": 1
}