
{
    "credit": [
        {
            "email": "gjpattij@wustl.edu",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://pattilab.wustl.edu/"
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "https://github.com/nathaniel-mahieu/warpgroup"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Spectral analysis",
                    "uri": "http://edamontology.org/operation_3214"
                }
            ]
        }
    ],
    "labels": {
        "collectionID": [
            "Proteomics"
        ],
        "language": [
            "R"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Library"
        ],
        "topic": [
            {
                "term": "Analytical chemistry",
                "uri": "http://edamontology.org/topic_3370"
            },
            {
                "term": "Protein structure analysis",
                "uri": "http://edamontology.org/topic_2814"
            },
            {
                "term": "Metabolomics",
                "uri": "http://edamontology.org/topic_3172"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://www.mybiosoftware.com/warpgroup-increased-precision-of-metabolomic-data-processing-by-consensus-integration-bound-analysis.html"
        }
    ],
    "publication": [
        {
            "abstract": "© 2015 The Author 2015. Published by Oxford University Press. All rights reserved. Motivation: Current informatic techniques for processing raw chromatography/mass spectrometry data break down under several common, non-ideal conditions. Importantly, hydrophilic liquid interaction chromatography (a key separation technology for metabolomics) produces data which are especially challenging to process. We identify three critical points of failure in current informatic workflows: compound specific drift, integration region variance, and naive missing value imputation. We implement the Warpgroup algorithm to address these challenges. Results: Warpgroup adds peak subregion detection, consensus integration bound detection, and intelligent missing value imputation steps to the conventional informatic workflow. When compared with the conventional workflow, Warpgroup made major improvements to the processed data. The coefficient of variation for peaks detected in replicate injections of a complex Escherichia Coli extract were halved (a reduction of 19%). Integration regions across samples were much more robust. Additionally, many signals lost by the conventional workflow were 'rescued' by the Warpgroup refinement, thereby resulting in greater analyte coverage in the processed data. Availability and implementation: Warpgroup is an open source R package available on GitHub at github.com/nathaniel-mahieu/warpgroup. The package includes example data and XCMS compatibility wrappers for ease of use. Supplementary information: Supplementary data are available at Bioinformatics online. Contact: or gjpattij@wustl.edu.",
            "authors": [
                "Mahieu N.G.",
                "Spalding J.L.",
                "Patti G.J."
            ],
            "cit_count": 15,
            "journal": "Bioinformatics",
            "pmid": "26424859",
            "title": "Warpgroup: Increased precision of metabolomic data processing by consensus integration bound analysis",
            "year": "2016-01-15"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:warpgroup",
        "biotoolsID": "warpgroup",
        "description": "R package for processing chromatography-mass spectrometry data. It implements: Chromatogram subregion detection, Consensus integration bound determination, Accurate missing value integration.",
        "homepage": "https://github.com/nathaniel-mahieu/warpgroup",
        "name": "Warpgroup"
    }
}