{
    "additionDate": "2018-05-04T17:19:47Z",
    "biotoolsCURIE": "biotools:gapp",
    "biotoolsID": "gapp",
    "collectionID": [
        "Proteomics"
    ],
    "credit": [
        {
            "email": "gefeng@ihb.ac.cn",
            "name": "Feng Ge",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "A Proteogenomic tool for Genome Annotation and Global Profiling of Post-translational Modifications in Prokaryotes.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://sourceforge.net/projects/gappproteogenomic/files/GAPP_readme.pdf/download"
        }
    ],
    "editPermission": {
        "authors": [
            "proteomics.bio.tools"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene expression profiling",
                    "uri": "http://edamontology.org/operation_0314"
                },
                {
                    "term": "Genome annotation",
                    "uri": "http://edamontology.org/operation_0362"
                }
            ]
        }
    ],
    "homepage": "https://sourceforge.net/projects/gappproteogenomic/",
    "language": [
        "Java",
        "Perl"
    ],
    "lastUpdate": "2019-03-26T08:16:54Z",
    "name": "GAPP",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1074/MCP.M116.060046",
            "metadata": {
                "abstract": "© 2016 by The American Society for Biochemistry and Molecular Biology, Inc.Although the number of sequenced prokaryotic genomes is growing rapidly, experimentally verified annotation of prokaryotic genome remains patchy and challenging. To facilitate genome annotation efforts for prokaryotes, we developed an open source software called GAPP for genome annotation and global profiling of post-translational modifications (PTMs) in prokaryotes. With a single command, it provides a standard workflow to validate and refine predicted genetic models and discover diverse PTM events. We demonstrated the utility of GAPP using proteomic data from Helicobacter pylori, one of the major human pathogens that is responsible for many gastric diseases. Our results confirmed 84.9% of the existing predicted H. pylori proteins, identified 20 novel protein coding genes, and corrected four existing gene models with regard to translation initiation sites. In particular, GAPP revealed a large repertoire of PTMs using the same proteomic data and provided a rich resource that can be used to examine the functions of reversible modifications in this human pathogen. This software is a powerful tool for genome annotation and global discovery of PTMs and is applicable to any sequenced prokaryotic organism; we expect that it will become an integral part of ongoing genome annotation efforts for prokaryotes. GAPP is freely available at https://sourceforge.net/projects/gappproteogenomic/.",
                "authors": [
                    {
                        "name": "Zhang J."
                    },
                    {
                        "name": "Yang M.-K."
                    },
                    {
                        "name": "Zeng H."
                    },
                    {
                        "name": "Ge F."
                    }
                ],
                "citationCount": 3,
                "date": "2016-11-01T00:00:00Z",
                "journal": "Molecular and Cellular Proteomics",
                "title": "GAPP: A proteogenomic software for genome annotation and global profiling of posttranslational modifications in prokaryotes"
            },
            "pmcid": "PMC5098048",
            "pmid": "27630248"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        }
    ],
    "validated": 1
}