{
    "additionDate": "2017-08-03T18:43:03Z",
    "biotoolsCURIE": "biotools:fold-em",
    "biotoolsID": "fold-em",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://ai.stanford.edu/~mitul/contact.html"
        }
    ],
    "description": "Computational tool that can identify folded macromolecular domains in medium to low resolution (4-15 Å) electron density maps and return a model of the constituent polypeptides in a fully automated fashion.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://ai.stanford.edu/~mitul/foldEM/Testcase.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein modelling (backbone)",
                    "uri": "http://edamontology.org/operation_0479"
                },
                {
                    "term": "Surface rendering",
                    "uri": "http://edamontology.org/operation_1816"
                }
            ]
        }
    ],
    "homepage": "http://ai.stanford.edu/~mitul/foldEM/",
    "lastUpdate": "2018-12-10T12:58:44Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/fold-em-fully-automated-fold-recognition-electron-density-maps.html"
        }
    ],
    "name": "FOLD-EM",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Motivation: Owing to the size and complexity of large multi-component biological assemblies, the most tractable approach to determining their atomic structure is often to fit high-resolution radiographic or nuclear magnetic resonance structures of isolated components into lower resolution electron density maps of the larger assembly obtained using cryo-electron microscopy (cryo-EM). This hybrid approach to structure determination requires that an atomic resolution structure of each component, or a suitable homolog, is available. If neither is available, then the amount of structural information regarding that component is limited by the resolution of the cryo-EM map. However, even if a suitable homolog cannot be identified using sequence analysis, a search for structural homologs should still be performed because structural homology often persists throughout evolution even when sequence homology is undetectable, As macromolecules can often be described as a collection of independently folded domains, one way of searching for structural homologs would be to systematically fit representative domain structures from a protein domain database into the medium/low resolution cryo-EM map and return the best fits. Taken together, the best fitting non-overlapping structures would constitute a 'mosaic' backbone model of the assembly that could aid map interpretation and illuminate biological function.Result: Using the computational principles of the Scale-Invariant Feature Transform (SIFT), we have developed FOLD-EM-a computational tool that can identify folded macromolecular domains in medium to low resolution (4-15 Å) electron density maps and return a model of the constituent polypeptides in a fully automated fashion. As a by-product, FOLD-EM can also do flexible multi-domain fitting that may provide insight into conformational changes that occur in macromolecular assemblies.Availability and implementation: FOLD-EM is available at: http://cs.stanford.edu/∼mitul/foldEM/, as a free open source software to the structural biology scientific community. © 2012 The Author.",
                "authors": [
                    {
                        "name": "Saha M."
                    },
                    {
                        "name": "Morais M.C."
                    }
                ],
                "citationCount": 9,
                "date": "2012-12-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "FOLD-EM: Automated fold recognition in medium-and low-resolution (4-15 Å) electron density maps"
            },
            "pmid": "23131460"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Molecular modelling",
            "uri": "http://edamontology.org/topic_2275"
        },
        {
            "term": "Electron microscopy",
            "uri": "http://edamontology.org/topic_0611"
        },
        {
            "term": "Protein structural motifs and surfaces",
            "uri": "http://edamontology.org/topic_0166"
        },
        {
            "term": "Protein structure analysis",
            "uri": "http://edamontology.org/topic_2814"
        }
    ],
    "validated": 1
}