{
    "additionDate": "2018-05-06T10:26:43Z",
    "biotoolsCURIE": "biotools:kiwi",
    "biotoolsID": "kiwi",
    "credit": [
        {
            "email": "kiwi@sysbio.se",
            "name": "Support",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Integration and visualization of network topology and gene-set analysis.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://pythonhosted.org/KiwiDist/index.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Expression data visualisation",
                    "uri": "http://edamontology.org/operation_0571"
                },
                {
                    "term": "Pathway or network visualisation",
                    "uri": "http://edamontology.org/operation_3083"
                }
            ]
        }
    ],
    "homepage": "https://pythonhosted.org/KiwiDist/index.html",
    "language": [
        "Python"
    ],
    "lastUpdate": "2018-12-10T12:58:57Z",
    "name": "Kiwi",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1186/S12859-014-0408-9",
            "metadata": {
                "abstract": "© Väremo et al.; licensee BioMed Central.Background: The analysis of high-throughput data in biology is aided by integrative approaches such as gene-set analysis. Gene-sets can represent well-defined biological entities (e.g. metabolites) that interact in networks (e.g. metabolic networks), to exert their function within the cell. Data interpretation can benefit from incorporating the underlying network, but there are currently no optimal methods that link gene-set analysis and network structures. Results: Here we present Kiwi, a new tool that processes output data from gene-set analysis and integrates them with a network structure such that the inherent connectivity between gene-sets, i.e. not simply the gene overlap, becomes apparent. In two case studies, we demonstrate that standard gene-set analysis points at metabolites regulated in the interrogated condition. Nevertheless, only the integration of the interactions between these metabolites provides an extra layer of information that highlights how they are tightly connected in the metabolic network. Conclusions: Kiwi is a tool that enhances interpretability of high-throughput data. It allows the users not only to discover a list of significant entities or processes as in gene-set analysis, but also to visualize whether these entities or processes are isolated or connected by means of their biological interaction. Kiwi is available as a Python package at and an online tool in the BioMet Toolbox at.",
                "authors": [
                    {
                        "name": "Gatto F."
                    },
                    {
                        "name": "Nielsen J."
                    },
                    {
                        "name": "Varemo L."
                    }
                ],
                "citationCount": 9,
                "date": "2014-12-11T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Kiwi: A tool for integration and visualization of network topology and gene-set analysis"
            },
            "pmcid": "PMC4269931",
            "pmid": "25496126"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Data visualisation",
            "uri": "http://edamontology.org/topic_0092"
        },
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ],
    "validated": 1
}
