{
    "additionDate": "2017-12-18T00:05:01Z",
    "biotoolsCURIE": "biotools:cudasw",
    "biotoolsID": "cudasw",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://sites.google.com/site/yongchaosoftware/"
        }
    ],
    "description": "CUDASW++ (compute unified device architecture) is a bioinformatics software for Smith-Waterman protein database searches that takes advantage of the massively parallel CUDA architecture of NVIDIA Tesla GPUs to perform fast sequence searches.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://cudasw.sourceforge.net/homepage.htm#latest"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Alignment",
                    "uri": "http://edamontology.org/operation_2928"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Smith-Waterman",
                    "uri": "http://edamontology.org/operation_0495"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Search",
                    "uri": "http://edamontology.org/operation_2421"
                }
            ]
        }
    ],
    "homepage": "http://cudasw.sourceforge.net/",
    "language": [
        "C++"
    ],
    "lastUpdate": "2019-03-12T13:25:17Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/cudasw-2-0-8-parallel-smith-waterman-protein-database-search-algorithm.html"
        }
    ],
    "name": "CUDASW++",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1186/1471-2105-14-117",
            "metadata": {
                "abstract": "The maximal sensitivity for local alignments makes the Smith-Waterman algorithm a popular choice for protein sequence database search based on pairwise alignment. However, the algorithm is compute-intensive due to a quadratic time complexity. Corresponding runtimes are further compounded by the rapid growth of sequence databases. We present CUDASW++ 3.0, a fast Smith-Waterman protein database search algorithm, which couples CPU and GPU SIMD instructions and carries out concurrent CPU and GPU computations. For the CPU computation, this algorithm employs SSE-based vector execution units as accelerators. For the GPU computation, we have investigated for the first time a GPU SIMD parallelization, which employs CUDA PTX SIMD video instructions to gain more data parallelism beyond the SIMT execution model. Moreover, sequence alignment workloads are automatically distributed over CPUs and GPUs based on their respective compute capabilities. Evaluation on the Swiss-Prot database shows that CUDASW++ 3.0 gains a performance improvement over CUDASW++ 2.0 up to 2.9 and 3.2, with a maximum performance of 119.0 and 185.6 GCUPS, on a single-GPU GeForce GTX 680 and a dual-GPU GeForce GTX 690 graphics card, respectively. In addition, our algorithm has demonstrated significant speedups over other top-performing tools: SWIPE and BLAST+. CUDASW++ 3.0 is written in CUDA C++ and PTX assembly languages, targeting GPUs based on the Kepler architecture. This algorithm obtains significant speedups over its predecessor: CUDASW++ 2.0, by benefiting from the use of CPU and GPU SIMD instructions as well as the concurrent execution on CPUs and GPUs. The source code and the simulated data are available at http://cudasw.sourceforge.net.",
                "authors": [
                    {
                        "name": "Liu Y."
                    },
                    {
                        "name": "Wirawan A."
                    },
                    {
                        "name": "Schmidt B."
                    }
                ],
                "citationCount": 128,
                "date": "2013-01-01T00:00:00Z",
                "journal": "BMC bioinformatics",
                "title": "CUDASW++ 3.0: accelerating Smith-Waterman protein database search by coupling CPU and GPU SIMD instructions."
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        }
    ],
    "validated": 1,
    "version": [
        "3.1.1"
    ]
}