{
    "additionDate": "2024-01-12T08:53:20.553161Z",
    "biotoolsCURIE": "biotools:rbplight",
    "biotoolsID": "rbplight",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "prabina.meher@icar.gov.in",
            "name": "Prabina K Meher",
            "typeEntity": "Person"
        }
    ],
    "description": "Computational tool for discovery of plant-specific RNA-binding proteins using light gradient boosting machine and ensemble of evolutionary features.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "RNA-binding protein prediction",
                    "uri": "http://edamontology.org/operation_3901"
                }
            ]
        }
    ],
    "homepage": "https://iasri-sg.icar.gov.in/rbplight/",
    "lastUpdate": "2024-11-24T14:21:53.101064Z",
    "name": "RBPLight",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/bfgp/elad016",
            "metadata": {
                "abstract": "RNA-binding proteins (RBPs) are essential for post-transcriptional gene regulation in eukaryotes, including splicing control, mRNA transport and decay. Thus, accurate identification of RBPs is important to understand gene expression and regulation of cell state. In order to detect RBPs, a number of computational models have been developed. These methods made use of datasets from several eukaryotic species, specifically from mice and humans. Although some models have been tested on Arabidopsis, these techniques fall short of correctly identifying RBPs for other plant species. Therefore, the development of a powerful computational model for identifying plant-specific RBPs is needed. In this study, we presented a novel computational model for locating RBPs in plants. Five deep learning models and ten shallow learning algorithms were utilized for prediction with 20 sequence-derived and 20 evolutionary feature sets. The highest repeated five-fold cross-validation accuracy, 91.24% AU-ROC and 91.91% AU-PRC, was achieved by light gradient boosting machine. While evaluated using an independent dataset, the developed approach achieved 94.00% AU-ROC and 94.50% AU-PRC. The proposed model achieved significantly higher accuracy for predicting plant-specific RBPs as compared to the currently available state-of-art RBP prediction models. Despite the fact that certain models have already been trained and assessed on the model organism Arabidopsis, this is the first comprehensive computer model for the discovery of plant-specific RBPs. The web server RBPLight was also developed, which is publicly accessible at https://iasri-sg.icar.gov.in/rbplight/, for the convenience of researchers to identify RBPs in plants.",
                "authors": [
                    {
                        "name": "Gupta A."
                    },
                    {
                        "name": "Gupta S."
                    },
                    {
                        "name": "Meher P.K."
                    },
                    {
                        "name": "Naha S."
                    },
                    {
                        "name": "Pal S."
                    },
                    {
                        "name": "Parsad R."
                    },
                    {
                        "name": "Pradhan U.K."
                    }
                ],
                "citationCount": 5,
                "date": "2023-09-01T00:00:00Z",
                "journal": "Briefings in Functional Genomics",
                "title": "RBPLight: a computational tool for discovery of plant-specific RNA-binding proteins using light gradient boosting machine and ensemble of evolutionary features"
            },
            "pmid": "37158175",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Gene and protein families",
            "uri": "http://edamontology.org/topic_0623"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        }
    ]
}
