{
    "additionDate": "2019-11-14T18:29:56Z",
    "biotoolsCURIE": "biotools:FORTA",
    "biotoolsID": "FORTA",
    "confidence_flag": "medium",
    "description": "> MEDIUM CONFIDENCE! | > HOMEPAGE MISSING! | Application of an Information Technology Tool for the Epidemiological Assessment of Drug Treatment in Older People | BACKGROUND:To improve drug treatment in older people, who often present with multimorbidity and related polypharmacy, the FORTA (Fit fOR The Aged) List was developed via a Delphi consensus procedure. As a patient-in-focus listing approach (PILA), it has been clinically validated (VALFORTA trial). Unlike drug-oriented listing approaches (DOLAs), its application requires knowledge of patients' characteristics, including diagnoses and other details. As a drug list with discrete labels, application of FORTA seems particularly amenable to electronic support. METHODS:An information technology (IT) algorithm was developed to analyze bulk data on International Classification of Diseases (ICD)-coded diseases and Anatomical Therapeutic Chemical (ATC)-coded drugs",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://www.ncbi.nlm.nih.gov/pubmed/?term=31435913",
    "language": [
        "Delphi"
    ],
    "lastUpdate": "2019-11-14T18:29:56Z",
    "name": "FORTA",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1007/S40266-019-00703-7",
            "metadata": {
                "abstract": "© 2019, Springer Nature Switzerland AG.Background: To improve drug treatment in older people, who often present with multimorbidity and related polypharmacy, the FORTA (Fit fOR The Aged) List was developed via a Delphi consensus procedure. As a patient-in-focus listing approach (PILA), it has been clinically validated (VALFORTA trial). Unlike drug-oriented listing approaches (DOLAs), its application requires knowledge of patients’ characteristics, including diagnoses and other details. As a drug list with discrete labels, application of FORTA seems particularly amenable to electronic support. Methods: An information technology (IT) algorithm was developed to analyze bulk data on International Classification of Diseases (ICD)-coded diseases and Anatomical Therapeutic Chemical (ATC)-coded drugs. FORTA-labeled diagnoses and drugs were used to compute the FORTA score, an automatically generated score that describes medication quality by adding up points assigned for errors related to over- and under-treatment. The algorithm detects mismatches between diagnoses and drugs, suboptimal drugs, omitted drugs, and deficient medication escalation schemes. The read-out produces explanations for each error point. Results: A total of 5603 and 7954 patients ≥ 65 years were included from two claims datasets (> 30,000 patients each, public health insurance). The FORTA scores were comparable (mean ± standard deviation 4.29 ± 3.37 vs. 4.17 ± 3.16), and similar to that determined in VALFORTA (pre-intervention 3.5 ± 2.7). Under-treatment was two times more prevalent than over-treatment. The main areas of under-treatment were pain, type 2 diabetes mellitus, and depression, and the main areas of over-treatment were gastrointestinal (proton pump inhibitors), pain (non-steroidal anti-inflammatory drugs), and arterial hypertension (β-blockers). The FORTA score is positively correlated with higher age, a higher Charlson Comorbidity Index, and more frequent hospitalizations. Patients in disease management programs run by public health insurers had higher scores than comparators. Conclusions: The algorithm produces plausible analyses of medication errors in older people, pointing to established areas of therapeutic deficiencies. Though individual recommendations exist, the algorithm cannot employ the full potential of FORTA as important details (e.g., blood pressure values, pain intensity) are not (yet) included. However, it seems capable of detecting medication problems in large cohorts—FORTA-EPI (Epidemiological) is designed to support epidemiological analyses, e.g., on comparisons of large cohorts, interventional impact, or longitudinal trends.",
                "authors": [
                    {
                        "name": "Rabenberg A."
                    },
                    {
                        "name": "Schulte T."
                    },
                    {
                        "name": "Hildebrandt H."
                    },
                    {
                        "name": "Wehling M."
                    }
                ],
                "date": "2019-10-01T00:00:00Z",
                "journal": "Drugs and Aging",
                "title": "The FORTA (Fit fOR The Aged)-EPI (Epidemiological) Algorithm: Application of an Information Technology Tool for the Epidemiological Assessment of Drug Treatment in Older People"
            },
            "pmid": "31435913"
        }
    ],
    "topic": [
        {
            "term": "Public health and epidemiology",
            "uri": "http://edamontology.org/topic_3305"
        },
        {
            "term": "Geriatric medicine",
            "uri": "http://edamontology.org/topic_3399"
        },
        {
            "term": "Preclinical and clinical studies",
            "uri": "http://edamontology.org/topic_3379"
        }
    ]
}