{
    "additionDate": "2017-02-14T09:36:33Z",
    "biotoolsCURIE": "biotools:clantox",
    "biotoolsID": "clantox",
    "collectionID": [
        "Proteomics"
    ],
    "credit": [
        {
            "email": "michall@cc.huji.ac.il",
            "name": "Michal Linial",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Classifier of short animal toxins, predicts whether input sequences are toxin-like based on classification system training to known animal toxins. This dscovery prediction tool also outputs presence of signal peptide, the number of cysteine residues and the associated functional annotations.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://www.clantox.cs.huji.ac.il/about.php"
        }
    ],
    "editPermission": {
        "authors": [
            "proteomics.bio.tools"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein signal peptide detection",
                    "uri": "http://edamontology.org/operation_0418"
                }
            ]
        }
    ],
    "homepage": "http://www.clantox.cs.huji.ac.il",
    "lastUpdate": "2019-03-26T08:13:19Z",
    "name": "ClanTox",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "Toxins are detected in sporadic species along the evolutionary tree of the animal kingdom. Venomous animals include scorpions, snakes, bees, wasps, frogs and numerous animals living in the sea such as the stonefish, snail, jellyfish, hydra and more. Interestingly, proteins that share a common scaffold with animal toxins also exist in non-venomous species. However, due to their short length and primary sequence diversity, these, toxin-like proteins remain undetected by classical search engines and genome annotation tools. We construct a toxin classification machine and web server called ClanTox (Classifier of Animal Toxins) that is based on the extraction of sequence-driven features from the primary protein sequence followed by the application of a classification system trained on known animal toxins. For a given input list of sequences, from venomous or non-venomous settings, the ClanTox system predicts whether each sequence is toxin-like. ClanTox provides a ranked list of positively predicted candidates according to statistical confidence. For each protein, additional information is presented including the presence of a signal peptide, the number of cysteine residues and the associated functional annotations. ClanTox is a discovery-prediction tool for a relatively overlooked niche of toxin-like cell modulators, many of which are therapeutic agent candidates. The ClanTox web server is freely accessible at http://www.clantox.cs.huji.ac.il.",
                "authors": [
                    {
                        "name": "Naamati G."
                    },
                    {
                        "name": "Askenazi M."
                    },
                    {
                        "name": "Linial M."
                    }
                ],
                "citationCount": 38,
                "date": "2009-08-04T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "ClanTox: A classifier of short animal toxins"
            },
            "pmid": "19429697"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Zoology",
            "uri": "http://edamontology.org/topic_3500"
        },
        {
            "term": "Protein sites, features and motifs",
            "uri": "http://edamontology.org/topic_3510"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        }
    ],
    "validated": 1
}