{
    "additionDate": "2021-01-18T08:28:48Z",
    "biotoolsCURIE": "biotools:drivergroup",
    "biotoolsID": "drivergroup",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "thuc.le@unisa.edu.au",
            "name": "Thuc D Le",
            "typeEntity": "Person"
        }
    ],
    "description": "DriverGroup is a tool to detect driver gene groups by using gene expression and gene interaction data.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene prediction",
                    "uri": "http://edamontology.org/operation_2454"
                },
                {
                    "term": "Gene regulatory network analysis",
                    "uri": "http://edamontology.org/operation_1781"
                },
                {
                    "term": "Gene regulatory network prediction",
                    "uri": "http://edamontology.org/operation_2437"
                }
            ]
        }
    ],
    "homepage": "https://github.com/pvvhoang/DriverGroup",
    "language": [
        "Perl",
        "R"
    ],
    "lastUpdate": "2021-03-03T19:14:23Z",
    "name": "DriverGroup",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1101/2020.04.23.058719"
        },
        {
            "doi": "10.1093/bioinformatics/btaa797",
            "metadata": {
                "abstract": "© The Author(s) 2020. Published by Oxford University Press. All rights reserved. For permissions, please e-mail: journals.permissions@oup.comMotivation: Identifying cancer driver genes is a key task in cancer informatics. Most existing methods are focused on individual cancer drivers which regulate biological processes leading to cancer. However, the effect of a single gene may not be sufficient to drive cancer progression. Here, we hypothesize that there are driver gene groups that work in concert to regulate cancer, and we develop a novel computational method to detect those driver gene groups. Results: We develop a novel method named DriverGroup to detect driver gene groups by using gene expression and gene interaction data. The proposed method has three stages: (i) constructing the gene network, (ii) discovering critical nodes of the constructed network and (iii) identifying driver gene groups based on the discovered critical nodes. Before evaluating the performance of DriverGroup in detecting cancer driver groups, we firstly assess its performance in detecting the influence of gene groups, a key step of DriverGroup. The application of DriverGroup to DREAM4 data demonstrates that it is more effective than other methods in detecting the regulation of gene groups. We then apply DriverGroup to the BRCA dataset to identify driver groups for breast cancer. The identified driver groups are promising as several group members are confirmed to be related to cancer in literature. We further use the predicted driver groups in survival analysis and the results show that the survival curves of patient subpopulations classified using the predicted driver groups are significantly differentiated, indicating the usefulness of DriverGroup.",
                "authors": [
                    {
                        "name": "Bracken C.P."
                    },
                    {
                        "name": "Goodall G.J."
                    },
                    {
                        "name": "Le T.D."
                    },
                    {
                        "name": "Li J."
                    },
                    {
                        "name": "Liu L."
                    },
                    {
                        "name": "Pham V.V.H."
                    }
                ],
                "date": "2020-12-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "DriverGroup: A novel method for identifying driver gene groups"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Informatics",
            "uri": "http://edamontology.org/topic_0605"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        }
    ]
}
