{
    "additionDate": "2021-06-14T12:49:21Z",
    "biotoolsCURIE": "biotools:afexnet",
    "biotoolsID": "afexnet",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "omid.kavehei@sydney.edu.au",
            "name": "NeuroSyd",
            "typeEntity": "Division",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://sites.google.com/view/neurosyd/home"
        }
    ],
    "description": "AFExNet is an adversarial autoencoder for differentiating breast cancer sub-types and extracting biologically relevant genes.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Feature extraction",
                    "uri": "http://edamontology.org/operation_3937"
                },
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                }
            ]
        }
    ],
    "homepage": "https://github.com/NeuroSyd/breast-cancer-sub-types",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-08-09T11:35:42.752002Z",
    "license": "CC-BY-4.0",
    "name": "AFExNet",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1109/TCBB.2021.3066086",
            "metadata": {
                "abstract": "IEEETechnological advancements in high-throughput genomics enable the generation of complex and large data sets that can be used for classification, clustering, and bio-marker identification. Modern deep learning algorithms provide us with the opportunity of finding most significant features in such huge dataset to characterize diseases (e.g., cancer) and their sub-types. Thus, developing such deep learning method, which can successfully extract meaningful features from various breast cancer sub-types, is of current research interest. In this paper, we develop dual stage (unsupervised pre-training and supervised fine-tuning) neural network architecture termed AFExNet based on adversarial auto-encoder (AAE) to extract features from high dimensional genetic data. We evaluated the performance of our model through twelve different supervised classifiers to verify the usefulness of the new features using public RNA-Seq dataset of breast cancer. AFExNet provides consistent results in all performance metrics across twelve different classifiers which makes our model classifier independent. We also develop a method named &#x201C;TopGene&#x201D; to find highly weighted genes from the latent space which could be useful for finding cancer bio-markers. Put together, AFExNet has great potential for biological data to accurately and effectively extract features. Our work is fully reproducible and source code can be downloaded from Github: https://github.com/NeuroSyd/breast-cancer-sub-types",
                "authors": [
                    {
                        "name": "Mondol R.K."
                    },
                    {
                        "name": "Truong N.D."
                    },
                    {
                        "name": "Reza M."
                    },
                    {
                        "name": "Ippolito S."
                    },
                    {
                        "name": "Ebrahimie E."
                    },
                    {
                        "name": "Kavehei O."
                    }
                ],
                "date": "2021-01-01T00:00:00Z",
                "journal": "IEEE/ACM Transactions on Computational Biology and Bioinformatics",
                "title": "AFExNet: An Adversarial Autoencoder for Differentiating Breast Cancer Sub-types and Extracting Biologically Relevant Genes"
            },
            "pmid": "33720833"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ]
}