{
    "additionDate": "2020-01-14T09:48:09Z",
    "biotoolsCURIE": "biotools:eQTL",
    "biotoolsID": "eQTL",
    "confidence_flag": "very low",
    "credit": [
        {
            "email": "gordon.kordas@cuanschutz.edu",
            "name": "Gordon Kordas",
            "orcidid": "https://orcid.org/0000-0003-1925-5225",
            "typeEntity": "Person"
        }
    ],
    "description": "Insight into genetic regulation of miRNA in mouse brain.\n\nThis repository contains the code necessary to run the analyses in Insight Into Genetic Regulation of miRNA in Mouse Brain. The RMD files should be ran in the following order:.\n\nThe order of eQTL_target_genes,hotspot_analysis, phenotype_analysis, and bayesian_network_analysis does not matter. Due to the file size, the mRNA expression data resides at PhenoGen.org. The data can be found on the \"Available Data Downloads\" page under the Publications tab and going to the Processed Data section designated for, \"Predictive Modeling of miRNA-mediated Predisposition to Alcohol-related Phenotypes in Mouse.\" The file is titled, \"mRNA_expression_data_full.csv.zip.\" Please use this data in place of the data titled, \"Adjusted_rma.summary.txt.\".\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'miRNA', 'miRNA eQTL'",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "miRNA target prediction",
                    "uri": "http://edamontology.org/operation_0463"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "miRNA expression analysis",
                    "uri": "http://edamontology.org/operation_3792"
                },
                {
                    "term": "Expression profile pathway mapping",
                    "uri": "http://edamontology.org/operation_0533"
                }
            ]
        }
    ],
    "homepage": "https://github.com/gordonkordas/mirnabraineqtl",
    "language": [
        "R"
    ],
    "lastUpdate": "2020-01-14T09:48:09Z",
    "name": "eQTL",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12864-019-6110-6",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: micro RNA (miRNA) are important regulators of gene expression and may influence phenotypes and disease traits. The connection between genetics and miRNA expression can be determined through expression quantitative loci (eQTL) analysis, which has been extensively used in a variety of tissues, and in both human and model organisms. miRNA play an important role in brain-related diseases, but eQTL studies of miRNA in brain tissue are limited. We aim to catalog miRNA eQTL in brain tissue using miRNA expression measured on a recombinant inbred mouse panel. Because samples were collected without any intervention or treatment (naïve), the panel allows characterization of genetic influences on miRNAs' expression levels. We used brain RNA expression levels of 881 miRNA and 1416 genomic locations to identify miRNA eQTL. To address multiple testing, we employed permutation p-values and subsequent zero permutation p-value correction. We also investigated the underlying biology of miRNA regulation using additional analyses, including hotspot analysis to search for regions controlling multiple miRNAs, and Bayesian network analysis to identify scenarios where a miRNA mediates the association between genotype and mRNA expression. We used addiction related phenotypes to illustrate the utility of our results. Results: Thirty-eight miRNA eQTL were identified after appropriate multiple testing corrections. Ten of these miRNAs had target genes enriched for brain-related pathways and mapped to four miRNA eQTL hotspots. Bayesian network analysis revealed four biological networks relating genetic variation, miRNA expression and gene expression. Conclusions: Our extensive evaluation of miRNA eQTL provides valuable insight into the role of miRNA regulation in brain tissue. Our miRNA eQTL analysis and extended statistical exploration identifies miRNA candidates in brain for future study.",
                "authors": [
                    {
                        "name": "Kordas G."
                    },
                    {
                        "name": "Rudra P."
                    },
                    {
                        "name": "Hendricks A."
                    },
                    {
                        "name": "Saba L."
                    },
                    {
                        "name": "Kechris K."
                    }
                ],
                "date": "2019-11-13T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "Insight into genetic regulation of miRNA in mouse brain"
            },
            "pmcid": "PMC6854704",
            "pmid": "31722663"
        }
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        }
    ]
}