{
    "additionDate": "2017-12-18T00:04:09Z",
    "biotoolsCURIE": "biotools:bayesmix",
    "biotoolsID": "bayesmix",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://bioinformatics.mdanderson.org/main/BayesMix:Overview#Credits"
        }
    ],
    "description": "BayesMix is a piece of computer software, a suite of R functions and C routines with a graphical user interface, which can be used as a tool for performing model-based inference for differential gene expression, using a non-parametric Bayesian mixture probability model for the distribution of gene intensities under different conditions.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://bioinformatics.mdanderson.org/main/BayesMix:UsersGuide"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Microarray data analysis",
                    "uri": "http://edamontology.org/operation_2495"
                }
            ]
        }
    ],
    "homepage": "http://bioinformatics.mdanderson.org/main/BayesMix:Overview",
    "language": [
        "Java",
        "R"
    ],
    "lastUpdate": "2018-12-10T12:58:57Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/bayesmix-0-8-8-perform-model-based-inference-differential-gene-expression.html"
        }
    ],
    "name": "BayesMix",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1111/j.1467-9876.2005.05593.x",
            "metadata": {
                "abstract": "We propose model-based inference for differential gene expression, using a non-parametric Bayesian probability model for the distribution of gene intensities under various conditions. The probability model is a mixture of normal distributions. The resulting inference is similar to a popular empirical Bayes approach that is used for the same inference problem. The use of fully model-based inference mitigates some of the necessary limitations of the empirical Bayes method. We argue that inference is no more difficult than posterior simulation in traditional nonparametric mixture-of-normal models. The approach proposed is motivated by a microarray experiment that was carried out to identify genes that are differentially expressed between normal tissue and colon cancer tissue samples. Additionally, we carried out a small simulation study to verify the methods proposed. In the motivating case-studies we show how the nonparametric Bayes approach facilitates the evaluation of posterior expected false discovery rates. We also show how inference can proceed even in the absence of a null sample of known non-differentially expressed scores. This highlights the difference from alternative empirical Bayes approaches that are based on plug-in estimates. © 2005 Royal Statistical Society.",
                "authors": [
                    {
                        "name": "Do K.-A."
                    },
                    {
                        "name": "Muller P."
                    },
                    {
                        "name": "Tang F."
                    }
                ],
                "citationCount": 106,
                "date": "2005-05-23T00:00:00Z",
                "journal": "Journal of the Royal Statistical Society. Series C: Applied Statistics",
                "title": "A Bayesian mixture model for differential gene expression"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ],
    "validated": 1,
    "version": [
        "0.8.8"
    ]
}
