{
    "additionDate": "2019-11-14T18:33:10Z",
    "biotoolsCURIE": "biotools:RACE-SEQ",
    "biotoolsID": "RACE-SEQ",
    "confidence_flag": "medium",
    "description": "> MEDIUM CONFIDENCE! | > CORRECT NAME OF TOOL COULD ALSO BE 'RNA-targeting', 'endonucleolytically', 'RLM-RACE' | RACE-SEQ and Population-Wide Polymorphism Susceptibility Testing for Endonucleolytically Active, RNA-Targeting Therapeutics | Pipeline for the downstream analysis of 5-RACE Next Generation Sequencing experiments | This is a custom R script for the downstream analysis of RACE-seq data | To run the RACE-SEQ-lite script you will need to have an R version ( >=3.4) installed on your system. All the necessary R packages will get installed and loaded automatically",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "siRNA duplex prediction",
                    "uri": "http://edamontology.org/operation_2008"
                },
                {
                    "term": "Sequence trimming",
                    "uri": "http://edamontology.org/operation_3192"
                },
                {
                    "term": "siRNA binding specificity prediction",
                    "uri": "http://edamontology.org/operation_0465"
                }
            ]
        }
    ],
    "homepage": "https://github.com/pantastheo/RACE-SEQ-lite",
    "language": [
        "R"
    ],
    "lastUpdate": "2019-11-14T18:33:10Z",
    "name": "RACE-SEQ",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1007/978-1-4939-9670-4_17",
            "metadata": {
                "abstract": "© Springer Science+Business Media, LLC, part of Springer Nature 2019.High-throughput sequencing of the products of 5′ RNA ligase-mediated rapid amplification of cDNA ends (5′ RLM-RACE) reactions (RACE-SEQ) enables the mapping and digital enumeration of expected and novel 5′ ends in RNA molecules. The resulting data are essential in documenting the mechanism of action and precision of endonucleolytically active, RNA-targeting drugs such as RNase H-active antisense or small interfering RNA. When applied to error-prone replication systems such as RNA viruses or in vitro RNA replicon systems, the method can additionally report the relative susceptibility of known and unknown polymorphisms to a prospective sequence-specific drug, making it a powerful tool in patient selection and stratification as well as resistance prediction. We describe the preparation of sequencing libraries for ultra-high depth 5′ RLM-RACE analysis on two popular second-generation high-throughput sequencing platforms (Illumina, Ion Torrent) and supply a detailed bioinformatics analysis pipeline for target site activity definition and enumeration. We further illustrate how the pipeline can be simply modified to generate polymorphism-specific drug susceptibility data from in vitro replicon experiments (RACE-SEQ-MM), in a patient-free manner, to cover both known and unknown target site variants in the population.",
                "authors": [
                    {
                        "name": "Usher L."
                    },
                    {
                        "name": "Theotokis P.I."
                    },
                    {
                        "name": "Moschos S.A."
                    }
                ],
                "date": "2019-01-01T00:00:00Z",
                "journal": "Methods in Molecular Biology",
                "title": "RACE-SEQ and Population-Wide Polymorphism Susceptibility Testing for Endonucleolytically Active, RNA-Targeting Therapeutics"
            },
            "pmid": "31410804"
        }
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ]
}