
{
    "credit": [
        {
            "email": "jdzxiaoxuan@163.com",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://www.jci-bioinfo.cn/"
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://www.jci-bioinfo.cn/iCataly/iCata_readme.html"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Protein feature detection",
                    "uri": "http://edamontology.org/operation_3092"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Proteins",
                "uri": "http://edamontology.org/topic_0078"
            },
            {
                "term": "Sequence sites, features and motifs",
                "uri": "http://edamontology.org/topic_0160"
            },
            {
                "term": "Sequence analysis",
                "uri": "http://edamontology.org/topic_0080"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://www.mybiosoftware.com/icataly-pseaac-identification-of-enzymes-catalytic-sites-using-sequence-evolution-information.html"
        }
    ],
    "publication": [
        {
            "abstract": "© 2015, Springer Science+Business Media New York.Enzymes play pivotal roles in most of the biological reaction. The catalytic residues of an enzyme are defined as the amino acids which are directly involved in chemical catalysis; the knowledge of these residues is important for understanding enzyme function. Given an enzyme, which residues are the catalytic sites, and which residues are not? This is the first important problem for in-depth understanding the catalytic mechanism and drug development. With the explosive of protein sequences generated during the post-genomic era, it is highly desirable for both basic research and drug design to develop fast and reliable method for identifying the catalytic sites of enzymes according to their sequences. To address this problem, we proposed a new predictor, called iCataly-PseAAC. In the prediction system, the peptide sample was formulated with sequence evolution information via grey system model GM(2,1). It was observed by the rigorous jackknife test and independent dataset test that iCataly-PseAAC was superior to exist predictions though its only use sequence information. As a user-friendly web server, iCataly-PseAAC is freely accessible at http://www.jci-bioinfo.cn/iCataly-PseAAC. A step-by-step guide has been provided on how to use the web server to get the desired results for the convenience of most experimental scientists.",
            "authors": [
                "Xiao X.",
                "Hui M.-J.",
                "Liu Z.",
                "Qiu W.-R."
            ],
            "cit_count": 7,
            "journal": "Journal of Membrane Biology",
            "pmid": "26077845",
            "title": "iCataly-PseAAC: Identification of Enzymes Catalytic Sites Using Sequence Evolution Information with Grey Model GM (2,1)",
            "year": "2015-12-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:icataly-pseaac",
        "biotoolsID": "icataly-pseaac",
        "description": "Web server that could predict methylation sites in proteins. With the assistance of FKNN, the highlight of this tool is to employ amino acid sequence features extracted by incorporating the sequence evolution information into PseAAC via a grey system model (Grey-PSSM).",
        "homepage": "http://www.jci-bioinfo.cn/iCataly-PseAAC",
        "name": "iCataly-PseAAC"
    }
}