{
    "additionDate": "2021-03-19T08:27:29Z",
    "biotoolsCURIE": "biotools:lightcud",
    "biotoolsID": "lightcud",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "xizhuccm@163.com",
            "name": "Xi Zhu",
            "typeEntity": "Person"
        },
        {
            "email": "hqzhu@pku.edu.cn",
            "name": "Huaiqiu Zhu",
            "orcidid": "https://orcid.org/0000-0002-6376-218X",
            "typeEntity": "Person"
        }
    ],
    "description": "A program for diagnosing IBD based on human gut microbiome data.\n\nThe diagnosis of inflammatory bowel disease (IBD) and discrimination between the types of IBD are clinically important.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Read mapping",
                    "uri": "http://edamontology.org/operation_3198"
                },
                {
                    "term": "Sequence assembly",
                    "uri": "http://edamontology.org/operation_0310"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "http://cqb.pku.edu.cn/ZhuLab/LightCUD/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-04-11T08:47:59Z",
    "name": "LightCUD",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1186/S13040-021-00241-2",
            "metadata": {
                "abstract": "© 2021, The Author(s).Background: The diagnosis of inflammatory bowel disease (IBD) and discrimination between the types of IBD are clinically important. IBD is associated with marked changes in the intestinal microbiota. Advances in next-generation sequencing (NGS) technology and the improved hospital bioinformatics analysis ability motivated us to develop a diagnostic method based on the gut microbiome. Results: Using a set of whole-genome sequencing (WGS) data from 349 human gut microbiota samples with two types of IBD and healthy controls, we assembled and aligned WGS short reads to obtain feature profiles of strains and genera. The genus and strain profiles were used for the 16S-based and WGS-based diagnostic modules construction respectively. We designed a novel feature selection procedure to select those case-specific features. With these features, we built discrimination models using different machine learning algorithms. The machine learning algorithm LightGBM outperformed other algorithms in this study and thus was chosen as the core algorithm. Specially, we identified two small sets of biomarkers (strains) separately for the WGS-based health vs IBD module and ulcerative colitis vs Crohn’s disease module, which contributed to the optimization of model performance during pre-training. We released LightCUD as an IBD diagnostic program built with LightGBM. The high performance has been validated through five-fold cross-validation and using an independent test data set. LightCUD was implemented in Python and packaged free for installation with customized databases. With WGS data or 16S rRNA sequencing data of gut microbiome samples as the input, LightCUD can discriminate IBD from healthy controls with high accuracy and further identify the specific type of IBD. The executable program LightCUD was released in open source with instructions at the webpage http://cqb.pku.edu.cn/ZhuLab/LightCUD/. The identified strain biomarkers could be used to study the critical factors for disease development and recommend treatments regarding changes in the gut microbial community. Conclusions: As the first released human gut microbiome-based IBD diagnostic tool, LightCUD demonstrates a high-performance for both WGS and 16S sequencing data. The strains that either identify healthy controls from IBD patients or distinguish the specific type of IBD are expected to be clinically important to serve as biomarkers.",
                "authors": [
                    {
                        "name": "Xu C."
                    },
                    {
                        "name": "Zhou M."
                    },
                    {
                        "name": "Xie Z."
                    },
                    {
                        "name": "Li M."
                    },
                    {
                        "name": "Zhu X."
                    },
                    {
                        "name": "Zhu H."
                    }
                ],
                "date": "2021-12-01T00:00:00Z",
                "journal": "BioData Mining",
                "title": "LightCUD: a program for diagnosing IBD based on human gut microbiome data"
            },
            "pmcid": "PMC7816363",
            "pmid": "33468221"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Microbial ecology",
            "uri": "http://edamontology.org/topic_3697"
        },
        {
            "term": "Whole genome sequencing",
            "uri": "http://edamontology.org/topic_3673"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Medical informatics",
            "uri": "http://edamontology.org/topic_3063"
        }
    ]
}