{"credit":[{"email":"support@massai.dk","name":"Morten Rasmussen","typeEntity":"Person","typeRoles":["Primary contact"]}],"function":[{"operation":[{"term":"Spectral analysis","uri":"http://edamontology.org/operation_3214"}]}],"labels":{"collectionID":["Proteomics"],"toolType":["Command-line tool"],"topic":[{"term":"Proteomics","uri":"http://edamontology.org/topic_0121"}]},"publication":[{"abstract":"The increased interest in chemical cross-linking for probing protein structure and interaction has led to a large increase in literature describing new cross-linkers and search programs. However, this has not led to a corresponding increase in the analysis of large and complex proteins. A major obstacle is that the new cross-linkers are either not readily available and/or have a low reactivity. In combination with aging search programs that are slow and have low sensitivity, or new search programs that are described but not released, these efforts do little to advance the field of cross-linking.Here we present a method pipeline for chemical cross-linking, using two standard cross-linkers, BS3 and BS2G, combined with our freely available CrossWork search program. By this approach we generate cross-link data sufficient to derive structural information for large and complex proteins.CrossWork searches batches of tandem mass-spectrometric data, and identifies cross-linked and non-cross-linked peptides using a standard PC. We tested CrossWork by searching mass-spectrometric datasets of cross-linked complement factor C3 against small (1 protein) and large (1000 proteins) search spaces, and show that the resulting distance constraints agree with the established structures. We further investigated the structure of the multi-domain ERp72, and combined the individual domains of ERp72 into a single structure. © 2011 Elsevier B.V.","authors":["Rasmussen M.I.","Refsgaard J.C.","Peng L.","Houen G.","Hojrup P."],"cit_count":36,"doi":"10.1016/j.jprot.2011.04.019","journal":"Journal of Proteomics","title":"CrossWork: Software-assisted identification of cross-linked peptides","type":"Primary","year":"2011-09-06"}],"summary":{"biotoolsCURIE":"biotools:crosswork","biotoolsID":"crosswork","description":"Software-assisted identification of cross-linked peptides.","homepage":"http://www.massai.dk/","name":"CrossWork"}}