{
    "accessibility": "Open access",
    "additionDate": "2022-05-19T22:26:06.397631Z",
    "biotoolsCURIE": "biotools:nanomaterial_modeler",
    "biotoolsID": "nanomaterial_modeler",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "wonpil@lehigh.edu",
            "name": "Wonpil Im",
            "orcidid": "https://orcid.org/0000-0001-5642-6041",
            "typeEntity": "Person"
        },
        {
            "name": "Ellad B. Tadmor",
            "orcidid": "https://orcid.org/0000-0003-3311-6299"
        },
        {
            "name": "Hendrik Heinz",
            "orcidid": "https://orcid.org/0000-0002-6776-7404"
        }
    ],
    "description": "CHARMM-GUI Nanomaterial Modeler for Modeling and Simulation of Nanomaterial Systems.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Molecular dynamics",
                    "uri": "http://edamontology.org/operation_2476"
                },
                {
                    "term": "Side chain modelling",
                    "uri": "http://edamontology.org/operation_0480"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "http://www.charmm-gui.org/demo/nanomaterial",
    "lastUpdate": "2022-05-19T22:26:06.400113Z",
    "name": "Nanomaterial Modeler",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1021/ACS.JCTC.1C00996",
            "metadata": {
                "abstract": "© 2021 American Chemical Society.Molecular modeling and simulation are invaluable tools for nanoscience that predict mechanical, physicochemical, and thermodynamic properties of nanomaterials and provide molecular-level insight into underlying mechanisms. However, building nanomaterial-containing systems remains challenging due to the lack of reliable and integrated cyberinfrastructures. Here we present Nanomaterial Modeler in CHARMM-GUI, a web-based cyberinfrastructure that provides an automated process to generate various nanomaterial models, associated topologies, and configuration files to perform state-of-the-art molecular dynamics simulations using most simulation packages. The nanomaterial models are based on the interface force field, one of the most reliable force fields (FFs). The transferability of nanomaterial models among the simulation programs was assessed by single-point energy calculations, which yielded 0.01% relative absolute energy differences for various surface models and equilibrium nanoparticle shapes. Three widely used Lennard-Jones (LJ) cutoff methods are employed to evaluate the compatibility of nanomaterial models with respect to conventional biomolecular FFs: simple truncation at r = 12 Å (12 cutoff), force-based switching over 10 to 12 Å (10-12 fsw), and LJ particle mesh Ewald with no cutoff (LJPME). The FF parameters with these LJ cutoff methods are extensively validated by reproducing structural, interfacial, and mechanical properties. We find that the computed density and surface energies are in good agreement with reported experimental results, although the simulation results increase in the following order: 10-12 fsw <12 cutoff < LJPME. Nanomaterials in which LJ interactions are a major component show relatively higher deviations (up to 4% in density and 8% in surface energy differences) compared with the experiment. Nanomaterial Modeler's capability is also demonstrated by generating complex systems of nanomaterial-biomolecule and nanomaterial-polymer interfaces with a combination of existing CHARMM-GUI modules. We hope that Nanomaterial Modeler can be used to carry out innovative nanomaterial modeling and simulations to acquire insight into the structure, dynamics, and underlying mechanisms of complex nanomaterial-containing systems.",
                "authors": [
                    {
                        "name": "Afshar Y."
                    },
                    {
                        "name": "Brooks B.R."
                    },
                    {
                        "name": "Choi Y.K."
                    },
                    {
                        "name": "Heinz H."
                    },
                    {
                        "name": "Im W."
                    },
                    {
                        "name": "Jeon S.H."
                    },
                    {
                        "name": "Jo S."
                    },
                    {
                        "name": "Kanhaiya K."
                    },
                    {
                        "name": "Kern N.R."
                    },
                    {
                        "name": "Kim S."
                    },
                    {
                        "name": "Lee J."
                    },
                    {
                        "name": "Tadmor E.B."
                    }
                ],
                "date": "2022-01-11T00:00:00Z",
                "journal": "Journal of Chemical Theory and Computation",
                "title": "CHARMM-GUI Nanomaterial Modeler for Modeling and Simulation of Nanomaterial Systems"
            },
            "pmcid": "PMC8752518",
            "pmid": "34871001"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Biomaterials",
            "uri": "http://edamontology.org/topic_3368"
        },
        {
            "term": "Molecular dynamics",
            "uri": "http://edamontology.org/topic_0176"
        },
        {
            "term": "Molecular modelling",
            "uri": "http://edamontology.org/topic_2275"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
