{
    "additionDate": "2017-01-17T15:03:28Z",
    "biotoolsCURIE": "biotools:promise",
    "biotoolsID": "promise",
    "collectionID": [
        "BioConductor"
    ],
    "credit": [
        {
            "email": "stanley.pounds@stjude.org",
            "name": "Stan Pounds",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "xueyuan.cao@stjude.org",
            "name": "Xueyuan Cao",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "A general tool to identify genomic features with a specific biologically interesting pattern of associations with multiple endpoint variables.",
    "documentation": [
        {
            "type": "User manual",
            "url": "http://bioconductor.org/packages/release/bioc/html/PROMISE.html"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://bioconductor/packages/release/bioc/src/contrib/PROMISE_1.26.0.tar.gz"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence feature detection",
                    "uri": "http://edamontology.org/operation_0253"
                }
            ]
        }
    ],
    "homepage": "http://bioconductor.org/packages/release/bioc/html/PROMISE.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-10T12:58:55Z",
    "license": "GPL-2.0",
    "name": "PROMISE",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "bioconductor_import",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btp357",
            "metadata": {
                "abstract": "Motivation: In some applications, prior biological knowledge can be used to define a specific pattern of association of multiple endpoint variables with a genomic variable that is biologically most interesting. However, to our knowledge, there is no statistical procedure designed to detect specific patterns of association with multiple endpoint variables. Results: Projection onto the most interesting statistical evidence (PROMISE) is proposed as a general procedure to identify genomic variables that exhibit a specific biologically interesting pattern of association with multiple endpoint variables. Biological knowledge of the endpoint variables is used to define a vector that represents the biologically most interesting values for statistics that characterize the associations of the endpoint variables with a genomic variable. A test statistic is defined as the dot-product of the vector of the observed association statistics and the vector of the most interesting values of the association statistics. By definition, this test statistic is proportional to the length of the projection of the observed vector of correlations onto the vector of most interesting associations. Statistical significance is determined via permutation. In simulation studies and an example application, PROMISE shows greater statistical power to identify genes with the interesting pattern of associations than classical multivariate procedures, individual endpoint analyses or listing genes that have the pattern of interest and are significant in more than one individual endpoint analysis. © The Author 2009. Published by Oxford University Press. All rights reserved.",
                "authors": [
                    {
                        "name": "Pounds S."
                    },
                    {
                        "name": "Cheng C."
                    },
                    {
                        "name": "Cao X."
                    },
                    {
                        "name": "Crews K.R."
                    },
                    {
                        "name": "Plunkett W."
                    },
                    {
                        "name": "Gandhi V."
                    },
                    {
                        "name": "Rubnitz J."
                    },
                    {
                        "name": "Ribeiro R.C."
                    },
                    {
                        "name": "Downing J.R."
                    },
                    {
                        "name": "Lamba J."
                    }
                ],
                "citationCount": 12,
                "date": "2009-08-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "PROMISE: A tool to identify genomic features with a specific biologically interesting pattern of associations with multiple endpoint variables"
            },
            "type": "Primary"
        }
    ],
    "toolType": [
        "Command-line tool",
        "Library"
    ],
    "topic": [
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        }
    ],
    "validated": 1,
    "version": [
        "1.26.0"
    ]
}