{
    "accessibility": "Open access",
    "additionDate": "2019-08-09T13:26:30Z",
    "biotoolsCURIE": "biotools:vancomycin_TDM",
    "biotoolsID": "vancomycin_TDM",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "waystolove@catholic.ac.kr",
            "name": "Seunghoon Han",
            "orcidid": "https://orcid.org/0000-0002-9976-5120",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Open-Source Software for Vancomycin Therapeutic Drug Management.",
    "editPermission": {
        "type": "private"
    },
    "homepage": "http://pipet.shinyapps.io/vancomycin",
    "language": [
        "R"
    ],
    "lastUpdate": "2020-06-16T10:55:26Z",
    "license": "Unlicense",
    "maturity": "Mature",
    "name": "vancomycin TDM",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "hans",
    "publication": [
        {
            "doi": "10.3390/PHARMACEUTICS11050224",
            "metadata": {
                "abstract": "© 2019 by the authors. Licensee MDPI, Basel, Switzerland.The population pharmacokinetic (PK) parameters that are implemented in therapeutic drug management (TDM) software were generally obtained from a Western population and might not be adequate for PK prediction with a Korean population. This study aimed to develop a population PK model for vancomycin using Korean data to improve the quality of TDM for Korean patients. A total of 220 patients (1020 observations) who received vancomycin TDM services were included in the dataset. A population PK analysis was performed using non-linear mixed effects modeling, and a covariate evaluation was conducted. A two-compartment model with first-order elimination best explained the vancomycin PK, with estimates of 2.82 L/h, 31.8 L, 11.7 L/h, and 75.4 L for CL, V1, Q, and V2, respectively. In the covariate analysis, weight correlated with the volume of the peripheral compartment, and creatinine clearance, hemodialysis, and continuous renal replacement therapy treatments contributed to the clearance of vancomycin. The results show the clear need to optimize the PK parameters used for TDM in Korean patients. Specifically, V1 should be smaller for Korean patients, and renal replacement therapies should be considered in TDM practice. This final model was successfully applied in R shiny as open-source software for Koreans.",
                "authors": [
                    {
                        "name": "Bae S.H."
                    },
                    {
                        "name": "Yim D.-S."
                    },
                    {
                        "name": "Lee H."
                    },
                    {
                        "name": "Park A.-R."
                    },
                    {
                        "name": "Kwon J.-E."
                    },
                    {
                        "name": "Sumiko H."
                    },
                    {
                        "name": "Han S."
                    }
                ],
                "citationCount": 2,
                "date": "2019-05-01T00:00:00Z",
                "journal": "Pharmaceutics",
                "title": "Application of pharmacometrics in pharmacotherapy: Open-source software for vancomycin therapeutic drug management"
            },
            "pmcid": "PMC6572512",
            "pmid": "31075931",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Drug metabolism",
            "uri": "http://edamontology.org/topic_3375"
        }
    ]
}