{
    "additionDate": "2021-01-18T10:29:48Z",
    "biotoolsCURIE": "biotools:acep",
    "biotoolsID": "acep",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "sfwang_66@ynu.edu.cn",
            "name": "Shunfang Wang",
            "typeEntity": "Person"
        }
    ],
    "description": "ACEP is a deep learning model for high-throughput antibacterial peptide recognition. By loading a pre-trained model, the software can be deployed on a common computer to perform antimicrobial peptide recognition, important motif discovery, and visualization analysis. Both the peptide sequences and PSSM profiles need to be input the model.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Antimicrobial resistance prediction",
                    "uri": "http://edamontology.org/operation_3482"
                },
                {
                    "term": "Protein secondary structure prediction",
                    "uri": "http://edamontology.org/operation_0267"
                },
                {
                    "term": "Sequence motif recognition",
                    "uri": "http://edamontology.org/operation_0239"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                },
                {
                    "term": "Fold recognition",
                    "uri": "http://edamontology.org/operation_0303"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Fuhaoyi/ACEP",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-01-19T12:46:02Z",
    "name": "ACEP",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1186/S12864-020-06978-0",
            "metadata": {
                "abstract": "© 2020 The Author(s).Background: Antimicrobial resistance is one of our most serious health threats. Antimicrobial peptides (AMPs), effecter molecules of innate immune system, can defend host organisms against microbes and most have shown a lowered likelihood for bacteria to form resistance compared to many conventional drugs. Thus, AMPs are gaining popularity as better substitute to antibiotics. To aid researchers in novel AMPs discovery, we design computational approaches to screen promising candidates. Results: In this work, we design a deep learning model that can learn amino acid embedding patterns, automatically extract sequence features, and fuse heterogeneous information. Results show that the proposed model outperforms state-of-the-art methods on recognition of AMPs. By visualizing data in some layers of the model, we overcome the black-box nature of deep learning, explain the working mechanism of the model, and find some import motifs in sequences. Conclusions: ACEP model can capture similarity between amino acids, calculate attention scores for different parts of a peptide sequence in order to spot important parts that significantly contribute to final predictions, and automatically fuse a variety of heterogeneous information or features. For high-throughput AMPs recognition, open source software and datasets are made freely available at https://github.com/Fuhaoyi/ACEP.",
                "authors": [
                    {
                        "name": "Fu H."
                    },
                    {
                        "name": "Cao Z."
                    },
                    {
                        "name": "Li M."
                    },
                    {
                        "name": "Wang S."
                    }
                ],
                "date": "2020-08-28T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "ACEP: Improving antimicrobial peptides recognition through automatic feature fusion and amino acid embedding"
            },
            "pmcid": "PMC7455913",
            "pmid": "32859150"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Sequence sites, features and motifs",
            "uri": "http://edamontology.org/topic_0160"
        },
        {
            "term": "Structure prediction",
            "uri": "http://edamontology.org/topic_0082"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Allergy, clinical immunology and immunotherapeutics",
            "uri": "http://edamontology.org/topic_3400"
        }
    ],
    "validated": 1
}