{
    "name": "One-Block CYRCA", 
    "description": "Program for identifying blocks (local ungapped profiles of the most conserved regions of protein families and domains) in a multiple sequence alignment based on the LAMA and CYRCA block-to-block alignment methods.", 
    "homepage": "http://bioinformatics.weizmann.ac.il/~milana/OneCYRCA/", 
    "biotoolsID": "one-block_cyrca", 
    "biotoolsCURIE": "biotools:one-block_cyrca", 
    "version": [], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_0448", 
                    "term": "Sequence alignment analysis (conservation)"
                }, 
                {
                    "uri": "http://edamontology.org/operation_0303", 
                    "term": "Protein fold recognition"
                }, 
                {
                    "uri": "http://edamontology.org/operation_0495", 
                    "term": "Local alignment"
                }, 
                {
                    "uri": "http://edamontology.org/operation_3092", 
                    "term": "Protein feature detection"
                }, 
                {
                    "uri": "http://edamontology.org/operation_0509", 
                    "term": "Local structure alignment"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Web application"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_0736", 
            "term": "Protein folds and structural domains"
        }, 
        {
            "uri": "http://edamontology.org/topic_0082", 
            "term": "Structure prediction"
        }, 
        {
            "uri": "http://edamontology.org/topic_0623", 
            "term": "Gene and protein families"
        }, 
        {
            "uri": "http://edamontology.org/topic_0160", 
            "term": "Sequence sites, features and motifs"
        }, 
        {
            "uri": "http://edamontology.org/topic_3534", 
            "term": "Protein binding sites"
        }
    ], 
    "operatingSystem": [], 
    "language": [], 
    "license": null, 
    "collectionID": [], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [], 
    "download": [], 
    "documentation": [], 
    "publication": [
        {
            "doi": null, 
            "pmid": "8871566", 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "Searching databases of conserved sequence regions by aligning protein multiple-alignments", 
                "abstract": "A general searching method for comparing multiple sequence alignments was developed to detect sequence relationships between conserved protein regions. Multiple alignments are treated as sequences of amino acid distributions and aligned by comparing pairs of such distributions. Four different comparison measures were tested and the Pearson correlation coefficient chosen. The method is sensitive, detecting weak sequence relationships between protein families. Relationships are detected beyond the range of conventional sequence database searches, illustrating the potential usefulness of the method. The previously undetected relation between flavoprotein subunits of two oxidoreductase families points to the potential active site in one of the families. The similarity between the bacterial RecA, DnaA and Rad51 protein families reveals a region in DnaA and Rad51 proteins likely to bind and unstack single-stranded DNA. Helix-turn-helix DNA binding domains from diverse proteins are readily detected and shown to be similar to each other. Glycosylasparaginase and gamma-glutamyltransferase enzymes are found to be similar in their proteolytic cleavage sites. The method has been fully implemented on the World Wide Web.", 
                "date": "1996-10-17T00:00:00Z", 
                "citationCount": 182, 
                "authors": [
                    {
                        "name": "Pietrokovski S."
                    }
                ], 
                "journal": "Nucleic Acids Research"
            }
        }, 
        {
            "doi": null, 
            "pmid": "11273712", 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "Consistency analysis of similarity between multiple alignments: Prediction of protein function and fold structure from analysis of local sequence motifs", 
                "abstract": "A new method to analyze the similarity between multiply aligned protein motifs (blocks) was developed. It identifies sets of consistently aligned blocks. These are found to be protein regions of similar function and structure that appear in different contexts. For example, the Rossmann fold ligand-binding region is found similar to TIM barrel and methylase regions, various protein families are predicted to have a TIM-barrel fold and the structural relation between the ClpP protease and crotonase folds is identified from their sequence. Besides identifying local structure features, sequence similarity across short sequence-regions (less than 20 amino acid regions) also predicts structure similarity of whole domains (folds) a few hundred amino acid reidues long. Most of these relations could not be identified by other advanced sequence-to-sequence or sequence-to-multiple alignments comparisons. We describe the method (termed CYRCA), present examples of our findings, and discuss their implications. © 2001 Academic Press.", 
                "date": "2001-03-30T00:00:00Z", 
                "citationCount": 27, 
                "authors": [
                    {
                        "name": "Kunin V."
                    }, 
                    {
                        "name": "Chan B."
                    }, 
                    {
                        "name": "Sitbon E."
                    }, 
                    {
                        "name": "Lithwick G."
                    }, 
                    {
                        "name": "Pietrokovski S."
                    }
                ], 
                "journal": "Journal of Molecular Biology"
            }
        }, 
        {
            "doi": null, 
            "pmid": "15980470", 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "One-Block CYRCA: An automated procedure for identifying multiple-block alignments from single block queries", 
                "abstract": "One-Block CYRCA is an automated procedure for identifying multiple-block alignments from single block queries (http://bioinfo.weizmann.ac.il/ blocks/OneCYRCA). It is based on the LAMA and CYRCA block-to-block alignment methods. The procedure identifies whether the query blocks can form new multiple-block alignments (block sets) with blocks from a database or join pre-existing database block sets. Using pre-computed LAMA block alignments and CYRCA sets from the Blocks database reduces the computation time. LAMA and CYRCA are highly sensitive and selective methods that can augment many other sequence analysis approaches. © 2005 Oxford University Press.", 
                "date": "2005-07-01T00:00:00Z", 
                "citationCount": 3, 
                "authors": [
                    {
                        "name": "Frenkel-Morgenstern M."
                    }, 
                    {
                        "name": "Singer A."
                    }, 
                    {
                        "name": "Bronfeld H."
                    }, 
                    {
                        "name": "Pietrokovski S."
                    }
                ], 
                "journal": "Nucleic Acids Research"
            }
        }
    ], 
    "credit": [], 
    "owner": "ELIXIR-EE", 
    "additionDate": "2017-03-24T11:31:23Z", 
    "lastUpdate": "2018-12-10T12:58:40Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 1, 
    "homepage_status": 1, 
    "elixir_badge": 0
}