{
    "additionDate": "2021-01-18T08:40:59Z",
    "biotoolsCURIE": "biotools:bareb",
    "biotoolsID": "bareb",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "yanxun.xu@jhu.edu",
            "name": "Yanxun Xu",
            "typeEntity": "Person"
        }
    ],
    "description": "BAREB, a BAyesian REpulsive Biclustering model, that can simultaneously cluster the Periodontal diseases (PD) patients and their tooth sites after taking the patient- and site-level covariates into consideration. BAREB uses the determinantal point process (DPP) prior to induce diversity among different biclusters to facilitate parsimony and interpretability.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "https://cran.r-project.org/package=BAREB",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-01-31T15:09:46Z",
    "license": "GPL-3.0",
    "name": "BAREB",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1002/SIM.8536",
            "metadata": {
                "abstract": "© 2020 John Wiley & Sons, Ltd.Preventing periodontal diseases (PD) and maintaining the structure and function of teeth are important goals for personal oral care. To understand the heterogeneity in patients with diverse PD patterns, we develop a Bayesian repulsive biclustering method that can simultaneously cluster the PD patients and their tooth sites after taking the patient- and site-level covariates into consideration. BAREB uses the determinantal point process prior to induce diversity among different biclusters to facilitate parsimony and interpretability. Since PD progression is hypothesized to be spatially referenced, BAREB factors in the spatial dependence among tooth sites. In addition, since PD is the leading cause for tooth loss, the missing data mechanism is nonignorable. Such nonrandom missingness is incorporated into BAREB. For the posterior inference, we design an efficient reversible jump Markov chain Monte Carlo sampler. Simulation studies show that BAREB is able to accurately estimate the biclusters, and compares favorably to alternatives. For real world application, we apply BAREB to a dataset from a clinical PD study, and obtain desirable and interpretable results. A major contribution of this article is the Rcpp implementation of our methodology, available in the R package BAREB.",
                "authors": [
                    {
                        "name": "Li Y."
                    },
                    {
                        "name": "Bandyopadhyay D."
                    },
                    {
                        "name": "Xie F."
                    },
                    {
                        "name": "Xu Y."
                    }
                ],
                "date": "2020-07-20T00:00:00Z",
                "journal": "Statistics in Medicine",
                "title": "BAREB: A Bayesian repulsive biclustering model for periodontal data"
            },
            "pmcid": "PMC7272289",
            "pmid": "32246534"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        },
        {
            "term": "Preclinical and clinical studies",
            "uri": "http://edamontology.org/topic_3379"
        }
    ]
}