{
    "additionDate": "2025-06-06T11:29:48.238556Z",
    "biotoolsCURIE": "biotools:flumut",
    "biotoolsID": "flumut",
    "description": "FluMut is an open-source tool designed to search for molecular markers with potential impact on the biological characteristics of Influenza A viruses of the A(H5N1) subtype, starting from complete or partial nucleotide genome sequences.",
    "editPermission": {
        "type": "private"
    },
    "homepage": "https://izsvenezie-virology.github.io/FluMut/",
    "lastUpdate": "2025-06-06T12:05:28.550810Z",
    "license": "gSOAP-1.3b",
    "link": [
        {
            "note": "Publication link.",
            "type": [
                "Other"
            ],
            "url": "https://doi.org/10.1093/ve/veaf011"
        },
        {
            "note": "Website of the tool.",
            "type": [
                "Repository"
            ],
            "url": "https://izsvenezie-virology.github.io/FluMut/"
        },
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/izsvenezie-virology/FluMut"
        }
    ],
    "name": "flumut",
    "owner": "evezeyl",
    "publication": [
        {
            "doi": "10.1093/ve/veaf011",
            "metadata": {
                "abstract": "Over the past century, Influenza A virus (IAV) has caused four of the five reported pandemics, all of which originated from viruses possessing genome segments of avian origin. The recent spread of highly pathogenic avian influenza (HPAI) viruses, particularly the clade 2.3.4.4b A(H5N1) subtype, has led to an alarming increase in mammalian infections, raising concerns about the potential for future pandemics. In response to this, we developed FluMut, an open-source, cross-platform tool designed to identify molecular markers with potential impacts on H5N1 virus phenotypes. FluMut leverages an up-To-date database, FluMutDB, to rapidly analyze thousands of nucleotide sequences, identifying mutations associated with host adaptation, increased virulence, and antiviral resistance. The tool is available both as a command-line interface and a user-friendly graphical interface, making it accessible to researchers with varying levels of computational expertise. FluMut provides comprehensive outputs, including tables of detected markers, their biological effects, and corresponding literature references. This tool fills a critical gap in the genomic surveillance of HPAI H5N1, facilitating real-Time monitoring of viral evolution and aiding in the identification of mutations that may signal increased pandemic potential. Future updates will extend FluMut's capabilities to other influenza subtypes.",
                "authors": [
                    {
                        "name": "Cavicchio L."
                    },
                    {
                        "name": "De Battisti C."
                    },
                    {
                        "name": "Fusaro A."
                    },
                    {
                        "name": "Giussani E."
                    },
                    {
                        "name": "Hughes J."
                    },
                    {
                        "name": "Monne I."
                    },
                    {
                        "name": "Pastori A."
                    },
                    {
                        "name": "Salomoni A."
                    },
                    {
                        "name": "Sartori A."
                    },
                    {
                        "name": "Varotto M."
                    },
                    {
                        "name": "Zecchin B."
                    }
                ],
                "date": "2025-01-01T00:00:00Z",
                "journal": "Virus Evolution",
                "title": "FluMut: A tool for mutation surveillance in highly pathogenic H5N1 genomes"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "version": [
        "0.6.4"
    ]
}
