{
    "additionDate": "2017-08-03T18:56:28Z",
    "biotoolsCURIE": "biotools:proq2",
    "biotoolsID": "proq2",
    "credit": [
        {
            "email": "bjornw@ifm.liu.se",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Neural network based predictor that based on a number of structural features predicts the quality of a protein model. It is optimized to find correct models in contrast to other methods which are optimized to find native structures.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://bioinfo.ifm.liu.se/ProQ2/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein property calculation",
                    "uri": "http://edamontology.org/operation_0250"
                },
                {
                    "term": "Protein sequence analysis",
                    "uri": "http://edamontology.org/operation_2479"
                }
            ]
        }
    ],
    "homepage": "http://bioinfo.ifm.liu.se/ProQ2/",
    "language": [
        "Perl"
    ],
    "lastUpdate": "2018-12-10T12:58:55Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/proq-1-2-protein-quality-predictor.html"
        }
    ],
    "name": "ProQ2",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "© The Author 2016. Published by Oxford University Press.Motivation: Model quality assessment programs are used to predict the quality of modeled protein structures. They can be divided into two groups depending on the information they are using: ensemble methods using consensus of many alternative models and methods only using a single model to do its prediction. The consensus methods excel in achieving high correlations between prediction and true quality measures. However, they frequently fail to pick out the best possible model, nor can they be used to generate and score new structures. Single-model methods on the other hand do not have these inherent shortcomings and can be used both to sample new structures and to improve existing consensus methods. Results: Here, we present an implementation of the ProQ2 program to estimate both local and global model accuracy as part of the Rosetta modeling suite. The current implementation does not only make it possible to run large batch runs locally, but it also opens up a whole new arena for conformational sampling using machine learned scoring functions and to incorporate model accuracy estimation in to various existing modeling schemes. ProQ2 participated in CASP11 and results from CASP11 are used to benchmark the current implementation. Based on results from CASP11 and CAMEO-QE, a continuous benchmark of quality estimation methods, it is clear that ProQ2 is the single-model method that performs best in both local and global model accuracy.",
                "authors": [
                    {
                        "name": "Uziela K."
                    },
                    {
                        "name": "Wallner B."
                    }
                ],
                "citationCount": 38,
                "date": "2016-05-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "ProQ2: Estimation of model accuracy implemented in Rosetta"
            },
            "pmid": "26733453"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Protein properties",
            "uri": "http://edamontology.org/topic_0123"
        },
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        }
    ],
    "validated": 1
}
