{
    "additionDate": "2021-11-15T11:38:16.924683Z",
    "biotoolsCURIE": "biotools:acoustilytix",
    "biotoolsID": "acoustilytix",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "duvauchelle@mail.utexas.edu",
            "name": "Christine L. Duvauchelle",
            "typeEntity": "Person"
        }
    ],
    "description": "A Web-Based Automated Ultrasonic Vocalization Scoring Platform.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                }
            ]
        }
    ],
    "homepage": "http://acoustilytix.com/",
    "lastUpdate": "2021-11-15T11:38:16.927308Z",
    "name": "Acoustilytix",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.3390/BRAINSCI11070864",
            "metadata": {
                "abstract": "© 2021 by the authors. Licensee MDPI, Basel, Switzerland.Ultrasonic vocalizations (USVs) are known to reflect emotional processing, brain neu-rochemistry, and brain function. Collecting and processing USV data is manual, time-intensive, and costly, creating a significant bottleneck by limiting researchers’ ability to employ fully effective and nuanced experimental designs and serving as a barrier to entry for other researchers. In this report, we provide a snapshot of the current development and testing of Acoustilytix™, a web-based automated USV scoring tool. Acoustilytix implements machine learning methodology in the USV detection and classification process and is recording-environment-agnostic. We summarize the user features identified as desirable by USV researchers and how these were implemented. These include the ability to easily upload USV files, output a list of detected USVs with associated parameters in csv format, and the ability to manually verify or modify an automatically detected call. With no user intervention or tuning, Acoustilytix achieves 93% sensitivity (a measure of how accurately Acoustilytix detects true calls) and 73% precision (a measure of how accurately Acoustilytix avoids false positives) in call detection across four unique recording environments and was superior to the popular DeepSqueak algorithm (sensitivity = 88%; precision = 41%). Future work will include integration and implementation of machine-learning-based call type classification prediction that will recommend a call type to the user for each detected call. Call classification accuracy is currently in the 71–79% accuracy range, which will continue to improve as more USV files are scored by expert scorers, providing more training data for the classification model. We also describe a recently developed feature of Acoustilytix that offers a fast and effective way to train hand-scorers using automated learning principles without the need for an expert hand-scorer to be present and is built upon a foundation of learning science. The key is that trainees are given practice classifying hundreds of calls with immediate corrective feedback based on an expert’s USV classification. We showed that this approach is highly effective with inter-rater reliability (i.e., kappa statistics) between trainees and the expert ranging from 0.30–0.75 (average = 0.55) after only 1000–2000 calls of training. We conclude with a brief discussion of future improvements to the Acoustilytix platform.",
                "authors": [
                    {
                        "name": "Ashley C.B."
                    },
                    {
                        "name": "Snyder R.D."
                    },
                    {
                        "name": "Shepherd J.E."
                    },
                    {
                        "name": "Cervantes C."
                    },
                    {
                        "name": "Mittal N."
                    },
                    {
                        "name": "Fleming S."
                    },
                    {
                        "name": "Bailey J."
                    },
                    {
                        "name": "Nievera M.D."
                    },
                    {
                        "name": "Souleimanova S.I."
                    },
                    {
                        "name": "Nyaoga B."
                    },
                    {
                        "name": "Lichtenfeld L."
                    },
                    {
                        "name": "Chen A.R."
                    },
                    {
                        "name": "Maddox W.T."
                    },
                    {
                        "name": "Duvauchelle C.L."
                    }
                ],
                "date": "2021-07-01T00:00:00Z",
                "journal": "Brain Sciences",
                "title": "Acoustilytix™: A web-based automated ultrasonic vocalization scoring platform"
            },
            "pmcid": "PMC8301917",
            "pmid": "34209754"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Psychiatry",
            "uri": "http://edamontology.org/topic_3419"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Drug discovery",
            "uri": "http://edamontology.org/topic_3336"
        },
        {
            "term": "Drug development",
            "uri": "http://edamontology.org/topic_3373"
        }
    ]
}