{
    "accessibility": "Open access",
    "additionDate": "2021-03-19T08:28:41Z",
    "biotoolsCURIE": "biotools:apod",
    "biotoolsID": "apod",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "lkurgan@vcu.edu",
            "name": "Lukasz Kurgan",
            "orcidid": "https://orcid.org/0000-0002-7749-0314",
            "typeEntity": "Person"
        },
        {
            "email": "zhenling@tju.edu.cn",
            "name": "Zhenling Peng",
            "typeEntity": "Person"
        }
    ],
    "description": "APOD (Accurate Predictor Of Disordered flexible linkers) is an accurate sequence-based predictor of disordered flexible linkers. It utilizes both local- and protein-level inputs that quantify propensity for disorder, sequence composition, sequence conservation and selected putative structural properties.",
    "editPermission": {
        "authors": [
            "daniela.mereuta"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein disorder prediction",
                    "uri": "http://edamontology.org/operation_3904"
                },
                {
                    "term": "Protein secondary structure prediction",
                    "uri": "http://edamontology.org/operation_0267"
                }
            ]
        }
    ],
    "homepage": "https://yanglab.nankai.edu.cn/APOD/",
    "lastUpdate": "2024-11-24T15:44:46.075364Z",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "https://yanglab.nankai.edu.cn/APOD/benchmark/"
        }
    ],
    "name": "APOD",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btaa808",
            "metadata": {
                "abstract": "Motivation: Disordered flexible linkers (DFLs) are abundant and functionally important intrinsically disordered regions that connect protein domains and structural elements within domains and which facilitate disorder-based allosteric regulation. Although computational estimates suggest that thousands of proteins have DFLs, they were annotated experimentally in <200 proteins. This substantial annotation gap can be reduced with the help of accurate computational predictors. The sole predictor of DFLs, DFLpred, trade-off accuracy for shorter runtime by excluding relevant but computationally costly predictive inputs. Moreover, it relies on the local/window-based information while lacking to consider useful protein-level characteristics. Results: We conceptualize, design and test APOD (Accurate Predictor Of DFLs), the first highly accurate predictor that utilizes both local- and protein-level inputs that quantify propensity for disorder, sequence composition, sequence conservation and selected putative structural properties. Consequently, APOD offers significantly more accurate predictions when compared with its faster predecessor, DFLpred, and several other alternative ways to predict DFLs. These improvements stem from the use of a more comprehensive set of inputs that cover the protein-level information and the application of a more sophisticated predictive model, a well-parametrized support vector machine. APOD achieves area under the curve ¼ 0.82 (28% improvement over DFLpred) and Matthews correlation coefficient ¼ 0.42 (180% increase over DFLpred) when tested on an independent/low-similarity test dataset. Consequently, APOD is a suitable choice for accurate and small-scale prediction of DFLs.",
                "authors": [
                    {
                        "name": "Kurgan L."
                    },
                    {
                        "name": "Peng Z."
                    },
                    {
                        "name": "Xing Q."
                    }
                ],
                "citationCount": 23,
                "date": "2020-12-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "APOD: Accurate sequence-based predictor of disordered flexible linkers"
            },
            "pmcid": "PMC7773485",
            "pmid": "33381830"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Protein disordered structure",
            "uri": "http://edamontology.org/topic_3538"
        },
        {
            "term": "Protein folds and structural domains",
            "uri": "http://edamontology.org/topic_0736"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Structure prediction",
            "uri": "http://edamontology.org/topic_0082"
        }
    ]
}
