{
    "additionDate": "2019-11-14T18:19:51Z",
    "biotoolsCURIE": "biotools:VASSL",
    "biotoolsID": "VASSL",
    "confidence_flag": "tool",
    "description": "A Visual Analytics Toolkit for Social Spambot Labeling | Visual Analytics Toolkit for Social Spambots Labeling | The server is currently busy. Please wait. | Thank you for your participation | You have completed all the sessions | Label as Spambot Label as Genuine | Please express your opinion about VASSL:",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                }
            ]
        }
    ],
    "homepage": "https://vassl.new-dimension.co",
    "lastUpdate": "2021-01-02T11:41:47Z",
    "name": "VASSL",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1109/TVCG.2019.2934266",
            "metadata": {
                "abstract": "© 1995-2012 IEEE.Social media platforms are filled with social spambots. Detecting these malicious accounts is essential, yet challenging, as they continually evolve to evade detection techniques. In this article, we present VASSL, a visual analytics system that assists in the process of detecting and labeling spambots. Our tool enhances the performance and scalability of manual labeling by providing multiple connected views and utilizing dimensionality reduction, sentiment analysis and topic modeling, enabling insights for the identification of spambots. The system allows users to select and analyze groups of accounts in an interactive manner, which enables the detection of spambots that may not be identified when examined individually. We present a user study to objectively evaluate the performance of VASSL users, as well as capturing subjective opinions about the usefulness and the ease of use of the tool.",
                "authors": [
                    {
                        "name": "Khayat M."
                    },
                    {
                        "name": "Karimzadeh M."
                    },
                    {
                        "name": "Zhao J."
                    },
                    {
                        "name": "Ebert D.S."
                    }
                ],
                "citationCount": 5,
                "date": "2020-01-01T00:00:00Z",
                "journal": "IEEE Transactions on Visualization and Computer Graphics",
                "title": "VASSL: A Visual Analytics Toolkit for Social Spambot Labeling"
            },
            "pmid": "31425086"
        }
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        }
    ],
    "validated": 1
}