{
    "additionDate": "2017-03-27T12:32:26Z",
    "biotoolsCURIE": "biotools:protegen",
    "biotoolsID": "protegen",
    "credit": [
        {
            "name": "Contact Form",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.violinet.org/protegen/contact_us.php"
        }
    ],
    "description": "Protegen is a web-based database and analysis system that curates, stores and analyzes protective antigens. Protegen includes basic antigen information and experimental evidence curated from peer-reviewed articles. It also includes detailed gene/protein information (e.g. DNA and protein sequences, and COG classification). Different antigen features, such as protein weight and pI, and subcellular localizations of bacterial proteins are precomputed.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://www.violinet.org/protegen/docs/index.php"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Peptide immunogenicity prediction",
                    "uri": "http://edamontology.org/operation_0252"
                },
                {
                    "term": "Protein sequence analysis",
                    "uri": "http://edamontology.org/operation_2479"
                },
                {
                    "term": "DNA vaccine design",
                    "uri": "http://edamontology.org/operation_0560"
                }
            ]
        }
    ],
    "homepage": "http://www.violinet.org/protegen",
    "lastUpdate": "2018-12-10T12:58:53Z",
    "name": "Protegen",
    "operatingSystem": [
        "Linux",
        "Windows"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "Protective antigens are specifically targeted by the acquired immune response of the host and are able to induce protection in the host against infectious and non-infectious diseases. Protective antigens play important roles in vaccine development, as biological markers for disease diagnosis, and for analysis of fundamental host immunity against diseases. Protegen is a web-based central database and analysis system that curates, stores and analyzes protective antigens. Basic antigen information and experimental evidence are curated from peer-reviewed articles. More detailed gene/ protein information (e.g. DNA and protein sequences,and COG classification) are automatically extracted from existing databases using internally developed scripts. Bioinformatics programs are also applied to compute different antigen features, such as protein weight and pI, and subcellular localizations of bacterial proteins. Presently, 590 protective antigens have been curated against over 100 infectious diseases caused by pathogens and non-infectious diseases (including cancers and allergies). A user-friendly web query and visualization interface is developed for interactive protective antigen search. A customized BLAST sequence similarity search is also developed for analysis of new sequences provided by the users. To support data exchange, the information of protective antigens is stored in the Vaccine Ontology (VO) in OWL format and can also be exported to FASTA and Excel files. Protegen is publically available at http://www.violinet.org/protegen. © The Author(s) 2010.",
                "authors": [
                    {
                        "name": "Yang B."
                    },
                    {
                        "name": "Sayers S."
                    },
                    {
                        "name": "Xiang Z."
                    },
                    {
                        "name": "He Y."
                    }
                ],
                "citationCount": 43,
                "date": "2011-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "Protegen: A web-based protective antigen database and analysis system"
            },
            "pmid": "20959289"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Immunoproteins, genes and antigens",
            "uri": "http://edamontology.org/topic_2830"
        },
        {
            "term": "Gene and protein families",
            "uri": "http://edamontology.org/topic_0623"
        },
        {
            "term": "Infectious disease",
            "uri": "http://edamontology.org/topic_3324"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        }
    ],
    "validated": 1
}