{
    "additionDate": "2021-01-18T10:57:30Z",
    "biotoolsCURIE": "biotools:spectacle",
    "biotoolsID": "spectacle",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "todd-scheetz@uiowa.edu",
            "name": "Todd E. Scheetz",
            "typeEntity": "Person"
        }
    ],
    "description": "An interactive resource for ocular single-cell RNA sequencing data analysis.\n\nUniversity of Iowa: Institute for Vision Research.\n\nSpectacle and cellcuratoR were developed by an interdisciplinary team within the Institute for Vision Research at the University of Iowa. The Institute of Vision Research is deeply dedicated to treating and curing visual diseases. More information can be found at our website ivr.uiowa.edu.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Expression data visualisation",
                    "uri": "http://edamontology.org/operation_0571"
                }
            ]
        }
    ],
    "homepage": "http://OcularGeneExpression.org/singlecell",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-02-20T14:30:25Z",
    "name": "Spectacle",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1016/J.EXER.2020.108204",
            "metadata": {
                "abstract": "© 2020 The Author(s)Single-cell RNA sequencing has revolutionized ocular gene expression studies. This technology has enabled researchers to identify expression signatures for rare cell types and characterize how gene expression changes across biological conditions, such as topographic region or disease status. However, sharing single-cell RNA sequencing results remains a major obstacle, particular for individuals without a computational background. To address these limitations, we developed Spectacle, an interactive web-based resource for exploring previously published single-cell RNA sequencing data from ocular studies. Spectacle is powered by a locally developed R package, cellcuratoR, which utilizes the Shiny framework in R to generate interactive visualizations for single-cell expression data. Spectacle contains five pre-processed ocular single-cell RNA sequencing data sets and is accessible via the web at OcularGeneExpression.org/singlecell. With Spectacle, users can interactively identify which cell types express a gene of interest, detect transcriptomic subpopulations within a cell type, and perform highly flexible differential expression analyses. The freely-available Spectacle system reduces the bioinformatic barrier for interacting with rich single-cell RNA sequencing studies from ocular tissues, making it easy to quickly identify cell types that express a gene of interest.",
                "authors": [
                    {
                        "name": "Voigt A.P."
                    },
                    {
                        "name": "Whitmore S.S."
                    },
                    {
                        "name": "Lessing N.D."
                    },
                    {
                        "name": "DeLuca A.P."
                    },
                    {
                        "name": "Tucker B.A."
                    },
                    {
                        "name": "Stone E.M."
                    },
                    {
                        "name": "Mullins R.F."
                    },
                    {
                        "name": "Scheetz T.E."
                    }
                ],
                "citationCount": 3,
                "date": "2020-11-01T00:00:00Z",
                "journal": "Experimental Eye Research",
                "title": "Spectacle: An interactive resource for ocular single-cell RNA sequencing data analysis"
            },
            "pmcid": "PMC7655596",
            "pmid": "32910939"
        }
    ],
    "topic": [
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        },
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        }
    ]
}