{
    "additionDate": "2021-01-18T09:17:24Z",
    "biotoolsCURIE": "biotools:hyperquant",
    "biotoolsID": "hyperquant",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "amit.yadav@thsti.res.in",
            "name": "Amit Kumar Yadav",
            "typeEntity": "Person"
        }
    ],
    "description": "Computational Pipeline for Higher Order Multiplexed Quantitative Proteomics.\n\nHyperQuant A Pipeline for integrating identification and quantitation results for Hyperplexing experiment © Suruchi Aggarwal, Dr.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Peptide database search",
                    "uri": "http://edamontology.org/operation_3646"
                },
                {
                    "term": "Protein identification",
                    "uri": "http://edamontology.org/operation_3767"
                }
            ]
        }
    ],
    "homepage": "https://sourceforge.net/projects/hyper-quant/files/",
    "lastUpdate": "2021-02-01T09:13:24Z",
    "name": "HyperQuant",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1021/ACSOMEGA.0C00515",
            "metadata": {
                "abstract": "© 2020 American Chemical Society.Quantitative proteomics has evolved considerably over the last decade with the advent of higher order multiplexing (HOM) techniques. With the development of methods such as - multitagging, cPILOT, hyperplexing, BONPlex, and MITNCAT, the HOM technique is rapidly taking the center stage in multiplexed quantitative proteomics. These studies combined MS1 and MS2 labels in a single experiment enabling higher sample throughput. While HOM is highly promising, the computational analysis is still a big challenge, as the available tools cannot harness its power completely. We have developed a new quantitative pipeline, HyperQuant to aid in accurately quantitating complex HOM data. The pipeline uses identification results from either MaxQuant or any other search engine and quantitation results from QuantWizIQ. The Mapper and Combiner modules of HyperQuant allow facile integration of the labeled data, along with peptide spectrum match (PSM) intensity/ratio integration for proteins, respectively, for each PSM label combination. This also includes appropriate combination of replicates/fractions before summarizing the protein intensity/ratio, leading to robust quantitation. To the best of our knowledge, this is the first tool for the quantitation of HOM data with flexibility for any combination of MS1 and MS2 labels. We demonstrate its utility in analyzing two 18-plex data sets from the hyperplexing and the BONplex studies. The tool is open source and freely available for noncommercial use. HyperQuant is a highly valuable tool that will help in advancing the field of multiplexed quantitative proteomics.",
                "authors": [
                    {
                        "name": "Aggarwal S."
                    },
                    {
                        "name": "Kumar A."
                    },
                    {
                        "name": "Jamwal S."
                    },
                    {
                        "name": "Midha M.K."
                    },
                    {
                        "name": "Talukdar N.C."
                    },
                    {
                        "name": "Yadav A.K."
                    }
                ],
                "citationCount": 2,
                "date": "2020-05-19T00:00:00Z",
                "journal": "ACS Omega",
                "title": "HyperQuant - A Computational Pipeline for Higher Order Multiplexed Quantitative Proteomics"
            },
            "pmcid": "PMC7240821",
            "pmid": "32455206"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}