{
    "additionDate": "2020-01-14T09:21:16Z",
    "biotoolsCURIE": "biotools:ModelX",
    "biotoolsID": "ModelX",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "luis.serrano@crg.eu",
            "name": "Luis Serrano",
            "typeEntity": "Person"
        }
    ],
    "description": "Protein-assisted RNA fragment docking (RnaX) for modeling RNA-protein interactions using ModelX.\n\nModelX: A toolsuite for molecular modeling.\n\nModelX is a toolsuite for biomolecular modeling inspired on the assumption that Molecular Biology conformational landscape is huge but limited, and also on the fact that interactions between biological entities can be decomposed into small structural motifs that are recycled and reused by nature while shaping new relationships.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "RNA binding site prediction",
                    "uri": "http://edamontology.org/operation_3902"
                },
                {
                    "term": "RNA-binding protein prediction",
                    "uri": "http://edamontology.org/operation_3901"
                },
                {
                    "term": "DNA-binding protein prediction",
                    "uri": "http://edamontology.org/operation_3900"
                },
                {
                    "term": "Scaffolding",
                    "uri": "http://edamontology.org/operation_3216"
                },
                {
                    "term": "Protein-protein docking",
                    "uri": "http://edamontology.org/operation_3899"
                }
            ]
        }
    ],
    "homepage": "http://modelx.crg.es",
    "lastUpdate": "2020-12-29T09:56:57Z",
    "name": "ModelX",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1073/PNAS.1910999116",
            "metadata": {
                "abstract": "© 2019 National Academy of Sciences. All rights reserved.RNA–protein interactions are crucial for such key biological processes as regulation of transcription, splicing, translation, and gene silencing, among many others. Knowing where an RNA molecule interacts with a target protein and/or engineering an RNA molecule to specifically bind to a protein could allow for rational interference with these cellular processes and the design of novel therapies. Here we present a robust RNA–protein fragment pair-based method, termed RnaX, to predict RNA-binding sites. This methodology, which is integrated into the ModelX tool suite (http://modelx.crg.es), takes advantage of the structural information present in all released RNA–protein complexes. This information is used to create an exhaustive database for docking and a statistical forcefield for fast discrimination of true backbone-compatible interactions. RnaX, together with the protein design forcefield FoldX, enables us to predict RNA–protein interfaces and, when sufficient crystallographic information is available, to reengineer the interface at the sequence-specificity level by mimicking those conformational changes that occur on protein and RNA mutagenesis. These results, obtained at just a fraction of the computational cost of methods that simulate conformational dynamics, open up perspectives for the engineering of RNA–protein interfaces.",
                "authors": [
                    {
                        "name": "Blanco J.D."
                    },
                    {
                        "name": "Radusky L.G."
                    },
                    {
                        "name": "Cianferoni D."
                    },
                    {
                        "name": "Serrano L."
                    }
                ],
                "citationCount": 3,
                "date": "2019-12-03T00:00:00Z",
                "journal": "Proceedings of the National Academy of Sciences of the United States of America",
                "title": "Protein-assisted RNA fragment docking (RnaX) for modeling RNA–protein interactions using ModelX"
            },
            "pmcid": "PMC6900601",
            "pmid": "31732673"
        }
    ],
    "toolType": [
        "Suite"
    ],
    "topic": [
        {
            "term": "Molecular modelling",
            "uri": "http://edamontology.org/topic_2275"
        },
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ],
    "validated": 1
}