{
    "additionDate": "2022-11-06T12:31:50.594202Z",
    "biotoolsCURIE": "biotools:bio-soda",
    "biotoolsID": "bio-soda",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "ana-claudia.sima@sib.swiss",
            "name": "Ana Claudia Sima",
            "typeEntity": "Person"
        }
    ],
    "description": "Bio-SODA is a question answering system over domain knowledge graphs, such as scientific datasets, where training data (in the form of questions and corresponding SPARQL queries) is rare or unavailable.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                }
            ]
        }
    ],
    "homepage": "https://github.com/anazhaw/Bio-SODA",
    "language": [
        "Java",
        "JavaScript"
    ],
    "lastUpdate": "2022-11-06T12:31:50.596748Z",
    "license": "Apache-2.0",
    "name": "Bio-SODA",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1007/S10619-022-07414-W",
            "metadata": {
                "abstract": "© 2022, The Author(s).The problem of natural language processing over structured data has become a growing research field, both within the relational database and the Semantic Web community, with significant efforts involved in question answering over knowledge graphs (KGQA). However, many of these approaches are either specifically targeted at open-domain question answering using DBpedia, or require large training datasets to translate a natural language question to SPARQL in order to query the knowledge graph. Hence, these approaches often cannot be applied directly to complex scientific datasets where no prior training data is available. In this paper, we focus on the challenges of natural language processing over knowledge graphs of scientific datasets. In particular, we introduce Bio-SODA, a natural language processing engine that does not require training data in the form of question-answer pairs for generating SPARQL queries. Bio-SODA uses a generic graph-based approach for translating user questions to a ranked list of SPARQL candidate queries. Furthermore, Bio-SODA uses a novel ranking algorithm that includes node centrality as a measure of relevance for selecting the best SPARQL candidate query. Our experiments with real-world datasets across several scientific domains, including the official bioinformatics Question Answering over Linked Data (QALD) challenge, as well as the CORDIS dataset of European projects, show that Bio-SODA outperforms publicly available KGQA systems by an F1-score of least 20% and by an even higher factor on more complex bioinformatics datasets. Finally, we introduce Bio-SODA UX, a graphical user interface designed to assist users in the exploration of large knowledge graphs and in dynamically disambiguating natural language questions that target the data available in these graphs.",
                "authors": [
                    {
                        "name": "Anisimova M."
                    },
                    {
                        "name": "Dessimoz C."
                    },
                    {
                        "name": "Mendes de Farias T."
                    },
                    {
                        "name": "Robinson-Rechavi M."
                    },
                    {
                        "name": "Sima A.C."
                    },
                    {
                        "name": "Stockinger K."
                    },
                    {
                        "name": "Zbinden E."
                    }
                ],
                "date": "2022-09-01T00:00:00Z",
                "journal": "Distributed and Parallel Databases",
                "title": "Bio-SODA UX: enabling natural language question answering over knowledge graphs with user disambiguation"
            },
            "pmcid": "PMC9458692",
            "pmid": "36097541"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Natural language processing",
            "uri": "http://edamontology.org/topic_0218"
        },
        {
            "term": "Protein expression",
            "uri": "http://edamontology.org/topic_0108"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
