
{
    "credit": [
        {
            "email": "roslin.bioinformatics@roslin.ed.ac.uk",
            "name": "Roslin Bioinformatics",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://www.bioinformatics.roslin.ed.ac.uk/"
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://jensembl.sourceforge.net/"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Java"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Genomics",
                "uri": "http://edamontology.org/topic_0622"
            },
            {
                "term": "Data submission, annotation and curation",
                "uri": "http://edamontology.org/topic_0219"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://www.mybiosoftware.com/jensemb-1-18-java-api-ensembl-data-systems.html"
        }
    ],
    "publication": [
        {
            "abstract": "Motivation: The Ensembl Project provides release-specific Perl APIs for efficient high-level programmatic access to data stored in various Ensembl database schema. Although Perl scripts are perfectly suited for processing large volumes of text-based data, Perl is not ideal for developing large-scale software applications nor embedding in graphical interfaces. The provision of a novel Java API would facilitate type-safe, modular, object-orientated development of new Bioinformatics tools with which to access, analyse and visualize Ensembl data.Results: The JEnsembl API implementation provides basic data retrieval and manipulation functionality from the Core, Compara and Variation databases for all species in Ensembl and EnsemblGenomes and is a platform for the development of a richer API to Ensembl datasources. The JEnsembl architecture uses a text-based configuration module to provide evolving, versioned mappings from database schema to code objects. A single installation of the JEnsembl API can therefore simultaneously and transparently connect to current and previous database instances (such as those in the public archive) thus facilitating better analysis repeatability and allowing 'through time' comparative analyses to be performed. © 2012 The Author.",
            "authors": [
                "Paterson T.",
                "Law A."
            ],
            "cit_count": 2,
            "journal": "Bioinformatics",
            "pmid": "22945789",
            "title": "JEnsembl: A version-aware Java API to Ensembl data systems",
            "year": "2012-11-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:jensemb",
        "biotoolsID": "jensemb",
        "description": "Provides basic data retrieval and manipulation functionality from the Core, Compara and Variation databases for all species in Ensembl and EnsemblGenomes and is a platform for the development of a richer API to Ensembl datasources.",
        "homepage": "http://jensembl.sourceforge.net/",
        "name": "JEnsemb"
    }
}