{
    "additionDate": "2021-12-13T08:53:56.639846Z",
    "biotoolsCURIE": "biotools:tgx-ddi",
    "biotoolsID": "tgx-ddi",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "HL234@georgetown.edu",
            "name": "Heng-Hong Li",
            "orcidid": "https://orcid.org/0000-0001-5979-5141",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "TGx-DDI is a transcriptomic biomarker for genotoxicity hazard assessment of pharmaceuticals and environmental chemicals.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Gene expression profiling",
                    "uri": "http://edamontology.org/operation_0314"
                },
                {
                    "term": "Microarray probe design",
                    "uri": "http://edamontology.org/operation_0309"
                }
            ]
        }
    ],
    "homepage": "https://manticore.niehs.nih.gov/tgxddi/tool",
    "lastUpdate": "2021-12-13T08:53:56.643324Z",
    "name": "TGx-DDI",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.3389/FDATA.2019.00036",
            "metadata": {
                "abstract": "Copyright © 2019 Li, Yauk, Chen, Hyduke, Williams, Frötschl, Ellinger-Ziegelbauer, Pettit, Aubrecht and Fornace.Genotoxicity testing is an essential component of the safety assessment paradigm required by regulatory agencies world-wide for analysis of drug candidates, and environmental and industrial chemicals. Current genotoxicity testing batteries feature a high incidence of irrelevant positive findings—particularly for in vitro chromosomal damage (CD) assays. The risk management of compounds with positive in vitro findings is a major challenge and requires complex, time consuming, and costly follow-up strategies including animal testing. Thus, regulators are urgently in need of new testing approaches to meet legislated mandates. Using machine learning, we identified a set of transcripts that responds predictably to DNA-damage in human cells that we refer to as the TGx-DDI biomarker, which was originally referred to as TGx-28.65. We proposed to use this biomarker in conjunction with current genotoxicity testing batteries to differentiate compounds with irrelevant “false” positive findings in the in vitro CD assays from true DNA damaging agents (i.e., for de-risking agents that are clastogenic in vitro but not in vivo). We validated the performance of the TGx-DDI biomarker to identify true DNA damaging agents, assessed intra- and inter- laboratory reproducibility, and cross-platform performance. Recently, to augment the application of this biomarker, we developed a high-throughput cell-based genotoxicity testing system using the NanoString nCounter® technology. Here, we review the status of TGx-DDI development, its integration in the genotoxicity testing paradigm, and progress to date in its qualification at the US Food and Drug Administration (FDA) as a drug development tool. If successfully validated and implemented, the TGx-DDI biomarker assay is expected to significantly augment the current strategy for the assessment of genotoxic hazards for drugs and chemicals.",
                "authors": [
                    {
                        "name": "Aubrecht J."
                    },
                    {
                        "name": "Chen R."
                    },
                    {
                        "name": "Ellinger-Ziegelbauer H."
                    },
                    {
                        "name": "Fornace A.J."
                    },
                    {
                        "name": "Frotschl R."
                    },
                    {
                        "name": "Hyduke D.R."
                    },
                    {
                        "name": "Li H.-H."
                    },
                    {
                        "name": "Pettit S."
                    },
                    {
                        "name": "Williams A."
                    },
                    {
                        "name": "Yauk C.L."
                    }
                ],
                "citationCount": 5,
                "date": "2019-10-08T00:00:00Z",
                "journal": "Frontiers in Big Data",
                "title": "TGx-DDI, a Transcriptomic Biomarker for Genotoxicity Hazard Assessment of Pharmaceuticals and Environmental Chemicals"
            },
            "pmcid": "PMC7931968",
            "pmid": "33693359",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Desktop application",
        "Web application"
    ],
    "topic": [
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ]
}
