{
    "additionDate": "2020-01-14T09:29:34Z",
    "biotoolsCURIE": "biotools:VaDER",
    "biotoolsID": "VaDER",
    "confidence_flag": "medium",
    "credit": [
        {
            "email": "johann.dejong@ucb.com",
            "name": "Johann de Jong",
            "orcidid": "https://orcid.org/0000-0002-2097-0915",
            "typeEntity": "Person"
        },
        {
            "email": "frohlich@bit.uni-bonn.de",
            "name": "Holger Fröhlich",
            "orcidid": "https://orcid.org/0000-0002-5328-1243",
            "typeEntity": "Person"
        }
    ],
    "description": "Deep learning for clustering of multivariate clinical patient trajectories with missing values.\n\nDeep learning for clustering of multivariate short time series with potentially many missing values.\n\nThis repository contains code for a new method for clustering multivariate short time series with potentially many missing values (published here), a setting commonly encountered in the analysis of longitudinal clinical data, but generally still poorly addressed in the literature.\n\nSupporting code for the manuscript \"Deep learning for clustering of multivariate clinical patient trajectories with missing values\".\n\nSupporting code for the manuscript \"Deep learning for clustering of multivariate clinical patient trajectories with missing values\"",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Imputation",
                    "uri": "http://edamontology.org/operation_3557"
                },
                {
                    "term": "Parsing",
                    "uri": "http://edamontology.org/operation_1812"
                },
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                }
            ]
        }
    ],
    "homepage": "https://github.com/johanndejong/VaDER",
    "language": [
        "R",
        "Python"
    ],
    "lastUpdate": "2020-01-14T09:29:34Z",
    "license": "LGPL-2.1",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/johanndejong/VaDER_supporting_code"
        }
    ],
    "name": "VaDER",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/GIGASCIENCE/GIZ134",
            "metadata": {
                "abstract": "© The Author(s) 2019. Published by Oxford University Press.BACKGROUND: Precision medicine requires a stratification of patients by disease presentation that is sufficiently informative to allow for selecting treatments on a per-patient basis. For many diseases, such as neurological disorders, this stratification problem translates into a complex problem of clustering multivariate and relatively short time series because (i) these diseases are multifactorial and not well described by single clinical outcome variables and (ii) disease progression needs to be monitored over time. Additionally, clinical data often additionally are hindered by the presence of many missing values, further complicating any clustering attempts. FINDINGS: The problem of clustering multivariate short time series with many missing values is generally not well addressed in the literature. In this work, we propose a deep learning-based method to address this issue, variational deep embedding with recurrence (VaDER). VaDER relies on a Gaussian mixture variational autoencoder framework, which is further extended to (i) model multivariate time series and (ii) directly deal with missing values. We validated VaDER by accurately recovering clusters from simulated and benchmark data with known ground truth clustering, while varying the degree of missingness. We then used VaDER to successfully stratify patients with Alzheimer disease and patients with Parkinson disease into subgroups characterized by clinically divergent disease progression profiles. Additional analyses demonstrated that these clinical differences reflected known underlying aspects of Alzheimer disease and Parkinson disease. CONCLUSIONS: We believe our results show that VaDER can be of great value for future efforts in patient stratification, and multivariate time-series clustering in general.",
                "authors": [
                    {
                        "name": "de Jong J."
                    },
                    {
                        "name": "Emon M.A."
                    },
                    {
                        "name": "Wu P."
                    },
                    {
                        "name": "Karki R."
                    },
                    {
                        "name": "Sood M."
                    },
                    {
                        "name": "Godard P."
                    },
                    {
                        "name": "Ahmad A."
                    },
                    {
                        "name": "Vrooman H."
                    },
                    {
                        "name": "Hofmann-Apitius M."
                    },
                    {
                        "name": "Frohlich H."
                    }
                ],
                "citationCount": 2,
                "date": "2019-11-01T00:00:00Z",
                "journal": "GigaScience",
                "title": "Deep learning for clustering of multivariate clinical patient trajectories with missing values"
            },
            "pmcid": "PMC6857688",
            "pmid": "31730697"
        }
    ],
    "topic": [
        {
            "term": "Neurology",
            "uri": "http://edamontology.org/topic_3334"
        },
        {
            "term": "Geriatric medicine",
            "uri": "http://edamontology.org/topic_3399"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Personalised medicine",
            "uri": "http://edamontology.org/topic_3577"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        }
    ]
}