
{
    "credit": [
        {
            "email": "hsugwar@genes.nig.ac.jp",
            "name": "Hideaki Sugawara",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://www.tanpaku.org/autophagy/help/help.html"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Protein modelling",
                    "uri": "http://edamontology.org/operation_0477"
                },
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Protein function analysis",
                    "uri": "http://edamontology.org/operation_2414"
                },
                {
                    "term": "Protein feature detection",
                    "uri": "http://edamontology.org/operation_3092"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Database portal"
        ],
        "topic": [
            {
                "term": "Proteins",
                "uri": "http://edamontology.org/topic_0078"
            },
            {
                "term": "Structure analysis",
                "uri": "http://edamontology.org/topic_0081"
            },
            {
                "term": "Sequence analysis",
                "uri": "http://edamontology.org/topic_0080"
            }
        ]
    },
    "publication": [
        {
            "abstract": "Autophagy is a process of self-digestion generally observed in eukaryotes and has been shown to play crucial roles for survival under starvation and removal of deleterious substances. Despite great advances that have been made, many problems in mechanisms of autophagy remain unsolved. As a large number of autophagy-related proteins are identified in each species, a database that collects data, identifies their homologs in other species and makes them available will contribute to research advancement. As no such resources exist, we built the Autophagy database (http://tp-apg.genes.nig .ac.jp/autophagy) to provide basics, up-to-date information on relevant literature, and a list of autophagy-related proteins and their homologs in 41 eukaryotes. From the database, the user can search for proteins by keywords or sequences to obtain a wealth of data including functional and structural information and find possible functional homologs of proteins whose functions have been demonstrated in other species. As proteins that bind the phospholipid, phosphatidyl inositol 3-phosphate (PI3P) are essential for autophagy to proceed, we carried out an original analysis to identify probable PI3P-binding proteins, and made the list available from the database. The database is expected to give impetus to further research on autophagy by providing basic and specialized data on the subject. © The Author(s) 2010.",
            "authors": [
                "Homma K.",
                "Suzuki K.",
                "Sugawara H."
            ],
            "cit_count": 33,
            "journal": "Nucleic Acids Research",
            "pmid": "20972215",
            "title": "The autophagy database: An all-inclusive information resource on autophagy that provides nourishment for research",
            "year": "2011-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:the_autophagy_database",
        "biotoolsID": "the_autophagy_database",
        "description": "Database that provides basic, up-to-date information on relevant literature, and a list of autophagy-related proteins and their homologs. From the database, the user can search for proteins by keywords or sequences to obtain a wealth of data including functional and structural information and find possible functional homologs of proteins whose functions have been demonstrated in other species.",
        "homepage": "http://www.tanpaku.org/autophagy/",
        "name": "The Autophagy Database"
    }
}