{
    "additionDate": "2019-11-14T18:40:43Z",
    "biotoolsCURIE": "biotools:Genesis-indel",
    "biotoolsID": "Genesis-indel",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "lqzhang@vt.edu",
            "name": "Liqing Zhang",
            "typeEntity": "Person"
        }
    ],
    "description": "> LOW CONFIDENCE! | Uncovering missed indels by leveraging unmapped reads | Genesis-indel is a computational pipeline to explore the unmapped reads to identify novel mutations that are initially missed in the original alignment. The genes containing such mutations can be investigated to gain important biological insights",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Indel detection",
                    "uri": "http://edamontology.org/operation_0452"
                },
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                },
                {
                    "term": "Read mapping",
                    "uri": "http://edamontology.org/operation_3198"
                }
            ]
        }
    ],
    "homepage": "https://github.com/mshabbirhasan/Genesis-indel",
    "language": [
        "Python",
        "C"
    ],
    "lastUpdate": "2020-12-03T07:55:11Z",
    "license": "MIT",
    "name": "Genesis-indel",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1038/S41598-019-47405-Z",
            "metadata": {
                "abstract": "In current practice, Next Generation Sequencing (NGS) applications start with mapping/aligning short reads to the reference genome, with the aim of identifying genetic variants. Although existing alignment tools have shown great accuracy in mapping short reads to the reference genome, a significant number of short reads still remain unmapped and are often excluded from downstream analyses thereby causing nonnegligible information loss in the subsequent variant calling procedure. This paper describes Genesis-indel, a computational pipeline that explores the unmapped reads to identify novel indels that are initially missed in the original procedure. Genesis-indel is applied to the unmapped reads of 30 breast cancer patients from TCGA. Results show that the unmapped reads are conserved between the two subtypes of breast cancer investigated in this study and might contribute to the divergence between the subtypes. Genesis-indel identifies 72,997 novel high-quality indels previously not found, among which 16,141 have not been annotated in the widely used mutation database. Statistical analysis of these indels shows significant enrichment of indels residing in oncogenes and tumour suppressor genes. Functional annotation further reveals that these indels are strongly correlated with pathways of cancer and can have high to moderate impact on protein functions. Additionally, some of the indels overlap with the genes that do not have any indel mutations called from the originally mapped reads but have been shown to contribute to the tumorigenesis in multiple carcinomas, further emphasizing the importance of rescuing indels hidden in the unmapped reads in cancer and disease studies.",
                "authors": [
                    {
                        "name": "Hasan M.S."
                    },
                    {
                        "name": "Wu X."
                    },
                    {
                        "name": "Zhang L."
                    }
                ],
                "citationCount": 2,
                "date": "2019-07-31T00:00:00Z",
                "journal": "Scientific reports",
                "title": "Uncovering missed indels by leveraging unmapped reads"
            },
            "pmcid": "PMC6668410",
            "pmid": "31366961"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        }
    ],
    "validated": 1
}