{
    "additionDate": "2019-11-14T19:29:38Z",
    "biotoolsCURIE": "biotools:pseudoQC",
    "biotoolsID": "pseudoQC",
    "confidence_flag": "tool",
    "description": "A Regression-Based Simulation Software for Correction and Normalization of Complex Metabolomics and Proteomics Datasets | Regression-Based Simulation Applications for Correction and Normalization of Complex Metabolomics and Proteomics Datasets | Wang, Shisheng, and Hao Yang. \"pseudoQC: A Regression‐Based Simulation Software for Correction and Normalization of Complex Metabolomics and Proteomics Datasets.\" Proteomics (2019): 1900264. (DOI: 10.1002/pmic.201900264)",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Imputation",
                    "uri": "http://edamontology.org/operation_3557"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "https://www.omicsolution.org/wukong/pseudoQC/",
    "language": [
        "R",
        "JavaScript"
    ],
    "lastUpdate": "2020-12-10T11:15:47Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/qade544/pseudoQC"
        }
    ],
    "name": "pseudoQC",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1002/PMIC.201900264",
            "metadata": {
                "abstract": "© 2019 WILEY-VCH Verlag GmbH & Co. KGaA, WeinheimVarious types of unwanted and uncontrollable signal variations in MS-based metabolomics and proteomics datasets severely disturb the accuracies of metabolite and protein profiling. Therefore, pooled quality control (QC) samples are often employed in quality management processes, which are indispensable to the success of metabolomics and proteomics experiments, especially in high-throughput cases and long-term projects. However, data consistency and QC sample stability are still difficult to guarantee because of the experimental operation complexity and differences between experimenters. To make things worse, numerous proteomics projects do not take QC samples into consideration at the beginning of experimental design. Herein, a powerful and interactive web-based software, named pseudoQC, is presented to simulate QC sample data for actual metabolomics and proteomics datasets using four different machine learning-based regression methods. The simulated data are used for correction and normalization of the two published datasets, and the obtained results suggest that nonlinear regression methods perform better than linear ones. Additionally, the above software is available as a web-based graphical user interface and can be utilized by scientists without a bioinformatics background. pseudoQC is open-source software and freely available at https://www.omicsolution.org/wukong/pseudoQC/.",
                "authors": [
                    {
                        "name": "Wang S."
                    },
                    {
                        "name": "Yang H."
                    }
                ],
                "citationCount": 3,
                "date": "2019-10-01T00:00:00Z",
                "journal": "Proteomics",
                "title": "pseudoQC: A Regression-Based Simulation Software for Correction and Normalization of Complex Metabolomics and Proteomics Datasets"
            },
            "pmid": "31474000"
        }
    ],
    "topic": [
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        }
    ],
    "validated": 1
}