{
    "additionDate": "2017-12-18T00:13:06Z",
    "biotoolsCURIE": "biotools:sigma_align",
    "biotoolsID": "sigma_align",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.imsc.res.in/~rsidd/"
        }
    ],
    "description": "Alignment program with a new algorithm and scoring scheme designed specifically for non-coding DNA sequence.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://www.imsc.res.in/~rsidd/sigma/sigma_1.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Multiple alignment",
                    "uri": "http://edamontology.org/operation_0492"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Sequence alignment",
                    "uri": "http://edamontology.org/operation_0292"
                }
            ]
        }
    ],
    "homepage": "http://www.imsc.res.in/~rsidd/sigma/",
    "language": [
        "C"
    ],
    "lastUpdate": "2018-12-10T12:58:58Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/sigma-2-0-beta-non-coding-dna-sequence-alignment.html"
        }
    ],
    "name": "Sigma 2.0 BETA",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1186/1471-2105-7-143",
            "metadata": {
                "abstract": "Background: Existing tools for multiple-sequence alignment focus on aligning protein sequence or protein-coding DNA sequence, and are often based on extensions to Needleman-Wunsch-like pairwise alignment methods. We introduce a new tool, Sigma, with a new algorithm and scoring scheme designed specifically for non-coding DNA sequence. This problem acquires importance with the increasing number of published sequences of closely-related species. In particular, studies of gene regulation seek to take advantage of comparative genomics, and recent algorithms for finding regulatory sites in phylogenetically-related intergenic sequence require alignment as a preprocessing step. Much can also be learned about evolution from intergenic DNA, which tends to evolve faster than coding DNA. Sigma uses a strategy of seeking the best possible gapless local alignments (a strategy earlier used by DiAlign), at each step making the best possible alignment consistent with existing alignments, and scores the significance of the alignment based on the lengths of the aligned fragments and a background model which may be supplied or estimated from an auxiliary file of intergenic DNA. Results: Comparative tests of sigma with five earlier algorithms on synthetic data generated to mimic real data show excellent performance, with Sigma balancing high \"sensitivity\" (more bases aligned) with effective filtering of \"incorrect\" alignments. With real data, while \"correctness\" can't be directly quantified for the alignment, running the PhyloGibbs motif finder on pre-aligned sequence suggests that Sigma's alignments are superior. Conclusion: By taking into account the peculiarities of non-coding DNA, Sigma fills a gap in the toolbox of bioinformatics. © 2006 Siddharthan; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Siddharthan R."
                    }
                ],
                "citationCount": 20,
                "date": "2006-03-16T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Sigma: Multiple alignment of weakly-conserved non-coding DNA sequence"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Comparative genomics",
            "uri": "http://edamontology.org/topic_0797"
        },
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Gene regulation",
            "uri": "http://edamontology.org/topic_0204"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Studies",
            "uri": "http://edamontology.org/topic_3678"
        }
    ],
    "validated": 1
}
