{
    "additionDate": "2021-09-27T07:11:18.070359Z",
    "biotoolsCURIE": "biotools:hyperbeta",
    "biotoolsID": "hyperbeta",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "daniela.besozzi@unimib.it",
            "name": "Daniela Besozzi",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "fabrizio.gelain@unimib.it",
            "name": "Fabrizio Gelain",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "HyperBeta is a tool for the automatic identification and visualization of beta-structures in molecular dynamics files produced using the MARTINI force field. HyperBeta explots graph theory to identify the beta sheets, and was specifically designed to investigate the emergence of regular structures and patterns in self-assembly polypeptides.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                },
                {
                    "term": "Molecular dynamics",
                    "uri": "http://edamontology.org/operation_2476"
                },
                {
                    "term": "Simulation analysis",
                    "uri": "http://edamontology.org/operation_0244"
                }
            ]
        }
    ],
    "homepage": "https://github.com/aresio/hyperbeta",
    "language": [
        "C++",
        "Python"
    ],
    "lastUpdate": "2021-09-27T07:11:18.072854Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/aresio/hyperbeta/issues"
        }
    ],
    "name": "HyperBeta",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1038/S41598-021-87087-0",
            "metadata": {
                "abstract": "© 2021, The Author(s).Self-assembling processes are ubiquitous phenomena that drive the organization and the hierarchical formation of complex molecular systems. The investigation of assembling dynamics, emerging from the interactions among biomolecules like amino-acids and polypeptides, is fundamental to determine how a mixture of simple objects can yield a complex structure at the nano-scale level. In this paper we present HyperBeta, a novel open-source software that exploits an innovative algorithm based on hyper-graphs to efficiently identify and graphically represent the dynamics of β-sheets formation. Differently from the existing tools, HyperBeta directly manipulates data generated by means of coarse-grained molecular dynamics simulation tools (GROMACS), performed using the MARTINI force field. Coarse-grained molecular structures are visualized using HyperBeta ’s proprietary real-time high-quality 3D engine, which provides a plethora of analysis tools and statistical information, controlled by means of an intuitive event-based graphical user interface. The high-quality renderer relies on a variety of visual cues to improve the readability and interpretability of distance and depth relationships between peptides. We show that HyperBeta is able to track the β-sheets formation in coarse-grained molecular dynamics simulations, and provides a completely new and efficient mean for the investigation of the kinetics of these nano-structures. HyperBeta will therefore facilitate biotechnological and medical research where these structural elements play a crucial role, such as the development of novel high-performance biomaterials in tissue engineering, or a better comprehension of the molecular mechanisms at the basis of complex pathologies like Alzheimer’s disease.",
                "authors": [
                    {
                        "name": "Nobile M.S."
                    },
                    {
                        "name": "Fontana F."
                    },
                    {
                        "name": "Manzoni L."
                    },
                    {
                        "name": "Cazzaniga P."
                    },
                    {
                        "name": "Mauri G."
                    },
                    {
                        "name": "Saracino G.A.A."
                    },
                    {
                        "name": "Besozzi D."
                    },
                    {
                        "name": "Gelain F."
                    }
                ],
                "date": "2021-12-01T00:00:00Z",
                "journal": "Scientific Reports",
                "title": "HyperBeta: characterizing the structural dynamics of proteins and self-assembling peptides"
            },
            "pmcid": "PMC8032683",
            "pmid": "33833280",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Molecular dynamics",
            "uri": "http://edamontology.org/topic_0176"
        },
        {
            "term": "Biomaterials",
            "uri": "http://edamontology.org/topic_3368"
        },
        {
            "term": "NMR",
            "uri": "http://edamontology.org/topic_0593"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        }
    ]
}