{
    "additionDate": "2016-11-28T10:07:17Z",
    "biotoolsCURIE": "biotools:edia",
    "biotoolsID": "edia",
    "collectionID": [
        "de.NBI",
        "COVID-19"
    ],
    "cost": "Free of charge",
    "credit": [
        {
            "name": "University of Hamburg - Center for Bioinformatics",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        },
        {
            "email": "rarey-office@zbh.uni-hamburg.de",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Easily interpretable electron density score for individual atoms. It quantifies the electron density support of each single atom by computing a weighted sum over an oversampled electron density grid in the proximity of the atom. Atomic EDIA values can also be combined with the help of the power mean to compute EDIA_m, an electron density score for small molecules, fragments, or residues.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://proteinsplus.zbh.uni-hamburg.de/help/index"
        }
    ],
    "editPermission": {
        "authors": [
            "Bietz"
        ],
        "type": "group"
    },
    "elixirCommunity": [
        "3D-BioInfo"
    ],
    "elixirNode": [
        "Germany"
    ],
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Protein structure",
                        "uri": "http://edamontology.org/data_1460"
                    },
                    "format": [
                        {
                            "term": "PDB",
                            "uri": "http://edamontology.org/format_1476"
                        }
                    ]
                },
                {
                    "data": {
                        "term": "Protein-ligand complex",
                        "uri": "http://edamontology.org/data_1461"
                    },
                    "format": [
                        {
                            "term": "PDB",
                            "uri": "http://edamontology.org/format_1476"
                        }
                    ]
                }
            ],
            "note": "Score for structure quality assessment on a global or atomistic level",
            "operation": [
                {
                    "term": "Protein model validation",
                    "uri": "http://edamontology.org/operation_0321"
                },
                {
                    "term": "Protein structure analysis",
                    "uri": "http://edamontology.org/operation_2406"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Score",
                        "uri": "http://edamontology.org/data_1772"
                    }
                }
            ]
        }
    ],
    "homepage": "http://proteinsplus.zbh.uni-hamburg.de/#edia",
    "lastUpdate": "2020-06-08T14:33:03.386118Z",
    "name": "EDIA",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "stierand",
    "publication": [
        {
            "doi": "10.1021/acs.jcim.7b00391",
            "metadata": {
                "abstract": "© 2017 American Chemical Society.Macromolecular structures resolved by X-ray crystallography are essential for life science research. While some methods exist to automatically quantify the quality of the electron density fit, none of them is without flaws. Especially the question of how well individual parts like atoms, small fragments, or molecules are supported by electron density is difficult to quantify. While taking experimental uncertainties correctly into account, they do not offer an answer on how reliable an individual atom position is. A rapid quantification of this atomic position reliability would be highly valuable in structure-based molecular design. To overcome this limitation, we introduce the electron density score EDIA for individual atoms and molecular fragments. EDIA assesses rapidly, automatically, and intuitively the fit of individual as well as multiple atoms (EDIAm) into electron density accompanied by an integrated error analysis. The computation is based on the standard 2fo - fc electron density map in combination with the model of the molecular structure. For evaluating partial structures, EDIAm shows significant advantages compared to the real-space R correlation coefficient (RSCC) and the real-space difference density Z score (RSZD) from the molecular modeler's point of view. Thus, EDIA abolishes the time-consuming step of visually inspecting the electron density during structure selection and curation. It supports daily modeling tasks of medicinal and computational chemists and enables a fully automated assembly of large-scale, high-quality structure data sets. Furthermore, EDIA scores can be applied for model validation and method development in computer-aided molecular design. In contrast to measuring the deviation from the structure model by root-mean-squared deviation, EDIA scores allow comparison to the underlying experimental data taking its uncertainty into account.",
                "authors": [
                    {
                        "name": "Meyder A."
                    },
                    {
                        "name": "Nittinger E."
                    },
                    {
                        "name": "Lange G."
                    },
                    {
                        "name": "Klein R."
                    },
                    {
                        "name": "Rarey M."
                    }
                ],
                "citationCount": 22,
                "date": "2017-10-23T00:00:00Z",
                "journal": "Journal of Chemical Information and Modeling",
                "title": "Estimating Electron Density Support for Individual Atoms and Molecular Fragments in X-ray Structures"
            },
            "pmid": "28981269",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Structure analysis",
            "uri": "http://edamontology.org/topic_0081"
        },
        {
            "term": "X-ray diffraction",
            "uri": "http://edamontology.org/topic_2828"
        }
    ],
    "validated": 1
}