{"credit":[{"email":"sstructview@smi.stanford.edu","name":"SStructView Support","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"https://www.ctu.edu.vn/~dvxe/Bioinformatic/Software/BIT%20Software/docs.html"}],"function":[{"operation":[{"term":"RNA secondary structure prediction","uri":"http://edamontology.org/operation_0278"},{"term":"Structure visualisation","uri":"http://edamontology.org/operation_0570"},{"term":"RNA secondary structure alignment","uri":"http://edamontology.org/operation_0502"},{"term":"RNA secondary structure analysis","uri":"http://edamontology.org/operation_2439"}]}],"labels":{"language":["Java"],"operatingSystem":["Linux","Windows","Mac"],"toolType":["Web application"],"topic":[{"term":"RNA","uri":"http://edamontology.org/topic_0099"},{"term":"Nucleic acid structure analysis","uri":"http://edamontology.org/topic_0097"},{"term":"Structure prediction","uri":"http://edamontology.org/topic_0082"},{"term":"Protein secondary structure","uri":"http://edamontology.org/topic_3542"},{"term":"Molecular interactions, pathways and networks","uri":"http://edamontology.org/topic_0602"}]},"publication":[{"abstract":"The dissemination of biological information has become critically dependent on the Internet and World Wide Web (WWW), which enable distributed access to information in a platform independent manner. The mode of interaction between biologists and on-line information resources, however, has been mostly limited to simple interface technologies such has hypertext links, tables and forms. The introduction of platform-independent runtime environments facilitates the development of more sophisticated WWW-based user interfaces. Until recently, most such interfaces have been tightly coupled to the underlying computation engines, and not separated as reusable components. We believe that many subdisciplines of biology have intuitive and familiar graphical representations of knowledge that can serve as multipurpose user interface elements. We call such graphical idioms 'domain graphics'. In order to illustrate the power of such graphics, we have built a reusable interface based on the standard two dimensional (2D) layout of RNA secondary structure. The interface can be used to represent any pre-computed layout of RNA, and takes as a parameters the sets of actions to be performed as a user interacts with the interface. It can provide to any associated application program information about the base, helix, or subsequence selected by the user. We show the versatility of this interface by using it as a special purpose interface to BLAST, Medline and the RNA MFOLD search/compute engines.","authors":["Felciano R.M.","Chen R.O.","Altman R.B."],"cit_count":7,"journal":"Gene","pmid":"9197551","title":"RNA secondary structure as a reusable interface to biological information resources","year":"1997-06-07"}],"summary":{"biotoolsCURIE":"biotools:sstructview","biotoolsID":"sstructview","description":"RNA secondary structure viewer applet; must be integrated into web page to be implemented; can link to multiple computational backends.","homepage":"https://www.ctu.edu.vn/~dvxe/Bioinformatic/Software/BIT%20Software/home.html","name":"SStructView"}}