
{
    "credit": [
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Pairwise sequence alignment",
                    "uri": "http://edamontology.org/operation_0491"
                },
                {
                    "term": "Multiple structure alignment",
                    "uri": "http://edamontology.org/operation_0504"
                },
                {
                    "term": "Pairwise structure alignment",
                    "uri": "http://edamontology.org/operation_0503"
                },
                {
                    "term": "Global structure alignment",
                    "uri": "http://edamontology.org/operation_0510"
                }
            ]
        }
    ],
    "labels": {
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Protein structure analysis",
                "uri": "http://edamontology.org/topic_2814"
            },
            {
                "term": "Structure prediction",
                "uri": "http://edamontology.org/topic_0082"
            },
            {
                "term": "Proteins",
                "uri": "http://edamontology.org/topic_0078"
            },
            {
                "term": "Nucleic acid structure analysis",
                "uri": "http://edamontology.org/topic_0097"
            }
        ]
    },
    "publication": [
        {
            "abstract": "We have developed a new algorithm for the alignment of multiple protein structures based on a Monte Carlo optimization technique. The algorithm uses pair-wise structural alignments as a starting point. Four different types of moves were designed to generate random changes in the alignment. A distance-based score is calculated for each trial move and moves are accepted or rejected based on the improvement in the alignment score until the alignment is converged. Initial tests on 66 protein structural families show promising results, the score increases by 69% on average. The increase in score is accompanied by an increase (12%) in the number of residue positions incorporated into the alignment. Two specific families, protein kinases and aspartic proteinases were tested and compared against curated alignments from HOMSTRAD and manual alignments. This algorithm has improved the overall number of aligned residues while preserving key catalytic residues. Further refinement of the method and its application to generate multiple alignments for all protein families in the PDB, is currently in progress.",
            "authors": [
                "Guda C.",
                "Scheeff E.D.",
                "Bourne P.E.",
                "Shindyalov I.N."
            ],
            "cit_count": 56,
            "journal": "Pacific Symposium on Biocomputing. Pacific Symposium on Biocomputing",
            "pmid": "11262947",
            "title": "A new algorithm for the alignment of multiple protein structures using Monte Carlo optimization.",
            "year": "2001-01-01"
        },
        {
            "abstract": "CE-MC server (http://cemc.sdsc.edu) provides a web-based facility for the alignment of multiple protein structures based on C-α coordinate distances, using combinatorial extension (CE) and Monte Carlo (MC) optimization methods. Alignments are possible for user-selected PDB (Protein Data Bank) chains as well as for user-uploaded structures or the combination of the two. The whole process of generating multiple structure alignments involves three distinct steps, i.e. all-to-all pairwise alignment using the CE algorithm, iterative global optimization of a multiple alignment using the MC algorithm and formatting MC results using the JOY program. The server can be used to get multiple alignments for up to 25 protein structural chains with the flexibility of uploading multiple coordinate files and performing multiple structure alignment for user-selected PDB chains. For large-scale jobs and local installation of the CE-MC program, users can download the source code and precompiled binaries from the web server. © Oxford University Press 2004; all rights reserved.",
            "authors": [
                "Guda C.",
                "Lu S.",
                "Scheeff E.D.",
                "Bourne P.E.",
                "Shindyalov I.N."
            ],
            "cit_count": 89,
            "journal": "Nucleic Acids Research",
            "pmid": "15215359",
            "title": "CE-MC: A multiple protein structure alignment server",
            "year": "2004-07-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:ce-mc",
        "biotoolsID": "ce-mc",
        "description": "A multiple protein structure alignment server which creates an all-to-all pairwise alignment using a combinatorial extension program and then using Monte Carlo optimization methods conducts an iterative global optimization.  Results are formatted using JOY.",
        "homepage": "http://bioinformatics.albany.edu/~cemc/",
        "name": "CE-MC"
    }
}