{
    "additionDate": "2020-01-14T09:36:40Z",
    "biotoolsCURIE": "biotools:SRHR",
    "biotoolsID": "SRHR",
    "confidence_flag": "medium",
    "description": "A Package of Sexual and Reproductive Health and Rights Interventions-What Does It Mean for Adolescents?.\n\nThis article analyzes the relevance of the comprehensive definition of sexual and reproductive health and rights (SRHR) to adolescents and identifies adolescent-specific implications for the implementation of an essential package of SRHR interventions. The delivery of a comprehensive approach to SRHR targeting adolescents is underpinned by five principles-equity, quality, accountability, multisectorality, and meaningful engagement. All SRHR interventions included in the package are relevant to adolescents, given the diversity of adolescents' SRHR needs and considering their specific attributes, circumstances, and experiences.\n\n||| HOMEPAGE MISSING!",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://www.ncbi.nlm.nih.gov/pubmed/?term=31761003",
    "lastUpdate": "2020-01-14T09:36:40Z",
    "name": "SRHR",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1016/J.JADOHEALTH.2019.09.014",
            "metadata": {
                "abstract": "© 2019This article analyzes the relevance of the comprehensive definition of sexual and reproductive health and rights (SRHR) to adolescents and identifies adolescent-specific implications for the implementation of an essential package of SRHR interventions. The delivery of a comprehensive approach to SRHR targeting adolescents is underpinned by five principles—equity, quality, accountability, multisectorality, and meaningful engagement. All SRHR interventions included in the package are relevant to adolescents, given the diversity of adolescents' SRHR needs and considering their specific attributes, circumstances, and experiences. Ensuring that this package is available, accessible, and acceptable to adolescents requires an approach that looks at adolescents as being biologically and socially distinct from other age groups and acknowledges that they face some specific barriers when accessing SRHR services. This article provides cross-cutting strategies for the implementation of a comprehensive approach to SRHR for adolescents and specific considerations in delivering each intervention in the package of essential SRHR interventions. To further implement the International Conference on Population and Development Programme of Action, a prerequisite for achieving the Sustainable Development Goals, SRHR interventions must be adolescent responsive, delivered through multiple platforms, leveraging multisectoral collaboration, and strengthening accountability and participation.",
                "authors": [
                    {
                        "name": "Engel D.M.C."
                    },
                    {
                        "name": "Paul M."
                    },
                    {
                        "name": "Chalasani S."
                    },
                    {
                        "name": "Gonsalves L."
                    },
                    {
                        "name": "Ross D.A."
                    },
                    {
                        "name": "Chandra-Mouli V."
                    },
                    {
                        "name": "Cole C.B."
                    },
                    {
                        "name": "de Carvalho Eriksson C."
                    },
                    {
                        "name": "Hayes B."
                    },
                    {
                        "name": "Philipose A."
                    },
                    {
                        "name": "Beadle S."
                    },
                    {
                        "name": "Ferguson B.J."
                    }
                ],
                "citationCount": 3,
                "date": "2019-12-01T00:00:00Z",
                "journal": "Journal of Adolescent Health",
                "title": "A Package of Sexual and Reproductive Health and Rights Interventions—What Does It Mean for Adolescents?"
            },
            "pmid": "31761003"
        }
    ],
    "topic": [
        {
            "term": "Reproductive health",
            "uri": "http://edamontology.org/topic_3420"
        },
        {
            "term": "Gynaecology and obstetrics",
            "uri": "http://edamontology.org/topic_3411"
        },
        {
            "term": "Paediatrics",
            "uri": "http://edamontology.org/topic_3418"
        },
        {
            "term": "Urology and nephrology",
            "uri": "http://edamontology.org/topic_3422"
        },
        {
            "term": "Tropical medicine",
            "uri": "http://edamontology.org/topic_3575"
        }
    ]
}