{
    "additionDate": "2018-06-04T19:17:14Z",
    "biotoolsCURIE": "biotools:deuterater",
    "biotoolsID": "deuterater",
    "collectionID": [
        "Proteomics"
    ],
    "credit": [
        {
            "email": "jcprice@chem.byu.edu",
            "name": "John C. Price",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Quantifying peptide isotope precision and kinetic proteomics.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://github.com/JC-Price/DeuteRater/blob/master/DeuteRater%20Instruction%20Manual.docx"
        }
    ],
    "editPermission": {
        "authors": [
            "proteomics.bio.tools"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Isotope-coded protein label",
                    "uri": "http://edamontology.org/operation_3705"
                }
            ]
        }
    ],
    "homepage": "https://github.com/JC-Price/DeuteRater",
    "language": [
        "Python"
    ],
    "lastUpdate": "2019-03-26T08:15:32Z",
    "name": "DeuteRater",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btx009",
            "metadata": {
                "abstract": "© The Author 2017.Motivation: Using mass spectrometry to measure the concentration and turnover of the individual proteins in a proteome, enables the calculation of individual synthesis and degradation rates for each protein. Software to analyze concentration is readily available, but software to analyze turnover is lacking. Data analysis workflows typically don't access the full breadth of information about instrument precision and accuracy that is present in each peptide isotopic envelope measurement. This method utilizes both isotope distribution and changes in neutromer spacing, which benefits the analysis of both concentration and turnover. Results: We have developed a data analysis tool, DeuteRater, to measure protein turnover from metabolic D2O labeling. DeuteRater uses theoretical predictions for label-dependent change in isotope abundance and inter-peak (neutromer) spacing within the isotope envelope to calculate protein turnover rate. We have also used these metrics to evaluate the accuracy and precision of peptide measurements and thereby determined the optimal data acquisition parameters of different instruments, as well as the effect of data processing steps. We show that these combined measurements can be used to remove noise and increase confidence in the protein turnover measurement for each protein. Availability and Implementation: Source code and ReadMe for Python 2 and 3 versions of DeuteRater are available at https://github.com/JC-Price/DeuteRater. Data is at https://chorusproject. org/pages/index.HTML project number 1147. Critical Intermediate calculation files provided as Tables S3 and S4. Software has only been tested on Windows machines .",
                "authors": [
                    {
                        "name": "Hannemann A."
                    },
                    {
                        "name": "Herring A."
                    },
                    {
                        "name": "Lofthouse S."
                    },
                    {
                        "name": "Naylor B.C."
                    },
                    {
                        "name": "Piccolo S.R."
                    },
                    {
                        "name": "Porter M.T."
                    },
                    {
                        "name": "Price J.C."
                    },
                    {
                        "name": "Rockwood A.L."
                    },
                    {
                        "name": "Wilson E."
                    }
                ],
                "citationCount": 20,
                "date": "2017-05-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "DeuteRater: A tool for quantifying peptide isotope precision and kinetic proteomics"
            }
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        }
    ],
    "validated": 1
}
