{
    "additionDate": "2021-06-14T13:21:32Z",
    "biotoolsCURIE": "biotools:addictgene",
    "biotoolsID": "addictgene",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "zhaomei@psych.ac.cn",
            "name": "Mei Zhao",
            "typeEntity": "Person"
        }
    ],
    "description": "AddictGene is an integrated knowledge base for differentially expressed genes associated with psychostimulants,",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://159.226.67.237/sun/addictgedb/welcome/tutorial.html"
        }
    ],
    "download": [
        {
            "type": "Biological data",
            "url": "http://159.226.67.237/sun/addictgedb/welcome/download.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                },
                {
                    "term": "Differential gene expression profiling",
                    "uri": "http://edamontology.org/operation_3223"
                },
                {
                    "term": "Gene functional annotation",
                    "uri": "http://edamontology.org/operation_3672"
                }
            ]
        }
    ],
    "homepage": "http://159.226.67.237/sun/addictgedb/",
    "lastUpdate": "2021-08-09T10:53:00Z",
    "name": "AddictGene",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1016/J.CSBJ.2021.04.027",
            "metadata": {
                "abstract": "© 2021 The AuthorsAddiction, a disorder of maladaptive brain plasticity, is associated with changes in numerous gene expressions. Nowadays, high-throughput sequencing data on addictive substance-induced gene expression have become widely available. A resource for comprehensive annotation of genes that show differential expression in response to commonly abused substances is necessary. So, we developed AddictGene by integrating gene expression, gene-gene interaction, gene-drug interaction and epigenetic regulatory annotation for over 70,156 items of differentially expressed genes associated with 7 commonly abused substances, including alcohol, nicotine, cocaine, morphine, heroin, methamphetamine, and amphetamine, across three species (human, mouse, rat). We also collected 1,141 addiction-related experimentally validated genes by techniques such as RT-PCR, northern blot and in situ hybridization. The easy-to-use web interface of AddictGene (http://159.226.67.237/sun/addictgedb/) allows users to search and browse multidimensional data on DEGs of their interest: 1) detailed gene-specific information extracted from the original studies; 2) basic information about the specific gene extracted from NCBI; 3) SNP associated with substance dependence and other psychiatry disorders; 4) expression alteration of specific gene in other psychiatric disorders; 5) expression patterns of interested gene across 31 primary and 54 secondary human tissues; 6) functional annotation of interested gene; 7) epigenetic regulators involved in the alteration of specific genes, including histone modifications and DNA methylation; 8) protein–protein interaction for functional linkage with interested gene; 9) drug-gene interaction for potential druggability. AddictGene offers a valuable repository for researchers to study the molecular mechanisms underlying addiction, and might provide valuable insights into potential therapies for drug abuse and relapse.",
                "authors": [
                    {
                        "name": "Du Q."
                    },
                    {
                        "name": "Li C."
                    },
                    {
                        "name": "Shi L."
                    },
                    {
                        "name": "Wang Y."
                    },
                    {
                        "name": "Zhang K."
                    },
                    {
                        "name": "Zhao M."
                    }
                ],
                "date": "2021-01-01T00:00:00Z",
                "journal": "Computational and Structural Biotechnology Journal",
                "title": "AddictGene: An integrated knowledge base for differentially expressed genes associated with addictive substance"
            },
            "pmcid": "PMC8113760",
            "pmid": "34025933"
        }
    ],
    "toolType": [
        "Database portal",
        "Web application"
    ],
    "topic": [
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "Psychiatry",
            "uri": "http://edamontology.org/topic_3419"
        }
    ]
}
