{"credit":[{"typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://tango.crg.es/support.jsp"}],"documentation":[{"type":"GENERAL","url":"http://tango.crg.es/Tango_Handbook.pdf"}],"function":[{"operation":[{"term":"Protein sequence analysis","uri":"http://edamontology.org/operation_2479"},{"term":"Protein structure prediction","uri":"http://edamontology.org/operation_0474"}]}],"labels":{"operatingSystem":["Linux","Windows"],"toolType":["Command-line tool"],"topic":[{"term":"Proteins","uri":"http://edamontology.org/topic_0078"},{"term":"Protein sites, features and motifs","uri":"http://edamontology.org/topic_3510"},{"term":"Structure analysis","uri":"http://edamontology.org/topic_0081"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/tango-2-3-1-prediction-b-sheet-aggregation-unfolded-polypeptide-chains.html"}],"publication":[{"abstract":"We have developed a statistical mechanics algorithm, TANGO, to predict protein aggregation. TANGO is based on the physico-chemical principles of β-sheet formation, extended by the assumption that the core regions of an aggregate are fully buried. Our algorithm accurately predicts the aggregation of a data set of 179 peptides compiled from the literature as well as of a new set of 71 peptides derived from human disease-related proteins, including prion protein, lysozyme and β2-microglobulin. TANGO also correctly predicts pathogenic as well as protective mutations of the Alzheimer β-peptide, human lysozyme and transthyretin, and discriminates between β-sheet propensity and aggregation. Our results confirm the model of intermolecular β-sheet formation as a widespread underlying mechanism of protein aggregation. Furthermore, the algorithm opens the door to a fully automated, sequence-based design strategy to improve the aggregation properties of proteins of scientific or industrial interest.","authors":["Fernandez-Escamilla A.-M.","Rousseau F.","Schymkowitz J.","Serrano L."],"cit_count":865,"journal":"Nature Biotechnology","pmid":"15361882","title":"Prediction of sequence-dependent and mutational effects on the aggregation of peptides and proteins","year":"2004-10-01"}],"summary":{"biotoolsCURIE":"biotools:tango","biotoolsID":"tango","description":"A computer algorithm for prediction of aggregating regions in unfolded polypeptide chains. The model used here, is designed to predict cross-beta aggregation in peptides and denatured proteins and consists of a phase-space encompassing the random coil and 4 possible structural states: beta-turn, alpha-helix, beta-sheet aggregation and alpha-helical aggregation.","homepage":"http://tango.crg.es/","name":"Tango"}}