{
    "accessibility": "Open access",
    "additionDate": "2024-01-10T13:38:55.936918Z",
    "biotoolsCURIE": "biotools:scs",
    "biotoolsID": "scs",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "zivbj@cs.cmu.edu",
            "name": "Ziv Bar-Joseph",
            "typeEntity": "Person"
        },
        {
            "name": "Dongshunyi Li",
            "typeEntity": "Person"
        },
        {
            "name": "Hao Chen",
            "typeEntity": "Person"
        }
    ],
    "description": "Subcellular spatial transcriptomics cell segmentation (SCS), which combines imaging data with sequencing data to improve cell segmentation accuracy. SCS assigns spots to cells by adaptively learning the position of each spot relative to the center of its cell using a transformer neural network.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene expression profiling",
                    "uri": "http://edamontology.org/operation_0314"
                },
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                }
            ]
        }
    ],
    "homepage": "https://github.com/chenhcs/SCS",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T14:22:12.261922Z",
    "license": "MIT",
    "name": "SCS",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1038/s41592-023-01939-3",
            "metadata": {
                "abstract": "Spatial transcriptomics promises to greatly improve our understanding of tissue organization and cell–cell interactions. While most current platforms for spatial transcriptomics only offer multi-cellular resolution, with 10–15 cells per spot, recent technologies provide a much denser spot placement leading to subcellular resolution. A key challenge for these newer methods is cell segmentation and the assignment of spots to cells. Traditional image-based segmentation methods are limited and do not make full use of the information profiled by spatial transcriptomics. Here we present subcellular spatial transcriptomics cell segmentation (SCS), which combines imaging data with sequencing data to improve cell segmentation accuracy. SCS assigns spots to cells by adaptively learning the position of each spot relative to the center of its cell using a transformer neural network. SCS was tested on two new subcellular spatial transcriptomics technologies and outperformed traditional image-based segmentation methods. SCS achieved better accuracy, identified more cells and provided more realistic cell size estimation. Subcellular analysis of RNAs using SCS spot assignments provides information on RNA localization and further supports the segmentation results.",
                "authors": [
                    {
                        "name": "Bar-Joseph Z."
                    },
                    {
                        "name": "Chen H."
                    },
                    {
                        "name": "Li D."
                    }
                ],
                "citationCount": 14,
                "date": "2023-08-01T00:00:00Z",
                "journal": "Nature Methods",
                "title": "SCS: cell segmentation for high-resolution spatial transcriptomics"
            },
            "pmid": "37429992"
        }
    ],
    "toolType": [
        "Workflow"
    ],
    "topic": [
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ]
}
