{
    "additionDate": "2024-06-19T06:24:14.004429Z",
    "biotoolsCURIE": "biotools:pcgima",
    "biotoolsID": "pcgima",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "zhangle06@scu.edu.cn",
            "name": "Le Zhang",
            "typeEntity": "Person"
        }
    ],
    "description": "Developing the web server for human position-defined CpG islands methylation analysis.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                },
                {
                    "term": "Methylation analysis",
                    "uri": "http://edamontology.org/operation_3204"
                },
                {
                    "term": "PTM site prediction",
                    "uri": "http://edamontology.org/operation_0417"
                },
                {
                    "term": "Promoter prediction",
                    "uri": "http://edamontology.org/operation_0440"
                }
            ]
        }
    ],
    "homepage": "http://www.combio-lezhang.online/pcgima/home.html",
    "lastUpdate": "2024-06-19T06:24:14.009858Z",
    "name": "PCGIMA",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.3389/fgene.2024.1367731",
            "metadata": {
                "abstract": "Introduction: CpG island (CGI) methylation is one of the key epigenomic mechanisms for gene expression regulation and chromosomal integrity. However, classical CGI prediction methods are neither easy to locate those short and position-sensitive CGIs (CpG islets), nor investigate genetic and expression pattern for CGIs under different CpG position- and interval- sensitive parameters in a genome-wide perspective. Therefore, it is urgent for us to develop such a bioinformatic algorithm that not only can locate CpG islets, but also provide CGI methylation site annotation and functional analysis to investigate the regulatory mechanisms for CGI methylation. Methods: This study develops Human position-defined CGI prediction method to locate CpG islets using high performance computing, and then builds up a novel human genome annotation and analysis method to investigate the connections among CGI, gene expression and methylation. Finally, we integrate these functions into PCGIMA to provide relevant online computing and visualization service. Results: The main results include: (1) Human position-defined CGI prediction method is more efficient to predict position-defined CGIs with multiple consecutive (d) values and locate more potential short CGIs than previous CGI prediction methods. (2) Our annotation and analysis method not only can investigate the connections between position-defined CGI methylation and gene expression specificity from a genome-wide perspective, but also can analysis the potential association of position-defined CGIs with gene functions. (3) PCGIMA (http://www.combio-lezhang.online/pcgima/home.html) provides an easy-to-use analysis and visualization platform for human CGI prediction and methylation. Discussion: This study not only develops Human position-defined CGI prediction method to locate short and position-sensitive CGIs (CpG islets) using high performance computing to construct MR-CpGCluster algorithm, but also a novel human genome annotation and analysis method to investigate the connections among CGI, gene expression and methylation. Finally, we integrate them into PCGIMA for online computing and visualization.",
                "authors": [
                    {
                        "name": "Xiao M."
                    },
                    {
                        "name": "Xiao Y."
                    },
                    {
                        "name": "Yu J."
                    },
                    {
                        "name": "Zhang L."
                    }
                ],
                "date": "2024-01-01T00:00:00Z",
                "journal": "Frontiers in Genetics",
                "title": "PCGIMA: developing the web server for human position-defined CpG islands methylation analysis"
            },
            "pmcid": "PMC10965558",
            "pmid": "38544801"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Epigenomics",
            "uri": "http://edamontology.org/topic_3173"
        },
        {
            "term": "Gene regulation",
            "uri": "http://edamontology.org/topic_0204"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ]
}
