{"credit":[{"email":"alicia.oshlack@mcri.edu.au","name":"Alicia Oshlack","typeEntity":"Person","typeRoles":["Primary contact"]},{"email":"nadia.davidson@mcri.edu.au","name":"Nadia M Davidson","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"https://github.com/Oshlack/necklace/wiki"}],"function":[{"operation":[{"term":"RNA-Seq analysis","uri":"http://edamontology.org/operation_3680"}]}],"labels":{"language":["C++","Groovy","C"],"license":"GPL-3.0","operatingSystem":["Linux"],"toolType":["Command-line tool"],"topic":[{"term":"Transcriptomics","uri":"http://edamontology.org/topic_3308"},{"term":"Transcription factors and regulatory sites","uri":"http://edamontology.org/topic_0749"},{"term":"RNA-seq","uri":"http://edamontology.org/topic_3170"}]},"publication":[{"abstract":"Background: RNA sequencing (RNA-seq) analyses can benefit from performing a genome-guided and de novo assembly, in particular for species where the reference genome or the annotation is incomplete. However, tools for integrating an assembled transcriptome with reference annotation are lacking. Findings: Necklace is a software pipeline that runs genome-guided and de novo assembly and combines the resulting transcriptomes with reference genome annotations. Necklace constructs a compact but comprehensive superTranscriptome out of the assembled and reference data. Reads are subsequently aligned and counted in preparation for differential expression testing. Conclusions: Necklace allows a comprehensive transcriptome to be built from a combination of assembled and annotated transcripts, which results in a more comprehensive transcriptome for the majority of organisms. In addition RNA-seq data are mapped back to this newly created superTranscript reference to enable differential expression testing with standard methods.","authors":["Davidson N.M.","Oshlack A."],"cit_count":0,"doi":"10.1093/gigascience/giy045","journal":"GigaScience","title":"Necklace: combining reference and assembled transcriptomes for more comprehensive RNA-Seq analysis","year":"2018-05-01"}],"summary":{"biotoolsCURIE":"biotools:necklace","biotoolsID":"necklace","description":"Combine reference and assembled transcriptomes for RNA-Seq analysis.","homepage":"https://github.com/Oshlack/necklace/wiki","name":"Necklace"}}