{
    "additionDate": "2025-05-29T08:46:55.065078Z",
    "biotoolsCURIE": "biotools:ml_model_for_mr_series_categorisation",
    "biotoolsID": "ml_model_for_mr_series_categorisation",
    "collectionID": [
        "EUCAIM"
    ],
    "credit": [
        {
            "name": "GIBI230 - HULAFE"
        }
    ],
    "description": "AI tool that is able to perform a categorisation of MR series by using standardized DICOM tags. The categorisation includes the type of sequence (e.g. spin echo, gradient echo), the weighting (e.g. T1W, T2W, DCE, ...), the presence of fat suppression and the detection of non-relevant / junk series (e.g. localizers, calibrations, screenshots...).",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://journalofbigdata.springeropen.com/articles/10.1186/s40537-025-01086-w"
        }
    ],
    "editPermission": {
        "authors": [
            "pedromiguel_martinez_HULAFE"
        ],
        "type": "group"
    },
    "homepage": "https://www.acim.lafe.san.gva.es/acim/?page_id=675&lang=es",
    "language": [
        "Python"
    ],
    "lastUpdate": "2025-06-05T08:47:44.651751Z",
    "link": [
        {
            "type": [
                "Social media"
            ],
            "url": "https://www.linkedin.com/company/grupo-de-investigaci%C3%B3n-biom%C3%A9dica-en-imagen/"
        }
    ],
    "name": "ML model for MR series categorisation (EUCAIM-SW-011_T-01-01-011)",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "casopon",
    "publication": [
        {
            "doi": "10.1186/s40537-025-01086-w",
            "metadata": {
                "abstract": "Large medical image repositories present challenges related to unstructured data. A data enrichment process allows the storage of additional information for fast identification of the content and properties of medical imaging studies. The aim of this study is to develop a metadata enrichment pipeline to facilitate the secondary use of medical images in a high-throughput environment. Our aim was to develop a categorization tool for the MR series to generate standardized tags that identify relevant image characteristics such as patient orientation, sequence type, weighting type, or the presence of fat suppression. Three models that make use of machine learning (ML) and DICOM tags are proposed. The dataset for their development consists of 4666 MR series from cancer patients, labeled by expert radiologists and acquired from different manufacturers, clinical centers and anatomical regions, covering as much variability as possible with the aim of making the models generalizable to other databases. Moreover, the inference performance of the end system has been evaluated on 25,596 MR series as well as the final model outputs with an external evaluation set of 1286 MR series. The weighting model achieves very reliable results with a f1 score of 88% in the validation set. Junk and chemical shift models achieved scores of 82% and 83% respectively. These results open the door to the automatic application of image post-processing and deep learning algorithms after accurate labeling, minimizing human intervention. Furthermore, the proposed solution can infer thousands of DICOM series in less than one minute. Thanks to the fast inference times provided by this solution, it fits well in a big data ecosystem, eliminating any performance issues on ingestion in a semi-real-time environment.",
                "authors": [
                    {
                        "name": "Cerda-Alberich L."
                    },
                    {
                        "name": "Claudio-Fanni S."
                    },
                    {
                        "name": "Gomis-Maya A."
                    },
                    {
                        "name": "Mallol-Rosello P.J."
                    },
                    {
                        "name": "Marti-Bonmati L."
                    },
                    {
                        "name": "Ribas-Despuig G."
                    },
                    {
                        "name": "Ten-Steve A."
                    },
                    {
                        "name": "Veiga-Canuto D."
                    },
                    {
                        "name": "Vila-Frances J."
                    }
                ],
                "date": "2025-12-01T00:00:00Z",
                "journal": "Journal of Big Data",
                "title": "Automatic magnetic resonance imaging series labelling for large repositories"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Data identity and mapping",
            "uri": "http://edamontology.org/topic_3345"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        }
    ],
    "version": [
        "1.0.0"
    ]
}
