{
    "additionDate": "2015-03-08T21:36:53Z",
    "biotoolsCURIE": "biotools:hapcluster",
    "biotoolsID": "hapcluster",
    "credit": [
        {
            "email": "mailund@birc.au.dk",
            "name": "Thomas Mailund",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "name": "birc.au.dk",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        }
    ],
    "description": "A software package for association mapping.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://www.daimi.au.dk/~mailund/HapCluster/#about"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genetic mapping",
                    "uri": "http://edamontology.org/operation_0282"
                }
            ]
        }
    ],
    "homepage": "http://www.daimi.au.dk/~mailund/HapCluster/",
    "language": [
        "C++"
    ],
    "lastUpdate": "2024-11-25T14:17:45.486388Z",
    "name": "HapCluster",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "runef@birc.au.dk",
    "publication": [
        {
            "doi": "10.1002/gepi.20134",
            "metadata": {
                "abstract": "We propose an algorithm for analysing SNP-based population association studies, which is a development of that introduced by Molitor et al. [2003: Am J Hum Genet 73:1368-1384]. It uses clustering of haplotypes to overcome the major limitations of many current haplotype-based approaches. We define a between-haplotype score that is simple, yet appears to capture much of the information about evolutionary relatedness of the haplotypes in the vicinity of a (unobserved) putative causal locus. Haplotype clusters can then be defined via a putative ancestral haplotype and a cut-off distance. The number of an individual's two haplotypes that lie within the cluster predicts the individual's genotype at the causal locus. This predicted genotype can then be investigated for association with the phenotype of interest. We implement our approach within a Markov-chain Monte Carlo algorithm that, in effect, searches over locations and ancestral haplotypes to identify large, case-rich clusters. The algorithm successfully fine-maps a causal mutation in a test analysis using real data, and achieves almost 98% accuracy in predicting the genotype at the causal locus. A simulation study indicates that the new algorithm is substantially superior to alternative approaches, and it also allows us to identify situations in which multipoint approaches can substantially improve over single-SNP analyses. Our algorithm runs quickly and there is scope for extension to a wide range of disease models and genomic scales. © 2005 Wiley-Liss, Inc.",
                "authors": [
                    {
                        "name": "Balding D.J."
                    },
                    {
                        "name": "Waldron E."
                    },
                    {
                        "name": "Whittaker J.C."
                    }
                ],
                "citationCount": 40,
                "date": "2006-02-01T00:00:00Z",
                "journal": "Genetic Epidemiology",
                "title": "Fine mapping of disease genes via haplotype clustering"
            },
            "pmid": "16385468",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        }
    ],
    "validated": 1,
    "version": [
        "2.3.0"
    ]
}
