
{
    "credit": [
        {
            "email": "yss@cs.berkeley.edu",
            "name": "Yun S. Song",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://www.eecs.berkeley.edu/~yss/"
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "https://sourceforge.net/projects/ldhelmet/"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Recombination detection",
                    "uri": "http://edamontology.org/operation_0451"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "C++"
        ],
        "operatingSystem": [
            "Linux"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Genetics",
                "uri": "http://edamontology.org/topic_3053"
            },
            {
                "term": "Genomics",
                "uri": "http://edamontology.org/topic_0622"
            },
            {
                "term": "DNA replication and recombination",
                "uri": "http://edamontology.org/topic_3127"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/ldhelmet-fine-scale-recombination-rate-estimation.html"
        }
    ],
    "publication": [
        {
            "abstract": "Estimating fine-scale recombination maps of Drosophila from population genomic data is a challenging problem, in particular because of the high background recombination rate. In this paper, a new computational method is developed to address this challenge. Through an extensive simulation study, it is demonstrated that the method allows more accurate inference, and exhibits greater robustness to the effects of natural selection and noise, compared to a well-used previous method developed for studying fine-scale recombination rate variation in the human genome. As an application, a genome-wide analysis of genetic variation data is performed for two Drosophila melanogaster populations, one from North America (Raleigh, USA) and the other from Africa (Gikongoro, Rwanda). It is shown that fine-scale recombination rate variation is widespread throughout the D. melanogaster genome, across all chromosomes and in both populations. At the fine-scale, a conservative, systematic search for evidence of recombination hotspots suggests the existence of a handful of putative hotspots each with at least a tenfold increase in intensity over the background rate. A wavelet analysis is carried out to compare the estimated recombination maps in the two populations and to quantify the extent to which recombination rates are conserved. In general, similarity is observed at very broad scales, but substantial differences are seen at fine scales. The average recombination rate of the X chromosome appears to be higher than that of the autosomes in both populations, and this pattern is much more pronounced in the African population than the North American population. The correlation between various genomic features-including recombination rates, diversity, divergence, GC content, gene content, and sequence quality-is examined using the wavelet analysis, and it is shown that the most notable difference between D. melanogaster and humans is in the correlation between recombination and diversity. © 2012 Chan et al.",
            "authors": [
                "Chan A.H.",
                "Jenkins P.A.",
                "Song Y.S."
            ],
            "cit_count": 68,
            "journal": "PLoS Genetics",
            "pmid": "23284288",
            "title": "Genome-Wide Fine-Scale Recombination Rate Variation in Drosophila melanogaster",
            "year": "2012-12-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:ldhelmet",
        "biotoolsID": "ldhelmet",
        "description": "Software program for statistical inference of fine-scale crossover recombination rates from population genetic data.",
        "homepage": "http://sourceforge.net/projects/ldhelmet/",
        "name": "LDhelmet"
    }
}