{
    "additionDate": "2021-01-18T09:02:14Z",
    "biotoolsCURIE": "biotools:awsem-suite",
    "biotoolsID": "awsem-suite",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "pw8@rice.edu",
            "name": "Peter G Wolynes",
            "orcidid": "https://orcid.org/0000-0001-7975-9287",
            "typeEntity": "Person"
        }
    ],
    "description": "A protein structure prediction server based on template-guided, coevolutionary-enhanced optimized folding landscapes.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://awsem.rice.edu/Documentation"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein structure prediction",
                    "uri": "http://edamontology.org/operation_0474"
                },
                {
                    "term": "Fold recognition",
                    "uri": "http://edamontology.org/operation_0303"
                },
                {
                    "term": "Molecular dynamics",
                    "uri": "http://edamontology.org/operation_2476"
                },
                {
                    "term": "Molecular docking",
                    "uri": "http://edamontology.org/operation_0478"
                },
                {
                    "term": "Protein folding analysis",
                    "uri": "http://edamontology.org/operation_2415"
                }
            ]
        }
    ],
    "homepage": "https://awsem.rice.edu",
    "lastUpdate": "2021-01-29T19:56:36Z",
    "name": "AWSEM-Suite",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/NAR/GKAA356",
            "metadata": {
                "abstract": "© The Author(s) 2020. Published by Oxford University Press on behalf of Nucleic Acids Research.The accurate and reliable prediction of the 3D structures of proteins and their assemblies remains difficult even though the number of solved structures soars and prediction techniques improve. In this study, a free and open access web server, AWSEM-Suite, whose goal is to predict monomeric protein tertiary structures from sequence is described. The model underlying the server’s predictions is a coarse-grained protein force field which has its roots in neural network ideas that has been optimized using energy landscape theory. Employing physically motivated potentials and knowledge-based local structure biasing terms, the addition of homologous template and co-evolutionary restraints to AWSEM-Suite greatly improves the predictive power of pure AWSEM structure prediction. From the independent evaluation metrics released in the CASP13 experiment, AWSEM-Suite proves to be a reasonably accurate algorithm for free modeling, standing at the eighth position in the free modeling category of CASP13. The AWSEM-Suite server also features a front end with a user-friendly interface. The AWSEM-Suite server is a powerful tool for predicting monomeric protein tertiary structures that is most useful when a suitable structure template is not available. The AWSEM-Suite server is freely available at: https://awsem.rice.edu.",
                "authors": [
                    {
                        "name": "Jin S."
                    },
                    {
                        "name": "Contessoto V.G."
                    },
                    {
                        "name": "Chen M."
                    },
                    {
                        "name": "Schafer N.P."
                    },
                    {
                        "name": "Lu W."
                    },
                    {
                        "name": "Chen X."
                    },
                    {
                        "name": "Bueno C."
                    },
                    {
                        "name": "Hajitaheri A."
                    },
                    {
                        "name": "Sirovetz B.J."
                    },
                    {
                        "name": "Davtyan A."
                    },
                    {
                        "name": "Papoian G.A."
                    },
                    {
                        "name": "Tsai M.-Y."
                    },
                    {
                        "name": "Wolynes P.G."
                    }
                ],
                "citationCount": 3,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "AWSEM-Suite: A protein structure prediction server based on template-guided, coevolutionary-enhanced optimized folding landscapes"
            },
            "pmcid": "PMC7319565",
            "pmid": "32383764",
            "type": [
                "Primary"
            ]
        },
        {
            "doi": "10.1021/ACS.JCTC.0C00188",
            "metadata": {
                "abstract": "Copyright © 2020 American Chemical Society.Recently several techniques have emerged that significantly enhance the quality of predictions of protein tertiary structures. In this study, we describe the performance of AWSEM-Suite, an algorithm that incorporates template-based modeling and coevolutionary restraints with a realistic coarse-grained force field, AWSEM. With its roots in neural networks, AWSEM contains both physical and bioinformatical energies that have been optimized using energy landscape theory. AWSEM-Suite participated in CASP13 as a server predictor and generated reliable predictions for most targets. AWSEM-Suite ranked eighth in both the free-modeling category and the hard-to-model category and in one case provided the best submitted prediction. Here we critically discuss the prediction performance of AWSEM-Suite using several examples from different categories in CASP13. Structure prediction tests on these selected targets, two of them being hard-to-model targets, show that AWSEM-Suite can achieve high-resolution structure prediction after incorporating both template guidances and coevolutionary restraints even when homology is weak. For targets with reliable templates (template-easy category), introducing coevolutionary restraints sometimes damages the overall quality of the predictions. Free energy profile analyses demonstrate, however, that the incorporations of both of these evolutionarily informed terms effectively increase the funneling of the landscape toward native-like structures while still allowing sufficient flexibility to correct for discrepancies between the correct target structure and the provided guidance. In contrast to other predictors that are exclusively oriented toward structure prediction, the connection of AWSEM-Suite to a statistical mechanical basis and affiliated molecular dynamics and importance sampling simulations makes it suitable for functional explorations.",
                "authors": [
                    {
                        "name": "Jin S."
                    },
                    {
                        "name": "Chen M."
                    },
                    {
                        "name": "Chen X."
                    },
                    {
                        "name": "Bueno C."
                    },
                    {
                        "name": "Lu W."
                    },
                    {
                        "name": "Schafer N.P."
                    },
                    {
                        "name": "Lin X."
                    },
                    {
                        "name": "Onuchic J.N."
                    },
                    {
                        "name": "Wolynes P.G."
                    }
                ],
                "citationCount": 5,
                "date": "2020-06-09T00:00:00Z",
                "journal": "Journal of Chemical Theory and Computation",
                "title": "Protein Structure Prediction in CASP13 Using AWSEM-Suite"
            },
            "pmid": "32396727",
            "type": [
                "Usage"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Protein folds and structural domains",
            "uri": "http://edamontology.org/topic_0736"
        },
        {
            "term": "Structure prediction",
            "uri": "http://edamontology.org/topic_0082"
        },
        {
            "term": "Protein folding, stability and design",
            "uri": "http://edamontology.org/topic_0130"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}