{
    "additionDate": "2017-04-21T12:12:57Z",
    "biotoolsCURIE": "biotools:fpc",
    "biotoolsID": "fpc",
    "credit": [
        {
            "email": "fpc@agcol.arizona.edu",
            "name": "FPC Support",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "FPC is a tool to assemble contigs from a set of clones and their restriction fragments.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://www.agcol.arizona.edu/software/fpc/#fpc"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "De-novo assembly",
                    "uri": "http://edamontology.org/operation_0524"
                },
                {
                    "term": "Mapping assembly",
                    "uri": "http://edamontology.org/operation_0523"
                },
                {
                    "term": "Sequence assembly",
                    "uri": "http://edamontology.org/operation_0310"
                },
                {
                    "term": "Mapping",
                    "uri": "http://edamontology.org/operation_2429"
                }
            ]
        }
    ],
    "homepage": "http://www.agcol.arizona.edu/software/fpc/",
    "lastUpdate": "2018-12-10T12:58:54Z",
    "name": "FPC",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "Motivation: To meet the demands of large-scale sequencing, thousands of clones must be fingerprinted and assembled into contigs. To determine the order of clones, a typical experiment is to digest the clones with one or more restriction enzymes and measure the resulting fragments. The probability of two clones overlapping is based on the similarity of their fragments. A contig contains two or more overlapping clones and a minimal tiling path of clones is selected to be sequenced. Interactive software with algorithmic support is necessary to assemble the clones into contigs quickly Results: FPC (fingerprinted contigs) is an interactive program for building contigs from restriction fingerprinted clones. FPC uses an algorithm to cluster clones into contigs based on their probability of coincidence score. For each contig, it builds a consensus band (CB) map which is similar to a restriction map, but it does not try to resolve all the errors. The CB map is used to assign coordinates to the clones based on their alignment to the map and to provide a detailed visualization of the clone overlap. FPC has editing facilities for the user to refine the coordinates and to remove poorly fingerprinted clones. Functions are available for updating an FPC database with new clones. Contigs can easily be merged, split or deleted. Markers can be added to clones and are displayed with the appropriate contig. Sequence-ready clones can be selected and their sequencing status displayed. As such, FPC is an integrated program for the assembly of sequence-ready clones for large-scale sequencing projects. Availability: The software and manual are available via anonymous ftp toftp.sanger.ac.uk, directory publfpc. Contact: E-mail:cari@sanger.ac.uk. © 1997, Oxford University Press.",
                "authors": [
                    {
                        "name": "Soderlund C."
                    },
                    {
                        "name": "Longden I."
                    },
                    {
                        "name": "Mott R."
                    }
                ],
                "citationCount": 248,
                "date": "1997-01-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Fpc: A system for building contigs from restriction fingerprinted clones"
            },
            "pmid": "9367125"
        },
        {
            "metadata": {
                "abstract": "One of the more common uses of the program FingerPrint Contigs (FPC) is to assemble random restriction digest 'fingerprints' of overlapping genomic clones into contigs. To improve the rate of assembling contigs from large fingerprint databases we have adapted FPC so that it can be run in parallel on multiple processors and servers. The current version of 'parallelized FPC' has been used in our laboratory to assemble mammalian BAC fingerprint databases, each containing more than 300 000 BAC fingerprints.",
                "authors": [
                    {
                        "name": "Ness S.R."
                    },
                    {
                        "name": "Terpstra W."
                    },
                    {
                        "name": "Krzywinski M."
                    },
                    {
                        "name": "Marra M.A."
                    },
                    {
                        "name": "Jones S.J.M."
                    }
                ],
                "citationCount": 16,
                "date": "2002-01-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Assembly of fingerprint contigs: Parallelized FPC"
            },
            "pmid": "11934749"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Clone library",
            "uri": "http://edamontology.org/topic_3341"
        },
        {
            "term": "Zoology",
            "uri": "http://edamontology.org/topic_3500"
        }
    ],
    "validated": 1
}