{
    "accessibility": "Open access",
    "additionDate": "2022-05-23T12:07:47.640279Z",
    "biotoolsCURIE": "biotools:maplaria",
    "biotoolsID": "maplaria",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "e.giorgi@lancaster.ac.uk",
            "name": "Emanuele Giorgi",
            "orcidid": "https://orcid.org/0000-0003-0640-181X",
            "typeEntity": "Person"
        },
        {
            "name": "Jack Woodmansey"
        },
        {
            "name": "Barry Rowlingson",
            "orcidid": "https://orcid.org/0000-0002-8586-6625"
        },
        {
            "name": "Peter M. Macharia",
            "orcidid": "https://orcid.org/0000-0003-3410-1881"
        },
        {
            "name": "Robert W. Snow",
            "orcidid": "https://orcid.org/0000-0003-3725-6088"
        }
    ],
    "description": "A user friendly web-application for spatio-temporal malaria prevalence mapping.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://fhm-chicas-Maplaria.lancs.ac.uk/page/methods"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                },
                {
                    "term": "Mapping",
                    "uri": "http://edamontology.org/operation_2429"
                },
                {
                    "term": "Splitting",
                    "uri": "http://edamontology.org/operation_3359"
                }
            ]
        }
    ],
    "homepage": "https://fhm-chicas-Maplaria.lancs.ac.uk",
    "lastUpdate": "2022-05-23T12:07:47.643716Z",
    "name": "Maplaria",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1186/S12936-021-04011-7",
            "metadata": {
                "abstract": "© 2021, The Author(s).Background: Model-based geostatistical (MBG) methods have been extensively used to map malaria risk using community survey data in low-resource settings where disease registries are incomplete or non-existent. However, the wider adoption of MBG methods by national control programmes to inform health policy decisions is hindered by the lack of advanced statistical expertise and suitable computational equipment. Here, Maplaria, an interactive, user-friendly web-application that allows users to upload their own malaria prevalence data and carry out geostatistical prediction of annual malaria prevalence at any desired spatial scale, is introduced. Methods: In the design of the Maplaria web application, two main criteria were considered: the application should be able to classify subnational divisions into the most likely endemicity levels; the web application should allow only minimal input from the user in the set-up of the geostatistical inference process. To achieve this, the process of fitting and validating the geostatistical models is carried out by statistical experts using publicly available malaria survey data from the Harvard database. The stage of geostatistical prediction is entirely user-driven and allows the user to upload malaria data, as well as vector data that define the administrative boundaries for the generation of spatially aggregated inferences. Results: The process of data uploading and processing is split into a series of steps spread across screens through the progressive disclosure technique that prevents the user being immediately overwhelmed by the length of the form. Each of these is illustrated using a data set from the Malaria Indicator carried out in Tanzania in 2017 as an example. Conclusions: Maplaria application provides a user-friendly solution to the problem making geostatistical methods more accessible to users that have not undertaken formal training in statistics. The application is a useful tool that can be used to foster ownership, among policy makers, of disease risk maps and promote better use of data for decision-making in low resource settings.",
                "authors": [
                    {
                        "name": "Giorgi E."
                    },
                    {
                        "name": "Macharia P.M."
                    },
                    {
                        "name": "Rowlingson B."
                    },
                    {
                        "name": "Snow R.W."
                    },
                    {
                        "name": "Woodmansey J."
                    }
                ],
                "date": "2021-12-01T00:00:00Z",
                "journal": "Malaria Journal",
                "title": "Maplaria: a user friendly web-application for spatio-temporal malaria prevalence mapping"
            },
            "pmcid": "PMC8686323",
            "pmid": "34930265"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ]
}
