{
    "additionDate": "2017-12-18T00:12:41Z",
    "biotoolsCURIE": "biotools:sopra",
    "biotoolsID": "sopra",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.physics.rutgers.edu/~anirvans/"
        }
    ],
    "description": "Assembler for mate pair/paired-end reads from high throughput sequencing platforms, e.g. Illumina and SOLiD.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence assembly",
                    "uri": "http://edamontology.org/operation_0310"
                }
            ]
        }
    ],
    "homepage": "http://www.physics.rutgers.edu/~anirvans/SOPRA/",
    "language": [
        "Perl"
    ],
    "lastUpdate": "2019-01-17T12:53:26Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/sopra-1-4-6-statistical-optimization-paired-read-assembly.html"
        }
    ],
    "name": "SOPRA",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1186/1471-2105-11-345",
            "metadata": {
                "abstract": "Background: High throughput sequencing (HTS) platforms produce gigabases of short read (<100 bp) data per run. While these short reads are adequate for resequencing applications, de novo assembly of moderate size genomes from such reads remains a significant challenge. These limitations could be partially overcome by utilizing mate pair technology, which provides pairs of short reads separated by a known distance along the genome.Results: We have developed SOPRA, a tool designed to exploit the mate pair/paired-end information for assembly of short reads. The main focus of the algorithm is selecting a sufficiently large subset of simultaneously satisfiable mate pair constraints to achieve a balance between the size and the quality of the output scaffolds. Scaffold assembly is presented as an optimization problem for variables associated with vertices and with edges of the contig connectivity graph. Vertices of this graph are individual contigs with edges drawn between contigs connected by mate pairs. Similar graph problems have been invoked in the context of shotgun sequencing and scaffold building for previous generation of sequencing projects. However, given the error-prone nature of HTS data and the fundamental limitations from the shortness of the reads, the ad hoc greedy algorithms used in the earlier studies are likely to lead to poor quality results in the current context. SOPRA circumvents this problem by treating all the constraints on equal footing for solving the optimization problem, the solution itself indicating the problematic constraints (chimeric/repetitive contigs, etc.) to be removed. The process of solving and removing of constraints is iterated till one reaches a core set of consistent constraints. For SOLiD sequencer data, SOPRA uses a dynamic programming approach to robustly translate the color-space assembly to base-space. For assessing the quality of an assembly, we report the no-match/mismatch error rate as well as the rates of various rearrangement errors.Conclusions: Applying SOPRA to real data from bacterial genomes, we were able to assemble contigs into scaffolds of significant length (N50 up to 200 Kb) with very few errors introduced in the process. In general, the methodology presented here will allow better scaffold assemblies of any type of mate pair sequencing data. © 2010 Dayarian et al; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Dayarian A."
                    },
                    {
                        "name": "Michael T.P."
                    },
                    {
                        "name": "Sengupta A.M."
                    }
                ],
                "citationCount": 94,
                "date": "2010-06-24T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "SOPRA: Scaffolding algorithm for paired reads via statistical optimization"
            },
            "pmcid": "PMC2909219",
            "pmid": "20576136",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "High throughput sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Assembly",
            "uri": "http://edamontology.org/topic_0196"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ],
    "validated": 1,
    "version": [
        "1.4.6"
    ]
}