{
    "additionDate": "2020-01-14T19:53:15Z",
    "biotoolsCURIE": "biotools:isthmic_spondylolisthesis_degenerative_spondylolisthesis",
    "biotoolsID": "isthmic_spondylolisthesis_degenerative_spondylolisthesis",
    "confidence_flag": "high",
    "description": "Association of MRI-defined lumbar paraspinal muscle mass and slip percentage in degenerative and isthmic spondylolisthesis.\n\nThe objective of this study is to investigate the role of paraspinal muscles in the progression of different types of spondylolisthesis by examining the correlation between cross-sectional area (CSA) of lumbar paraspinal muscle and slip percentage (SP) in degenerative spondylolisthesis and isthmic spondylolisthesis. A multicenter retrospective analysis was carried out including 219 subjects diagnosed with lumbar spondylolisthesis. Using T2-weighted axial magnetic resonance imgaging, CSAs of the psoas major (PM), multifidus (MU), and erector spinae were measured and divided by L5 vertebral body (VB) CSA. SP was measured using sagittal T2-weighted images.\n\n||| HOMEPAGE MISSING!.\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'spondylolisthesis degenerative spondylolisthesis', 'isthmic spondylolisthesis', 'isthmic spondylolisthesis degenerative', 'VB'",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "https://www.ncbi.nlm.nih.gov/pubmed/?term=31804327",
    "lastUpdate": "2020-01-14T19:53:15Z",
    "name": "isthmic spondylolisthesis degenerative spondylolisthesis",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1097/MD.0000000000018157",
            "metadata": {
                "abstract": "The objective of this study is to investigate the role of paraspinal muscles in the progression of different types of spondylolisthesis by examining the correlation between cross-sectional area (CSA) of lumbar paraspinal muscle and slip percentage (SP) in degenerative spondylolisthesis and isthmic spondylolisthesis.A multicenter retrospective analysis was carried out including 219 subjects diagnosed with lumbar spondylolisthesis. Using T2-weighted axial magnetic resonance imgaging, CSAs of the psoas major (PM), multifidus (MU), and erector spinae were measured and divided by L5 vertebral body (VB) CSA. SP was measured using sagittal T2-weighted images. Correlations between muscle CSA ratio and SP were calculated in each group. Regression analysis was performed to predict the influence of each muscle CSA/VB CSA ratio on SP.No significant correlation was found in the degenerative spondylolisthesis group between any of the muscle CSA ratios and SP. Both PM/VB ratio (r = -0.24, P = .021) and MU/VB ratio (r = -0.26, P = .012) were negatively correlated with SP in the isthmic spondylolisthesis group. MU had more influence on SP than PM in the isthmic spondylolisthesis group (regression coefficient MU/VB: -8.08, PM/VB: -4.34).Both PM and MU muscle CSA ratios were negatively correlated with SP in the isthmic group. MU had more influence on SP than PM. No muscles had any correlations with SP in the degenerative group. This discrepancy between the two groups suggests that exercise programs or interventions regarding the segmental stability of isthmic spondylolisthesis and degenerative spondylolisthesis should be distinguished in clinical practice.Clinical Research Information Service of Korea Centers for Disease control and Prevention, KCT0002588. Registered on 12 December 2017, https://cris.nih.go.kr/cris/search/search_result_st01.jsp?seq=10702.",
                "authors": [
                    {
                        "name": "Park J.-H."
                    },
                    {
                        "name": "Kim K.-W."
                    },
                    {
                        "name": "Youn Y."
                    },
                    {
                        "name": "Kim H."
                    },
                    {
                        "name": "Chung W.-S."
                    },
                    {
                        "name": "Song M.-Y."
                    },
                    {
                        "name": "Cho J.-H."
                    }
                ],
                "date": "2019-12-01T00:00:00Z",
                "journal": "Medicine",
                "title": "Association of MRI-defined lumbar paraspinal muscle mass and slip percentage in degenerative and isthmic spondylolisthesis: A multicenter, retrospective, observational study"
            },
            "pmid": "31804327"
        }
    ],
    "topic": [
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        }
    ]
}