{
    "accessibility": "Open access",
    "additionDate": "2022-02-03T14:07:36.871397Z",
    "biotoolsCURIE": "biotools:rkomics",
    "biotoolsID": "rkomics",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "fvandenbroeck@gmail.com",
            "name": "Frederik Van den Broeck",
            "orcidid": "https://orcid.org/0000-0003-2542-5585",
            "typeEntity": "Person"
        },
        {
            "name": "Manon Geerts"
        },
        {
            "name": "Achim Schnaufer"
        }
    ],
    "description": "The rKOMICS software suite includes the python3.7 package KOMICS and the R package rKOMICS. These two software packages facilitate the assembly, circularization and downstream analyses of mitochondrial genomes in trypanosomatids. The input of KOMICS is reads in FASTQ format, and the output is maxicircle and circularized minicircles in FASTA format, which can be further processed by rKOMICS.",
    "documentation": [
        {
            "type": [
                "General",
                "User manual"
            ],
            "url": "https://cran.r-project.org/web/packages/rKOMICS/rKOMICS.pdf"
        }
    ],
    "download": [
        {
            "note": "python version",
            "type": "Source code",
            "url": "https://github.com/FreBio/komics/releases/tag/1.1.8"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence assembly",
                    "uri": "http://edamontology.org/operation_0310"
                },
                {
                    "term": "Sequence trimming",
                    "uri": "http://edamontology.org/operation_3192"
                },
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                }
            ]
        }
    ],
    "homepage": "https://frebio.github.io/komics/",
    "language": [
        "R",
        "Python",
        "Shell"
    ],
    "lastUpdate": "2022-02-03T14:07:36.873885Z",
    "license": "GPL-2.0",
    "link": [
        {
            "note": "R package download",
            "type": [
                "Repository"
            ],
            "url": "https://CRAN.R-project.org/package=rKOMICS"
        },
        {
            "note": "Python version",
            "type": [
                "Repository"
            ],
            "url": "https://github.com/FreBio/komics"
        }
    ],
    "name": "rKOMICS",
    "operatingSystem": [
        "Mac",
        "Linux",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1186/S12859-021-04384-1",
            "metadata": {
                "abstract": "© 2021, The Author(s).Background: The advent of population-scale genome projects has revolutionized our biological understanding of parasitic protozoa. However, while hundreds to thousands of nuclear genomes of parasitic protozoa have been generated and analyzed, information about the diversity, structure and evolution of their mitochondrial genomes remains fragmentary, mainly because of their extraordinary complexity. Indeed, unicellular flagellates of the order Kinetoplastida contain structurally the most complex mitochondrial genome of all eukaryotes, organized as a giant network of homogeneous maxicircles and heterogeneous minicircles. We recently developed KOMICS, an analysis toolkit that automates the assembly and circularization of the mitochondrial genomes of Kinetoplastid parasites. While this tool overcomes the limitation of extracting mitochondrial assemblies from Next-Generation Sequencing datasets, interpreting and visualizing the genetic (dis)similarity within and between samples remains a time-consuming process. Results: Here, we present a new analysis toolkit—rKOMICS—to streamline the analyses of minicircle sequence diversity in population-scale genome projects. rKOMICS is a user-friendly R package that has simple installation requirements and that is applicable to all 27 trypanosomatid genera. Once minicircle sequence alignments are generated, rKOMICS allows to examine, summarize and visualize minicircle sequence diversity within and between samples through the analyses of minicircle sequence clusters. We showcase the functionalities of the (r)KOMICS tool suite using a whole-genome sequencing dataset from a recently published study on the history of diversification of the Leishmania braziliensis species complex in Peru. Analyses of population diversity and structure highlighted differences in minicircle sequence richness and composition between Leishmania subspecies, and between subpopulations within subspecies. Conclusion: The rKOMICS package establishes a critical framework to manipulate, explore and extract biologically relevant information from mitochondrial minicircle assemblies in tens to hundreds of samples simultaneously and efficiently. This should facilitate research that aims to develop new molecular markers for identifying species-specific minicircles, or to study the ancestry of parasites for complementary insights into their evolutionary history.",
                "authors": [
                    {
                        "name": "Geerts M."
                    },
                    {
                        "name": "Schnaufer A."
                    },
                    {
                        "name": "Van den Broeck F."
                    }
                ],
                "date": "2021-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "rKOMICS: an R package for processing mitochondrial minicircle assemblies in population-scale genome projects"
            },
            "pmcid": "PMC8479924",
            "pmid": "34583651"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        },
        {
            "term": "Parasitology",
            "uri": "http://edamontology.org/topic_3302"
        },
        {
            "term": "Phylogenomics",
            "uri": "http://edamontology.org/topic_0194"
        },
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        }
    ]
}