{
    "additionDate": "2023-11-25T09:56:16.150215Z",
    "biotoolsCURIE": "biotools:cris_single-sample",
    "biotoolsID": "cris_single-sample",
    "credit": [
        {
            "email": "marco.masseroli@polimi.it",
            "name": "Marco Masseroli",
            "orcidid": "https://orcid.org/0000-0003-2574-1174",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "name": "Silvia Cascianelli",
            "orcidid": "https://orcid.org/0000-0002-5628-9101",
            "typeEntity": "Person",
            "typeRole": [
                "Developer"
            ]
        },
        {
            "name": "Chiara Barbera",
            "typeEntity": "Person",
            "typeRole": [
                "Contributor"
            ]
        },
        {
            "name": "ELIXIR-ITA",
            "typeEntity": "Project",
            "url": "https://elixir-italy.org/"
        },
        {
            "name": "ELIXIR-ITA-POLIMI",
            "typeEntity": "Project",
            "url": "https://www.deib.polimi.it/eng/elixir-iib"
        }
    ],
    "description": "CRIS_single-sample is a computational R workflow to replicate the training, testing and biological validation of a multi-label classifier (ML2CRIS) for colorectal cancer intrinsic subtyping.",
    "download": [
        {
            "note": "R package and source code",
            "type": "Software package",
            "url": "https://github.com/DEIB-GECO/CRIS_single-sample"
        }
    ],
    "editPermission": {
        "type": "group"
    },
    "elixirNode": [
        "Italy"
    ],
    "elixirPlatform": [
        "Tools"
    ],
    "homepage": "https://github.com/DEIB-GECO/CRIS_single-sample",
    "language": [
        "R"
    ],
    "lastUpdate": "2023-11-25T09:56:16.152808Z",
    "name": "CRIS_single-sample",
    "owner": "ELIXIR-ITA-POLIMI",
    "publication": [
        {
            "doi": "10.1186/s13073-023-01176-5",
            "metadata": {
                "abstract": "Background: Transcriptional classification has been used to stratify colorectal cancer (CRC) into molecular subtypes with distinct biological and clinical features. However, it is not clear whether such subtypes represent discrete, mutually exclusive entities or molecular/phenotypic states with potential overlap. Therefore, we focused on the CRC Intrinsic Subtype (CRIS) classifier and evaluated whether assigning multiple CRIS subtypes to the same sample provides additional clinically and biologically relevant information. Methods: A multi-label version of the CRIS classifier (multiCRIS) was applied to newly generated RNA-seq profiles from 606 CRC patient-derived xenografts (PDXs), together with human CRC bulk and single-cell RNA-seq datasets. Biological and clinical associations of single- and multi-label CRIS were compared. Finally, a machine learning-based multi-label CRIS predictor (ML2CRIS) was developed for single-sample classification. Results: Surprisingly, about half of the CRC cases could be significantly assigned to more than one CRIS subtype. Single-cell RNA-seq analysis revealed that multiple CRIS membership can be a consequence of the concomitant presence of cells of different CRIS class or, less frequently, of cells with hybrid phenotype. Multi-label assignments were found to improve prediction of CRC prognosis and response to treatment. Finally, the ML2CRIS classifier was validated for retaining the same biological and clinical associations also in the context of single-sample classification. Conclusions: These results show that CRIS subtypes retain their biological and clinical features even when concomitantly assigned to the same CRC sample. This approach could be potentially extended to other cancer types and classification systems.",
                "authors": [
                    {
                        "name": "Barbera C."
                    },
                    {
                        "name": "Bertotti A."
                    },
                    {
                        "name": "Cascianelli S."
                    },
                    {
                        "name": "Grassi E."
                    },
                    {
                        "name": "Isella C."
                    },
                    {
                        "name": "Lupo B."
                    },
                    {
                        "name": "Masseroli M."
                    },
                    {
                        "name": "Medico E."
                    },
                    {
                        "name": "Pasini D."
                    },
                    {
                        "name": "Trusolino L."
                    },
                    {
                        "name": "Ulla A.A."
                    }
                ],
                "date": "2023-12-01T00:00:00Z",
                "journal": "Genome Medicine",
                "title": "Multi-label transcriptional classification of colorectal cancer reflects tumor cell population heterogeneity"
            }
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        }
    ]
}
