{
    "additionDate": "2018-08-06T10:03:04Z",
    "biotoolsCURIE": "biotools:zebrafish",
    "biotoolsID": "zebrafish",
    "credit": [
        {
            "email": "darby@mail.ncku.edu.tw",
            "name": "Darby Tien-Hao Chang",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "This work developed a fully automatic method to calculate heart rate, an important parameter to analyze cardiac function, from videos. It contains several filters to identify the heart region, to reduce video noise and to calculate heart rates.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/mbilab/zebrafish/blob/master/README.md"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                }
            ]
        }
    ],
    "homepage": "https://github.com/mbilab/zebrafish",
    "language": [
        "JavaScript"
    ],
    "lastUpdate": "2018-12-10T12:59:01Z",
    "link": [
        {
            "type": [
                "Mirror"
            ],
            "url": "https://merry.ee.ncku.edu.tw/zebrafish"
        }
    ],
    "name": "zebrafish",
    "owner": "shadi.m",
    "publication": [
        {
            "doi": "10.1186/s12859-018-2166-6",
            "metadata": {
                "abstract": "© 2018 The Author(s).Background: Zebrafish is a widely used model organism for studying heart development and cardiac-related pathogenesis. With the ability of surviving without a functional circulation at larval stages, strong genetic similarity between zebrafish and mammals, prolific reproduction and optically transparent embryos, zebrafish is powerful in modeling mammalian cardiac physiology and pathology as well as in large-scale high throughput screening. However, an economical and convenient tool for rapid evaluation of fish cardiac function is still in need. There have been several image analysis methods to assess cardiac functions in zebrafish embryos/larvae, but they are still improvable to reduce manual intervention in the entire process. This work developed a fully automatic method to calculate heart rate, an important parameter to analyze cardiac function, from videos. It contains several filters to identify the heart region, to reduce video noise and to calculate heart rates. Results: The proposed method was evaluated with 32 zebrafish larval cardiac videos that were recording at three-day post-fertilization. The heart rate measured by the proposed method was comparable to that determined by manual counting. The experimental results show that the proposed method does not lose accuracy while largely reducing the labor cost and uncertainty of manual counting. Conclusions: With the proposed method, researchers do not have to manually select a region of interest before analyzing videos. Moreover, filters designed to reduce video noise can alleviate background fluctuations during the video recording stage (e.g. shifting), which makes recorders generate usable videos easily and therefore reduce manual efforts while recording.",
                "authors": [
                    {
                        "name": "Chang D.T.-H."
                    },
                    {
                        "name": "Chu P.-H."
                    },
                    {
                        "name": "Fu T.-F."
                    },
                    {
                        "name": "Kang C.-P."
                    },
                    {
                        "name": "Tu H.-C."
                    },
                    {
                        "name": "Wu J.-M."
                    }
                ],
                "citationCount": 7,
                "date": "2018-05-09T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "An automatic method to calculate heart rate from zebrafish larval cardiac videos"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Biological imaging",
            "uri": "http://edamontology.org/topic_3383"
        }
    ],
    "validated": 1
}
