{
    "additionDate": "2020-01-14T20:11:35Z",
    "biotoolsCURIE": "biotools:miRNA_autogenerated",
    "biotoolsID": "miRNA_autogenerated",
    "confidence_flag": "low",
    "credit": [
        {
            "email": "dasa.jevsinekskok@kis.si",
            "name": "Daša Jevšinek Skok",
            "typeEntity": "Person"
        }
    ],
    "description": "The integrative knowledge base for miRNA-mRNA expression in colorectal cancer.\n\nComplexity measures of the mature miRNA for improving pre-miRNAs prediction.\n\nThis is a distribution of the source code used in:.\n\nJonathan Raad, Georgina Stegmayer and Diego H. Milone, \"Complexity measures of the mature for improving pre-miRNAs prediction\".\n\nWelcome to the miRNA-mRNA expression atlas: a knowledge base for studying the expression of miRNAs and their target genes in colorectal cancer.\n\nWe performed an integrative analysis of miRNA-target gene interactions (MTI) on high-throughput molecular profiling of 295 CRC samples obtained from The Cancer Genome Atlas (TCGA). Our study results in 26,963 correlated MTIs, with focus on the negatively strong correlated MTIs. Our analysis provides a catalogue of MTIs that can serve as a starting point in testing more targeted hypotheses and dealing with CRC functional experiments",
    "download": [
        {
            "type": "Source code",
            "url": "https://sourceforge.net/projects/sourcesinc/files/cplxmirna/"
        }
    ],
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Expression correlation analysis",
                    "uri": "http://edamontology.org/operation_3463"
                },
                {
                    "term": "miRNA target prediction",
                    "uri": "http://edamontology.org/operation_0463"
                },
                {
                    "term": "miRNA expression analysis",
                    "uri": "http://edamontology.org/operation_3792"
                }
            ]
        }
    ],
    "homepage": "https://mirna-coadread.omics.si/",
    "lastUpdate": "2020-01-14T20:11:35Z",
    "name": "miRNA_autogenerated",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1038/S41598-019-54358-W",
            "metadata": {
                "abstract": "© 2019, The Author(s).“miRNA colorectal cancer” (https://mirna-coadread.omics.si/) is a freely available web application for studying microRNA and mRNA expression and their correlation in colorectal cancer. To the best of our knowledge, “miRNA colorectal cancer” has the largest knowledge base of miRNA-target gene expressions and correlations in colorectal cancer, based on the largest available sample size from the same source of data. Data from high-throughput molecular profiling of 295 colon and rectum adenocarcinoma samples from The Cancer Genome Atlas was analyzed and integrated into our knowledge base. The objective of developing this web application was to help researchers to discover the behavior and role of miRNA-target gene interactions in colorectal cancer. For this purpose, results of differential expression and correlation analyses of miRNA and mRNA data collected in our knowledge base are available through web forms. To validate our knowledge base experimentally, we selected genes FN1, TGFB2, RND3, ZEB1 and ZEB2 and miRNAs hsa-miR-200a/b/c-3p, hsa-miR-141-3p and hsa-miR-429. Both approaches revealed a negative correlation between miRNA hsa-miR-200b/c-3p and its target gene FN1 and between hsa-miR-200a-3p and its target TGFB2, thus supporting the usefulness of the developed knowledge base.",
                "authors": [
                    {
                        "name": "Jevsinek Skok D."
                    },
                    {
                        "name": "Hauptman N."
                    },
                    {
                        "name": "Bostjancic E."
                    },
                    {
                        "name": "Zidar N."
                    }
                ],
                "date": "2019-12-01T00:00:00Z",
                "journal": "Scientific Reports",
                "title": "The integrative knowledge base for miRNA-mRNA expression in colorectal cancer"
            },
            "pmcid": "PMC6889159",
            "pmid": "31792281"
        },
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ940",
            "pmid": "31860057"
        }
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        }
    ]
}