{
    "additionDate": "2018-08-05T23:43:09Z",
    "biotoolsCURIE": "biotools:pyfolding",
    "biotoolsID": "pyfolding",
    "collectionID": [
        "Proteomics"
    ],
    "credit": [
        {
            "email": "a.lowe@ucl.ac.uk",
            "name": "Alan R. Lowe",
            "orcidid": "https://orcid.org/0000-0002-0558-3597",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "A Python framework for graphing, analysis, and simulation of the biophysical properties of proteins.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://github.com/quantumjot/PyFolding/wiki"
        }
    ],
    "editPermission": {
        "authors": [
            "proteomics.bio.tools"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein folding analysis",
                    "uri": "http://edamontology.org/operation_2415"
                }
            ]
        }
    ],
    "homepage": "https://github.com/quantumjot/PyFolding",
    "language": [
        "Python"
    ],
    "lastUpdate": "2019-03-26T08:36:17Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/quantumjot/PyFolding/issues"
        }
    ],
    "name": "PyFolding",
    "operatingSystem": [
        "Mac",
        "Windows"
    ],
    "owner": "daniel_stefan",
    "publication": [
        {
            "doi": "10.1016/j.bpj.2017.11.3779",
            "metadata": {
                "abstract": "© 2017 Biophysical SocietyFor many years, curve-fitting software has been heavily utilized to fit simple models to various types of biophysical data. Although such software packages are easy to use for simple functions, they are often expensive and present substantial impediments to applying more complex models or for the analysis of large data sets. One field that is reliant on such data analysis is the thermodynamics and kinetics of protein folding. Over the past decade, increasingly sophisticated analytical models have been generated, but without simple tools to enable routine analysis. Consequently, users have needed to generate their own tools or otherwise find willing collaborators. Here we present PyFolding, a free, open-source, and extensible Python framework for graphing, analysis, and simulation of the biophysical properties of proteins. To demonstrate the utility of PyFolding, we have used it to analyze and model experimental protein folding and thermodynamic data. Examples include: 1) multiphase kinetic folding fitted to linked equations, 2) global fitting of multiple data sets, and 3) analysis of repeat protein thermodynamics with Ising model variants. Moreover, we demonstrate how PyFolding is easily extensible to novel functionality beyond applications in protein folding via the addition of new models. Example scripts to perform these and other operations are supplied with the software, and we encourage users to contribute notebooks and models to create a community resource. Finally, we show that PyFolding can be used in conjunction with Jupyter notebooks as an easy way to share methods and analysis for publication and among research teams.",
                "authors": [
                    {
                        "name": "Itzhaki L.S."
                    },
                    {
                        "name": "Lowe A.R."
                    },
                    {
                        "name": "Main E.R.G."
                    },
                    {
                        "name": "Perez-Riba A."
                    }
                ],
                "citationCount": 3,
                "date": "2018-02-06T00:00:00Z",
                "journal": "Biophysical Journal",
                "title": "PyFolding: Open-Source Graphing, Simulation, and Analysis of the Biophysical Properties of Proteins"
            },
            "pmcid": "PMC5985001",
            "pmid": "29414697",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Protein sites, features and motifs",
            "uri": "http://edamontology.org/topic_3510"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        }
    ],
    "validated": 1
}
