
{
    "credit": [
        {
            "email": "william.cannon@pnl.gov",
            "name": "William Cannon",
            "typeEntity": "Person",
            "typeRoles": [
                "Maintainer"
            ]
        },
        {
            "email": "webmaster@ms-utils.org",
            "typeEntity": "Person",
            "typeRoles": [
                "Documentor"
            ],
            "url": "http://ms-utils.org"
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "https://omics.pnl.gov/software-category/tutorials"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://omics.pnl.gov/software/MSPolygraph.php"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Blind peptide database search",
                    "uri": "http://edamontology.org/operation_3647"
                }
            ]
        }
    ],
    "labels": {
        "collectionID": [
            "ms-utils",
            "Proteomics"
        ],
        "language": [
            "C"
        ],
        "operatingSystem": [
            "Linux"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Proteomics",
                "uri": "http://edamontology.org/topic_0121"
            },
            {
                "term": "Proteomics experiment",
                "uri": "http://edamontology.org/topic_3520"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://ms-utils.org"
        }
    ],
    "publication": [
        {
            "abstract": "We evaluate statistical models used in two-hypothesis tests for identifying peptides from tandem mass spectrometry data. The null hypothesis H0, that a peptide matches a spectrum by chance, requires information on the probability of by-chance matches between peptide fragments and peaks in the spectrum. Likewise, the alternate hypothesis HA, that the spectrum is due to a particular peptide, requires probabilities that the peptide fragments would indeed be observed if it was the causative agent. We compare models for these probabilities by determining the identification rates produced by the models using an independent data set. The initial models use different probabilities depending on fragment ion type, but uniform probabilities for each ion type across all of the labile bonds along the backbone. More sophisticated models for probabilities under both HA and H0 are introduced that do not assume uniform probabilities for each ion type. In addition, the performance of these models using a standard likelihood model is compared to an information theory approach derived from the likelihood model. Also, a simple but effective model for incorporating peak intensities is described. Finally, a support-vector machine is used to discriminate between correct and incorrect identifications based on multiple characteristics of the scoring functions. The results are shown to reduce the misidentification rate significantly when compared to a benchmark cross-correlation based approach. © 2005 American Chemical Society.",
            "authors": [
                "Cannon W.R.",
                "Jarman K.H.",
                "Webb-Robertson B.-J.M.",
                "Baxter D.J.",
                "Oehmen C.S.",
                "Jarman K.D.",
                "Heredia-Langner A.",
                "Auberry K.J.",
                "Anderson G.A."
            ],
            "cit_count": 29,
            "journal": "Journal of Proteome Research",
            "pmid": "16212422",
            "title": "Comparison of probability and likelihood models for peptide identification from tandem mass spectrometry data",
            "year": "2005-09-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:mspolygraph",
        "biotoolsID": "mspolygraph",
        "description": "Open source hybrid database and spectral library MS/MS search engine.",
        "homepage": "http://omics.pnl.gov/software/MSPolygraph.php",
        "name": "MSPolygraph"
    }
}