{
    "additionDate": "2017-03-30T23:00:43Z",
    "biotoolsCURIE": "biotools:scertf",
    "biotoolsID": "scertf",
    "credit": [
        {
            "email": "stormo@wustl.edu",
            "name": "Gary D. Stormo",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "ScerTF catalogs over 1,200 position weight matrices (PWMs) for 196 different yeast transcription factors. ScerTF is useful for a wide range of problems, such as linking regulatory sites with transcription factors, identifying a transcription factor based on a user-input matrix, finding the genes bound/regulated by a particular TF, and finding regulatory interactions between transcription factors.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://stormo.wustl.edu/ScerTF/about/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Transcription factor binding site prediction",
                    "uri": "http://edamontology.org/operation_0445"
                },
                {
                    "term": "cis-regulatory element prediction",
                    "uri": "http://edamontology.org/operation_0441"
                }
            ]
        }
    ],
    "homepage": "http://stormo.wustl.edu/ScerTF/",
    "lastUpdate": "2018-12-10T12:58:53Z",
    "name": "ScerTF",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "Saccharomyces cerevisiae is a primary model for studies of transcriptional control, and the specificities of most yeast transcription factors (TFs) have been determined by multiple methods. However, it is unclear which position weight matrices (PWMs) are most useful; for the roughly 200 TFs in yeast, there are over 1200 PWMs in the literature. To address this issue, we created ScerTF, a comprehensive database of 1226 motifs from 11 different sources. We identified a single matrix for each TF that best predicts in vivo data by benchmarking matrices against chromatin immunoprecipitation and TF deletion experiments. We also used in vivo data to optimize thresholds for identifying regulatory sites with each matrix. To correct for biases from different methods, we developed a strategy to combine matrices. These aligned matrices outperform the best available matrix for several TFs. We used the matrices to predict co-occurring regulatory elements in the genome and identified many known TF combinations. In addition, we predict new combinations and provide evidence of combinatorial regulation from gene expression data. The database is available through a web interface at http://ural.wustl.edu/ScerTF. The site allows users to search the database with a regulatory site or matrix to identify the TFs most likely to bind the input sequence. © The Author(s) 2011. Published by Oxford University Press.",
                "authors": [
                    {
                        "name": "Spivak A.T."
                    },
                    {
                        "name": "Stormo G.D."
                    }
                ],
                "citationCount": 47,
                "date": "2012-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "ScerTF: A comprehensive database of benchmarked position weight matrices for Saccharomyces species"
            },
            "pmid": "22140105"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Gene regulation",
            "uri": "http://edamontology.org/topic_0204"
        }
    ],
    "validated": 1
}