{
    "additionDate": "2018-05-06T11:28:11Z",
    "biotoolsCURIE": "biotools:mitofish",
    "biotoolsID": "mitofish",
    "credit": [
        {
            "email": "mitofish@aori.u-tokyo.ac.jp",
            "name": "Wataru Iwasaki",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Mitochondrial genome database of fish with an accurate and automatic annotation pipeline.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://mitofish.aori.u-tokyo.ac.jp/about/overview.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                }
            ]
        }
    ],
    "homepage": "http://mitofish.aori.u-tokyo.ac.jp/",
    "lastUpdate": "2018-12-10T12:58:57Z",
    "name": "MitoFish",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1093/MOLBEV/MST141",
            "metadata": {
                "abstract": "Mitofish is a database of fish mitochondrial genomes (mitogenomes) that includes powerful and precise de novo annotations for mitogenome sequences. Fish occupy an important position in the evolution of vertebrates and the ecology of the hydrosphere, and mitogenomic sequence data have served as a rich source of information for resolving fish phylogenies and identifying new fish species. The importance of a mitogenomic database continues to grow at a rapid pace as massive amounts of mitogenomic data are generated with the advent of new sequencing technologies. A severe bottleneck seems likely to occur with regard to mitogenome annotation because of the overwhelming pace of data accumulation and the intrinsic difficulties in annotating sequences with degenerating transfer RNA structures, divergent start/stop codons of the coding elements, and the overlapping of adjacent elements. To ease this data backlog, we developed an annotation pipeline named MitoAnnotator. MitoAnnotator automatically annotates a fish mitogenome with a high degree of accuracy in approximately 5 min; thus, it is readily applicable to data sets of dozens of sequences. MitoFish also contains re-annotations of previously sequenced fish mitogenomes, enabling researchers to refer to them when they find annotations that are likely to be erroneous or while conducting comparative mitogenomic analyses. For users who need more information on the taxonomy, habitats, phenotypes, or life cycles of fish, MitoFish provides links to related databases. MitoFish and MitoAnnotator are freely available at http://mitofish.aori.u-tokyo.ac.jp/ (last accessed August 28, 2013); all of the data can be batch downloaded, and the annotation pipeline can be used via a web interface. © The Author 2013.",
                "authors": [
                    {
                        "name": "Iwasaki W."
                    },
                    {
                        "name": "Fukunaga T."
                    },
                    {
                        "name": "Isagozawa R."
                    },
                    {
                        "name": "Yamada K."
                    },
                    {
                        "name": "Maeda Y."
                    },
                    {
                        "name": "Satoh T.P."
                    },
                    {
                        "name": "Sado T."
                    },
                    {
                        "name": "Mabuchi K."
                    },
                    {
                        "name": "Takeshima H."
                    },
                    {
                        "name": "Miya M."
                    },
                    {
                        "name": "Nishida M."
                    }
                ],
                "citationCount": 406,
                "date": "2013-11-01T00:00:00Z",
                "journal": "Molecular Biology and Evolution",
                "title": "Mitofish and mitoannotator: A mitochondrial genome database of fish with an accurate and automatic annotation pipeline"
            },
            "pmcid": "PMC3808866",
            "pmid": "23955518"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Zoology",
            "uri": "http://edamontology.org/topic_3500"
        },
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        }
    ],
    "validated": 1
}