{"credit":[{"email":"wtembe@tgen.org","name":"Waibhav Tembe","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"http://www.cs.gettysburg.edu/~lalvsa01/gsqz/tutorial.html"}],"function":[{"operation":[{"term":"Optimisation and refinement","uri":"http://edamontology.org/operation_2425"},{"term":"Formatting","uri":"http://edamontology.org/operation_0335"}]}],"labels":{"language":["Python"],"operatingSystem":["Linux","Windows","Mac"],"toolType":["Web application"],"topic":[{"term":"Data management","uri":"http://edamontology.org/topic_3071"},{"term":"Applied mathematics","uri":"http://edamontology.org/topic_3569"}]},"publication":[{"abstract":"Summary: Large volumes of data generated by high-throughput sequencing instruments present non-trivial challenges in data storage, content access and transfer. We present G-SQZ, a Huffman coding-based sequencing-reads-specific representation scheme that compresses data without altering the relative order. G-SQZ has achieved from 65% to 81% compression on benchmark datasets, and it allows selective access without scanning and decoding from start. This article focuses on describing the underlying encoding scheme and its software implementation, and a more theoretical problem of optimal compression is out of scope. The immediate practical benefits include reduced infrastructure and informatics costs in managing and analyzing large sequencing data. © The Author 2010. Published by Oxford University Press.","authors":["Tembe W.","Lowey J.","Suh E."],"cit_count":62,"journal":"Bioinformatics","pmid":"20605925","title":"G-SQZ: Compact encoding of genomic sequence and quality data","year":"2010-07-06"}],"summary":{"biotoolsCURIE":"biotools:g-sqz","biotoolsID":"g-sqz","description":"Huffman coding-based sequencing-reads specific representation scheme that compresses data without altering the relative order. It allows selective access without scanning and decoding form start","homepage":"http://www.cs.gettysburg.edu/~lalvsa01/gsqz/project.html","name":"G-SQZ"}}