{
    "additionDate": "2021-03-19T09:19:48Z",
    "biotoolsCURIE": "biotools:fad-bert",
    "biotoolsID": "fad-bert",
    "confidence_flag": "tool",
    "description": "Improved prediction of FAD binding sites using pre-training of deep bidirectional transformers.\n\nA web server for predicting of FAD Binding Sites Using Pre-training of Deep Bidirectional Transformers.\n\nDuring cellular respiration in general and electron transport chain in particular, flavin adenine dinucleotide (FAD) plays a vital role.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Binding site prediction",
                    "uri": "http://edamontology.org/operation_2575"
                }
            ]
        }
    ],
    "homepage": "http://140.138.155.216/fadbert/",
    "lastUpdate": "2021-04-29T05:42:43.018399Z",
    "name": "FAD-BERT",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1016/J.COMPBIOMED.2021.104258",
            "metadata": {
                "abstract": "© 2021 Elsevier LtdThe electron transport chain is a series of protein complexes embedded in the process of cellular respiration, which is an important process to transfer electrons and other macromolecules throughout the cell. Identifying Flavin Adenine Dinucleotide (FAD) binding sites in the electron transport chain is vital since it helps biological researchers precisely understand how electrons are produced and are transported in cells. This study distills and analyzes the contextualized word embedding from pre-trained BERT models to explore similarities in natural language and protein sequences. Thereby, we propose a new approach based on Pre-training of Bidirectional Encoder Representations from Transformers (BERT), Position-specific Scoring Matrix profiles (PSSM), Amino Acid Index database (AAIndex) to predict FAD-binding sites from the transport proteins which are found in nature recently. Our proposed approach archives 85.14% accuracy and improves accuracy by 11%, with Matthew's correlation coefficient of 0.39 compared to the previous method on the same independent set. We also deploy a web server that identifies FAD-binding sites in electron transporters available for academics at http://140.138.155.216/fadbert/.",
                "authors": [
                    {
                        "name": "Ho Q.-T."
                    },
                    {
                        "name": "Nguyen T.-T.-D."
                    },
                    {
                        "name": "Khanh Le N.Q."
                    },
                    {
                        "name": "Ou Y.-Y."
                    }
                ],
                "date": "2021-04-01T00:00:00Z",
                "journal": "Computers in Biology and Medicine",
                "title": "FAD-BERT: Improved prediction of FAD binding sites using pre-training of deep bidirectional transformers"
            },
            "pmid": "33601085"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Natural language processing",
            "uri": "http://edamontology.org/topic_0218"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Structure prediction",
            "uri": "http://edamontology.org/topic_0082"
        }
    ]
}