{
    "additionDate": "2023-03-17T17:19:02.291920Z",
    "biotoolsCURIE": "biotools:dcsau_net",
    "biotoolsID": "dcsau_net",
    "confidence_flag": "tool",
    "credit": [
        {
            "name": "Wenting Duan"
        }
    ],
    "description": "A deeper and more compact split-attention U-Net for medical image segmentation.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                }
            ]
        }
    ],
    "homepage": "https://github.com/xq141839/DCSAU-Net",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T14:54:30.658447Z",
    "license": "Apache-2.0",
    "name": "DCSAU-Net",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1016/j.compbiomed.2023.106626",
            "metadata": {
                "abstract": "Deep learning architecture with convolutional neural network achieves outstanding success in the field of computer vision. Where U-Net has made a great breakthrough in biomedical image segmentation and has been widely applied in a wide range of practical scenarios. However, the equal design of every downsampling layer in the encoder part and simply stacked convolutions do not allow U-Net to extract sufficient information of features from different depths. The increasing complexity of medical images brings new challenges to the existing methods. In this paper, we propose a deeper and more compact split-attention u-shape network, which efficiently utilises low-level and high-level semantic information based on two frameworks: primary feature conservation and compact split-attention block. We evaluate the proposed model on CVC-ClinicDB, 2018 Data Science Bowl, ISIC-2018, SegPC-2021 and BraTS-2021 datasets. As a result, our proposed model displays better performance than other state-of-the-art methods in terms of the mean intersection over union and dice coefficient. More significantly, the proposed model demonstrates excellent segmentation performance on challenging images. The code for our work and more technical details can be found at https://github.com/xq141839/DCSAU-Net.",
                "authors": [
                    {
                        "name": "Duan W."
                    },
                    {
                        "name": "HE N."
                    },
                    {
                        "name": "Ma Z."
                    },
                    {
                        "name": "Xu Q."
                    }
                ],
                "citationCount": 133,
                "date": "2023-03-01T00:00:00Z",
                "journal": "Computers in Biology and Medicine",
                "title": "DCSAU-Net: A deeper and more compact split-attention U-Net for medical image segmentation"
            },
            "pmid": "36736096"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        },
        {
            "term": "Medicine",
            "uri": "http://edamontology.org/topic_3303"
        }
    ]
}
