{
    "additionDate": "2019-11-14T19:28:08Z",
    "biotoolsCURIE": "biotools:eagle-enhancer",
    "biotoolsID": "eagle-enhancer",
    "confidence_flag": "tool",
    "description": "An algorithm that utilizes a small number of genomic features to predict tissue/cell type-specific enhancer-gene interactions | Enhancer And Gene Learning Ensemble method | EAGLE: an algorithm that utilizes small number of genomic features to predict tissue/cell type specific enhancer-gene interactions | EAGLE used all six features only derived from the enhancers and gene expression datasets, without providing more information like histone modification, methylation or other enhancer-gene (EG) detection datasets",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                },
                {
                    "term": "Transcriptional regulatory element prediction",
                    "uri": "http://edamontology.org/operation_0438"
                }
            ]
        }
    ],
    "homepage": "https://github.com/EvansGao/EAGLE",
    "language": [
        "MATLAB",
        "Perl"
    ],
    "lastUpdate": "2020-12-25T11:17:20Z",
    "name": "EAGLE",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1101/781427"
        },
        {
            "doi": "10.1371/journal.pcbi.1007436",
            "metadata": {
                "abstract": "© 2019 Gao, Qian. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Long-range regulation by distal enhancers is crucial for many biological processes. The existing methods for enhancer-target gene prediction often require many genomic features. This makes them difficult to be applied to many cell types, in which the relevant datasets are not always available. Here, we design a tool EAGLE, an enhancer and gene learning ensemble method for identification of Enhancer-Gene (EG) interactions. Unlike existing tools, EAGLE used only six features derived from the genomic features of enhancers and gene expression datasets. Cross-validation revealed that EAGLE outperformed other existing methods. Enrichment analyses on special transcriptional factors, epigenetic modifications, and eQTLs demonstrated that EAGLE could distinguish the interacting pairs from non- interacting ones. Finally, EAGLE was applied to mouse and human genomes and identified 7,680,203 and 7,437,255 EG interactions involving 31,375 and 43,724 genes, 138,547 and 177,062 enhancers across 89 and 110 tissue/cell types in mouse and human, respectively. The obtained interactions are accessible through an interactive database enhanceratlas.org. The EAGLE method is available at https://github.com/EvansGao/ EAGLE and the predicted datasets are available in http://www.enhanceratlas.org/.",
                "authors": [
                    {
                        "name": "Gao T."
                    },
                    {
                        "name": "Qian J."
                    }
                ],
                "citationCount": 2,
                "date": "2019-01-01T00:00:00Z",
                "journal": "PLoS Computational Biology",
                "title": "Eagle: An algorithm that utilizes a small number of genomic features to predict tissue/ cell type-specific enhancer-gene interactions"
            },
            "pmcid": "PMC6821050",
            "pmid": "31665135"
        }
    ],
    "topic": [
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ],
    "validated": 1
}