{
    "additionDate": "2017-01-17T15:02:08Z",
    "biotoolsCURIE": "biotools:edaseq",
    "biotoolsID": "edaseq",
    "collectionID": [
        "BioConductor"
    ],
    "credit": [
        {
            "email": "risso.davide@gmail.com",
            "name": "Davide Risso",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Numerical and graphical summaries of RNA-Seq read data. Within-lane normalization procedures to adjust for GC-content effect (or other gene-level effects) on read counts: loess robust local regression, global-scaling, and full-quantile normalization (Risso et al., 2011). Between-lane normalization procedures to adjust for distributional differences between lanes (e.g., sequencing depth): global-scaling and full-quantile normalization (Bullard et al., 2010).",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://bioconductor.org/packages/release/bioc/html/EDASeq.html"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://bioconductor/packages/release/bioc/src/contrib/EDASeq_2.8.0.tar.gz"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence visualisation",
                    "uri": "http://edamontology.org/operation_0564"
                },
                {
                    "term": "RNA-Seq analysis",
                    "uri": "http://edamontology.org/operation_3680"
                }
            ]
        }
    ],
    "homepage": "http://bioconductor.org/packages/release/bioc/html/EDASeq.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2019-01-10T15:11:08Z",
    "license": "Artistic-2.0",
    "link": [
        {
            "type": [
                "Mirror"
            ],
            "url": "https://github.com/drisso/EDASeq"
        }
    ],
    "name": "EDASeq",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "bioconductor_import",
    "publication": [
        {
            "doi": "10.1186/1471-2105-15-188",
            "metadata": {
                "abstract": "Background: Transcriptome sequencing is a powerful tool for measuring gene expression, but as well as some other technologies, various artifacts and biases affect the quantification. In order to correct some of them, several normalization approaches have emerged, differing both in the statistical strategy employed and in the type of corrected biases. However, there is no clear standard normalization method.Results: We present a novel methodology to normalize RNA-Seq data, taking into account transcript size, GC content, and sequencing depth, which are the major quantification-related biases. In this study, we found that transcripts shorter than 600 bp have an underestimated expression level, while longer transcripts are even more overestimated that they are long. Second, it was well known that the higher the GC content (>50%), the more the transcripts are underestimated. Third, we demonstrated that the sequencing depth impacts the size bias and proposed a correction allowing the comparison of expression levels among many samples. The efficiency of our approach was then tested by comparing the correlation between normalized RNA-Seq data and qRT-PCR expression measurements. All the steps are automated in a program written in Perl and available on request.Conclusions: The methodology presented in this article identifies and corrects different biases that influence RNA-Seq quantification, and provides more accurate estimations of gene expression levels. This method can be applied to compare expression quantifications from many samples, but preferentially from the same tissue. In order to compare samples from different tissue, a calibration using several reference genes will be required. © 2014 Filloux et al.; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Filloux C."
                    },
                    {
                        "name": "Cedric M."
                    },
                    {
                        "name": "Romain P."
                    },
                    {
                        "name": "Lionel F."
                    },
                    {
                        "name": "Christophe K."
                    },
                    {
                        "name": "Dominique R."
                    },
                    {
                        "name": "Abderrahman M."
                    },
                    {
                        "name": "Daniel P."
                    }
                ],
                "citationCount": 10,
                "date": "2014-06-14T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "An integrative method to normalize RNA-Seq data"
            },
            "pmcid": "PMC4067528",
            "pmid": "24929920",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool",
        "Library"
    ],
    "topic": [
        {
            "term": "RNA-seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        }
    ],
    "validated": 1,
    "version": [
        "2.8.0"
    ]
}