{
    "accessibility": "Open access",
    "additionDate": "2022-07-20T07:08:20.759103Z",
    "biotoolsCURIE": "biotools:deepseparator",
    "biotoolsID": "deepseparator",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Junjie Yu"
        },
        {
            "name": "Quanying Liu",
            "orcidid": "https://orcid.org/0000-0002-2501-7656"
        }
    ],
    "description": "An deep learning framework to separate neural signal and artifacts in the embedding space and reconstruct the denoised signal",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://github.com/ncclabsustech/DeepSeparator",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-07-20T07:08:20.762131Z",
    "license": "Not licensed",
    "name": "DeepSeparator",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1088/1741-2552/AC63EB",
            "metadata": {
                "abstract": "© 2022 The Author(s). Published by IOP Publishing Ltd.Objective. Electroencephalogram (EEG) recordings are often contaminated with artifacts. Various methods have been developed to eliminate or weaken the influence of artifacts. However, most of them rely on prior experience for analysis. Approach. Here, we propose an deep learning framework to separate neural signal and artifacts in the embedding space and reconstruct the denoised signal, which is called DeepSeparator. DeepSeparator employs an encoder to extract and amplify the features in the raw EEG, a module called decomposer to extract the trend, detect and suppress artifact and a decoder to reconstruct the denoised signal. Besides, DeepSeparator can extract the artifact, which largely increases the model interpretability. Main results. The proposed method is tested with a semi-synthetic EEG dataset and a real task-related EEG dataset, suggesting that DeepSeparator outperforms the conventional models in both EOG and EMG artifact removal. Significance. DeepSeparator can be extended to multi-channel EEG and data with any arbitrary length. It may motivate future developments and application of deep learning-based EEG denoising. The code for DeepSeparator is available at https://github.com/ncclabsustech/DeepSeparator.",
                "authors": [
                    {
                        "name": "Li C."
                    },
                    {
                        "name": "Liu Q."
                    },
                    {
                        "name": "Lou K."
                    },
                    {
                        "name": "Wei C."
                    },
                    {
                        "name": "Yu J."
                    }
                ],
                "date": "2022-04-01T00:00:00Z",
                "journal": "Journal of Neural Engineering",
                "title": "Embedding decomposition for artifacts removal in EEG signals"
            },
            "pmid": "35378524"
        }
    ],
    "toolType": [
        "Workbench"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        }
    ]
}
