{
    "additionDate": "2017-05-16T12:28:18Z",
    "biotoolsCURIE": "biotools:align-gvgd",
    "biotoolsID": "align-gvgd",
    "credit": [
        {
            "email": "mathee@mail.nih.gov",
            "name": "Ewy Mathe",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "sean.tavtigian@hci.utah.edu",
            "name": "Sean Tavtigian",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "A freely available, web-based program that combines the biophysical characteristics of amino acids and protein multiple sequence alignments to predict where missense substitutions in genes of interest fall in a spectrum from enriched delterious to enriched neutral. Align-GVGD is an extension of the original Grantham difference to multiple sequence alignments and true simultaneous multiple comparisons.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://agvgd.hci.utah.edu/help.php"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                },
                {
                    "term": "Multiple sequence alignment",
                    "uri": "http://edamontology.org/operation_0492"
                },
                {
                    "term": "Polymorphism detection",
                    "uri": "http://edamontology.org/operation_3202"
                },
                {
                    "term": "Sequence alignment",
                    "uri": "http://edamontology.org/operation_0292"
                },
                {
                    "term": "Sequence alignment analysis (conservation)",
                    "uri": "http://edamontology.org/operation_0448"
                }
            ]
        }
    ],
    "homepage": "http://agvgd.hci.utah.edu/",
    "lastUpdate": "2024-11-24T20:58:18.344277Z",
    "name": "Align-GVGD",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "doi": "10.1093/nar/gkj518",
            "metadata": {
                "abstract": "Prediction of the biological effect of missense substitutions has become important because they are often observed in known or candidate disease susceptibility genes. In this paper, we carried out a 3-step analysis of 1514 missense substitutions in the DNA-binding domain (DBD) of TP53, the most frequently mutated gene in human cancers. First, we calculated two types of conservation scores based on a TP53 multiple sequence alignment (MSA) for each substitution: (i) Grantham Variation (GV), which measures the degree of biochemical variation among amino acids found at a given position in the MSA; (ii) Grantham Deviation (GD), which reflects the 'biochemical distance' of the mutant amino acid from the observed amino acid at a particular position (given by GV). Second, we used a method that combines GV and GD scores, Align-GVGD, to predict the transactivation activity of each missense substitution. We compared our predictions against experimentally measured transactivation activity (yeast assays) to evaluate their accuracy. Finally, the prediction results were compared with those obtained by the program Sorting Intolerant from Tolerant (SIFT) and Dayhoff's classification. Our predictions yielded high prediction accuracy for mutants showing a loss of transactivation (∼88% specificity) with lower prediction accuracy for mutants with transactivation similar to that of the wild-type (67.9 to 71.2% sensitivity). Align-GVGD results were comparable to SIFT (88.3 to 90.6% and 67.4 to 70.3% specificity and sensitivity, respectively) and outperformed Dayhoff's classification (80 and 40.9% specificity and sensitivity, respectively). These results further demonstrate the utility of the Align-GVGD method, which was previously applied to BRCA1. Align-GVGD is available online at http://agvgd.iarc.fr. © 2006 Oxford University Press.",
                "authors": [
                    {
                        "name": "Hainaut P."
                    },
                    {
                        "name": "Ishioka C."
                    },
                    {
                        "name": "Kato S."
                    },
                    {
                        "name": "Mathe E."
                    },
                    {
                        "name": "Olivier M."
                    },
                    {
                        "name": "Tavtigian S.V."
                    }
                ],
                "citationCount": 281,
                "date": "2006-04-10T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "Computational approaches for predicting the biological effect of p53 missense mutations: A comparison of three sequence analysis based methods"
            },
            "pmcid": "PMC1390679",
            "pmid": "16522644"
        },
        {
            "doi": "10.1136/jmg.2005.033878",
            "metadata": {
                "abstract": "Background: Genetic testing for hereditary cancer syndromes contributes to the medical management of patients who may be at increased risk of one or more cancers. BRCA1 and BRCA2 testing for hereditary breast and ovarian cancer is one such widely used test. However, clinical testing methods with high sensitivity for deleterious mutations in these genes also detect many unclassified variants, primarily missense substitutions. Methods: We developed an extension of the Grantham difference, called A-GVGD, to score missense substitutions against the range of variation present at their position in a multiple sequence alignment. Combining two methods, co-occurrence of unclassified variants with clearly deleterious mutations and A-GVGD, we analysed most of the missense substitutions observed in BRCA1. Results: A-GVGD was able to resolve known neutral and deleterious missense substitutions into distinct sets. Additionally, eight previously unclassified BRCA1 missense substitutions observed in trans with one or more deleterious mutations, and within the cross-species range of variation observed at their position in the protein, are now classified as neutral. Discussion: The methods combined here can classify as neutral about 50% of missense substitutions that have been observed with two or more clearly deleterious mutations. Furthermore, odds ratios estimated for sets of substitutions grouped by A-GVGD scores are consistent with the hypothesis that most unclassified substitutions that are within the cross-species range of variation at their position in BRCA1 are also neutral. For most of these, clinical reclassification will require integrated application of other methods such as pooled family histories, segregation analysis, or validated functional assay.",
                "authors": [
                    {
                        "name": "De Silva D."
                    },
                    {
                        "name": "Deffenbaugh A.M."
                    },
                    {
                        "name": "Judkins T."
                    },
                    {
                        "name": "Samollow P.B."
                    },
                    {
                        "name": "Scholl T."
                    },
                    {
                        "name": "Tavtigian S.V."
                    },
                    {
                        "name": "Thomas A."
                    },
                    {
                        "name": "Yin L."
                    },
                    {
                        "name": "Zharkikh A."
                    }
                ],
                "citationCount": 568,
                "date": "2006-04-01T00:00:00Z",
                "journal": "Journal of Medical Genetics",
                "title": "Comprehensive statistical study of 452 BRCA1 missense substitutions with classification of eight recurrent substitutions as neutral"
            },
            "pmcid": "PMC2563222",
            "pmid": "16014699"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Biophysics",
            "uri": "http://edamontology.org/topic_3306"
        },
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ],
    "validated": 1
}
