{"credit":[{"name":"Nicolas M. Schmelling","typeEntity":"Person","typeRoles":["Primary contact"]}],"function":[{"operation":[{"term":"Prediction and recognition","uri":"http://edamontology.org/operation_2423"},{"term":"Sequence alignment","uri":"http://edamontology.org/operation_0292"}]}],"labels":{"accessibility":["Open access"],"cost":"Free of charge","language":["Python"],"license":"Unlicense","maturity":"Mature","operatingSystem":["Linux","Mac"],"toolType":["Command-line tool"],"topic":[{"term":"Bioinformatics","uri":"http://edamontology.org/topic_0091"},{"term":"Phylogenomics","uri":"http://edamontology.org/topic_0194"},{"term":"Phylogenetics","uri":"http://edamontology.org/topic_3293"},{"term":"Comparative genomics","uri":"http://edamontology.org/topic_0797"},{"term":"Sequence analysis","uri":"http://edamontology.org/topic_0080"}]},"publication":[{"abstract":"Reciprocal Best Hits (RBH) are a common proxy for orthology in comparative genomics. Essentially, a RBH is found when the proteins encoded by two genes, each in a different genome, find each other as the best scoring match in the other genome. NCBI's BLAST is the software most usually used for the sequence comparisons necessary to finding RBHs. Since sequence comparison can be time consuming, we decided to compare the number and quality of RBHs detected using algorithms that run in a fraction of the time as BLAST. We tested BLAT, LAST and UBLAST. All three programs ran in a hundredth to a 25th of the time required to run BLAST. A reduction in the number of homologs and RBHs found by the faster algorithms compared to BLAST becomes apparent as the genomes compared become more dissimilar, with BLAT, a program optimized for quickly finding very similar sequences, missing both the most homologs and the most RBHs. Though LAST produced the closest number of homologs and RBH to those produced with BLAST, UBLAST was very close, with either program producing between 0.6 and 0.8 of the RBHs as BLAST between dissimilar genomes, while in more similar genomes the differences were barely apparent. UBLAST ran faster than LAST, making it the best option among the programs tested. © 2014 Ward, Moreno-Hagelsieb.","authors":["Ward N.","Moreno-Hagelsieb G."],"cit_count":50,"doi":"10.1371/journal.pone.0101850","journal":"PLoS ONE","pmid":"25013894","title":"Quickly finding orthologs as reciprocal best hits with BLAT, LAST, and UBLAST: How much do we miss?","type":"Method","year":"2014-07-11"},{"abstract":"Previously, we presented evidence that it is possible to predict functional coupling between genes based on conservation of gene clusters between genomes. With the rapid increase in the availability of prokaryotic sequence data, it has become possible to verify and apply the technique. In this paper, we extend our characterization of the parameters that determine the utility of the approach, and we generalize the approach in a way that supports detection of common classes of functionally coupled genes (e.g., transport and signal transduction clusters). Now that the analysis includes over 30 complete or nearly complete genomes, it has become clear that this approach will play a significant role in supporting efforts to assign functionality to the remaining uncharacterized genes in sequenced genomes.","authors":["Overbeek R.","Fonstein M.","D'Souza M.","Push G.D.","Maltsev N."],"cit_count":905,"doi":"10.1073/pnas.96.6.2896","journal":"Proceedings of the National Academy of Sciences of the United States of America","pmid":"10077608","title":"The use of gene clusters to infer functional coupling","type":"Method","year":"1999-03-16"}],"summary":{"biotoolsCURIE":"biotools:Reciprocal_Best_Hits_-_Best_Bidirectional_Hits","biotoolsID":"Reciprocal_Best_Hits_-_Best_Bidirectional_Hits","description":"Reciprocal Best Hits (RBH) are a common proxy for orthology in comparative genomics. Essentially, a RBH is found when the proteins encoded by two genes, each in a different genome, find each other as the best scoring match in the other genome. NCBI's BLAST is the software most usually used for the sequence comparisons necessary to finding RBHs.","homepage":"https://www.protocols.io/view/reciprocal-best-hit-blast-q3rdym6","name":"Reciprocal Best Hits - Best Bidirectional Hits"}}