{
    "accessibility": "Open access",
    "additionDate": "2023-12-21T11:47:25.595532Z",
    "biotoolsCURIE": "biotools:decoil",
    "biotoolsID": "decoil",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "frances@cheme.caltech.edu",
            "name": "Frances H. Arnold",
            "typeEntity": "Person"
        }
    ],
    "description": "Optimization of degenerate codon libraries for machine learning-assisted protein engineering.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "PCR primer design",
                    "uri": "http://edamontology.org/operation_0308"
                },
                {
                    "term": "Side chain modelling",
                    "uri": "http://edamontology.org/operation_0480"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/jsunn-y/DeCOIL",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T14:27:15.459282Z",
    "name": "DeCOIL",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1021/acssynbio.3c00301",
            "metadata": {
                "abstract": "With advances in machine learning (ML)-assisted protein engineering, models based on data, biophysics, and natural evolution are being used to propose informed libraries of protein variants to explore. Synthesizing these libraries for experimental screens is a major bottleneck, as the cost of obtaining large numbers of exact gene sequences is often prohibitive. Degenerate codon (DC) libraries are a cost-effective alternative for generating combinatorial mutagenesis libraries where mutations are targeted to a handful of amino acid sites. However, existing computational methods to optimize DC libraries to include desired protein variants are not well suited to design libraries for ML-assisted protein engineering. To address these drawbacks, we present DEgenerate Codon Optimization for Informed Libraries (DeCOIL), a generalized method that directly optimizes DC libraries to be useful for protein engineering: to sample protein variants that are likely to have both high fitness and high diversity in the sequence search space. Using computational simulations and wet-lab experiments, we demonstrate that DeCOIL is effective across two specific case studies, with the potential to be applied to many other use cases. DeCOIL offers several advantages over existing methods, as it is direct, easy to use, generalizable, and scalable. With accompanying software (https://github.com/jsunn-y/DeCOIL), DeCOIL can be readily implemented to generate desired informed libraries.",
                "authors": [
                    {
                        "name": "Arnold F.H."
                    },
                    {
                        "name": "Ducharme J."
                    },
                    {
                        "name": "Johnston K.E."
                    },
                    {
                        "name": "Li F.-Z."
                    },
                    {
                        "name": "Yang J."
                    },
                    {
                        "name": "Yue Y."
                    }
                ],
                "citationCount": 8,
                "date": "2023-08-18T00:00:00Z",
                "journal": "ACS Synthetic Biology",
                "title": "DeCOIL: Optimization of Degenerate Codon Libraries for Machine Learning-Assisted Protein Engineering"
            },
            "pmid": "37524064"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Biophysics",
            "uri": "http://edamontology.org/topic_3306"
        },
        {
            "term": "Protein variants",
            "uri": "http://edamontology.org/topic_3120"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
