
{
    "credit": [
        {
            "name": "ugent.be",
            "typeEntity": "Institute",
            "typeRoles": [
                "Provider"
            ]
        },
        {
            "email": "Tim.Demeyer@ugent.be",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://www.biobix.be/viralmbd/"
        }
    ],
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "DNA sequence (raw)",
                        "uri": "http://edamontology.org/data_3497"
                    },
                    "format": [
                        {
                            "term": "FASTQ-like format",
                            "uri": "http://edamontology.org/format_2545"
                        }
                    ]
                }
            ],
            "operation": [
                {
                    "term": "Nucleic acid feature detection",
                    "uri": "http://edamontology.org/operation_0415"
                }
            ]
        }
    ],
    "labels": {
        "collectionID": [
            "BIG N2N",
            "UGent"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Sequence analysis",
                "uri": "http://edamontology.org/topic_0080"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© 2015 Mensaert, Van Criekinge, Thas, Schuuring, Steenbergen, Wisman and De Meyer.Most next generation sequencing experiments generate more data than is usable for the experimental set up. For example, methyl-CpG binding domain (MBD) affinity purification based sequencing is often used for DNA-methylation profiling, but up to 30% of the sequenced fragments cannot be mapped uniquely to the reference genome. Here we present and evaluate a methodology for the identification of viruses in these otherwise unused paired-end MBD-seq data. Viral detection is accomplished by mapping non-reference alignable reads to a comprehensive set of viral genomes. As viruses play an important role in epigenetics and cancer development, 92 (pre)malignant and benign samples, originating from two different collections of cervical samples and related cell lines, were used in this study. These samples include primary carcinomas (n = 22), low- and high-grade cervical intraepithelial neoplasia (CIN1 and CIN2/3 - n = 2/n = 30) and normal tissue (n = 20), as well as control samples (n = 17). Viruses that were detected include phages, adenoviruses, herpesviridae and HPV. HPV, which causes virtually all cervical cancers, was identified in 95% of the carcinomas, 100% of the CIN2/3 samples, both CIN1 samples and in 55% of the normal samples. Comparing the amount of mapped fragments on HPV for each HPV-infected sample yielded a significant difference between normal samples and carcinomas or CIN2/3 samples (adjusted p-values resp. <10-5, <10-5), reflecting different viral loads and/or methylation degrees in non-normal samples. Fragments originating from different HPV types could be distinguished and were independently validated by PCR-based assays in 71% of the detections. In conclusion, although limited by the a priori knowledge of viral reference genome sequences, the proposed methodology can provide a first confined but substantial insight into the presence, concentration and types of methylated viral sequences in MBD-seq data at low additional cost.",
            "authors": [
                "Mensaert K.",
                "Van Criekinge W.",
                "Thas O.",
                "Schuuring E.",
                "Steenbergen R.D.M.",
                "Wisman G.B.A.",
                "De Meyer T."
            ],
            "cit_count": 3,
            "doi": "10.3389/fgene.2015.00016",
            "journal": "Frontiers in Genetics",
            "title": "Mining for viral fragments in methylation enriched sequencing data",
            "type": "Primary",
            "year": "2015-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:viralmbd",
        "biotoolsID": "viralmbd",
        "description": "Viral fragment detection in MBD-seq data.",
        "homepage": "http://www.biobix.be/viralmbd/",
        "name": "ViralMBD",
        "version": [
            "1"
        ]
    }
}