{
    "additionDate": "2019-11-14T17:59:46Z",
    "biotoolsCURIE": "biotools:EvoFreq",
    "biotoolsID": "EvoFreq",
    "confidence_flag": "tool",
    "description": "Visualization of the Evolutionary Frequencies of Sequence and Model Data | Evolutionary frequency visualization tool of temporal data | Users have options ot install EvoFreq depending on if they want to use 'devtools'. Below we show two popular methods for installation. You will need a fully operational install of R (≥3.5.0) and, optionally, RStudio | Visualization Package for Evolutionary Dynamics from Sequence and Model Data. biorxiv pre-print here",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Parsing",
                    "uri": "http://edamontology.org/operation_1812"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://github.com/MathOnco/EvoFreq",
    "language": [
        "R"
    ],
    "lastUpdate": "2020-12-28T14:30:33Z",
    "license": "GPL-3.0",
    "name": "EvoFreq",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1101/743815"
        },
        {
            "doi": "10.1186/s12859-019-3173-y",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: High throughput sequence data has provided in depth means of molecular characterization of populations. When recorded at numerous time steps, such data can reveal the evolutionary dynamics of the population under study by tracking the changes in genotype frequencies over time. This necessitates a simple and flexible means of visualizing an increasingly complex set of data. Results: Here we offer EvoFreq as a comprehensive tool set to visualize the evolutionary and population frequency dynamics of clones at a single point in time or as population frequencies over time using a variety of informative methods. EvoFreq expands substantially on previous means of visualizing the clonal, temporal dynamics and offers users a range of options for displaying their sequence or model data. Conclusions: EvoFreq, implemented in R with robust user options and few dependencies, offers a high-throughput means of quickly building, and interrogating the temporal dynamics of hereditary information across many systems. EvoFreq is freely available via https://github.com/MathOnco/EvoFreq.",
                "authors": [
                    {
                        "name": "Gatenbee C.D."
                    },
                    {
                        "name": "Schenck R.O."
                    },
                    {
                        "name": "Bravo R.R."
                    },
                    {
                        "name": "Anderson A.R.A."
                    }
                ],
                "citationCount": 3,
                "date": "2019-12-16T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "EvoFreq: visualization of the Evolutionary Frequencies of sequence and model data"
            },
            "pmcid": "PMC6916070",
            "pmid": "31842729"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        }
    ],
    "validated": 1
}