{
    "additionDate": "2021-01-18T12:31:09Z",
    "biotoolsCURIE": "biotools:lct",
    "biotoolsID": "lct",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "munoz@uni-mainz.de",
            "name": "Pablo Mier ,",
            "typeEntity": "Person"
        }
    ],
    "description": "Assessing the low complexity of protein sequences via the low complexity triangle.\n\nLCT is a tool that analyzes a protein sequence and portrays its Low Complexity Triangle with information derived from its repeatability. You can read more about the Low Complexity Triangle here. LCT follows the following steps:.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence complexity calculation",
                    "uri": "http://edamontology.org/operation_0234"
                },
                {
                    "term": "Splitting",
                    "uri": "http://edamontology.org/operation_3359"
                },
                {
                    "term": "Protein disorder prediction",
                    "uri": "http://edamontology.org/operation_3904"
                }
            ]
        }
    ],
    "homepage": "http://cbdm-01.zdv.uni-mainz.de/~munoz/lct/",
    "lastUpdate": "2021-02-12T11:21:48Z",
    "name": "LCT",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PONE.0239154",
            "metadata": {
                "abstract": "© 2020 Mier, Andrade-Navarro. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Background Proteins with low complexity regions (LCRs) have atypical sequence and structural features. Their amino acid composition varies from the expected, determined proteome-wise, and they do not follow the rules of structural folding that prevail in globular regions. One way to characterize these regions is by assessing the repeatability of a sequence, that is, calculating the local propensity of a region to be part of a repeat. Results We combine two local measures of low complexity, repeatability (using the RES algorithm) and fraction of the most frequent amino acid, to evaluate different proteomes, datasets of protein regions with specific features, and individual cases of proteins with extreme compositions. We apply a representation called ‘low complexity triangle’ as a proof-of-concept to represent the low complexity measured values. Results show that proteomes have distinct signatures in the low complexity triangle, and that these signatures are associated to complexity features of the sequences. We developed a web tool called LCT (http://cbdm-01.zdv.uni-mainz.de/~munoz/lct/) to allow users to calculate the low complexity triangle of a given protein or region of interest. Conclusions The low complexity triangle proves to be a suitable procedure to represent the general low complexity of a sequence or protein dataset. Homorepeats, direpeats, compositionally biased regions and globular regions occupy characteristic positions in the triangle. The described pipeline can be used to characterize LCRs and may help in quantifying the content of degenerated tandem repeats in proteins and proteomes.",
                "authors": [
                    {
                        "name": "Mier P."
                    },
                    {
                        "name": "Andrade-Navarro M.A."
                    }
                ],
                "citationCount": 1,
                "date": "2020-12-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "Assessing the low complexity of protein sequences via the low complexity triangle"
            },
            "pmid": "33378336"
        }
    ],
    "toolType": [
        "Web service"
    ],
    "topic": [
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Sequence composition, complexity and repeats",
            "uri": "http://edamontology.org/topic_0157"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Protein folds and structural domains",
            "uri": "http://edamontology.org/topic_0736"
        }
    ]
}