{
    "additionDate": "2021-01-18T12:30:10Z",
    "biotoolsCURIE": "biotools:drim",
    "biotoolsID": "drim",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "sunkim.bioinfo@snu.ac.kr",
            "name": "Sun Kim",
            "typeEntity": "Person"
        }
    ],
    "description": "DRIM is a web-based system for investigating drug response at the molecular level by condition-specific multi-omics data integration.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Differential gene expression analysis",
                    "uri": "http://edamontology.org/operation_3223"
                },
                {
                    "term": "Expression profile pathway mapping",
                    "uri": "http://edamontology.org/operation_0533"
                },
                {
                    "term": "RNA-seq time series data analysis",
                    "uri": "http://edamontology.org/operation_3565"
                }
            ]
        }
    ],
    "homepage": "http://biohealth.snu.ac.kr/software/DRIM/",
    "lastUpdate": "2021-03-03T19:04:33Z",
    "name": "DRIM",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.3389/FGENE.2020.564792",
            "metadata": {
                "abstract": "© Copyright © 2020 Oh, Park, Lee, Lee, Lim, Jeong, Jo, Jung and Kim.Pharmacogenomics is the study of how genes affect a person's response to drugs. Thus, understanding the effect of drug at the molecular level can be helpful in both drug discovery and personalized medicine. Over the years, transcriptome data upon drug treatment has been collected and several databases compiled before drug treatment cancer cell multi-omics data with drug sensitivity (IC50, AUC) or time-series transcriptomic data after drug treatment. However, analyzing transcriptome data upon drug treatment is challenging since more than 20,000 genes interact in complex ways. In addition, due to the difficulty of both time-series analysis and multi-omics integration, current methods can hardly perform analysis of databases with different data characteristics. One effective way is to interpret transcriptome data in terms of well-characterized biological pathways. Another way is to leverage state-of-the-art methods for multi-omics data integration. In this paper, we developed Drug Response analysis Integrating Multi-omics and time-series data (DRIM), an integrative multi-omics and time-series data analysis framework that identifies perturbed sub-pathways and regulation mechanisms upon drug treatment. The system takes drug name and cell line identification numbers or user's drug control/treat time-series gene expression data as input. Then, analysis of multi-omics data upon drug treatment is performed in two perspectives. For the multi-omics perspective analysis, IC50-related multi-omics potential mediator genes are determined by embedding multi-omics data to gene-centric vector space using a tensor decomposition method and an autoencoder deep learning model. Then, perturbed pathway analysis of potential mediator genes is performed. For the time-series perspective analysis, time-varying perturbed sub-pathways upon drug treatment are constructed. Additionally, a network involving transcription factors (TFs), multi-omics potential mediator genes, and perturbed sub-pathways is constructed, and paths to perturbed pathways from TFs are determined by an influence maximization method. To demonstrate the utility of our system, we provide analysis results of sub-pathway regulatory mechanisms in breast cancer cell lines of different drug sensitivity. DRIM is available at: http://biohealth.snu.ac.kr/software/DRIM/.",
                "authors": [
                    {
                        "name": "Jeong D."
                    },
                    {
                        "name": "Jo K."
                    },
                    {
                        "name": "Jung I."
                    },
                    {
                        "name": "Kim S."
                    },
                    {
                        "name": "Lee D."
                    },
                    {
                        "name": "Lee S."
                    },
                    {
                        "name": "Lim S."
                    },
                    {
                        "name": "Oh M."
                    },
                    {
                        "name": "Park S."
                    }
                ],
                "date": "2020-11-12T00:00:00Z",
                "journal": "Frontiers in Genetics",
                "title": "DRIM: A Web-Based System for Investigating Drug Response at the Molecular Level by Condition-Specific Multi-Omics Data Integration"
            },
            "pmcid": "PMC7689278",
            "pmid": "33281870"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Drug discovery",
            "uri": "http://edamontology.org/topic_3336"
        },
        {
            "term": "Drug metabolism",
            "uri": "http://edamontology.org/topic_3375"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Omics",
            "uri": "http://edamontology.org/topic_3391"
        },
        {
            "term": "Personalised medicine",
            "uri": "http://edamontology.org/topic_3577"
        },
        {
            "term": "Pharmacogenomics",
            "uri": "http://edamontology.org/topic_0208"
        }
    ]
}
