{
    "additionDate": "2022-10-22T17:04:56.214270Z",
    "biotoolsCURIE": "biotools:isocalcr",
    "biotoolsID": "isocalcr",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Tara W. Hudiburg"
        },
        {
            "name": "Justin M. Mathias",
            "orcidid": "https://orcid.org/0000-0001-5470-4167"
        }
    ],
    "description": "An R package to streamline and standardize stable isotope calculations in ecological research.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Dimethyl",
                    "uri": "http://edamontology.org/operation_3642"
                },
                {
                    "term": "Isotope-coded protein label",
                    "uri": "http://edamontology.org/operation_3705"
                },
                {
                    "term": "SILAC",
                    "uri": "http://edamontology.org/operation_3638"
                }
            ]
        }
    ],
    "homepage": "https://github.com/justinmathias/isocalcR",
    "language": [
        "R"
    ],
    "lastUpdate": "2022-10-22T17:04:56.216892Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://cran.r-project.org/web/packages/isocalcR/index.html"
        }
    ],
    "name": "isocalcR",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1111/GCB.16407",
            "metadata": {
                "abstract": "© 2022 John Wiley & Sons Ltd.The use of stable isotopes to characterize ecosystem dynamics and infer leaf gas exchange processes has become increasingly prevalent over the last few decades within the ecological community. While advancements in theory and our understanding of the physiological processes controlling isotopic signatures in plants has been well-documented, no standardized tool currently exists to facilitate the computation of common isotope-derived plant physiological indices. Here, we present isocalcR, an R package intended to facilitate the use of stable isotope data from plant tissues by providing an integrated collection of functions and recommended reference data. The isocalcR R package contains a suite of functions that compute leaf carbon isotope discrimination (∆13C), leaf intercellular [CO2], the ratio of leaf intercellular to atmospheric [CO2], the difference between atmospheric and leaf intercellular [CO2], and intrinsic water use efficiency from carbon isotope signatures in leaf or wood tissue with minimal inputs from the user. isocalcR also implements and provides recommended input atmospheric [CO2] (ppm) and atmospheric δ13CO2 (‰) data for the period 0–2021 C.E. A major goal of isocalcR is to provide a standardized, open-source tool to streamline the calculation of reproducible physiological indices from stable isotope signatures in plant tissues, incorporating the most up-to-date theory, while simultaneously eliminating potential errors associated with complex calculations. isocalcR can be used for any location globally as long as the user provides information regarding temperature and elevation to the main workhorse functions.",
                "authors": [
                    {
                        "name": "Hudiburg T.W."
                    },
                    {
                        "name": "Mathias J.M."
                    }
                ],
                "date": "2022-01-01T00:00:00Z",
                "journal": "Global Change Biology",
                "title": "isocalcR: An R package to streamline and standardize stable isotope calculations in ecological research"
            },
            "pmid": "36002391"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Ecology",
            "uri": "http://edamontology.org/topic_0610"
        },
        {
            "term": "Physiology",
            "uri": "http://edamontology.org/topic_3300"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        }
    ],
    "validated": 1
}
