{
    "additionDate": "2021-01-18T09:44:44Z",
    "biotoolsCURIE": "biotools:fastquick",
    "biotoolsID": "fastquick",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "fanzhang@umich.edu",
            "name": "Fan Zhang",
            "typeEntity": "Person"
        }
    ],
    "description": "FASTQuick is an ultra-fast QC tool for NGS sequencing fastq files. It generates a comprehensive list of QC statistics, including ancestry and contamination estimation, at ~50x faster turnaround time than alignment-based QC tools.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genome alignment",
                    "uri": "http://edamontology.org/operation_3182"
                },
                {
                    "term": "Read mapping",
                    "uri": "http://edamontology.org/operation_3198"
                },
                {
                    "term": "Sequencing quality control",
                    "uri": "http://edamontology.org/operation_3218"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Griffan/FASTQuick",
    "language": [
        "C",
        "C++"
    ],
    "lastUpdate": "2021-03-10T20:46:17Z",
    "license": "MIT",
    "name": "FASTQuick",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1101/2020.06.10.143768"
        },
        {
            "doi": "10.1093/gigascience/giab004",
            "metadata": {
                "abstract": "© 2021 The Author(s). Published by Oxford University Press GigaScience.Background: Rapid and thorough quality assessment of sequenced genomes on an ultra-high-throughput scale is crucial for successful large-scale genomic studies. Comprehensive quality assessment typically requires full genome alignment, which costs a substantial amount of computational resources and turnaround time. Existing tools are either computationally expensive owing to full alignment or lacking essential quality metrics by skipping read alignment. Findings: We developed a set of rapid and accurate methods to produce comprehensive quality metrics directly from a subset of raw sequence reads (from whole-genome or whole-exome sequencing) without full alignment. Our methods offer orders of magnitude faster turnaround time than existing full alignment-based methods while providing comprehensive and sophisticated quality metrics, including estimates of genetic ancestry and cross-sample contamination. Conclusions: By rapidly and comprehensively performing the quality assessment, our tool will help investigators detect potential issues in ultra-high-throughput sequence reads in real time within a low computational cost at the early stages of the analyses, ensuring high-quality downstream results and preventing unexpected loss in time, money, and invaluable specimens.",
                "authors": [
                    {
                        "name": "Kang H.M."
                    },
                    {
                        "name": "Zhang F."
                    }
                ],
                "date": "2021-01-01T00:00:00Z",
                "journal": "GigaScience",
                "title": "FASTQuick: Rapid and comprehensive quality assessment of raw sequence reads"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "topic": [
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ]
}
