
{
    "credit": [
        {
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://www.proteinstrukturfabrik.de/orfer/#authors"
        }
    ],
    "documentation": [
        {
            "type": "User manual",
            "url": "http://www.proteinstrukturfabrik.de/ORFprimer/manual.html"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Formatting",
                    "uri": "http://edamontology.org/operation_0335"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Java"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Desktop application"
        ],
        "topic": [
            {
                "term": "Sequences",
                "uri": "http://edamontology.org/topic_0080"
            },
            {
                "term": "Proteins",
                "uri": "http://edamontology.org/topic_0078"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/orfer-1-3-2-2-retrieval-protein-sequences-open-reading-frames-genbank.html"
        }
    ],
    "publication": [
        {
            "abstract": "Background: Functional genomics involves the parallel experimentation with large sets of proteins. This requires management of large sets of open reading frames as a prerequisite of the cloning and recombinant expression of these proteins. Results: A Java program was developed for retrieval of protein and nucleic acid sequences and annotations from NCBI GenBank, using the XML sequence format. Annotations retrieved by ORFer include sequence name, organism and also the completeness of the sequence. The program has a graphical user interface, although it can be used in a non-interactive mode. For protein sequences, the program also extracts the open reading frame sequence, if available, and checks its correct translation. ORFer accepts user input in the form of single or lists of GenBank GI identifiers or accession numbers. It can be used to extract complete sets of open reading frames and protein sequences from any kind of GenBank sequence entry, including complete genomes or chromosomes. Sequences are either stored with their features in a relational database or can be exported as text files in Fasta or tabulator delimited format. The ORFer program is freely available at http://www.proteinstrukturfabrik.de/orfer. Conclusion: The ORFer program allows for fast retrieval of DNA sequences, protein sequences and their open reading frames and sequence annotations from GenBank. Furthermore, storage of sequences and features in a relational database is supported. Such a database can supplement a laboratory information system (LIMS) with appropriate sequence information. © 2002 Bussow et al; licensee BioMed Central Ltd.",
            "authors": [
                "Bussow K.",
                "Hoffmann S.",
                "Sievert V."
            ],
            "cit_count": 1,
            "doi": "10.1186/1471-2105-3-40",
            "journal": "BMC Bioinformatics",
            "title": "ORFer - Retrieval of protein sequences and open reading frames from GenBank and storage into relational databases or text files",
            "type": "Primary",
            "year": "2002-12-19"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:orfer",
        "biotoolsID": "orfer",
        "description": "ORFer (Open Reading Frame Retrieval) reads the NCBI GenBank XML sequence format and extracts open reading frames for proteins. Sequences can be requested by GI or accession number.The open reading frame corresponding to the protein sequences is extracted from the XML and displayed. ORFer has a database interface that allows for storing the retrieved sequences in a local SQL database.",
        "homepage": "http://www.proteinstrukturfabrik.de/orfer/",
        "name": "ORFer",
        "version": [
            "1.3.2.2"
        ]
    }
}