{
    "additionDate": "2017-12-18T00:09:23Z",
    "biotoolsCURIE": "biotools:metavelvet",
    "biotoolsID": "metavelvet",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.dna.bio.keio.ac.jp/"
        }
    ],
    "description": "MetaVelvet is an extension of Velvet assembler to de novo metagenome assembly from short sequence reads",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence assembly",
                    "uri": "http://edamontology.org/operation_0310"
                }
            ]
        }
    ],
    "homepage": "http://metavelvet.dna.bio.keio.ac.jp/",
    "lastUpdate": "2021-04-22T06:15:16Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/metavelvet-1-2-01-metavelvet-sl-an-extension-of-velvet-assembler-to-de-novo-metagenomic-assembly-utilizing-supervised-learning.html"
        }
    ],
    "name": "MetaVelvet",
    "operatingSystem": [
        "Linux"
    ],
    "otherID": [
        {
            "type": "rrid",
            "value": "RRID:SCR_011915"
        }
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1093/nar/gks678",
            "metadata": {
                "abstract": "An important step in 'metagenomics' analysis is the assembly of multiple genomes from mixed sequence reads of multiple species in a microbial community. Most conventional pipelines use a single-genome assembler with carefully optimized parameters. A limitation of a single-genome assembler for de novo metagenome assembly is that sequences of highly abundant species are likely misidentified as repeats in a single genome, resulting in a number of small fragmented scaffolds. We extended a single-genome assembler for short reads, known as 'Velvet', to metagenome assembly, which we called 'MetaVelvet', for mixed short reads of multiple species. Our fundamental concept was to first decompose a de Bruijn graph constructed from mixed short reads into individual sub-graphs, and second, to build scaffolds based on each decomposed de Bruijn sub-graph as an isolate species genome. We made use of two features, the coverage (abundance) difference and graph connectivity, for the decomposition of the de Bruijn graph. For simulated datasets, MetaVelvet succeeded in generating significantly higher N50 scores than any single-genome assemblers. MetaVelvet also reconstructed relatively low-coverage genome sequences as scaffolds. On real datasets of human gut microbial read data, MetaVelvet produced longer scaffolds and increased the number of predicted genes. © 2012 The Author(s).",
                "authors": [
                    {
                        "name": "Hachiya T."
                    },
                    {
                        "name": "Namiki T."
                    },
                    {
                        "name": "Sakakibara Y."
                    },
                    {
                        "name": "Tanaka H."
                    }
                ],
                "citationCount": 372,
                "date": "2012-11-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "MetaVelvet: An extension of Velvet assembler to de novo metagenome assembly from short sequence reads"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Assembly",
            "uri": "http://edamontology.org/topic_0196"
        }
    ],
    "validated": 1,
    "version": [
        "1.2.01"
    ]
}
