{
    "additionDate": "2021-10-25T10:06:09.789098Z",
    "biotoolsCURIE": "biotools:ondb",
    "biotoolsID": "ondb",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "bmartinezvaz01@hamline.edu",
            "name": "Betsy M. Martinez-Vaz",
            "typeEntity": "Person"
        }
    ],
    "description": "The Organonitrogen Degradation Database (ONDB) is used to catalog information about the cost, chemical properties, and biodegradation potential of commonly used organonitrogen compounds.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Literature search",
                    "uri": "http://edamontology.org/operation_0305"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                },
                {
                    "term": "Text mining",
                    "uri": "http://edamontology.org/operation_0306"
                }
            ]
        }
    ],
    "homepage": "http://z.umn.edu/ondb",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-10-25T10:06:43.708876Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/serina-robinson/ondb"
        },
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/serina-robinson/ondb/issues"
        }
    ],
    "name": "ONDB",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1128/JMBE.V22I1.2351",
            "metadata": {
                "abstract": "© 2021 Author(s). Published by the American Society for Microbiology.Physical distancing and inaccessibility to laboratory facilities created an opportunity to transition undergraduate research experiences to remote, digital platforms, adding another level of pedagogy to their training. Basic bioinformatics skills together with critical analysis of scientific literature are essential for addressing research questions in modern biology. The work presented here describes a fully online, collaborative research experience created to allow undergraduate students to learn those skills. The research experience was focused on the development and implementation of the Organonitrogen Biodegradation Database (ONDB, z.umn.edu/ondb). The ONDB was developed to catalog information about the cost, chemical properties, and biodegradation potential of commonly used organonitrogen compounds. A cross-institutional team of undergraduate researchers worked in collaboration with two faculty members and a postdoctoral fellow to develop the database. Students carried out extensive online literature searches and used a biodegradation prediction website to research and represent the microbial catabolism of different organonitrogen compounds. Participants employed computational tools such as R, Shiny, and flexdashboard to construct the database pages and interactive web interface for the ONDB. Worksheets and forms were created to encourage other students and researchers to gather information about organonitrogen compounds and expand the database. Student progress was evaluated through biweekly project meetings, presentations, and a final reflection. The ONDB undergraduate research experience provided a platform for students to learn bioinformatics skills while simultaneously developing a teaching and research tool for others.",
                "authors": [
                    {
                        "name": "Robinson S.L."
                    },
                    {
                        "name": "Biernath T."
                    },
                    {
                        "name": "Rosenthal C."
                    },
                    {
                        "name": "Young D."
                    },
                    {
                        "name": "Wackett L.P."
                    },
                    {
                        "name": "Martinez-Vaz B.M."
                    }
                ],
                "date": "2021-03-01T00:00:00Z",
                "journal": "Journal of Microbiology and Biology Education",
                "title": "Development of the organonitrogen biodegradation database: Teaching bioinformatics and collaborative skills to undergraduates during a pandemic"
            },
            "pmcid": "PMC8046652",
            "pmid": "33884084"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Microbiology",
            "uri": "http://edamontology.org/topic_3301"
        },
        {
            "term": "Phylogeny",
            "uri": "http://edamontology.org/topic_0084"
        },
        {
            "term": "Literature and language",
            "uri": "http://edamontology.org/topic_3068"
        },
        {
            "term": "Agricultural science",
            "uri": "http://edamontology.org/topic_3810"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        }
    ]
}