{
    "additionDate": "2021-01-18T11:26:15Z",
    "biotoolsCURIE": "biotools:cancerimmunityqtl",
    "biotoolsID": "cancerimmunityqtl",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "miaoxp@mail.hust.edu.cn",
            "name": "Xiaoping Miao",
            "typeEntity": "Person"
        }
    ],
    "description": "CancerImmunityQTL is a database to systematically evaluate the impact of genetic variants on immune infiltration in human cancer.\n\nTumor-infiltrating immune cells, as the component of tumor microenvironment, could influence tumor progress, prognosis and response to therapy profoundly. Genetic variants are considered as crucial factors that affect immune response. So far, tumor-infiltrating immune cells can be quantified from RNA sequencing data of human tumors using bioinformatics approaches based on immune-specific marker genes or expression signature. Therefore, we systematically explored the effects of single nucleotide polymorphisms (SNPs) on tumor-infiltrating immune cells, and identified immunity quantitative trait loci (immunQTLs) across 33 cancer types from TCGA.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Linkage disequilibrium calculation",
                    "uri": "http://edamontology.org/operation_0488"
                }
            ]
        }
    ],
    "homepage": "http://www.cancerimmunityqtl-hust.com/",
    "lastUpdate": "2021-02-07T12:34:12Z",
    "name": "CancerImmunityQTL",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/NAR/GKAA805",
            "metadata": {
                "abstract": "© 2021 The Author(s) 2020. Published by Oxford University Press on behalf of Nucleic Acids Research.Tumor-infiltrating immune cells as integral component of the tumor microenvironment are associated with tumor progress, prognosis and responses to immunotherapy. Genetic variants have been demonstrated to impact tumor-infiltrating, underscoring the heritable character of immune landscape. Therefore, identification of immunity quantitative trait loci (immunQTLs), which evaluate the effect of genetic variants on immune cells infiltration, might present a critical step toward fully understanding the contribution of genetic variants in tumor development. Although emerging studies have demonstrated the determinants of germline variants on immune infiltration, no database has yet been developed to systematically analyze immunQTLs across multiple cancer types. Using genotype data from TCGA database and immune cell fractions estimated by CIBERSORT, we developed a computational pipeline to identify immunQTLs in 33 cancer types. A total of 913 immunQTLs across different cancer types were identified. Among them, 5 immunQTLs are associated with patient overall survival. Furthermore, by integrating immunQTLs with GWAS data, we identified 527 immunQTLs overlapping with known GWAS linkage disequilibrium regions. Finally, we constructed a user-friendly database, CancerImmunityQTL (http://www.cancerimmunityqtl-hust.com/) for users to browse, search and download data of interest. This database provides an informative resource to understand the germline determinants of immune infiltration in human cancer and benefit from personalized cancer immunotherapy.",
                "authors": [
                    {
                        "name": "Tian J."
                    },
                    {
                        "name": "Cai Y."
                    },
                    {
                        "name": "Li Y."
                    },
                    {
                        "name": "Lu Z."
                    },
                    {
                        "name": "Huang J."
                    },
                    {
                        "name": "Deng Y."
                    },
                    {
                        "name": "Yang N."
                    },
                    {
                        "name": "Wang X."
                    },
                    {
                        "name": "Ying P."
                    },
                    {
                        "name": "Zhang S."
                    },
                    {
                        "name": "Zhu Y."
                    },
                    {
                        "name": "Zhang H."
                    },
                    {
                        "name": "Zhong R."
                    },
                    {
                        "name": "Chang J."
                    },
                    {
                        "name": "Miao X."
                    }
                ],
                "citationCount": 2,
                "date": "2021-01-08T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "CancerImmunityQTL: A database to systematically evaluate the impact of genetic variants on immune infiltration in human cancer"
            },
            "pmid": "33010176"
        }
    ],
    "topic": [
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "GWAS study",
            "uri": "http://edamontology.org/topic_3517"
        },
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        }
    ]
}