{
    "accessibility": "Open access",
    "additionDate": "2019-05-17T12:57:25Z",
    "biotoolsCURIE": "biotools:PyCellBase",
    "biotoolsID": "PyCellBase",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "dperezgil89@gmail.com",
            "name": "Daniel Perez-Gil",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Python package for easy retrieval of biological data from heterogeneous sources.",
    "download": [
        {
            "type": "Biological data",
            "url": "https://github.com/opencb/cellbase"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                }
            ]
        }
    ],
    "homepage": "https://pypi.org/project/pycellbase/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-06-16T10:55:22Z",
    "license": "Apache-1.0",
    "maturity": "Mature",
    "name": "PyCellBase",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "Ruta",
    "publication": [
        {
            "doi": "10.1186/s12859-019-2726-4",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Biological databases and repositories are incrementing in diversity and complexity over the years. This rapid expansion of current and new sources of biological knowledge raises serious problems of data accessibility and integration. To handle the growing necessity of unification, CellBase was created as an integrative solution. CellBase provides a centralized NoSQL database containing biological information from different and heterogeneous sources. Access to this information is done through a RESTful web service API, which provides an efficient interface to the data. Results: In this work we present PyCellBase, a Python package that provides programmatic access to the rich RESTful web service API offered by CellBase. This package offers a fast and user-friendly access to biological information without the need of installing any local database. In addition, a series of command-line tools are provided to perform common bioinformatic tasks, such as variant annotation. CellBase data is always available by a high-availability cluster and queries have been tuned to ensure a real-time performance. Conclusion: PyCellBase is an open-source Python package that provides an efficient access to heterogeneous biological information. It allows to perform tasks that require a comprehensive set of knowledge resources, as for example variant annotation. Queries can be easily fine-tuned to retrieve the desired information of particular biological features. PyCellBase offers the convenience of an object-oriented scripting language and provides the ability to integrate the obtained results into other Python applications and pipelines.",
                "authors": [
                    {
                        "name": "Perez-Gil D."
                    },
                    {
                        "name": "Lopez F.J."
                    },
                    {
                        "name": "Dopazo J."
                    },
                    {
                        "name": "Marin-Garcia P."
                    },
                    {
                        "name": "Rendon A."
                    },
                    {
                        "name": "Medina I."
                    }
                ],
                "date": "2019-03-28T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "PyCellBase, an efficient python package for easy retrieval of biological data from heterogeneous sources"
            },
            "pmcid": "PMC6438028",
            "pmid": "30922213",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ],
    "validated": 1,
    "version": [
        "4.7.1"
    ]
}