{
    "additionDate": "2020-01-09T17:50:02Z",
    "biotoolsCURIE": "biotools:CNAPE",
    "biotoolsID": "CNAPE",
    "confidence_flag": "tool",
    "description": "A Machine Learning Method for Copy Number Alteration Prediction from Gene Expression.\n\n[Source] CNAPE: A Software for Copy Number Alteration Prediction from Gene Expression in Human Cancers.\n\nCopy number alterations (CNAs) are important features of human cancer. While the standard methods for CNA detection (CGH arrays, SNP arrrays, DNA sequencing) rely on DNA, occasionally DNA data are not available, especially in cancer studies (e.g. biopsies, legacy data). CNAPE comes into play by predicting CNAs based on gene expression data from RNA-seq",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Gene prediction",
                    "uri": "http://edamontology.org/operation_2454"
                },
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                }
            ]
        }
    ],
    "homepage": "https://github.com/WangLabHKUST/CNAPE",
    "language": [
        "R"
    ],
    "lastUpdate": "2020-12-16T15:51:37Z",
    "name": "CNAPE",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1109/TCBB.2019.2944827",
            "metadata": {
                "abstract": "© 2004-2012 IEEE.Detection of DNA copy number alteration in cancer cells is critical to understanding cancer initiation and progression. Widely used methods, such as DNA arrays and genomic DNA sequencing, are relatively expensive and require DNA samples at a microgram level, which are not avaiblable in certain situations like clinical biopsies or single-cell genomes. Here, we developed an alternative method - CNAPE to computationally infer copy number alterations from gene expression data. A prior knowledge-aided machine learning model was proposed, trained and tested on 9,740 cancer samples from The Cancer Genome Atlas. We then applied CNAPE to study gliomas, the most common and aggressive brain cancer in adult. Particularly, using RNA sequencing data, CNAPE respectively predicted DNA copy number of chromosomes, chromosomal arms, and 12 commonly altered genes, and achieved over 80 percent accuracy in almost all broad regions and some focal regions. CNAPE was developed as an easy-to-use tool at https://github.com/WangLabHKUST/CNAPE.",
                "authors": [
                    {
                        "name": "Mu Q."
                    },
                    {
                        "name": "Wang J."
                    }
                ],
                "citationCount": 2,
                "date": "2021-01-01T00:00:00Z",
                "journal": "IEEE/ACM Transactions on Computational Biology and Bioinformatics",
                "title": "CNAPE: A Machine Learning Method for Copy Number Alteration Prediction from Gene Expression"
            },
            "pmid": "31581092"
        }
    ],
    "topic": [
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        }
    ],
    "validated": 1
}