{
    "additionDate": "2019-11-14T18:24:35Z",
    "biotoolsCURIE": "biotools:RADAR-base",
    "biotoolsID": "RADAR-base",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "amos.folarin@kcl.ac.uk",
            "name": "Amos Folarin",
            "orcidid": "https://orcid.org/0000-0002-0333-1927",
            "typeEntity": "Person"
        }
    ],
    "description": "> HOMEPAGE MISSING! | Open Source Mobile Health Platform for Collecting, Monitoring, and Analyzing Data Using Sensors, Wearables, and Mobile Devices | BACKGROUND:With a wide range of use cases in both research and clinical domains, collecting continuous mobile health (mHealth) streaming data from multiple sources in a secure, highly scalable, and extensible platform is of high interest to the open source mHealth community. The European Union Innovative Medicines Initiative Remote Assessment of Disease and Relapse-Central Nervous System (RADAR-CNS) program is an exemplary project with the requirements to support the collection of high-resolution data at scale; as such, the Remote Assessment of Disease and Relapse (RADAR)-base platform is designed to meet these needs and additionally facilitate a new generation of mHealth projects in this nascent field",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                },
                {
                    "term": "Parsing",
                    "uri": "http://edamontology.org/operation_1812"
                }
            ]
        }
    ],
    "homepage": "https://radar-base.org/index.php/documentation/",
    "lastUpdate": "2020-12-11T15:21:44Z",
    "name": "RADAR-base",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.2196/11734",
            "metadata": {
                "abstract": "©Yatharth Ranjan, Zulqarnain Rashid, Callum Stewart, Pauline Conde, Mark Begale, Denny Verbeeck, Sebastian Boettcher, The Hyve, Richard Dobson, Amos Folarin, The RADAR-CNS Consortium.Background: With a wide range of use cases in both research and clinical domains, collecting continuous mobile health (mHealth) streaming data from multiple sources in a secure, highly scalable, and extensible platform is of high interest to the open source mHealth community. The European Union Innovative Medicines Initiative Remote Assessment of Disease and Relapse-Central Nervous System (RADAR-CNS) program is an exemplary project with the requirements to support the collection of high-resolution data at scale; as such, the Remote Assessment of Disease and Relapse (RADAR)-base platform is designed to meet these needs and additionally facilitate a new generation of mHealth projects in this nascent field. Objective: Wide-bandwidth networks, smartphone penetrance, and wearable sensors offer new possibilities for collecting near-real-time high-resolution datasets from large numbers of participants. The aim of this study was to build a platform that would cater for large-scale data collection for remote monitoring initiatives. Key criteria are around scalability, extensibility, security, and privacy. Methods: RADAR-base is developed as a modular application; the backend is built on a backbone of the highly successful Confluent/Apache Kafka framework for streaming data. To facilitate scaling and ease of deployment, we use Docker containers to package the components of the platform. RADAR-base provides 2 main mobile apps for data collection, a Passive App and an Active App. Other third-Party Apps and sensors are easily integrated into the platform. Management user interfaces to support data collection and enrolment are also provided. Results: General principles of the platform components and design of RADAR-base are presented here, with examples of the types of data currently being collected from devices used in RADAR-CNS projects: Multiple Sclerosis, Epilepsy, and Depression cohorts. Conclusions: RADAR-base is a fully functional, remote data collection platform built around Confluent/Apache Kafka and provides off-the-shelf components for projects interested in collecting mHealth datasets at scale.",
                "authors": [
                    {
                        "name": "Ranjan Y."
                    },
                    {
                        "name": "Rashid Z."
                    },
                    {
                        "name": "Stewart C."
                    },
                    {
                        "name": "Conde P."
                    },
                    {
                        "name": "Begale M."
                    },
                    {
                        "name": "Verbeeck D."
                    },
                    {
                        "name": "Boettcher S."
                    },
                    {
                        "name": "Dobson R."
                    },
                    {
                        "name": "Folarin A."
                    }
                ],
                "citationCount": 14,
                "date": "2019-01-01T00:00:00Z",
                "journal": "JMIR mHealth and uHealth",
                "title": "Radar-base: Open source mobile health platform for collecting, monitoring, and analyzing data using sensors, wearables, and mobile devices"
            },
            "pmcid": "PMC6694732",
            "pmid": "31373275"
        }
    ],
    "topic": [
        {
            "term": "Psychiatry",
            "uri": "http://edamontology.org/topic_3419"
        }
    ],
    "validated": 1
}