{
    "additionDate": "2016-05-17T10:18:14Z",
    "biotoolsCURIE": "biotools:cell-motility",
    "biotoolsID": "cell-motility",
    "collectionID": [
        "BIG N2N",
        "VIB",
        "Compomics",
        "UGent"
    ],
    "credit": [
        {
            "name": "ugent.be",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        },
        {
            "email": "lennart.martens@ugent.be",
            "name": "Lennart Martens",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Cell motion path analysis.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/compomics/cell-motility"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Cell migration track image",
                        "uri": "http://edamontology.org/data_3449"
                    }
                }
            ],
            "operation": [
                {
                    "term": "Cell migration analysis",
                    "uri": "http://edamontology.org/operation_3446"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Cell migration track image",
                        "uri": "http://edamontology.org/data_3449"
                    }
                }
            ]
        }
    ],
    "homepage": "https://code.google.com/p/cell-motility/",
    "language": [
        "Java"
    ],
    "lastUpdate": "2018-12-16T14:40:58Z",
    "license": "GPL-3.0",
    "name": "cell-motility",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "Katrijn.Vannerum@ugent.be",
    "publication": [
        {
            "doi": "10.1186/1471-2105-7-289",
            "metadata": {
                "abstract": "Background: Migration is an important aspect of cellular behaviour and is therefore widely studied in cell biology. Numerous components are known to participate in this process in a highly dynamic manner. In order to obtain a better insight in cell migration, mutants or drugs are used and their motive phenotype is then linked with the disturbing factors. One of the typical approaches to study motion paths of individual cells relies on fitting mean square displacements to a persistent random walk function. Since the numerous calculations involved often rely on diverse commercial software packages, the analysis can be expensive, labour-intensive and error-prone work. Additionally, due to the nature of algorithms employed the calculations involved are not readily reproducible without access to the exact software package(s) used. Results: We here present the cell_motility software, an open source Java application under the GNU-GPL license that provides a clear and concise analysis workbench for large amounts of cell motion data. Apart from performing the necessary calculations, the software also visualizes the original motion paths as well as the results of the calculations to help the user interpret the data. The application features an intuitive graphical user interface as well as full user and developer documentation and both source and binary files can be freely downloaded from the project website at http://genesis.UGent.be/cell_motility. Conclusion: In providing a free, open source software solution for the automated processing of cell motion data, we aim to achieve two important goals: labs can greatly simplify their data analysis pipeline as switching between different computational software packages becomes obsolete (thus reducing the chances for human error during data manipulation and transfer) and secondly, to provide scientists in the field with a freely available common platform to perform their analyses, enabling more efficient data quality control through peer reviewing. © 2006 Martens et al; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Martens L."
                    },
                    {
                        "name": "Monsieur G."
                    },
                    {
                        "name": "Ampe C."
                    },
                    {
                        "name": "Gevaert K."
                    },
                    {
                        "name": "Vandekerckhove J."
                    }
                ],
                "citationCount": 15,
                "date": "2006-06-08T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Cell_motility: A cross-platform, open source application for the study of cell motion paths"
            },
            "pmcid": "PMC1523222",
            "pmid": "16762054",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        }
    ],
    "validated": 1,
    "version": [
        "2.0"
    ]
}