{
    "additionDate": "2021-01-18T11:12:50Z",
    "biotoolsCURIE": "biotools:cosinorpy",
    "biotoolsID": "cosinorpy",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "miha.moskon@fri.uni-lj.si",
            "name": "Miha Moškon",
            "orcidid": "https://orcid.org/0000-0003-4600-1730",
            "typeEntity": "Person"
        }
    ],
    "description": "CosinorPy is a Python implementation of cosinor-based methods for rhythmicity detection and analysis. CosinorPy merges and extends the functionalities of existing cosinor packages. It supports the analysis of rhythmic data using single- or multi-component cosinor models, automatic selection of the best model, population-mean cosinor regression, and differential rhythmicity assessment.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://github.com/mmoskon/CosinorPy/blob/master/docs/docs.md"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                }
            ]
        }
    ],
    "homepage": "https://github.com/mmoskon/CosinorPy",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-02-17T16:14:41Z",
    "license": "MIT",
    "name": "CosinorPy",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1186/S12859-020-03830-W",
            "metadata": {
                "abstract": "© 2020, The Author(s).Background: Even though several computational methods for rhythmicity detection and analysis of biological data have been proposed in recent years, classical trigonometric regression based on cosinor still has several advantages over these methods and is still widely used. Different software packages for cosinor-based rhythmometry exist, but lack certain functionalities and require data in different, non-unified input formats. Results: We present CosinorPy, a Python implementation of cosinor-based methods for rhythmicity detection and analysis. CosinorPy merges and extends the functionalities of existing cosinor packages. It supports the analysis of rhythmic data using single- or multi-component cosinor models, automatic selection of the best model, population-mean cosinor regression, and differential rhythmicity assessment. Moreover, it implements functions that can be used in a design of experiments, a synthetic data generator, and import and export of data in different formats. Conclusion: CosinorPy is an easy-to-use Python package for straightforward detection and analysis of rhythmicity requiring minimal statistical knowledge, and produces publication-ready figures. Its code, examples, and documentation are available to download from https://github.com/mmoskon/CosinorPy. CosinorPy can be installed manually or by using pip, the package manager for Python packages. The implementation reported in this paper corresponds to the software release v1.1.",
                "authors": [
                    {
                        "name": "Moskon M."
                    }
                ],
                "date": "2020-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "CosinorPy: a python package for cosinor-based rhythmometry"
            },
            "pmcid": "PMC7597035",
            "pmid": "33121431"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        },
        {
            "term": "Human biology",
            "uri": "http://edamontology.org/topic_2815"
        },
        {
            "term": "Software engineering",
            "uri": "http://edamontology.org/topic_3372"
        }
    ]
}