{"credit":[],"function":[{"operation":[{"term":"Mass spectra calibration","uri":"http://edamontology.org/operation_3627"},{"term":"Natural product identification","uri":"http://edamontology.org/operation_3803"},{"term":"Deisotoping","uri":"http://edamontology.org/operation_3629"}]}],"labels":{"topic":[{"term":"Small molecules","uri":"http://edamontology.org/topic_0154"},{"term":"Metabolomics","uri":"http://edamontology.org/topic_3172"},{"term":"Compound libraries and screening","uri":"http://edamontology.org/topic_3343"}]},"link":[{"type":"OTHER","url":"https://metwork.pharmacie.parisdescartes.fr/projects/480/"}],"publication":[{"abstract":"Copyright © 2019 American Chemical Society.Traditional natural products discovery workflows implying a combination of different targeting strategies, including structure- and/or bioactivity-based approaches, afford no information about new compound structures until late in the discovery pipeline. By integrating a MS/MS prediction module and a collaborative library of (bio)chemical transformations, we have developed a new platform, coined MetWork, that is capable of anticipating the structural identity of metabolites starting from any identified compound. In our quest to discover new monoterpene indole alkaloids, we demonstrate the utility of the MetWork platform by anticipating the structures of five previously undescribed sarpagine-like N-oxide alkaloids that have been targeted and isolated from the leaves of Alstonia balansae using a molecular networking-based dereplication strategy fueled by computer-generated annotations. This study constitutes the first example of nonpeptidic molecular networking-based natural product discovery workflow, in which the targeted structures were initially generated, and therefore anticipated by a computer prior to their isolation.","authors":["Fox Ramos A.E.","Pavesi C.","Litaudon M.","Dumontet V.","Poupon E.","Champy P.","Genta-Jouve G.","Beniddir M.A."],"cit_count":0,"doi":"10.1021/ACS.ANALCHEM.9B02216","journal":"Analytical Chemistry","pmid":"31369240","title":"CANPA: Computer-Assisted Natural Products Anticipation","year":"2019-09-03"}],"summary":{"biotoolsCURIE":"biotools:MetWork","biotoolsID":"MetWork","description":"> MEDIUM CONFIDENCE! | Computer-Assisted Natural Products Anticipation | a web server for natural products anticipation | Currently running beta version 0.4.2 | \"Essence is a function of the relationship.\" Bachelard 1929 | MetWork used for the identification of bromotryptamine derivatives","homepage":"https://metwork.pharmacie.parisdescartes.fr","name":"MetWork"}}