{
    "additionDate": "2017-12-18T00:12:27Z",
    "biotoolsCURIE": "biotools:sibmed",
    "biotoolsID": "sibmed",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://csg.sph.umich.edu/"
        }
    ],
    "description": "Identifiy likely genotyping errors and mutations for a sib pair in the context of multipoint mapping. Using a hidden Markov model, the program calculates the posterior probability of genotyping error or mutation for each sib-pair-marker combination, given all the available marker data, an assumed genotype-error rate, and a known genetic map.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Mapping",
                    "uri": "http://edamontology.org/operation_2429"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Detection",
                    "uri": "http://edamontology.org/operation_2423"
                }
            ]
        }
    ],
    "homepage": "http://csg.sph.umich.edu/boehnke/sibmed.php",
    "language": [
        "Fortran"
    ],
    "lastUpdate": "2021-05-16T13:00:10.577308Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/sibmed-1-0-identify-genotyping-errors-mutations.html"
        }
    ],
    "name": "SIBMED",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "otherID": [
        {
            "type": "rrid",
            "value": "RRID:SCR_007495"
        }
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1086/302861",
            "metadata": {
                "abstract": "The identification of genes contributing to complex diseases and quantitative traits requires genetic data of high fidelity, because undetected errors and mutations can profoundly affect linkage information. The recent emphasis on the use of the sibling-pair design eliminates or decreases the likelihood of detection of genotyping errors and marker mutations through apparent Mendelian incompatibilities or close double recombinants. In this article, we describe a hidden Markov method for detecting genotyping errors and mutations in multilocus linkage data. Specifically, we calculate the posterior probability of genotyping error or mutation for each sibling-pair-marker combination, conditional on all marker data and an assumed genotype-error rate. The method is designed for use with sibling-pair data when parental genotypes are unavailable. Through Monte Carlo simulation, we explore the effects of map density, marker-allele frequencies, marker position, and genotype-error rate on the accuracy of our error-detection method. In addition, we examine the impact of genotyping errors and error detection and correction on multipoint linkage information. We illustrate that even moderate error rates can result in substantial loss of linkage information, given efforts to fine-map a putative disease locus. Although simulations suggest that our method detects ≤50% of genotyping errors, it generally flags those errors that have the largest impact on linkage results. For high-resolution genetic maps, removal of the errors identified by our method restores most or nearly all the lost linkage information and can be accomplished without generating false evidence for linkage by removing incorrectly identified errors.",
                "authors": [
                    {
                        "name": "Douglas J.A."
                    },
                    {
                        "name": "Boehnke M."
                    },
                    {
                        "name": "Lange K."
                    }
                ],
                "citationCount": 120,
                "date": "2000-01-01T00:00:00Z",
                "journal": "American Journal of Human Genetics",
                "title": "A multipoint method for detecting genotyping errorsand mutations in sibling-pair linkage data"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Mutation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Genotyping",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ],
    "validated": 1,
    "version": [
        "1.0"
    ]
}