{"credit":[{"email":"mcneney@sfu.ca","typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://stat.sfu.ca/statgen/contact.html"}],"documentation":[{"type":"GENERAL","url":"http://stat.sfu.ca/statgen/research/luca.html"}],"function":[{"operation":[{"term":"Statistical inference","uri":"http://edamontology.org/operation_3658"}]}],"labels":{"language":["R"],"operatingSystem":["Linux","Windows","Mac"],"toolType":["Library"],"topic":[{"term":"Genetics","uri":"http://edamontology.org/topic_3053"},{"term":"Epigenetics","uri":"http://edamontology.org/topic_3295"},{"term":"Molecular interactions, pathways and networks","uri":"http://edamontology.org/topic_0602"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/luca-1-0-likelihood-covariate-assumptions.html"}],"publication":[{"abstract":"In genetic association studies, there is increasing interest in understanding the joint effects of genetic and nongenetic factors. For rare diseases, the case-control study is a practical design, and logistic regression is the standard method of inference. However, the power to detect statistical interaction is a concern, even with relatively large samples. Under independence of genetic and nongenetic covariates, improved precision of interaction estimators is possible, but logistic regression does not make use of this assumption and consequently is not statistically efficient. In recent work to improve efficiency, profile likelihood methods have been used to develop semi-parametric inference that incorporates the independence assumption. We describe an alternate derivation of these estimators for rare diseases that is based on classic arguments from case-control inference. These arguments lead to a simplification in the variance estimator. We also describe a strategy for relaxing the independence assumption. Under either independence or the proposed dependence model, inference for association parameters is conveniently obtained by fitting a conditional logistic regression. The statistical properties of the proposed methodology are investigated by simulation. Copyright ©2007 The Berkeley Electronic Press. All rights reserved.","authors":["Shin J.-H.","McNeney B.","Graham J."],"cit_count":4,"journal":"Statistical Applications in Genetics and Molecular Biology","pmid":"17474879","title":"Case-control inference of interaction between genetic and nongenetic risk factors under assumptions on their distribution","year":"2007-04-22"}],"summary":{"biotoolsCURIE":"biotools:luca","biotoolsID":"luca","description":"R package implementing the methods for case-control inference of statistical interaction between genetic and nongenetic risk factors under covariate assumptions.","homepage":"http://stat.sfu.ca/statgen/research/luca.html","name":"LUCA"}}