{
    "additionDate": "2015-02-16T10:08:08Z",
    "biotoolsCURIE": "biotools:idbp",
    "biotoolsID": "idbp",
    "collectionID": [
        "Instruct"
    ],
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Instruct",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        },
        {
            "email": "ccisb@stfc.ac.uk",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "A server for the identification of DNA binding proteins.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://idbps.tau.ac.il/Overview.htm"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "note": "The iDBPs server was developed for the identification of DNA binding proteins (DBPs) for proteins with known three-dimensional structure.In the first stage of classification, the functional region of the protein is predicted using the PatchFinder algorithm. PatchFinder searches for clusters (patches) of evolutionarily conserved residues on the protein surface. It was previously shown that the maximum-likelihood (ML) patches found by PatchFinder often delineate the functional regions in proteins, specifically, the core of DNA binding regions within DBPs.The iDBPs server uses the random forests classifier trained with global features of the proteins as well as features of their ML-patches. The features can be roughly divided into seven categories as follows:Surface electrostatic potential.Amino acid conservation patterns of the ML-patch.Secondary structure content.Amino acid content.Hydrogen donors/acceptors.Dipole moment.Spatial asymmetry of the distribution of specific amino acids.The",
            "operation": [
                {
                    "term": "Protein interaction prediction",
                    "uri": "http://edamontology.org/operation_2492"
                }
            ]
        }
    ],
    "homepage": "http://idbps.tau.ac.il/",
    "lastUpdate": "2018-12-10T12:58:56Z",
    "name": "iDBP",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "Instruct",
    "publication": [
        {
            "doi": "10.1016/j.jmb.2009.02.023",
            "metadata": {
                "abstract": "DNA-binding proteins (DBPs) participate in various crucial processes in the life-cycle of the cells, and the identification and characterization of these proteins is of great importance. We present here a random forests classifier for identifying DBPs among proteins with known 3D structures. First, clusters of evolutionarily conserved regions (patches) on the surface of proteins were detected using the PatchFinder algorithm; earlier studies showed that these regions are typically the functionally important regions of proteins. Next, we trained a classifier using features like the electrostatic potential, cluster-based amino acid conservation patterns and the secondary structure content of the patches, as well as features of the whole protein, including its dipole moment. Using 10-fold cross-validation on a dataset of 138 DBPs and 110 proteins that do not bind DNA, the classifier achieved a sensitivity and a specificity of 0.90, which is overall better than the performance of published methods. Furthermore, when we tested five different methods on 11 new DBPs that did not appear in the original dataset, only our method annotated all correctly. The resulting classifier was applied to a collection of 757 proteins of known structure and unknown function. Of these proteins, 218 were predicted to bind DNA, and we anticipate that some of them interact with DNA using new structural motifs. The use of complementary computational tools supports the notion that at least some of them do bind DNA. © 2009 Elsevier Ltd. All rights reserved.",
                "authors": [
                    {
                        "name": "Nimrod G."
                    },
                    {
                        "name": "Szilagyi A."
                    },
                    {
                        "name": "Leslie C."
                    },
                    {
                        "name": "Ben-Tal N."
                    }
                ],
                "citationCount": 62,
                "date": "2009-04-10T00:00:00Z",
                "journal": "Journal of Molecular Biology",
                "title": "Identification of DNA-binding Proteins Using Structural, Electrostatic and Evolutionary Features"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Structural biology",
            "uri": "http://edamontology.org/topic_1317"
        },
        {
            "term": "DNA binding sites",
            "uri": "http://edamontology.org/topic_3125"
        },
        {
            "term": "Functional genomics",
            "uri": "http://edamontology.org/topic_0085"
        }
    ],
    "validated": 1,
    "version": [
        "1"
    ]
}