{
    "additionDate": "2019-11-14T18:43:40Z",
    "biotoolsCURIE": "biotools:defence_adaptation",
    "biotoolsID": "defence_adaptation",
    "confidence_flag": "very low",
    "credit": [
        {
            "email": "la.vanboheemen@gmail.com",
            "name": "Lotte A. van Boheemen",
            "orcidid": "https://orcid.org/0000-0001-9199-7704",
            "typeEntity": "Person"
        }
    ],
    "description": "> VERY_LOW CONFIDENCE! | > CORRECT NAME OF TOOL COULD ALSO BE 'defence-related', 'enemies', 'budgets', 'invasives' | Rapid growth and defence evolution following multiple introductions | Rscripts for growth and defence analyses | Data available on: https://doi.org/10.6084/m9.figshare.8028875.v1 | Citation: Lotte A. van Boheemen, Sarah Bou-Assi, Akane Uesugi, Kathryn A. Hodgins (2019). Rapid growth and defence evolution following multiple introductions bioRxiv https://doi.org/10.1101/435271",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                }
            ]
        }
    ],
    "homepage": "https://github.com/lotteanna/defence_adaptation",
    "lastUpdate": "2019-11-14T18:43:40Z",
    "license": "MIT",
    "name": "defence_adaptation",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1002/ECE3.5275",
            "metadata": {
                "abstract": "© 2019 The Authors. Ecology and Evolution published by John Wiley & Sons Ltd.Rapid adaptation can aid invasive populations in their competitive success. Resource allocation trade-off hypotheses predict higher resource availability or the lack of natural enemies in introduced ranges allow for increased growth and reproduction, thus contributing to invasive success. Evidence for such hypotheses is however equivocal and tests among multiple ranges over productivity gradients are required to provide a better understanding of the general applicability of these theories. Using common gardens, we investigated the adaptive divergence of various constitutive and inducible defence-related traits between the native North American and introduced European and Australian ranges, while controlling for divergence due to latitudinal trait clines, individual resource budgets, and population differentiation, using >11,000 SNPs. Rapid, repeated clinal adaptation in defence-related traits was apparent despite distinct demographic histories. We also identified divergence among ranges in some defence-related traits, although differences in energy budgets among ranges may explain some, but not all, defence-related trait divergence. We do not identify a general reduction in defence in concert with an increase in growth among the multiple introduced ranges as predicted trade-off hypotheses. Synthesis: The rapid spread of invasive species is affected by a multitude of factors, likely including adaptation to climate and escape from natural enemies. Unravelling the mechanisms underlying invasives' success enhances understanding of eco-evolutionary theory and is essential to inform management strategies in the face of ongoing climate change. OPEN RESEARCH BADGES: This article has been awarded Open Materials, Open Data, Preregistered Research Designs Badges. All materials and data are publicly accessible via the Open Science Framework at https://doi.org/10.6084/m9.figshare.8028875.v1, https://github.com/lotteanna/defence:adaptation,https://doi.org/10.1101/435271.",
                "authors": [
                    {
                        "name": "van Boheemen L.A."
                    },
                    {
                        "name": "Bou-Assi S."
                    },
                    {
                        "name": "Uesugi A."
                    },
                    {
                        "name": "Hodgins K.A."
                    }
                ],
                "citationCount": 3,
                "date": "2019-07-01T00:00:00Z",
                "journal": "Ecology and Evolution",
                "title": "Rapid growth and defence evolution following multiple introductions"
            },
            "pmcid": "PMC6662289",
            "pmid": "31380062"
        }
    ],
    "topic": [
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        }
    ]
}