{
    "additionDate": "2018-05-01T17:35:42Z",
    "biotoolsCURIE": "biotools:mirnet",
    "biotoolsID": "mirnet",
    "credit": [
        {
            "email": "jeff.xia@mcgill.ca",
            "name": "Jeff Xia",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Tool with comprehensive support for statistical analysis and functional interpretation of data generated in miRNAs studies.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://www.mirnet.ca/faces/docs/AboutView.xhtml"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Pathway or network analysis",
                    "uri": "http://edamontology.org/operation_2497"
                },
                {
                    "term": "miRNA expression analysis",
                    "uri": "http://edamontology.org/operation_3792"
                },
                {
                    "term": "microRNA detection",
                    "uri": "http://edamontology.org/operation_0463"
                }
            ]
        }
    ],
    "homepage": "http://www.mirnet.ca/",
    "lastUpdate": "2018-12-10T12:58:57Z",
    "name": "miRNet",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1093/NAR/GKW288",
            "metadata": {
                "abstract": "© The Author(s) 2016. Published by Oxford University Press on behalf of Nucleic Acids Research.MicroRNAs (miRNAs) can regulate nearly all biological processes and their dysregulation is implicated in various complex diseases and pathological conditions. Recent years have seen a growing number of functional studies of miRNAs using high-throughput experimental technologies, which have produced a large amount of high-quality data regarding miRNA target genes and their interactions with small molecules, long non-coding RNAs, epigenetic modifiers, disease associations, etc These rich sets of information have enabled the creation of comprehensive networks linking miRNAs with various biologically important entities to shed light on their collective functions and regulatory mechanisms. Here, we introduce miRNet, an easy-to-use web-based tool that offers statistical, visual and network-based approaches to help researchers understand miRNAs functions and regulatory mechanisms. The key features of miRNet include: (i) a comprehensive knowledge base integrating high-quality miRNA-target interaction data from 11 databases; (ii) support for differential expression analysis of data from microarray, RNA-seq and quantitative PCR; (iii) implementation of a flexible interface for data filtering, refinement and customization during network creation; (iv) a powerful fully featured network visualization system coupled with enrichment analysis. miRNet offers a comprehensive tool suite to enable statistical analysis and functional interpretation of various data generated from current miRNA studies. miRNet is freely available at http://www.mirnet.ca.",
                "authors": [
                    {
                        "name": "Arora S.K."
                    },
                    {
                        "name": "Fan Y."
                    },
                    {
                        "name": "Kimmins S."
                    },
                    {
                        "name": "Ribeiro P."
                    },
                    {
                        "name": "Siklenka K."
                    },
                    {
                        "name": "Xia J."
                    }
                ],
                "citationCount": 212,
                "date": "2016-07-08T00:00:00Z",
                "journal": "Nucleic acids research",
                "title": "miRNet - dissecting miRNA-target interactions and functional associations through network-based visual analysis"
            },
            "pmcid": "PMC4987881",
            "pmid": "27105848"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Nucleic acid structure analysis",
            "uri": "http://edamontology.org/topic_0097"
        }
    ],
    "validated": 1
}
