{
    "accessibility": "Open access",
    "additionDate": "2019-05-19T09:55:09Z",
    "biotoolsCURIE": "biotools:kuenm",
    "biotoolsID": "kuenm",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "manubio13@gmail.com",
            "name": "Marlon E. Cobos",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "R package for detailed development of Maxent Ecological Niche Models.",
    "editPermission": {
        "type": "private"
    },
    "homepage": "https://github.com/marlonecobos/kuenm",
    "language": [
        "R"
    ],
    "lastUpdate": "2020-06-16T10:55:22Z",
    "maturity": "Mature",
    "name": "kuenm",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "Ruta",
    "publication": [
        {
            "doi": "10.7717/peerj.6281",
            "metadata": {
                "abstract": "© 2019 Cobos et al.Background. Ecological niche modeling is a set of analytical tools with applications in diverse disciplines, yet creating these models rigorously is now a challenging task. The calibration phase of these models is critical, but despite recent attempts at providing tools for performing this step, adequate detail is still missing. Here, we present the kuenm R package, a new set of tools for performing detailed development of ecological niche models using the platform Maxent in a reproducible way. Results. This package takes advantage of the versatility of R and Maxent to enable detailed model calibration and selection, final model creation and evaluation, and extrapolation risk analysis. Best parameters for modeling are selected considering (1) statistical significance, (2) predictive power, and (3) model complexity. For final models, we enable multiple parameter sets and model transfers, making processing simpler. Users can also evaluate extrapolation risk in model transfers via mobility-oriented parity (MOP) metric. Discussion. Use of this package allows robust processes of model calibration, facilitating creation of final models based on model significance, performance, and simplicity. Model transfers to multiple scenarios, also facilitated in this package, significantly reduce time invested in performing these tasks. Finally, efficient assessments of strict-extrapolation risks in model transfers via the MOP and MESS metrics help to prevent overinterpretation in model outcomes.",
                "authors": [
                    {
                        "name": "Cobos M.E."
                    },
                    {
                        "name": "Townsend Peterson A."
                    },
                    {
                        "name": "Barve N."
                    },
                    {
                        "name": "Osorio-Olvera L."
                    }
                ],
                "citationCount": 35,
                "date": "2019-01-01T00:00:00Z",
                "journal": "PeerJ",
                "title": "Kuenm: An R package for detailed development of ecological niche models using Maxent"
            },
            "pmcid": "PMC6368831",
            "pmid": "30755826",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Ecology",
            "uri": "http://edamontology.org/topic_0610"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ]
}