{
    "additionDate": "2019-11-14T19:33:15Z",
    "biotoolsCURIE": "biotools:QUBIC2",
    "biotoolsID": "QUBIC2",
    "confidence_flag": "tool",
    "description": "A novel and robust biclustering algorithm for analyses and interpretation of large-scale RNA-Seq data | A novel biclustering algorithm for analyses of transcriptomic data | QUBIC2 is a novel biclustering algorithm for analyses of gene expression data from bulk and single-cell RNA-Sequencing. This introductory vignette provides an overview of installation and usage",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                }
            ]
        }
    ],
    "homepage": "https://github.com/OSU-BMBL/QUBIC2",
    "language": [
        "C++"
    ],
    "lastUpdate": "2024-11-24T20:55:46.408912Z",
    "name": "QUBIC2",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btz692",
            "metadata": {
                "abstract": "Motivation: The biclustering of large-scale gene expression data holds promising potential for detecting condition-specific functional gene modules (i.e. biclusters). However, existing methods do not adequately address a comprehensive detection of all significant bicluster structures and have limited power when applied to expression data generated by RNA-Sequencing (RNA-Seq), especially single-cell RNA-Seq (scRNA-Seq) data, where massive zero and low expression values are observed. Results: We present a new biclustering algorithm, QUalitative BIClustering algorithm Version 2 (QUBIC2), which is empowered by: (i) a novel left-truncated mixture of Gaussian model for an accurate assessment of multimodality in zero-enriched expression data, (ii) a fast and efficient dropouts-saving expansion strategy for functional gene modules optimization using information divergency and (iii) a rigorous statistical test for the significance of all the identified biclusters in any organism, including those without substantial functional annotations. QUBIC2 demonstrated considerably improved performance in detecting biclusters compared to other five widely used algorithms on various benchmark datasets from E.coli, Human and simulated data. QUBIC2 also showcased robust and superior performance on gene expression data generated by microarray, bulk RNA-Seq and scRNA-Seq.",
                "authors": [
                    {
                        "name": "Cao S."
                    },
                    {
                        "name": "Liu B."
                    },
                    {
                        "name": "Ma A."
                    },
                    {
                        "name": "Ma Q."
                    },
                    {
                        "name": "Wang C."
                    },
                    {
                        "name": "Xie J."
                    },
                    {
                        "name": "Xu J."
                    },
                    {
                        "name": "Zhang C."
                    },
                    {
                        "name": "Zhang Y."
                    }
                ],
                "citationCount": 45,
                "date": "2020-02-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "QUBIC2: A novel and robust biclustering algorithm for analyses and interpretation of large-scale RNA-Seq data"
            },
            "pmcid": "PMC8215922",
            "pmid": "31503285"
        }
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ],
    "validated": 1
}
