{
    "additionDate": "2022-06-24T14:02:41.587147Z",
    "biotoolsCURIE": "biotools:clr-rnf",
    "biotoolsID": "clr-rnf",
    "confidence_flag": "tool",
    "credit": [
        {
            "name": "Mingbao Lin"
        },
        {
            "name": "Rongrong Ji"
        }
    ],
    "description": "Pruning Networks With Cross-Layer Ranking & k-Reciprocal Nearest Filters.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Filtering",
                    "uri": "http://edamontology.org/operation_3695"
                }
            ]
        }
    ],
    "homepage": "https://github.com/lmbxmu/CLR-RNF",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-06-24T14:02:41.589908Z",
    "license": "Not licensed",
    "name": "CLR-RNF",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1109/TNNLS.2022.3156047",
            "metadata": {
                "abstract": "IEEEThis article focuses on filter-level network pruning. A novel pruning method, termed CLR-RNF, is proposed. We first reveal a ``long-tail'' pruning problem in magnitude-based weight pruning methods and then propose a computation-aware measurement for individual weight importance, followed by a cross-layer ranking (CLR) of weights to identify and remove the bottom-ranked weights. Consequently, the per-layer sparsity makes up the pruned network structure in our filter pruning. Then, we introduce a recommendation-based filter selection scheme where each filter recommends a group of its closest filters. To pick the preserved filters from these recommended groups, we further devise a k-reciprocal nearest filter (RNF) selection scheme where the selected filters fall into the intersection of these recommended groups. Both our pruned network structure and the filter selection are nonlearning processes, which, thus, significantly reduces the pruning complexity and differentiates our method from existing works. We conduct image classification on CIFAR-10 and ImageNet to demonstrate the superiority of our CLR-RNF over the state-of-the-arts. For example, on CIFAR-10, CLR-RNF removes 74.1&#x0025; FLOPs and 95.0&#x0025; parameters from VGGNet-16 with even 0.3&#x0025; accuracy improvements. On ImageNet, it removes 70.2&#x0025; FLOPs and 64.8&#x0025; parameters from ResNet-50 with only 1.7&#x0025; top-five accuracy drops. Our project is available at https://github.com/lmbxmu/CLR-RNF.",
                "authors": [
                    {
                        "name": "Cao L."
                    },
                    {
                        "name": "Ji R."
                    },
                    {
                        "name": "Lin C."
                    },
                    {
                        "name": "Lin M."
                    },
                    {
                        "name": "Shao L."
                    },
                    {
                        "name": "Zhang Y."
                    }
                ],
                "date": "2022-01-01T00:00:00Z",
                "journal": "IEEE Transactions on Neural Networks and Learning Systems",
                "title": "Pruning Networks With Cross-Layer Ranking &amp; k-Reciprocal Nearest Filters"
            },
            "pmid": "35294359"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        }
    ]
}
