
{
    "credit": [
        {
            "name": "PSB",
            "typeEntity": "Institute",
            "typeRoles": [
                "Provider"
            ]
        },
        {
            "email": "klaas.vandepoele@psb.vib-ugent.be",
            "name": "Klaas Vandepoele",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://bioinformatics.psb.ugent.be/ATCOECIS/faq.htpl"
        }
    ],
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Identifier",
                        "uri": "http://edamontology.org/data_0842"
                    }
                }
            ],
            "note": "Cis-regulatory element analysis of Arabidopsis genes",
            "operation": [
                {
                    "term": "Gene expression clustering",
                    "uri": "http://edamontology.org/operation_0313"
                },
                {
                    "term": "Transcriptional regulatory element prediction",
                    "uri": "http://edamontology.org/operation_0438"
                },
                {
                    "term": "Gene to pathway mapping",
                    "uri": "http://edamontology.org/operation_0533"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Sequence accession (nucleic acid)",
                        "uri": "http://edamontology.org/data_1097"
                    }
                }
            ]
        }
    ],
    "labels": {
        "collectionID": [
            "BIG N2N",
            "VIB",
            "Plant Systems Biology",
            "UGent"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Sequence sites, features and motifs",
                "uri": "http://edamontology.org/topic_0160"
            }
        ]
    },
    "publication": [
        {
            "abstract": "Analysis of gene expression data generated by high-throughput microarray transcript profiling experiments has demonstrated that genes with an overall similar expression pattern are often enriched for similar functions. This guilt-by-association principle can be applied to define modular gene programs, identify cis-regulatory elements, or predict gene functions for unknown genes based on their coexpression neighborhood. We evaluated the potential to use Gene Ontology (GO) enrichment of a gene's coexpression neighborhood as a tool to predict its function but found overall low sensitivity scores (13%-34%). This indicates that for many functional categories, coexpression alone performs poorly to infer known biological gene functions. However, integration of cis-regulatory elements shows that 46% of the gene coexpression neighborhoods are enriched for one or more motifs, providing a valuable complementary source to functionally annotate genes. Through the integration of coexpression data, GO annotations, and a set of known cis-regulatory elements combined with a novel set of evolutionarily conserved plant motifs, we could link many genes and motifs to specific biological functions. Application of our coexpression framework extended with cis-regulatory element analysis on transcriptome data from the cell cycle-related transcription factor OBP1 yielded several coexpressed modules associated with specific cis-regulatory elements. Moreover, our analysis strongly suggests a feed-forward regulatory interaction between OBP1 and the E2F pathway. The ATCOECIS resource (http:// bioinformatics.psb. ugent.be/ATCOECIS/) makes it possible to query coexpression data and GO and cis-regulatory element annotations and to submit user-defined gene sets for motif analysis, providing an access point to unravel the regulatory code underlying transcriptional control in Arabidopsis (Arabidopsis thaliana). © 2009 American Society of Plant Biologists.",
            "authors": [
                "Vandepoele K.",
                "Quimbaya M.",
                "Casneuf T.",
                "De Veylder L.",
                "Van Peer Y.D."
            ],
            "cit_count": 139,
            "doi": "10.1104/pp.109.136028",
            "journal": "Plant Physiology",
            "title": "Unraveling transcriptional control in arabidopsis using cis-regulatory elements and coexpression networks1[C][W]",
            "type": "Primary",
            "year": "2009-06-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:atcoecis",
        "biotoolsID": "atcoecis",
        "description": "Identify coexpressed genes or gene coexpression neighborhoods associated with cis-regulatory motifs or GO categories.",
        "homepage": "http://bioinformatics.psb.ugent.be/ATCOECIS/",
        "name": "ATCOECIS",
        "version": [
            "1"
        ]
    }
}