{
    "accessibility": [],
    "additionDate": "2017-03-24T10:30:36Z",
    "biotoolsCURIE": "biotools:stitchprofiles.uio.no",
    "biotoolsID": "stitchprofiles.uio.no",
    "collectionID": [],
    "confidence_flag": null,
    "cost": null,
    "credit": [
        {
            "email": "eivindto@math.uio.no",
            "gridid": null,
            "name": "Eivind Tøstesen",
            "note": null,
            "orcidid": null,
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": null
        }
    ],
    "description": "Stitchprofiles.uio.no is a server that performs web-based computations on DNA melting.  In addition to creating stitch profile diagrams representing the alternative conformations that partly melted DNA can adopt, the server can also plot the classical melting curves, probability profiles, and temperature profiles.",
    "documentation": [
        {
            "note": null,
            "type": "General",
            "url": "http://stitchprofiles.uio.no/help.php"
        }
    ],
    "download": [],
    "editPermission": {
        "authors": [],
        "type": "private"
    },
    "elixirNode": [],
    "elixirPlatform": [],
    "elixir_badge": 0,
    "function": [
        {
            "cmd": null,
            "input": [],
            "note": null,
            "operation": [
                {
                    "term": "Nucleic acid thermodynamic property calculation",
                    "uri": "http://edamontology.org/operation_0455"
                },
                {
                    "term": "Nucleic acid melting curve plotting",
                    "uri": "http://edamontology.org/operation_0458"
                },
                {
                    "term": "Nucleic acid melting profile plotting",
                    "uri": "http://edamontology.org/operation_0456"
                },
                {
                    "term": "Nucleic acid temperature profile plotting",
                    "uri": "http://edamontology.org/operation_0460"
                },
                {
                    "term": "Nucleic acid stitch profile plotting",
                    "uri": "http://edamontology.org/operation_0457"
                }
            ],
            "output": []
        }
    ],
    "homepage": "http://stitchprofiles.uio.no/",
    "homepage_status": 0,
    "language": [],
    "lastUpdate": "2018-12-10T12:58:53Z",
    "license": null,
    "link": [],
    "maturity": null,
    "name": "Stitchprofiles.uio.no",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "otherID": [],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "doi": null,
            "metadata": {
                "abstract": "In this study, we describe a web server that performs computations on DNA melting, thus predicting the localized separation of the two strands for sequences provided by the users. The output types are stitch profiles, melting curves, probability profiles, etc. Stitch profile diagrams visualize the ensemble of alternative conformations that DNA can adopt with different probabilities. For example, a stitch profile shows the possible loop openings in terms of their locations, sizes, probabilities and fluctuations at a given temperature. Sequences with lengths up to several tens or hundreds of kilobase pairs can be analysed. The tools are freely available at http://stitchprofiles.uio.no. © 2005 Oxford University Press.",
                "authors": [
                    {
                        "name": "Tostesen E."
                    },
                    {
                        "name": "Jerstad G.I."
                    },
                    {
                        "name": "Hovig E."
                    }
                ],
                "citationCount": 14,
                "date": "2005-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "Stitchprofiles.uio.no: Analysis of partly melted DNA conformations using stitch profiles"
            },
            "note": null,
            "pmcid": null,
            "pmid": "15980539",
            "type": null,
            "version": null
        },
        {
            "doi": null,
            "metadata": {
                "abstract": "We describe an optimized algorithm, which is faster and more accurate compared to previously described algorithms, for computing the statistical mechanics of denaturation of nucleic acid sequences according to the classical Poland-Scheraga type of model. Nearest neighbor thermodynamics has been included in a complete and general way, by rigorously treating nearest neighbor interactions, helix end interactions, and isolated base-pairs. This avoids the simplifications of previous approaches and achieves full generality and controllability with respect to thermodynamic modeling. The algorithm computes subchain partition functions by recursion, from which various quantitative aspects of the melting process are easily derived, for example the base-pairing probability profiles. The algorithm represents an optimization with respect to algorithmic complexity of the partition function algorithm of Yeramian et al. (Biopolymers 1990, 30, 481-497): we reduce the computation time for a base-pairing probability profile from O(N2) to O(N), where N is the sequence length. This speed-up comes in addition to the speed-up due to a multiexponential approximation of the loop entropy factor as introduced by Fixman and Freire22 and applied by Yeramian et al.25 The speed-up, however, is independent of the multiexponential approximation and reduces time from O(N3) to O(N2) in the exact case. A method for representing very large numbers is described, which avoids numerical overflow in the partition functions for genomic length sequences. In addition to calculating the standard base-pairing probability profiles, we propose to use the algorithm to calculate various other probabilities (loops, helices, tails) for a more direct view of the melting regions and their positions and sizes. This can provide a better understanding of the physics of denaturation and the biology of genomes. © 2003 Wiley Periodicals, Inc.",
                "authors": [
                    {
                        "name": "Tostesen E."
                    },
                    {
                        "name": "Liu F."
                    },
                    {
                        "name": "Jenssen T.-K."
                    },
                    {
                        "name": "Hovig E."
                    }
                ],
                "citationCount": 20,
                "date": "2003-10-01T00:00:00Z",
                "journal": "Biopolymers",
                "title": "Speed-Up of DNA Melting Algorithm with Complete Nearest Neighbor Properties"
            },
            "note": null,
            "pmcid": null,
            "pmid": "14579309",
            "type": null,
            "version": null
        }
    ],
    "relation": [],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Nucleic acid structure analysis",
            "uri": "http://edamontology.org/topic_0097"
        },
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        },
        {
            "term": "Structure prediction",
            "uri": "http://edamontology.org/topic_0082"
        }
    ],
    "validated": 1,
    "version": []
}