
{
    "credit": [
        {
            "email": "honig_software@c2b2.columbia.edu",
            "name": "Support",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "https://honiglab.c2b2.columbia.edu/PredUs/help.html"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Protein-protein interaction prediction",
                    "uri": "http://edamontology.org/operation_2464"
                },
                {
                    "term": "Protein secondary structure prediction",
                    "uri": "http://edamontology.org/operation_0267"
                },
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                },
                {
                    "term": "Protein structure prediction",
                    "uri": "http://edamontology.org/operation_0474"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Protein interactions",
                "uri": "http://edamontology.org/topic_0128"
            },
            {
                "term": "Structure prediction",
                "uri": "http://edamontology.org/topic_0082"
            },
            {
                "term": "Proteins",
                "uri": "http://edamontology.org/topic_0078"
            },
            {
                "term": "Protein structural motifs and surfaces",
                "uri": "http://edamontology.org/topic_0166"
            }
        ]
    },
    "publication": [
        {
            "abstract": "We describe PredUs, an interactive web server for the prediction of protein-protein interfaces. Potential interfacial residues for a query protein are identified by 'mapping' contacts from known interfaces of the query protein's structural neighbors to surface residues of the query. We calculate a score for each residue to be interfacial with a support vector machine. Results can be visualized in a molecular viewer and a number of interactive features allow users to tailor a prediction to a particular hypothesis. The PredUs server is available at: http://wiki.c2b2.columbia.edu/honiglab-public/index.php/ Software:PredUs. © 2011 The Author(s).",
            "authors": [
                "Zhang Q.C.",
                "Deng L.",
                "Fisher M.",
                "Guan J.",
                "Honig B.",
                "Petrey D."
            ],
            "cit_count": 56,
            "journal": "Nucleic Acids Research",
            "pmid": "21609948",
            "title": "PredUs: A web server for predicting protein interfaces using structural neighbors",
            "year": "2011-07-01"
        },
        {
            "abstract": "With the advent of Systems Biology, the prediction of whether two proteins form a complex has become a problem of increased importance. A variety of experimental techniques have been applied to the problem, but three-dimensional structural information has not been widely exploited. Here we explore the range of applicability of such information by analyzing the extent to which the location of binding sites on protein surfaces is conserved among structural neighbors. We find, as expected, that interface conservation is most significant among proteins that have a clear evolutionary relationship, but that there is a significant level of conservation even among remote structural neighbors. This finding is consistent with recent evidence that information available from structural neighbors, independent of classification, should be exploited in the search for functional insights. The value of such structural information is highlighted through the development of a new protein interface prediction method, PredUs, that identifies what residues on protein surfaces are likely to participate in complexes with other proteins. The performance of PredUs, as measured through comparisons with other methods, suggests that relationships across protein structure space can be successfully exploited in the prediction of protein-protein interactions.",
            "authors": [
                "Zhang Q.C.",
                "Petrey D.",
                "Norel R.",
                "Honig B.H."
            ],
            "cit_count": 109,
            "journal": "Proceedings of the National Academy of Sciences of the United States of America",
            "pmid": "20534496",
            "title": "Protein interface conservation across structure space",
            "year": "2010-06-15"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:predus",
        "biotoolsID": "predus",
        "description": "PredUs is a web server for the prediction of protein-protein interfaces. The method predicts protein-protein interfaces of a given monomeric query protein using its close and remote structural neighbors.",
        "homepage": "http://wiki.c2b2.columbia.edu/honiglab_public/index.php/Software:PredUs",
        "name": "PredUs"
    }
}