{
    "additionDate": "2020-01-14T08:52:02Z",
    "biotoolsCURIE": "biotools:SpatialDB",
    "biotoolsID": "SpatialDB",
    "confidence_flag": "tool",
    "description": "a database for spatially resolved transcriptomes.\n\nWelcome to SpatialDB! click thumbnails to quickly browse the spatial gene expression profiles.\n\nSpatially resolved transcriptomics providing gene expression profiles with positional information is key to tissue function and fundamental to disease pathology",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                },
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://www.spatialomics.org/SpatialDB",
    "lastUpdate": "2024-11-24T20:53:14.812427Z",
    "name": "SpatialDB",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/nar/gkz934",
            "metadata": {
                "abstract": "Spatially resolved transcriptomic techniques allow the characterization of spatial organization of cells in tissues, which revolutionize the studies of tissue function and disease pathology. New strategies for detecting spatial gene expression patterns are emerging, and spatially resolved transcriptomic data are accumulating rapidly. However, it is not convenient for biologists to exploit these data due to the diversity of strategies and complexity in data analysis. Here, we present SpatialDB, the first manually curated database for spatially resolved transcriptomic techniques and datasets. The current version of SpatialDB contains 24 datasets (305 sub-datasets) from 5 species generated by 8 spatially resolved transcriptomic techniques. SpatialDB provides a user-friendly web interface for visualization and comparison of spatially resolved transcriptomic data. To further explore these data, SpatialDB also provides spatially variable genes and their functional enrichment annotation. SpatialDB offers a repository for research community to investigate the spatial cellular structure of tissues, and may bring new insights into understanding the cellular microenvironment in disease. SpatialDB is freely available at https://www.spatialomics.org/SpatialDB.",
                "authors": [
                    {
                        "name": "Chen R."
                    },
                    {
                        "name": "Chen X."
                    },
                    {
                        "name": "Fan Z."
                    }
                ],
                "citationCount": 67,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "SpatialDB: A database for spatially resolved transcriptomes"
            },
            "pmcid": "PMC7145543",
            "pmid": "31713629"
        }
    ],
    "topic": [
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ],
    "validated": 1
}
