{
    "accessibility": "Open access",
    "additionDate": "2024-06-18T21:43:20.855494Z",
    "biotoolsCURIE": "biotools:wmkl",
    "biotoolsID": "wmkl",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "cuiy@msu.edu",
            "name": "Yuehua Cui",
            "orcidid": "https://orcid.org/0000-0001-8099-1753",
            "typeEntity": "Person"
        }
    ],
    "description": "Weighted method, termed weight-boosted Multi-Kernel Learning (wMKL) which incorporates heterogeneous data types as well as flexible weight functions, to boost subtype identification. Given a series of weight functions, we propose an omnibus combination strategy to integrate different weight-related P-values to improve subtyping precision.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Classification",
                    "uri": "http://edamontology.org/operation_2990"
                },
                {
                    "term": "Data handling",
                    "uri": "http://edamontology.org/operation_2409"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/biostatcao/wMKL",
    "language": [
        "C++",
        "R"
    ],
    "lastUpdate": "2024-11-24T13:52:39.668562Z",
    "name": "wMKL",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1038/s41416-024-02587-w",
            "metadata": {
                "abstract": "Background: Cancer is a heterogeneous disease driven by complex molecular alterations. Cancer subtypes determined from multi-omics data can provide novel insight into personalised precision treatment. It is recognised that incorporating prior weight knowledge into multi-omics data integration can improve disease subtyping. Methods: We develop a weighted method, termed weight-boosted Multi-Kernel Learning (wMKL) which incorporates heterogeneous data types as well as flexible weight functions, to boost subtype identification. Given a series of weight functions, we propose an omnibus combination strategy to integrate different weight-related P-values to improve subtyping precision. Results: wMKL models each data type with multiple kernel choices, thus alleviating the sensitivity and robustness issue due to selecting kernel parameters. Furthermore, wMKL integrates different data types by learning weights of different kernels derived from each data type, recognising the heterogeneous contribution of different data types to the final subtyping performance. The proposed wMKL outperforms existing weighted and non-weighted methods. The utility and advantage of wMKL are illustrated through extensive simulations and applications to two TCGA datasets. Novel subtypes are identified followed by extensive downstream bioinformatics analysis to understand the molecular mechanisms differentiating different subtypes. Conclusions: The proposed wMKL method provides a novel strategy for disease subtyping. The wMKL is freely available at https://github.com/biostatcao/wMKL.",
                "authors": [
                    {
                        "name": "Cao H."
                    },
                    {
                        "name": "Cui Y."
                    },
                    {
                        "name": "Fang R."
                    },
                    {
                        "name": "Jia C."
                    },
                    {
                        "name": "Li Z."
                    },
                    {
                        "name": "Yang H."
                    },
                    {
                        "name": "Zhang Y."
                    }
                ],
                "date": "2024-04-06T00:00:00Z",
                "journal": "British Journal of Cancer",
                "title": "wMKL: multi-omics data integration enables novel cancer subtype identification via weight-boosted multi-kernel learning"
            },
            "pmid": "38278975"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Human biology",
            "uri": "http://edamontology.org/topic_2815"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        }
    ]
}
