{
    "additionDate": "2020-01-14T09:20:05Z",
    "biotoolsCURIE": "biotools:LuxR",
    "biotoolsID": "LuxR",
    "confidence_flag": "tool",
    "description": "Global H-NS counter-silencing by LuxR activates quorum sensing gene expression.\n\nFileUtil.pm - perl helper module for loading files reformatFasta.pl - perl script the cleans and reformats multi-fasta files findOverlaps.pl - perl script to identify sets of overlapping peaks for Venn diagram getPeakAnno.pl - perl script to add annotation information to Macs2 peaks getGenePeakAnno2.pl - perl script to add peaks to gene information findClosest2.pl - perl script to produce table relating luxR peaks to H-NS double peaks.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Formatting",
                    "uri": "http://edamontology.org/operation_0335"
                },
                {
                    "term": "Operon prediction",
                    "uri": "http://edamontology.org/operation_0435"
                },
                {
                    "term": "PCR primer design",
                    "uri": "http://edamontology.org/operation_0308"
                },
                {
                    "term": "Peak calling",
                    "uri": "http://edamontology.org/operation_3222"
                },
                {
                    "term": "Promoter prediction",
                    "uri": "http://edamontology.org/operation_0440"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Juliacvk/LuxR_H-NS",
    "language": [
        "Perl"
    ],
    "lastUpdate": "2020-12-22T13:38:17Z",
    "name": "LuxR",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/NAR/GKZ1089",
            "metadata": {
                "abstract": "© 2019 The Author(s) 2019. Published by Oxford University Press on behalf of Nucleic Acids Research.Bacteria coordinate cellular behaviors using a cell-cell communication system termed quorum sensing. In Vibrio harveyi, the master quorum sensing transcription factor LuxR directly regulates >100 genes in response to changes in population density. Here, we show that LuxR derepresses quorum sensing loci by competing with H-NS, a global transcriptional repressor that oligomerizes on DNA to form filaments and bridges. We first identified H-NS as a repressor of bioluminescence gene expression, for which LuxR is a required activator. In an hns deletion strain, LuxR is no longer necessary for transcription activation of the bioluminescence genes, suggesting that the primary role of LuxR is to displace H-NS to derepress gene expression. Using RNA-seq and ChIP-seq, we determined that H-NS and LuxR co-regulate and co-occupy 28 promoters driving expression of 63 genes across the genome. ChIP-PCR assays show that as autoinducer concentration increases, LuxR protein accumulates at co-occupied promoters while H-NS protein disperses. LuxR is sufficient to evict H-NS from promoter DNA in vitro, which is dependent on LuxR DNA binding activity. From these findings, we propose a model in which LuxR serves as a counter-silencer at H-NS-repressed quorum sensing loci by disrupting H-NS nucleoprotein complexes that block transcription.",
                "authors": [
                    {
                        "name": "Chaparian R.R."
                    },
                    {
                        "name": "Miller Conrad L.C."
                    },
                    {
                        "name": "Rusch D.B."
                    },
                    {
                        "name": "Tran M.L.N."
                    },
                    {
                        "name": "Van Kessel J.C."
                    }
                ],
                "citationCount": 6,
                "date": "2020-01-10T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "Global H-NS counter-silencing by LuxR activates quorum sensing gene expression"
            },
            "pmid": "31745565"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "ChIP-on-chip",
            "uri": "http://edamontology.org/topic_3179"
        },
        {
            "term": "ChIP-seq",
            "uri": "http://edamontology.org/topic_3169"
        },
        {
            "term": "PCR experiment",
            "uri": "http://edamontology.org/topic_3519"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ],
    "validated": 1
}
