{"collectionID": ["BioConductor", "Proteomics"], "accessibility": [], "topic": [{"term": "Proteomics experiment", "uri": "http://edamontology.org/topic_3520"}, {"term": "Proteomics", "uri": "http://edamontology.org/topic_0121"}], "owner": "shadi.m", "cost": null, "relation": [{"type": "uses", "biotoolsID": "msnbase"}], "download": [{"url": "http://bioconductor.org/packages/release/bioc/src/contrib/DEP_1.2.0.tar.gz", "note": null, "version": null, "type": "Software package"}], "validated": 0, "publication": [{"doi": "10.1038/nprot.2017.147", "note": null, "version": null, "pmid": null, "type": "Primary", "pmcid": null, "metadata": {"title": "Proteome-wide identification of ubiquitin interactions using UbIA-MS", "abstract": "© 2018 Macmillan Publishers Limited.ubiquitin-binding proteins play an important role in eukaryotes by translating differently linked polyubiquitin chains into proper cellular responses. current knowledge about ubiquitin-binding proteins and ubiquitin linkage-selective interactions is mostly based on case-by-case studies. We have recently reported a method called ubiquitin interactor affinity enrichment–mass spectrometry (ubIa-Ms), which enables comprehensive identification of ubiquitin interactors for all ubiquitin linkages from crude cell lysates. one major strength of ubIa-Ms is the fact that ubiquitin interactors are enriched from crude cell lysates, in which proteins are present at endogenous levels, contain biologically relevant post-translational modifications (ptMs) and are assembled in native protein complexes. In addition, ubIa-Ms uses chemically synthesized nonhydrolyzable diubiquitin, which mimics native diubiquitin and is inert to cleavage by endogenous deubiquitinases (DuBs). Here, we present a detailed protocol for ubIa-Ms that proceeds in five stages: (i) chemical synthesis of ubiquitin precursors and click chemistry for the generation of biotinylated nonhydrolyzable diubiquitin baits, (ii) in vitro affinity purification of ubiquitin interactors, (iii) on-bead interactor digestion, (iv) liquid chromatography (lc)–Ms/Ms analysis and (v) data analysis to identify differentially enriched proteins. the computational analysis tools are freely available as an open-source r software package, including a graphical interface. typically, ubIa-Ms allows the identification of dozens to hundreds of ubiquitin interactors from any type of cell lysate, and can be used to study cell type or stimulus-dependent ubiquitin interactions. the nonhydrolyzable diubiquitin synthesis can be completed in 3 weeks, followed by ubiquitin interactor enrichment and identification, which can be completed within another 2 weeks.", "citationCount": 9, "authors": [{"name": "Zhang X."}, {"name": "Smits A.H."}, {"name": "Van Tilburg G.B.A."}, {"name": "Ovaa H."}, {"name": "Huber W."}, {"name": "Vermeulen M."}], "date": "2018-01-01T00:00:00Z", "journal": "Nature Protocols"}}], "homepage_status": 0, "credit": [{"typeRole": ["Primary contact"], "name": "Arne Smits", "url": null, "gridid": null, "note": null, "orcidid": null, "typeEntity": "Person", "email": "smits.arne@gmail.com"}], "biotoolsCURIE": "biotools:dep", "elixirPlatform": [], "elixirNode": [], "version": ["1.2.0"], "elixir_badge": 0, "homepage": "http://bioconductor.org/packages/release/bioc/html/DEP.html", "function": [{"note": null, "input": [], "operation": [{"term": "Differential gene expression analysis", "uri": "http://edamontology.org/operation_3223"}], "cmd": null, "output": []}], "lastUpdate": "2019-07-20T17:35:53Z", "otherID": [], "description": "This package provides an integrated analysis workflow for robust and reproducible analysis of mass spectrometry proteomics data for differential protein expression or differential enrichment. It requires tabular input (e.g. txt files) as generated by quantitative analysis softwares of raw mass spectrometry data, such as MaxQuant or IsobarQuant.", "toolType": ["Library"], "editPermission": {"type": "group", "authors": ["proteomics.bio.tools"]}, "language": ["R"], "link": [{"url": "http://bioconductor.org/packages/DEP/", "note": null, "type": "Mirror"}, {"url": "https://git.bioconductor.org/packages/DEP", "note": null, "type": "Repository"}], "biotoolsID": "dep", "additionDate": "2018-07-08T11:47:26Z", "name": "DEP", "license": "Artistic-2.0", "documentation": [{"url": "http://bioconductor.org/packages/release/bioc/manuals/DEP/man/DEP.pdf", "note": null, "type": "User manual"}], "maturity": null, "confidence_flag": null, "operatingSystem": ["Linux", "Windows", "Mac"]}