{
    "additionDate": "2017-08-20T15:58:51Z",
    "biotoolsCURIE": "biotools:rampart",
    "biotoolsID": "rampart",
    "collectionID": [
        "Animal and Crop Genomics"
    ],
    "credit": [
        {
            "email": "daniel.mapleson@earlham.ac.uk",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "A configurable workflow management system for de novo genome assembly, which helps the user identify combinations of third-party tools and settings that provide good results for their particular genome and sequenced reads. RAMPART is designed to exploit High performance computing environments, such as clusters and shared memory systems, where available.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://rampart.readthedocs.io/en/latest/"
        }
    ],
    "editPermission": {
        "authors": [
            "animalandcropgenomics"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence assembly",
                    "uri": "http://edamontology.org/operation_0310"
                }
            ]
        }
    ],
    "homepage": "https://github.com/TGAC/RAMPART",
    "language": [
        "Java"
    ],
    "lastUpdate": "2019-09-04T08:38:28Z",
    "license": "GPL-3.0",
    "name": "rampart",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "admin",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btv056",
            "metadata": {
                "abstract": "© The Author 2015. Published by Oxford University Press. All rights reserved.Motivation: The de novo assembly of genomes from whole- genome shotgun sequence data is a computationally intensive, multi-stage task and it is not known a priori which methods and parameter settings will produce optimal results. In current de novo assembly projects, a popular strategy involves trying many approaches, using different tools and settings, and then comparing and contrasting the results in order to select a final assembly for publication. Results: Herein, we present RAMPART, a configurable workflow management system for de novo genome assembly, which helps the user identify combinations of third-party tools and settings that provide good results for their particular genome and sequenced reads. RAMPART is designed to exploit High performance computing environments, such as clusters and shared memory systems, where available. Availability and implementation: RAMPART is available under the GPLv3 license at: https://github. com/TGAC/RAMPART.",
                "authors": [
                    {
                        "name": "Mapleson D."
                    },
                    {
                        "name": "Drou N."
                    },
                    {
                        "name": "Swarbreck D."
                    }
                ],
                "citationCount": 10,
                "date": "2015-06-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "RAMPART: A workflow management system for de novo genome assembly"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ],
    "validated": 1
}