{
    "additionDate": "2021-01-18T07:33:15Z",
    "biotoolsCURIE": "biotools:festival",
    "biotoolsID": "festival",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "accarniel@gmail.com",
            "name": "Anderson C. Carniel",
            "typeEntity": "Person"
        }
    ],
    "description": "FESTIval is a versatile framework for conducting experimental evaluations of spatial indices. FESTIval also provides default spatial datasets for evaluating spatial indices. Algorithms to generate query windows for range queries and points for point queries are further provided.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://github.com/accarniel/FESTIval/wiki/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://accarniel.github.io/FESTIval/",
    "language": [
        "C"
    ],
    "lastUpdate": "2021-03-10T21:43:11Z",
    "license": "GPL-3.0",
    "name": "FESTIval",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1016/J.MEX.2019.10.006",
            "metadata": {
                "abstract": "© 2019 The Author(s)The use of a spatial index is a common strategy to improve the performance of spatial queries in spatial database systems and Geographic Information Systems. Choosing the right spatial index to be employed in a given context requires a quantitative method to analyze the performance of spatial indices. This is done through extensive experimental evaluations. However, conducting these evaluations is an expensive, error-prone, and challenging task because (i) spatial objects are complex data to manage, (ii) spatial indices can apply different parameter values and thus assume distinct configurations, and (iii) there are indices specifically developed for different storage systems, such as disks and flash memories. In this article, we propose FESTIval, a versatile framework for conducting experimental evaluations of spatial indices. FESTIval has the following main advantages: • the support for different types of disk-based and flash-aware spatial indices; • the specification and execution of user-defined workloads; • the use of a data schema that stores index configurations and statistical data of executed workloads. Because of its characteristics, FESTIval allows users to reproduce executed experiments. Further, FESTIval provides an extensible environment, where any spatial dataset can be handled by spatial indices. FESTIval has been used to validate new proposals of flash-aware spatial indices, such as eFIND-based indices.",
                "authors": [
                    {
                        "name": "Carniel A.C."
                    },
                    {
                        "name": "Ciferri R.R."
                    },
                    {
                        "name": "Ciferri C.D.A."
                    }
                ],
                "citationCount": 2,
                "date": "2020-01-01T00:00:00Z",
                "journal": "MethodsX",
                "title": "FESTIval: A versatile framework for conducting experimental evaluations of spatial indices"
            },
            "pmcid": "PMC6994642",
            "pmid": "32021811"
        }
    ],
    "toolType": [
        "Workbench"
    ],
    "topic": [
        {
            "term": "Laboratory techniques",
            "uri": "http://edamontology.org/topic_3361"
        },
        {
            "term": "Database management",
            "uri": "http://edamontology.org/topic_3489"
        },
        {
            "term": "Literature and language",
            "uri": "http://edamontology.org/topic_3068"
        }
    ]
}