{
    "additionDate": "2017-02-10T14:14:08Z",
    "biotoolsCURIE": "biotools:canpredict",
    "biotoolsID": "canpredict",
    "description": "Combination of computational methods to predict whether specific sequence changes in a protein are likely to be cancer-associated mutations.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Molecular docking",
                    "uri": "http://edamontology.org/operation_0478"
                },
                {
                    "term": "Protein globularity prediction",
                    "uri": "http://edamontology.org/operation_0408"
                },
                {
                    "term": "Protein modelling (mutation)",
                    "uri": "http://edamontology.org/operation_0331"
                }
            ]
        }
    ],
    "homepage": "http://www.cgl.ucsf.edu/Research/genentech/canpredict/",
    "lastUpdate": "2018-12-10T12:58:39Z",
    "name": "CanPredict",
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "Missense variants are commonly identified in genoinic sequence but only a small fraction directly contribute to oncogenesis. The ability to distinguish those missense changes that contribute to cancer progression from those that do not is a difficult problem usually only accomplished through functional in vivo analyses. Using two computational algorithms, Sorting Intolerant from Tolerant (SIFT) and the Pfam-based LogR.E-value method, we have identified features that distinguish cancer-associated missense mutations from other classes of missense change. Our data reveal that cancer mutants behave similarly to Mendelian disease mutations, but are clearly distinct from either complex disease mutations or common single-nucleotide polymorphisms. We show that both activating and inactivating oncogenic mutations are predicted to be deleterious, although activating changes are likely to increase protein activity. Using the Gene Ontology and data from the SIFT and LogR.E-value metrics, a classifier was built that predicts cancer-associated missense mutations with a very low false-positive rate. The classifier does remarkably well in a number of different experiments designed to distinguish polymorphisms from true cancer-associated mutations. We also show that recurrently observed mutations are much more likely to be predicted to be cancer-associated than rare mutations, suggesting that our classifier will be useful in distinguishing causal from passenger mutations. In addition, from an expressed sequence tag-based screen, we identified a previously unknown germ line change (P1104A) in tumor tissues that is predicted to disrupt the function of the TYK2 protein. The data presented here show that this novel bioinformatics approach to classifying cancer-associated variants is robust and can be used for large-scale analyses. ©2007 American Association for Cancer Research.",
                "authors": [
                    {
                        "name": "Bazan J.F."
                    },
                    {
                        "name": "Forrest W.F."
                    },
                    {
                        "name": "Haverty P.M."
                    },
                    {
                        "name": "Kaminker J.S."
                    },
                    {
                        "name": "Peters B."
                    },
                    {
                        "name": "Sebisanovic D."
                    },
                    {
                        "name": "Seshagiri S."
                    },
                    {
                        "name": "Stinson J."
                    },
                    {
                        "name": "Waugh A."
                    },
                    {
                        "name": "Zhang Y."
                    },
                    {
                        "name": "Zhang Z."
                    }
                ],
                "citationCount": 98,
                "date": "2007-01-15T00:00:00Z",
                "journal": "Cancer Research",
                "title": "Distinguishing cancer-associated missense mutations from common polymorphisms"
            },
            "pmid": "17234753"
        },
        {
            "metadata": {
                "abstract": "Various cancer genome projects are underway to identify novel mutations that drive tumorigenesis. While these screens will generate large data sets, the majority of identified missense changes are likely to be innocuous passenger mutations or polymorphisms. As a result, it has become increasingly important to develop computational methods for distinguishing functionally relevant mutations from other variations. We previously developed an algorithm, and now present the web application, CanPredict (http://www.canpredict.org/or http://www.cgl.ucsf.edu/Research/genentech/canpredict/), to allow users to determine if particular changes are likely to be cancer-associated. The impact of each change is measured using two known methods: Sorting Intolerant From Tolerant (SIFT) and the Pfam-based LogR.E-value metric. A third method, the Gene Ontology Similarity Score (GOSS), provides an indication of how closely the gene in which the variant resides resembles other known cancer-causing genes. Scores from these three algorithms are analyzed by a random forest classifier which then predicts whether a change is likely to be cancer-associated. CanPredict fills an important need in cancer biology and will enable a large audience of biologists to determine which mutations are the most relevant for further study. © 2007 The Author(s).",
                "authors": [
                    {
                        "name": "Kaminker J.S."
                    },
                    {
                        "name": "Watanabe C."
                    },
                    {
                        "name": "Zhang Y."
                    },
                    {
                        "name": "Zhang Z."
                    }
                ],
                "citationCount": 113,
                "date": "2007-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "CanPredict: A computational tool for predicting cancer-associated missense mutations"
            },
            "pmid": "17537827"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Structure prediction",
            "uri": "http://edamontology.org/topic_0082"
        }
    ],
    "validated": 1
}
