{
    "accessibility": "Open access",
    "additionDate": "2023-02-09T13:49:01.874577Z",
    "biotoolsCURIE": "biotools:aau-net",
    "biotoolsID": "aau-net",
    "confidence_flag": "tool",
    "credit": [
        {
            "name": "Gongping Chen"
        }
    ],
    "description": "An adaptive attention U-net (AAU-net) to segment breast lesions automatically and stably from ultrasound images.",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://github.com/CGPxy/AAU-net",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T15:04:26.489314Z",
    "license": "Not licensed",
    "name": "AAU-net",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1109/tmi.2022.3226268",
            "metadata": {
                "abstract": "Various deep learning methods have been proposed to segment breast lesions from ultrasound images. However, similar intensity distributions, variable tumor morphologies and blurred boundaries present challenges for breast lesions segmentation, especially for malignant tumors with irregular shapes. Considering the complexity of ultrasound images, we develop an adaptive attention U-net (AAU-net) to segment breast lesions automatically and stably from ultrasound images. Specifically, we introduce a hybrid adaptive attention module (HAAM), which mainly consists of a channel self-attention block and a spatial self-attention block, to replace the traditional convolution operation. Compared with the conventional convolution operation, the design of the hybrid adaptive attention module can help us capture more features under different receptive fields. Different from existing attention mechanisms, the HAAM module can guide the network to adaptively select more robust representation in channel and space dimensions to cope with more complex breast lesions segmentation. Extensive experiments with several state-of-the-art deep learning segmentation methods on three public breast ultrasound datasets show that our method has better performance on breast lesions segmentation. Furthermore, robustness analysis and external experiments demonstrate that our proposed AAU-net has better generalization performance in the breast lesion segmentation. Moreover, the HAAM module can be flexibly applied to existing network frameworks. The source code is available on https://github.com/CGPxy/AAU-net.",
                "authors": [
                    {
                        "name": "Chen G."
                    },
                    {
                        "name": "Dai Y."
                    },
                    {
                        "name": "Li L."
                    },
                    {
                        "name": "Yap M.H."
                    },
                    {
                        "name": "Zhang J."
                    }
                ],
                "citationCount": 84,
                "date": "2023-05-01T00:00:00Z",
                "journal": "IEEE Transactions on Medical Imaging",
                "title": "AAU-Net: An Adaptive Attention U-Net for Breast Lesions Segmentation in Ultrasound Images"
            },
            "pmid": "36455083"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Echography",
            "uri": "http://edamontology.org/topic_3954"
        }
    ]
}
