{
    "additionDate": "2021-01-18T11:53:02Z",
    "biotoolsCURIE": "biotools:clover",
    "biotoolsID": "clover",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "cytang@pu.edu.tw",
            "name": "Chuan Yi Tang",
            "typeEntity": "Person"
        }
    ],
    "description": "a clustering-oriented de novo assembler for Illumina sequences.\n\nClover is a clustering-oriented de novo assembler for Illumina sequences, which bases on the de Bruijn graph method and utilizes a novel k-mer clustering approach from the overlap-based concept to improve the robustness with respect to sequencing error especially using large k-mers.Clover achieves a superior assembly quality in terms of corrected N50 and E-size.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "De-novo assembly",
                    "uri": "http://edamontology.org/operation_0524"
                },
                {
                    "term": "Genome assembly",
                    "uri": "http://edamontology.org/operation_0525"
                },
                {
                    "term": "de Novo sequencing",
                    "uri": "http://edamontology.org/operation_3644"
                },
                {
                    "term": "k-mer counting",
                    "uri": "http://edamontology.org/operation_3472"
                }
            ]
        }
    ],
    "homepage": "https://oz.nthu.edu.tw/~d9562563/src.html",
    "lastUpdate": "2021-02-12T16:05:50Z",
    "name": "Clover",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1186/S12859-020-03788-9",
            "metadata": {
                "abstract": "© 2020, The Author(s).Background: Next-generation sequencing technologies revolutionized genomics by producing high-throughput reads at low cost, and this progress has prompted the recent development of de novo assemblers. Multiple assembly methods based on de Bruijn graph have been shown to be efficient for Illumina reads. However, the sequencing errors generated by the sequencer complicate analysis of de novo assembly and influence the quality of downstream genomic researches. Results: In this paper, we develop a de Bruijn assembler, called Clover (clustering-oriented de novo assembler), that utilizes a novel k-mer clustering approach from the overlap-layout-consensus concept to deal with the sequencing errors generated by the Illumina platform. We further evaluate Clover’s performance against several de Bruijn graph assemblers (ABySS, SOAPdenovo, SPAdes and Velvet), overlap-layout-consensus assemblers (Bambus2, CABOG and MSR-CA) and string graph assembler (SGA) on three datasets (Staphylococcus aureus, Rhodobacter sphaeroides and human chromosome 14). The results show that Clover achieves a superior assembly quality in terms of corrected N50 and E-size while remaining a significantly competitive in run time except SOAPdenovo. In addition, Clover was involved in the sequencing projects of bacterial genomes Acinetobacter baumannii TYTH-1 and Morganella morganii KT. Conclusions: The marvel clustering-based approach of Clover that integrates the flexibility of the overlap-layout-consensus approach and the efficiency of the de Bruijn graph method has high potential on de novo assembly. Now, Clover is freely available as open source software from https://oz.nthu.edu.tw/~d9562563/src.html.",
                "authors": [
                    {
                        "name": "Hsieh M.-F."
                    },
                    {
                        "name": "Lu C.L."
                    },
                    {
                        "name": "Tang C.Y."
                    }
                ],
                "date": "2020-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Clover: a clustering-oriented de novo assembler for Illumina sequences"
            },
            "pmcid": "PMC7672897",
            "pmid": "33203354"
        }
    ],
    "topic": [
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ]
}
