{
    "additionDate": "2015-07-25T15:21:11Z",
    "biotoolsCURIE": "biotools:pintron",
    "biotoolsID": "pintron",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "bonizzoni@disco.unimib.it",
            "name": "Paola Bonizzoni",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "rizzi@disco.unimib.it",
            "name": "Raffaella Rizzi",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "yuri.pirola@unimib.it",
            "name": "Yuri Pirola",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "name": "ELIXIR-ITA-BICOCCA",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        }
    ],
    "description": "A pipeline for gene-structure prediction based on spliced alignment of transcript sequences (ESTs and mRNAs) against a genomic sequence.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://pintron.algolab.eu/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Splice site prediction",
                    "uri": "http://edamontology.org/operation_0433"
                },
                {
                    "term": "Splice transcript prediction",
                    "uri": "http://edamontology.org/operation_0264"
                }
            ]
        }
    ],
    "homepage": "http://pintron.algolab.eu/",
    "language": [
        "C",
        "Perl",
        "Python"
    ],
    "lastUpdate": "2018-12-10T12:58:53Z",
    "license": "AGPL-3.0",
    "maturity": "Mature",
    "name": "PIntron",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "ELIXIR-ITA-BICOCCA",
    "publication": [
        {
            "doi": "10.1186/1471-2105-13-S5-S2",
            "metadata": {
                "abstract": "© 2012.Background: A challenging issue in designing computational methods for predicting the gene structure into exons and introns from a cluster of transcript (EST, mRNA) sequences, is guaranteeing accuracy as well as efficiency in time and space, when large clusters of more than 20,000 ESTs and genes longer than 1 Mb are processed. Traditionally, the problem has been faced by combining different tools, not specifically designed for this task. Results: We propose a fast method based on ad hoc procedures for solving the problem. Our method combines two ideas: a novel algorithm of proved small time complexity for computing spliced alignments of a transcript against a genome, and an efficient algorithm that exploits the inherent redundancy of information in a cluster of transcripts to select, among all possible factorizations of EST sequences, those allowing to infer splice site junctions that are largely confirmed by the input data. The EST alignment procedure is based on the construction of maximal embeddings, that are sequences obtained from paths of a graph structure, called embedding graph, whose vertices are the maximal pairings of a genomic sequence T and an EST P. The procedure runs in time linear in the length of P and T and in the size of the output. The method was implemented into the PIntron package. PIntron requires as input a genomic sequence or region and a set of EST and/or mRNA sequences. Besides the prediction of the full-length transcript isoforms potentially expressed by the gene, the PIntron package includes a module for the CDS annotation of the predicted transcripts. Conclusions: PIntron, the software tool implementing our methodology, is available at http://www.algolab.eu/PIntron under GNU AGPL. PIntron has been shown to outperform state-of-the-art methods, and to quickly process some critical genes. At the same time, PIntron exhibits high accuracy (sensitivity and specificity) when benchmarked with ENCODE annotations.",
                "authors": [
                    {
                        "name": "Bonizzoni P."
                    },
                    {
                        "name": "Pesole G."
                    },
                    {
                        "name": "Picardi E."
                    },
                    {
                        "name": "Pirola Y."
                    },
                    {
                        "name": "Rizzi R."
                    },
                    {
                        "name": "Vedova G.D."
                    }
                ],
                "citationCount": 7,
                "date": "2012-01-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "PIntron: A fast method for detecting the gene structure due to alternative splicing via maximal pairings of a pattern and a text"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "RNA splicing",
            "uri": "http://edamontology.org/topic_3320"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ],
    "validated": 1,
    "version": [
        "1"
    ]
}
