{
    "accessibility": "Open access",
    "additionDate": "2022-06-30T14:10:10.102598Z",
    "biotoolsCURIE": "biotools:sizeextractr",
    "biotoolsID": "sizeextractr",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "l.lachs2@newcastle.ac.uk",
            "name": "Liam Lachs",
            "orcidid": "https://orcid.org/0000-0003-3712-6144",
            "typeEntity": "Person"
        },
        {
            "name": "Brigitte Sommer",
            "orcidid": "https://orcid.org/0000-0003-0617-7790"
        },
        {
            "name": "Fiona Chong",
            "orcidid": "https://orcid.org/0000-0002-8921-4878"
        },
        {
            "name": "Holly K. East",
            "orcidid": "https://orcid.org/0000-0002-0392-639X"
        },
        {
            "name": "James R. Guest",
            "orcidid": "https://orcid.org/0000-0002-9714-9009"
        },
        {
            "name": "Maria Beger",
            "orcidid": "https://orcid.org/0000-0003-1363-3571"
        }
    ],
    "description": "The goal of SizeExtractR is to facilitate scientific projects that have research questions relating to size, from pure biology to ecology on individual to landscape scales, by providing a protocol with a user-friendly set of interactive tools for image analysis (ImageJ-macros) and database formation and quality checking (R-package).",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                },
                {
                    "term": "Image annotation",
                    "uri": "http://edamontology.org/operation_3553"
                },
                {
                    "term": "Validation",
                    "uri": "http://edamontology.org/operation_2428"
                }
            ]
        }
    ],
    "homepage": "https://github.com/liamlachs/SizeExtractR",
    "language": [
        "R"
    ],
    "lastUpdate": "2024-11-24T15:58:30.476219Z",
    "license": "MIT",
    "name": "SizeExtractR",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1002/ece3.8724",
            "metadata": {
                "abstract": "Size is a biological characteristic that drives ecological processes from microscopic to geographic spatial scales, influencing cellular energetics, species fitness, population dynamics, and ecological interactions. Methods to measure size from images (e.g., proxies of body size, leaf area, and cell area) occur along a gradient from manual approaches to fully automated technologies (e.g., machine learning). These methods differ in terms of time investment, expertise required, and data or resource availability. While manual methods can improve accuracy through human recognition, they can be labor intensive, highlighting the need for semi-automated, and user-friendly software or workflows to increase the efficiency of manual techniques. Here, we present SizeExtractR, an open-source workflow that enables faster extraction of size metrics from scaled images (e.g., each image includes a ruler) using semi-automated protocols. It comprises a set of ImageJ macros to speed up size extraction and annotation, and an R-package for the quality control of annotations, data collation, calibration, and visualization. SizeExtractR extracts seven common size dimensions, including planar area, min/max diameter, and perimeter. Users can record additional categorical variables relating to their own study, for example species ID, by simply adding alphanumeric annotations to individual objects when prompted. Using a population size structure case study for hard corals as an example, we show how SizeExtractR was used to quantify the impact of mass coral bleaching on coral population dynamics. Lastly, the time saving benefit of using SizeExtractR was quantified during a series of timed image analyses, revealing up to a 49% reduction in image analysis time compared to a fully manual approach. SizeExtractR automatically archives results, allowing re-analysis of size extraction and promoting quality control and reproducibility. It has already been employed in marine and terrestrial sciences to assess population dynamics and demography, energy investment in eggs, and growth of nursery reared corals, with potential to be applied to a wide range of other research fields.",
                "authors": [
                    {
                        "name": "Beger M."
                    },
                    {
                        "name": "Chong F."
                    },
                    {
                        "name": "East H.K."
                    },
                    {
                        "name": "Guest J.R."
                    },
                    {
                        "name": "Lachs L."
                    },
                    {
                        "name": "Sommer B."
                    }
                ],
                "citationCount": 5,
                "date": "2022-03-01T00:00:00Z",
                "journal": "Ecology and Evolution",
                "title": "SizeExtractR: A workflow for rapid reproducible extraction of object size metrics from scaled images"
            },
            "pmcid": "PMC8928875",
            "pmid": "35342569"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Ecology",
            "uri": "http://edamontology.org/topic_0610"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ],
    "validated": 1
}
