
{
    "credit": [
        {
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://www.cs.duke.edu/~amink/"
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "https://users.cs.duke.edu/~amink/software/priority/documentation"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Search",
                    "uri": "http://edamontology.org/operation_2421"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Motif discovery",
                    "uri": "http://edamontology.org/operation_0238"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Java"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Transcription",
                "uri": "http://edamontology.org/topic_0203"
            },
            {
                "term": "DNA",
                "uri": "http://edamontology.org/topic_0654"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/priority-2-1-0-de-novo-motif-discovery.html"
        }
    ],
    "publication": [
        {
            "abstract": "Motivation: An important problem in molecular biology is to identify the locations at which a transcription factor (TF) binds to DNA, given a set of DNA sequences believed to be bound by that TF. In previous work, we showed that information in the DNA sequence of a binding site is sufficient to predict the structural class of the TF that binds it. In particular, this suggests that we can predict which locations in any DNA sequence are more likely to be bound by certain classes of TFs than others. Here, we argue that traditional methods for de novo motif finding can be significantly improved by adopting an informative prior probability that a TF binding site occurs at each sequence location. To demonstrate the utility of such an approach, we present priority, a powerful new de novo motif finding algorithm. Results: Using data from TRANSFAC, we train three classifiers to recognize binding sites of basic leucine zipper, forkhead, and basic helix loop helix TFs. These classifiers are used to equip priority with three class-specific priors, in addition to a default prior to handle TFs of other classes. We apply priority and a number of popular motif finding programs to sets of yeast intergenic regions that are reported by ChIP-chip to be bound by particular TFs. priority identifies motifs the other methods fail to identify, and correctly predicts the structural class of the TF recognizing the identified binding sites. © 2006 Oxford University Press.",
            "authors": [
                "Narlikar L.",
                "Gordan R.",
                "Ohler U.",
                "Hartemink A.J."
            ],
            "cit_count": 47,
            "doi": "10.1093/bioinformatics/btl251",
            "journal": "Bioinformatics",
            "title": "Informative priors based on transcription factor structural class improve de novo motif discovery",
            "type": "Primary",
            "year": "2006-07-15"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:priority",
        "biotoolsID": "priority",
        "description": "PRIORITY is a tool for de novo motif discovery in the context of transcription factor (TF) binding sites. It implements a new approach to motif discovery in which informative priors over sequence positions are used to guide the search.",
        "homepage": "http://www.cs.duke.edu/~amink/software/priority/",
        "name": "PRIORITY",
        "version": [
            "2.1.0"
        ]
    }
}