{"credit":[{"email":"hugues.richard@molgen.mpg.de","name":"Hugues Richard","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"http://cmb.molgen.mpg.de/2ndGenerationSequencing/Solas/installation.html"}],"function":[{"operation":[{"term":"Nucleic acid feature detection","uri":"http://edamontology.org/operation_0415"},{"term":"Splicing model analysis","uri":"http://edamontology.org/operation_2499"},{"term":"RNA-Seq quantification","uri":"http://edamontology.org/operation_3800"},{"term":"RNA-Seq analysis","uri":"http://edamontology.org/operation_3680"}]}],"labels":{"language":["R"],"maturity":"Mature","toolType":["Library"],"topic":[{"term":"Gene expression","uri":"http://edamontology.org/topic_0203"},{"term":"Statistics and probability","uri":"http://edamontology.org/topic_2269"},{"term":"Data mining","uri":"http://edamontology.org/topic_3473"},{"term":"RNA-Seq","uri":"http://edamontology.org/topic_3170"}]},"publication":[{"abstract":"Alternative splicing, polyadenylation of premessenger RNA molecules and differential promoter usage can produce a variety of transcript isoforms whose respective expression levels are regulated in time and space, thus contributing specific biological functions. However, the repertoire of mammalian alternative transcripts and their regulation are still poorly understood. Second-generation sequencing is now opening unprecedented routes to address the analysis of entire transcriptomes. Here, we developed methods that allow the prediction and quantification of alternative isoforms derived solely from exon expression levels in RNA-Seq data. These are based on an explicit statistical model and enable the prediction of alternative isoforms within or between conditions using any known gene annotation, as well as the relative quantification of known transcript structures. Applying these methods to a human RNA-Seq dataset, we validated a significant fraction of the predictions by RT-PCR. Data further showed that these predictions correlated well with information originating from junction reads. A direct comparison with exon arrays indicated improved performances of RNA-Seq over microarrays in the prediction of skipped exons. Altogether, the set of methods presented here comprehensively addresses multiple aspects of alternative isoform analysis. The software is available as an open-source R-package called Solas at http://cmb.molgen.mpg.de/2ndGenerationSequencing/Solas/. © The Author(s) 2010. Published by Oxford University Press.","authors":["Richard H.","Schulz M.H.","Sultan M.","Nurnberger A.","Schrinner S.","Balzereit D.","Dagand E.","Rasche A.","Lehrach H.","Vingron M.","Haas S.A.","Yaspo M.-L."],"cit_count":99,"journal":"Nucleic Acids Research","pmid":"20150413","title":"Prediction of alternative isoforms from exon expression levels in RNA-Seq experiments","year":"2010-02-11"}],"summary":{"biotoolsCURIE":"biotools:solas","biotoolsID":"solas","description":"An R package that allows prediction and quantification of alternative isoforms from exon expression levels in RNA-Seq data.","homepage":"http://cmb.molgen.mpg.de/2ndGenerationSequencing/Solas/","name":"Solas"}}