{"credit":[{"name":"ugent.be","typeEntity":"Institute","typeRoles":["Provider"]},{"email":"kathleen.marchal@intec.ugent.be","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"http://bioinformatics.intec.ugent.be/kmarchal/Supplementary_Information_Sun_2009_ModuleDigger/startPage.html"}],"function":[{"input":[{"data":{"term":"Nucleic acid sequence","uri":"http://edamontology.org/data_2977"}}],"operation":[{"term":"Transcriptional regulatory element prediction","uri":"http://edamontology.org/operation_0438"}],"output":[{"data":{"term":"Sequence motif (nucleic acid)","uri":"http://edamontology.org/data_2070"}}]}],"labels":{"collectionID":["BIG N2N","UGent"],"operatingSystem":["Linux"],"toolType":["Command-line tool"],"topic":[{"term":"Nucleic acid sites, features and motifs","uri":"http://edamontology.org/topic_3511"}]},"publication":[{"abstract":"Background: The detection of cis-regulatory modules (CRMs) that mediate transcriptional responses in eukaryotes remains a key challenge in the postgenomic era. A CRM is characterized by a set of co-occurring transcription factor binding sites (TFBS). In silico methods have been developed to search for CRMs by determining the combination of TFBS that are statistically overrepresented in a certain geneset. Most of these methods solve this combinatorial problem by relying on computational intensive optimization methods. As a result their usage is limited to finding CRMs in small datasets (containing a few genes only) and using binding sites for a restricted number of transcription factors (TFs) out of which the optimal module will be selected. Results: We present an itemset mining based strategy for computationally detecting cis-regulatory modules (CRMs) in a set of genes. We tested our method by applying it on a large benchmark data set, derived from a ChIP-Chip analysis and compared its performance with other well known cis-regulatory module detection tools. Conclusion: We show that by exploiting the computational efficiency of an itemset mining approach and combining it with a well-designed statistical scoring scheme, we were able to prioritize the biologically valid CRMs in a large set of coregulated genes using binding sites for a large number of potential TFs as input. © 2009 Sun et al; licensee BioMed Central Ltd.","authors":["Sun H.","De Bie T.","Storms V.","Fu Q.","Dhollander T.","Lemmens K.","Verstuyf A.","De Moor B.","Marchal K."],"cit_count":9,"doi":"10.1186/1471-2105-10-S1-S30","journal":"BMC Bioinformatics","title":"ModuleDigger: An itemset mining framework for the detection of cis-regulatory modules","type":"Primary","year":"2009-01-30"}],"summary":{"biotoolsCURIE":"biotools:moduledigger","biotoolsID":"moduledigger","description":"An itemset mining framework for the detection of cis-regulatory modules.","homepage":"http://bioinformatics.intec.ugent.be/kmarchal/Supplementary_Information_Sun_2009_ModuleDigger/Index.html","name":"ModuleDigger","version":["1"]}}