{
    "accessibility": "Open access",
    "additionDate": "2022-03-03T21:50:43.933831Z",
    "biotoolsCURIE": "biotools:ficos",
    "biotoolsID": "ficos",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "andrea.tangherloni@unibg.it",
            "name": "Andrea Tangherloni",
            "orcidid": "https://orcid.org/0000-0002-5856-4453",
            "typeEntity": "Person"
        },
        {
            "email": "daniela.besozzi@unimib.it",
            "name": "Daniela Besozzi",
            "orcidid": "https://orcid.org/0000-0001-5532-3059",
            "typeEntity": "Person"
        },
        {
            "name": "Giancarlo Mauri",
            "orcidid": "https://orcid.org/0000-0003-3520-4022"
        },
        {
            "name": "Leonardo Rundo",
            "orcidid": "https://orcid.org/0000-0003-3341-5483"
        },
        {
            "name": "Marco S. Nobile",
            "orcidid": "https://orcid.org/0000-0002-7692-7203"
        },
        {
            "name": "Paolo Cazzaniga",
            "orcidid": "https://orcid.org/0000-0001-7780-0434"
        }
    ],
    "description": "FiCoS (Fine- and Coarse-grained Simulator) is a novel efficient deterministic simulator of biological systems based on two different integration methods belonging to the Runge-Kutta family: the Dormand–Prince (DOPRI) method [1, 2], used in the absence of stiffness, and the Radau IIA method [3, 4] exploited when the system is stiff.\nSpecifically, FiCoS exploits the DOPRI5 and RADAU5 methods, which are explicit and implicit adaptive Runge-Kutta methods of order 5, capable of varying the integration step-size during the resolution of the Ordinary Differential Equation (ODE) systems.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Modelling and simulation",
                    "uri": "http://edamontology.org/operation_2426"
                },
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                },
                {
                    "term": "Simulation analysis",
                    "uri": "http://edamontology.org/operation_0244"
                }
            ]
        }
    ],
    "homepage": "https://gitlab.com/andrea-tango/ficos",
    "language": [
        "C",
        "C++",
        "Python"
    ],
    "lastUpdate": "2022-03-03T21:50:43.937140Z",
    "license": "BSD-3-Clause",
    "name": "FiCoS",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PCBI.1009410",
            "metadata": {
                "abstract": "Copyright: © 2021 Tangherloni et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Mathematical models of biochemical networks can largely facilitate the comprehension of the mechanisms at the basis of cellular processes, as well as the formulation of hypotheses that can be tested by means of targeted laboratory experiments. However, two issues might hamper the achievement of fruitful outcomes. On the one hand, detailed mechanistic models can involve hundreds or thousands of molecular species and their intermediate complexes, as well as hundreds or thousands of chemical reactions, a situation generally occurring in rule-based modeling. On the other hand, the computational analysis of a model typically requires the execution of a large number of simulations for its calibration or to test the effect of perturbations. As a consequence, the computational capabilities of modern Central Processing Units can be easily overtaken, possibly making the modeling of biochemical networks a worthless or ineffective effort. To the aim of overcoming the limitations of the current state-of-the-art simulation approaches, we present in this paper FiCoS, a novel “black-box” deterministic simulator that effectively realizes both a fine-grained and a coarse-grained parallelization on Graphics Processing Units. In particular, FiCoS exploits two different integration methods, namely, the Dormand–Prince and the Radau IIA, to efficiently solve both non-stiff and stiff systems of coupled Ordinary Differential Equations. We tested the performance of FiCoS against different deterministic simulators, by considering models of increasing size and by running analyses with increasing computational demands. FiCoS was able to dramatically speedup the computations up to 855×, showing to be a promising solution for the simulation and analysis of large-scale models of complex biological processes.",
                "authors": [
                    {
                        "name": "Besozzi D."
                    },
                    {
                        "name": "Capitoli G."
                    },
                    {
                        "name": "Cazzaniga P."
                    },
                    {
                        "name": "Mauri G."
                    },
                    {
                        "name": "Nobile M.S."
                    },
                    {
                        "name": "Rundo L."
                    },
                    {
                        "name": "Spolaor S."
                    },
                    {
                        "name": "Tangherloni A."
                    }
                ],
                "citationCount": 1,
                "date": "2021-09-01T00:00:00Z",
                "journal": "PLoS Computational Biology",
                "title": "FiCoS: A fine-grained and coarse-grained GPU-powered deterministic simulator for biochemical networks"
            },
            "pmcid": "PMC8476010",
            "pmid": "34499658"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Enzymes",
            "uri": "http://edamontology.org/topic_0821"
        },
        {
            "term": "Mathematics",
            "uri": "http://edamontology.org/topic_3315"
        },
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        },
        {
            "term": "Molecular dynamics",
            "uri": "http://edamontology.org/topic_0176"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ],
    "validated": 1
}
