{
    "additionDate": "2017-08-03T18:55:39Z",
    "biotoolsCURIE": "biotools:phenopred",
    "biotoolsID": "phenopred",
    "credit": [
        {
            "email": "predrag@indiana.edu",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Web-based tool designed to detect novel gene-disease associations in humans. It is based on known gene-disease associations, protein-protein interaction data, protein functional annotation at a molecular level and protein sequence data. Machine learning principles are used to integrate heterogeneous data sources. It can be used to prioritize genes based on their likelihood to be associated with a given disease or to prioritize diseases for a given query gene.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://www.phenopred.org/about.php"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein interaction prediction",
                    "uri": "http://edamontology.org/operation_2492"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                }
            ]
        }
    ],
    "homepage": "http://www.phenopred.org/",
    "lastUpdate": "2018-12-10T12:58:43Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/phenopred-detect-novel-gene-disease-associations-in-humans.html"
        }
    ],
    "name": "PhenoPred",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "One of the most important tasks of modern bioinformatics is the develop ment of computational tools that can be used to understand and treat human disease. To date, a variety of methods have been explored and algorithms for candidate gene prioritization are gain ing in their usefulness. Here, we pro pose an algorithm for detecting gene- disease associations based on the human protein-protein interaction net work, known gene-disease associations, protein sequence, and protein func tional information at the molecular level. Our method, PhenoPred, is super vised: first, we mapped each gene/pro tein onto the spaces of disease and functional terms based on distance to all annotated proteins in the protein interaction network. We also encoded sequence, function, physicochemical, and predicted structural properties, such as secondary structure and flexi bility. We then trained support vector machines to detect gene-disease associ ations for a number of terms in Disease Ontology and provided evidence that, despite the noise/incompleteness of ex perimental data and unfinished ontol ogy of diseases, identification of candi date genes can be successful even when a large number of candidate disease terms are predicted on simultaneously. © 2008 Wiley-Liss, Inc.",
                "authors": [
                    {
                        "name": "Radivojac P."
                    },
                    {
                        "name": "Peng K."
                    },
                    {
                        "name": "Clark W.T."
                    },
                    {
                        "name": "Peters B.J."
                    },
                    {
                        "name": "Mohan A."
                    },
                    {
                        "name": "Boyle S.M."
                    },
                    {
                        "name": "Mooney S.D."
                    }
                ],
                "citationCount": 119,
                "date": "2008-08-15T00:00:00Z",
                "journal": "Proteins: Structure, Function and Genetics",
                "title": "An integrated approach to inferring gene-disease associations in humans"
            },
            "pmid": "18300252"
        }
    ],
    "toolType": [
        "Web service"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        },
        {
            "term": "Human biology",
            "uri": "http://edamontology.org/topic_2815"
        }
    ],
    "validated": 1
}