
{
    "credit": [
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "https://gitlab.com/Philbrick/rilcontour/blob/master/README.md"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Text annotation",
                    "uri": "http://edamontology.org/operation_3778"
                },
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Image annotation",
                    "uri": "http://edamontology.org/operation_3553"
                }
            ]
        }
    ],
    "labels": {
        "accessibility": [
            "Open access"
        ],
        "cost": "Free of charge",
        "language": [
            "Python"
        ],
        "license": "BSD-2-Clause",
        "maturity": "Mature",
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Desktop application"
        ],
        "topic": [
            {
                "term": "Medical imaging",
                "uri": "http://edamontology.org/topic_3384"
            },
            {
                "term": "Machine learning",
                "uri": "http://edamontology.org/topic_3474"
            },
            {
                "term": "MRI",
                "uri": "http://edamontology.org/topic_3444"
            }
        ]
    },
    "link": [
        {
            "type": "ISSUE_TRACKER",
            "url": "https://gitlab.com/Philbrick/rilcontour/issues"
        }
    ],
    "publication": [
        {
            "abstract": "© 2019, The Author(s).Deep-learning algorithms typically fall within the domain of supervised artificial intelligence and are designed to “learn” from annotated data. Deep-learning models require large, diverse training datasets for optimal model convergence. The effort to curate these datasets is widely regarded as a barrier to the development of deep-learning systems. We developed RIL-Contour to accelerate medical image annotation for and with deep-learning. A major goal driving the development of the software was to create an environment which enables clinically oriented users to utilize deep-learning models to rapidly annotate medical imaging. RIL-Contour supports using fully automated deep-learning methods, semi-automated methods, and manual methods to annotate medical imaging with voxel and/or text annotations. To reduce annotation error, RIL-Contour promotes the standardization of image annotations across a dataset. RIL-Contour accelerates medical imaging annotation through the process of annotation by iterative deep learning (AID). The underlying concept of AID is to iteratively annotate, train, and utilize deep-learning models during the process of dataset annotation and model development. To enable this, RIL-Contour supports workflows in which multiple-image analysts annotate medical images, radiologists approve the annotations, and data scientists utilize these annotations to train deep-learning models. To automate the feedback loop between data scientists and image analysts, RIL-Contour provides mechanisms to enable data scientists to push deep newly trained deep-learning models to other users of the software. RIL-Contour and the AID methodology accelerate dataset annotation and model development by facilitating rapid collaboration between analysts, radiologists, and engineers.",
            "authors": [
                "Philbrick K.A.",
                "Weston A.D.",
                "Akkus Z.",
                "Kline T.L.",
                "Korfiatis P.",
                "Sakinis T.",
                "Kostandy P.",
                "Boonrod A.",
                "Zeinoddini A.",
                "Takahashi N.",
                "Erickson B.J."
            ],
            "cit_count": 0,
            "doi": "10.1007/S10278-019-00232-0",
            "journal": "Journal of Digital Imaging",
            "pmid": "31089974",
            "title": "RIL-Contour: a Medical Imaging Dataset Annotation Tool for and with Deep Learning",
            "type": "Primary",
            "year": "2019-08-15"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:RIL-Contour",
        "biotoolsID": "RIL-Contour",
        "description": "Medical Imaging Dataset Annotation Tool for and with Deep Learning.",
        "homepage": "https://gitlab.com/Philbrick/rilcontour",
        "name": "RIL-Contour"
    }
}