{
    "additionDate": "2021-03-19T08:51:17Z",
    "biotoolsCURIE": "biotools:tsportnet",
    "biotoolsID": "tsportnet",
    "confidence_flag": "tool",
    "description": "Part-Object Relational Visual Saliency.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                },
                {
                    "term": "Relation extraction",
                    "uri": "http://edamontology.org/operation_3625"
                }
            ]
        }
    ],
    "homepage": "https://github.com/liuyi1989/TSPORTNet",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-07-07T10:48:47.850878Z",
    "name": "TSPORTNet",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1109/TPAMI.2021.3053577",
            "metadata": {
                "abstract": "IEEERecent years have witnessed a big leap in automatic visual saliency detection attributed to advances in deep learning, especially Convolutional Neural Networks (CNNs). However, inferring the saliency of each image part separately, as was adopted by most CNNs methods, inevitably leads to an incomplete segmentation of the salient object. In this paper, we describe how to use the property of part-object relations endowed by the Capsule Network (CapsNet) to solve the problems that fundamentally hinge on relational inference for visual saliency detection. Concretely, we put in place a two-stream strategy, termed Two-Stream Part-Object RelaTional Network (TSPORTNet), to implement CapsNet, aiming to reduce both the network complexity and the possible redundancy during capsule routing. Additionally, taking into account the correlations of capsule types from the preceding training images, a correlation-aware capsule routing algorithm is developed for more accurate capsule assignments at the training stage, which also speeds up the training dramatically. By exploring part-object relationships, TSPORTNet produces a capsule wholeness map, which in turn aids multi-level features in generating the final saliency map. Experimental results on five widely-used benchmarks show that our framework consistently achieves state-of-the-art performance. The code can be found on https://github.com/liuyi1989/TSPORTNet.",
                "authors": [
                    {
                        "name": "Liu Y."
                    },
                    {
                        "name": "Zhang D."
                    },
                    {
                        "name": "Zhang Q."
                    },
                    {
                        "name": "Han J."
                    }
                ],
                "citationCount": 1,
                "date": "2021-01-01T00:00:00Z",
                "journal": "IEEE Transactions on Pattern Analysis and Machine Intelligence",
                "title": "Part-Object Relational Visual Saliency"
            },
            "pmid": "33481705"
        }
    ],
    "toolType": [
        "Command-line tool",
        "Library"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        }
    ]
}