
{
    "credit": [
        {
            "email": "realbigws@gmail.com",
            "name": "Support",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "https://github.com/realbigws/DeepBound"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Transcriptional regulatory element prediction",
                    "uri": "http://edamontology.org/operation_0438"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Shell"
        ],
        "operatingSystem": [
            "Linux",
            "Mac"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Machine learning",
                "uri": "http://edamontology.org/topic_3474"
            },
            {
                "term": "Transcription factors and regulatory sites",
                "uri": "http://edamontology.org/topic_0749"
            },
            {
                "term": "RNA-seq",
                "uri": "http://edamontology.org/topic_3170"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© 2017 The Author. Published by Oxford University Press. All rights reserved. Motivation: Reconstructing the full-length expressed transcripts (a.k.a. the transcript assembly problem) from the short sequencing reads produced by RNA-seq protocol plays a central role in identifying novel genes and transcripts as well as in studying gene expressions and gene functions. A crucial step in transcript assembly is to accurately determine the splicing junctions and boundaries of the expressed transcripts from the reads alignment. In contrast to the splicing junctions that can be efficiently detected from spliced reads, the problem of identifying boundaries remains open and challenging, due to the fact that the signal related to boundaries is noisy and weak. Results: We present DeepBound, an effective approach to identify boundaries of expressed transcripts from RNA-seq reads alignment. In its core DeepBound employs deep convolutional neural fields to learn the hidden distributions and patterns of boundaries. To accurately model the transition probabilities and to solve the label-imbalance problem, we novelly incorporate the AUC (area under the curve) score into the optimizing objective function. To address the issue that deep probabilistic graphical models requires large number of labeled training samples, we propose to use simulated RNA-seq datasets to train our model. Through extensive experimental studies on both simulation datasets of two species and biological datasets, we show that DeepBound consistently and significantly outperforms the two existing methods.",
            "authors": [
                "Shao M.",
                "Ma J.",
                "Wang S."
            ],
            "cit_count": 0,
            "doi": "10.1093/bioinformatics/btx267",
            "journal": "Bioinformatics",
            "title": "DeepBound: Accurate identification of transcript boundaries via deep convolutional neural fields",
            "year": "2017-07-15"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:deepbound",
        "biotoolsID": "deepbound",
        "description": "Accurate identification of transcript boundaries via deep convolutional neural fields.",
        "homepage": "https://github.com/realbigws/DeepBound",
        "name": "DeepBound"
    }
}