{
    "accessibility": "Open access",
    "additionDate": "2022-08-17T21:18:16.064898Z",
    "biotoolsCURIE": "biotools:scefsc",
    "biotoolsID": "scefsc",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "lixt314@jlu.edu.cn",
            "name": "Xiangtao Li",
            "typeEntity": "Person"
        },
        {
            "email": "wangyh082@hebut.edu.cn",
            "name": "Yunhe Wang",
            "typeEntity": "Person"
        },
        {
            "name": "Chuang Bian"
        },
        {
            "name": "Ka-chun Wong"
        },
        {
            "name": "Xubin Wang"
        },
        {
            "name": "Yanchi Su"
        }
    ],
    "description": "Accurate single-cell RNA-seq data analysis via ensemble consensus clustering based on multiple feature selections.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "Differential gene expression profiling",
                    "uri": "http://edamontology.org/operation_3223"
                },
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Feature selection",
                    "uri": "http://edamontology.org/operation_3936"
                },
                {
                    "term": "Phasing",
                    "uri": "http://edamontology.org/operation_3454"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Conan-Bian/scEFSC",
    "language": [
        "Python",
        "R"
    ],
    "lastUpdate": "2022-08-17T21:18:16.067580Z",
    "license": "Not licensed",
    "name": "scEFSC",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1016/J.CSBJ.2022.04.023",
            "metadata": {
                "abstract": "© 2022 The Author(s)With the development of next-generation sequencing technologies, single-cell RNA sequencing (scRNA-seq) has become one indispensable tool to reveal the wide heterogeneity between cells. Clustering is a fundamental task in this analysis to disclose the transcriptomic profiles of single cells and is one of the key computational problems that has received widespread attention. Recently, many clustering algorithms have been developed for the scRNA-seq data. Nevertheless, the computational models often suffer from realistic restrictions such as numerical instability, high dimensionality and computational scalability. Moreover, the accumulating cell numbers and high dropout rates bring a huge computational challenge to the analysis. To address these limitations, we first provide a systematic and extensive performance evaluation of four feature selection methods and nine scRNA-seq clustering algorithms on fourteen real single-cell RNA-seq datasets. Based on this, we then propose an accurate single-cell data analysis via Ensemble Feature Selection based Clustering, called scEFSC. Indeed, the algorithm employs several unsupervised feature selections to remove genes that do not contribute significantly to the scRNA-seq data. After that, different single-cell RNA-seq clustering algorithms are proposed to cluster the data filtered by multiple unsupervised feature selections, and then the clustering results are combined using weighted-based meta-clustering. We applied scEFSC to the fourteen real single-cell RNA-seq datasets and the experimental results demonstrated that our proposed scEFSC outperformed the other scRNA-seq clustering algorithms with several evaluation metrics. In addition, we established the biological interpretability of scEFSC by carrying out differential gene expression analysis, gene ontology enrichment and KEGG analysis. scEFSC is available at https://github.com/Conan-Bian/scEFSC.",
                "authors": [
                    {
                        "name": "Bian C."
                    },
                    {
                        "name": "Li X."
                    },
                    {
                        "name": "Su Y."
                    },
                    {
                        "name": "Wang X."
                    },
                    {
                        "name": "Wang Y."
                    },
                    {
                        "name": "Wong K.-C."
                    }
                ],
                "date": "2022-01-01T00:00:00Z",
                "journal": "Computational and Structural Biotechnology Journal",
                "title": "scEFSC: Accurate single-cell RNA-seq data analysis via ensemble consensus clustering based on multiple feature selections"
            },
            "pmcid": "PMC9108753",
            "pmid": "35615016"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Immunoproteins and antigens",
            "uri": "http://edamontology.org/topic_2830"
        },
        {
            "term": "Mathematics",
            "uri": "http://edamontology.org/topic_3315"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ]
}
