{
    "additionDate": "2017-03-24T14:34:06Z",
    "biotoolsCURIE": "biotools:prosmos",
    "biotoolsID": "prosmos",
    "credit": [
        {
            "email": "shuoyong.shi@UTsouthwestern.edu",
            "name": "Shuoyong Shi",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "ProSMoS facilitates protein structure patterns searches. The web program converts 3D structures into an interaction matrix model including such details as the secondary structural element (SSE) type, handedness of connections between SSEs, coordinates of SSE start and ends, etc and then retrieves all structures from a database that contain this pattern.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://prodata.swmed.edu/ProSMoS/help.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein secondary structure comparison",
                    "uri": "http://edamontology.org/operation_2488"
                },
                {
                    "term": "Protein secondary structure assignment",
                    "uri": "http://edamontology.org/operation_0319"
                },
                {
                    "term": "Structural similarity search",
                    "uri": "http://edamontology.org/operation_0360"
                },
                {
                    "term": "Protein structural motif recognition",
                    "uri": "http://edamontology.org/operation_0245"
                },
                {
                    "term": "Protein structure comparison",
                    "uri": "http://edamontology.org/operation_2487"
                }
            ]
        }
    ],
    "homepage": "http://prodata.swmed.edu/ProSMoS/",
    "lastUpdate": "2018-12-10T12:58:56Z",
    "name": "ProSMoS",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "Assessing structural similarity and defining common regions through comparison of protein spatial structures is an important task in functional and evolutionary studies of proteins. There are many servers that compare structures and define sub-structures in common between proteins through superposition and closeness of either coordinates or contacts. However, a natural way to analyze a structure for experts working on structure classification is to look for specific three-dimensional (3D) motifs and patterns instead of finding common features in two proteins. Such motifs can be described by the architecture and topology of major secondary structural elements (SSEs) without consideration of subtle differences in 3D coordinates. Despite the importance of motif-based structure searches, currently there is a shortage of servers to perform this task. Widely known TOPS does not fully address this problem, as it finds only topological match but does not take into account other important spatial properties, such as interactions and chirality. Here, we implemented our approach to protein structure pattern search (ProSMoS) as a web-server. ProSMoS converts 3D structure into an interaction matrix representation including the SSE types, handednesses of connections between SSEs, coordinates of SSE starts and ends, types of interactions between SSEs and β-sheet definitions. For a user-defined structure pattern, ProSMoS lists all structures from a database that contain this pattern. ProSMoS server will be of interest to structural biologists who would like to analyze very general and distant structural similarities. The ProSMoS web server is available at: http://prodata.swmed.edu/ProSMoS/.",
                "authors": [
                    {
                        "name": "Shi S."
                    },
                    {
                        "name": "Chitturi B."
                    },
                    {
                        "name": "Grishin N.V."
                    }
                ],
                "citationCount": 18,
                "date": "2009-08-04T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "ProSMoS server: A pattern-based search using interaction matrix representation of protein structures"
            },
            "pmid": "19420061"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Protein structural motifs and surfaces",
            "uri": "http://edamontology.org/topic_0166"
        },
        {
            "term": "Protein secondary structure",
            "uri": "http://edamontology.org/topic_3542"
        },
        {
            "term": "Protein folds and structural domains",
            "uri": "http://edamontology.org/topic_0736"
        },
        {
            "term": "Protein structure analysis",
            "uri": "http://edamontology.org/topic_2814"
        },
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        }
    ],
    "validated": 1
}