{
    "accessibility": "Open access",
    "additionDate": "2022-08-24T14:48:09.392888Z",
    "biotoolsCURIE": "biotools:gm-pep",
    "biotoolsID": "gm-pep",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Qushuo Chen"
        },
        {
            "name": "Wenjin Yan"
        }
    ],
    "description": "GM-Pep is an integrated approach contained two parts, one is multi-class generator (CVAE model) which was responsibility for generating potential drug-like peptides, the other is multi-classifier (Deep-Multiclassifier) which predicted bioactivity probability of generated peptides by CVAE model.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "de Novo sequencing",
                    "uri": "http://edamontology.org/operation_3644"
                }
            ]
        }
    ],
    "homepage": "https://github.com/TimothyChen225/GM-Pep",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-08-24T14:48:09.395373Z",
    "license": "MIT",
    "name": "GM-Pep",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1021/ACS.JCIM.2C00089",
            "metadata": {
                "abstract": "© 2022 American Chemical Society.Although peptides are regarded as ideal therapeutic agents, only a small proportion of the marketed drugs are peptides. In the past decade, pharmacists have paid great attention to the development of peptide therapeutics. Except a few approved chemically/rationally designed peptides, most attempts failed due to unsatisfactory efficacy or safety. Luckily, computation methods, such as artificial intelligence, have been utilized to accelerate the discovery of therapeutic peptides by predicting the activity, toxicity, and absorption, distribution, metabolism, and excretion of polypeptides. Usually, a specific biological activity of a peptide could be accurately determined by an interest-oriented binary classification constructed of a positive set and another un-experimentally validated negative set regardless of other characteristics, which suggests that it could be challenging to realize the comprehensive evaluation of the research object in the early stage of drug research and development. Herein, we proposed an integrated method (GM-Pep) that contained a conditional variational autoencoder model (CVAE) and a positive sample training multiclassifier (Deep-Multiclassifier) to effectively generate a single bioactive peptide sequence without toxicity and referential side effects. The results showed that our Deep-Multiclassifier model gave a sequence accuracy of up to 96.41% [toxicity (94.48%), antifungal (96.58%), antihypertensive (97.18%), and antibacterial (96.91%), respectively]. The properties of Deep-Multiclassifier and CVAE were validated through 12 first synthesized antibacterial peptides or compared to random peptides. The source code and data sets are available at https://github.com/TimothyChen225/GM-Pep.",
                "authors": [
                    {
                        "name": "Chen Q."
                    },
                    {
                        "name": "Huang J."
                    },
                    {
                        "name": "Li X."
                    },
                    {
                        "name": "Wang K."
                    },
                    {
                        "name": "Wang Y."
                    },
                    {
                        "name": "Xie Y."
                    },
                    {
                        "name": "Yan W."
                    },
                    {
                        "name": "Yang C."
                    }
                ],
                "citationCount": 1,
                "date": "2022-01-01T00:00:00Z",
                "journal": "Journal of Chemical Information and Modeling",
                "title": "GM-Pep: A High Efficiency Strategy to de Novo Design Functional Peptide Sequences"
            },
            "pmid": "35533298"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ]
}
