
{
    "credit": [
        {
            "email": "dominique.tessier@nantes.inra.fr",
            "name": "Dominique Tessier",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://wwwappli.nantes.inra.fr:8180/OVNIp/"
        },
        {
            "email": "tessier@nantes.inra.fr",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "url": "http://wwwappli.nantes.inra.fr:8180/OVNIp/Documentation/UsersGuide.pdf"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Analysis",
                    "uri": "http://edamontology.org/operation_2945"
                }
            ]
        }
    ],
    "labels": {
        "collectionID": [
            "Proteomics"
        ],
        "language": [
            "Java"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Desktop application"
        ],
        "topic": [
            {
                "term": "Proteomics",
                "uri": "http://edamontology.org/topic_0121"
            },
            {
                "term": "Proteomics experiment",
                "uri": "http://edamontology.org/topic_3520"
            },
            {
                "term": "Sequencing",
                "uri": "http://edamontology.org/topic_3168"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://www.mybiosoftware.com/ovnip-1-4-facilitate-analysis-mass-spectrometry-data.html"
        }
    ],
    "publication": [
        {
            "abstract": "Several academic software are available to help the validation and reporting of proteomics data generated by MS analyses. However, to our knowledge, none of them have been conceived to meet the particular needs generated by the study of organisms whose genomes are not sequenced. In that context, we have developed OVNIp, an open-source application which facilitates the whole process of proteomics results interpretation. One of its unique attributes is its capacity to compile multiple results (from several search engines and/or several databank searches) with a resolution of conflicting interpretations. Moreover, OVNIp enables automated exploitation of de novo sequences generated from unassigned MS/MS spectra leading to higher sequence coverage and enhancing confidence in the identified proteins. The exploitation of these additional spectra might also identify novel proteins through a MS-BLAST search, which can be easily ran from the OVNIp interface. Beyond this primary scope, OVNIp can also benefit to users who look for a simple standalone application to both visualize and confirm MS/MS result interpretations through a simple graphical interface and generate reports according to user-defined forms which may integrate the prerequisites for publication. Sources, documentation and a stable release for Windows are available at http://wwwappli.nantes.inra.fr:8180/OVNIp.",
            "authors": [
                "Tessier D.",
                "Yclon P.",
                "Jacquemin I.",
                "Larre C.",
                "Rogniaux H."
            ],
            "cit_count": 6,
            "journal": "Proteomics",
            "pmid": "20198638",
            "title": "OVNIp: an open source application facilitating the interpretation, the validation and the edition of proteomics data generated by MS analyses and de novo sequencing.",
            "year": "2010-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:ovnip",
        "biotoolsID": "ovnip",
        "description": "Application designed to facilitate the analysis of data obtained by mass spectrometry in proteomic approaches. Indeed, it assists the experts in their analysis.",
        "homepage": "http://wwwappli.nantes.inra.fr:8180/OVNIp/",
        "name": "OVNIp"
    }
}