{
    "additionDate": "2020-01-09T18:35:24Z",
    "biotoolsCURIE": "biotools:spatio-temporal",
    "biotoolsID": "spatio-temporal",
    "confidence_flag": "tool",
    "description": "This is a tool for navigating through the r packages for movement. It handles and analyses Spatio- Temporal Data. \nHandling and Analyzing Spatio-Temporal Data.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                },
                {
                    "term": "Anonymisation",
                    "uri": "http://edamontology.org/operation_3283"
                },
                {
                    "term": "Imputation",
                    "uri": "http://edamontology.org/operation_3557"
                },
                {
                    "term": "Simulation analysis",
                    "uri": "http://edamontology.org/operation_0244"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://cran.r-project.org/web/views/SpatioTemporal.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-01-16T14:15:29Z",
    "name": "spatio-temporal",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1111/1365-2656.13116",
            "metadata": {
                "abstract": "© 2019 The Authors. Journal of Animal Ecology © 2019 British Ecological SocietyThe advent of miniaturized biologging devices has provided ecologists with unprecedented opportunities to record animal movement across scales, and led to the collection of ever-increasing quantities of tracking data. In parallel, sophisticated tools have been developed to process, visualize and analyse tracking data; however, many of these tools have proliferated in isolation, making it challenging for users to select the most appropriate method for the question in hand. Indeed, within the r software alone, we listed 58 packages created to deal with tracking data or ‘tracking packages’. Here, we reviewed and described each tracking package based on a workflow centred around tracking data (i.e. spatio-temporal locations (x, y, t)), broken down into three stages: pre-processing, post-processing and analysis, the latter consisting of data visualization, track description, path reconstruction, behavioural pattern identification, space use characterization, trajectory simulation and others. Supporting documentation is key to render a package accessible for users. Based on a user survey, we reviewed the quality of packages' documentation and identified 11 packages with good or excellent documentation. Links between packages were assessed through a network graph analysis. Although a large group of packages showed some degree of connectivity (either depending on functions or suggesting the use of another tracking package), one third of the packages worked in isolation, reflecting a fragmentation in the r movement-ecology programming community. Finally, we provide recommendations for users when choosing packages, and for developers to maximize the usefulness of their contribution and strengthen the links within the programming community.",
                "authors": [
                    {
                        "name": "Basille M."
                    },
                    {
                        "name": "Boone M.E."
                    },
                    {
                        "name": "Clay T.A."
                    },
                    {
                        "name": "Clusella-Trullas S."
                    },
                    {
                        "name": "Joo R."
                    },
                    {
                        "name": "Patrick S.C."
                    }
                ],
                "citationCount": 17,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Journal of Animal Ecology",
                "title": "Navigating through the r packages for movement"
            },
            "pmid": "31587257"
        }
    ],
    "topic": [
        {
            "term": "Ecology",
            "uri": "http://edamontology.org/topic_0610"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Sequence sites, features and motifs",
            "uri": "http://edamontology.org/topic_0160"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ],
    "validated": 1
}
