{
    "additionDate": "2018-05-19T16:03:38Z",
    "biotoolsCURIE": "biotools:mirnatip",
    "biotoolsID": "mirnatip",
    "credit": [
        {
            "email": "fiannaca@pa.icar.cnr.it",
            "name": "Antonino Fiannaca",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "A SOM-based miRNA-target interactions predictor.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "microRNA detection",
                    "uri": "http://edamontology.org/operation_0463"
                }
            ]
        }
    ],
    "homepage": "http://tblab.pa.icar.cnr.it/public/miRNATIP/",
    "lastUpdate": "2018-12-10T12:58:58Z",
    "name": "MiRNATIP",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "migle_sur",
    "publication": [
        {
            "doi": "10.1186/S12859-016-1171-X",
            "metadata": {
                "abstract": "© 2016 The Author(s).Background: MicroRNAs (miRNAs) are small non-coding RNA sequences with regulatory functions to post-transcriptional level for several biological processes, such as cell disease progression and metastasis. MiRNAs interact with target messenger RNA (mRNA) genes by base pairing. Experimental identification of miRNA target is one of the major challenges in cancer biology because miRNAs can act as tumour suppressors or oncogenes by targeting different type of targets. The use of machine learning methods for the prediction of the target genes is considered a valid support to investigate miRNA functions and to guide related wet-lab experiments. In this paper we propose the miRNA Target Interaction Predictor (miRNATIP) algorithm, a Self-Organizing Map (SOM) based method for the miRNA target prediction. SOM is trained with the seed region of the miRNA sequences and then the mRNA sequences are projected into the SOM lattice in order to find putative interactions with miRNAs. These interactions will be filtered considering the remaining part of the miRNA sequences and estimating the free-energy necessary for duplex stability. Results: We tested the proposed method by predicting the miRNA target interactions of both the Homo sapiens and the Caenorhbditis elegans species; then, taking into account validated target (positive) and non-target (negative) interactions, we compared our results with other target predictors, namely miRanda, PITA, PicTar, mirSOM, TargetScan and DIANA-microT, in terms of the most used statistical measures. We demonstrate that our method produces the greatest number of predictions with respect to the other ones, exhibiting good results for both species, reaching the for example the highest percentage of sensitivity of 31 and 30.5 %, respectively for Homo sapiens and for C. elegans. All the predicted interaction are freely available at the following url: http://tblab.pa.icar.cnr.it/public/miRNATIP/. Conclusions: Results state miRNATIP outperforms or is comparable to the other six state-of-the-art methods, in terms of validated target and non-target interactions, respectively.",
                "authors": [
                    {
                        "name": "Fiannaca A."
                    },
                    {
                        "name": "La Paglia L."
                    },
                    {
                        "name": "La Rosa M."
                    },
                    {
                        "name": "Rizzo R."
                    },
                    {
                        "name": "Urso A."
                    }
                ],
                "citationCount": 8,
                "date": "2016-09-22T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "MiRNATIP: A SOM-based miRNA-target interactions predictor"
            },
            "pmcid": "PMC5046196",
            "pmid": "28185545"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ],
    "validated": 1
}
