{
    "additionDate": "2017-09-19T13:28:10Z",
    "biotoolsCURIE": "biotools:proteosign",
    "biotoolsID": "proteosign",
    "collectionID": [
        "Proteomics"
    ],
    "credit": [
        {
            "email": "iliopj@med.uoc.gr",
            "name": "IOANNIS ILIOPOULOS",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://bioinformatics.med.uoc.gr/ProteoSign/"
        }
    ],
    "description": "Protein differential expression analysis designed with the end-proteomics user in mind.\nIt aims to fully automate the process of statistically evaluating differential expression in mass spectrometry-based bottom-up (shotgun) quantitative proteomics data by requiring minimal user interaction time and generating publication-quality data plots.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://bioinformatics.med.uoc.gr/ProteoSign/help.html"
        }
    ],
    "editPermission": {
        "authors": [
            "proteomics.bio.tools"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Labeled quantification",
                    "uri": "http://edamontology.org/operation_3635"
                }
            ]
        }
    ],
    "homepage": "http://bioinformatics.med.uoc.gr/ProteoSign/",
    "language": [
        "JavaScript",
        "PHP",
        "R"
    ],
    "lastUpdate": "2019-03-26T08:35:20Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/yorgodillo/ProteoSign"
        }
    ],
    "name": "Proteosign",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "Iliopoulos",
    "publication": [
        {
            "doi": "10.1093/nar/gkx444",
            "metadata": {
                "abstract": "© 2017 The Author(s).Profiling of proteome dynamics is crucial for understanding cellular behavior in response to intrinsic and extrinsic stimuli and maintenance of homeostasis. Over the last 20 years, mass spectrometry (MS) has emerged as the most powerful tool for large-scale identification and characterization of proteins. Bottom-up proteomics, the most common MS-based proteomics approach, has always been challenging in terms of data management, processing, analysis and visualization, with modern instruments capable of producing several gigabytes of data out of a single experiment. Here, we present ProteoSign, a freely available web application, dedicated in allowing users to perform proteomics differential expression/abundance analysis in a userfriendly and self-explanatory way. Although several non-commercial standalone tools have been developed for post-quantification statistical analysis of proteomics data, most of them are not end-user appealing as they often require very stringent installation of programming environments, third-party software packages and sometimes further scripting or computer programming. To avoid this bottleneck, we have developed a user-friendly software platform accessible via a web interface in order to enable proteomics laboratories and core facilities to statistically analyse quantitative proteomics data sets in a resource-efficient manner.",
                "authors": [
                    {
                        "name": "Efstathiou G."
                    },
                    {
                        "name": "Antonakis A.N."
                    },
                    {
                        "name": "Pavlopoulos G.A."
                    },
                    {
                        "name": "Theodosiou T."
                    },
                    {
                        "name": "Divanach P."
                    },
                    {
                        "name": "Trudgian D.C."
                    },
                    {
                        "name": "Thomas B."
                    },
                    {
                        "name": "Papanikolaou N."
                    },
                    {
                        "name": "Aivaliotis M."
                    },
                    {
                        "name": "Acuto O."
                    },
                    {
                        "name": "Iliopoulos I."
                    }
                ],
                "citationCount": 19,
                "date": "2017-07-03T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "ProteoSign: An end-user online differential proteomics statistical analysis platform"
            },
            "pmid": "28520987"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        }
    ],
    "validated": 1
}