{
    "accessibility": "Open access",
    "additionDate": "2019-06-21T08:31:13Z",
    "biotoolsCURIE": "biotools:RPITER",
    "biotoolsID": "RPITER",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "chengpengeace@gmail.com",
            "name": "C. Peng",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Hierarchical deep learning model for predicting ncRNA-protein interaction.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/Pengeace/RPITER/blob/master/README.md"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "RNA secondary structure prediction",
                    "uri": "http://edamontology.org/operation_0278"
                },
                {
                    "term": "Protein secondary structure prediction",
                    "uri": "http://edamontology.org/operation_0267"
                },
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Pengeace/RPITER",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-06-16T10:55:23Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/Pengeace/RPITER/issues"
        }
    ],
    "maturity": "Mature",
    "name": "RPITER",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "Ruta",
    "publication": [
        {
            "doi": "10.3390/ijms20051070",
            "metadata": {
                "abstract": "© 2019 by the authors. Licensee MDPI, Basel, Switzerland.Non-coding RNAs (ncRNAs) play crucial roles in multiple fundamental biological processes, such as post-transcriptional gene regulation, and are implicated in many complex human diseases. Mostly ncRNAs function by interacting with corresponding RNA-binding proteins. The research on ncRNA–protein interaction is the key to understanding the function of ncRNA. However, the biological experiment techniques for identifying RNA–protein interactions (RPIs) are currently still expensive and time-consuming. Due to the complex molecular mechanism of ncRNA–protein interaction and the lack of conservation for ncRNA, especially for long ncRNA (lncRNA), the prediction of ncRNA–protein interaction is still a challenge. Deep learning-based models have become the state-of-the-art in a range of biological sequence analysis problems due to their strong power of feature learning. In this study, we proposed a hierarchical deep learning framework RPITER to predict RNA–protein interaction. For sequence coding, we improved the conjoint triad feature (CTF) coding method by complementing more primary sequence information and adding sequence structure information. For model design, RPITER employed two basic neural network architectures of convolution neural network (CNN) and stacked auto-encoder (SAE). Comprehensive experiments were performed on five benchmark datasets from PDB and NPInter databases to analyze and compare the performances of different sequence coding methods and prediction models. We found that CNN and SAE deep learning architectures have powerful fitting abilities for the k-mer features of RNA and protein sequence. The improved CTF coding method showed performance gain compared with the original CTF method. Moreover, our designed RPITER performed well in predicting RNA–protein interaction (RPI) and could outperform most of the previous methods. On five widely used RPI datasets, RPI369, RPI488, RPI1807, RPI2241 and NPInter, RPITER obtained AUC of 0.821, 0.911, 0.990, 0.957 and 0.985, respectively. The proposed RPITER could be a complementary method for predicting RPI and constructing RPI network, which would help push forward the related biological research on ncRNAs and lncRNAs.",
                "authors": [
                    {
                        "name": "Peng C."
                    },
                    {
                        "name": "Han S."
                    },
                    {
                        "name": "Zhang H."
                    },
                    {
                        "name": "Li Y."
                    }
                ],
                "citationCount": 10,
                "date": "2019-03-01T00:00:00Z",
                "journal": "International Journal of Molecular Sciences",
                "title": "Rpiter: A hierarchical deep learning framework for ncRNA-protein interaction prediction"
            },
            "pmcid": "PMC6429152",
            "pmid": "30832218",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Structure prediction",
            "uri": "http://edamontology.org/topic_0082"
        }
    ],
    "validated": 1
}