{
    "additionDate": "2017-08-03T18:58:13Z",
    "biotoolsCURIE": "biotools:rpmcmc",
    "biotoolsID": "rpmcmc",
    "credit": [
        {
            "email": "ikebata.hisaki@ism.ac.jp",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://daweb.ism.ac.jp/yoshidalab/index_e.html"
        }
    ],
    "description": "A parallel MCMC algorithm for discovering diverse motifs from large sequence sets.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://daweb.ism.ac.jp/yoshidalab/motif/README.txt"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence motif discovery",
                    "uri": "http://edamontology.org/operation_0238"
                }
            ]
        }
    ],
    "homepage": "http://daweb.ism.ac.jp/yoshidalab/motif/",
    "lastUpdate": "2018-12-10T12:58:45Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/rpmcmc-0-2-repulsive-parallel-mcmc-algorithm.html"
        }
    ],
    "name": "RPMCMC",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "© The Author 2015. Published by Oxford University Press.Motivation: The motif discovery problem consists of finding recurring patterns of short strings in a set of nucleotide sequences. This classical problem is receiving renewed attention as most early motif discovery methods lack the ability to handle large data of recent genome-wide ChIP studies. New ChIP-tailored methods focus on reducing computation time and pay little regard to the accuracy of motif detection. Unlike such methods, our method focuses on increasing the detection accuracy while maintaining the computation efficiency at an acceptable level. The major advantage of our method is that it can mine diverse multiple motifs undetectable by current methods. Results: The repulsive parallel Markov chain Monte Carlo (RPMCMC) algorithm that we propose is a parallel version of the widely used Gibbs motif sampler. RPMCMC is run on parallel interacting motif samplers. A repulsive force is generated when different motifs produced by different samplers near each other. Thus, different samplers explore different motifs. In this way, we can detect much more diverse motifs than conventional methods can. Through application to 228 transcription factor ChIP-seq datasets of the ENCODE project, we show that the RPMCMC algorithm can find many reliable cofactor interacting motifs that existing methods are unable to discover.",
                "authors": [
                    {
                        "name": "Ikebata H."
                    },
                    {
                        "name": "Yoshida R."
                    }
                ],
                "citationCount": 10,
                "date": "2015-05-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Repulsive parallel MCMC algorithm for discovering diverse motifs from large sequence sets"
            },
            "pmid": "25583120"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Nucleic acid sites, features and motifs",
            "uri": "http://edamontology.org/topic_3511"
        }
    ],
    "validated": 1
}