{
    "additionDate": "2021-01-18T11:31:50Z",
    "biotoolsCURIE": "biotools:eqscore",
    "biotoolsID": "eqscore",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "dgareau@rockefeller.edu",
            "name": "Daniel Gareau",
            "typeEntity": "Person"
        }
    ],
    "description": "EQscore is a computer‐assisted image‐processing algorithm to reliably quantify erythema (across a range of skin types) in the dermatology clinical setting.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "http://lab.rockefeller.edu/krueger/EQScore",
    "lastUpdate": "2024-11-24T20:40:09.954619Z",
    "name": "EQscore",
    "operatingSystem": [
        "Mac",
        "Windows"
    ],
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1111/exd.14224",
            "metadata": {
                "abstract": "Physician rating of cutaneous erythema is central to clinical dermatological assessment as well as quantification of outcome measures in clinical trials in a number of dermatologic conditions. However, issues with inter-rater reliability and variability in the setting of higher Fitzpatrick skin types make visual erythema assessment unreliable. We developed and validated a computer-assisted image-processing algorithm (EQscore) to reliably quantify erythema (across a range of skin types) in the dermatology clinical setting. Our image processing algorithm evaluated erythema based upon green light suppression differentials between affected and unaffected skin. A group of four dermatologists used a 4-point Likert scale as a human evaluation of similar erythematous patch tests. The algorithm and dermatologist scores were compared across 164 positive patch test reactions. The intra-class correlation coefficient of groups and the correlation coefficient between groups were calculated. The EQscore was validated on and independent image set of psoriasis, minimal erythema dose testing and steroid-induced blanching images. The reliability of the erythema quantification method produced an intra-class correlation coefficient of 0.84 for the algorithm and 0.67 for dermatologists. The correlation coefficient between groups was 0.85. The EQscore demonstrated high agreement with clinical scoring and superior reliability compared with clinical scoring, avoiding the pitfalls of erythema underrating in the setting of pigmentation. The EQscore is easily accessible (http://lab.rockefeller.edu/krueger/EQscore), user-friendly, and may allow dermatologists to more readily and accurately rate the severity of dermatological conditions and the response to therapeutic treatments.",
                "authors": [
                    {
                        "name": "Bottomley C."
                    },
                    {
                        "name": "Brunner P.M."
                    },
                    {
                        "name": "Cueto I."
                    },
                    {
                        "name": "Czarnowicki T."
                    },
                    {
                        "name": "Finney R."
                    },
                    {
                        "name": "Frew J."
                    },
                    {
                        "name": "Fuentes-Duculan J."
                    },
                    {
                        "name": "Garcet S."
                    },
                    {
                        "name": "Gareau D."
                    },
                    {
                        "name": "Guttman-Yassky E."
                    },
                    {
                        "name": "Kim J."
                    },
                    {
                        "name": "Krueger J.G."
                    },
                    {
                        "name": "Lentini T."
                    },
                    {
                        "name": "Ohmatsu H."
                    },
                    {
                        "name": "Penzi L."
                    },
                    {
                        "name": "Suarez-Farinas M."
                    },
                    {
                        "name": "Yanofsky V."
                    }
                ],
                "citationCount": 9,
                "date": "2021-03-01T00:00:00Z",
                "journal": "Experimental Dermatology",
                "title": "The erythema Q-score, an imaging biomarker for redness in skin inflammation"
            },
            "pmcid": "PMC8049083",
            "pmid": "33113259"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Dermatology",
            "uri": "http://edamontology.org/topic_3404"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Preclinical and clinical studies",
            "uri": "http://edamontology.org/topic_3379"
        }
    ]
}
