{
    "additionDate": "2021-01-18T08:57:18Z",
    "biotoolsCURIE": "biotools:iris3",
    "biotoolsID": "iris3",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "ma.1915@osu.edu",
            "name": "Qin Ma",
            "orcidid": "https://orcid.org/0000-0002-3264-8392",
            "typeEntity": "Person"
        }
    ],
    "description": "Integrated cell-type-specific regulon inference server from single-cell RNA-Seq.\n\nThe underlying regulatory mechanisms that induce the identity of cell types or physiological states are normally uncovered in the single-cell RNA-Sequencing (scRNA-Seq) analyses.\n\nHere we propose IRIS3 (Integrated Cell-type-specific Regulon Inference Server from Single-cell RNA-Seq) as the first-of-its-kind web server for CTS-R inference in human and mouse.\n\nintegrated cell type specific Regulon inference from single-cell rna seq.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Gene regulatory network analysis",
                    "uri": "http://edamontology.org/operation_1781"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://bmbl.bmi.osumc.edu/iris3/",
    "language": [
        "JavaScript"
    ],
    "lastUpdate": "2021-02-11T10:03:47Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/OSU-BMBL/IRIS3"
        }
    ],
    "name": "IRIS3",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1093/NAR/GKAA394",
            "metadata": {
                "abstract": "© The Author(s) 2020. Published by Oxford University Press on behalf of Nucleic Acids Research.A group of genes controlled as a unit, usually by the same repressor or activator gene, is known as a regulon. The ability to identify active regulons within a specific cell type, i.e., cell-type-specific regulons (CTSR), provides an extraordinary opportunity to pinpoint crucial regulators and target genes responsible for complex diseases. However, the identification of CTSRs from single-cell RNA-Seq (scRNA-Seq) data is computationally challenging. We introduce IRIS3, the first-of-its-kind web server for CTSR inference from scRNA-Seq data for human and mouse. IRIS3 is an easy-to-use server empowered by over 20 functionalities to support comprehensive interpretations and graphical visualizations of identified CTSRs. CTSR data can be used to reliably characterize and distinguish the corresponding cell type from others and can be combined with other computational or experimental analyses for biomedical studies. CTSRs can, therefore, aid in the discovery of major regulatory mechanisms and allow reliable constructions of global transcriptional regulation networks encoded in a specific cell type. The broader impact of IRIS3 includes, but is not limited to, investigation of complex diseases hierarchies and heterogeneity, causal gene regulatory network construction, and drug development. IRIS3 is freely accessible from https://bmbl.bmi.osumc.edu/iris3/ with no login requirement.",
                "authors": [
                    {
                        "name": "Ma A."
                    },
                    {
                        "name": "Wang C."
                    },
                    {
                        "name": "Chang Y."
                    },
                    {
                        "name": "Brennan F.H."
                    },
                    {
                        "name": "McDermaid A."
                    },
                    {
                        "name": "Liu B."
                    },
                    {
                        "name": "Zhang C."
                    },
                    {
                        "name": "Popovich P.G."
                    },
                    {
                        "name": "Ma Q."
                    }
                ],
                "citationCount": 7,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "IRIS3: Integrated cell-type-specific regulon inference server from single-cell RNA-Seq"
            },
            "pmcid": "PMC7319566",
            "pmid": "32421805"
        }
    ],
    "toolType": [
        "Web service"
    ],
    "topic": [
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        },
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ]
}