{
    "accessibility": "Open access",
    "additionDate": "2023-04-26T21:55:49.537157Z",
    "biotoolsCURIE": "biotools:sno",
    "biotoolsID": "sno",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "elenap@cancer.dk",
            "name": "Elena Papaleo",
            "typeEntity": "Person"
        },
        {
            "name": "Matteo Lambrughi"
        },
        {
            "name": "Giuseppe Filomeni",
            "orcidid": "http://orcid.org/0000-0002-2719-1412"
        },
        {
            "name": "Matteo Tiberti",
            "orcidid": "http://orcid.org/0000-0003-2529-3594",
            "typeEntity": "Person"
        }
    ],
    "description": "Three pipelines for the structural investigation of different aspects when investigating S-nitrosylation (SNO) sites. Designed with the purpose of identifying and characterizing proximal Cysteine residues proximal to SNO sites.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Cysteine bridge detection",
                    "uri": "http://edamontology.org/operation_1829"
                },
                {
                    "term": "Disulfide bond prediction",
                    "uri": "http://edamontology.org/operation_0471"
                },
                {
                    "term": "Molecular dynamics",
                    "uri": "http://edamontology.org/operation_2476"
                },
                {
                    "term": "PTM site prediction",
                    "uri": "http://edamontology.org/operation_0417"
                }
            ]
        }
    ],
    "homepage": "https://github.com/ELELAB/SNO_investigation_pipelines",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T14:49:07.149265Z",
    "license": "Not licensed",
    "name": "SNO",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1038/s41419-023-05780-6",
            "metadata": {
                "abstract": "S-nitrosylation is a post-translational modification in which nitric oxide (NO) binds to the thiol group of cysteine, generating an S-nitrosothiol (SNO) adduct. S-nitrosylation has different physiological roles, and its alteration has also been linked to a growing list of pathologies, including cancer. SNO can affect the function and stability of different proteins, such as the mitochondrial chaperone TRAP1. Interestingly, the SNO site (C501) of TRAP1 is in the proximity of another cysteine (C527). This feature suggests that the S-nitrosylated C501 could engage in a disulfide bridge with C527 in TRAP1, resembling the well-known ability of S-nitrosylated cysteines to resolve in disulfide bridge with vicinal cysteines. We used enhanced sampling simulations and in-vitro biochemical assays to address the structural mechanisms induced by TRAP1 S-nitrosylation. We showed that the SNO site induces conformational changes in the proximal cysteine and favors conformations suitable for disulfide bridge formation. We explored 4172 known S-nitrosylated proteins using high-throughput structural analyses. Furthermore, we used a coarse-grained model for 44 protein targets to account for protein flexibility. This resulted in the identification of up to 1248 proximal cysteines, which could sense the redox state of the SNO site, opening new perspectives on the biological effects of redox switches. In addition, we devised two bioinformatic workflows (https://github.com/ELELAB/SNO_investigation_pipelines) to identify proximal or vicinal cysteines for a SNO site with accompanying structural annotations. Finally, we analyzed mutations in tumor suppressors or oncogenes in connection with the conformational switch induced by S-nitrosylation. We classified the variants as neutral, stabilizing, or destabilizing for the propensity to be S-nitrosylated and undergo the population-shift mechanism. The methods applied here provide a comprehensive toolkit for future high-throughput studies of new protein candidates, variant classification, and a rich data source for the research community in the NO field.",
                "authors": [
                    {
                        "name": "Arnaudi M."
                    },
                    {
                        "name": "Battistoni A."
                    },
                    {
                        "name": "Cantwell L."
                    },
                    {
                        "name": "Degn K."
                    },
                    {
                        "name": "Faienza F."
                    },
                    {
                        "name": "Filomeni G."
                    },
                    {
                        "name": "Lambrughi M."
                    },
                    {
                        "name": "Pacello F."
                    },
                    {
                        "name": "Papaleo E."
                    },
                    {
                        "name": "Pecorari C."
                    },
                    {
                        "name": "Tiberti M."
                    }
                ],
                "citationCount": 4,
                "date": "2023-04-01T00:00:00Z",
                "journal": "Cell Death and Disease",
                "title": "TRAP1 S-nitrosylation as a model of population-shift mechanism to study the effects of nitric oxide on redox-sensitive oncoproteins"
            },
            "pmcid": "PMC10121659",
            "pmid": "37085483"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Molecular dynamics",
            "uri": "http://edamontology.org/topic_0176"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Protein modifications",
            "uri": "http://edamontology.org/topic_0601"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ]
}
