{
    "additionDate": "2017-08-03T18:57:32Z",
    "biotoolsCURIE": "biotools:rcare",
    "biotoolsID": "rcare",
    "credit": [
        {
            "email": "soo7027@snu.ac.kr",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.snubi.org/"
        }
    ],
    "description": "RCARE searches, annotates and visualizes RNA editing sites using thousands of previously known editing sites.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://www.snubi.org/software/rcare/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Editing",
                    "uri": "http://edamontology.org/operation_3096"
                }
            ]
        }
    ],
    "homepage": "http://www.snubi.org/software/rcare/",
    "lastUpdate": "2019-02-28T10:49:35Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/rcare-rna-seq-comparison-and-annotation-of-rna-editing.html"
        }
    ],
    "name": "RCARE",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "© 2015 Lee et al.; licensee BioMed Central Ltd.The post-transcriptional sequence modification of transcripts through RNA editing is an important mechanism for regulating protein function and is associated with human disease phenotypes. The identification of RNA editing or RNA-DNA difference (RDD) sites is a fundamental step in the study of RNA editing. However, a substantial number of false-positive RDD sites have been identified recently. A major challenge in identifying RDD sites is to distinguish between the true RNA editing sites and the false positives. Furthermore, determining the location of condition-specific RDD sites and elucidating their functional roles will help toward understanding various biological phenomena that are mediated by RNA editing. The present study developed RNA-sequence comparison and annotation for RNA editing (RCARE) for searching, annotating, and visualizing RDD sites using thousands of previously known editing sites, which can be used for comparative analyses between multiple samples. RCARE also provides evidence for improving the reliability of identified RDD sites. RCARE is a web-based comparison, annotation, and visualization tool, which provides rich biological annotations and useful summary plots. The developers of previous tools that identify or annotate RNA-editing sites seldom mention the reliability of their respective tools. In order to address the issue, RCARE utilizes a number of scientific publications and databases to find specific documentations respective to a particular RNA-editing site, which generates evidence levels to convey the reliability of RCARE. Sequence-based alignment files can be converted into VCF files using a Python script and uploaded to the RCARE server for further analysis. RCARE is available for free at http://www.snubi.org/software/rcare/.",
                "authors": [
                    {
                        "name": "Lee S.Y."
                    },
                    {
                        "name": "Joung J.-G."
                    },
                    {
                        "name": "Park C.H."
                    },
                    {
                        "name": "Park J.H."
                    },
                    {
                        "name": "Kim J.H."
                    }
                ],
                "citationCount": 13,
                "date": "2015-05-29T00:00:00Z",
                "journal": "BMC Medical Genomics",
                "title": "RCARE: RNA Sequence Comparison and Annotation for RNA Editing"
            },
            "pmid": "26043858"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "RNA-seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        },
        {
            "term": "Computational biology",
            "uri": "http://edamontology.org/topic_3307"
        }
    ],
    "validated": 1
}