{
    "accessibility": "Open access",
    "additionDate": "2022-06-08T13:00:21.047816Z",
    "biotoolsCURIE": "biotools:vision_permutator",
    "biotoolsID": "vision_permutator",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Li Yuan"
        },
        {
            "name": "Qibin Hou"
        },
        {
            "name": "Zihang Jiang"
        }
    ],
    "description": "A Permutable MLP-Like Architecture for Visual Recognition.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                },
                {
                    "term": "Protein architecture recognition",
                    "uri": "http://edamontology.org/operation_2475"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Andrew-Qibin/VisionPermutator",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-06-08T13:00:21.050380Z",
    "license": "MIT",
    "name": "Vision Permutator",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1109/TPAMI.2022.3145427",
            "metadata": {
                "abstract": "IEEEIn this paper, we present Vision Permutator, a conceptually simple and data efficient MLP-like architecture for visual recognition. By realizing the importance of the positional information carried by 2D feature representations, unlike recent MLP-like models that encode the spatial information along the flattened spatial dimensions, Vision Permutator separately encodes the feature representations along the height and width dimensions with linear projections. This allows Vision Permutator to capture long-range dependencies and meanwhile avoid the attention building process in transformers. The outputs are then aggregated to form expressive representations. We show that our Vision Permutators are formidable competitors to convolutional neural networks (CNNs) and vision transformers. Without the dependence on spatial convolutions or attention mechanisms, Vision Permutator achieves 81.5% top-1 accuracy on ImageNet without extra large-scale training data (e.g., ImageNet-22k) using only 25M learnable parameters, which is much better than most CNNs and vision transformers under the same model size constraint. When scaling up to 88M, it attains 83.2% top-1 accuracy, greatly improving the performance of recent state-of-the-art MLP-like networks for visual recognition. We hope this work could encourage research on rethinking the way of encoding spatial information and facilitate the development of MLP-like models. Code is available at https://github.com/Andrew-Qibin/VisionPermutator.",
                "authors": [
                    {
                        "name": "Cheng M."
                    },
                    {
                        "name": "Feng J."
                    },
                    {
                        "name": "Hou Q."
                    },
                    {
                        "name": "Jiang Z."
                    },
                    {
                        "name": "Yan S."
                    },
                    {
                        "name": "Yuan L."
                    }
                ],
                "date": "2022-01-01T00:00:00Z",
                "journal": "IEEE Transactions on Pattern Analysis and Machine Intelligence",
                "title": "Vision Permutator: A Permutable MLP-Like Architecture for Visual Recognition"
            },
            "pmid": "35077359"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        }
    ]
}
