{
    "additionDate": "2021-01-18T08:15:57Z",
    "biotoolsCURIE": "biotools:sg-lstm",
    "biotoolsID": "sg-lstm",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "luojiawei@hnu.edu.cn",
            "name": "Jiawei Luo",
            "typeEntity": "Person"
        }
    ],
    "description": "a computational frame using sequence and geometrical information via LSTM to predict miRNA-gene associations.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "miRNA target prediction",
                    "uri": "http://edamontology.org/operation_0463"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Xshelton/SG_LSTM",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-02-16T15:41:06Z",
    "name": "SG-LSTM",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1093/BIB/BBAA022",
            "metadata": {
                "abstract": "© 2020 The Author(s) 2020. Published by Oxford University Press. All rights reserved.Motivation: MircroRNAs (miRNAs) regulate target genes and are responsible for lethal diseases such as cancers. Accurately recognizing and identifying miRNA and gene pairs could be helpful in deciphering the mechanism by which miRNA affects and regulates the development of cancers. Embedding methods and deep learning methods have shown their excellent performance in traditional classification tasks in many scenarios. But not so many attempts have adapted and merged these two methods into miRNA-gene relationship prediction. Hence, we proposed a novel computational framework. We first generated representational features for miRNAs and genes using both sequence and geometrical information and then leveraged a deep learning method for the associations' prediction. Results: We used long short-term memory (LSTM) to predict potential relationships and proved that our method outperformed other state-of-the-art methods. Results showed that our framework SG-LSTM got an area under curve of 0.94 and was superior to other methods. In the case study, we predicted the top 10 miRNA-gene relationships and recommended the top 10 potential genes for hsa-miR-335-5p for SG-LSTM-core. We also tested our model using a larger dataset, from which 14 668 698 miRNA-gene pairs were predicted. The top 10 unknown pairs were also listed",
                "authors": [
                    {
                        "name": "Xie W."
                    },
                    {
                        "name": "Luo J."
                    },
                    {
                        "name": "Pan C."
                    },
                    {
                        "name": "Liu Y."
                    }
                ],
                "citationCount": 3,
                "date": "2021-03-01T00:00:00Z",
                "journal": "Briefings in Bioinformatics",
                "title": "SG-LSTM-FRAME: A computational frame using sequence and geometrical information via LSTM to predict miRNA-gene associations"
            },
            "pmid": "32181478"
        }
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        }
    ]
}