{
    "additionDate": "2019-11-14T18:46:17Z",
    "biotoolsCURIE": "biotools:LUAD_LUSC",
    "biotoolsID": "LUAD_LUSC",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "elenap@cancer.dk",
            "name": "Elena Papaleo",
            "orcidid": "https://orcid.org/0000-0003-2296-898X",
            "typeEntity": "Person"
        }
    ],
    "description": "Scripts and Data associated with our publication on genomic signatures to discriminate LUAD and LUSC lung cancer types using TCGA data | Computational Biology Laboratory, Danish Cancer Society Research Center, Strandboulevarden 49, 2100, Copenhagen, Denmark | Repository associated to the publication: | Different molecular signatures in lung cancer types from integrative bioinformatic analyses of RNASeq data Marta Lucchetta, Isabelle da Piedade, Mohamed Mounir, Marina Vabistsevits, Thilde Terkelsen, Elena Papaleo*, bioRxiv, doi: https://doi.org/10.1101/501569",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Expression correlation analysis",
                    "uri": "http://edamontology.org/operation_3463"
                },
                {
                    "term": "Differential gene expression analysis",
                    "uri": "http://edamontology.org/operation_3223"
                },
                {
                    "term": "Weighted correlation network analysis",
                    "uri": "http://edamontology.org/operation_3766"
                }
            ]
        }
    ],
    "homepage": "https://github.com/ELELAB/LUAD_LUSC_TCGA_comparison",
    "language": [
        "R"
    ],
    "lastUpdate": "2020-12-22T13:29:29Z",
    "license": "GPL-3.0",
    "name": "LUAD LUSC",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12885-019-5965-X",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Genomic initiatives such as The Cancer Genome Atlas (TCGA) contain data from -omics profiling of thousands of tumor samples, which may be used to decipher cancer signaling, and related alterations. Managing and analyzing data from large-scale projects, such as TCGA, is a demanding task. It is difficult to dissect the high complexity hidden in genomic data and to account for inter-tumor heterogeneity adequately. Methods: In this study, we used a robust statistical framework along with the integration of diverse bioinformatic tools to analyze next-generation sequencing data from more than 1000 patients from two different lung cancer subtypes, i.e., the lung adenocarcinoma (LUAD) and the squamous cell carcinoma (LUSC). Results: We used the gene expression data to identify co-expression modules and differentially expressed genes to discriminate between LUAD and LUSC. We identified a group of genes which could act as specific oncogenes or tumor suppressor genes in one of the two lung cancer types, along with two dual role genes. Our results have been validated against other transcriptomics data of lung cancer patients. Conclusions: Our integrative approach allowed us to identify two key features: a substantial up-regulation of genes involved in O-glycosylation of mucins in LUAD, and a compromised immune response in LUSC. The immune-profile associated with LUSC might be linked to the activation of three oncogenic pathways, which promote the evasion of the antitumor immune response. Collectively, our results provide new future directions for the design of target therapies in lung cancer.",
                "authors": [
                    {
                        "name": "Lucchetta M."
                    },
                    {
                        "name": "Da Piedade I."
                    },
                    {
                        "name": "Mounir M."
                    },
                    {
                        "name": "Vabistsevits M."
                    },
                    {
                        "name": "Terkelsen T."
                    },
                    {
                        "name": "Papaleo E."
                    }
                ],
                "citationCount": 4,
                "date": "2019-08-20T00:00:00Z",
                "journal": "BMC Cancer",
                "title": "Distinct signatures of lung cancer types: Aberrant mucin O-glycosylation and compromised immune response"
            },
            "pmcid": "PMC6702745",
            "pmid": "31429720"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ],
    "validated": 1
}