{
    "additionDate": "2024-01-29T11:06:34.169317Z",
    "biotoolsCURIE": "biotools:ssp_salm",
    "biotoolsID": "ssp_salm",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "tr@bt.iith.ac.in",
            "name": "Thenmalarchelvi Rathinavelan"
        }
    ],
    "description": "In silico tool for salmonella species serotyping using the sequences of o-antigen biosynthesis proteins and h-antigen filament proteins.",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://project.iith.ac.in/SSP/",
    "lastUpdate": "2024-01-29T11:06:34.172274Z",
    "name": "SSP",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1016/J.JMB.2023.168046",
            "metadata": {
                "abstract": "Over 2500 Salmonella species (alternatively, serovars) encompassing different combinations of O-, H1- and H2-antigens are present in nature and cause millions of deaths worldwide every year. Since conventional serotyping is time-consuming, a user-friendly Salmonella species serotyping (SSP) web tool (https://project.iith.ac.in/SSP/) is developed here to predict the serotypes using Salmonella protein(s) or whole proteome sequences. Prior to SSP implementation, a detailed analysis of protein sequences involved in O-antigen biosynthesis and H-antigen formation is carried out to assess their serotype specificity. Intriguingly, the results indicate that the initializing transferases WbaP, WecA and GNE can efficiently distinguish the O-antigens, which have Gal, GlcNAc and GalNAc as initial sugars respectively. Rigorous analysis shows that Wzx and Wzy are sufficient to distinguish the O-types. Exceptionally, some situations warrant additional proteins. Thus, 150 additional transferases, RfbE for O2, O9 and O9,46 types, Orf17.4 for O3,10 and O1,3,19 types, WecB, WbbE and WbbF for O54 and, Wzm and Wzt for O67 are utilized in serotyping. An in-depth analysis of 302 reference datasets representing 56 H1- and 20 H2-types leads to the identification and utilization of 61 unique sequence patterns of FliC and FljB in H-typing. A test dataset of 2136 whole proteome sequences covering 740 Salmonella serovars, including 13 new species are successfully predicted with 99.72% accuracy. Prior to this, all the O-, H1- and H2-antigens are predicted accurately when tested independently. Indeed, SSP also identifies wrongly annotated Salmonella species; hence, it can easily identify new species that emerge with any combination of O-, H1- and H2-antigens. Thus, SSP can act as a valuable tool in the surveillance of Salmonella species.",
                "authors": [
                    {
                        "name": "Rathinavelan T."
                    },
                    {
                        "name": "Sundaresan S."
                    }
                ],
                "citationCount": 2,
                "date": "2023-07-15T00:00:00Z",
                "journal": "Journal of Molecular Biology",
                "title": "SSP: An In Silico Tool for Salmonella Species Serotyping Using the Sequences of O-Antigen Biosynthesis Proteins and H-Antigen Filament Proteins"
            },
            "pmid": "37356912"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Immunoproteins and antigens",
            "uri": "http://edamontology.org/topic_2830"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        }
    ]
}
