{
    "accessibility": [],
    "additionDate": "2018-08-14T02:31:54Z",
    "biotoolsCURIE": "biotools:feather",
    "biotoolsID": "feather",
    "collectionID": [],
    "confidence_flag": null,
    "cost": null,
    "credit": [
        {
            "email": "tperkins@jila.colorado.edu",
            "gridid": null,
            "name": "Thomas T. Perkins",
            "note": null,
            "orcidid": null,
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": null
        }
    ],
    "description": "FEATHER ( Force Extension Analysis using a Testable Hypothesis for Event Recognition) automatically identifies the locations of unfolding/unbinding events in single-molecule force spectroscopy records and thereby deduces the corresponding rupture force and loading rate.",
    "documentation": [
        {
            "note": null,
            "type": "General",
            "url": "https://github.com/perkinslab/AppFEATHER/blob/V1.4/README.md"
        }
    ],
    "download": [],
    "editPermission": {
        "authors": [],
        "type": "private"
    },
    "elixirNode": [],
    "elixirPlatform": [],
    "elixir_badge": 0,
    "function": [
        {
            "cmd": null,
            "input": [],
            "note": null,
            "operation": [
                {
                    "term": "Protein folding analysis",
                    "uri": "http://edamontology.org/operation_2415"
                }
            ],
            "output": []
        }
    ],
    "homepage": "https://github.com/perkinslab/AppFEATHER/tree/V1.4",
    "homepage_status": 0,
    "language": [
        "MATLAB",
        "Python"
    ],
    "lastUpdate": "2018-12-10T12:59:01Z",
    "license": "Other",
    "link": [],
    "maturity": null,
    "name": "FEATHER",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "otherID": [],
    "owner": "daniel_stefan",
    "publication": [
        {
            "doi": "10.1016/j.bpj.2018.07.031",
            "metadata": {
                "abstract": "© 2018 Single-molecule force spectroscopy (SMFS) provides a powerful tool to explore the dynamics and energetics of individual proteins, protein-ligand interactions, and nucleic acid structures. In the canonical assay, a force probe is retracted at constant velocity to induce a mechanical unfolding/unbinding event. Next, two energy landscape parameters, the zero-force dissociation rate constant (ko) and the distance to the transition state (Δx‡), are deduced by analyzing the most probable rupture force as a function of the loading rate, the rate of change in force. Analyzing the shape of the rupture force distribution reveals additional biophysical information, such as the height of the energy barrier (ΔG‡). Accurately quantifying such distributions requires high-precision characterization of the unfolding events and significantly larger data sets. Yet, identifying events in SMFS data is often done in a manual or semiautomated manner and is obscured by the presence of noise. Here, we introduce, to our knowledge, a new algorithm, FEATHER (force extension analysis using a testable hypothesis for event recognition), to automatically identify the locations of unfolding/unbinding events in SMFS records and thereby deduce the corresponding rupture force and loading rate. FEATHER requires no knowledge of the system under study, does not bias data interpretation toward the dominant behavior of the data, and has two easy-to-interpret, user-defined parameters. Moreover, it is a linear algorithm, so it scales well for large data sets. When analyzing a data set from a polyprotein containing both mechanically labile and robust domains, FEATHER featured a 30-fold improvement in event location precision, an eightfold improvement in a measure of the accuracy of the loading rate and rupture force distributions, and a threefold reduction of false positives in comparison to two representative reference algorithms. We anticipate FEATHER being leveraged in more complex analysis schemes, such as the segmentation of complex force-extension curves for fitting to worm-like chain models and extended in future work to data sets containing both unfolding and refolding transitions.",
                "authors": [
                    {
                        "name": "Heenan P.R."
                    },
                    {
                        "name": "Perkins T.T."
                    }
                ],
                "citationCount": 0,
                "date": "2018-09-04T00:00:00Z",
                "journal": "Biophysical Journal",
                "title": "FEATHER: Automated Analysis of Force Spectroscopy Unbinding and Unfolding Data via a Bayesian Algorithm"
            },
            "note": null,
            "pmcid": null,
            "pmid": null,
            "type": "Primary",
            "version": null
        }
    ],
    "relation": [],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Protein structure analysis",
            "uri": "http://edamontology.org/topic_2814"
        },
        {
            "term": "Molecular dynamics",
            "uri": "http://edamontology.org/topic_0176"
        }
    ],
    "validated": 1,
    "version": [
        "1.4"
    ]
}