
{
    "credit": [
        {
            "email": "guindon@lirmm.fr",
            "name": "Stephane Guindon",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact",
                "Developer"
            ],
            "url": "http://stephaneguindon.github.io/"
        },
        {
            "name": "LIRMM",
            "typeEntity": "Institute",
            "typeRoles": [
            ],
            "url": "http://www.lirmm.fr/"
        }
    ],
    "documentation": [
        {
            "type": "User manual",
            "url": "https://github.com/stephaneguindon/phyml/blob/master/doc/phyml-manual.pdf"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "https://github.com/stephaneguindon/phyml/releases"
        }
    ],
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Nucleic acid sequence alignment",
                        "uri": "http://edamontology.org/data_1383"
                    },
                    "format": [
                        {
                            "term": "Phylip format variant",
                            "uri": "http://edamontology.org/format_2924"
                        }
                    ]
                },
                {
                    "data": {
                        "term": "Protein sequence alignment",
                        "uri": "http://edamontology.org/data_1384"
                    },
                    "format": [
                        {
                            "term": "Phylip format variant",
                            "uri": "http://edamontology.org/format_2924"
                        }
                    ]
                }
            ],
            "operation": [
                {
                    "term": "Phylogenetic tree generation (maximum likelihood and Bayesian methods)",
                    "uri": "http://edamontology.org/operation_0547"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Phylogenetic tree",
                        "uri": "http://edamontology.org/data_0872"
                    },
                    "format": [
                        {
                            "term": "newick",
                            "uri": "http://edamontology.org/format_1910"
                        }
                    ]
                }
            ]
        }
    ],
    "labels": {
        "accessibility": [
            "Open access"
        ],
        "collectionID": [
            "PhyML",
            "galaxyPasteur",
            "elixir-fr-sdp-2019"
        ],
        "cost": "Free of charge",
        "elixirNode": [
            "France"
        ],
        "elixirPlatform": [
            "Tools"
        ],
        "license": "GPL-2.0",
        "maturity": "Mature",
        "operatingSystem": [
            "Linux",
            "Mac"
        ],
        "toolType": [
            "Command-line tool",
            "Web application"
        ],
        "topic": [
            {
                "term": "Phylogenetics",
                "uri": "http://edamontology.org/topic_3293"
            },
            {
                "term": "Bioinformatics",
                "uri": "http://edamontology.org/topic_0091"
            },
            {
                "term": "Phylogenetics",
                "uri": "http://edamontology.org/topic_3293"
            }
        ]
    },
    "link": [
        {
            "type": "Galaxy service",
            "url": "https://galaxy.pasteur.fr/tool_runner?tool_id=toolshed.pasteur.fr/repos/fmareuil/phyml/phyml/3.1"
        },
        {
            "type": "Service",
            "url": "http://www.atgc-montpellier.fr/phyml/"
        }
    ],
    "publication": [
        {
            "abstract": "PhyML is a phylogeny software based on the maximum-likelihood principle. Early PhyML versions used a fast algorithm performing nearest neighbor interchanges to improve a reasonable starting tree topology. Since the original publication (Guindon S., Gascuel O. 2003. A simple, fast and accurate algorithm to estimate large phylogenies by maximum likelihood. Syst. Biol. 52:696-704), PhyML has been widely used (>2500 citations in ISI Web of Science) because of its simplicity and a fair compromise between accuracy and speed. In the meantime, research around PhyML has continued, and this article describes the new algorithms and methods implemented in the program. First, we introduce a new algorithm to search the tree space with user-defined intensity using subtree pruning and regrafting topological moves. The parsimony criterion is used here to filter out the least promising topology modifications with respect to the likelihood function. The analysis of a large collection of real nucleotide and amino acid data sets of various sizes demonstrates the good performance of this method. Second, we describe a new test to assess the support of the data for internal branches of a phylogeny. This approach extends the recently proposed approximate likelihood-ratio test and relies on a nonparametric, Shimodaira-Hasegawa-like procedure. A detailed analysis of real alignments sheds light on the links between this new approach and the more classical nonparametric bootstrap method. Overall, our tests show that the last version (3.0) of PhyML is fast, accurate, stable, and ready to use. A Web server and binary files are available from http://www.atgc-montpellier.fr/phyml/.",
            "authors": [
                "Guindon S.",
                "Dufayard J.-F.",
                "Lefort V.",
                "Anisimova M.",
                "Hordijk W.",
                "Gascuel O."
            ],
            "cit_count": 7427,
            "doi": "10.1093/sysbio/syq010",
            "journal": "Systematic Biology",
            "title": "New algorithms and methods to estimate maximum-likelihood phylogenies: Assessing the performance of PhyML 3.0",
            "type": "Primary",
            "year": "2010-05-01"
        },
        {
            "abstract": "The increase in the number of large data sets and the complexity of current probabilistic sequence evolution models necessitates fast and reliable phylogeny reconstruction methods. We describe a new approach, based on the maximum-likelihood principle, which clearly satisfies these requirements. The core of this method is a simple hill-climbing algorithm that adjusts tree topology and branch lengths simultaneously. This algorithm starts from an initial tree built by a fast distance-based method and modifies this tree to improve its likelihood at each iteration. Due to this simultaneous adjustment of the topology and branch lengths, only a few iterations are sufficient to reach an optimum. We used extensive and realistic computer simulations to show that the topological accuracy of this new method is at least as high as that of the existing maximum-likelihood programs and much higher than the performance of distance-based and parsimony approaches. The reduction of computing time is dramatic in comparison with other maximum-likelihood packages, while the likelihood maximization ability tends to be higher. For example, only 12 min were required on a standard personal computer to analyze a data set consisting of 500 rbcL sequences with 1,428 base pairs from plant plastids, thus reaching a speed of the same order as some popular distance-based and parsimony algorithms. This new method is implemented in the PHYML program, which is freely available on our web page: http://www.lirmm.fr/w3ifa/MAAS/.",
            "authors": [
                "Guindon S.",
                "Gascuel O."
            ],
            "cit_count": 12440,
            "doi": "10.1080/10635150390235520",
            "journal": "Systematic Biology",
            "title": "A Simple, Fast, and Accurate Algorithm to Estimate Large Phylogenies by Maximum Likelihood",
            "type": "Method",
            "year": "2003-10-01"
        },
        {
            "abstract": "Motivation: Maximum likelihood (ML) methods have become very popular for constructing phylogenetic trees from sequence data. However, despite noticeable recent progress, with large and difficult datasets (e.g. multiple genes with conflicting signals) current ML programs still require huge computing time and can become trapped in bad local optima of the likelihood function. When this occurs, the resulting trees may still show some of the defects (e.g. long branch attraction) of starting trees obtained using fast distance or parsimony programs. Methods: Subt ree pruning and regrafting (SPR) topological rearrangements are usually sufficient to intensively search the tree space. Here, we propose two new methods to make SPR moves more efficient. The first method uses a fast distance-based approach to detect the least promising candidate SPR moves, which are then simply discarded. The second method locally estimates the change in likelihood for any remaining potential SPRs, as opposed to globally evaluating the entire tree for each possible move. These two methods are implemented in a new algorithm with a sophisticated filtering strategy, which efficiently selects potential SPRs and concentrates most of the likelihood computation on the promising moves. Results: Experiments wit h real datasets comprising 35-250 taxa show that, while indeed greatly reducing the amount of computation, our approach provides likelihood values at least as good as those of the best-known ML methods so far and is very robust to poor starting trees. Furthermore, combining our new SPR algorithm with local moves such as PHYML's nearest neighbor interchanges, the time needed to find good solutions can sometimes be reduced even more. © The Author 2005. Published by Oxford University Press. All rights reserved.",
            "authors": [
                "Hordijk W.",
                "Gascuel O."
            ],
            "cit_count": 114,
            "doi": "10.1093/bioinformatics/bti713",
            "journal": "Bioinformatics",
            "title": "Improving the efficiency of SPR moves in phylogenetic tree search methods based on maximum likelihood",
            "type": "Method",
            "year": "2005-12-01"
        },
        {
            "abstract": "We revisit statistical tests for branches of evolutionary trees reconstructed upon molecular data. A new, fast, approximate likelihood-ratio test (aLRT) for branches is presented here as a competitive alternative to nonparametric bootstrap and Bayesian estimation of branch support. The aLRT is based on the idea of the conventional LRT, with the null hypothesis corresponding to the assumption that the inferred branch has length 0. We show that the LRT statistic is asymptotically distributed as a maximum of three random variables drawn from the χ 0 2 + χ 1 2 distribution. The new aLRT of interior branch uses this distribution for significance testing, but the test statistic is approximated in a slightly conservative but practical way as 2(ℓ 1 - ℓ 2 ), i.e., double the difference between the maximum log-likelihood values corresponding to the best tree and the second best topological arrangement around the branch of interest. Such a test is fast because the log-likelihood value ℓ 2 is computed by optimizing only over the branch of interest and the four adjacent branches, whereas other parameters are fixed at their optimal values corresponding to the best ML tree. The performance of the new test was studied on simulated 4-, 12-, and 100-taxon data sets with sequences of different lengths. The aLRT is shown to be accurate, powerful, and robust to certain violations of model assumptions. The aLRT is implemented within the algorithm used by the recent fast maximum likelihood tree estimation program PHYML (Guindon and Gascuel, 2003). Copyright © Society of Systematic Biologists.",
            "authors": [
                "Anisimova M.",
                "Gascuel O."
            ],
            "cit_count": 1546,
            "doi": "10.1080/10635150600755453",
            "journal": "Systematic Biology",
            "title": "Approximate likelihood-ratio test for branches: A fast, accurate, and powerful alternative",
            "type": "Method",
            "year": "2006-08-01"
        },
        {
            "abstract": "PHYML Online is a web interface to PHYML, a software that implements a fast and accurate heuristic for estimating maximum likelihood phylogenies from DNA and protein sequences. This tool provides the user with a number of options, e.g. nonparametric bootstrap and estimation of various evolutionary parameters, in order to perform comprehensive phylogenetic analyses on large datasets in reasonable computing time. The server and its documentation are available at http://atgc.lirmm.fr/ phyml. © 2005 Oxford University Press.",
            "authors": [
                "Guindon S.",
                "Lethiec F.",
                "Duroux P.",
                "Gascuel O."
            ],
            "cit_count": 1085,
            "doi": "10.1093/nar/gki352",
            "journal": "Nucleic Acids Research",
            "title": "PHYML Online - A web server for fast maximum likelihood-based phylogenetic inference",
            "type": "Usage",
            "year": "2005-07-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:phyml",
        "biotoolsID": "phyml",
        "description": "Phylogenetic estimation software using Maximum Likelihood",
        "homepage": "http://www.atgc-montpellier.fr/phyml/",
        "name": "PhyML"
    }
}