{
    "additionDate": "2017-08-03T18:49:23Z",
    "biotoolsCURIE": "biotools:mgescan-ltr",
    "biotoolsID": "mgescan-ltr",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://www.roswellpark.org/contact"
        }
    ],
    "description": "De novo computational method identifies new LTR (long terminal repeat) retrotransposons without relying on a library of known elements. Specifically, the method identifies intact LTR retrotransposons by using an approximate string matching technique and protein domain analysis.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://darwin.informatics.indiana.edu/cgi-bin/evolution/ltr.pl"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Transposon prediction",
                    "uri": "http://edamontology.org/operation_0427"
                }
            ]
        }
    ],
    "homepage": "http://darwin.informatics.indiana.edu/cgi-bin/evolution/ltr.pl",
    "language": [
        "Perl",
        "C"
    ],
    "lastUpdate": "2018-12-10T12:58:52Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/mgescan-ltr-mgescan-non-ltr-v2-identification-ltr-non-ltr-retroelements.html"
        }
    ],
    "name": "MGEScan-LTR",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Computational methods for genome-wide identification of mobile genetic elements (MGEs) have become increasingly necessary for both genome annotation and evolutionary studies. Non-long terminal repeat (non-LTR) retrotransposons are a class of MGEs that have been found in most eukaryotic genomes, sometimes in extremely high numbers. In this article, we present a computational tool, MGEScan-non-LTR, for the identification of non-LTR retrotransposons in genomic sequences, following a computational approach inspired by a generalized hidden Markov model (GHMM). Three different states represent two different protein domains and inter-domain linker regions encoded in the non-LTR retrotransposons, and their scores are evaluated by using profile hidden Markov models (for protein domains) and Gaussian Bayes classifiers (for linker regions), respectively. In order to classify the non-LTR retrotransposons into one of the 12 previously characterized clades using the same model, we defined separate states for different clades. MGEScan-non-LTR was tested on the genome sequences of four eukaryotic organisms, Drosophila melanogaster, Daphnia pulex, Ciona intestinalis and Strongylocentrotus purpuratus. For the D. melanogaster genome, MGEScan-non-LTR found all known 'full-length' elements and simultaneously classified them into the clades CR1, I, Jockey, LOA and R1. Notably, for the D. pulex genome, in which no non-LTR retrotransposon has been annotated, MGEScan-non-LTR found a significantly larger number of elements than did RepeatMasker, using the current version of the RepBase Update library. We also identified novel elements in the other two genomes, which have only been partially studied for non-LTR retrotransposons. © The Author(s) 2009. Published by Oxford University Press.",
                "authors": [
                    {
                        "name": "Rho M."
                    },
                    {
                        "name": "Tang H."
                    }
                ],
                "citationCount": 22,
                "date": "2009-09-17T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "MGEScan-non-LTR: Computational identification and classification of autonomous non-LTR retrotransposons in eukaryotic genomes"
            },
            "pmid": "19762481"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Structural genomics",
            "uri": "http://edamontology.org/topic_0122"
        },
        {
            "term": "Mobile genetic elements",
            "uri": "http://edamontology.org/topic_0798"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        }
    ],
    "validated": 1
}