{
    "additionDate": "2017-09-19T09:10:00Z",
    "biotoolsCURIE": "biotools:diana-mirpath",
    "biotoolsID": "diana-mirpath",
    "credit": [
        {
            "email": "artemis.hatzigeorgiou@gmail.com",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.microrna.gr"
        },
        {
            "email": "ivlachos@lessr.eu",
            "name": "Ioannis S Vlachos",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Dedicated to the assessment of miRNA regulatory roles and the identification of controlled pathways. It support all analyses for KEGG molecular pathways, as well as multiple slices of Gene Ontology (GO) in seven species. A unique feature of DIANA-miRPath v3.0 is its redesigned Reverse Search module, which enables users to identify and visualize miRNAs significantly controlling selected pathways or belonging to specific GO categories based on in silico or experimental data.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://snf-515788.vm.okeanos.grnet.gr/index.php?r=site/help&topic=mirpath"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Identifier",
                        "uri": "http://edamontology.org/data_0842"
                    }
                }
            ],
            "operation": [
                {
                    "term": "Pathway or network analysis",
                    "uri": "http://edamontology.org/operation_2497"
                }
            ]
        }
    ],
    "homepage": "http://www.microrna.gr/miRPathv3",
    "language": [
        "JavaScript",
        "PHP",
        "SQL"
    ],
    "lastUpdate": "2019-03-12T13:31:08Z",
    "name": "DIANA-mirPath",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "dianalab",
    "publication": [
        {
            "doi": "10.1093/nar/gkv403",
            "metadata": {
                "abstract": "© 2015 The Author(s).The functional characterization of miRNAs is still an open challenge. Here, we present DIANA-miRPath v3.0 (http://www.microrna.gr/miRPathv3) an online software suite dedicated to the assessment of miRNA regulatory roles and the identification of controlled pathways. The new miRPath web server renders possible the functional annotation of one or more miRNAs using standard (hypergeometric distributions), unbiased empirical distributions and/or meta-analysis statistics. DIANA-miRPath v3.0 database and functionality have been significantly extended to support all analyses for KEGGmolecular pathways, as well as multiple slices of Gene Ontology (GO) in seven species (Homo sapiens, Mus musculus, Rattus norvegicus, Drosophila melanogaster, Caenorhabditis elegans, Gallus gallus and Danio rerio). Importantly, more than 600 000 experimentally supported miRNA targets from DIANA-TarBase v7.0 have been incorporated into the new schema. Users of DIANA-miRPath v3.0 can harness this wealth of information and substitute or combine the available in silico predicted targets from DIANA-microTCDS and/or TargetScan v6.2 with high quality experimentally supported interactions. A unique feature of DIANA-miRPath v3.0 is its redesigned Reverse Search module, which enables users to identify and visualize miRNAs significantly controlling selected pathways or belonging to specific GO categories based on in silico or experimental data. DIANA-miRPath v3.0 is freely available to all users without any login requirement.",
                "authors": [
                    {
                        "name": "Vlachos I.S."
                    },
                    {
                        "name": "Zagganas K."
                    },
                    {
                        "name": "Paraskevopoulou M.D."
                    },
                    {
                        "name": "Georgakilas G."
                    },
                    {
                        "name": "Karagkouni D."
                    },
                    {
                        "name": "Vergoulis T."
                    },
                    {
                        "name": "Dalamagas T."
                    },
                    {
                        "name": "Hatzigeorgiou A.G."
                    }
                ],
                "citationCount": 713,
                "date": "2015-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "DIANA-miRPath v3.0: Deciphering microRNA function with experimental support"
            },
            "pmcid": "PMC4489228",
            "pmid": "25977294",
            "type": [
                "Primary"
            ]
        },
        {
            "doi": "10.1093/nar/gks494",
            "metadata": {
                "abstract": "MicroRNAs (miRNAs) are key regulators of diverse biological processes and their functional analysis has been deemed central in many research pipelines. The new version of DIANA-miRPath web server was redesigned from the ground-up. The user of DNA Intelligent Analysis (DIANA) DIANA-miRPath v2.0 can now utilize miRNA targets predicted with high accuracy based on DIANA-microT-CDS and/or experimentally verified targets from TarBase v6; combine results with merging and meta-analysis algorithms; perform hierarchical clustering of miRNAs and pathways based on their interaction levels; as well as elaborate sophisticated visualizations, such as dendrograms or miRNA versus pathway heat maps, from an intuitive and easy to use web interface. New modules enable DIANA-miRPath server to provide information regarding pathogenic single nucleotide polymorphisms (SNPs) in miRNA target sites (SNPs module) or to annotate all the predicted and experimentally validated miRNA targets in a selected molecular pathway (Reverse Search module). DIANA-miRPath v2.0 is an efficient and yet easy to use tool that can be incorporated successfully into miRNA-related analysis pipelines. It provides for the first time a series of highly specific tools for miRNA-targeted pathway analysis via a web interface and can be accessed at http://www.microrna.gr/miRPathv2. © 2012 The Author(s).",
                "authors": [
                    {
                        "name": "Vlachos I.S."
                    },
                    {
                        "name": "Kostoulas N."
                    },
                    {
                        "name": "Vergoulis T."
                    },
                    {
                        "name": "Georgakilas G."
                    },
                    {
                        "name": "Reczko M."
                    },
                    {
                        "name": "Maragkakis M."
                    },
                    {
                        "name": "Paraskevopoulou M.D."
                    },
                    {
                        "name": "Prionidis K."
                    },
                    {
                        "name": "Dalamagas T."
                    },
                    {
                        "name": "Hatzigeorgiou A.G."
                    }
                ],
                "citationCount": 390,
                "date": "2012-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "DIANA miRPath v.2.0: Investigating the combinatorial effect of microRNAs in pathways"
            },
            "pmcid": "PMC3394305",
            "pmid": "22649059",
            "type": [
                "Other"
            ]
        },
        {
            "doi": "10.1093/bioinformatics/btp299",
            "metadata": {
                "abstract": "DIANA-mirPath is a web-based computational tool developed to identify molecular pathways potentially altered by the expression of single or multiple microRNAs. The software performs an enrichment analysis of multiple microRNA target genes comparing each set of microRNA targets to all known KEGG pathways. The combinatorial effect of co-expressed microRNAs in the modulation of a given pathway is taken into account by the simultaneous analysis of multiple microRNAs. The graphical output of the program provides an overview of the parts of the pathway modulated by microRNAs, facilitating the interpretation and presentation of the analysis results. © The Author 2009. Published by Oxford University Press. All rights reserved.",
                "authors": [
                    {
                        "name": "Papadopoulos G.L."
                    },
                    {
                        "name": "Alexiou P."
                    },
                    {
                        "name": "Maragkakis M."
                    },
                    {
                        "name": "Reczko M."
                    },
                    {
                        "name": "Hatzigeorgiou A.G."
                    }
                ],
                "citationCount": 240,
                "date": "2009-08-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "DIANA-mirPath: Integrating human and mouse microRNAs in pathways"
            },
            "pmid": "19435746",
            "type": [
                "Other"
            ]
        }
    ],
    "toolType": [
        "Web service"
    ],
    "topic": [
        {
            "term": "Gene regulation",
            "uri": "http://edamontology.org/topic_0204"
        }
    ],
    "validated": 1
}