{
    "additionDate": "2017-07-26T19:58:33Z",
    "biotoolsCURIE": "biotools:hmm-tm",
    "biotoolsID": "hmm-tm",
    "credit": [
        {
            "email": "pbagos@compgen.org",
            "name": "Pantelis Bagos",
            "orcidid": "https://orcid.org/0000-0003-4935-2325",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.compgen.org/people/pbagos"
        }
    ],
    "description": "HMM-TM is a tool that takes a protein sequence as input and predicts the transmembrane regions of alpha-helical",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://www.compgen.org/tools/HMM-TM"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Protein sequence",
                        "uri": "http://edamontology.org/data_2976"
                    },
                    "format": [
                        {
                            "term": "FASTA",
                            "uri": "http://edamontology.org/format_1929"
                        }
                    ]
                }
            ],
            "operation": [
                {
                    "term": "Prediction and recognition",
                    "uri": "http://edamontology.org/operation_2423"
                },
                {
                    "term": "Transmembrane protein analysis",
                    "uri": "http://edamontology.org/operation_0270"
                },
                {
                    "term": "Transmembrane protein prediction",
                    "uri": "http://edamontology.org/operation_0269"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Sequence report",
                        "uri": "http://edamontology.org/data_2955"
                    },
                    "format": [
                        {
                            "term": "plain text format (unformatted)",
                            "uri": "http://edamontology.org/format_1964"
                        }
                    ]
                }
            ]
        }
    ],
    "homepage": "http://www.compgen.org/tools/HMM-TM",
    "lastUpdate": "2019-01-15T03:12:51Z",
    "name": "HMM-TM",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "itamposis",
    "publication": [
        {
            "doi": "10.1186/1471-2105-7-189",
            "metadata": {
                "abstract": "Background: Hidden Markov Models (HMMs) have been extensively used in computational molecular biology, for modelling protein and nucleic acid sequences. In many applications, such as transmembrane protein topology prediction, the incorporation of limited amount of information regarding the topology, arising from biochemical experiments, has been proved a very useful strategy that increased remarkably the performance of even the top-scoring methods. However, no clear and formal explanation of the algorithms that retains the probabilistic interpretation of the models has been presented so far in the literature. Results: We present here, a simple method that allows incorporation of prior topological information concerning the sequences at hand, while at the same time the HMMs retain their full probabilistic interpretation in terms of conditional probabilities. We present modifications to the standard Forward and Backward algorithms of HMMs and we also show explicitly, how reliable predictions may arise by these modifications, using all the algorithms currently available for decoding HMMs. A similar procedure may be used in the training procedure, aiming at optimizing the labels of the HMM's classes, especially in cases such as transmembrane proteins where the labels of the membrane-spanning segments are inherently misplaced. We present an application of this approach developing a method to predict the transmembrane regions of alpha-helical membrane proteins, trained on crystallographically solved data. We show that this method compares well against already established algorithms presented in the literature, and it is extremely useful in practical applications. Conclusion: The algorithms presented here, are easily implemented in any kind of a Hidden Markov Model, whereas the prediction method (HMM-TM) is freely available for academic users at http://bioinformatics.biol.uoa.gr/HMM-TM, offering the most advanced decoding options currently available. © 2006 Bagos et al; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Bagos P.G."
                    },
                    {
                        "name": "Hamodrakas S.J."
                    },
                    {
                        "name": "Liakopoulos T.D."
                    }
                ],
                "citationCount": 56,
                "date": "2006-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Algorithms for incorporating prior topological information in HMMs: Application to transmembrane proteins"
            },
            "pmcid": "PMC1523218",
            "pmid": "16597327",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Membrane and lipoproteins",
            "uri": "http://edamontology.org/topic_0820"
        },
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        }
    ],
    "validated": 1,
    "version": [
        "1.1"
    ]
}
