{
    "additionDate": "2017-03-30T21:27:31Z",
    "biotoolsCURIE": "biotools:gdr",
    "biotoolsID": "gdr",
    "credit": [
        {
            "name": "Contact Form",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://www.rosaceae.org/contact"
        }
    ],
    "description": "Contains all publically available Rosaceae sequences including annotated peach, strawberry and almond EST sequences and the genetically anchored peach physical map.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://www.rosaceae.org/userManual"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "EST assembly",
                    "uri": "http://edamontology.org/operation_0526"
                },
                {
                    "term": "Genetic mapping",
                    "uri": "http://edamontology.org/operation_0282"
                },
                {
                    "term": "Mapping",
                    "uri": "http://edamontology.org/operation_2429"
                },
                {
                    "term": "Physical mapping",
                    "uri": "http://edamontology.org/operation_2944"
                },
                {
                    "term": "Sequence tagged site (STS) mapping",
                    "uri": "http://edamontology.org/operation_2871"
                }
            ]
        }
    ],
    "homepage": "http://www.rosaceae.org/",
    "language": [
        "Perl"
    ],
    "lastUpdate": "2021-04-18T12:23:46Z",
    "name": "Genome Database for Rosaceae (GDR)",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "otherID": [
        {
            "type": "rrid",
            "value": "RRID:SCR_012756"
        }
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "Background: Peach is being developed as a model organism for Rosaceae, an economically important family that includes fruits and ornamental plants such as apple, pear, strawberry, cherry, almond and rose. The genomics and genetics data of peach can play a significant role in the gene discovery and the genetic understanding of related species. The effective utilization of these peach resources, however, requires the development of an integrated and centralized database with associated analysis tools. Description: The Genome Database for Rosaceae (GDR) is a curated and integrated web-based relational database. GDR contains comprehensive data of the genetically anchored peach physical map, an annotated peach EST database, Rosaceae maps and markers and all publicly available Rosaceae sequences. Annotations of ESTs include contig assembly, putative function, simple sequence repeats, and anchored position to the peach physical map where applicable. Our integrated map viewer provides graphical interface to the genetic, transcriptome and physical mapping information. ESTs, BACs and markers can be queried by various categories and the search result sites are linked to the integrated map viewer or to the WebFPC physical map sites. In addition to browsing and querying the database, users can compare their sequences with the annotated GDR sequences via a dedicated sequence similarity server running either the BLAST or FASTA algorithm. To demonstrate the utility of the integrated and fully annotated database and analysis tools, we describe a case study where we anchored Rosaceae sequences to the peach physical and genetic map by sequence similarity. Conclusions: The GDR has been initiated to meet the major deficiency in Rosaceae genomics and genetics research, namely a centralized web database and bioinformatics tools for data storage, analysis and exchange. GDR can be accessed at http://www.genome.clemson.edu/gdr/. © 2004 Jung et al; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Abbott A."
                    },
                    {
                        "name": "Cho I."
                    },
                    {
                        "name": "Du Z."
                    },
                    {
                        "name": "Ficklin S."
                    },
                    {
                        "name": "Jesudurai C."
                    },
                    {
                        "name": "Jung S."
                    },
                    {
                        "name": "Main D."
                    },
                    {
                        "name": "Staton M."
                    },
                    {
                        "name": "Tomkins J."
                    }
                ],
                "citationCount": 75,
                "date": "2004-09-09T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "GDR (Genome Database for Rosaceae): Integrated web resources for Rosaceae genomics and genetics research"
            },
            "pmid": "15357877"
        },
        {
            "metadata": {
                "abstract": "The Genome Database for Rosaceae (GDR) is a central repository of curated and integrated genetics and genomics data of Rosaceae, an economically important family which includes apple, cherry, peach, pear, raspberry, rose and strawberry. GDR contains annotated databases of all publicly available Rosaceae ESTs, the genetically anchored peach physical map, Rosaceae genetic maps and comprehensively annotated markers and traits. The ESTs are assembled to produce unigene sets of each genus and the entire Rosaceae. Other annotations include putative function, microsatellites, open reading frames, single nucleotide polymorphisms, gene ontology terms and anchored map position where applicable. Most of the published Rosaceae genetic maps can be viewed and compared through CMap, the comparative map viewer. The peach physical map can be viewed using WebFPC/WebChrom, and also through our integrated GDR map viewer, which serves as a portal to the combined genetic, transcriptome and physical mapping information. ESTs, BACs, markers and traits can be queried by various categories and the search result sites are linked to the mapping visualization tools. GDR also provides online analysis tools such as a batch BLAST/FASTA server for the GDR datasets, a sequence assembly server and microsatellite and primer detection tools. GDR is available at http://www.rosaceae.org. © 2007 The Author(s).",
                "authors": [
                    {
                        "name": "Abbott A."
                    },
                    {
                        "name": "Blenda A."
                    },
                    {
                        "name": "Jung S."
                    },
                    {
                        "name": "Lee T."
                    },
                    {
                        "name": "Main D."
                    },
                    {
                        "name": "Staton M."
                    },
                    {
                        "name": "Svancara R."
                    }
                ],
                "citationCount": 161,
                "date": "2008-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "GDR (Genome Database for Rosaceae): Integrated web-database for Rosaceae genomics and genetics data"
            },
            "pmid": "17932055"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Physics",
            "uri": "http://edamontology.org/topic_3318"
        }
    ],
    "validated": 1
}
