{
    "additionDate": "2019-07-10T21:40:11Z",
    "biotoolsCURIE": "biotools:SURFY",
    "biotoolsID": "SURFY",
    "credit": [
        {
            "email": "ulrich.omasits@gmail.com",
            "name": "Ulrich Goldmann",
            "orcidid": "https://orcid.org/0000-0003-1120-6912",
            "typeEntity": "Person"
        }
    ],
    "description": "Visualize the human surface proteome (surfaceome) and load your own expression data to inspect and uncover cellular phenotypes and new surfaceome markers.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Gene expression matrix",
                        "uri": "http://edamontology.org/data_3112"
                    },
                    "format": [
                        {
                            "term": "TSV",
                            "uri": "http://edamontology.org/format_3475"
                        }
                    ]
                }
            ],
            "operation": [
                {
                    "term": "Treemap visualisation",
                    "uri": "http://edamontology.org/operation_2942"
                },
                {
                    "term": "Subcellular localisation prediction",
                    "uri": "http://edamontology.org/operation_2489"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Heat map",
                        "uri": "http://edamontology.org/data_1636"
                    },
                    "format": [
                        {
                            "term": "png",
                            "uri": "http://edamontology.org/format_3603"
                        }
                    ]
                }
            ]
        }
    ],
    "homepage": "http://wlab.ethz.ch/surfaceome/",
    "language": [
        "JavaScript"
    ],
    "lastUpdate": "2019-07-10T21:40:11Z",
    "name": "SURFY",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "ulo",
    "publication": [
        {
            "doi": "10.1073/pnas.1808790115",
            "metadata": {
                "abstract": "© 2018 National Academy of Sciences. All rights reserved.Cell-surface proteins are of great biomedical importance, as demonstrated by the fact that 66% of approved human drugs listed in the DrugBank database target a cell-surface protein. Despite this biomedical relevance, there has been no comprehensive assessment of the human surfaceome, and only a fraction of the predicted 5,000 human transmembrane proteins have been shown to be located at the plasma membrane. To enable analysis of the human surfaceome, we developed the surfaceome predictor SURFY, based on machine learning. As a training set, we used experimentally verified high-confidence cell-surface proteins from the Cell Surface Protein Atlas (CSPA) and trained a random forest classifier on 131 features per protein and, specifically, per topological domain. SURFY was used to predict a human surfaceome of 2,886 proteins with an accuracy of 93.5%, which shows excellent overlap with known cell-surface protein classes (i.e., receptors). In deposited mRNA data, we found that between 543 and 1,100 surfaceome genes were expressed in cancer cell lines and maximally 1,700 surfaceome genes were expressed in embryonic stem cells and derivative lines. Thus, the surfaceome diversity depends on cell type and appears to be more dynamic than the nonsurface proteome. To make the predicted surfaceome readily accessible to the research community, we provide visualization tools for intuitive interrogation (wlab.ethz.ch/surfaceome). The in silico surfaceome enables the filtering of data generated by multiomics screens and supports the elucidation of the surfaceome nanoscale organization.",
                "authors": [
                    {
                        "name": "Bausch-Fluck D."
                    },
                    {
                        "name": "Goldmann U."
                    },
                    {
                        "name": "Muller S."
                    },
                    {
                        "name": "van Oostrum M."
                    },
                    {
                        "name": "Muller M."
                    },
                    {
                        "name": "Schubert O.T."
                    },
                    {
                        "name": "Wollscheid B."
                    }
                ],
                "citationCount": 33,
                "date": "2018-11-13T00:00:00Z",
                "journal": "Proceedings of the National Academy of Sciences of the United States of America",
                "title": "The in silico human surfaceome"
            },
            "pmid": "30373828"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Protein targeting and localisation",
            "uri": "http://edamontology.org/topic_0140"
        }
    ],
    "validated": 1
}