
{
    "credit": [
        {
            "email": "support@lifemapsc.com",
            "name": "Support",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://www.genecards.org/Guide"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Service discovery",
                    "uri": "http://edamontology.org/operation_3761"
                },
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                }
            ]
        }
    ],
    "labels": {
        "accessibility": [
            "Open access"
        ],
        "collectionID": [
            "RD-connect",
            "Rare Disease"
        ],
        "cost": "Free of charge",
        "maturity": "Mature",
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web application",
            "Database portal"
        ],
        "topic": [
            {
                "term": "Human genetics",
                "uri": "http://edamontology.org/topic_3574"
            },
            {
                "term": "Molecular interactions, pathways and networks",
                "uri": "http://edamontology.org/topic_0602"
            },
            {
                "term": "Function analysis",
                "uri": "http://edamontology.org/topic_1775"
            },
            {
                "term": "Data integration and warehousing",
                "uri": "http://edamontology.org/topic_3366"
            }
        ]
    },
    "publication": [
        {
            "abstract": "",
            "authors": [
                "Rebhan M.",
                "Chalifa-Caspi V.",
                "Prilusky J.",
                "Lancet D."
            ],
            "cit_count": 270,
            "journal": "Trends in Genetics",
            "pmid": "9097728",
            "title": "GeneCards: Integrating information about genes, proteins and diseases",
            "type": "Primary",
            "year": "1997-01-01"
        },
        {
            "abstract": "Motivation: In the post-genomic era, functional analysis of genes requires a sophisticated interdisciplinary arsenal. Comprehensive resources are challenged to provide consistently improving, state-of-the-art tools. Results: GeneCards (Rebhan et al., 1998) has made innovative strides: (a) regular updates and enhancements incorporating new genes enriched with sequences, genomic locations, cDNA assemblies, orthologies, medical information, 3D protein structures, gene expression, and focused SNP summaries; (b) restructured software using object-oriented Perl, migration to schema-driven XML, and (c) pilot studies, introducing methods to produce cards for novel and predicted genes.",
            "authors": [
                "Safran M.",
                "Solomon I.",
                "Shmueli O.",
                "Lapidot M.",
                "Shen-Orr S.",
                "Adato A.",
                "Ben-Dor U.",
                "Esterman N.",
                "Rosen N.",
                "Peter I.",
                "Olender T.",
                "Chalifa-Caspi V.",
                "Lancet D."
            ],
            "cit_count": 121,
            "doi": "10.1093/bioinformatics/18.11.1542",
            "journal": "Bioinformatics",
            "pmid": "12424129",
            "title": "GeneCards™ 2002: Towards a complete, object-oriented, human gene compendium",
            "type": "Other",
            "year": "2002-11-01"
        },
        {
            "abstract": "Motivation: Modern biology is shifting from the 'one gene one postdoc' approach to genomic analyses that include the simultaneous monitoring of thousands of genes. The importance of efficient access to concise and integrated biomedical information to support data analysis and decision making is therefore increasing rapidly, in both academic and industrial research. However knowledge discovery in the widely scattered resources relevant for biomedical research is often a cumbersome and non-trivial task, one that requires a significant amount of training and effort. Results: To develop a model for a new type of topic-specific overview resource that provides efficient access to distributed information we designed a database called 'GeneCards'. It is a freely accessible Web resource that offers one hypertext (card) for each of the more than 7000 human genes that currently have an approved gene symbol published by the HUGO/GDB nomenclature committee. The presented information aims at giving immediate insight into current knowledge about the respective gene including a focus on its functions in health and disease. It is compiled by Perl scripts that automatically extract relevant information from several databases including SWISS-PROT, OMIM, Genatlas and GDB. Analyses of the interactions of users with the Web interface of GeneCards triggered development of easy-to-scan displays optimized for human browsing. Also, we developed algorithms that offer 'ready-to-click' query reformulation support to facilitate information retrieval and exploration. Many of the long-term users turn to GeneCards to quickly access information about the function of very large sets of genes, for example in the realm of large-scale expression studies using 'DNA chip' technology or two-dimensional protein ebectrophoresis. Availability: Freely available at http://bioinformatics.weizmann.ac.il/cards/ Contact: cards@@@bioinformatics.weizmann.ac.il.",
            "authors": [
                "Rebhan M.",
                "Chalifa-Caspi V.",
                "Prilusky J.",
                "Lancet D."
            ],
            "cit_count": 230,
            "doi": "10.1093/bioinformatics/14.8.656",
            "journal": "Bioinformatics",
            "pmid": "9789091",
            "title": "GeneCards: A novel functional genomics compendium with automated data mining and query reformulation support",
            "type": "Other",
            "year": "1998-11-17"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:genecards",
        "biotoolsID": "genecards",
        "description": "Database of human genes, their products, and involvement in diseases. It automatically integrates gene-centric data from ~150 web sources, including genomic, transcriptomic, proteomic, genetic, clinical and functional information.",
        "homepage": "http://www.genecards.org/",
        "name": "GeneCards"
    }
}