{
    "additionDate": "2021-01-18T07:28:22Z",
    "biotoolsCURIE": "biotools:flashdeconv",
    "biotoolsID": "flashdeconv",
    "confidence_flag": "tool",
    "description": "FLASHDeconv is an algorithm based on a simple transformation of mass spectra, which turns deconvolution into the search for constant patterns thus greatly accelerating the process. It is able to deconvulute MS1 and MS2 scans from top-down proteomics.",
    "download": [
        {
            "type": "Downloads page",
            "url": "https://abibuilder.informatik.uni-tuebingen.de/archive/openms/OpenMSInstaller/experimental/feature/FLASHDeconv/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Deisotoping",
                    "uri": "http://edamontology.org/operation_3629"
                },
                {
                    "term": "Peak detection",
                    "uri": "http://edamontology.org/operation_3215"
                },
                {
                    "term": "Mass spectra calibration",
                    "uri": "http://edamontology.org/operation_3627"
                }
            ]
        }
    ],
    "homepage": "https://www.openms.de/comp/flashdeconv/",
    "language": [
        "C++"
    ],
    "lastUpdate": "2021-03-11T09:36:42Z",
    "license": "BSD-3-Clause",
    "name": "FLASHDeconv",
    "operatingSystem": [
        "Mac",
        "Linux",
        "Windows"
    ],
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1016/J.CELS.2020.01.003",
            "metadata": {
                "abstract": "© 2020 The AuthorsTop-down mass spectrometry (TD-MS)-based proteomics analyzes intact proteins by their masses. As compared with bottom-up approaches in which proteins are digested and the resulting peptides are analyzed, TD-MS is capable of providing more information on preserved protein species. However, the spectral signal from high-mass protein species is highly complex and challenges the exact and efficient determination of the mass. Thus, accurate and rapid deconvolution (i.e., the determination of intact protein species masses) is a key step for further analysis, but current deconvolution methods often have runtime and quality issues. We present FLASHDeconv, an algorithm that resolves these issues by a simple yet elegant transformation of MS spectra, which turns the deconvolution problem into a simple pattern matching. FLASHDeconv shows higher deconvolution quality and an execution speed two orders of magnitude faster than other tools. © 2020 The AuthorsTop-down mass spectrometry (TD-MS)-based proteomics analyzes intact proteoforms and thus preserves information about individual protein species. The MS signal of these high-mass analytes is complex and challenges the accurate determination of proteoform masses. Fast and accurate feature deconvolution (i.e., the determination of intact proteoform masses) is, therefore, an essential step for TD data analysis. Here, we present FLASHDeconv, an algorithm achieving higher deconvolution quality, with an execution speed two orders of magnitude faster than existing approaches. FLASHDeconv transforms peak positions (m/z) within spectra into log m/z space. This simple transformation turns the deconvolution problem into a search for constant patterns, thereby greatly accelerating the process. In both simple and complex samples, FLASHDeconv reports more genuine feature masses and substantially fewer artifacts than other existing methods. FLASHDeconv is freely available for download here: https://www.openms.org/flashdeconv/. A record of this paper's Transparent Peer Review process is included in the Supplemental Information.",
                "authors": [
                    {
                        "name": "Jeong K."
                    },
                    {
                        "name": "Kim J."
                    },
                    {
                        "name": "Gaikwad M."
                    },
                    {
                        "name": "Hidayah S.N."
                    },
                    {
                        "name": "Heikaus L."
                    },
                    {
                        "name": "Schluter H."
                    },
                    {
                        "name": "Kohlbacher O."
                    }
                ],
                "citationCount": 3,
                "date": "2020-02-26T00:00:00Z",
                "journal": "Cell Systems",
                "title": "FLASHDeconv: Ultrafast, High-Quality Feature Deconvolution for Top-Down Proteomics"
            },
            "pmid": "32078799"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        }
    ],
    "version": [
        "2.0 beta"
    ]
}