{
    "additionDate": "2021-01-18T10:55:10Z",
    "biotoolsCURIE": "biotools:mapgl",
    "biotoolsID": "mapgl",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "adadiehl@umich.edu",
            "name": "Adam G. Diehl",
            "orcidid": "https://orcid.org/0000-0002-0915-4570",
            "typeEntity": "Person"
        }
    ],
    "description": "Inferring evolutionary gain and loss of short genomic sequence features by phylogenetic maximum parsimony.\n\nData Repository for \"MapGL: Inferring evolutionary gain and loss of short genomic sequence features by phylogenetic maximum parsimony.\".\n\nThis repository can be used to reproduce source data and results contributing to all figures and tables presented in:.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Ancestral reconstruction",
                    "uri": "http://edamontology.org/operation_3745"
                },
                {
                    "term": "Phylogenetic reconstruction",
                    "uri": "http://edamontology.org/operation_3478"
                },
                {
                    "term": "Phylogenetic tree construction (parsimony methods)",
                    "uri": "http://edamontology.org/operation_0545"
                }
            ]
        }
    ],
    "homepage": "https://github.com/adadiehl/mapGL",
    "language": [
        "Python",
        "R",
        "Shell"
    ],
    "lastUpdate": "2021-02-19T09:35:14Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/adadiehl/MapGL_analysis"
        }
    ],
    "name": "MapGL",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1186/S12859-020-03742-9",
            "metadata": {
                "abstract": "© 2020 The Author(s).Background: Comparative genomics studies are growing in number partly because of their unique ability to provide insight into shared and divergent biology between species. Of particular interest is the use of phylogenetic methods to infer the evolutionary history of cis-regulatory sequence features, which contribute strongly to phenotypic divergence and are frequently gained and lost in eutherian genomes. Understanding the mechanisms by which cis-regulatory element turnover generate emergent phenotypes is crucial to our understanding of adaptive evolution. Ancestral reconstruction methods can place species-specific cis-regulatory features in their evolutionary context, thus increasing our understanding of the process of regulatory sequence turnover. However, applying these methods to gain and loss of cis-regulatory features historically required complex workflows, preventing widespread adoption by the broad scientific community. Results: MapGL simplifies phylogenetic inference of the evolutionary history of short genomic sequence features by combining the necessary steps into a single piece of software with a simple set of inputs and outputs. We show that MapGL can reliably disambiguate the mechanisms underlying differential regulatory sequence content across a broad range of phylogenetic topologies and evolutionary distances. Thus, MapGL provides the necessary context to evaluate how genomic sequence gain and loss contribute to species-specific divergence. Conclusions: MapGL makes phylogenetic inference of species-specific sequence gain and loss easy for both expert and non-expert users, making it a powerful tool for gaining novel insights into genome evolution.",
                "authors": [
                    {
                        "name": "Boyle A.P."
                    },
                    {
                        "name": "Diehl A.G."
                    }
                ],
                "date": "2020-09-22T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "MapGL: Inferring evolutionary gain and loss of short genomic sequence features by phylogenetic maximum parsimony"
            },
            "pmcid": "PMC7510305",
            "pmid": "32962625"
        }
    ],
    "toolType": [
        "Command-line tool",
        "Library"
    ],
    "topic": [
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Paleogenomics",
            "uri": "http://edamontology.org/topic_3943"
        },
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ]
}
