{
    "additionDate": "2021-12-06T14:29:11.353310Z",
    "biotoolsCURIE": "biotools:ta-net",
    "biotoolsID": "ta-net",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "shuchao.pang@hdr.mq.edu.au",
            "name": "Shuchao Pang",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "zhenmei_yu@sdwu.edu.cn",
            "name": "Zhenmei Yu",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "TA-Net is a tool for better feature selection, better tumor segmentation.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Feature selection",
                    "uri": "http://edamontology.org/operation_3936"
                },
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://github.com/shuchao1212/TA-Net",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-12-06T14:29:11.355849Z",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/shuchao1212/TA-Net/issues"
        }
    ],
    "name": "TA-Net",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1016/J.NEUNET.2021.03.006",
            "metadata": {
                "abstract": "© 2021 Elsevier LtdCompared with the traditional analysis of computed tomography scans, automatic liver tumor segmentation can supply precise tumor volumes and reduce the inter-observer variability in estimating the tumor size and the tumor burden, which could further assist physicians to make better therapeutic choices for hepatic diseases and monitoring treatment. Among current mainstream segmentation approaches, multi-layer and multi-kernel convolutional neural networks (CNNs) have attracted much attention in diverse biomedical/medical image segmentation tasks with remarkable performance. However, an arbitrary stacking of feature maps makes CNNs quite inconsistent in imitating the cognition and the visual attention of human beings for a specific visual task. To mitigate the lack of a reasonable feature selection mechanism in CNNs, we exploit a novel and effective network architecture, called Tumor Attention Networks (TA-Net), for mining adaptive features by embedding Tumor Attention layers with multi-functional modules to assist the liver tumor segmentation task. In particular, each tumor attention layer can adaptively highlight valuable tumor features and suppress unrelated ones among feature maps from 3D and 2D perspectives. Moreover, an analysis of visualization results illustrates the effectiveness of our tumor attention modules and the interpretability of CNNs for liver tumor segmentation. Furthermore, we explore different arrangements of skip connections in information fusion. A deep ablation study is also conducted to illustrate the effects of different attention strategies for hepatic tumors. The results of extensive experiments demonstrate that the proposed TA-Net increases the liver tumor segmentation performance with a lower computation cost and a small parameter overhead over the state-of-the-art methods, under various evaluation metrics on clinical benchmark data. In addition, two additional medical image datasets are used to evaluate generalization capability of TA-Net, including the comparison with general semantic segmentation methods and a non-tumor segmentation task. All the program codes have been released at https://github.com/shuchao1212/TA-Net.",
                "authors": [
                    {
                        "name": "Du A."
                    },
                    {
                        "name": "Orgun M.A."
                    },
                    {
                        "name": "Pang S."
                    },
                    {
                        "name": "Wang Y."
                    },
                    {
                        "name": "Yu Z."
                    }
                ],
                "date": "2021-08-01T00:00:00Z",
                "journal": "Neural Networks",
                "title": "Tumor attention networks: Better feature selection, better tumor segmentation"
            },
            "pmid": "33780873",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        },
        {
            "term": "Tomography",
            "uri": "http://edamontology.org/topic_3452"
        }
    ]
}
