
{
    "credit": [
        {
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "https://github.com/ewijaya"
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "https://github.com/ewijaya/slidesort-bpr"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence comparison",
                    "uri": "http://edamontology.org/operation_2451"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "C++"
        ],
        "operatingSystem": [
            "Linux"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "DNA",
                "uri": "http://edamontology.org/topic_0654"
            },
            {
                "term": "Sequence analysis",
                "uri": "http://edamontology.org/topic_0080"
            },
            {
                "term": "Oncology",
                "uri": "http://edamontology.org/topic_2640"
            },
            {
                "term": "Sequencing",
                "uri": "http://edamontology.org/topic_3168"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://www.mybiosoftware.com/slidesort-bpr-v2-finding-differences-between-multiple-short-read-datasets-without-reference-genome.html"
        }
    ],
    "publication": [
        {
            "abstract": "© 2014 The Author.Availability and implementation: The source code of SlideSort-BPRcan be freely downloaded from https://code.google.com/p/slidesortbpr/.Motivation: Chromosome rearrangement events are triggered by atypical breaking and rejoining of DNA molecules, which are observed in many cancer-related diseases. The detection of rearrangement is typically done by using short reads generated by next-generation sequencing (NGS) and combining the reads with knowledge of a reference genome. Because structural variations and genomes differ from one person to another, intermediate comparison via a reference genome may lead to loss of information.Results: In this article, we propose a reference-free method for detecting clusters of breakpoints from the chromosomal rearrangements. This is done by directly comparing a set of NGS normal reads with another set that may be rearranged. Our method SlideSort-BPR (breakpoint reads) is based on a fast algorithm for all-against-all comparisons of short reads and theoretical analyses of the number of neighboring reads. When applied to a dataset with a sequencing depth of 100×, it finds ∼88% of the breakpoints correctly with no false-positive reads. Moreover, evaluation on a real prostate cancer dataset shows that the proposed method predicts more fusion transcripts correctly than previous approaches, and yet produces fewer false-positive reads. To our knowledge, this is the first method to detect breakpoint reads without using a reference genome.",
            "authors": [
                "Wijaya E.",
                "Shimizu K.",
                "Asai K.",
                "Hamada M."
            ],
            "cit_count": 4,
            "journal": "Bioinformatics",
            "pmid": "24876376",
            "title": "Reference-free prediction of rearrangement breakpoint reads",
            "year": "2014-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:slidesort-bpr",
        "biotoolsID": "slidesort-bpr",
        "description": "The tool is based on a fast algorithm for all-against-all comparisons of short reads and theoretical analyses of the number of neighboring reads.",
        "homepage": "https://github.com/ewijaya/slidesort-bpr",
        "name": "SlideSort-BPR"
    }
}