
{
    "credit": [
        {
            "name": "cre]",
            "typeEntity": "Person",
            "typeRoles": [
                "Developer"
            ]
        },
        {
            "name": "Andrew Beck [aut]",
            "typeEntity": "Person",
            "typeRoles": [
                "Developer"
            ]
        },
        {
            "name": "Benjamin Haibe-Kains [aut]",
            "typeEntity": "Person",
            "typeRoles": [
                "Developer"
            ]
        },
        {
            "name": "Daniel Schmolze [aut",
            "typeEntity": "Person",
            "typeRoles": [
                "Developer"
            ]
        },
        {
            "name": "BioConductor",
            "typeEntity": "Institute",
            "typeRoles": [
                "Provider"
            ]
        },
        {
            "email": "saps@schmolze.com",
            "name": "Daniel Schmolze",
            "typeRoles": [
                "Support"
            ]
        },
        {
            "email": "saps@schmolze.com",
            "name": "Daniel Schmolze",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://bioconductor.org/packages/release/bioc/html/saps.html"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Gene set testing",
                    "uri": "http://edamontology.org/operation_3224"
                }
            ]
        }
    ],
    "labels": {
        "collectionID": [
            "Bioconductor"
        ],
        "cost": "Free of charge",
        "language": [
            "R"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Genetics",
                "uri": "http://edamontology.org/topic_3053"
            },
            {
                "term": "Pathology",
                "uri": "http://edamontology.org/topic_0634"
            },
            {
                "term": "Statistics and probability",
                "uri": "http://edamontology.org/topic_2269"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://bioconductor.org/"
        }
    ],
    "publication": [
        {
            "abstract": "A major goal in translational cancer research is to identify biological signatures driving cancer progression and metastasis. A common technique applied in genomics research is to cluster patients using gene expression data from a candidate prognostic gene set, and if the resulting clusters show statistically significant outcome stratification, to associate the gene set with prognosis, suggesting its biological and clinical importance. Recent work has questioned the validity of this approach by showing in several breast cancer data sets that \"random\" gene sets tend to cluster patients into prognostically variable subgroups. This work suggests that new rigorous statistical methods are needed to identify biologically informative prognostic gene sets. To address this problem, we developed Significance Analysis of Prognostic Signatures (SAPS) which integrates standard prognostic tests with a new prognostic significance test based on stratifying patients into prognostic subtypes with random gene sets. SAPS ensures that a significant gene set is not only able to stratify patients into prognostically variable groups, but is also enriched for genes showing strong univariate associations with patient prognosis, and performs significantly better than random gene sets. We use SAPS to perform a large meta-analysis (the largest completed to date) of prognostic pathways in breast and ovarian cancer and their molecular subtypes. Our analyses show that only a small subset of the gene sets found statistically significant using standard measures achieve significance by SAPS. We identify new prognostic signatures in breast and ovarian cancer and their corresponding molecular subtypes, and we show that prognostic signatures in ER negative breast cancer are more similar to prognostic signatures in ovarian cancer than to prognostic signatures in ER positive breast cancer. SAPS is a powerful new method for deriving robust prognostic biological signatures from clinically annotated genomic datasets. © 2013 Beck et al.",
            "authors": [
                "Beck A.H.",
                "Knoblauch N.W.",
                "Hefti M.M.",
                "Kaplan J.",
                "Schnitt S.J.",
                "Culhane A.C.",
                "Schroeder M.S.",
                "Risch T.",
                "Quackenbush J.",
                "Haibe-Kains B."
            ],
            "cit_count": 20,
            "doi": "10.1371/journal.pcbi.1002875",
            "journal": "PLoS Computational Biology",
            "title": "Significance Analysis of Prognostic Signatures",
            "type": "Primary",
            "year": "2013-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:saps",
        "biotoolsID": "saps",
        "description": "Functions implementing the Significance Analysis of Prognostic Signatures method that provides a robust method for identifying biologically significant gene sets associated with patient survival. Three basic statistics are computed: P_pure, P_random and a pre-ranked Gene Set Enrichment Analysis (GSEA). A score is calculated to summarize the three statistics, and optionally a Q-value is computed to estimate the significance.",
        "homepage": "https://www.bioconductor.org/packages/3.2/bioc/html/saps.html",
        "name": "saps",
        "version": [
            "2.2.0"
        ]
    }
}