{
    "additionDate": "2021-01-18T10:52:19Z",
    "biotoolsCURIE": "biotools:twadn",
    "biotoolsID": "twadn",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "jhu@nwpu.edu.cn",
            "name": "Jialu Hu",
            "typeEntity": "Person"
        }
    ],
    "description": "an efficient alignment algorithm based on time warping for pairwise dynamic networks.\n\nTime wrapping algorithm for aligning dynamic networks.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Pairwise sequence alignment",
                    "uri": "http://edamontology.org/operation_0491"
                },
                {
                    "term": "Metabolic network modelling",
                    "uri": "http://edamontology.org/operation_3660"
                },
                {
                    "term": "Protein interaction network prediction",
                    "uri": "http://edamontology.org/operation_3094"
                }
            ]
        }
    ],
    "homepage": "https://github.com/screamer/twadn",
    "language": [
        "C++",
        "Python"
    ],
    "lastUpdate": "2021-03-06T14:12:26Z",
    "name": "Twadn",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1186/S12859-020-03672-6",
            "metadata": {
                "abstract": "© 2020 The Author(s).Background: Network alignment is an efficient computational framework in the prediction of protein function and phylogenetic relationships in systems biology. However, most of existing alignment methods focus on aligning PPIs based on static network model, which are actually dynamic in real-world systems. The dynamic characteristic of PPI networks is essential for understanding the evolution and regulation mechanism at the molecular level and there is still much room to improve the alignment quality in dynamic networks. Results: In this paper, we proposed a novel alignment algorithm, Twadn, to align dynamic PPI networks based on a strategy of time warping. We compare Twadn with the existing dynamic network alignment algorithm DynaMAGNA++ and DynaWAVE and use area under the receiver operating characteristic curve and area under the precision-recall curve as evaluation indicators. The experimental results show that Twadn is superior to DynaMAGNA++ and DynaWAVE. In addition, we use protein interaction network of Drosophila to compare Twadn and the static network alignment algorithm NetCoffee2 and experimental results show that Twadn is able to capture timing information compared to NetCoffee2. Conclusions: Twadn is a versatile and efficient alignment tool that can be applied to dynamic network. Hopefully, its application can benefit the research community in the fields of molecular function and evolution.",
                "authors": [
                    {
                        "name": "Zhong Y."
                    },
                    {
                        "name": "Li J."
                    },
                    {
                        "name": "He J."
                    },
                    {
                        "name": "Gao Y."
                    },
                    {
                        "name": "Liu J."
                    },
                    {
                        "name": "Wang J."
                    },
                    {
                        "name": "Shang X."
                    },
                    {
                        "name": "Hu J."
                    }
                ],
                "date": "2020-09-17T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Twadn: An efficient alignment algorithm based on time warping for pairwise dynamic networks"
            },
            "pmcid": "PMC7495832",
            "pmid": "32938373"
        }
    ],
    "topic": [
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "Evolutionary biology",
            "uri": "http://edamontology.org/topic_3299"
        },
        {
            "term": "Zoology",
            "uri": "http://edamontology.org/topic_3500"
        }
    ]
}