{
    "additionDate": "2021-12-10T12:35:24.848978Z",
    "biotoolsCURIE": "biotools:addtag",
    "biotoolsID": "addtag",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "cnobile@ucmerced.edu",
            "name": "Clarissa J Nobile",
            "orcidid": "https://orcid.org/0000-0003-0799-6499",
            "typeEntity": "Person"
        },
        {
            "email": "ssindi@ucmerced.edu",
            "name": "Suzanne S Sindi",
            "typeEntity": "Person"
        },
        {
            "email": "ahernday@ucmerced.edu",
            "name": "Aaron D Hernday",
            "orcidid": "https://orcid.org/0000-0002-9351-7150",
            "typeEntity": "Person"
        }
    ],
    "description": "AddTag is a two-step approach with supporting software package that facilitates CRISPR/Cas-mediated precision genome editing.\n\nCRISPR Cas-induced genome editing is a powerful tool for genetic engineering, however, targeting constraints limit which loci are editable with this method. Since the length of a DNA sequence impacts the likelihood it overlaps a unique target site, precision editing of small genomic features with CRISPR Cas remains an obstacle. We introduce a two-step genome editing strategy that virtually eliminates CRISPR Cas targeting constraints and facilitates precision genome editing of elements as short as a single base-pair at virtually any locus in any organism that supports CRISPR Cas-induced genome editing. Our two-step approach first replaces the locus of interest with an \"AddTag\" sequence, which is subsequently replaced with any engineered sequence, and thus circumvents the need for direct overlap with a unique CRISPR Cas target site.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Editing",
                    "uri": "http://edamontology.org/operation_3096"
                },
                {
                    "term": "Scaffolding",
                    "uri": "http://edamontology.org/operation_3216"
                },
                {
                    "term": "PCR primer design",
                    "uri": "http://edamontology.org/operation_0308"
                }
            ]
        }
    ],
    "homepage": "https://github.com/tdseher/addtag-project",
    "lastUpdate": "2021-12-10T12:35:24.851720Z",
    "license": "AGPL-3.0",
    "name": "AddTag",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1093/G3JOURNAL/JKAB216",
            "metadata": {
                "abstract": "© The Author(s) 2021. Published by Oxford University Press on behalf of Genetics Society of America.CRISPR/Cas-induced genome editing is a powerful tool for genetic engineering, however, targeting constraints limit which loci are editable with this method. Since the length of a DNA sequence impacts the likelihood it overlaps a unique target site, precision editing of small genomic features with CRISPR/Cas remains an obstacle. We introduce a two-step genome editing strategy that virtually eliminates CRISPR/Cas targeting constraints and facilitates precision genome editing of elements as short as a single base-pair at virtually any locus in any organism that supports CRISPR/Cas-induced genome editing. Our two-step approach first replaces the locus of interest with an “AddTag” sequence, which is subsequently replaced with any engineered sequence, and thus circumvents the need for direct overlap with a unique CRISPR/Cas target site. In this study, we demonstrate the feasibility of our approach by editing transcription factor binding sites within Candida albicans that could not be targeted directly using the traditional gene-editing approach. We also demonstrate the utility of the AddTag approach for combinatorial genome editing and gene complementation analysis, and we present a software package that automates the design of AddTag editing.",
                "authors": [
                    {
                        "name": "Seher T.D."
                    },
                    {
                        "name": "Nguyen N."
                    },
                    {
                        "name": "Ramos D."
                    },
                    {
                        "name": "Bapat P."
                    },
                    {
                        "name": "Nobile C.J."
                    },
                    {
                        "name": "Sindi S."
                    },
                    {
                        "name": "Hernday A.D."
                    }
                ],
                "date": "2021-01-01T00:00:00Z",
                "journal": "G3: Genes, Genomes, Genetics",
                "title": "AddTag, a two-step approach with supporting software package that facilitates CRISPR/Cas-mediated precision genome editing"
            },
            "pmcid": "PMC8496238",
            "pmid": "34544122"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Genetic engineering",
            "uri": "http://edamontology.org/topic_3912"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        }
    ]
}