{
    "accessibility": "Open access",
    "additionDate": "2021-11-15T12:04:21.879658Z",
    "biotoolsCURIE": "biotools:aiap",
    "biotoolsID": "aiap",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "bzhang29@wustl.edu",
            "name": "Bo Zhang"
        }
    ],
    "description": "A Quality Control and Integrative Analysis Package to Improve ATAC-seq Data Analysis.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Peak calling",
                    "uri": "http://edamontology.org/operation_3222"
                },
                {
                    "term": "Sequencing quality control",
                    "uri": "http://edamontology.org/operation_3218"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Zhang-lab/ATAC-seq_QC_analysis",
    "language": [
        "Python",
        "R",
        "Shell"
    ],
    "lastUpdate": "2024-11-24T20:16:26.067921Z",
    "name": "AIAP",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1016/j.gpb.2020.06.025",
            "metadata": {
                "abstract": "Assay for transposase-accessible chromatin with high-throughput sequencing (ATAC-seq) is a technique widely used to investigate genome-wide chromatin accessibility. The recently published Omni-ATAC-seq protocol substantially improves the signal/noise ratio and reduces the input cell number. High-quality data are critical to ensure accurate analysis. Several tools have been developed for assessing sequencing quality and insertion size distribution for ATAC-seq data; however, key quality control (QC) metrics have not yet been established to accurately determine the quality of ATAC-seq data. Here, we optimized the analysis strategy for ATAC-seq and defined a series of QC metrics for ATAC-seq data, including reads under peak ratio (RUPr), background (BG), promoter enrichment (ProEn), subsampling enrichment (SubEn), and other measurements. We incorporated these QC tests into our recently developed ATAC-seq Integrative Analysis Package (AIAP) to provide a complete ATAC-seq analysis system, including quality assurance, improved peak calling, and downstream differential analysis. We demonstrated a significant improvement of sensitivity (20%–60%) in both peak calling and differential analysis by processing paired-end ATAC-seq datasets using AIAP. AIAP is compiled into Docker/Singularity, and it can be executed by one command line to generate a comprehensive QC report. We used ENCODE ATAC-seq data to benchmark and generate QC recommendations, and developed qATACViewer for the user-friendly interaction with the QC report. The software, source code, and documentation of AIAP are freely available at https://github.com/Zhang-lab/ATAC-seq_QC_analysis.",
                "authors": [
                    {
                        "name": "Gontarz P.M."
                    },
                    {
                        "name": "Li D."
                    },
                    {
                        "name": "Liu S."
                    },
                    {
                        "name": "Lyu C."
                    },
                    {
                        "name": "Madden P.A.F."
                    },
                    {
                        "name": "Miao B."
                    },
                    {
                        "name": "Wang T."
                    },
                    {
                        "name": "Zhang B."
                    }
                ],
                "citationCount": 19,
                "date": "2021-08-01T00:00:00Z",
                "journal": "Genomics, Proteomics and Bioinformatics",
                "title": "AIAP: A Quality Control and Integrative Analysis Package to Improve ATAC-seq Data Analysis"
            },
            "pmcid": "PMC9040017",
            "pmid": "34273560"
        }
    ],
    "toolType": [
        "Workbench"
    ],
    "topic": [
        {
            "term": "Chromosome conformation capture",
            "uri": "http://edamontology.org/topic_3940"
        },
        {
            "term": "Quality affairs",
            "uri": "http://edamontology.org/topic_3393"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ],
    "validated": 1
}
