{
    "additionDate": "2018-07-29T15:16:35Z",
    "biotoolsCURIE": "biotools:famplex",
    "biotoolsID": "famplex",
    "credit": [
        {
            "email": "peter_sorger@hms.harvard.edu",
            "name": "Peter K. Sorger",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "It is an effective resource for improving named entity recognition, grounding, and relationship resolution in automated reading of biomedical text.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/sorgerlab/famplex/blob/master/README.md"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Named-entity recognition",
                    "uri": "http://edamontology.org/operation_3280"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Event extraction",
                    "uri": "http://edamontology.org/operation_3280"
                }
            ]
        }
    ],
    "homepage": "https://github.com/sorgerlab/famplex",
    "language": [
        "Python"
    ],
    "lastUpdate": "2018-12-10T12:59:00Z",
    "license": "CC0-1.0",
    "name": "FamPlex",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "shadi.m",
    "publication": [
        {
            "doi": "10.1186/s12859-018-2211-5",
            "metadata": {
                "abstract": "© 2018 The Author(s).Background: For automated reading of scientific publications to extract useful information about molecular mechanisms it is critical that genes, proteins and other entities be correctly associated with uniform identifiers, a process known as named entity linking or \"grounding.\" Correct grounding is essential for resolving relationships among mined information, curated interaction databases, and biological datasets. The accuracy of this process is largely dependent on the availability of machine-readable resources associating synonyms and abbreviations commonly found in biomedical literature with uniform identifiers. Results: In a task involving automated reading of 215,000 articles using the REACH event extraction software we found that grounding was disproportionately inaccurate for multi-protein families (e.g., \"AKT\") and complexes with multiple subunits (e.g.\"NF- ΚB\"). To address this problem we constructed FamPlex, a manually curated resource defining protein families and complexes as they are commonly encountered in biomedical text. In FamPlex the gene-level constituents of families and complexes are defined in a flexible format allowing for multi-level, hierarchical membership. To create FamPlex, text strings corresponding to entities were identified empirically from literature and linked manually to uniform identifiers; these identifiers were also mapped to equivalent entries in multiple related databases. FamPlex also includes curated prefix and suffix patterns that improve named entity recognition and event extraction. Evaluation of REACH extractions on a test corpus of 54,000 articles showed that FamPlex significantly increased grounding accuracy for families and complexes (from 15 to 71%). The hierarchical organization of entities in FamPlex also made it possible to integrate otherwise unconnected mechanistic information across families, subfamilies, and individual proteins. Applications of FamPlex to the TRIPS/DRUM reading system and the Biocreative VI Bioentity Normalization Task dataset demonstrated the utility of FamPlex in other settings. Conclusion: FamPlex is an effective resource for improving named entity recognition, grounding, and relationship resolution in automated reading of biomedical text. The content in FamPlex is available in both tabular and Open Biomedical Ontology formats at https://github.com/sorgerlab/famplexunder the Creative Commons CC0 license and has been integrated into the TRIPS/DRUM and REACH reading systems.",
                "authors": [
                    {
                        "name": "Bachman J.A."
                    },
                    {
                        "name": "Gyori B.M."
                    },
                    {
                        "name": "Sorger P.K."
                    }
                ],
                "date": "2018-06-28T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "FamPlex: A resource for entity recognition and relationship resolution of human protein families and complexes in biomedical text mining"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Data mining",
            "uri": "http://edamontology.org/topic_3473"
        },
        {
            "term": "Protein families",
            "uri": "http://edamontology.org/topic_0623"
        },
        {
            "term": "Natural language processing",
            "uri": "http://edamontology.org/topic_0218"
        }
    ],
    "validated": 1
}