{
    "additionDate": "2015-01-22T11:45:52Z",
    "biotoolsCURIE": "biotools:pespotdb",
    "biotoolsID": "pespotdb",
    "collectionID": [
        "Proteomics"
    ],
    "credit": [
        {
            "name": "Stefano Costa",
            "typeEntity": "Person",
            "typeRole": [
                "Developer"
            ]
        },
        {
            "name": "Martina Carducci",
            "typeRole": [
                "Contributor"
            ]
        },
        {
            "name": "Michele Tinti",
            "typeRole": [
                "Contributor"
            ]
        },
        {
            "name": "Molecular Genetic Group, University of Rome \"Tor Vergata\", Rome, Italy",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        },
        {
            "name": "ELIXIR-ITA-TORVERGATA",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        },
        {
            "email": "cesareni@uniroma2.it",
            "name": "Gianni Cesareni",
            "orcidid": "http://orcid.org/0000-0002-9528-6018",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Web resource designed to provide a central repository for the storage and the analysis of data on domain peptide recognition obtained with interaction assays exploiting peptide chip technology.",
    "editPermission": {
        "authors": [
            "proteomics.bio.tools"
        ],
        "type": "group"
    },
    "function": [
        {
            "note": "Peptide identification",
            "operation": [
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                },
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                }
            ]
        },
        {
            "note": "Protein interactions",
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                }
            ]
        }
    ],
    "homepage": "http://mint.bio.uniroma2.it/PepspotDB",
    "lastUpdate": "2019-03-26T08:31:30Z",
    "name": "PespotDB",
    "owner": "ELIXIR-ITA-TORVERGATA",
    "publication": [
        {
            "doi": "10.1016/j.celrep.2013.03.001",
            "pmcid": "PMC4110347",
            "pmid": "23545499",
            "type": "Primary"
        },
        {
            "metadata": {
                "abstract": "Families of conserved protein domains, specialized in mediating interactions with short linear peptide motifs, are responsible for the formation of a variety of dynamic complexes in the cell. An important subclass of these motifs are characterized by a high proline content and play a pivotal role in biological processes requiring the coordinated assembly of multi-protein complexes. This is achieved via interaction of proteins containing modules such as Src Homology-3 (SH3) or WW domains and specific proline rich patterns. Here we make available via a publicly accessible database a synopsis of our current understanding of the interaction landscape of the human SH3 protein family. This is achieved by integrating an information extraction strategy with a new experimental approach. In a first approach we have used a text mining strategy to capture a large number of manuscripts reporting interactions between SH3 domains and target peptides. Relevant information was annotated in the MINT database. In a second experimental approach we have used a variant of the WISE (Whole Interactome Scanning Experiment) strategy to probe a large number of naturally occurring and chemically-synthesized peptides arrayed at high density on a glass surface. By this method we have tested 60 human SH3 domains for their ability to bind a collection of 9192 poly-proline containing peptides immobilized on a glass chip. To evaluate the quality of the resulting interaction dataset, we retested some of the interactions on a smaller scale and performed a series of pull down experiments on native proteins. Peptide chips, pull down assays, SPOT synthesis and phage display experiments have allowed us to further characterize the specificity and promiscuity of proline-rich binding domains and to map their interaction network. Both the information captured from the literature and the interactions inferred from the peptide chip experiments were collected and stored in the PepspotDB (http://mint.bio.uniroma2.it/PepspotDB/). © 2011 Elsevier Inc.",
                "authors": [
                    {
                        "name": "Carducci M."
                    },
                    {
                        "name": "Perfetto L."
                    },
                    {
                        "name": "Briganti L."
                    },
                    {
                        "name": "Paoluzi S."
                    },
                    {
                        "name": "Costa S."
                    },
                    {
                        "name": "Zerweck J."
                    },
                    {
                        "name": "Schutkowski M."
                    },
                    {
                        "name": "Castagnoli L."
                    },
                    {
                        "name": "Cesareni G."
                    }
                ],
                "citationCount": 28,
                "date": "2012-01-01T00:00:00Z",
                "journal": "Biotechnology Advances",
                "title": "The protein interaction network mediated by human SH3 domains"
            },
            "pmid": "21740962",
            "type": "Other"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        }
    ]
}