{
    "accessibility": "Open access",
    "additionDate": "2022-11-08T08:05:23.661837Z",
    "biotoolsCURIE": "biotools:kludo",
    "biotoolsID": "kludo",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "ch-eslahchi@sbu.ac.ir",
            "name": "Changiz Eslahchi",
            "typeEntity": "Person"
        }
    ],
    "description": "KluDo (Diffusion Kernel-based Graph Node Clustering for Protein Domain Assignment), is an automatic framework that incorporates diffusion kernels on protein graphs as affinity measures between residues to decompose protein structures into structural domains.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "Fold recognition",
                    "uri": "http://edamontology.org/operation_0303"
                },
                {
                    "term": "Protein peeling",
                    "uri": "http://edamontology.org/operation_0390"
                },
                {
                    "term": "Protein structure assignment",
                    "uri": "http://edamontology.org/operation_0320"
                },
                {
                    "term": "Protein structure validation",
                    "uri": "http://edamontology.org/operation_0321"
                }
            ]
        }
    ],
    "homepage": "https://github.com/taherimo/kludo",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T15:22:00.491464Z",
    "license": "MIT",
    "name": "kludo",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1186/s12859-022-04902-9",
            "metadata": {
                "abstract": "Though proposing algorithmic approaches for protein domain decomposition has been of high interest, the inherent ambiguity to the problem makes it still an active area of research. Besides, accurate automated methods are in high demand as the number of solved structures for complex proteins is on the rise. While majority of the previous efforts for decomposition of 3D structures are centered on the developing clustering algorithms, employing enhanced measures of proximity between the amino acids has remained rather uncharted. If there exists a kernel function that in its reproducing kernel Hilbert space, structural domains of proteins become well separated, then protein structures can be parsed into domains without the need to use a complex clustering algorithm. Inspired by this idea, we developed a protein domain decomposition method based on diffusion kernels on protein graphs. We examined all combinations of four graph node kernels and two clustering algorithms to investigate their capability to decompose protein structures. The proposed method is tested on five of the most commonly used benchmark datasets for protein domain assignment plus a comprehensive non-redundant dataset. The results show a competitive performance of the method utilizing one of the diffusion kernels compared to four of the best automatic methods. Our method is also able to offer alternative partitionings for the same structure which is in line with the subjective definition of protein domain. With a competitive accuracy and balanced performance for the simple and complex structures despite relying on a relatively naive criterion to choose optimal decomposition, the proposed method revealed that diffusion kernels on graphs in particular, and kernel functions in general are promising measures to facilitate parsing proteins into domains and performing different structural analysis on proteins. The size and interconnectedness of the protein graphs make them promising targets for diffusion kernels as measures of affinity between amino acids. The versatility of our method allows the implementation of future kernels with higher performance. The source code of the proposed method is accessible at https://github.com/taherimo/kludo. Also, the proposed method is available as a web application from https://cbph.ir/tools/kludo.",
                "authors": [
                    {
                        "name": "Eslahchi C."
                    },
                    {
                        "name": "Shariatpanahi S.P."
                    },
                    {
                        "name": "Taheri-Ledari M."
                    },
                    {
                        "name": "Zandieh A."
                    }
                ],
                "citationCount": 1,
                "date": "2022-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Assignment of structural domains in proteins using diffusion kernels on graphs"
            },
            "pmcid": "PMC9461149",
            "pmid": "36076174"
        }
    ],
    "toolType": [
        "Command-line tool",
        "Script"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Protein folds and structural domains",
            "uri": "http://edamontology.org/topic_0736"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ],
    "validated": 1
}
