{
    "accessibility": "Open access",
    "additionDate": "2022-05-15T11:16:57.574139Z",
    "biotoolsCURIE": "biotools:cvd",
    "biotoolsID": "cvd",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "Alvina.lai@ucl.ac.uk",
            "name": "Alvina G. Lai",
            "orcidid": "https://orcid.org/0000-0001-8960-8095",
            "typeEntity": "Person"
        },
        {
            "name": "Graham R. Foster"
        },
        {
            "name": "Sheng-Chia Chung"
        },
        {
            "name": "Stefanie H. Mueller"
        },
        {
            "name": "Wai Hoong Chang"
        }
    ],
    "description": "Incidence and risk of CVD in people with liver disease",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                }
            ]
        }
    ],
    "homepage": "https://lailab.shinyapps.io/cvd_in_liver_disease/",
    "lastUpdate": "2022-05-15T11:16:57.577443Z",
    "name": "CVD",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1186/s12967-021-03210-9",
            "metadata": {
                "abstract": "© 2021, The Author(s).Background: People with liver disease are at increased risk of developing cardiovascular disease (CVD), however, there has yet been an investigation of incidence burden, risk, and premature mortality across a wide range of liver conditions and cardiovascular outcomes. Methods: We employed population-wide electronic health records (EHRs; from 1998 to 2020) consisting of almost 4 million adults to assess regional variations in disease burden of five liver conditions, alcoholic liver disease (ALD), autoimmune liver disease, chronic hepatitis B infection (HBV), chronic hepatitis C infection (HCV) and NAFLD, in England. We analysed regional differences in incidence rates for 17 manifestations of CVD in people with or without liver disease. The associations between biomarkers and comorbidities and risk of CVD in patients with liver disease were estimated using Cox models. For each liver condition, we estimated excess years of life lost (YLL) attributable to CVD (i.e., difference in YLL between people with or without CVD). Results: The age-standardised incidence rate for any liver disease was 114.5 per 100,000 person years. The highest incidence was observed in NAFLD (85.5), followed by ALD (24.7), HCV (6.0), HBV (4.1) and autoimmune liver disease (3.7). Regionally, the North West and North East regions consistently exhibited high incidence burden. Age-specific incidence rate analyses revealed that the peak incidence for liver disease of non-viral aetiology is reached in individuals aged 50–59 years. Patients with liver disease had a two-fold higher incidence burden of CVD (2634.6 per 100,000 persons) compared to individuals without liver disease (1339.7 per 100,000 persons). When comparing across liver diseases, atrial fibrillation was the most common initial CVD presentation while hypertrophic cardiomyopathy was the least common. We noted strong positive associations between body mass index and current smoking and risk of CVD. Patients who also had diabetes, hypertension, proteinuric kidney disease, chronic kidney disease, diverticular disease and gastro-oesophageal reflex disorders had a higher risk of CVD, as do patients with low albumin, raised C-reactive protein and raised International Normalized Ratio levels. All types of CVD were associated with shorter life expectancies. When evaluating excess YLLs by age of CVD onset and by liver disease type, differences in YLLs, when comparing across CVD types, were more pronounced at younger ages. Conclusions: We developed a public online app (https://lailab.shinyapps.io/cvd_in_liver_disease/) to showcase results interactively. We provide a blueprint that revealed previously underappreciated clinical factors related to the risk of CVD, which differed in the magnitude of effects across liver diseases. We found significant geographical variations in the burden of liver disease and CVD, highlighting the need to devise local solutions. Targeted policies and regional initiatives addressing underserved communities might help improve equity of access to CVD screening and treatment.",
                "authors": [
                    {
                        "name": "Chang W.H."
                    },
                    {
                        "name": "Chung S.-C."
                    },
                    {
                        "name": "Foster G.R."
                    },
                    {
                        "name": "Lai A.G."
                    },
                    {
                        "name": "Mueller S.H."
                    }
                ],
                "date": "2022-12-01T00:00:00Z",
                "journal": "Journal of Translational Medicine",
                "title": "Increased burden of cardiovascular disease in people with liver disease: unequal geographical variations, risk factors and excess years of life lost"
            },
            "pmcid": "PMC8722174",
            "pmid": "34980174"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Cardiology",
            "uri": "http://edamontology.org/topic_3335"
        },
        {
            "term": "Medical informatics",
            "uri": "http://edamontology.org/topic_3063"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Urology and nephrology",
            "uri": "http://edamontology.org/topic_3422"
        }
    ],
    "validated": 1
}
