{"credit":[{"name":"EMBL-EBI Databases","typeEntity":"Institute","typeRoles":["Provider"]},{"typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://www.ebi.ac.uk/support/"}],"documentation":[{"type":"GENERAL","url":"https://www.ebi.ac.uk/gxa/release-notes.html"}],"function":[{"operation":[{"term":"Query and retrieval","uri":"http://edamontology.org/operation_0224"}]}],"labels":{"elixirNode":["EMBL"],"elixirPlatform":["Data"],"operatingSystem":["Linux","Windows","Mac"],"toolType":["Database portal"],"topic":[{"term":"Gene expression","uri":"http://edamontology.org/topic_0203"}]},"publication":[{"abstract":"© The Author(s) 2015.Expression Atlas (http://www.ebi.ac.uk/gxa) provides information about gene and protein expression in animal and plant samples of different cell types, organism parts, developmental stages, diseases and other conditions. It consists of selected microarray and RNA-sequencing studies from Array Express, which have been manually curated, annotated with ontology terms, checked for high quality and processed using standardised analysis methods. Since the last update, Atlas has grown sevenfold (1572 studies as of August 2015), and incorporates baseline expression profiles of tissues from Human Protein Atlas, GTEx and FANTOM5, and of cancer cell lines from ENCODE, CCLE and Genentech projects. Plant studies constitute a quarter of Atlas data. For genes of interest, the user can view baseline expression in tissues, and differential expression for biologically meaningful pairwise comparisons-estimated using consistent methodology across all of Atlas. Our first proteomics study in human tissues is now displayed alongside transcriptomics data in the same tissues. Novel analyses and visualisations include: 'enrichment' in each differential comparison of GO terms, Reactome, Plant Reactome pathways and InterPro domains; hierarchical clustering (by baseline expression) of most variable genes and experimental conditions; and, for a given gene-condition, distribution of baseline expression across biological replicates.","authors":["Petryszak R.","Keays M.","Tang Y.A.","Fonseca N.A.","Barrera E.","Burdett T.","Fullgrabe A.","Fuentes A.M.-P.","Jupp S.","Koskinen S.","Mannion O.","Huerta L.","Megy K.","Snow C.","Williams E.","Barzine M.","Hastings E.","Weisser H.","Wright J.","Jaiswal P.","Huber W.","Choudhary J.","Parkinson H.E.","Brazma A."],"cit_count":177,"doi":"10.1093/nar/gkv1045","journal":"Nucleic Acids Research","title":"Expression Atlas update - An integrated database of gene and protein expression in humans, animals and plants","type":"Primary","year":"2016-01-01"}],"summary":{"biotoolsCURIE":"biotools:expression_atlas","biotoolsID":"expression_atlas","description":"Open science resource that gives users a powerful way to find information about gene and protein expression across species and biological conditions such as different tissues, cell types, developmental stages and diseases among others.","homepage":"https://www.ebi.ac.uk/gxa/","name":"Expression Atlas"}}