{
    "additionDate": "2020-01-09T17:35:57Z",
    "biotoolsCURIE": "biotools:DISOselect",
    "biotoolsID": "DISOselect",
    "confidence_flag": "high",
    "credit": [
        {
            "email": "lkurgan@vcu.edu",
            "name": "Lukasz Kurgan",
            "orcidid": "https://orcid.org/0000-0002-7749-0314",
            "typeEntity": "Person"
        }
    ],
    "description": "Disorder predictor selection at the protein level.\n\nDisorder Predictor Selection Tool- web server from Biomine lab.\n\nDISOselect - Disorder predictor selection tool.\n\nDISOselect accepts either single or multiple protein sequences. The input is limited to 1000 protein sequences. The user should submit the protein sequence(s) in FASTA format",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein disorder prediction",
                    "uri": "http://edamontology.org/operation_3904"
                },
                {
                    "term": "Protein secondary structure prediction (helices)",
                    "uri": "http://edamontology.org/operation_0468"
                },
                {
                    "term": "Protein secondary structure prediction (coils)",
                    "uri": "http://edamontology.org/operation_0470"
                }
            ]
        }
    ],
    "homepage": "http://biomine.cs.vcu.edu/servers/DISOselect/",
    "lastUpdate": "2020-01-09T17:35:57Z",
    "name": "DISOselect",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1002/PRO.3756",
            "metadata": {
                "abstract": "© 2019 The Protein SocietyThe intense interest in the intrinsically disordered proteins in the life science community, together with the remarkable advancements in predictive technologies, have given rise to the development of a large number of computational predictors of intrinsic disorder from protein sequence. While the growing number of predictors is a positive trend, we have observed a considerable difference in predictive quality among predictors for individual proteins. Furthermore, variable predictor performance is often inconsistent between predictors for different proteins, and the predictor that shows the best predictive performance depends on the unique properties of each protein sequence. We propose a computational approach, DISOselect, to estimate the predictive performance of 12 selected predictors for individual proteins based on their unique sequence-derived properties. This estimation informs the users about the expected predictive quality for a selected disorder predictor and can be used to recommend methods that are likely to provide the best quality predictions. Our solution does not depend on the results of any disorder predictor; the estimations are made based solely on the protein sequence. Our solution significantly improves predictive performance, as judged with a test set of 1,000 proteins, when compared to other alternatives. We have empirically shown that by using the recommended methods the overall predictive performance for a given set of proteins can be improved by a statistically significant margin. DISOselect is freely available for non-commercial users through the webserver at http://biomine.cs.vcu.edu/servers/DISOselect/.",
                "authors": [
                    {
                        "name": "Katuwawala A."
                    },
                    {
                        "name": "Oldfield C.J."
                    },
                    {
                        "name": "Kurgan L."
                    }
                ],
                "citationCount": 1,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Protein Science",
                "title": "DISOselect: Disorder predictor selection at the protein level"
            },
            "pmcid": "PMC6933862",
            "pmid": "31642118"
        }
    ],
    "topic": [
        {
            "term": "Protein properties",
            "uri": "http://edamontology.org/topic_0123"
        },
        {
            "term": "Protein disordered structure",
            "uri": "http://edamontology.org/topic_3538"
        },
        {
            "term": "Protein expression",
            "uri": "http://edamontology.org/topic_0108"
        }
    ]
}