{
    "additionDate": "2021-03-19T08:41:28Z",
    "biotoolsCURIE": "biotools:saafec-seq",
    "biotoolsID": "saafec-seq",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "ealexov@clemson.edu",
            "name": "Emil Alexov",
            "orcidid": "https://orcid.org/0000-0001-5346-0156",
            "typeEntity": "Person"
        }
    ],
    "description": "A Sequence-Based Method for Predicting the Effect of Single Point Mutations on Protein Thermodynamic Stability.\n\nSAAFEC-SEQ: an online application for calculating folding free energy changes in proteins caused by missense mutations.\n\nSAAFEC-SEQ uses the PsePSSM algorithm to predict the stability changes upon a single mutation in protein. SAAFEC-SEQ uses gradient boosting decision tree repressor to encode physicochemical properties, sequence features and evolutionary information to compute the change in stability free energy resulting from single mutations. SAAFEC-SEQ outperforms all existing state-of-the-art sequence-based methods in both the Pearson correlation coefficient and root-mean-squared-error parameters for several independent datasets.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Fold recognition",
                    "uri": "http://edamontology.org/operation_0303"
                },
                {
                    "term": "Sequence feature detection",
                    "uri": "http://edamontology.org/operation_0253"
                },
                {
                    "term": "Variant effect prediction",
                    "uri": "http://edamontology.org/operation_0331"
                }
            ]
        }
    ],
    "homepage": "http://compbio.clemson.edu/SAAFEC-SEQ/index.php",
    "lastUpdate": "2021-04-03T10:44:10Z",
    "name": "SAAFEC-SEQ",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.3390/IJMS22020606",
            "metadata": {
                "abstract": "Copyright: © 2021 by the authors. Licensee MDPI, Basel, Switzerland.Modeling the effect of mutations on protein thermodynamics stability is useful for protein engineering and understanding molecular mechanisms of disease-causing variants. Here, we report a new development of the SAAFEC method, the SAAFEC-SEQ, which is a gradient boosting decision tree machine learning method to predict the change of the folding free energy caused by amino acid substitutions. The method does not require the 3D structure of the corresponding pro-tein, but only its sequence and, thus, can be applied on genome-scale investigations where structural information is very sparse. SAAFEC-SEQ uses physicochemical properties, sequence features, and evolutionary information features to make the predictions. It is shown to consistently outper-form all existing state-of-the-art sequence-based methods in both the Pearson correlation coefficient and root-mean-squared-error parameters as benchmarked on several independent datasets. The SAAFEC-SEQ has been implemented into a web server and is available as stand-alone code that can be downloaded and embedded into other researchers’ code.",
                "authors": [
                    {
                        "name": "Alexov E."
                    },
                    {
                        "name": "Li G."
                    },
                    {
                        "name": "Panday S.K."
                    }
                ],
                "citationCount": 3,
                "date": "2021-01-02T00:00:00Z",
                "journal": "International Journal of Molecular Sciences",
                "title": "Saafec-seq: A sequence-based method for predicting the effect of single point mutations on protein thermodynamic stability"
            },
            "pmcid": "PMC7827184",
            "pmid": "33435356"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Protein folding, stability and design",
            "uri": "http://edamontology.org/topic_0130"
        },
        {
            "term": "Protein folds and structural domains",
            "uri": "http://edamontology.org/topic_0736"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
