{
    "additionDate": "2020-01-09T17:34:56Z",
    "biotoolsCURIE": "biotools:PhyloMagnet",
    "biotoolsID": "PhyloMagnet",
    "confidence_flag": "tool",
    "description": "PhyloMagnet provides fast and accurate screening of short-read meta-omics data using gene-centric phylogenetics. The tool has a pipeline for screening metagenomes, looking for arbitrary lineages, using gene-centric assembly methods and phylogenetics",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://phylomagnet.readthedocs.io"
        }
    ],
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "De-novo assembly",
                    "uri": "http://edamontology.org/operation_0524"
                },
                {
                    "term": "Mapping assembly",
                    "uri": "http://edamontology.org/operation_0523"
                },
                {
                    "term": "Phylogenetic tree reconstruction",
                    "uri": "http://edamontology.org/operation_3478"
                },
                {
                    "term": "Taxonomic classification",
                    "uri": "http://edamontology.org/operation_3460"
                },
                {
                    "term": "Transcriptome assembly",
                    "uri": "http://edamontology.org/operation_3258"
                }
            ]
        }
    ],
    "homepage": "http://github.com/maxemil/PhyloMagnet",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-01-10T12:02:35Z",
    "license": "GPL-3.0",
    "name": "PhyloMagnet",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ799",
            "metadata": {
                "abstract": "© The Author(s) 2019. Published by Oxford University Press. All rights reserved.Motivation: Metagenomic and metatranscriptomic sequencing have become increasingly popular tools for producing massive amounts of short-read data, often used for the reconstruction of draft genomes or the detection of (active) genes in microbial communities. Unfortunately, sequence assemblies of such datasets generally remain a computationally challenging task. Frequently, researchers are only interested in a specific group of organisms or genes; yet, the assembly of multiple datasets only to identify candidate sequences for a specific question is sometimes prohibitively slow, forcing researchers to select a subset of available datasets to address their question. Here, we present PhyloMagnet, a workflow to screen meta-omics datasets for taxa and genes of interest using gene-centric assembly and phylogenetic placement of sequences. Results: Using PhyloMagnet, we could identify up to 87% of the genera in an in vitro mock community with variable abundances, while the false positive predictions per single gene tree ranged from 0 to 23%. When applied to a group of metagenomes for which a set of metagenome assembled genomes (MAGs) have been published, we could detect the majority of the taxonomic labels that the MAGs had been annotated with. In a metatranscriptomic setting, the phylogenetic placement of assembled contigs corresponds to that of transcripts obtained from transcriptome assembly. Availability and implementation: PhyloMagnet is built using Nextflow, available at github.com/maxemil/ PhyloMagnet and is developed and tested on Linux. It is released under the open source GNU GPL licence and documentation is available at phylomagnet.readthedocs.io. Version 0.5 of PhyloMagnet was used for all benchmarking experiments.",
                "authors": [
                    {
                        "name": "Eme L."
                    },
                    {
                        "name": "Ettema T.J.G."
                    },
                    {
                        "name": "Schon M.E."
                    }
                ],
                "date": "2020-01-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "PhyloMagnet: Fast and accurate screening of short-read meta-omics data using gene-centric phylogenetics"
            },
            "pmid": "31647547"
        }
    ],
    "topic": [
        {
            "term": "Metagenomic sequencing",
            "uri": "http://edamontology.org/topic_3837"
        },
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        },
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ],
    "validated": 1
}
