{
    "accessibility": "Open access",
    "additionDate": "2022-02-23T18:55:14.149904Z",
    "biotoolsCURIE": "biotools:dockecr",
    "biotoolsID": "dockecr",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Rodrigo Ochoa",
            "typeEntity": "Person"
        }
    ],
    "description": "Open consensus docking and ranking pipeline for virtual screening of small molecules.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Molecular dynamics",
                    "uri": "http://edamontology.org/operation_2476"
                },
                {
                    "term": "Protein-protein docking",
                    "uri": "http://edamontology.org/operation_3899"
                },
                {
                    "term": "Virtual screening",
                    "uri": "http://edamontology.org/operation_3938"
                }
            ]
        }
    ],
    "homepage": "https://github.com/rochoa85/dockECR",
    "language": [
        "Perl",
        "Python",
        "Shell"
    ],
    "lastUpdate": "2022-02-23T18:55:14.152539Z",
    "license": "MIT",
    "name": "dockECR",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1016/J.JMGM.2021.108023",
            "metadata": {
                "abstract": "© 2021 Elsevier Inc.The development of open computational pipelines to accelerate the discovery of treatments for emerging diseases allows finding novel solutions in shorter periods of time. Consensus molecular docking is one of these approaches, and its main purpose is to increase the detection of real actives within virtual screening campaigns. Here we present dockECR, an open consensus docking and ranking protocol that implements the exponential consensus ranking method to prioritize molecular candidates. The protocol uses four open source molecular docking programs: AutoDock Vina, Smina, LeDock and rDock, to rank the molecules. In addition, we introduce a scoring strategy based on the average RMSD obtained from comparing the best poses from each single program to complement the consensus ranking with information about the predicted poses. The protocol was benchmarked using 15 relevant protein targets with known actives and decoys, and applied using the main protease of the SARS-CoV-2 virus. For the application, different crystal structures of the protease, and frames obtained from molecular dynamics simulations were used to dock a library of 79 molecules derived from previously co-crystallized fragments. The ranking obtained with dockECR was used to prioritize eight candidates, which were evaluated in terms of the interactions generated with key residues from the protease. The protocol can be implemented in any virtual screening campaign involving proteins as molecular targets. The dockECR code is publicly available at: https://github.com/rochoa85/dockECR.",
                "authors": [
                    {
                        "name": "Adler N.S."
                    },
                    {
                        "name": "Clemente C.M."
                    },
                    {
                        "name": "Ochoa R."
                    },
                    {
                        "name": "Palacio-Rodriguez K."
                    }
                ],
                "date": "2021-12-01T00:00:00Z",
                "journal": "Journal of Molecular Graphics and Modelling",
                "title": "dockECR: Open consensus docking and ranking protocol for virtual screening of small molecules"
            },
            "pmcid": "PMC8442548",
            "pmid": "34555725"
        }
    ],
    "toolType": [
        "Workflow"
    ],
    "topic": [
        {
            "term": "Compound libraries and screening",
            "uri": "http://edamontology.org/topic_3343"
        },
        {
            "term": "Molecular biology",
            "uri": "http://edamontology.org/topic_3047"
        },
        {
            "term": "Molecular modelling",
            "uri": "http://edamontology.org/topic_2275"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ],
    "validated": 1
}
