{
    "accessibility": "Open access",
    "additionDate": "2024-03-21T13:59:53.935478Z",
    "biotoolsCURIE": "biotools:mimed",
    "biotoolsID": "mimed",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "hyunwook.koh@stonybrook.edu",
            "name": "Hyunwook Koh",
            "orcidid": "https://orcid.org/0000-0001-6893-7164",
            "typeEntity": "Person"
        },
        {
            "name": "Hyojung Jang",
            "typeEntity": "Person"
        },
        {
            "name": "Solha Park",
            "typeEntity": "Person"
        }
    ],
    "description": "Comprehensive microbiome causal mediation analysis using MiMed on user-friendly web interfaces.\n\nA new version of ShinyProxy is available Switch to new version!.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "http://mimed.micloud.kr:3838/app/mimed",
    "language": [
        "R"
    ],
    "lastUpdate": "2024-03-21T13:59:53.938177Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/yj7599/MiMedGit"
        }
    ],
    "name": "MiMed",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIOMETHODS/BPAD023",
            "metadata": {
                "abstract": "It is a central goal of human microbiome studies to see the roles of the microbiome as a mediator that transmits environmental, behavioral, or medical exposures to health or disease outcomes. Yet, mediation analysis is not used as much as it should be. One reason is because of the lack of carefully planned routines, compilers, and automated computing systems for microbiome mediation analysis (MiMed) to perform a series of data processing, diversity calculation, data normalization, downstream data analysis, and visualizations. Many researchers in various disciplines (e.g. clinicians, public health practitioners, and biologists) are not also familiar with related statistical methods and programming languages on command-line interfaces. Thus, in this article, we introduce a web cloud computing platform, named as MiMed, that enables comprehensive MiMed on user-friendly web interfaces. The main features of MiMed are as follows. First, MiMed can survey the microbiome in various spheres (i) as a whole microbial ecosystem using different ecological measures (e.g. alpha-and beta-diversity indices) or (ii) as individual microbial taxa (e.g. phyla, classes, orders, families, genera, and species) using different data normalization methods. Second, MiMed enables covariate-Adjusted analysis to control for potential confounding factors (e.g. age and gender), which is essential to enhance the causality of the results, especially for observational studies. Third, MiMed enables a breadth of statistical inferences in both mediation effect estimation and significance testing. Fourth, MiMed provides flexible and easy-To-use data processing and analytic modules and creates nice graphical representations. Finally, MiMed employs ChatGPT to search for what has been known about the microbial taxa that are found significantly as mediators using artificial intelligence technologies. For demonstration purposes, we applied MiMed to the study on the mediating roles of oral microbiome in subgingival niches between e-cigarette smoking and gingival inflammation. MiMed is freely available on our web server (http://mimed.micloud.kr).",
                "authors": [
                    {
                        "name": "Jang H."
                    },
                    {
                        "name": "Koh H."
                    },
                    {
                        "name": "Park S."
                    }
                ],
                "citationCount": 2,
                "date": "2023-01-01T00:00:00Z",
                "journal": "Biology Methods and Protocols",
                "title": "Comprehensive microbiome causal mediation analysis using MiMed on user-friendly web interfaces"
            },
            "pmcid": "PMC10576642",
            "pmid": "37840574"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "Microbial ecology",
            "uri": "http://edamontology.org/topic_3697"
        }
    ]
}
