{
    "additionDate": "2020-01-09T18:14:32Z",
    "biotoolsCURIE": "biotools:EDCluster",
    "biotoolsID": "EDCluster",
    "confidence_flag": "tool",
    "description": "EDCluster is a method for obtaining stationary distributions that can be used to construct empirical stationary distribution mixture models.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                }
            ]
        }
    ],
    "homepage": "https://github.com/dschrempf/edcluster",
    "lastUpdate": "2021-01-09T15:07:58Z",
    "license": "GPL-3.0",
    "name": "EDCluster",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1101/794263"
        },
        {
            "doi": "10.1093/molbev/msaa145",
            "metadata": {
                "abstract": "© The Author(s) 2020.Biochemical demands constrain the range of amino acids acceptable at specific sites resulting in across-site compositional heterogeneity of the amino acid replacement process. Phylogenetic models that disregard this heterogeneity are prone to systematic errors, which can lead to severe long-branch attraction artifacts. State-of-the-art models accounting for across-site compositional heterogeneity include the CAT model, which is computationally expensive, and empirical distribution mixture models estimated via maximum likelihood (C10–C60 models). Here, we present a new, scalable method EDCluster for finding empirical distribution mixture models involving a simple cluster analysis. The cluster analysis utilizes specific coordinate transformations which allow the detection of specialized amino acid distributions either from curated databases or from the alignment at hand. We apply EDCluster to the HOGENOM and HSSP databases in order to provide universal distribution mixture (UDM) models comprising up to 4,096 components. Detailed analyses of the UDM models demonstrate the removal of various long-branch attraction artifacts and improved performance compared with the C10–C60 models. Ready-to-use implementations of the UDM models are provided for three established software packages (IQ-TREE, Phylobayes, and RevBayes).",
                "authors": [
                    {
                        "name": "Schrempf D."
                    },
                    {
                        "name": "Lartillot N."
                    },
                    {
                        "name": "Szollosi G."
                    }
                ],
                "citationCount": 1,
                "date": "2020-12-01T00:00:00Z",
                "journal": "Molecular Biology and Evolution",
                "title": "Scalable empirical mixture models that account for across-site compositional heterogeneity"
            },
            "pmcid": "PMC7743758",
            "pmid": "32877529"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        },
        {
            "term": "Phylogenomics",
            "uri": "http://edamontology.org/topic_0194"
        }
    ],
    "validated": 1
}