{"credit":[{"email":"bquach@email.unc.edu","name":"Bryan Quach","typeEntity":"Person","typeRoles":["Primary contact"]},{"email":"tsfurey@email.unc.edu","name":"Terry Furey","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"http://defcom.readthedocs.io/en/latest/"},{"type":"API_DOCUMENTATION","url":"http://defcom.readthedocs.io/en/latest/source/modules/"}],"download":[{"url":"https://bitbucket.org/bryancquach/defcom/downloads/"}],"function":[{"operation":[{"term":"Prediction and recognition","uri":"http://edamontology.org/operation_2423"}]},{"operation":[{"term":"Sequence motif discovery","uri":"http://edamontology.org/operation_0238"},{"term":"Sequence motif recognition","uri":"http://edamontology.org/operation_0239"}]}],"labels":{"language":["Python"],"operatingSystem":["Linux","Mac"],"toolType":["Library"],"topic":[{"term":"Sequencing","uri":"http://edamontology.org/topic_3168"},{"term":"Nucleic acid sites, features and motifs","uri":"http://edamontology.org/topic_3511"}]},"publication":[{"abstract":"© The Author 2016. Published by Oxford University Press. Motivation: Identifying the locations of transcription factor binding sites is critical for understanding how gene transcription is regulated across different cell types and conditions. Chromatin accessibility experiments such as DNaseI sequencing (DNase-seq) and Assay for Transposase Accessible Chromatin sequencing (ATAC-seq) produce genome-wide data that include distinct 'footprint' patterns at binding sites. Nearly all existing computational methods to detect footprints from these data assume that footprint signals are highly homogeneous across footprint sites. Additionally, a comprehensive and systematic comparison of footprinting methods for specifically identifying which motif sites for a specific factor are bound has not been performed. Results: Using DNase-seq data from the ENCODE project, we show that a large degree of previously uncharacterized site-to-site variability exists in footprint signal across motif sites for a transcription factor. To model this heterogeneity in the data, we introduce a novel, supervised learning footprinter called Detecting Footprints Containing Motifs (DeFCoM). We compare DeFCoM to nine existing methods using evaluation sets from four human cell-lines and eighteen transcription factors and show that DeFCoM outperforms current methods in determining bound and unbound motif sites. We also analyze the impact of several biological and technical factors on the quality of footprint predictions to highlight important considerations when conducting footprint analyses and assessing the performance of footprint prediction methods. Finally, we show that DeFCoM can detect footprints using ATAC-seq data with similar accuracy as when using DNase-seq data. Availability and Implementation: Python code available at https://bitbucket.org/bryancquach/defcom.","authors":["Quach B.","Furey T.S."],"cit_count":2,"doi":"10.1093/bioinformatics/btw740","journal":"Bioinformatics","pmid":"27993786","title":"DeFCoM: Analysis and modeling of transcription factor binding sites using a motif-centric genomic footprinter","year":"2017-04-01"}],"summary":{"biotoolsCURIE":"biotools:defcom","biotoolsID":"defcom","description":"SVM-based supervised learning foot-printer for the detection of footprints containing motifs.","homepage":"https://bitbucket.org/bryancquach/defcom","name":"DeFCoM","version":["1.0"]}}