{"credit":[],"function":[{"operation":[{"term":"SNP detection","uri":"http://edamontology.org/operation_0484"},{"term":"SNP annotation","uri":"http://edamontology.org/operation_3661"},{"term":"Genotyping","uri":"http://edamontology.org/operation_3196"}]}],"labels":{"topic":[{"term":"DNA polymorphism","uri":"http://edamontology.org/topic_2885"},{"term":"Genotype and phenotype","uri":"http://edamontology.org/topic_0625"},{"term":"Microarray experiment","uri":"http://edamontology.org/topic_3518"},{"term":"Preclinical and clinical studies","uri":"http://edamontology.org/topic_3379"},{"term":"GWAS study","uri":"http://edamontology.org/topic_3517"}]},"publication":[{"abstract":"© 2019, The Author(s).Aims/hypothesis: We studied the association of plasma ascorbic acid with the risk of developing islet autoimmunity and type 1 diabetes and examined whether SNPs in vitamin C transport genes modify these associations. Furthermore, we aimed to determine whether the SNPs themselves are associated with the risk of islet autoimmunity or type 1 diabetes. Methods: We used a risk set sampled nested case–control design within an ongoing international multicentre observational study: The Environmental Determinants of Diabetes in the Young (TEDDY). The TEDDY study followed children with increased genetic risk from birth to endpoints of islet autoantibodies (350 cases, 974 controls) and type 1 diabetes (102 cases, 282 controls) in six clinical centres. Control participants were matched for family history of type 1 diabetes, clinical centre and sex. Plasma ascorbic acid concentration was measured at ages 6 and 12 months and then annually up to age 6 years. SNPs in vitamin C transport genes were genotyped using the ImmunoChip custom microarray. Comparisons were adjusted for HLA genotypes and for background population stratification. Results: Childhood plasma ascorbic acid (mean ± SD 10.76 ± 3.54 mg/l in controls) was inversely associated with islet autoimmunity risk (adjusted OR 0.96 [95% CI 0.92, 0.99] per +1 mg/l), particularly islet autoimmunity, starting with insulin autoantibodies (OR 0.94 [95% CI 0.88, 0.99]), but not with type 1 diabetes risk (OR 0.93 [95% Cl 0.86, 1.02]). The SLC2A2 rs5400 SNP was associated with increased risk of type 1 diabetes (OR 1.77 [95% CI 1.12, 2.80]), independent of plasma ascorbic acid (OR 0.92 [95% CI 0.84, 1.00]). Conclusions/interpretation: Higher plasma ascorbic acid levels may protect against islet autoimmunity in children genetically at risk for type 1 diabetes. Further studies are warranted to confirm these findings. Data availability: The datasets generated and analysed during the current study will be made available in the NIDDK Central Repository at https://www.niddkrepository.org/studies/teddy.","authors":["Mattila M.","Erlund I.","Lee H.-S.","Niinisto S.","Uusitalo U.","Andren Aronsson C.","Hummel S.","Parikh H.","Rich S.S.","Hagopian W.","Toppari J.","Lernmark A.","Ziegler A.G.","Rewers M.","Krischer J.P.","Norris J.M.","Virtanen S.M."],"cit_count":0,"doi":"10.1007/S00125-019-05028-Z","journal":"Diabetologia","pmid":"31728565","title":"Plasma ascorbic acid and the risk of islet autoimmunity and type 1 diabetes: the TEDDY study","year":"2019-01-01"}],"summary":{"biotoolsCURIE":"biotools:TEDDY","biotoolsID":"TEDDY","description":"Plasma ascorbic acid and the risk of islet autoimmunity and type 1 diabetes.\n\nThe Environmental Determinants of Diabetes in the Young (TEDDY).\n\nNIDDK Central Repository - The Environmental Determinants of Diabetes in the Young (TEDDY) resource description, availability, and access.\n\nAccess to samples for The Environmental Determinants of Diabetes in the Young (TEDDY) is currently only available via collaboration. Please contact the parent study to ask about ancillary study opportunities.\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'islet autoimmunity', 'INTERPRETATION:Higher', 'ascorbic', 'islet'","homepage":"https://www.niddkrepository.org/studies/teddy","name":"TEDDY"}}