{
    "additionDate": "2017-08-03T18:37:06Z",
    "biotoolsCURIE": "biotools:bpbaac",
    "biotoolsID": "bpbaac",
    "credit": [
        {
            "email": "yejun.wang@gmail.com",
            "name": "Yejun Wang",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://biocomputer.bio.cuhk.edu.hk"
        }
    ],
    "description": "A classifier, was developed and trained using Support Vector Machine (SVM) based on the Aac feature extracted using a Bi-profile Bayes model.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://biocomputer.bio.cuhk.edu.hk/T3DB/BPBAac.php"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein sequence analysis",
                    "uri": "http://edamontology.org/operation_2479"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Prediction and recognition",
                    "uri": "http://edamontology.org/operation_2423"
                }
            ]
        }
    ],
    "homepage": "http://biocomputer.bio.cuhk.edu.hk/T3DB/BPBAac.php",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-10T12:58:55Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/bpbaac-t3s-effector-prediction-tool-based-position-specific-amino-acid-composition-features-n-termini.html"
        }
    ],
    "name": "BPBAac",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Motivation: Bacterial type III secreted (T3S) effectors are delivered into host cells specifically via type III secretion systems (T3SSs), which play important roles in the interaction between bacteria and their hosts. Previous computational methods for T3S protein prediction have only achieved limited accuracy, and distinct features for effective T3S protein prediction remain to be identified. Results: In this work, a distinctive N-terminal position-specific amino acid composition (Aac) feature was identified for T3S proteins. A large portion (~50%) of T3S proteins exhibit distinct position-specific Aac features that can tolerate position shift. A classifier, BPBAac, was developed and trained using Support Vector Machine (SVM) based on the Aac feature extracted using a Bi-profile Bayes model. We demonstrated that the BPBAac model outperformed other implementations in classification of T3S and non-T3S proteins, giving an average sensitivity of ~90.97% and an average selectivity of ~97.42% in a 5-fold cross-validation evaluation. The model was also robust when a small-size training dataset was used. The fact that the position-specific Aac feature is commonly found in T3S proteins across different bacterial species gives this model wide application. To demonstrate the model's application, a genome-wide prediction of T3S effector proteins was performed for Ralstonia solanacearum, an important plant pathogenic bacterium, and a number of putative candidates were identified using this model. © The Author 2011. Published by Oxford University Press. All rights reserved.",
                "authors": [
                    {
                        "name": "Wang Y."
                    },
                    {
                        "name": "Zhang Q."
                    },
                    {
                        "name": "Sun M."
                    },
                    {
                        "name": "Guo D."
                    }
                ],
                "citationCount": 58,
                "date": "2011-03-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "High-accuracy prediction of bacterial type III secreted effectors based on position-specific amino acid composition profiles"
            },
            "pmid": "21233168"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Protein folding, stability and design",
            "uri": "http://edamontology.org/topic_0130"
        }
    ],
    "validated": 1
}