
{
    "credit": [
        {
            "email": "jean-christophe.gelly@univ-paris-diderot.fr",
            "name": "Jean-Christophe Gelly",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://www.dsimb.inserm.fr/dsimb_tools/predyflexy/example.html"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Protein structure prediction",
                    "uri": "http://edamontology.org/operation_0474"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Protein sequence analysis",
                    "uri": "http://edamontology.org/operation_2479"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "R",
            "Perl",
            "Python"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Structure prediction",
                "uri": "http://edamontology.org/topic_0082"
            },
            {
                "term": "Protein properties",
                "uri": "http://edamontology.org/topic_0123"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/predyflexy-flexibility-and-local-structure-prediction-from-sequence.html"
        }
    ],
    "publication": [
        {
            "abstract": "Protein structures are necessary for understanding protein function at a molecular level. Dynamics and flexibility of protein structures are also key elements of protein function. So, we have proposed to look at protein flexibility using novel methods: (i) using a structural alphabet and (ii) combining classical X-ray B-factor data and molecular dynamics simulations. First, we established a library composed of structural prototypes (LSPs) to describe protein structure by a limited set of recurring local structures. We developed a prediction method that proposes structural candidates in terms of LSPs and predict protein flexibility along a given sequence. Second, we examine flexibility according to two different descriptors: X-ray B-factors considered as good indicators of flexibility and the root mean square fluctuations, based on molecular dynamics simulations. We then define three flexibility classes and propose a method based on the LSP prediction method for predicting flexibility along the sequence. This method does not resort to sophisticate learning of flexibility but predicts flexibility from average flexibility of predicted local structures. The method is implemented in PredyFlexy web server. Results are similar to those obtained with the most recent, cutting-edge methods based on direct learning of flexibility data conducted with sophisticated algorithms. PredyFlexy can be accessed at http://www.dsimb.inserm.fr/dsimb-tools/predyflexy/ . © 2012 The Author(s).",
            "authors": [
                "De Brevern A.G.",
                "Bornot A.",
                "Craveur P.",
                "Etchebest C.",
                "Gelly J.-C."
            ],
            "cit_count": 38,
            "journal": "Nucleic Acids Research",
            "pmid": "22689641",
            "title": "PredyFlexy: Flexibility and local structure prediction from sequence",
            "year": "2012-07-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:predyflexy",
        "biotoolsID": "predyflexy",
        "description": "Predict local protein structures and protein flexibility from its sequence. Results can be visualized at the amino acid level through a table and graphics.",
        "homepage": "http://www.dsimb.inserm.fr/dsimb_tools/predyflexy/",
        "name": "PredyFlexy"
    }
}