{
    "additionDate": "2017-01-13T13:14:56Z",
    "biotoolsCURIE": "biotools:goby_framework",
    "biotoolsID": "goby_framework",
    "credit": [
        {
            "email": "goby-framework@googlegroups.com",
            "name": "Goby-framework support",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Next-gen data management framework designed to facilitate the implementation of efficient next-gen data analysis pipelines.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://campagnelab.org/software/goby/tutorials/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Formatting",
                    "uri": "http://edamontology.org/operation_0335"
                }
            ]
        }
    ],
    "homepage": "http://goby.campagnelab.org",
    "language": [
        "C",
        "C++",
        "Java",
        "Python"
    ],
    "lastUpdate": "2018-12-10T12:58:56Z",
    "license": "GPL-2.0",
    "maturity": "Mature",
    "name": "Goby framework",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "seqwiki_import",
    "publication": [
        {
            "doi": "10.1371/journal.pone.0079871",
            "metadata": {
                "abstract": "Large biological datasets are being produced at a rapid pace and create substantial storage challenges, particularly in the domain of high-throughput sequencing (HTS). Most approaches currently used to store HTS data are either unable to quickly adapt to the requirements of new sequencing or analysis methods (because they do not support schema evolution), or fail to provide state of the art compression of the datasets. We have devised new approaches to store HTS data that support seamless data schema evolution and compress datasets substantially better than existing approaches. Building on these new approaches, we discuss and demonstrate how a multi-tier data organization can dramatically reduce the storage, computational and network burden of collecting, analyzing, and archiving large sequencing datasets. For instance, we show that spliced RNA-Seq alignments can be stored in less than 4% the size of a BAM file with perfect data fidelity. Compared to the previous compression state of the art, these methods reduce dataset size more than 40% when storing exome, gene expression or DNA methylation datasets. The approaches have been integrated in a comprehensive suite of software tools (http://goby.campagnelab.org) that support common analyses for a range of high-throughput sequencing assays. © 2013 Campagne et al.",
                "authors": [
                    {
                        "name": "Campagne F."
                    },
                    {
                        "name": "Chambwe N."
                    },
                    {
                        "name": "Dorff K.C."
                    },
                    {
                        "name": "Mesirov J.P."
                    },
                    {
                        "name": "Robinson J.T."
                    }
                ],
                "citationCount": 20,
                "date": "2013-11-18T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "Compression of structured high-throughput sequencing data"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Suite"
    ],
    "topic": [
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ],
    "validated": 1
}
