{
    "additionDate": "2018-08-04T13:22:34Z",
    "biotoolsCURIE": "biotools:drap",
    "biotoolsID": "drap",
    "credit": [
        {
            "email": "sigenae-support@listes.inra.fr",
            "name": "Support",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "De novo RNA-Seq Assembly Pipeline.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://www.sigenae.org/drap/quick_start.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence assembly validation",
                    "uri": "http://edamontology.org/operation_3180"
                }
            ]
        }
    ],
    "homepage": "http://www.sigenae.org/drap/",
    "language": [
        "Perl",
        "Python"
    ],
    "lastUpdate": "2018-12-10T12:59:00Z",
    "license": "GPL-3.0",
    "name": "DRAP",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.7717/peerj.2988",
            "metadata": {
                "abstract": "© 2017 Cabau et al.Background. De novo transcriptome assembly of short reads is now a common step in expression analysis of organisms lacking a reference genome sequence. Several software packages are available to perform this task. Even if their results are of good quality it is still possible to improve them in several ways including redundancy reduction or error correction. Trinity and Oases are two commonly used de novo transcriptome assemblers. The contig sets they produce are of good quality. Still, their compaction (number of contigs needed to represent the transcriptome) and their quality (chimera and nucleotide error rates) can be improved. Results. We built a de novo RNA-Seq Assembly Pipeline (DRAP) which wraps these two assemblers (Trinity and Oases) in order to improve their results regarding the above-mentioned criteria. DRAP reduces from 1.3 to 15 fold the number of resulting contigs of the assemblies depending on the read set and the assembler used. This article presents seven assembly comparisons showing in some cases drastic improvements when using DRAP. DRAP does not significantly impair assembly quality metrics such are read realignment rate or protein reconstruction counts. Conclusion. Transcriptome assembly is a challenging computational task even if good solutions are already available to end-users, these solutions can still be improved while conserving the overall representation and quality of the assembly. The de novo RNA-Seq Assembly Pipeline (DRAP) is an easy to use software package to produce compact and corrected transcript set. DRAP is free, open-source and available under GPL V3 license at http://www.sigenae.org/drap.",
                "authors": [
                    {
                        "name": "Cabau C."
                    },
                    {
                        "name": "Escudie F."
                    },
                    {
                        "name": "Djari A."
                    },
                    {
                        "name": "Guiguen Y."
                    },
                    {
                        "name": "Bobe J."
                    },
                    {
                        "name": "Klopp C."
                    }
                ],
                "citationCount": 41,
                "date": "2017-01-01T00:00:00Z",
                "journal": "PeerJ",
                "title": "Compacting and correcting Trinity and Oases RNA-Seq de novo assemblies"
            },
            "pmcid": "PMC5316280",
            "pmid": "28224052"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        },
        {
            "term": "RNA-seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        }
    ],
    "validated": 1
}