{
    "additionDate": "2021-01-18T09:13:56Z",
    "biotoolsCURIE": "biotools:sdlda",
    "biotoolsID": "sdlda",
    "confidence_flag": "tool",
    "description": "lncRNA-disease association prediction based on singular value decomposition and deep learning.\n\nPredicting lncRNA–disease associations based on singular value decomposition and deep learning techniques.\n\nIn this GitHub project, we give a demo to show how SDLDA works. In data_processing folder, we give following datasets we used in our study.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Text mining",
                    "uri": "http://edamontology.org/operation_0306"
                }
            ]
        }
    ],
    "homepage": "https://github.com/CSUBioGroup/SDLDA",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-02-13T16:58:55Z",
    "license": "MIT",
    "name": "SDLDA",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1016/J.YMETH.2020.05.002",
            "metadata": {
                "abstract": "© 2020 Elsevier Inc.In recent years, accumulating studies have shown that long non-coding RNAs (lncRNAs) not only play an important role in the regulation of various biological processes but also are the foundation for understanding mechanisms of human diseases. Due to the high cost of traditional biological experiments, the number of experimentally verified lncRNA-disease associations is very limited. Thus, many computational approaches have been proposed to discover the underlying associations between lncRNAs and diseases. However, the associations between lncRNAs and diseases are too complicated to model by using only traditional matrix factorization-based methods. In this study, we propose a hybrid computational framework (SDLDA) for the lncRNA-disease association prediction. In our computational framework, we use singular value decomposition and deep learning to extract linear and non-linear features of lncRNAs and diseases, respectively. Then we train SDLDA by combing the linear and non-linear features. Compared to previous computational methods, the combination of linear and non-linear features reinforces each other, which is better than using only either matrix factorization or deep learning. The computational results show that SDLDA has a better performance over existing methods in the leave-one-out cross-validation. Furthermore, the case studies show that 28 out of 30 cancer-related lncRNAs (10 for gastric cancer, 10 for colon cancer and 8 for renal cancer) are verified by mining recent biomedical literature. Code and data can be accessed at https://github.com/CSUBioGroup/SDLDA.",
                "authors": [
                    {
                        "name": "Zeng M."
                    },
                    {
                        "name": "Lu C."
                    },
                    {
                        "name": "Zhang F."
                    },
                    {
                        "name": "Li Y."
                    },
                    {
                        "name": "Wu F.-X."
                    },
                    {
                        "name": "Li Y."
                    },
                    {
                        "name": "Li M."
                    }
                ],
                "citationCount": 5,
                "date": "2020-07-01T00:00:00Z",
                "journal": "Methods",
                "title": "SDLDA: lncRNA-disease association prediction based on singular value decomposition and deep learning"
            },
            "pmid": "32387314"
        }
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        }
    ]
}