{
    "additionDate": "2022-04-25T17:47:14.883496Z",
    "biotoolsCURIE": "biotools:segment_hpc",
    "biotoolsID": "segment_hpc",
    "collectionID": [
        "PerMedCoE"
    ],
    "description": "A novel, massively parallel computational model of the gut, the Spatially Explicitly General-purpose Model of Enteric Tissue_HPC (SEGMEnT_HPC), which extends an existing model of the gut epithelium, SEGMEnT, in order to create cell-for-cell anatomic scale simulations",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Modelling and simulation",
                    "uri": "http://edamontology.org/operation_2426"
                }
            ]
        }
    ],
    "homepage": "https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0122192",
    "language": [
        "C++"
    ],
    "lastUpdate": "2024-11-24T20:09:57.065460Z",
    "name": "SEGMEnT_HPC",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "ArnauMontagud",
    "publication": [
        {
            "doi": "10.1371/journal.pone.0122192",
            "metadata": {
                "abstract": "Perhaps the greatest challenge currently facing the biomedical research community is the ability to integrate highly detailed cellular and molecular mechanisms to represent clinical disease states as a pathway to engineer effective therapeutics. This is particularly evident in the representation of organ-level pathophysiology in terms of abnormal tissue structure, which, through histology, remains a mainstay in disease diagnosis and staging. As such, being able to generate anatomic scale simulations is a highly desirable goal. While computational limitations have previously constrained the size and scope of multi-scale computational models, advances in the capacity and availability of high-performance computing (HPC) resources have greatly expanded the ability of computational models of biological systems to achieve anatomic, clinically relevant scale. Diseases of the intestinal tract are exemplary examples of pathophysiological processes that manifest at multiple scales of spatial resolution, with structural abnormalities present at the microscopic, macroscopic and organ-levels. In this paper, we describe a novel, massively parallel computational model of the gut, the Spatially Explicitly General-purpose Model of Enteric Tissue-HPC (SEGMEnT-HPC), which extends an existing model of the gut epithelium, SEGMEnT, in order to create cell-for-cell anatomic scale simulations. We present an example implementation of SEGMEnT-HPC that simulates the pathogenesis of ileal pouchitis, and important clinical entity that affects patients following remedial surgery for ulcerative colitis.",
                "authors": [
                    {
                        "name": "An G."
                    },
                    {
                        "name": "Chang E."
                    },
                    {
                        "name": "Christley S."
                    },
                    {
                        "name": "Cockrell R.C."
                    }
                ],
                "citationCount": 18,
                "date": "2015-03-25T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "Towards anatomic scale agent-based modeling with a massively parallel spatially explicit general-purpose model of enteric tissue (SEGMEnT-HPC)"
            },
            "pmcid": "PMC4373890",
            "pmid": "25806784"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Computational biology",
            "uri": "http://edamontology.org/topic_3307"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Systems biology",
            "uri": "http://edamontology.org/topic_2259"
        }
    ]
}
