{"credit":[],"labels":{"language":["Python"],"license":"MIT","topic":[{"term":"Phylogeny","uri":"http://edamontology.org/topic_0084"},{"term":"Genetic variation","uri":"http://edamontology.org/topic_0199"},{"term":"Oncology","uri":"http://edamontology.org/topic_2640"}]},"publication":[{"abstract":"© 2018 IEEE..Most of the evolutionary history reconstruction approaches are based on the infinite sites assumption, which states that mutations appear once in the evolutionary history. The Perfect Phylogeny model is the result of the infinite sites assumption and has been widely used to infer cancer evolution. Nonetheless, recent results show that recurrent and back mutations are present in the evolutionary history of tumors, hence the Perfect Phylogeny model might be too restrictive. We propose an approach that allows losing previously acquired mutations and multiple acquisitions of a character. Moreover, we provide an ILP formulation for the evolutionary tree reconstruction problem. Our formulation allows us to tackle both the Incomplete Directed Phylogeny problem and the Clonal Reconstruction problem when general evolutionary models are considered. The latter problem is fundamental in cancer genomics, the goal is to study the evolutionary history of a tumor considering as input data the fraction of cells having a certain mutation in a set of cancer samples. For the Clonal Reconstruction problem, an experimental analysis shows the advantage of allowing mutation losses. Namely, by analyzing real and simulated datasets, our ILP approach provides a better interpretation of the evolutionary history than a Perfect Phylogeny. The software is at https://github.com/AlgoLab/gppf.","authors":["Bonizzoni P.","Ciccolella S.","Della Vedova G.","Soto M."],"cit_count":0,"doi":"10.1109/TCBB.2018.2865729","journal":"IEEE/ACM Transactions on Computational Biology and Bioinformatics","pmid":"31603766","title":"Does Relaxing the Infinite Sites Assumption Give Better Tumor Phylogenies? An ILP-Based Comparative Approach","year":"2019-09-01"}],"summary":{"biotoolsCURIE":"biotools:gppf","biotoolsID":"gppf","description":"Does Relaxing the Infinite Sites Assumption Give Better Tumor Phylogenies? An ILP-Based Comparative Approach.\n\nGeneral Parsimony Phylogeny models from Frequencies.\n\ngppf [-h] -m {perfect,persistent,dollo,caminsokal} -f FILE [-k K] -t TIME -c CLONES [-e].\n\nTo reproduce experiments described in the paper the following are also required:.\n\n./gppf -m dollo -f data/simulated/n10_m20/21.sim -t 300 -c 1 -k 4 -e starts a Dollo(4) model with a time limit of 300 seconds (5 minutes), with a clone limit of 100% and with a experimental-format output.\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'ILP', 'ILP-Based', 'evolutionary', 'history'","homepage":"https://github.com/AlgoLab/gppf","name":"gppf"}}