{
    "accessibility": "Open access",
    "additionDate": "2022-09-18T22:17:40.905519Z",
    "biotoolsCURIE": "biotools:cview",
    "biotoolsID": "cview",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "john.archer@cibio.up.pt",
            "name": "John Archer",
            "orcidid": "https://orcid.org/0000-0001-6212-0962",
            "typeEntity": "Person"
        },
        {
            "name": "Diana Lobo",
            "orcidid": "http://orcid.org/0000-0001-6988-9993"
        },
        {
            "name": "Raquel Linheiro",
            "orcidid": "http://orcid.org/0000-0003-2659-0910"
        },
        {
            "name": "Stephen Sabatino",
            "orcidid": "https://orcid.org/0000-0003-2815-2375"
        }
    ],
    "description": "CView is an alignment visualizer that expands on the per-site representation of residues through the incorporation of a dynamic network that is based on the summarization of diversity present across different regions of the alignment. The relationship that sequence regions that are currently on screen have to other regions of diversity within the alignment can be observed, thus increasing intuitive insight.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://sourceforge.net/p/cview/wiki/Help/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Network visualisation",
                    "uri": "http://edamontology.org/operation_3925"
                },
                {
                    "term": "Sequence alignment",
                    "uri": "http://edamontology.org/operation_0292"
                },
                {
                    "term": "Sequence clustering",
                    "uri": "http://edamontology.org/operation_0291"
                }
            ]
        }
    ],
    "homepage": "https://sourceforge.net/projects/cview/",
    "language": [
        "Java"
    ],
    "lastUpdate": "2024-11-24T15:37:37.262996Z",
    "license": "Other",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://sourceforge.net/p/cview"
        },
        {
            "type": [
                "Repository"
            ],
            "url": "https://zenodo.org/record/6475667"
        }
    ],
    "name": "CView",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1371/journal.pone.0259726",
            "metadata": {
                "abstract": "To date basic visualization of sequence alignments have largely focused on displaying per-site columns of nucleotide, or amino acid, residues along with associated frequency summarizations. The persistence of this tendency to the recent tools designed for viewing mapped read data indicates that such a perspective not only provides a reliable visualization of per-site alterations, but also offers implicit reassurance to the end-user in relation to data accessibility. However, the initial insight gained is limited, something that is especially true when viewing alignments consisting of many sequences representing differing factors such as location, date and subtype. A basic alignment viewer can have potential to increase initial insight through visual enhancement, whilst not delving into the realms of complex sequence analysis. We present CView, a visualizer that expands on the per-site representation of residues through the incorporation of a dynamic network that is based on the summarization of diversity present across different regions of the alignment. Within the network, nodes are based on the clustering of sequence fragments that span windows placed consecutively along the alignment. Edges are placed between nodes of neighbouring windows where they share sequence identification(s), i.e. different regions of the same sequence(s). Thus, if a node is selected on the network, then the relationship that sequences passing through that node have to other regions of diversity within the alignment can be observed through path tracing. In addition to augmenting visual insight, CView provides export features including variant summarization, per-site residue and kmer frequencies, consensus sequence, alignment dissection as well as clustering; each useful across a range of research areas. The software has been designed to be user friendly, intuitive and interactive. It is open source and an executable jar, source code, quick start, usage tutorial and test data are available (under the GNU General Public License) from https://sourceforge.net/projects/cview/.",
                "authors": [
                    {
                        "name": "Archer J."
                    },
                    {
                        "name": "Linheiro R."
                    },
                    {
                        "name": "Lobo D."
                    },
                    {
                        "name": "Sabatino S."
                    }
                ],
                "date": "2022-06-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "CView: A network based tool for enhanced alignment visualization"
            },
            "pmcid": "PMC9191720",
            "pmid": "35696379"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ],
    "validated": 1
}
