{"credit":[{"email":"jose@jimenezluna.com","name":"José Jiménez","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"url":"http://bioconductor.org/packages/release/bioc/html/odseq.html"}],"download":[{"type":"Source code","url":"http://bioconductor/packages/release/bioc/src/contrib/odseq_1.2.0.tar.gz"}],"function":[{"operation":[{"term":"Sequence comparison","uri":"http://edamontology.org/operation_2451"},{"term":"Multiple sequence alignment","uri":"http://edamontology.org/operation_0492"}]}],"labels":{"collectionID":["BioConductor"],"language":["R"],"license":"MIT","operatingSystem":["Linux","Windows","Mac"],"toolType":["Command-line tool","Library"],"topic":[{"term":"Sequence analysis","uri":"http://edamontology.org/topic_0080"},{"term":"Nucleic acids","uri":"http://edamontology.org/topic_0077"}]},"publication":[{"abstract":"© 2015 Jehl et al. Background: Multiple sequence alignments (MSA) are widely used in sequence analysis for a variety of tasks. Outlier sequences can make downstream analyses unreliable or make the alignments less accurate while they are being constructed. This paper describes a simple method for automatically detecting outliers and accompanying software called OD-seq. It is based on finding sequences whose average distance to the rest of the sequences in a dataset, is anomalous. Results: The software can take a MSA, distance matrix or set of unaligned sequences as input. Outlier sequences are found by examining the average distance of each sequence to the rest. Anomalous average distances are then found using the interquartile range of the distribution of average distances or by bootstrapping them. The complexity of any analysis of a distance matrix is normally at least O(N 2) for N sequences. This is prohibitive for large N but is reduced here by using the mBed algorithm from Clustal Omega. This reduces the complexity to O(N log(N)) which makes even very large alignments easy to analyse on a single core. We tested the ability of OD-seq to detect outliers using artificial test cases of sequences from Pfam families, seeded with sequences from other Pfam families. Using a MSA as input, OD-seq is able to detect outliers with very high sensitivity and specificity. Conclusion: OD-seq is a practical and simple method to detect outliers in MSAs. It can also detect outliers in sets of unaligned sequences, but with reduced accuracy. For medium sized alignments, of a few thousand sequences, it can detect outliers in a few seconds. Software available as http://www.bioinf.ucd.ie/download/od-seq.tar.gz.","authors":["Jehl P.","Sievers F.","Higgins D.G."],"cit_count":5,"doi":"10.1186/s12859-015-0702-1","journal":"BMC Bioinformatics","title":"OD-seq: Outlier detection in multiple sequence alignments","type":"Primary","year":"2015-08-25"}],"summary":{"biotoolsCURIE":"biotools:odseq","biotoolsID":"odseq","description":"Performs outlier detection of sequences in a multiple sequence alignment using bootstrap of predefined distance metrics. Outlier sequences can make downstream analyses unreliable or make the alignments less accurate while they are being constructed. This package implements the OD-seq algorithm for aligned sequences and a variant using string kernels for unaligned sequences.","homepage":"http://bioconductor.org/packages/release/bioc/html/odseq.html","name":"odseq","version":["1.2.0"]}}