{
    "additionDate": "2019-07-03T16:37:22Z",
    "biotoolsCURIE": "biotools:iProt-Sub",
    "biotoolsID": "iProt-Sub",
    "credit": [
        {
            "typeEntity": "Project",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://iprot-sub.erc.monash.edu/help.html"
        }
    ],
    "description": "Integrated feature-based webserver in silico prediction of protease substrates and their cleavage sites for 38 different protease types, covering four major protease families: Aspartic (A), Cysteine (C), Metallo (M) and Serine (S).",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://iprot-sub.erc.monash.edu/help.html"
        }
    ],
    "download": [
        {
            "type": "Biological data",
            "url": "http://iprot-sub.erc.monash.edu.au/downloads.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein signal peptide detection",
                    "uri": "http://edamontology.org/operation_0418"
                },
                {
                    "term": "Protein secondary structure prediction",
                    "uri": "http://edamontology.org/operation_0267"
                },
                {
                    "term": "Protein cleavage site prediction",
                    "uri": "http://edamontology.org/operation_0422"
                }
            ]
        }
    ],
    "homepage": "http://iprot-sub.erc.monash.edu.au/",
    "lastUpdate": "2019-07-03T16:37:22Z",
    "name": "iProt-Sub",
    "owner": "Ruta",
    "publication": [
        {
            "doi": "10.1093/bib/bby028",
            "metadata": {
                "abstract": "© 2018 The Author(s) 2018. Published by Oxford University Press.Regulation of proteolysis plays a critical role in a myriad of important cellular processes. The key to better understanding the mechanisms that control this process is to identify the specific substrates that each protease targets. To address this, we have developed iProt-Sub, a powerful bioinformatics tool for the accurate prediction of protease-specific substrates and their cleavage sites. Importantly, iProt-Sub represents a significantly advanced version of its successful predecessor, PROSPER. It provides optimized cleavage site prediction models with better prediction performance and coverage for more species-specific proteases (4 major protease families and 38 different proteases). iProt-Sub integrates heterogeneous sequence and structural features and uses a two-step feature selection procedure to further remove redundant and irrelevant features in an effort to improve the cleavage site prediction accuracy. Features used by iProt-Sub are encoded by 11 different sequence encoding schemes, including local amino acid sequence profile, secondary structure, solvent accessibility and native disorder, which will allow a more accurate representation of the protease specificity of approximately 38 proteases and training of the prediction models. Benchmarking experiments using cross-validation and independent tests showed that iProt-Sub is able to achieve a better performance than several existing generic tools. We anticipate that iProt-Sub will be a powerful tool for proteome-wide prediction of protease-specific substrates and their cleavage sites, and will facilitate hypothesis-driven functional interrogation of protease-specific substrate cleavage and proteolytic events.",
                "authors": [
                    {
                        "name": "Song J."
                    },
                    {
                        "name": "Wang Y."
                    },
                    {
                        "name": "Li F."
                    },
                    {
                        "name": "Akutsu T."
                    },
                    {
                        "name": "Rawlings N.D."
                    },
                    {
                        "name": "Webb G.I."
                    },
                    {
                        "name": "Chou K.-C."
                    }
                ],
                "citationCount": 97,
                "date": "2019-03-22T00:00:00Z",
                "journal": "Briefings in Bioinformatics",
                "title": "IProt-Sub: A comprehensive package for accurately mapping and predicting protease-specific substrates and cleavage sites"
            },
            "pmcid": "PMC6556904",
            "pmid": "29897410",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application",
        "Web service"
    ],
    "topic": [
        {
            "term": "Protein binding sites",
            "uri": "http://edamontology.org/topic_3534"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ],
    "validated": 1
}