
{
    "credit": [
        {
            "email": "etienne.thevenot@cea.fr",
            "name": "Etienne A. Thevenot",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "url": "http://bioconductor.org/packages/release/bioc/html/ropls.html"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://bioconductor/packages/release/bioc/src/contrib/ropls_1.6.2.tar.gz"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Genome visualisation",
                    "uri": "http://edamontology.org/operation_3208"
                },
                {
                    "term": "Sequence feature detection",
                    "uri": "http://edamontology.org/operation_0253"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "labels": {
        "collectionID": [
            "BioConductor"
        ],
        "language": [
            "R"
        ],
        "license": "CECILL-2.1",
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Command-line tool",
            "Library"
        ],
        "topic": [
            {
                "term": "Omics",
                "uri": "http://edamontology.org/topic_3391"
            }
        ]
    },
    "link": [
        {
            "type": "MIRROR",
            "url": "http://dx.doi.org/10.1021/acs.jproteome.5b00354"
        }
    ],
    "publication": [
        {
            "abstract": "© 2015 American Chemical Society. Urine metabolomics is widely used for biomarker research in the fields of medicine and toxicology. As a consequence, characterization of the variations of the urine metabolome under basal conditions becomes critical in order to avoid confounding effects in cohort studies. Such physiological information is however very scarce in the literature and in metabolomics databases so far. Here we studied the influence of age, body mass index (BMI), and gender on metabolite concentrations in a large cohort of 183 adults by using liquid chromatography coupled with high-resolution mass spectrometry (LC-HRMS). We implemented a comprehensive statistical workflow for univariate hypothesis testing and modeling by orthogonal partial least-squares (OPLS), which we made available to the metabolomics community within the online Workflow4Metabolomics.org resource. We found 108 urine metabolites displaying concentration variations with either age, BMI, or gender, by integrating the results from univariate p-values and multivariate variable importance in projection (VIP). Several metabolite clusters were further evidenced by correlation analysis, and they allowed stratification of the cohort. In conclusion, our study highlights the impact of gender and age on the urinary metabolome, and thus it indicates that these factors should be taken into account for the design of metabolomics studies.",
            "authors": [
                "Thevenot E.A.",
                "Roux A.",
                "Xu Y.",
                "Ezan E.",
                "Junot C."
            ],
            "cit_count": 99,
            "doi": "10.1021/acs.jproteome.5b00354",
            "journal": "Journal of Proteome Research",
            "pmid": "26088811",
            "title": "Analysis of the Human Adult Urinary Metabolome Variations with Age, Body Mass Index, and Gender by Implementing a Comprehensive Workflow for Univariate and OPLS Statistical Analyses",
            "type": "Primary",
            "year": "2015-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:ropls",
        "biotoolsID": "ropls",
        "description": "The package includes methods for variable modeling as PCA or PLS, that can be useful for visualization, regression, classification, and feature selection of omics data where the number of variables exceeds the number of samples and with multicollinearity among variables. Orthogonal Partial Least Squares (OPLS) also enables to separately model the variation correlated (predictive) to the factor of interest and the uncorrelated (orthogonal) variation.",
        "homepage": "http://bioconductor.org/packages/release/bioc/html/ropls.html",
        "name": "ropls",
        "version": [
            "1.6.2"
        ]
    }
}