{
    "additionDate": "2023-09-07T13:47:32.532887Z",
    "biotoolsCURIE": "biotools:galaxygpcrloop",
    "biotoolsID": "galaxygpcrloop",
    "collectionID": [
        "gpcr"
    ],
    "description": "GalaxyGPCRloop models the second extracellular loop (ECL2) of G-protein-coupled receptor (GPCR) based on both template-based and ab initio approaches.",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://galaxy.seoklab.org/cgi-bin/submit.cgi?type=GPCRLOOP",
    "lastUpdate": "2024-02-14T09:28:59.023666Z",
    "name": "GalaxyGPCRloop",
    "owner": "laasfeld",
    "publication": [
        {
            "doi": "10.1021/acs.jcim.8b00148",
            "metadata": {
                "abstract": "The second extracellular loops (ECL2s) of G-protein-coupled receptors (GPCRs) are often involved in GPCR functions, and their structures have important implications in drug discovery. However, structure prediction of ECL2 is difficult because of its long length and the structural diversity among different GPCRs. In this study, a new ECL2 conformational sampling method involving both template-based and ab initio sampling was developed. Inspired by the observation of similar ECL2 structures of closely related GPCRs, a template-based sampling method employing loop structure templates selected from the structure database was developed. A new metric for evaluating similarity of the target loop to templates was introduced for template selection. An ab initio loop sampling method was also developed to treat cases without highly similar templates. The ab initio method is based on the previously developed fragment assembly and loop closure method. A new sampling component that takes advantage of secondary structure prediction was added. In addition, a conserved disulfide bridge restraining ECL2 conformation was predicted and analytically incorporated into sampling, reducing the effective dimension of the conformational search space. The sampling method was combined with an existing energy function for comparison with previously reported loop structure prediction methods, and the benchmark test demonstrated outstanding performance.",
                "authors": [
                    {
                        "name": "Lee G.R."
                    },
                    {
                        "name": "Park H."
                    },
                    {
                        "name": "Seok C."
                    },
                    {
                        "name": "Won J."
                    }
                ],
                "citationCount": 6,
                "date": "2018-06-25T00:00:00Z",
                "journal": "Journal of Chemical Information and Modeling",
                "title": "GalaxyGPCRloop: Template-Based and Ab Initio Structure Sampling of the Extracellular Loops of G-Protein-Coupled Receptors"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Protein structure analysis",
            "uri": "http://edamontology.org/topic_2814"
        },
        {
            "term": "Structure prediction",
            "uri": "http://edamontology.org/topic_0082"
        }
    ]
}
