{
    "additionDate": "2020-01-14T20:13:09Z",
    "biotoolsCURIE": "biotools:disaggregate_targets",
    "biotoolsID": "disaggregate_targets",
    "confidence_flag": "low",
    "credit": [
        {
            "email": "annebekelynck@hotmail.com",
            "name": "Anne Bekelynck",
            "orcidid": "https://orcid.org/0000-0003-0396-8626",
            "typeEntity": "Person"
        }
    ],
    "description": "Pepfar 3.0's HIV testing policy in Côte d'Ivoire (2014 to 2018).\n\nPEPFAR Panorama Spotlight.\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'data'",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Phasing",
                    "uri": "http://edamontology.org/operation_3454"
                }
            ]
        }
    ],
    "homepage": "https://data.pepfar.gov",
    "lastUpdate": "2020-01-14T20:13:09Z",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "https://data.pepfar.gov/glossary"
        }
    ],
    "name": "disaggregate targets",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1002/JIA2.25424",
            "metadata": {
                "abstract": "© 2019 The Authors. Journal of the International AIDS Society published by John Wiley & Sons Ltd on behalf of the International AIDS Society.Introduction: HIV Testing and Counselling (HTC) remains a key challenge in achieving control of the HIV epidemic by 2030. In the early 2010s, the President's Emergency Plan for AIDS Relief (Pepfar) adopted targeted HTC strategies for populations and geographical areas most affected by HIV. We examine how Pepfar defined targeted HTC in Côte d'Ivoire, a country with a mixed HIV epidemic, after a decade of expanding HTC services. Methods: We explored the evolution of HTC strategies through the Country Operational Plans (COP) of Pepfar during its phase 3.0, from COP 14 to COP 17 (October 2014 to September 2018) in Côte d'Ivoire. We conducted an analysis of the grey literature over the period 2014 to 2018 (Budget & Target Report, Strategic Direction Summary, Sustainability Index and Dashboard Summary, https://data.pepfar.gov). We also conducted a qualitative study in Côte d'Ivoire (2015 to 2018) using in-depth interviews with stakeholders in the AIDS public response: CDC/Pepfar (3), Ministry of Health (3), intermediary NGOs (7); and public meeting observations (14). Results: Since the COP 14, Pepfar's HIV testing strategies have been characterized by significant variations in terms of numerical, geographical and population targets. While the aim of COP 14 and COP 15 seemed to be the improvement of testing efficacy in general and testing yield in particular, COP 16 and COP 17 prioritized accelerating progress towards the “first 90” (i.e. reducing the proportion of people living with HIV who are unaware of their HIV). A shift was observed in the definition of testing targets, with less focus on the inclusion of programmatic data and feedback from field actors, and greater emphasis on the use of models to estimate and disaggregate the targets by geographical units and sub-populations (even if the availability of data by this disaggregation was limited or uncertain); increasingly leading to gaps between targets and results. Conclusions: These trials and tribulations question the real and long-term effectiveness of annually-revised, fragmented strategies, which widen an increasing disparity between the realities of the actors on the ground and the objectives set in Washington.",
                "authors": [
                    {
                        "name": "Bekelynck A."
                    },
                    {
                        "name": "Larmarange J."
                    },
                    {
                        "name": "Assoumou N."
                    },
                    {
                        "name": "Danel C."
                    },
                    {
                        "name": "Doumbia M."
                    },
                    {
                        "name": "Kone M."
                    },
                    {
                        "name": "Kouadio A."
                    },
                    {
                        "name": "Kra A."
                    },
                    {
                        "name": "Niangoran S."
                    },
                    {
                        "name": "Ouantchi H."
                    },
                    {
                        "name": "Sika L."
                    },
                    {
                        "name": "Carillon S."
                    },
                    {
                        "name": "Inghels M."
                    }
                ],
                "date": "2019-12-01T00:00:00Z",
                "journal": "Journal of the International AIDS Society",
                "title": "Pepfar 3.0’s HIV testing policy in Côte d'Ivoire (2014 to 2018): fragmentation, acceleration and disconnection"
            },
            "pmcid": "PMC6921083",
            "pmid": "31854504"
        }
    ],
    "topic": [
        {
            "term": "Public health and epidemiology",
            "uri": "http://edamontology.org/topic_3305"
        },
        {
            "term": "Literature and language",
            "uri": "http://edamontology.org/topic_3068"
        }
    ]
}