{
    "additionDate": "2016-02-25T10:38:00Z",
    "biotoolsCURIE": "biotools:simexpr2sampledata",
    "biotoolsID": "simexpr2sampledata",
    "credit": [
        {
            "name": "ELIXIR-ITA-PADOVA",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        },
        {
            "email": "barbara.dicamillo@unipd.it",
            "name": "Barbara Di Camillo",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.dei.unipd.it/~dicamill/"
        }
    ],
    "description": "Methodologies for the discovery of biomarkers related to diseases using microarray data often provide limited results, due to the dataset size, the heterogeneity of the disease and the heterogeneity of experimental protocols and computational pipelines employed in the analysis. Focusing on the first two issues, a simulation schema was developed to outline advantages and drawbacks of classification and feature selection methods on a benchmark with known biomarkers.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://sysbiobig.dei.unipd.it/?q=Software#SimExpr2SampleData"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "note": "SimExpr2SampleData contains simulated gene expression data for the benchmarking of different classification and feature selection methods. The datasets are matrices representing the simulated expression values of 10000 genes (G1, G2,....G10000) for 1000 subjects, partitioned into two groups of subjects (healthy vs. diseased or two different variants of the same disease). SimExpr2SampleData also includes the list of the genes selected as putative biomarkers having expression modified by the knock-out (down) in the diseased subjects.",
            "operation": [
                {
                    "term": "Simulated gene expression data generation",
                    "uri": "http://edamontology.org/operation_3566"
                }
            ]
        }
    ],
    "homepage": "http://sysbiobig.dei.unipd.it/?q=Software#SimExpr2SampleData",
    "lastUpdate": "2018-12-10T12:58:50Z",
    "name": "SimExpr2SampleData",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "ELIXIR-ITA-PADOVA",
    "publication": [
        {
            "doi": "10.1371/journal.pone.0032200",
            "metadata": {
                "abstract": "Motivation: The identification of robust lists of molecular biomarkers related to a disease is a fundamental step for early diagnosis and treatment. However, methodologies for the discovery of biomarkers using microarray data often provide results with limited overlap. These differences are imputable to 1) dataset size (few subjects with respect to the number of features); 2) heterogeneity of the disease; 3) heterogeneity of experimental protocols and computational pipelines employed in the analysis. In this paper, we focus on the first two issues and assess, both on simulated (through an in silico regulation network model) and real clinical datasets, the consistency of candidate biomarkers provided by a number of different methods. Methods: We extensively simulated the effect of heterogeneity characteristic of complex diseases on different sets of microarray data. Heterogeneity was reproduced by simulating both intrinsic variability of the population and the alteration of regulatory mechanisms. Population variability was simulated by modeling evolution of a pool of subjects; then, a subset of them underwent alterations in regulatory mechanisms so as to mimic the disease state. Results: The simulated data allowed us to outline advantages and drawbacks of different methods across multiple studies and varying number of samples and to evaluate precision of feature selection on a benchmark with known biomarkers. Although comparable classification accuracy was reached by different methods, the use of external cross-validation loops is helpful in finding features with a higher degree of precision and stability. Application to real data confirmed these results. © 2012 Di Camillo et al.",
                "authors": [
                    {
                        "name": "Di Camillo B."
                    },
                    {
                        "name": "Sanavia T."
                    },
                    {
                        "name": "Martini M."
                    },
                    {
                        "name": "Jurman G."
                    },
                    {
                        "name": "Sambo F."
                    },
                    {
                        "name": "Barla A."
                    },
                    {
                        "name": "Squillario M."
                    },
                    {
                        "name": "Furlanello C."
                    },
                    {
                        "name": "Toffolo G."
                    },
                    {
                        "name": "Cobelli C."
                    }
                ],
                "citationCount": 17,
                "date": "2012-03-05T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "Effect of size and heterogeneity of samples on biomarker discovery: Synthetic and real data assessment"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Computational biology",
            "uri": "http://edamontology.org/topic_3307"
        }
    ],
    "validated": 1,
    "version": [
        "1.0"
    ]
}