{
    "additionDate": "2024-07-24T11:16:01.022953Z",
    "biotoolsCURIE": "biotools:thpdb2",
    "biotoolsID": "thpdb2",
    "credit": [
        {
            "email": "raghava@iiitd.ac.in",
            "name": "Dr. Gajendra P. S. Raghava",
            "url": "https://webs.iiitd.edu.in/raghava/"
        }
    ],
    "description": "THPDB2 is an updated version of ThPDB developed for peptide-based therapeutics. It is a comprehensive database of detailed information about the approved and approved/investigational therapeutic protiens/peptides.",
    "editPermission": {
        "type": "private"
    },
    "homepage": "https://webs.iiitd.edu.in/raghava/thpdb2/",
    "lastUpdate": "2024-07-24T11:16:01.028838Z",
    "link": [
        {
            "type": [
                "Service"
            ],
            "url": "https://webs.iiitd.edu.in/raghava/thpdb2/"
        }
    ],
    "name": "THPDB2",
    "owner": "raghavagps",
    "publication": [
        {
            "doi": "10.1016/j.drudis.2024.104047",
            "metadata": {
                "abstract": "During the past 20 years, there has been a significant increase in the number of protein-based drugs approved by the US Food and Drug Administration (FDA). This paper presents THPdb2, an updated version of the THPdb database, which holds information about all types of protein-based drugs, including peptides, antibodies, and biosimilar proteins. THPdb2 contains a total of 6,385 entries, providing comprehensive information about 894 FDA-approved therapeutic proteins, including 354 monoclonal antibodies and 85 peptides or polypeptides. Each entry includes the name of therapeutic molecule, the amino acid sequence, physical and chemical properties, and route of drug administration. The therapeutic molecules that are included in the database target a wide range of biological molecules, such as receptors, factors, and proteins, and have been approved for the treatment of various diseases, including cancers, infectious diseases, and immune disorders.",
                "authors": [
                    {
                        "name": "Gupta S."
                    },
                    {
                        "name": "Jain S."
                    },
                    {
                        "name": "Patiyal S."
                    },
                    {
                        "name": "Raghava G.P.S."
                    }
                ],
                "date": "2024-07-01T00:00:00Z",
                "journal": "Drug Discovery Today",
                "title": "THPdb2: compilation of FDA approved therapeutic peptides and proteins"
            }
        }
    ]
}
