{
    "additionDate": "2018-07-17T14:30:55Z",
    "biotoolsCURIE": "biotools:convaq",
    "biotoolsID": "convaq",
    "credit": [
        {
            "email": "sjlarsen@imada.sdu.dk",
            "name": "Simon Larsen",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "jan.baumbach@wzw.tum.de",
            "name": "Jan Baumbach",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Search for variations that are overrepresented in a population. CNV-based association study between two groups of samples.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://convaq.compbio.sdu.dk/vignettes/convaq-manual.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Mutation detection",
                    "uri": "http://edamontology.org/operation_3202"
                }
            ]
        }
    ],
    "homepage": "https://convaq.compbio.sdu.dk/",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-10T12:59:00Z",
    "name": "CoNVaQ",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1186/s12864-018-4732-8",
            "metadata": {
                "abstract": "© 2018 The Author(s).Background: Copy number variations (CNVs) are large segments of the genome that are duplicated or deleted. Structural variations in the genome have been linked to many complex diseases. Similar to how genome-wide association studies (GWAS) have helped discover single-nucleotide polymorphisms linked to disease phenotypes, the extension of GWAS to CNVs has aided the discovery of structural variants associated with human traits and diseases. Results: We present CoNVaQ, an easy-to-use web-based tool for CNV-based association studies. The web service allows users to upload two sets of CNV segments and search for genomic regions where the occurrence of CNVs is significantly associated with the phenotype. CoNVaQ provides two models: a simple statistical model using Fisher's exact test and a novel query-based model matching regions to user-defined queries. For each region, the method computes a global q-value statistic by repeated permutation of samples among the populations. We demonstrate our platform by using it to analyze a data set of HPV-positive and HPV-negative penile cancer patients. Conclusions: CoNVaQ provides a simple workflow for performing CNV-based association studies. It is made available as a web platform in order to provide a user-friendly workflow for biologists and clinicians to carry out CNV data analysis without installing any software. Through the web interface, users are also able to analyze their results to find overrepresented GO terms and pathways. In addition, our method is also available as a package for the R programming language. CoNVaQ is available at https://convaq.compbio.sdu.dk.",
                "authors": [
                    {
                        "name": "Larsen S.J."
                    },
                    {
                        "name": "do Canto L.M."
                    },
                    {
                        "name": "Rogatto S.R."
                    },
                    {
                        "name": "Baumbach J."
                    }
                ],
                "citationCount": 7,
                "date": "2018-05-18T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "CoNVaQ: A web tool for copy number variation-based association studies"
            },
            "pmcid": "PMC5960125",
            "pmid": "29776329"
        }
    ],
    "toolType": [
        "Library",
        "Web application"
    ],
    "topic": [
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "DNA structural variation",
            "uri": "http://edamontology.org/topic_3175"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        }
    ],
    "validated": 1
}