{
    "accessibility": "Open access",
    "additionDate": "2021-03-19T08:37:02Z",
    "biotoolsCURIE": "biotools:co-var",
    "biotoolsID": "co-var",
    "confidence_flag": "high",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "mukishi@gmail.com",
            "name": "Saikat Chakrabarti",
            "typeEntity": "Person"
        },
        {
            "email": "saikat@iicb.res.in",
            "name": "Ishita Mukherjee",
            "typeEntity": "Person"
        }
    ],
    "description": "Co-Var is a web-server for studying intra-protein or inter-molecular co-evolution.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein interaction prediction",
                    "uri": "http://edamontology.org/operation_2492"
                },
                {
                    "term": "Protein-protein binding site prediction",
                    "uri": "http://edamontology.org/operation_2464"
                },
                {
                    "term": "Residue contact prediction",
                    "uri": "http://edamontology.org/operation_0272"
                }
            ]
        }
    ],
    "homepage": "http://www.hpppi.iicb.res.in/ishi/covar/index.html",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-11-19T20:08:12.965367Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/Ishita2690/Co-Var"
        }
    ],
    "name": "Co-Var",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1016/J.CSBJ.2021.06.039",
            "metadata": {
                "abstract": "© 2021 The AuthorsProteins involved in interactions throughout the course of evolution tend to co-evolve and compensatory changes may occur in interacting proteins to maintain or refine such interactions. However, certain residue pair alterations may prove to be detrimental for functional interactions. Hence, determining co-evolutionary pairings that could be structurally or functionally relevant for maintaining the conservation of an inter-protein interaction is important. Inter-protein co-evolution analysis in several complexes utilizing multiple existing methodologies suggested that co-evolutionary pairings can occur in spatially proximal and distant regions in inter-protein interactions. Subsequently, the Co-Var (Correlated Variation) method based on mutual information and Bhattacharyya coefficient was developed, validated, and found to perform relatively better than CAPS and EV-complex. Interestingly, while applying the Co-Var measure and EV-complex program on a set of protein–protein interaction complexes, co-evolutionary pairings were obtained in interface and non-interface regions in protein complexes. The Co-Var approach involves determining high degree co-evolutionary pairings that include multiple co-evolutionary connections between particular co-evolved residue positions in one protein with multiple residue positions in the binding partner. Detailed analyses of high degree co-evolutionary pairings in protein–protein complexes involved in cancer metastasis suggested that most of the residue positions forming such co-evolutionary connections mainly occurred within functional domains of constituent proteins and substitution mutations were also common among these positions. The physiological relevance of these predictions suggested that Co-Var can predict residues that could be crucial for preserving functional protein–protein interactions. Finally, Co-Var web server (http://www.hpppi.iicb.res.in/ishi/covar/index.html) that implements this methodology identifies co-evolutionary pairings in intra and inter-protein interactions.",
                "authors": [
                    {
                        "name": "Chakrabarti S."
                    },
                    {
                        "name": "Mukherjee I."
                    }
                ],
                "date": "2021-01-01T00:00:00Z",
                "journal": "Computational and Structural Biotechnology Journal",
                "title": "Co-evolutionary landscape at the interface and non-interface regions of protein-protein interaction complexes"
            },
            "pmcid": "PMC8271121",
            "pmid": "34285778"
        }
    ],
    "toolType": [
        "Bioinformatics portal",
        "Suite"
    ],
    "topic": [
        {
            "term": "Evolutionary biology",
            "uri": "http://edamontology.org/topic_3299"
        },
        {
            "term": "Molecular evolution",
            "uri": "http://edamontology.org/topic_3945"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
