{
    "additionDate": "2020-01-14T09:25:06Z",
    "biotoolsCURIE": "biotools:PeSA_autogenerated",
    "biotoolsID": "PeSA_autogenerated",
    "confidence_flag": "medium",
    "description": "A software tool for peptide specificity analysis.\n\nThe discovery and characterization of molecular interactions is crucial towards a better understanding of complex biological processes. Particularly protein-protein interactions (i.e., PPIs), which are responsible for a variety of cellular functions from intracellular signaling to enzyme-substrate specificity, have been studied broadly over the past decades. Position-specific scoring matrices (PSSM) in particular are used extensively to help determine interaction specificity or candidate interaction motifs at the residue level. However, not all studies successfully report their results as a candidate interaction motif. In many cases, this may be due to a lack of suitable tools for simple analysis and motif generation.\n\n||| HOMEPAGE MISSING!.\n\n||| NAME EQUAL TO (PUB. DIFFERENT) bio.tools/PeSA",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence visualisation",
                    "uri": "http://edamontology.org/operation_0564"
                }
            ]
        }
    ],
    "homepage": "https://www.ncbi.nlm.nih.gov/pubmed/?term=31677504",
    "lastUpdate": "2020-01-14T09:25:06Z",
    "name": "PeSA_autogenerated",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1016/J.COMPBIOLCHEM.2019.107145",
            "metadata": {
                "abstract": "© 2019 Elsevier LtdThe discovery and characterization of molecular interactions is crucial towards a better understanding of complex biological processes. Particularly protein-protein interactions (i.e., PPIs), which are responsible for a variety of cellular functions from intracellular signaling to enzyme-substrate specificity, have been studied broadly over the past decades. Position-specific scoring matrices (PSSM) in particular are used extensively to help determine interaction specificity or candidate interaction motifs at the residue level. However, not all studies successfully report their results as a candidate interaction motif. In many cases, this may be due to a lack of suitable tools for simple analysis and motif generation. Peptide Specificity Analyst (PeSA) was developed with the goal of filling this information gap and providing an easy to use software to aid peptide array analysis and motif generation. PeSA utilizes two models of motif creation: (1) frequency-based using a user-defined peptide list, and (2) weight-based using experimental binding results. The ability to produce motifs effortlessly will make studying, interpreting and disseminating peptide specificity results in an effortless and straightforward process.",
                "authors": [
                    {
                        "name": "Topcu E."
                    },
                    {
                        "name": "Biggar K.K."
                    }
                ],
                "date": "2019-12-01T00:00:00Z",
                "journal": "Computational Biology and Chemistry",
                "title": "PeSA: A software tool for peptide specificity analysis"
            },
            "pmid": "31677504"
        }
    ],
    "topic": [
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Sequence sites, features and motifs",
            "uri": "http://edamontology.org/topic_0160"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        }
    ]
}