{
    "accessibility": "Open access",
    "additionDate": "2022-06-10T14:57:50.947451Z",
    "biotoolsCURIE": "biotools:color.bio",
    "biotoolsID": "color.bio",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "sunanda@exsitu.bio",
            "name": "Sunanda Sharma",
            "orcidid": "https://orcid.org/0000-0001-8822-7960",
            "typeEntity": "Person"
        },
        {
            "email": "vera.meyer@tu-berlin.de",
            "name": "Vera Meyer",
            "orcidid": "https://orcid.org/0000-0002-2298-2258",
            "typeEntity": "Person"
        }
    ],
    "description": "An interdisciplinary artist-in-residence project to research fungal pigments as a gateway to empathy and understanding of microbial life",
    "editPermission": {
        "type": "public"
    },
    "homepage": "http://color.bio",
    "lastUpdate": "2022-06-10T14:57:50.950446Z",
    "name": "color.bio",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1186/S40694-021-00130-7",
            "metadata": {
                "abstract": "© 2022, The Author(s).Background: Biological pigmentation is one of the most intriguing traits of many fungi. It holds significance to scientists, as a sign of biochemical metabolism and organism-environment interaction, and to artists, as the source of natural colors that capture the beauty of the microbial world. Furthermore, the functional roles and aesthetic appeal of biological pigmentation may be a path to inspiring human empathy for microorganisms, which is key to understanding and preserving microbial biodiversity. A project focused on cross-species empathy was initiated and conducted as part of an artist-in-residence program in 2021. The aim of this residency is to bridge the current divide between science and art through interdisciplinary practice focused on fungi. Results: The residency resulted in multiple products that are designed for artistic and scientific audiences with the central theme of biological pigmentation in fungi and other microorganisms. The first product is a video artwork that focuses on Aspergillus niger as a model organism that produces melanin pigment in a biosynthetic process similar to that of humans. The growth and morphology of this commonplace organism are displayed through video, photo, animation, and time-lapse footage, inviting the viewer to examine the likenesses and overlaps between humans and fungi. The second product is The Living Color Database, an online compendium of biological colors for scientists, artists, and designers. It links organisms across the tree of life, focusing on fungi, bacteria, and archaea, and the colors they express through biological pigmentation. Each pigment is represented in terms of its chemistry, its related biosynthesis, and its color expressions according to different indices: HEX, RGB, and Pantone. It is available at color.bio. Conclusions: As fungal biotechnology continues to mature into new application areas, it is as important as ever that there is human empathy for these organisms to promote the preservation and appreciation of fungal biodiversity. The products presented here provide paths for artists, scientists, and designers to understand microorganisms through the lens of color, promoting interspecies empathy through research, teaching, and practice.",
                "authors": [
                    {
                        "name": "Meyer V."
                    },
                    {
                        "name": "Sharma S."
                    }
                ],
                "citationCount": 2,
                "date": "2022-12-01T00:00:00Z",
                "journal": "Fungal Biology and Biotechnology",
                "title": "The colors of life: an interdisciplinary artist-in-residence project to research fungal pigments as a gateway to empathy and understanding of microbial life"
            },
            "pmcid": "PMC8744264",
            "pmid": "35012670"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Biodiversity",
            "uri": "http://edamontology.org/topic_3050"
        },
        {
            "term": "Biotechnology",
            "uri": "http://edamontology.org/topic_3297"
        },
        {
            "term": "Chemistry",
            "uri": "http://edamontology.org/topic_3314"
        },
        {
            "term": "Microbial ecology",
            "uri": "http://edamontology.org/topic_3697"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        }
    ],
    "validated": 1
}
