{
    "accessibility": "Open access",
    "additionDate": "2024-04-16T14:03:57.384386Z",
    "biotoolsCURIE": "biotools:cirscan",
    "biotoolsID": "cirscan",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "yuna.blum@univ-rennes.fr",
            "name": "Yuna Blum",
            "typeEntity": "Person"
        },
        {
            "name": "Rose-Marie Fraboulet",
            "typeEntity": "Person"
        }
    ],
    "description": "Shiny application to identify differentially active sponge mechanisms and visualize circRNA-miRNA-mRNA networks.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene-set enrichment analysis",
                    "uri": "http://edamontology.org/operation_2436"
                },
                {
                    "term": "Network visualisation",
                    "uri": "http://edamontology.org/operation_3925"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://gitlab.com/geobioinfo/cirscan_Rshiny",
    "language": [
        "R"
    ],
    "lastUpdate": "2024-04-16T14:05:09.344226Z",
    "license": "GPL-3.0",
    "name": "Cirscan",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/s12859-024-05668-y",
            "metadata": {
                "abstract": "Background: Non-coding RNAs represent a large part of the human transcriptome and have been shown to play an important role in disease such as cancer. However, their biological functions are still incompletely understood. Among non-coding RNAs, circular RNAs (circRNAs) have recently been identified for their microRNA (miRNA) sponge function which allows them to modulate the expression of miRNA target genes by taking on the role of competitive endogenous RNAs (ce-circRNAs). Today, most computational tools are not adapted to the search for ce-circRNAs or have not been developed for the search for ce-circRNAs from user’s transcriptomic data. Results: In this study, we present Cirscan (CIRcular RNA Sponge CANdidates), an interactive Shiny application that automatically infers circRNA–miRNA–mRNA networks from human multi-level transcript expression data from two biological conditions (e.g. tumor versus normal conditions in the case of cancer study) in order to identify on a large scale, potential sponge mechanisms active in a specific condition. Cirscan ranks each circRNA–miRNA–mRNA subnetwork according to a sponge score that integrates multiple criteria based on interaction reliability and expression level. Finally, the top ranked sponge mechanisms can be visualized as networks and an enrichment analysis is performed to help its biological interpretation. We showed on two real case studies that Cirscan is capable of retrieving sponge mechanisms previously described, as well as identifying potential novel circRNA sponge candidates. Conclusions: Cirscan can be considered as a companion tool for biologists, facilitating their ability to prioritize sponge mechanisms for experimental validations and identifying potential therapeutic targets. Cirscan is implemented in R, released under the license GPL-3 and accessible on GitLab (https://gitlab.com/geobioinfo/cirscan_Rshiny ). The scripts used in this paper are also provided on Gitlab (https://gitlab.com/geobioinfo/cirscan_paper ).",
                "authors": [
                    {
                        "name": "Aubry M."
                    },
                    {
                        "name": "Blum Y."
                    },
                    {
                        "name": "Corre S."
                    },
                    {
                        "name": "Fraboulet R.-M."
                    },
                    {
                        "name": "Galibert M.-D."
                    },
                    {
                        "name": "Si Ahmed Y."
                    }
                ],
                "date": "2024-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Cirscan: a shiny application to identify differentially active sponge mechanisms and visualize circRNA–miRNA–mRNA networks"
            },
            "pmcid": "PMC10832221",
            "pmid": "38302900"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ]
}
