
{
    "credit": [
        {
            "email": "hamann@cs.ucdavis.edu",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://bdtnp.lbl.gov/Fly-Net/pcx.jsp?w=vis"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Gene expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                },
                {
                    "term": "Pathway or network visualisation",
                    "uri": "http://edamontology.org/operation_3083"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Desktop application"
        ],
        "topic": [
            {
                "term": "Gene expression",
                "uri": "http://edamontology.org/topic_0203"
            },
            {
                "term": "Data visualisation",
                "uri": "http://edamontology.org/topic_0092"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://www.mybiosoftware.com/pointcloudxplore-2-0-visualization-analysis-data-pointcloud-virtual-embryo-files.html"
        }
    ],
    "publication": [
        {
            "abstract": "During animal development, complex patterns of gene expression provide positional information within the embryo. To better understand the underlying gene regulatory networks, the Berkeley Drosophila Transcription Network Project (BDTNP) has developed methods that support quantitative computational analysis of three-dimensional (3D) gene expression in early Drosophila embryos at cellular resolution. We introduce PointCloudXplore (PCX), an interactive visualization tool that supports visual exploration of relationships between different genes' expression using a combination of established visualization techniques. Two aspects of gene expression are of particular interest: 1) gene expression patterns defined by the spatial locations of cells expressing a gene and 2) relationships between the expression levels of multiple genes. PCX provides users with two corresponding classes of data views: 1) Physical Views based on the spatial relationships of cells in the embryo and 2) Abstract Views that discard spatial information and plot expression levels of multiple genes with respect to each other. Cell Selectors highlight data associated with subsets of embryo cells within a View. Using linking, these selected cells can be viewed in multiple representations. We describe PCX as a 3D gene expression visualization tool and provide examples of how it has been used by BDTNP biologists to generate new hypotheses. © 2006 IEEE.",
            "authors": [
                "Weber G.H.",
                "Rubel O.",
                "Huang M.-Y.",
                "Depace A.H.",
                "Fowlkes C.C.",
                "Keranen S.V.E.",
                "Luengo Hendriks C.L.",
                "Hagen H.",
                "Knowles D.W.",
                "Malik J.",
                "Biggin M.D.",
                "Hamann B."
            ],
            "cit_count": 26,
            "journal": "IEEE/ACM Transactions on Computational Biology and Bioinformatics",
            "pmid": "19407353",
            "title": "Visual exploration of three-dimensional gene expression using physical views and linked abstract views",
            "year": "2009-04-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:pointcloudxplore",
        "biotoolsID": "pointcloudxplore",
        "description": "Visualization tool for the PointCloud and Virtual Embryo data sets. It was developed to help biologists understand the relationship between gene expression patterns in three dimensions.",
        "homepage": "http://bdtnp.lbl.gov/Fly-Net/bioimaging.jsp?w=pcx",
        "name": "PointCloudXplore"
    }
}