{
    "additionDate": "2018-06-30T16:56:49Z",
    "biotoolsCURIE": "biotools:wdl-rf",
    "biotoolsID": "wdl-rf",
    "credit": [
        {
            "email": "yangzhanglab@umich.ed",
            "name": "Support",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Novel pipeline for bioactivity prediction of GPCR-associated ligand molecules.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://zhanglab.ccmb.med.umich.edu/WDL-RF/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein-ligand docking",
                    "uri": "http://edamontology.org/operation_0482"
                }
            ]
        }
    ],
    "homepage": "https://zhanglab.ccmb.med.umich.edu/WDL-RF/",
    "lastUpdate": "2018-12-10T12:58:59Z",
    "name": "WDL-RF",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/bty070",
            "metadata": {
                "abstract": "© The Author(s) 2018. Published by Oxford University Press. All rights reserved.Motivation: Precise assessment of ligand bioactivities (including IC50, EC50, Ki, Kd, etc.) is essential for virtual screening and lead compound identification. However, not all ligands have experimentally determined activities. In particular, many G protein-coupled receptors (GPCRs), which are the largest integral membrane protein family and represent targets of nearly 40% drugs on the market, lack published experimental data about ligand interactions. Computational methods with the ability to accurately predict the bioactivity of ligands can help efficiently address this problem. Results: We proposed a new method, WDL-RF, using weighted deep learning and random forest, to model the bioactivity of GPCR-associated ligand molecules. The pipeline of our algorithm consists of two consecutive stages: (i) molecular fingerprint generation through a new weighted deep learning method, and (ii) bioactivity calculations with a random forest model; where one uniqueness of the approach is that the model allows end-to-end learning of prediction pipelines with input ligands being of arbitrary size. The method was tested on a set of twenty-six non-redundant GPCRs that have a high number of active ligands, each with 200?4000 ligand associations. The results from our benchmark show that WDL-RF can generate bioactivity predictions with an average rootmean square error 1.33 and correlation coefficient (r2) 0.80 compared to the experimental measurements, which are significantly more accurate than the control predictors with different molecular fingerprints and descriptors. In particular, data-driven molecular fingerprint features, as extracted from the weighted deep learning models, can help solve deficiencies stemming from the use of traditional hand-crafted features and significantly increase the efficiency of short molecular fingerprints in virtual screening.",
                "authors": [
                    {
                        "name": "Wu J."
                    },
                    {
                        "name": "Zhang Q."
                    },
                    {
                        "name": "Wu W."
                    },
                    {
                        "name": "Pang T."
                    },
                    {
                        "name": "Hu H."
                    },
                    {
                        "name": "Chan W.K.B."
                    },
                    {
                        "name": "Ke X."
                    },
                    {
                        "name": "Zhang Y."
                    }
                ],
                "citationCount": 2,
                "date": "2018-07-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "WDL-RF: Predicting bioactivities of ligand molecules acting with G protein-coupled receptors by combining weighted deep learning and random forest"
            }
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "Compound libraries and screening",
            "uri": "http://edamontology.org/topic_3343"
        }
    ],
    "validated": 1
}