{
    "additionDate": "2021-01-18T09:44:30Z",
    "biotoolsCURIE": "biotools:coronet",
    "biotoolsID": "coronet",
    "collectionID": [
        "COVID-19"
    ],
    "confidence_flag": "tool",
    "credit": [
        {
            "name": "Asif Iqbal Khan",
            "typeEntity": "Person"
        }
    ],
    "description": "CoroNet is a Deep Convolutional Neural Network model to automatically detect Covid-19 infection from chest X-ray images. The deep model called CoroNet has been trained and tested on a dataset prepared by collecting Covid-19 and other chest pneumonia X-ray images from two different publically available databases.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/drkhan107/CoroNet",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-02-17T15:59:57Z",
    "license": "GPL-3.0",
    "name": "CoroNet",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1016/J.CMPB.2020.105581",
            "metadata": {
                "abstract": "© 2020Background and Objective: The novel Coronavirus also called COVID-19 originated in Wuhan, China in December 2019 and has now spread across the world. It has so far infected around 1.8 million people and claimed approximately 114,698 lives overall. As the number of cases are rapidly increasing, most of the countries are facing shortage of testing kits and resources. The limited quantity of testing kits and increasing number of daily cases encouraged us to come up with a Deep Learning model that can aid radiologists and clinicians in detecting COVID-19 cases using chest X-rays. Methods: In this study, we propose CoroNet, a Deep Convolutional Neural Network model to automatically detect COVID-19 infection from chest X-ray images. The proposed model is based on Xception architecture pre-trained on ImageNet dataset and trained end-to-end on a dataset prepared by collecting COVID-19 and other chest pneumonia X-ray images from two different publically available databases. Results: CoroNet has been trained and tested on the prepared dataset and the experimental results show that our proposed model achieved an overall accuracy of 89.6%, and more importantly the precision and recall rate for COVID-19 cases are 93% and 98.2% for 4-class cases (COVID vs Pneumonia bacterial vs pneumonia viral vs normal). For 3-class classification (COVID vs Pneumonia vs normal), the proposed model produced a classification accuracy of 95%. The preliminary results of this study look promising which can be further improved as more training data becomes available. Conclusion: CoroNet achieved promising results on a small prepared dataset which indicates that given more data, the proposed model can achieve better results with minimum pre-processing of data. Overall, the proposed model substantially advances the current radiology based methodology and during COVID-19 pandemic, it can be very helpful tool for clinical practitioners and radiologists to aid them in diagnosis, quantification and follow-up of COVID-19 cases.",
                "authors": [
                    {
                        "name": "Bhat M.M."
                    },
                    {
                        "name": "Khan A.I."
                    },
                    {
                        "name": "Shah J.L."
                    }
                ],
                "citationCount": 182,
                "date": "2020-11-01T00:00:00Z",
                "journal": "Computer Methods and Programs in Biomedicine",
                "title": "CoroNet: A deep neural network for detection and diagnosis of COVID-19 from chest x-ray images"
            },
            "pmcid": "PMC7274128",
            "pmid": "32534344"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        },
        {
            "term": "Tomography",
            "uri": "http://edamontology.org/topic_3452"
        }
    ]
}
