{
    "accessibility": "Open access",
    "additionDate": "2019-08-09T13:20:03Z",
    "biotoolsCURIE": "biotools:RSI",
    "biotoolsID": "RSI",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "li.hu@mayo.edu",
            "name": "Hu Li",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Regulostat Inferelator (RSI) - network biology platform to uncover molecular devices that predetermine cellular response phenotypes.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://rsi.hulilab.org/"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://file.hulilab.org/rsi/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Expression correlation analysis",
                    "uri": "http://edamontology.org/operation_3463"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                },
                {
                    "term": "Gene-set enrichment analysis",
                    "uri": "http://edamontology.org/operation_2436"
                }
            ]
        }
    ],
    "homepage": "http://rsi.hulilab.org/",
    "lastUpdate": "2020-06-16T10:55:26Z",
    "license": "Unlicense",
    "maturity": "Mature",
    "name": "RSI",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "hans",
    "publication": [
        {
            "doi": "10.1093/NAR/GKZ417",
            "metadata": {
                "abstract": "© The Author(s) 2019. Published by Oxford University Press on behalf of Nucleic Acids Research.With the emergence of genome editing technologies and synthetic biology, it is now possible to engineer genetic circuits driving a cell's phenotypic response to a stressor. However, capturing a continuous response, rather than simply a binary 'on' or 'off' response, remains a bioengineering challenge. No tools currently exist to identify gene candidates responsible for predetermining and fine-tuning cell response phenotypes. To address this gap, we devised a novel Regulostat Inferelator (RSI) algorithm to decipher intrinsic molecular devices or networks that predetermine cellular phenotypic responses. The RSI algorithm is designed to extract gene expression patterns from basal transcriptomic data in order to identify 'regulostat' constituent gene pairs, which exhibit rheostat-like mode-of-cooperation capable of fine-tuning cellular response. Our proof-of-concept study provides computational evidence for the existence of regulostats and that these networks predetermine cellular response prior to exposure to a stressor or drug. In addition, our work, for the first time, provides evidence of context-specific, drug-regulostat interactions in predetermining drug response phenotypes in cancer cells. Given RSI-inferred regulostat networks offer insights for prioritizing gene candidates capable of rendering a resistant phenotype sensitive to a given drug, we envision that this tool will be of great value in bioengineering and medicine.",
                "authors": [
                    {
                        "name": "Ung C.Y."
                    },
                    {
                        "name": "Ghanat Bari M."
                    },
                    {
                        "name": "Zhang C."
                    },
                    {
                        "name": "Liang J."
                    },
                    {
                        "name": "Correia C."
                    },
                    {
                        "name": "Li H."
                    }
                ],
                "date": "2019-08-22T00:00:00Z",
                "journal": "Nucleic acids research",
                "title": "Regulostat Inferelator: a novel network biology platform to uncover molecular devices that predetermine cellular response phenotypes"
            },
            "pmid": "31114928",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Bioengineering",
            "uri": "http://edamontology.org/topic_3398"
        }
    ]
}