
{
    "credit": [
        {
            "email": "alexandra.jauhiainen@ki.se",
            "name": "Jauhiainen A",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://ki.se/en/people/alejau"
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "https://sourceforge.net/projects/metabnorm/"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "R"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Systems biology",
                "uri": "http://edamontology.org/topic_2259"
            },
            {
                "term": "Metabolomics",
                "uri": "http://edamontology.org/topic_3172"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/metabnorm-a-mixed-model-normalization-method-for-metabolomics-data.html"
        }
    ],
    "publication": [
        {
            "abstract": "Motivation: In metabolomics, the goal is to identify and measure the concentrations of different metabolites (small molecules) in a cell or a biological system. The metabolites form an important layer in the complex metabolic network, and the interactions between different metabolites are often of interest. It is crucial to perform proper normalization of metabolomics data, but current methods may not be applicable when estimating interactions in the form of correlations between metabolites. We propose a normalization approach based on a mixed model, with simultaneous estimation of a correlation matrix. We also investigate how the common use of a calibration standard in nuclear magnetic resonance (NMR) experiments affects the estimation of correlations. Results: We show with both real and simulated data that our proposed normalization method is robust and has good performance when discovering true correlations between metabolites. The standardization of NMR data is shown in simulation studies to affect our ability to discover true correlations to a small extent. However, comparing standardized and non-standardized real data does not result in any large differences in correlation estimates. Availability and implementation: Source code is freely available at https://sourceforge.net/ projects/metabnorm/. © The Author 2014.",
            "authors": [
                "Jauhiainen A.",
                "Madhu B.",
                "Narita M.",
                "Narita M.",
                "Griffiths J.",
                "Tavare S."
            ],
            "cit_count": 23,
            "journal": "Bioinformatics",
            "pmid": "24711654",
            "title": "Normalization of metabolomics data with applications to correlation maps",
            "year": "2014-08-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:metabnorm",
        "biotoolsID": "metabnorm",
        "description": "Mixed model normalization method for metabolomics data.",
        "homepage": "http://sourceforge.net/projects/metabnorm/",
        "name": "metabnorm"
    }
}