{
    "additionDate": "2021-01-18T07:05:03Z",
    "biotoolsCURIE": "biotools:glybranch",
    "biotoolsID": "glybranch",
    "confidence_flag": "tool",
    "description": "Identification of glycan branching patterns using multistage mass spectrometry with spectra tree analysis.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Mass spectra calibration",
                    "uri": "http://edamontology.org/operation_3627"
                },
                {
                    "term": "Protein identification",
                    "uri": "http://edamontology.org/operation_3767"
                },
                {
                    "term": "Spectrum calculation",
                    "uri": "http://edamontology.org/operation_3860"
                }
            ]
        }
    ],
    "homepage": "https://github.com/bigict/glyBranch/",
    "language": [
        "Java"
    ],
    "lastUpdate": "2021-01-23T10:20:53Z",
    "name": "glyBranch",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1016/J.JPROT.2020.103649",
            "metadata": {
                "abstract": "© 2020Glycans are crucial to a wide range of biological processes, and their biological activities are closely related to the branching patterns of structures. Different from the simple linear chains of proteins, branching patterns of glycans are more complicated, making their identification extremely challenging. Tandem mass spectrometry (MS2) cannot provide sufficient structural information to deduce glycan branching patterns even with the assistance of various bioinformatic tools and algorithms.The promising technology to identify glycan branching patterns is multi-stage mass spectrometry (MSn). The production-relationship among MSn spectra of a glycan is essentially a tree, making deducing glycan structures from MSn spectra a great challenge. In the present study, we report an approach called glyBranch (glycan Branching pattern identification based on spectra tree) to fully exploit the information contained in the MSn spectra tree for glycan identification. Using 14 glycan standards, including 2 pairs with isomeric sequence, and 16 complex N-glycans isolated from RNase B and IgG, we demonstrated the successful application of glyBranch to branching pattern analysis. The source code of glyBranch is available at https://github.com/bigict/glyBranch/. We have also developed a web-server, which is freely accessible at http://glycan.ict.ac.cn/glyBranch/. Significance: Glycans are crucial in various biological processes and their functions are closely related to the details of their structures; thus, the identification of glycan branching patterns is of great significance to biological studies. Multistage mass spectrometry (MSn) can provide detailed structural information by generating multiple-level fragments through consecutive fragmentation; however, the interpretation of numerous MSn spectra is extremely challenging. In this study, we present an approach called glyBranch (glycan Branching pattern identification based on spectra tree) to exploit the information contained in MSn spectra tree for glycan identification. This approach will greatly facilitate the automated identification of glycan structures and related biological studies.",
                "authors": [
                    {
                        "name": "Bu D."
                    },
                    {
                        "name": "Dong J."
                    },
                    {
                        "name": "Hou M."
                    },
                    {
                        "name": "Huang C."
                    },
                    {
                        "name": "Li Y."
                    },
                    {
                        "name": "Pan W."
                    },
                    {
                        "name": "Sun S."
                    },
                    {
                        "name": "Wang H."
                    },
                    {
                        "name": "Wang Y."
                    },
                    {
                        "name": "Zhang J."
                    },
                    {
                        "name": "Zhang Q."
                    },
                    {
                        "name": "Zhao K."
                    },
                    {
                        "name": "Zhou J."
                    }
                ],
                "citationCount": 1,
                "date": "2020-04-15T00:00:00Z",
                "journal": "Journal of Proteomics",
                "title": "Identification of glycan branching patterns using multistage mass spectrometry with spectra tree analysis"
            },
            "pmid": "31978548"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        }
    ],
    "validated": 1
}
