{
    "additionDate": "2021-11-29T09:04:03.131161Z",
    "biotoolsCURIE": "biotools:r-deco",
    "biotoolsID": "r-deco",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "Jonathan.Moeyersons@esat.kuleuven.be",
            "name": "Jonathan Moeyersons",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "R-DECO is an open-source Matlab based graphical user interface for the detection and correction of R-peaks.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Peak detection",
                    "uri": "http://edamontology.org/operation_3215"
                },
                {
                    "term": "Filtering",
                    "uri": "http://edamontology.org/operation_3695"
                }
            ]
        }
    ],
    "homepage": "https://gitlab.esat.kuleuven.be/biomed-public/r-deco",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2021-11-29T09:04:03.133643Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://gitlab.esat.kuleuven.be/biomed-public/r-deco/-/issues"
        }
    ],
    "name": "R-DECO",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.7717/PEERJ-CS.226",
            "metadata": {
                "abstract": "© 2019 Moeyersons et al.Many of the existing electrocardiogram (ECG) toolboxes focus on the derivation of heart rate variability features from RR-intervals. By doing so, they assume correct detection of the QRS-complexes. However, it is highly likely that not all detections are correct. Therefore, it is recommended to visualize the actual R-peak positions in the ECG signal and allow manual adaptations. In this paper we present R-DECO, an easy-to-use graphical user interface (GUI) for the detection and correction of R-peaks. Within R-DECO, the R-peaks are detected by using a detection algorithm which uses an envelope-based procedure. This procedure flattens the ECG and enhances the QRS-complexes. The algorithm obtained an overall sensitivity of 99.60% and positive predictive value of 99.69% on the MIT/BIH arrhythmia database. Additionally, R-DECO includes support for several input data formats for ECG signals, three basic filters, the possibility to load other R-peak locations and intuitive methods to correct ectopic, wrong, or missed heartbeats. All functionalities can be accessed via the GUI and the analysis results can be exported as Matlab or Excel files. The software is publicly available. Through its easy-to-use GUI, R-DECO allows both clinicians and researchers to use all functionalities, without previous knowledge.",
                "authors": [
                    {
                        "name": "Moeyersons J."
                    },
                    {
                        "name": "Amoni M."
                    },
                    {
                        "name": "Huffel S.V."
                    },
                    {
                        "name": "Willems R."
                    },
                    {
                        "name": "Varon C."
                    }
                ],
                "citationCount": 14,
                "date": "2019-01-01T00:00:00Z",
                "journal": "PeerJ Computer Science",
                "title": "R-DECO: An open-source Matlab based graphical user interface for the detection and correction of R-peaks"
            },
            "pmcid": "PMC7924703",
            "pmid": "33816879",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Cardiology",
            "uri": "http://edamontology.org/topic_3335"
        }
    ]
}