
{
    "credit": [
        {
            "email": "m.wuhrer@lumc.nl",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "https://github.com/Tarskin"
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "https://github.com/Tarskin/MassyTools"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Data handling",
                    "uri": "http://edamontology.org/operation_2409"
                }
            ]
        }
    ],
    "labels": {
        "collectionID": [
            "Proteomics"
        ],
        "language": [
            "Python"
        ],
        "operatingSystem": [
            "Linux",
            "Windows"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Proteomics",
                "uri": "http://edamontology.org/topic_0121"
            },
            {
                "term": "Proteomics experiment",
                "uri": "http://edamontology.org/topic_3520"
            },
            {
                "term": "Data management",
                "uri": "http://edamontology.org/topic_3071"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/massytools-high-throughput-targeted-data-processing-tool.html"
        }
    ],
    "publication": [
        {
            "abstract": "© 2015 American Chemical Society.The study of N-linked glycosylation has long been complicated by a lack of bioinformatics tools. In particular, there is still a lack of fast and robust data processing tools for targeted (relative) quantitation. We have developed modular, high-throughput data processing software, MassyTools, that is capable of calibrating spectra, extracting data, and performing quality control calculations based on a user-defined list of glycan or glycopeptide compositions. Typical examples of output include relative areas after background subtraction, isotopic pattern-based quality scores, spectral quality scores, and signal-to-noise ratios. We demonstrated MassyTools' performance on MALDI-TOF-MS glycan and glycopeptide data from different samples. MassyTools yielded better calibration than the commercial software flexAnalysis, generally showing 2-fold better ppm errors after internal calibration. Relative quantitation using MassyTools and flexAnalysis gave similar results, yielding a relative standard deviation (RSD) of the main glycan of ∼6%. However, MassyTools yielded 2- to 5-fold lower RSD values for low-abundant analytes than flexAnalysis. Additionally, feature curation based on the computed quality criteria improved the data quality. In conclusion, we show that MassyTools is a robust automated data processing tool for high-throughput, high-performance glycosylation analysis. The package is released under the Apache 2.0 license and is freely available on GitHub (https://github.com/Tarskin/MassyTools).",
            "authors": [
                "Jansen B.C.",
                "Reiding K.R.",
                "Bondt A.",
                "Hipgrave Ederveen A.L.",
                "Palmblad M.",
                "Falck D.",
                "Wuhrer M."
            ],
            "cit_count": 37,
            "journal": "Journal of Proteome Research",
            "pmid": "26565759",
            "title": "MassyTools: A High-Throughput Targeted Data Processing Tool for Relative Quantitation and Quality Control Developed for Glycomic and Glycoproteomic MALDI-MS",
            "year": "2015-12-04"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:massytools",
        "biotoolsID": "massytools",
        "description": "Data processing tool for targeted high-throughput MALDI-MS data extraction.",
        "homepage": "https://github.com/Tarskin/MassyTools",
        "name": "MassyTools"
    }
}