{
    "additionDate": "2019-11-14T19:58:39Z",
    "biotoolsCURIE": "biotools:SAMPL",
    "biotoolsID": "SAMPL",
    "confidence_flag": "medium",
    "description": "> MEDIUM CONFIDENCE! | reference data for the sixth statistical assessment of modeling of proteins and ligands (SAMPL6) | From Wikipedia, the free encyclopedia | Jump to navigation Jump to search | SAMPL (Statistical Assessment of the Modeling of Proteins and Ligands) is a set of community-wide blind challenges aimed to advance computational techniques as standard predictive tools in rational drug design.[1][2][3][4][5] A broad range of biologically relevant systems with different sizes and levels of complexities including proteins, host guest complexes, and drug-like small molecules have been selected to test the latest modeling methods and force fields in SAMPL",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Dimethyl",
                    "uri": "http://edamontology.org/operation_3642"
                },
                {
                    "term": "Nucleic acid thermodynamic property calculation",
                    "uri": "http://edamontology.org/operation_0455"
                },
                {
                    "term": "Protein-ligand docking",
                    "uri": "http://edamontology.org/operation_0482"
                }
            ]
        }
    ],
    "homepage": "https://en.wikipedia.org/wiki/SAMPL_Challenge",
    "lastUpdate": "2019-11-14T19:58:39Z",
    "name": "SAMPL",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1080/10610278.2018.1549327",
            "metadata": {
                "abstract": "© 2018, © 2018 Informa UK Limited, trading as Taylor & Francis Group. Although computer-aided drug design has greatly improved over time, its application in the pharmaceutical industry is still limited by the accuracy of association constant (K a ) predictions. Towards improving this situation, the Statistical Assessment of the Modeling of Proteins and Ligands (SAMPL) is a series of community-wide blind challenges aimed to advance computational techniques as standard predictive tools in rational drug design (https://en.wikipedia.org/wiki/SAMPL_Challenge). As an empirical contribution to SAMPL6, we report here the K a and thermodynamic parameters (∆G, ∆H,–T∆S) of eight guests binding to two hosts (OA and TEMOA) using ITC. Both hosts contain a unique, well-defined binding pocket capable of storing guests with up to ten non-hydrogen atoms, whilst the selection of amphiphilic guests contain a range of saturated and unsaturated substituents. The thermodynamic data from this study will allow the challenge participants of SAMPL6 to test the accuracy of their computational protocols for calculating host-guest affinities.",
                "authors": [
                    {
                        "name": "Sullivan M.R."
                    },
                    {
                        "name": "Yao W."
                    },
                    {
                        "name": "Gibb B.C."
                    }
                ],
                "citationCount": 2,
                "date": "2019-03-04T00:00:00Z",
                "journal": "Supramolecular Chemistry",
                "title": "The thermodynamics of guest complexation to octa-acid and tetra-endo-methyl octa-acid: reference data for the sixth statistical assessment of modeling of proteins and ligands (SAMPL6)"
            },
            "pmcid": "PMC6760852",
            "pmid": "31555042"
        }
    ],
    "topic": [
        {
            "term": "Medicinal chemistry",
            "uri": "http://edamontology.org/topic_0209"
        },
        {
            "term": "Sample collections",
            "uri": "http://edamontology.org/topic_3277"
        },
        {
            "term": "Molecular modelling",
            "uri": "http://edamontology.org/topic_2275"
        }
    ]
}