{
    "name": "LDWP", 
    "description": "Linked Region Detection without Pedigree is a software package for linkage analysis that finds the mutation regions for the case where the input individuals are closely related, but the pedigree is not known. It takes the genotype data of the individuals in the dotted rectangle and the diagnoses (diseased or normal) information of each individual in the dotted rectangle as its input, and report the mutation regions.", 
    "homepage": "http://www.cs.cityu.edu.hk/~lwang/software/LDWP/index.html", 
    "biotoolsID": "ldwp", 
    "biotoolsCURIE": "biotools:ldwp", 
    "version": [], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_0283", 
                    "term": "Linkage analysis"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }, 
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_2423", 
                    "term": "Detection"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Command-line tool"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_0199", 
            "term": "Mutation"
        }, 
        {
            "uri": "http://edamontology.org/topic_3053", 
            "term": "Genetics"
        }, 
        {
            "uri": "http://edamontology.org/topic_0102", 
            "term": "Linkage"
        }
    ], 
    "operatingSystem": [
        "Windows"
    ], 
    "language": [
        "C++"
    ], 
    "license": null, 
    "collectionID": [], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [
        {
            "url": "http://www.mybiosoftware.com/ldwp-linked-region-detection-pedigree.html", 
            "type": "Registry", 
            "note": null
        }
    ], 
    "download": [], 
    "documentation": [
        {
            "url": "http://www.cs.cityu.edu.hk/~lwang/software/LDWP/sample.html", 
            "type": "Manual", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": "10.1109/TCBB.2011.134", 
            "pmid": null, 
            "pmcid": null, 
            "type": "Primary", 
            "version": null, 
            "metadata": {
                "title": "Mutation region detection for closely related individuals without a known pedigree", 
                "abstract": "Linkage analysis serves as a way of finding locations of genes that cause genetic diseases. Linkage studies have facilitated the identification of several hundreds of human genes that can harbor mutations which by themselves lead to a disease phenotype. The fundamental problem in linkage analysis is to identify regions whose allele is shared by all or almost all affected members but by none or few unaffected members. Almost all the existing methods for linkage analysis are for families with clearly given pedigrees. Little work has been done for the case where the sampled individuals are closely related, but their pedigree is not known. This situation occurs very often when the individuals share a common ancestor at least six generations ago. Solving this case will tremendously extend the use of linkage analysis for finding genes that cause genetic diseases. In this paper, we propose a mathematical model (the shared center problem) for inferring the allele-sharing status of a given set of individuals using a database of confirmed haplotypes as reference. We show the NP-completeness of the shared center problem and present a ratio-2 polynomial-time approximation algorithm for its minimization version (called the closest shared center problem). We then convert the approximation algorithm into a heuristic algorithm for the shared center problem. Based on this heuristic, we finally design a heuristic algorithm for mutation region detection. We further implement the algorithms to obtain a software package. Our experimental data show that the software is both fast and accurate. The package is available at http://www.cs.cityu.edu.hk/~lwang/software/LDWP/ for noncommercial use. © 2012 IEEE.", 
                "date": "2012-02-06T00:00:00Z", 
                "citationCount": 5, 
                "authors": [
                    {
                        "name": "Ma W."
                    }, 
                    {
                        "name": "Yang Y."
                    }, 
                    {
                        "name": "Chen Z.-Z."
                    }, 
                    {
                        "name": "Wang L."
                    }
                ], 
                "journal": "IEEE/ACM Transactions on Computational Biology and Bioinformatics"
            }
        }
    ], 
    "credit": [
        {
            "name": null, 
            "email": null, 
            "url": "http://www.cs.cityu.edu.hk/~lwang/", 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "mbs_import", 
    "additionDate": "2017-12-18T00:08:09Z", 
    "lastUpdate": "2018-12-10T12:58:59Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 1, 
    "homepage_status": 0, 
    "elixir_badge": 0
}