{
    "additionDate": "2018-10-11T18:35:22Z",
    "biotoolsCURIE": "biotools:degps",
    "biotoolsID": "degps",
    "credit": [
        {
            "email": "ylu@mcw.edu",
            "name": "Yan Lu",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "deGPS is a tool  for detecting differential expression in RNA-Seq data.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/LL-LAB-MCW/deGPS/blob/master/README.md"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "RNA-Seq analysis",
                    "uri": "http://edamontology.org/operation_3680"
                }
            ]
        }
    ],
    "homepage": "https://github.com/LL-LAB-MCW/deGPS",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-10T12:59:01Z",
    "license": "Other",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/LL-LAB-MCW/deGPS/issues"
        }
    ],
    "name": "deGPS",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "daniel_stefan",
    "publication": [
        {
            "doi": "10.1186/s12864-015-1676-0",
            "metadata": {
                "abstract": "© Chu et al.Background: The advent of the NGS technologies has permitted profiling of whole-genome transcriptomes (i.e., RNA-Seq) at unprecedented speed and very low cost. RNA-Seq provides a far more precise measurement of transcript levels and their isoforms compared to other methods such as microarrays. A fundamental goal of RNA-Seq is to better identify expression changes between different biological or disease conditions. However, existing methods for detecting differential expression from RNA-Seq count data have not been comprehensively evaluated in large-scale RNA-Seq datasets. Many of them suffer from inflation of type I error and failure in controlling false discovery rate especially in the presence of abnormal high sequence read counts in RNA-Seq experiments. Results: To address these challenges, we propose a powerful and robust tool, termed deGPS, for detecting differential expression in RNA-Seq data. This framework contains new normalization methods based on generalized Poisson distribution modeling sequence count data, followed by permutation-based differential expression tests. We systematically evaluated our new tool in simulated datasets from several large-scale TCGA RNA-Seq projects, unbiased benchmark data from compcodeR package, and real RNA-Seq data from the development transcriptome of Drosophila. deGPS can precisely control type I error and false discovery rate for the detection of differential expression and is robust in the presence of abnormal high sequence read counts in RNA-Seq experiments. Conclusions: Software implementing our deGPS was released within an R package with parallel computations (https://github.com/LL-LAB-MCW/deGPS). deGPS is a powerful and robust tool for data normalization and detecting different expression in RNA-Seq experiments. Beyond RNA-Seq, deGPS has the potential to significantly enhance future data analysis efforts from many other high-throughput platforms such as ChIP-Seq, MBD-Seq and RIP-Seq.",
                "authors": [
                    {
                        "name": "Chu C."
                    },
                    {
                        "name": "Fang Z."
                    },
                    {
                        "name": "Hua X."
                    },
                    {
                        "name": "Yang Y."
                    },
                    {
                        "name": "Chen E."
                    },
                    {
                        "name": "Cowley A.W."
                    },
                    {
                        "name": "Liang M."
                    },
                    {
                        "name": "Liu P."
                    },
                    {
                        "name": "Lu Y."
                    }
                ],
                "citationCount": 10,
                "date": "2015-06-13T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "deGPS is a powerful tool for detecting differential expression in RNA-sequencing studies"
            },
            "pmcid": "PMC4465298",
            "pmid": "26070955",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        }
    ],
    "validated": 1
}