{
    "name": "VisGrid", 
    "description": "The algorithm identifies geometric features of protein surfaces using an intuitive concept of the visibility. It  correctly identified 95.0% of ligand binding sites as one of the three largest pockets in 5616 benchmark proteins.", 
    "homepage": "http://kiharalab.org/VisGrid/", 
    "biotoolsID": "visgrid", 
    "biotoolsCURIE": "biotools:visgrid", 
    "version": [], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_0474", 
                    "term": "Protein structure prediction"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Command-line tool"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_2275", 
            "term": "Molecular modelling"
        }, 
        {
            "uri": "http://edamontology.org/topic_0166", 
            "term": "Protein structural motifs and surfaces"
        }, 
        {
            "uri": "http://edamontology.org/topic_0081", 
            "term": "Structure analysis"
        }
    ], 
    "operatingSystem": [
        "Linux"
    ], 
    "language": [], 
    "license": null, 
    "collectionID": [], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [
        {
            "url": "http://www.mybiosoftware.com/visgrid-identify-pockets-in-protein-surfaces.html", 
            "type": "Registry", 
            "note": null
        }
    ], 
    "download": [], 
    "documentation": [
        {
            "url": "http://kiharalab.org/VisGrid/", 
            "type": "General", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": null, 
            "pmid": "17975834", 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "Characterization of local geometry of protein surfaces with the visibility criterion", 
                "abstract": "Experimentally determined protein tertiary structures are rapidly accumulating in a database, partly due to the structural genomics projects. Included are proteins of unknown function, whose function has not been investigated by experiments and was not able to be predicted by conventional sequence-based search. Those uncharacterized protein structures highlight the urgent need of computational methods for annotating proteins from tertiary structures, which include function annotation methods through characterizing protein local surfaces. Toward structure-based protein annotation, we have developed VisGrid algorithm that uses the visibility criterion to characterize local geometric features of protein surfaces. Unlike existing methods, which only concerns identifying pockets that could be potential ligand-binding sites in proteins, VisGrid is also aimed to identify large protrusions, hollows, and flat regions, which can characterize geometric features of a protein structure. The visibility used in VisGrid is defined as the fraction of visible directions from a target position on a protein surface. A pocket or a hollow is recognized as a cluster of positions with a small visibility. A large protrusion in a protein structure is recognized as a pocket in the negative image of the structure. VisGrid correctly identified 95.0% of ligand-binding sites as one of the three largest pockets in 5616 benchmark proteins. To examine how natural flexibility of proteins affects pocket identification, VisGrid was tested on distorted structures by molecular dynamics simulation. Sensitivity decreased ∼20% for structures of a root mean square deviation of 2.0 Å to the original crystal structure, but specificity was not much affected. Because of its intuitiveness and simplicity, the visibility criterion will lay the foundation for characterization and function annotation of local shape of proteins. © 2007 Wiley-Liss, Inc.", 
                "date": "2008-05-01T00:00:00Z", 
                "citationCount": 55, 
                "authors": [
                    {
                        "name": "Li B."
                    }, 
                    {
                        "name": "Turuvekere S."
                    }, 
                    {
                        "name": "Agrawal M."
                    }, 
                    {
                        "name": "La D."
                    }, 
                    {
                        "name": "Ramani K."
                    }, 
                    {
                        "name": "Kihara D."
                    }
                ], 
                "journal": "Proteins: Structure, Function and Genetics"
            }
        }
    ], 
    "credit": [
        {
            "name": null, 
            "email": "dkihara@purdue.edu", 
            "url": "http://kiharalab.org/", 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "mbs_import", 
    "additionDate": "2017-08-03T19:04:12Z", 
    "lastUpdate": "2018-12-10T12:58:45Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 1, 
    "homepage_status": 0, 
    "elixir_badge": 0
}