{
    "additionDate": "2021-01-18T08:14:26Z",
    "biotoolsCURIE": "biotools:sip",
    "biotoolsID": "sip",
    "confidence_flag": "tool",
    "credit": [
        {
            "name": "M. Jordan Rowley",
            "typeEntity": "Person"
        },
        {
            "name": "Axel Poulet",
            "typeEntity": "Person"
        }
    ],
    "description": "SIP: Significant Interaction Peak caller.Analysis of Hi-C data using SIP effectively identifies loops in organisms from C. elegans to mammals.\n\n\nIf you want run SIP with mcool file you need to install cooler: https://github.com/mirnylab/cooler (version >= 0.8.6) and cooltools: https://github.com/mirnylab/cooltools (version >= 0.3.0) . Not working with dev version of cooler and cooltools.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Loop modelling",
                    "uri": "http://edamontology.org/operation_0481"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                },
                {
                    "term": "Peak calling",
                    "uri": "http://edamontology.org/operation_3222"
                }
            ]
        }
    ],
    "homepage": "https://github.com/PouletAxel/SIP/releases",
    "lastUpdate": "2021-02-19T15:13:07Z",
    "name": "SIP",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1101/GR.257832.119",
            "metadata": {
                "abstract": "© 2020 Rowley et al.; Published by Cold Spring Harbor Laboratory Press.Chromatin loops are a major component of 3D nuclear organization, visually apparent as intense point-to-point interactions in Hi-C maps. Identification of these loops is a critical part of most Hi-C analyses. However, current methods often miss visually evident CTCF loops in Hi-C data sets from mammals, and they completely fail to identify high intensity loops in other organisms. We present SIP, Significant Interaction Peak caller, and SIPMeta, which are platform independent programs to identify and characterize these loops in a time- and memory-efficient manner. We show that SIP is resistant to noise and sequencing depth, and can be used to detect loops that were previously missed in human cells as well as loops in other organisms. SIPMeta corrects for a common visualization artifact by accounting for Manhattan distance to create average plots of Hi-C and HiChIP data. We then demonstrate that the use of SIP and SIPMeta can lead to biological insights by characterizing the contribution of several transcription factors to CTCF loop stability in human cells. We also annotate loops associated with the SMC component of the dosage compensation complex (DCC) in Caenorhabditis elegans and demonstrate that loop anchors represent bidirectional blocks for symmetrical loop extrusion. This is in contrast to the asymmetrical extrusion until unidirectional blockage by CTCF that is presumed to occur in mammals. Using HiChIP and multiway ligation events, we then show that DCC loops form a network of strong interactions that may contribute to X Chromosome-wide condensation in C. elegans hermaphrodites.",
                "authors": [
                    {
                        "name": "Jordan Rowley M."
                    },
                    {
                        "name": "Poulet A."
                    },
                    {
                        "name": "Nichols M.H."
                    },
                    {
                        "name": "Bixler B.J."
                    },
                    {
                        "name": "Sanborn A.L."
                    },
                    {
                        "name": "Brouhard E.A."
                    },
                    {
                        "name": "Hermetz K."
                    },
                    {
                        "name": "Linsenbaum H."
                    },
                    {
                        "name": "Csankovszki G."
                    },
                    {
                        "name": "Aiden E.L."
                    },
                    {
                        "name": "Corces V.G."
                    }
                ],
                "citationCount": 7,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Genome Research",
                "title": "Analysis of Hi-C data using SIP effectively identifies loops in organisms from C. Elegans to mammals"
            },
            "pmcid": "PMC7111518",
            "pmid": "32127418"
        }
    ],
    "topic": [
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "ChIP-seq",
            "uri": "http://edamontology.org/topic_3169"
        }
    ]
}