{
    "additionDate": "2017-01-05T10:21:35Z",
    "biotoolsCURIE": "biotools:metfrag",
    "biotoolsID": "metfrag",
    "collectionID": [
        "de.NBI"
    ],
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://c-ruttkies.github.io/MetFrag/"
        }
    ],
    "description": "It combines compound database searching and fragmentation prediction for small molecule identification from tandem mass spectrometry data. It supports candidate structure retrieval from the compound databases PubChem, ChemSpider and KEGG or user defined structure data file(SDF). After in silico fragmentation in a combinatorial manner, candidates get filtered and scored on criteria like: occurrence of certain elements/substructures, retention time information and reference information.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://msbi.ipb-halle.de/MetFragBeta/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Experimental measurement",
                        "uri": "http://edamontology.org/data_3108"
                    },
                    "format": [
                        {
                            "term": "Textual format",
                            "uri": "http://edamontology.org/format_2330"
                        }
                    ]
                }
            ],
            "operation": [
                {
                    "term": "Prediction and recognition",
                    "uri": "http://edamontology.org/operation_2423"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Structure",
                        "uri": "http://edamontology.org/data_0883"
                    }
                }
            ]
        }
    ],
    "homepage": "http://msbi.ipb-halle.de/MetFragBeta/",
    "language": [
        "SQL"
    ],
    "lastUpdate": "2018-12-10T12:58:59Z",
    "name": "MetFrag",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "rmeier",
    "publication": [
        {
            "doi": "10.1186/s13321-016-0115-9",
            "metadata": {
                "abstract": "© 2016 Ruttkies et al.Background: The in silico fragmenter MetFrag, launched in 2010, was one of the first approaches combining compound database searching and fragmentation prediction for small molecule identification from tandem mass spectrometry data. Since then many new approaches have evolved, as has MetFrag itself. This article details the latest developments to MetFrag and its use in small molecule identification since the original publication. Results: MetFrag has gone through algorithmic and scoring refinements. New features include the retrieval of reference, data source and patent information via ChemSpider and PubChem web services, as well as InChIKey filtering to reduce candidate redundancy due to stereoisomerism. Candidates can be filtered or scored differently based on criteria like occurence of certain elements and/or substructures prior to fragmentation, or presence in so-called \"suspect lists\". Retention time information can now be calculated either within MetFrag with a sufficient amount of user-provided retention times, or incorporated separately as \"user-defined scores\" to be included in candidate ranking. The changes to MetFrag were evaluated on the original dataset as well as a dataset of 473 merged high resolution tandem mass spectra (HR-MS/MS) and compared with another open source in silico fragmenter, CFM-ID. Using HR-MS/MS information only, MetFrag2.2 and CFM-ID had 30 and 43 Top 1 ranks, respectively, using PubChem as a database. Including reference and retention information in MetFrag2.2 improved this to 420 and 336 Top 1 ranks with ChemSpider and PubChem (89 and 71 %), respectively, and even up to 343 Top 1 ranks (PubChem) when combining with CFM-ID. The optimal parameters and weights were verified using three additional datasets of 824 merged HR-MS/MS spectra in total. Further examples are given to demonstrate flexibility of the enhanced features. Conclusions: In many cases additional information is available from the experimental context to add to small molecule identification, which is especially useful where the mass spectrum alone is not sufficient for candidate selection from a large number of candidates. The results achieved with MetFrag2.2 clearly show the benefit of considering this additional information. The new functions greatly enhance the chance of identification success and have been incorporated into a command line interface in a flexible way designed to be integrated into high throughput workflows. Feedback on the command line version of MetFrag2.2 available at http://c-ruttkies.github.io/MetFrag/ is welcome.",
                "authors": [
                    {
                        "name": "Ruttkies C."
                    },
                    {
                        "name": "Schymanski E.L."
                    },
                    {
                        "name": "Wolf S."
                    },
                    {
                        "name": "Hollender J."
                    },
                    {
                        "name": "Neumann S."
                    }
                ],
                "citationCount": 120,
                "date": "2016-01-29T00:00:00Z",
                "journal": "Journal of Cheminformatics",
                "title": "MetFrag relaunched: Incorporating strategies beyond in silico fragmentation"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web service"
    ],
    "topic": [
        {
            "term": "Omics",
            "uri": "http://edamontology.org/topic_3391"
        }
    ],
    "validated": 1,
    "version": [
        "2.2"
    ]
}