{"credit":[{"email":"owen.rackham@duke-nus.edu.sg","typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://www.wgbssuite.org.uk/"}],"documentation":[{"type":"GENERAL","url":"http://www.wgbssuite.org.uk/"}],"function":[{"operation":[{"term":"Methylation analysis","uri":"http://edamontology.org/operation_3204"}]}],"labels":{"language":["R"],"operatingSystem":["Linux"],"toolType":["Suite"],"topic":[{"term":"Sequencing","uri":"http://edamontology.org/topic_3168"},{"term":"Epigenetics","uri":"http://edamontology.org/topic_3295"},{"term":"DNA","uri":"http://edamontology.org/topic_0654"},{"term":"Simulation experiment","uri":"http://edamontology.org/topic_3524"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/wgbssuite-0-3-simulating-whole-genome-bisulphite-sequencing-data.html"}],"publication":[{"abstract":"© The Author 2015. Published by Oxford University Press. Motivation: As the number of studies looking at differences between DNA methylation increases, there is a growing demand to develop and benchmark statistical methods to analyse these data. To date no objective approach for the comparison of these methods has been developed and as such it remains difficult to assess which analysis tool is most appropriate for a given experiment. As a result, there is an unmet need for a DNA methylation data simulator that can accurately reproduce a wide range of experimental setups, and can be routinely used to compare the performance of different statistical models. Results: We have developed WGBSSuite, a flexible stochastic simulation tool that generates single- base resolution DNA methylation data genome-wide. Several simulator parameters can be derived directly from real datasets provided by the user in order to mimic real case scenarios. Thus, it is possible to choose the most appropriate statistical analysis tool for a given simulated design. To show the usefulness of our simulator, we also report a benchmark of commonly used methods for differential methylation analysis.","authors":["Rackham O.J.L.","Dellaportas P.","Petretto E.","Bottolo L."],"cit_count":5,"journal":"Bioinformatics","pmid":"25777524","title":"WGBS Suite: Simulating whole-genome bisulphite sequencing data and benchmarking differential DNA methylation analysis tools","year":"2015-01-01"}],"summary":{"biotoolsCURIE":"biotools:wgbssuite","biotoolsID":"wgbssuite","description":"Flexible stochastic simulation tool that generates single-base resolution DNA methylation data genome-wide.","homepage":"http://www.wgbssuite.org.uk/","name":"WGBSSuite"}}