{"credit":[{"typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://theinf1.informatik.uni-jena.de/~wernicke/index.html"}],"documentation":[{"url":"http://theinf1.informatik.uni-jena.de/~wernicke/motifs/fanmod-manual.pdf"}],"function":[{"operation":[{"term":"Motif detection","uri":"http://edamontology.org/operation_0239"}]},{"operation":[{"term":"Detection","uri":"http://edamontology.org/operation_2423"}]}],"labels":{"language":["C++"],"operatingSystem":["Linux","Windows","Mac"],"toolType":["Desktop application"],"topic":[{"term":"Systems biology","uri":"http://edamontology.org/topic_2259"},{"term":"Networks","uri":"http://edamontology.org/topic_0602"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/fanmod-20060715-fast-network-motif-detection.html"}],"publication":[{"abstract":"Summary: Motifs are small connected subnetworks that a network displays in significantly higher frequencies than would be expected for a random network. They have recently gathered much attention as a concept to uncover structural design principles of complex biological networks. FANMOD is a tool for fast network motif detection; it relies on recently developed algorithms to improve the efficiency of network motif detection by some orders of magnitude over existing tools. This facilitates the detection of larger motifs in bigger networks than previously possible. Additional benefits of FANMOD are the ability to analyze colored networks, a graphical user interface and the ability to export results to a variety of machine- and human-readable file formats including comma-separated values and HTML. © 2006 Oxford University Press.","authors":["Wernicke S.","Rasche F."],"cit_count":363,"doi":"10.1093/bioinformatics/btl038","journal":"Bioinformatics","title":"FANMOD: A tool for fast network motif detection","type":"Primary","year":"2006-05-01"}],"summary":{"biotoolsCURIE":"biotools:fanmod","biotoolsID":"fanmod","description":"Fast Network Motif Detection is for fast network motif detection; it relies on recently developed algorithms to improve the efficiency of network motif detection by some orders of magnitude over existing tools. This facilitates the detection of larger motifs in bigger networks than previously possible. Its additional benefits are the ability to analyze colored networks, a graphical user interface and the ability to export results to a variety of machine- and human-readable file formats.","homepage":"http://theinf1.informatik.uni-jena.de/~wernicke/motifs/index.html","name":"FANMOD","version":["20061223"]}}