
{
    "credit": [
        {
            "name": "Contact Form",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://www.scbi.uma.es/site/location/contact?view=alfcontact"
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://www.scbi.uma.es/site/"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence trimming",
                    "uri": "http://edamontology.org/operation_3192"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Perl"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Sequencing",
                "uri": "http://edamontology.org/topic_3168"
            },
            {
                "term": "Data management",
                "uri": "http://edamontology.org/topic_3071"
            }
        ]
    },
    "publication": [
        {
            "abstract": "Background: High-throughput automated sequencing has enabled an exponential growth rate of sequencing data. This requires increasing sequence quality and reliability in order to avoid database contamination with artefactual sequences. The arrival of pyrosequencing enhances this problem and necessitates customisable pre-processing algorithms.Results: SeqTrim has been implemented both as a Web and as a standalone command line application. Already-published and newly-designed algorithms have been included to identify sequence inserts, to remove low quality, vector, adaptor, low complexity and contaminant sequences, and to detect chimeric reads. The availability of several input and output formats allows its inclusion in sequence processing workflows. Due to its specific algorithms, SeqTrim outperforms other pre-processors implemented as Web services or standalone applications. It performs equally well with sequences from EST libraries, SSH libraries, genomic DNA libraries and pyrosequencing reads and does not lead to over-trimming.Conclusions: SeqTrim is an efficient pipeline designed for pre-processing of any type of sequence read, including next-generation sequencing. It is easily configurable and provides a friendly interface that allows users to know what happened with sequences at every pre-processing stage, and to verify pre-processing of an individual sequence if desired. The recommended pipeline reveals more information about each sequence than previously described pre-processors and can discard more sequencing or experimental artefacts. © 2010 Falgueras et al; licensee BioMed Central Ltd.",
            "authors": [
                "Falgueras J.",
                "Lara A.J.",
                "Fernandez-Pozo N.",
                "Canton F.R.",
                "Perez-Trabado G.",
                "Claros M.G."
            ],
            "cit_count": 108,
            "journal": "BMC Bioinformatics",
            "pmid": "20089148",
            "title": "SeqTrim: A high-throughput pipeline for pre-processing any type of sequence read",
            "year": "2010-01-20"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:seqtrim",
        "biotoolsID": "seqtrim",
        "description": "A pipeline for preprocessing sequences from Sanger sequencing.",
        "homepage": "http://www.scbi.uma.es/ingebiol/session/new/seqtrimnext",
        "name": "SeqTrim"
    }
}