{
    "additionDate": "2021-03-19T08:59:00Z",
    "biotoolsCURIE": "biotools:brainpainter",
    "biotoolsID": "brainpainter",
    "confidence_flag": "tool",
    "credit": [
        {
            "name": "Daniel C. Alexander",
            "typeEntity": "Person"
        },
        {
            "name": "Polina Golland",
            "typeEntity": "Person"
        }
    ],
    "description": "BrainPainter is a software for the visualisation of brain structures, biomarkers and associated pathological processes.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Editing",
                    "uri": "http://edamontology.org/operation_3096"
                },
                {
                    "term": "Information extraction",
                    "uri": "http://edamontology.org/operation_3907"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "http://brainpainter.csail.mit.edu",
    "lastUpdate": "2021-03-21T10:39:40Z",
    "name": "BrainPainter",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1007/978-3-030-33226-6_13",
            "metadata": {
                "abstract": "© Springer Nature Switzerland AG 2019.We present BrainPainter, a software that automatically generates images of highlighted brain structures given a list of numbers corresponding to the output colours of each region. Compared to existing visualisation software (i.e. Freesurfer, SPM, 3D Slicer), BrainPainter has three key advantages: (1) it does not require the input data to be in a specialised format, allowing BrainPainter to be used in combination with any neuroimaging analysis tools, (2) it can visualise both cortical and subcortical structures and (3) it can be used to generate movies showing dynamic processes, e.g. propagation of pathology on the brain. We highlight three use cases where BrainPainter was used in existing neuroimaging studies: (1) visualisation of the degree of atrophy through interpolation along a user-defined gradient of colours, (2) visualisation of the progression of pathology in Alzheimer’s disease as well as (3) visualisation of pathology in subcortical regions in Huntington’s disease. Moreover, through the design of BrainPainter we demonstrate the possibility of using a powerful 3D computer graphics engine such as Blender to generate brain visualisations for the neuroscience community. Blender’s capabilities, e.g. particle simulations, motion graphics, UV unwrapping, raster graphics editing, raytracing and illumination effects, open a wealth of possibilities for brain visualisation not available in current neuroimaging software. BrainPainter (Source code: https://github.com/mrazvan22/brain-coloring ) is customisable, easy to use, and can run straight from the web browser: http://brainpainter.csail.mit.edu. It can be used to visualise biomarker data from any brain imaging modality, or simply to highlight a particular brain structure for e.g. anatomy courses.",
                "authors": [
                    {
                        "name": "Alexander D.C."
                    },
                    {
                        "name": "Eshaghi A."
                    },
                    {
                        "name": "Golland P."
                    },
                    {
                        "name": "Marinescu R.V."
                    }
                ],
                "citationCount": 4,
                "date": "2019-01-01T00:00:00Z",
                "journal": "Lecture Notes in Computer Science (including subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics)",
                "title": "BrainPainter: A Software for the Visualisation of Brain Structures, Biomarkers and Associated Pathological Processes"
            },
            "pmcid": "PMC7853665",
            "pmid": "33537683"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        },
        {
            "term": "Neurobiology",
            "uri": "http://edamontology.org/topic_3304"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Tomography",
            "uri": "http://edamontology.org/topic_3452"
        }
    ]
}
