
{
    "credit": [
        {
            "email": "gregory.ryslik@yale.edu",
            "name": "Gregory Ryslik",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "url": "http://bioconductor.org/packages/release/bioc/html/GraphPAC.html"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://bioconductor/packages/release/bioc/src/contrib/GraphPAC_1.16.0.tar.gz"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "Protein modelling (mutation)",
                    "uri": "http://edamontology.org/operation_0331"
                }
            ]
        }
    ],
    "labels": {
        "collectionID": [
            "BioConductor"
        ],
        "language": [
            "R"
        ],
        "license": "GPL-2.0",
        "operatingSystem": [
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Command-line tool",
            "Library"
        ],
        "topic": [
            {
                "term": "Proteins",
                "uri": "http://edamontology.org/topic_0078"
            },
            {
                "term": "Protein modifications",
                "uri": "http://edamontology.org/topic_0601"
            },
            {
                "term": "Protein structure analysis",
                "uri": "http://edamontology.org/topic_2814"
            }
        ]
    },
    "publication": [
        {
            "abstract": "Background: It is well known that the development of cancer is caused by the accumulation of somatic mutations within the genome. For oncogenes specifically, current research suggests that there is a small set of \"driver\" mutations that are primarily responsible for tumorigenesis. Further, due to recent pharmacological successes in treating these driver mutations and their resulting tumors, a variety of approaches have been developed to identify potential driver mutations using methods such as machine learning and mutational clustering. We propose a novel methodology that increases our power to identify mutational clusters by taking into account protein tertiary structure via a graph theoretical approach.Results: We have designed and implemented GraphPAC (Graph Protein Amino acid Clustering) to identify mutational clustering while considering protein spatial structure. Using GraphPAC, we are able to detect novel clusters in proteins that are known to exhibit mutation clustering as well as identify clusters in proteins without evidence of prior clustering based on current methods. Specifically, by utilizing the spatial information available in the Protein Data Bank (PDB) along with the mutational data in the Catalogue of Somatic Mutations in Cancer (COSMIC), GraphPAC identifies new mutational clusters in well known oncogenes such as EGFR and KRAS. Further, by utilizing graph theory to account for the tertiary structure, GraphPAC discovers clusters in DPP4, NRP1 and other proteins not identified by existing methods. The R package is available at: http://bioconductor.org/packages/release/bioc/html/GraphPAC.html.Conclusion: GraphPAC provides an alternative to iPAC and an extension to current methodology when identifying potential activating driver mutations by utilizing a graph theoretic approach when considering protein tertiary structure. © 2014 Ryslik et al.; licensee BioMed Central Ltd.",
            "authors": [
                "Ryslik G.A.",
                "Cheng Y.",
                "Cheung K.-H.",
                "Modis Y.",
                "Zhao H."
            ],
            "cit_count": 11,
            "doi": "10.1186/1471-2105-15-86",
            "journal": "BMC Bioinformatics",
            "title": "A graph theoretic approach to utilizing protein structure to identify non-random somatic mutations",
            "type": "Primary",
            "year": "2014-03-26"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:graphpac",
        "biotoolsID": "graphpac",
        "description": "Identifies mutational clusters of amino acids in a protein while utilizing the proteins tertiary structure via a graph theoretical model.",
        "homepage": "http://bioconductor.org/packages/release/bioc/html/GraphPAC.html",
        "name": "GraphPAC",
        "version": [
            "1.16.0"
        ]
    }
}