{
    "accessibility": "Open access",
    "additionDate": "2023-02-13T17:42:49.958911Z",
    "biotoolsCURIE": "biotools:smfm",
    "biotoolsID": "smfm",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "lixt314@jlu.edu.cn",
            "name": "Xiangtao Li",
            "orcidid": "https://orcid.org/0000-0002-8716-9823",
            "typeEntity": "Person"
        },
        {
            "name": "Ka-chun Wong"
        },
        {
            "name": "Yansong Wang"
        },
        {
            "name": "Zilong Hou"
        },
        {
            "name": "Yuning Yang",
            "orcidid": "https://orcid.org/0000-0003-4556-139X"
        }
    ],
    "description": "Genome-wide identification and characterization of DNA enhancers with a stacked multivariate fusion framework.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Feature extraction",
                    "uri": "http://edamontology.org/operation_3937"
                },
                {
                    "term": "Sequence motif analysis",
                    "uri": "http://edamontology.org/operation_2404"
                }
            ]
        }
    ],
    "homepage": "https://github.com/no-banana/SMFM-master",
    "language": [
        "Python"
    ],
    "lastUpdate": "2023-02-13T17:42:49.961731Z",
    "license": "Not licensed",
    "name": "SMFM",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PCBI.1010779",
            "metadata": {
                "abstract": "Copyright: © 2022 Wang et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Enhancers are short non-coding DNA sequences outside of the target promoter regions that can be bound by specific proteins to increase a gene’s transcriptional activity, which has a crucial role in the spatiotemporal and quantitative regulation of gene expression. However, enhancers do not have a specific sequence motifs or structures, and their scattered distribution in the genome makes the identification of enhancers from human cell lines particularly challenging. Here we present a novel, stacked multivariate fusion framework called SMFM, which enables a comprehensive identification and analysis of enhancers from regulatory DNA sequences as well as their interpretation. Specifically, to characterize the hierarchical relationships of enhancer sequences, multi-source biological information and dynamic semantic information are fused to represent regulatory DNA enhancer sequences. Then, we implement a deep learning–based sequence network to learn the feature representation of the enhancer sequences comprehensively and to extract the implicit relationships in the dynamic semantic information. Ultimately, an ensemble machine learning classifier is trained based on the refined multi-source features and dynamic implicit relations obtained from the deep learning-based sequence network. Benchmarking experiments demonstrated that SMFM significantly outperforms other existing methods using several evaluation metrics. In addition, an independent test set was used to validate the generalization performance of SMFM by comparing it to other state-of-the-art enhancer identification methods. Moreover, we performed motif analysis based on the contribution scores of different bases of enhancer sequences to the final identification results. Besides, we conducted interpretability analysis of the identified enhancer sequences based on attention weights of EnhancerBERT, a fine-tuned BERT model that provides new insights into exploring the gene semantic information likely to underlie the discovered enhancers in an interpretable manner. Finally, in a human placenta study with 4,562 active distal gene regulatory enhancers, SMFM successfully exposed tissue-related placental development and the differential mechanism, demonstrating the generalizability and stability of our proposed framework.",
                "authors": [
                    {
                        "name": "Hou Z."
                    },
                    {
                        "name": "Li X."
                    },
                    {
                        "name": "Wang Y."
                    },
                    {
                        "name": "Wong K.-C."
                    },
                    {
                        "name": "Yang Y."
                    }
                ],
                "date": "2022-12-01T00:00:00Z",
                "journal": "PLoS Computational Biology",
                "title": "Genome-wide identification and characterization of DNA enhancers with a stacked multivariate fusion framework"
            },
            "pmcid": "PMC9836277",
            "pmid": "36520922"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Gene regulation",
            "uri": "http://edamontology.org/topic_0204"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Ontology and terminology",
            "uri": "http://edamontology.org/topic_0089"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ]
}
