{
    "additionDate": "2020-09-03T19:10:06Z",
    "biotoolsCURIE": "biotools:tinga",
    "biotoolsID": "tinga",
    "collectionID": [
        "BIG N2N",
        "VIB",
        "UGent"
    ],
    "credit": [
        {
            "email": "helena.todorov@irc.vib-ugent.be",
            "name": "Helena Todorov",
            "typeEntity": "Person"
        },
        {
            "email": "yvan.saeys@ugent.be",
            "name": "Yvan Saeys",
            "typeEntity": "Person"
        }
    ],
    "description": "fast and flexible trajectory inference with Growing Neural Gas.\n\nThis is a repository hosting the R implementation of TinGa, a trajectory inference method based on the Growing Neural Gas algorithm [1].\n\nThese instructions show how to use TinGa on an example single cell dataset and how to visualise its results using the dynplot package hosted on github (see https://github.com/dynverse/dynplot).",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Trajectory visualization",
                    "uri": "http://edamontology.org/operation_3890"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Helena-todd/TinGa",
    "lastUpdate": "2020-09-03T19:10:06Z",
    "name": "TinGa",
    "owner": "bits@vib.be",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAA463",
            "metadata": {
                "abstract": "© The Author(s) 2020. Published by Oxford University Press.Motivation: During the last decade, trajectory inference (TI) methods have emerged as a novel framework to model cell developmental dynamics, most notably in the area of single-cell transcriptomics. At present, more than 70 TI methods have been published, and recent benchmarks showed that even state-of-the-art methods only perform well for certain trajectory types but not others. Results: In this work, we present TinGa, a new TI model that is fast and flexible, and that is based on Growing Neural Graphs. We performed an extensive comparison of TinGa to five state-of-the-art methods for TI on a set of 250 datasets, including both synthetic as well as real datasets. Overall, TinGa improves the state-of-the-art by producing accurate models (comparable to or an improvement on the state-of-the-art) on the whole spectrum of data complexity, from the simplest linear datasets to the most complex disconnected graphs. In addition, TinGa obtained the fastest execution times, showing that our method is thus one of the most versatile methods up to date. Availability and implementation: R scripts for running TinGa, comparing it to top existing methods and generating the figures of this article are available at https://github.com/Helena-todd/TinGa.",
                "authors": [
                    {
                        "name": "Todorov H."
                    },
                    {
                        "name": "Cannoodt R."
                    },
                    {
                        "name": "Saelens W."
                    },
                    {
                        "name": "Saeys Y."
                    }
                ],
                "citationCount": 3,
                "date": "2021-01-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "TinGa: Fast and flexible trajectory inference with growing neural gas"
            },
            "pmcid": "PMC7355244",
            "pmid": "32657409"
        }
    ],
    "topic": [
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        }
    ],
    "validated": 1
}