{
    "additionDate": "2020-01-14T19:43:25Z",
    "biotoolsCURIE": "biotools:MS2CNN",
    "biotoolsID": "MS2CNN",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "chang.jiaming@gmail.com",
            "name": "Jia-Ming Chang",
            "orcidid": "https://orcid.org/0000-0002-6711-1739",
            "typeEntity": "Person"
        }
    ],
    "description": "Predicting MS/MS spectrum based on protein sequence using deep convolutional neural networks.\n\nUnder construction, we will update it soon.\n\nMS2CNN compilation requires the following tools installed on your system Python, Keras==2.0.4 and Tensorflow==1.1.0.\n\nPredicting MS/MS spectrum based on protein sequence by Deep Convolutional Neural Networks.\n\nLin YM, Chen CT, Chang JM. MS2CNN: predicting MS/MS spectrum based on protein sequence using deep convolutional neural networks. BMC Genomics. 2019;20(Suppl 9):906",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Peptide database search",
                    "uri": "http://edamontology.org/operation_3646"
                },
                {
                    "term": "Protein identification",
                    "uri": "http://edamontology.org/operation_3767"
                },
                {
                    "term": "Spectral library search",
                    "uri": "http://edamontology.org/operation_3801"
                },
                {
                    "term": "Spectrum calculation",
                    "uri": "http://edamontology.org/operation_3860"
                },
                {
                    "term": "Tag-based peptide identification",
                    "uri": "http://edamontology.org/operation_3643"
                }
            ]
        }
    ],
    "homepage": "https://github.com/changlabtw/MS2CNN",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-12-29T10:39:09Z",
    "license": "GPL-3.0",
    "name": "MS2CNN",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12864-019-6297-6",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Tandem mass spectrometry allows biologists to identify and quantify protein samples in the form of digested peptide sequences. When performing peptide identification, spectral library search is more sensitive than traditional database search but is limited to peptides that have been previously identified. An accurate tandem mass spectrum prediction tool is thus crucial in expanding the peptide space and increasing the coverage of spectral library search. Results: We propose MS2CNN, a non-linear regression model based on deep convolutional neural networks, a deep learning algorithm. The features for our model are amino acid composition, predicted secondary structure, and physical-chemical features such as isoelectric point, aromaticity, helicity, hydrophobicity, and basicity. MS2CNN was trained with five-fold cross validation on a three-way data split on the large-scale human HCD MS2 dataset of Orbitrap LC-MS/MS downloaded from the National Institute of Standards and Technology. It was then evaluated on a publicly available independent test dataset of human HeLa cell lysate from LC-MS experiments. On average, our model shows better cosine similarity and Pearson correlation coefficient (0.690 and 0.632) than MS2PIP (0.647 and 0.601) and is comparable with pDeep (0.692 and 0.642). Notably, for the more complex MS2 spectra of 3+ peptides, MS2PIP is significantly better than both MS2PIP and pDeep. Conclusions: We showed that MS2CNN outperforms MS2PIP for 2+ and 3+ peptides and pDeep for 3+ peptides. This implies that MS2CNN, the proposed convolutional neural network model, generates highly accurate MS2 spectra for LC-MS/MS experiments using Orbitrap machines, which can be of great help in protein and peptide identifications. The results suggest that incorporating more data for deep learning model may improve performance.",
                "authors": [
                    {
                        "name": "Chang J.-M."
                    },
                    {
                        "name": "Chen C.-T."
                    },
                    {
                        "name": "Lin Y.-M."
                    }
                ],
                "citationCount": 5,
                "date": "2019-12-24T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "MS2CNN: Predicting MS/MS spectrum based on protein sequence using deep convolutional neural networks"
            },
            "pmcid": "PMC6929458",
            "pmid": "31874640"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ],
    "validated": 1
}
