{
    "additionDate": "2017-08-20T15:59:18Z",
    "biotoolsCURIE": "biotools:waveqtl",
    "biotoolsID": "waveqtl",
    "collectionID": [
        "Animal and Crop Genomics",
        "Rare Disease"
    ],
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://groups.google.com/forum/?hl=en#!forum/waveqtlusers"
        }
    ],
    "description": "Wavelet-based genetic association analysis of functional phenotypes arising from high-throughput sequencing assays",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/heejungshim/WaveQTL"
        }
    ],
    "editPermission": {
        "authors": [
            "animalandcropgenomics"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genetic mapping",
                    "uri": "http://edamontology.org/operation_0282"
                }
            ]
        }
    ],
    "homepage": "https://github.com/heejungshim/WaveQTL",
    "language": [
        "C++",
        "R"
    ],
    "lastUpdate": "2022-01-17T14:05:57.652914Z",
    "license": "GPL-3.0",
    "name": "WaveQTL",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "admin",
    "publication": [
        {
            "doi": "10.1186/S12864-021-07582-6",
            "metadata": {
                "abstract": "© 2021, The Author(s).Background: Birth weight (BW) is one of the most widely studied anthropometric traits in humans because of its role in various adult-onset diseases. The number of loci associated with BW has increased dramatically since the advent of whole-genome screening approaches such as genome-wide association studies (GWASes) and meta-analyses of GWASes (GWAMAs). To further contribute to elucidating the genetic architecture of BW, we analyzed a genotyped Norwegian dataset with information on child’s BW (N=9,063) using a slightly modified version of a wavelet-based method by Shim and Stephens (2015) called WaveQTL. Results: WaveQTL uses wavelet regression for regional testing and offers a more flexible functional modeling framework compared to conventional GWAS methods. To further improve WaveQTL, we added a novel feature termed “zooming strategy” to enhance the detection of associations in typically small regions. The modified WaveQTL replicated five out of the 133 loci previously identified by the largest GWAMA of BW to date by Warrington et al. (2019), even though our sample size was 26 times smaller than that study and 18 times smaller than the second largest GWAMA of BW by Horikoshi et al. (2016). In addition, the modified WaveQTL performed better in regions of high LD between SNPs. Conclusions: This study is the first adaptation of the original WaveQTL method to the analysis of genome-wide genotypic data. Our results highlight the utility of the modified WaveQTL as a complementary tool for identifying loci that might escape detection by conventional genome-wide screening methods due to power issues. An attractive application of the modified WaveQTL would be to select traits from various public GWAS repositories to investigate whether they might benefit from a second analysis.",
                "authors": [
                    {
                        "name": "Denault W.R.P."
                    },
                    {
                        "name": "Gjessing H.K."
                    },
                    {
                        "name": "Helgeland O."
                    },
                    {
                        "name": "Jacobsson B."
                    },
                    {
                        "name": "Jugessur A."
                    },
                    {
                        "name": "Romanowska J."
                    }
                ],
                "date": "2021-12-01T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "A fast wavelet-based functional association analysis replicates several susceptibility loci for birth weight in a Norwegian population"
            }
        },
        {
            "doi": "10.1214/14-AOAS776",
            "metadata": {
                "abstract": "© Institute of Mathematical Statistics, 2015.Understanding how genetic variants influence cellular-level processes is an important step toward understanding how they influence important organismal-level traits, or “phenotypes,” including human disease susceptibility. To this end, scientists are undertaking large-scale genetic association studies that aim to identify genetic variants associated with molecular and cellular phenotypes, such as gene expression, transcription factor binding, or chromatin accessibility. These studies use high-throughput sequencing assays (e.g., RNA-seq, ChIP-seq, DNase-seq) to obtain high-resolution data on how the traits vary along the genome in each sample. However, typical association analyses fail to exploit these high-resolution measurements, instead aggregating the data at coarser resolutions, such as genes, or windows of fixed length. Here we develop and apply statistical methods that better exploit the high-resolution data. The key idea is to treat the sequence data as measuring an underlying “function” that varies along the genome, and then, building on wavelet-based methods for functional data analysis, test for association between genetic variants and the underlying function. Applying these methods to identify genetic variants associated with chromatin accessibility (dsQTLs), we find that they identify substantially more associations than a simpler window-based analysis, and in total we identify 772 novel dsQTLs not identified by the original analysis.",
                "authors": [
                    {
                        "name": "Shim H."
                    },
                    {
                        "name": "Stephens M."
                    }
                ],
                "citationCount": 14,
                "date": "2015-06-01T00:00:00Z",
                "journal": "Annals of Applied Statistics",
                "title": "Wavelet-based genetic association analysis of functional phenotypes arising from high-throughput sequencing assays"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "ChIP-seq",
            "uri": "http://edamontology.org/topic_3169"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ],
    "validated": 1
}
