{
    "additionDate": "2017-08-20T15:59:18Z",
    "biotoolsCURIE": "biotools:waveqtl",
    "biotoolsID": "waveqtl",
    "collectionID": [
        "Animal and Crop Genomics"
    ],
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://groups.google.com/forum/?hl=en#!forum/waveqtlusers"
        }
    ],
    "description": "Wavelet-based genetic association analysis of functional phenotypes arising from high-throughput sequencing assays",
    "documentation": [
        {
            "type": "General",
            "url": "https://github.com/heejungshim/WaveQTL"
        }
    ],
    "editPermission": {
        "authors": [
            "animalandcropgenomics"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genetic mapping",
                    "uri": "http://edamontology.org/operation_0282"
                }
            ]
        }
    ],
    "homepage": "https://github.com/heejungshim/WaveQTL",
    "language": [
        "R",
        "C++"
    ],
    "lastUpdate": "2019-09-04T08:38:40Z",
    "license": "GPL-3.0",
    "name": "WaveQTL",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "admin",
    "publication": [
        {
            "doi": "10.1214/14-AOAS776",
            "metadata": {
                "abstract": "© Institute of Mathematical Statistics, 2015.Understanding how genetic variants influence cellular-level processes is an important step toward understanding how they influence important organismal-level traits, or “phenotypes,” including human disease susceptibility. To this end, scientists are undertaking large-scale genetic association studies that aim to identify genetic variants associated with molecular and cellular phenotypes, such as gene expression, transcription factor binding, or chromatin accessibility. These studies use high-throughput sequencing assays (e.g., RNA-seq, ChIP-seq, DNase-seq) to obtain high-resolution data on how the traits vary along the genome in each sample. However, typical association analyses fail to exploit these high-resolution measurements, instead aggregating the data at coarser resolutions, such as genes, or windows of fixed length. Here we develop and apply statistical methods that better exploit the high-resolution data. The key idea is to treat the sequence data as measuring an underlying “function” that varies along the genome, and then, building on wavelet-based methods for functional data analysis, test for association between genetic variants and the underlying function. Applying these methods to identify genetic variants associated with chromatin accessibility (dsQTLs), we find that they identify substantially more associations than a simpler window-based analysis, and in total we identify 772 novel dsQTLs not identified by the original analysis.",
                "authors": [
                    {
                        "name": "Shim H."
                    },
                    {
                        "name": "Stephens M."
                    }
                ],
                "citationCount": 10,
                "date": "2015-01-01T00:00:00Z",
                "journal": "Annals of Applied Statistics",
                "title": "Wavelet-based genetic association analysis of functional phenotypes arising from high-throughput sequencing assays"
            },
            "type": "Primary"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "ChIP-seq",
            "uri": "http://edamontology.org/topic_3169"
        },
        {
            "term": "RNA-seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        }
    ],
    "validated": 1
}