{"credit":[{"email":"sandro@ebi.ac.uk","name":"Sandro Morganella","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"url":"http://bioconductor.org/packages/release/bioc/html/Vega.html"}],"download":[{"type":"Source code","url":"http://bioconductor/packages/release/bioc/src/contrib/Vega_1.22.0.tar.gz"}],"function":[{"input":[{"data":{"term":"Microarray hybridisation data","uri":"http://edamontology.org/data_3117"},"format":[{"term":"Microarray experiment data format","uri":"http://edamontology.org/format_2056"}]}],"operation":[{"term":"Polymorphism detection","uri":"http://edamontology.org/operation_3202"},{"term":"Genome comparison","uri":"http://edamontology.org/operation_3209"},{"term":"Gene expression analysis","uri":"http://edamontology.org/operation_2495"}]}],"labels":{"collectionID":["BioConductor"],"language":["R"],"license":"GPL-2.0","operatingSystem":["Linux","Windows","Mac"],"toolType":["Command-line tool","Library"],"topic":[{"term":"Microarray experiment","uri":"http://edamontology.org/topic_3518"},{"term":"DNA mutation","uri":"http://edamontology.org/topic_2533"}]},"publication":[{"abstract":"Motivation: Genomic copy number (CN) information is useful to study genetic traits of many diseases. Using array comparative genomic hybridization (aCGH), researchers are able to measure the copy number of thousands of DNA loci at the same time. Therefore, a current challenge in bioinformatics is the development of efficient algorithms to detect the map of aberrant chromosomal regions. Methods: We describe an approach for the segmentation of copy number aCGH data. Variational estimator for genomic aberrations (VEGA) adopt a variational model used in image segmentation. The optimal segmentation is modeled as the minimum of an energy functional encompassing both the quality of interpolation of the data and the complexity of the solution measured by the length of the boundaries between segmented regions. This solution is obtained by a region growing process where the stop condition is completely data driven. Results: VEGA is compared with three algorithms that represent the state of the art in CN segmentation. Performance assessment is made both on synthetic and real data. Synthetic data simulate different noise conditions. Results on these data show the robustness with respect to noise of variational models and the accuracy of VEGA in terms of recall and precision. Eight mantle cell lymphoma cell lines and two samples of glioblastoma multiforme are used to evaluate the behavior of VEGA on real biological data. Comparison between results and current biological knowledge shows the ability of the proposed method in detecting known chromosomal aberrations. © The Author 2010. Published by Oxford University Press. All rights reserved.","authors":["Morganella S.","Cerulo L.","Viglietto G.","Ceccarelli M."],"cit_count":12,"doi":"10.1093/bioinformatics/btq586","journal":"Bioinformatics","title":"VEGA: Variational segmentation for copy number detection","type":"Primary","year":"2010-12-01"}],"summary":{"biotoolsCURIE":"biotools:vega","biotoolsID":"vega","description":"The Variational Estimator for Genomic Aberrations is an algorithm that adapts a very popular variational model (Mumford and Shah) used in image segmentation so that chromosomal aberrant regions can be efficiently detected.","homepage":"http://bioconductor.org/packages/release/bioc/html/Vega.html","name":"Vega","version":["1.22.0"]}}