
{
    "credit": [
        {
            "email": "martin.meier-schellersheim@nih.gov",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "https://www.niaid.nih.gov/research/simmune-project"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Molecular dynamics simulation",
                    "uri": "http://edamontology.org/operation_2476"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "MATLAB"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Desktop application",
            "Suite"
        ],
        "topic": [
            {
                "term": "Systems biology",
                "uri": "http://edamontology.org/topic_2259"
            },
            {
                "term": "Molecular interactions, pathways and networks",
                "uri": "http://edamontology.org/topic_0602"
            },
            {
                "term": "Cell biology",
                "uri": "http://edamontology.org/topic_2229"
            },
            {
                "term": "Simulation experiment",
                "uri": "http://edamontology.org/topic_3524"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://www.mybiosoftware.com/simmune-generation-comprehensive-models.html"
        }
    ],
    "publication": [
        {
            "abstract": "Biochemical modeling efforts now frequently take advantage of the possibility to automatically create reaction networks based on the specification of pairwise molecular interactions. Even though a variety of tools exist to visualize the resulting networks, defining the rules for the molecular interactions typically requires writing scripts, which impacts the non-specialist accessibility of those approaches. We introduce the Simmune Modeler that allows users to specify molecular complexes and their interactions as well as the reaction-induced modifications of the molecules through a flexible visual interface. It can take into account the positions of the components of trans-membrane complexes relative to the embedding membranes as well as symmetry aspects affecting the reactions of multimeric molecular structures. Models created with this tool can be simulated using the Simmune Simulator or be exported as SBML code or as files describing the reaction networks as systems of ODEs for import into Matlab. The Simmune Modeler and the associated simulators as well as extensive additional documentation and tutorials are freely available for Linux, Mac and Windows: http://go.usa.gov/QeH (Note shortened case-sensitive URL!).",
            "authors": [
                "Zhang F.",
                "Angermann B.R.",
                "Meier-Schellersheim M."
            ],
            "cit_count": 17,
            "journal": "Bioinformatics (Oxford, England)",
            "pmid": "23508970",
            "title": "The Simmune Modeler visual interface for creating signaling networks based on bi-molecular interactions.",
            "year": "2013-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:simmune",
        "biotoolsID": "simmune",
        "description": "Suite of software tools that guides the user through the multiple hierarchical scales of cellular behavior, facilitating the generation of comprehensive models. It was originally created to simulate immunological phenomena, but it is applicable to a very broad class of cell biological models.",
        "homepage": "http://www.niaid.nih.gov/labsandresources/labs/aboutlabs/lsb/Pages/simmuneproject.aspx",
        "name": "Simmune"
    }
}