{
    "additionDate": "2017-08-03T18:45:21Z",
    "biotoolsCURIE": "biotools:genotan",
    "biotoolsID": "genotan",
    "credit": [
        {
            "email": "garner@vbi.vt.edu",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Free tool to identify length variation of microsatellites from short sequence reads. Inferring lengths of inherited microsatellite alleles with single base pair resolution from short sequence reads is challenging due to several sources of noise including PCR amplification errors, individual cell mutation, misalignment or mis-mapping caused by the repetitive nature of the microsatellites.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://genotan.sourceforge.net/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                }
            ]
        }
    ],
    "homepage": "http://genotan.sourceforge.net/",
    "language": [
        "Perl"
    ],
    "lastUpdate": "2018-12-10T12:58:49Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/genotan-0-1-5-genotyping-of-microsatellite-loci.html"
        }
    ],
    "name": "GenoTan",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Motivation: Inferring lengths of inherited microsatellite alleles with single base pair resolution from short sequence reads is challenging due to several sources of noise caused by the repetitive nature of microsatellites and the technologies used to generate raw sequence data.Results: We have developed a program, GenoTan, using a discretized Gaussian mixture model combined with a rules-based approach to identify inherited variation of microsatellite loci from short sequence reads without paired-end information. It effectively distinguishes length variants from noise including insertion/deletion errors in homopolymer runs by addressing the bidirectional aspect of insertion and deletion errors in sequence reads. Here we first introduce a homopolymer decomposition method which estimates error bias toward insertion or deletion in homopolymer sequence runs. Combining these approaches, GenoTan was able to genotype 94.9% of microsatellite loci accurately from simulated data with 40x sequence coverage quickly while the other programs showed <90% correct calls for the same data and required 5∼30× more computational time than GenoTan. It also showed the highest true-positive rate for real data using mixed sequence data of two Drosophila inbred lines, which was a novel validation approach for genotyping. © 2013 The Author 2013. Published by Oxford University Press. All rights reserved.",
                "authors": [
                    {
                        "name": "Tae H."
                    },
                    {
                        "name": "Kim D.-Y."
                    },
                    {
                        "name": "McCormick J."
                    },
                    {
                        "name": "Settlage R.E."
                    },
                    {
                        "name": "Garner H.R."
                    }
                ],
                "citationCount": 11,
                "date": "2014-03-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Discretized Gaussian mixture for genotyping of microsatellite loci containing homopolymer runs"
            },
            "pmid": "24135263"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "DNA mutation",
            "uri": "http://edamontology.org/topic_2533"
        },
        {
            "term": "Genotyping experiment",
            "uri": "http://edamontology.org/topic_3516"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        }
    ],
    "validated": 1
}