{
    "additionDate": "2020-01-14T19:43:10Z",
    "biotoolsCURIE": "biotools:TabSINT",
    "biotoolsID": "TabSINT",
    "confidence_flag": "tool",
    "description": "open-source mobile software for distributed studies of hearing.\n\nTabSINT is an open source platform for administering tablet based hearing-related exams, as well as general-purpose questionnaires. It is meant to be flexible, easy-to-use, and useful for administrators who manage studies of all sizes.\n\nOpen source platform for hearing assessments,and general purpose questionnaires",
    "editPermission": {
        "type": "public"
    },
    "homepage": "http://tabsint.org",
    "lastUpdate": "2020-12-27T14:01:46Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://gitlab.com/creare-com/tabsint"
        }
    ],
    "name": "TabSINT",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1080/14992027.2019.1698776",
            "metadata": {
                "abstract": "© 2019, © 2019 The Authors. Published by Informa UK Limited, trading as Taylor & Francis Group on behalf of British Society of Audiology, International Society of Audiology, and Nordic Audiological Society.Objective: The recent emphasis on outcomes-based medical research has motivated a need for technology that allows researchers and clinicians to reach a larger and more diverse subject population for recruitment and testing. Design: This article reports on open-source mobile software (TabSINT) that enables researchers to administer customised hearing tests and questionnaires on tablets located across multiple sites. Researchers create and modify test protocols using text-based templates and deploy it to the tablets via a cloud-based repository or USB-computer connection. Results are exported locally to the tablet SD card and can also be automatically posted to a cloud-based database. Results: Between 2014 and 2019, TabSINT collected 25,000+ test results using more than 200+ unique test protocols for researchers located worldwide. Conclusions:TabSINT is a powerful software system with the potential to greatly enhance research across multiple disciplines by enabling access to subject cohorts in remote and disparate locations. Released open-source, this software is available to researchers across the world to use and adapt to their specific needs. Researchers with engineering resources can contribute to the repository to extend the capability and robustness of this software.",
                "authors": [
                    {
                        "name": "Shapiro M.L."
                    },
                    {
                        "name": "Norris J.A."
                    },
                    {
                        "name": "Wilbur J.C."
                    },
                    {
                        "name": "Brungart D.S."
                    },
                    {
                        "name": "Clavier O.H."
                    }
                ],
                "citationCount": 3,
                "date": "2020-01-31T00:00:00Z",
                "journal": "International Journal of Audiology",
                "title": "TabSINT: open-source mobile software for distributed studies of hearing"
            },
            "pmid": "31846397"
        }
    ],
    "topic": [
        {
            "term": "Medical informatics",
            "uri": "http://edamontology.org/topic_3063"
        },
        {
            "term": "Database management",
            "uri": "http://edamontology.org/topic_3489"
        }
    ],
    "validated": 1
}