{
    "additionDate": "2021-01-18T11:43:08Z",
    "biotoolsCURIE": "biotools:liggrep",
    "biotoolsID": "liggrep",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "durrantj@pitt.edu",
            "name": "Jacob D. Durrant",
            "orcidid": "https://orcid.org/0000-0002-5808-4097",
            "typeEntity": "Person"
        }
    ],
    "description": "A tool for filtering docked poses to improve virtual-screening hit rates.\n\nLigGrep is a free, open-source program for identifying docked poses that participate in user-specified receptor/ligand interactions. As input, LigGrep accepts a protein receptor file (PDB, PDBQT), a directory containing many docked-compound files (PDB, PDBQT, SDF), and a list of user-specified filters (JSON). It evaluates each docked pose and outputs the names of the compounds with poses that pass all filters.\n\nJacob Durrant software July 7, 2020July 10, 2020.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Virtual screening",
                    "uri": "http://edamontology.org/operation_3938"
                },
                {
                    "term": "Filtering",
                    "uri": "http://edamontology.org/operation_3695"
                },
                {
                    "term": "Protein-protein docking",
                    "uri": "http://edamontology.org/operation_3899"
                }
            ]
        }
    ],
    "homepage": "http://durrantlab.com/liggrep/",
    "lastUpdate": "2021-02-16T08:40:58Z",
    "name": "LigGrep",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1186/S13321-020-00471-2",
            "metadata": {
                "abstract": "© 2020, The Author(s).Structure-based virtual screening (VS) uses computer docking to prioritize candidate small-molecule ligands for subsequent experimental testing. Docking programs evaluate molecular binding in part by predicting the geometry with which a given compound might bind a target receptor (e.g., the docked “pose” relative to a protein target). Candidate ligands predicted to participate in the same intermolecular interactions typical of known ligands (or ligands that bind related proteins) are arguably more likely to be true binders. Some docking programs allow users to apply constraints during the docking process with the goal of prioritizing these critical interactions. But these programs often have restrictive and/or expensive licenses, and many popular open-source docking programs (e.g., AutoDock Vina) lack this important functionality. We present LigGrep, a free, open-source program that addresses this limitation. As input, LigGrep accepts a protein receptor file, a directory containing many docked-compound files, and a list of user-specified filters describing critical receptor/ligand interactions. LigGrep evaluates each docked pose and outputs the names of the compounds with poses that pass all filters. To demonstrate utility, we show that LigGrep can improve the hit rates of test VS targeting H. sapiens poly(ADPribose) polymerase 1 (HsPARP1), H. sapiens peptidyl-prolyl cis-trans isomerase NIMA-interacting 1 (HsPin1p), and S. cerevisiae hexokinase-2 (ScHxk2p). We hope that LigGrep will be a useful tool for the computational biology community. A copy is available free of charge at http://durrantlab.com/liggrep/.",
                "authors": [
                    {
                        "name": "Ha E.J."
                    },
                    {
                        "name": "Lwin C.T."
                    },
                    {
                        "name": "Durrant J.D."
                    }
                ],
                "citationCount": 1,
                "date": "2020-12-01T00:00:00Z",
                "journal": "Journal of Cheminformatics",
                "title": "LigGrep: a tool for filtering docked poses to improve virtual-screening hit rates"
            },
            "pmcid": "PMC7656723",
            "pmid": "33292486"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Molecular modelling",
            "uri": "http://edamontology.org/topic_2275"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Drug discovery",
            "uri": "http://edamontology.org/topic_3336"
        }
    ]
}