{
    "accessibility": "Open access",
    "additionDate": "2024-01-05T13:55:22.577689Z",
    "biotoolsCURIE": "biotools:cil-expmrm",
    "biotoolsID": "cil-expmrm",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "Jie.zheng0402@gmail.com",
            "name": "Jie Zheng",
            "typeEntity": "Person"
        },
        {
            "email": "fanrong.zhao@ntu.edu.sg",
            "name": "Fanrong Zhao",
            "typeEntity": "Person"
        },
        {
            "email": "mlfang@ntu.edu.sg",
            "name": "Mingliang Fang",
            "typeEntity": "Person"
        },
        {
            "email": "pe0001bo@e.ntu.edu.sg",
            "name": "Bo Peng",
            "typeEntity": "Person"
        },
        {
            "email": "yang0531@e.ntu.edu.sg",
            "name": "Junjie Yang",
            "typeEntity": "Person"
        },
        {
            "email": "yulan.wang@ntu.edu.sg",
            "name": "Yulan Wang",
            "typeEntity": "Person"
        }
    ],
    "description": "An Ultrasensitive Chemical Isotope Labeling Assisted Pseudo-MRM Platform to Accelerate Exposomic Suspect Screening.\n\nExposome is the future of next-generation environmental health to establish the association between environmental exposure and diseases. However, due to low concentrations of exposure chemicals, exposome has been hampered by lacking an effective analytical platform to characterize its composition. In this study, by combining the benefit of chemical isotope labeling and pseudo-multiple reaction monitoring (CIL-pseudo-MRM), we have developed one highly sensitive and high-throughput platform (CIL-ExPMRM) by isotope labeling urinary exposure biomarkers. Dansyl chloride (DnsCl), <i>N< i>-methylphenylethylamine (MPEA), and their isotope-labeled forms were used to derivatize polar hydroxyl and carboxyl compounds, respectively\n\n||| HOMEPAGE MISSING!\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'MRM'",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Dimethyl",
                    "uri": "http://edamontology.org/operation_3642"
                },
                {
                    "term": "Peak detection",
                    "uri": "http://edamontology.org/operation_3215"
                },
                {
                    "term": "Retention time prediction",
                    "uri": "http://edamontology.org/operation_3633"
                }
            ]
        }
    ],
    "homepage": "http://www.exposomemrm.com/about",
    "language": [
        "Python",
        "R"
    ],
    "lastUpdate": "2024-01-05T13:55:22.580301Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/FangLabNTU/CIL-ExPMRM"
        }
    ],
    "name": "CIL-ExPMRM",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1021/ACS.EST.3C01830",
            "metadata": {
                "abstract": "Exposome is the future of next-generation environmental health to establish the association between environmental exposure and diseases. However, due to low concentrations of exposure chemicals, exposome has been hampered by lacking an effective analytical platform to characterize its composition. In this study, by combining the benefit of chemical isotope labeling and pseudo-multiple reaction monitoring (CIL-pseudo-MRM), we have developed one highly sensitive and high-throughput platform (CIL-ExPMRM) by isotope labeling urinary exposure biomarkers. Dansyl chloride (DnsCl), N-methylphenylethylamine (MPEA), and their isotope-labeled forms were used to derivatize polar hydroxyl and carboxyl compounds, respectively. We have programmed a series of scripts to optimize MRM transition parameters, curate the MRM database (>70,000 compounds), predict accurate retention time (RT), and automize dynamic MRMs. This was followed by an automated MRM peak assignment, peak alignment, and statistical analysis. A computational pipeline was eventually incorporated into a user-friendly website interface, named CIL-ExPMRM (http://www.exposomemrm.com/). The performance of this platform has been validated with a relatively low false positive rate (10.7%) across instrumental platforms. CIL-ExPMRM has systematically overcome key bottlenecks of exposome studies to some extent and outperforms previous methods due to its independence of MS/MS availability, accurate RT prediction, and collision energy optimization, as well as the ultrasensitivity and automated robust intensity-based quantification. Overall, CIL-ExPMRM has great potential to advance the exposomic studies based on urinary biomarkers.",
                "authors": [
                    {
                        "name": "Fang M."
                    },
                    {
                        "name": "Peng B."
                    },
                    {
                        "name": "Wang Y."
                    },
                    {
                        "name": "Yang J."
                    },
                    {
                        "name": "Zhao F."
                    },
                    {
                        "name": "Zheng J."
                    }
                ],
                "date": "2023-08-01T00:00:00Z",
                "journal": "Environmental Science and Technology",
                "title": "CIL-ExPMRM: An Ultrasensitive Chemical Isotope Labeling Assisted Pseudo-MRM Platform to Accelerate Exposomic Suspect Screening"
            },
            "pmid": "37469223"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Compound libraries and screening",
            "uri": "http://edamontology.org/topic_3343"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        }
    ]
}
