{
    "additionDate": "2018-06-16T10:15:47Z",
    "biotoolsCURIE": "biotools:spatkin",
    "biotoolsID": "spatkin",
    "credit": [
        {
            "email": "spatkin.simulator@gmail.com",
            "name": "Support",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Implements a direct, lattice-based method, which avoids enumeration of the reaction network implied by a set of rules. Models are specified using an extension of the BioNetGen language, which adds features necessary for characterizing diffusion properties of biomolecules.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://pmbm.ippt.pan.pl/software/spatkin/release/spatkin-1.0.0-manual.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Molecular dynamics",
                    "uri": "http://edamontology.org/operation_2476"
                }
            ]
        }
    ],
    "homepage": "http://pmbm.ippt.pan.pl/web/Spatkin",
    "language": [
        "C++"
    ],
    "lastUpdate": "2018-12-10T12:58:59Z",
    "license": "GPL-3.0",
    "name": "SPATKIN",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btx456",
            "metadata": {
                "abstract": "© The Author 2017. Published by Oxford University Press. All rights reserved.Summary Rule-based modeling is a powerful approach for studying biomolecular site dynamics. Here, we present SPATKIN, a general-purpose simulator for rule-based modeling in two spatial dimensions. The simulation algorithm is a lattice-based method that tracks Brownian motion of individual molecules and the stochastic firing of rule-defined reaction events. Because rules are used as event generators, the algorithm is network-free, meaning that it does not require to generate the complete reaction network implied by rules prior to simulation. In a simulation, each molecule (or complex of molecules) is taken to occupy a single lattice site that cannot be shared with another molecule (or complex). SPATKIN is capable of simulating a wide array of membrane-associated processes, including adsorption, desorption and crowding. Models are specified using an extension of the BioNetGen language, which allows to account for spatial features of the simulated process. Availability and implementation The C ++ source code for SPATKIN is distributed freely under the terms of the GNU GPLv3 license. The source code can be compiled for execution on popular platforms (Windows, Mac and Linux). An installer for 64-bit Windows and a macOS app are available. The source code and precompiled binaries are available at the SPATKIN Web site (http://pmbm.ippt.pan.pl/software/spatkin). Contact spatkin.simulator@gmail.com Supplementary informationSupplementary dataare available at Bioinformatics online.",
                "authors": [
                    {
                        "name": "Hlavacek W.S."
                    },
                    {
                        "name": "Kochaaczyk M."
                    },
                    {
                        "name": "Lipniacki T."
                    }
                ],
                "citationCount": 3,
                "date": "2017-11-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "SPATKIN: A simulator for rule-based modeling of biomolecular site dynamics on surfaces"
            }
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Molecular dynamics",
            "uri": "http://edamontology.org/topic_0176"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Molecular modelling",
            "uri": "http://edamontology.org/topic_2275"
        },
        {
            "term": "Simulation experiment",
            "uri": "http://edamontology.org/topic_3524"
        }
    ],
    "validated": 1
}
