{
    "additionDate": "2017-12-18T00:11:24Z",
    "biotoolsCURIE": "biotools:pseudodomain",
    "biotoolsID": "pseudodomain",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.linkedin.com/in/yuanzhang1"
        }
    ],
    "description": "PseudoDomain is used to identify processed pseudogenes of mammalian genomes. Unlike most existing tools, it is based on profile HMM-based homology search. It searches genomic sequences against protein domain database.Therefore, when protein annotations of the genome is not available, it still can accurately identify processed pseudogenes.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://sourceforge.net/projects/pseudodomain/files/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Search",
                    "uri": "http://edamontology.org/operation_2421"
                }
            ]
        }
    ],
    "homepage": "http://sourceforge.net/projects/pseudodomain/",
    "language": [
        "C++",
        "Python"
    ],
    "lastUpdate": "2018-12-10T12:58:58Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/pseudodomain-20120621-pseudogene-identification-tool.html"
        }
    ],
    "name": "PseudoDomain",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1145/2382936.2382959",
            "metadata": {
                "abstract": "Pseudogenes are dysfunctional DNA sequences that share sequence similarities with functional genes. Accurate identification of pseudogenes is important to understand biological and evolutionary histories of genomes and genes. Most existing pseudogene identification tools rely on homology search between genomic sequences and annotated proteins of the same genome. However, when accurate annotations of the genome of interest are not available, these tools will not be able to provide reliable pseudogene identification. In this work, we introduce a new pseudogene identification tool named PseudoDomain, which is designed to accurately identify processed pseudogenes in genomes with or without gene annotations. PseudoDomain uses profile Hidden Markov Model-based homology search between genomic sequences and protein domain families, which are conserved in a large number of proteins. Experimental results show that our method is able to effectively identify processed pseudogenes with high sensitivity and low false positive rate. In addition, it can accurately predict the number and positions of frameshifts within putative pseudogenes. Copyright © 2012 ACM.",
                "authors": [
                    {
                        "name": "Sun Y."
                    },
                    {
                        "name": "Zhang Y."
                    }
                ],
                "date": "2012-11-26T00:00:00Z",
                "journal": "2012 ACM Conference on Bioinformatics, Computational Biology and Biomedicine, BCB 2012",
                "title": "PseudoDomain: Identification of processed pseudogenes based on protein domain classification"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Sequences",
            "uri": "http://edamontology.org/topic_0080"
        }
    ],
    "validated": 1,
    "version": [
        "20130916"
    ]
}
