
{
    "credit": [
        {
            "email": "David.Pollock@UCDenver.edu",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://www.evolutionarygenomics.com/contact.html"
        }
    ],
    "documentation": [
        {
            "type": "User manual",
            "url": "http://www.evolutionarygenomics.com/ProgramsData/SULDEX/Usage.txt"
        }
    ],
    "function": [
        {
            "note": "Binding dissociation constant analysis",
            "operation": [
                {
                    "term": "Sequence analysis",
                    "uri": "http://edamontology.org/operation_2403"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux",
            "Mac"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Sequencing",
                "uri": "http://edamontology.org/topic_3168"
            },
            {
                "term": "DNA",
                "uri": "http://edamontology.org/topic_0654"
            },
            {
                "term": "Transcription factors and regulatory sites",
                "uri": "http://edamontology.org/topic_0749"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/suldex-0-01-simultaneous-ultra-high-throughput-ligand-dissociation-experiment.html"
        }
    ],
    "publication": [
        {
            "abstract": "Transcriptional regulation depends upon the binding of transcription factor (TF) proteins to DNA in a sequence-dependent manner. Although many experimental methods address the interaction between DNA and proteins, they generally do not comprehensively and accurately assess the full binding repertoire (the complete set of sequences that might be bound with at least moderate strength). Here, we develop and evaluate through simulation an experimental approach that allows simultaneous high-throughput quantitative analysis of TF binding affinity to thousands of potential DNA ligands. Tens of thousands of putative binding targets can be mixed with a TF, and both the pre-bound and bound target pools sequenced. A hierarchical Bayesian Markov chain Monte Carlo approach determines posterior estimates for the dissociation constants, sequence-specific binding energies, and free TF concentrations. A unique feature of our approach is that dissociation constants are jointly estimated from their inferred degree of binding and from a model of binding energetics, depending on how many sequence reads are available and the explanatory power of the energy model. Careful experimental design is necessary to obtain accurate results over a wide range of dissociation constants. This approach, which we call Simultaneous Ultra high-throughput Ligand Dissociation EXperiment (SULDEX), is theoretically capable of rapid and accurate elucidation of an entire TF-binding repertoire. © 2011 Pollock et al.",
            "authors": [
                "Pollock D.D.",
                "de Koning A.P.J.",
                "Kim H.",
                "Castoe T.A.",
                "Churchill M.E.A.",
                "Kechris K.J."
            ],
            "cit_count": 0,
            "journal": "PLoS ONE",
            "pmid": "22069446",
            "title": "Bayesian analysis of high-throughput quantitative measurement of protein-DNA interactions",
            "year": "2011-11-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:suldex",
        "biotoolsID": "suldex",
        "description": "The packages is designed to use high throughput sequencing to simultaneously analyze binding dissociation constants for large repertoires of sequences.",
        "homepage": "http://www.evolutionarygenomics.com/ProgramsData/SULDEX/SULDEX.html",
        "name": "SULDEX"
    }
}