{
    "additionDate": "2018-07-15T10:42:53Z",
    "biotoolsCURIE": "biotools:gamola2",
    "biotoolsID": "gamola2",
    "credit": [
        {
            "email": "eric.altermann@agresearch.co.nz",
            "name": "Eric Altermann",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Comprehensive Software Package for the Annotation and Curation of Draft and Complete Microbial Genomes.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://drive.google.com/file/d/0B_fIEHIR2oaaczBQT2dYQUw4TUE/view"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genome annotation",
                    "uri": "http://edamontology.org/operation_0362"
                }
            ]
        }
    ],
    "homepage": "https://drive.google.com/file/d/0B_fIEHIR2oaabVlzcF9NUTlnbjQ/view",
    "language": [
        "Java",
        "Perl"
    ],
    "lastUpdate": "2018-12-10T12:59:00Z",
    "name": "GAMOLA2",
    "operatingSystem": [
        "Linux",
        "Windows"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.3389/fmicb.2017.00346",
            "metadata": {
                "abstract": "© 2017 Altermann, Lu and McCulloch.Expert curated annotation remains one of the critical steps in achieving a reliable biological relevant annotation. Here we announce the release of GAMOLA2, a user friendly and comprehensive software package to process, annotate and curate draft and complete bacterial, archaeal, and viral genomes. GAMOLA2 represents a wrapping tool to combine gene model determination, functional Blast, COG, Pfam, and TIGRfam analyses with structural predictions including detection of tRNAs, rRNA genes, non-coding RNAs, signal protein cleavage sites, transmembrane helices, CRISPR repeats and vector sequence contaminations. GAMOLA2 has already been validated in a wide range of bacterial and archaeal genomes, and its modular concept allows easy addition of further functionality in future releases. A modified and adapted version of the Artemis Genome Viewer (Sanger Institute) has been developed to leverage the additional features and underlying information provided by the GAMOLA2 analysis, and is part of the software distribution. In addition to genome annotations, GAMOLA2 features, among others, supplemental modules that assist in the creation of custom Blast databases, annotation transfers between genome versions, and the preparation of Genbank files for submission via the NCBI Sequin tool. GAMOLA2 is intended to be run under a Linux environment, whereas the subsequent visualization and manual curation in Artemis is mobile and platform independent. The development of GAMOLA2 is ongoing and community driven. New functionality can easily be added upon user requests, ensuring that GAMOLA2 provides information relevant to microbiologists. The software is available free of charge for academic use.",
                "authors": [
                    {
                        "name": "Altermann E."
                    },
                    {
                        "name": "Lu J."
                    },
                    {
                        "name": "McCulloch A."
                    }
                ],
                "citationCount": 18,
                "date": "2017-03-23T00:00:00Z",
                "journal": "Frontiers in Microbiology",
                "title": "GAMOLA2, a comprehensive software package for the annotation and curation of draft and complete microbial genomes"
            }
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Microbiology",
            "uri": "http://edamontology.org/topic_3301"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ],
    "validated": 1
}