{
    "accessibility": "Open access",
    "additionDate": "2023-03-19T10:28:31.159723Z",
    "biotoolsCURIE": "biotools:mg-net",
    "biotoolsID": "mg-net",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Guangbin Cui"
        },
        {
            "name": "Jingyuan Li"
        },
        {
            "name": "Wenfang Sun"
        },
        {
            "name": "Yi Zhang",
            "orcidid": "https://orcid.org/0000-0003-0859-9735"
        }
    ],
    "description": "Multi-level global-aware network for thymoma segmentation.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Leejyuan/MGNet",
    "language": [
        "Python"
    ],
    "lastUpdate": "2023-03-19T10:28:31.163892Z",
    "license": "Not licensed",
    "name": "MG-Net",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1016/J.COMPBIOMED.2023.106635",
            "metadata": {
                "abstract": "Background and objective: Automatic thymoma segmentation in preoperative contrast-enhanced computed tomography (CECT) images makes great sense for diagnosis. Although convolutional neural networks (CNNs) are distinguished in medical image segmentation, they are challenged by thymomas with various shapes, scales and textures, owing to the intrinsic locality of convolution operations. In order to overcome this deficit, we built a deep learning network with enhanced global-awareness for thymoma segmentation. Methods: We propose a multi-level global-aware network (MG-Net) for thymoma segmentation, in which the multi-level feature interaction and integration are jointly designed to enhance the global-awareness of CNNs. Particularly, we design the cross-attention block (CAB) to calculate pixel-wise interactions of multi-level features, resulting in the Global Enhanced Convolution Block, which can enable the network to handle various thymomas by strengthening the global-awareness of the encoder. We further devise the Global Spatial Attention Module to integrate coarse- and fine-grain information for enhancing the semantic consistency between the encoder and decoder with CABs. We also develop an Adaptive Attention Fusion Module to adaptively aggregate different semantic-scale features in the decoder to preserve comprehensive details. Results: The MG-Net has been evaluated against several state-of-the-art models on the self-collected CECT dataset and NIH Pancreas-CT dataset. Results suggest that all designed components are effective, and MG-Net has superior segmentation performance and generalization ability over existing models. Conclusion: Both the qualitative and quantitative experimental results indicate that our MG-Net with global-aware ability can achieve accurate thymoma segmentation and has generalization ability in different tasks. The code is available at: https://github.com/Leejyuan/MGNet.",
                "authors": [
                    {
                        "name": "An G."
                    },
                    {
                        "name": "Cui G."
                    },
                    {
                        "name": "Fan X."
                    },
                    {
                        "name": "Li J."
                    },
                    {
                        "name": "Sun W."
                    },
                    {
                        "name": "Zhang Y."
                    },
                    {
                        "name": "von Deneen K.M."
                    }
                ],
                "date": "2023-03-01T00:00:00Z",
                "journal": "Computers in Biology and Medicine",
                "title": "MG-Net: Multi-level global-aware network for thymoma segmentation"
            },
            "pmid": "36791547"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        },
        {
            "term": "Tomography",
            "uri": "http://edamontology.org/topic_3452"
        }
    ]
}
