{
    "additionDate": "2020-01-09T17:51:26Z",
    "biotoolsCURIE": "biotools:PhISCS",
    "biotoolsID": "PhISCS",
    "confidence_flag": "tool",
    "credit": [
        {
            "name": "Salem Malikic",
            "typeEntity": "Person"
        },
        {
            "name": "Farid Rashidi Mehrabadi",
            "typeEntity": "Person"
        },
        {
            "name": "Simone Ciccolella",
            "typeEntity": "Person"
        },
        {
            "name": "Iman Hajirasouliha",
            "typeEntity": "Person"
        },
        {
            "email": "cenk.sahinalp@nih.gov",
            "name": "S. Cenk Sahinalp",
            "typeEntity": "Person"
        }
    ],
    "description": "PhISCS is a tool for sub-perfect tumor phylogeny reconstruction via integrative use of single-cell and bulk sequencing data. If bulk sequencing data is used, we expect that mutations originate from diploid regions of the genome. Due to variance in VAF values, we recommend the use of bulk data in cases when sequencing depth is at least 1000x (haploid coverage). As output, PhISCS reports tree of tumor evolution together with a set of eliminated mutations, where eliminated mutations represent mutations violating Infinite Sites Assumption (due to deletion of variant allele or due to recurrent mutation) or mutations affected by copy number aberrations that were missed during the tumor copy number profiling (e.g. gain of non-variant allele).",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Haplotype mapping",
                    "uri": "http://edamontology.org/operation_0487"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Copy number estimation",
                    "uri": "http://edamontology.org/operation_3233"
                }
            ]
        }
    ],
    "homepage": "https://github.com/sfu-compbio/PhISCS",
    "language": [
        "C++",
        "Python"
    ],
    "lastUpdate": "2021-01-09T14:52:49Z",
    "name": "PhISCS",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1101/GR.234435.118",
            "metadata": {
                "abstract": "© 2019 Malikic et al.Available computational methods for tumor phylogeny inference via single-cell sequencing (SCS) data typically aim to identify the most likely perfect phylogeny tree satisfying the infinite sites assumption (ISA). However, the limitations of SCS technologies including frequent allele dropout and variable sequence coverage may prohibit a perfect phylogeny. In addition, ISA violations are commonly observed in tumor phylogenies due to the loss of heterozygosity, deletions, and convergent evolution. In order to address such limitations, we introduce the optimal subperfect phylogeny problem which asks to integrate SCS data with matching bulk sequencing data by minimizing a linear combination of potential false negatives (due to allele dropout or variance in sequence coverage), false positives (due to read errors) among mutation calls, and the number of mutations that violate ISA (real or because of incorrect copy number estimation). We then describe a combinatorial formulation to solve this problem which ensures that several lineage constraints imposed by the use of variant allele frequencies (VAFs, derived from bulk sequence data) are satisfied. We express our formulation both in the form of an integer linear program (ILP) and -as a first in tumor phylogeny reconstruction-a Boolean constraint satisfaction problem (CSP) and solve them by leveraging state-of-the-art ILP/CSP solvers. The resulting method, which we name PhISCS, is the first to integrate SCS and bulk sequencing data while accounting for ISA violating mutations. In contrast to the alternative methods, typically based on probabilistic approaches, PhISCS provides a guarantee of optimality in reported solutions. Using simulated and real data sets, we demonstrate that PhISCS is more general and accurate than all available approaches.",
                "authors": [
                    {
                        "name": "Malikic S."
                    },
                    {
                        "name": "Mehrabadi F.R."
                    },
                    {
                        "name": "Ciccolella S."
                    },
                    {
                        "name": "Rahman M.K."
                    },
                    {
                        "name": "Ricketts C."
                    },
                    {
                        "name": "Haghshenas E."
                    },
                    {
                        "name": "Seidman D."
                    },
                    {
                        "name": "Hach F."
                    },
                    {
                        "name": "Hajirasouliha I."
                    },
                    {
                        "name": "Sahinalp S.C."
                    }
                ],
                "citationCount": 17,
                "date": "2019-01-01T00:00:00Z",
                "journal": "Genome Research",
                "title": "PhISCS: A combinatorial approach for subperfect tumor phylogeny reconstruction via integrative use of single-cell and bulk sequencing data"
            },
            "pmcid": "PMC6836735",
            "pmid": "31628256"
        }
    ],
    "topic": [
        {
            "term": "Phylogeny",
            "uri": "http://edamontology.org/topic_0084"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        }
    ],
    "validated": 1
}