{
    "additionDate": "2020-01-09T17:49:02Z",
    "biotoolsCURIE": "biotools:smarts-server",
    "biotoolsID": "smarts-server",
    "confidence_flag": "tool",
    "description": "SMARTS is a social media-based addiction recovery and intervention targeting server.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "http://haddock9.sfsu.edu/",
    "lastUpdate": "2021-01-16T13:58:59Z",
    "name": "SMARTS",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ800",
            "metadata": {
                "abstract": "© The Author(s) 2019. Published by Oxford University Press. All rights reserved.Motivation: Substance abuse and addiction is a significant contemporary health crisis. Modeling its epidemiology and designing effective interventions requires real-time data analysis along with the means to contextualize addiction patterns across the individual-to-community scale. In this context, social media platforms have begun to receive significant attention as a novel source of real-time user-reported information. However, the ability of epidemiologists to use such information is significantly stymied by the lack of publicly available algorithms and software for addiction information extraction, analysis and modeling. Results: SMARTS is a public, open source, web-based application that addresses the aforementioned deficiency. SMARTS is designed to analyze data from two popular social media forums, namely, Reddit and Twitter and can be used to study the effect of various intoxicants including, opioids, weed, kratom, alcohol and cigarettes. The SMARTS software analyzes social media posts using natural language processing, and machine learning to characterize drug use at both the individual- and population-levels. Included in SMARTS is a predictive modeling functionality that can, with high accuracy, identify individuals open to addiction recovery interventions. SMARTS also supports extraction, analysis and visualization of a number of key informational and demographic characteristics including post topics and sentiment, drug- and recovery-term usage, geolocation and age. Finally, the distributions of the aforementioned characteristics as derived from a set of 170 097 drug users are provided as part of SMARTS and can be used by researchers as a reference.",
                "authors": [
                    {
                        "name": "Jha D."
                    },
                    {
                        "name": "Singh R."
                    }
                ],
                "citationCount": 1,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "SMARTS: The social media-based addiction recovery and intervention targeting server"
            },
            "pmid": "31647520"
        }
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Natural language processing",
            "uri": "http://edamontology.org/topic_0218"
        },
        {
            "term": "Public health and epidemiology",
            "uri": "http://edamontology.org/topic_3305"
        }
    ],
    "validated": 1
}
