{
    "additionDate": "2017-12-18T00:03:18Z",
    "biotoolsCURIE": "biotools:aracne",
    "biotoolsID": "aracne",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://wiki.c2b2.columbia.edu/califanolab/index.php/Main_Page"
        }
    ],
    "description": "ARACNE (Algorithm for the Reconstruction of Accurate Cellular Networks), a novel algorithm, using microarray expression profiles, specifically designed to scale up to the complexity of regulatory networks in mammalian cells, yet general enough to address a wider range of network deconvolution problems. This method uses an information theoretic approach to eliminate the vast majority of indirect interactions typically inferred by pairwise analysis.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://www.nature.com/nprot/journal/v1/n2/abs/nprot.2006.106.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Deconvolution",
                    "uri": "http://edamontology.org/operation_3629"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Analysis",
                    "uri": "http://edamontology.org/operation_2945"
                }
            ]
        }
    ],
    "homepage": "http://wiki.c2b2.columbia.edu/califanolab/index.php/Software/ARACNE?",
    "language": [
        "Java",
        "C++"
    ],
    "lastUpdate": "2018-12-10T12:58:57Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/aracne-2-reconstruction-accurate-cellular-networks.html"
        }
    ],
    "name": "ARACNE",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1186/1471-2105-7-S1-S7",
            "metadata": {
                "abstract": "Background: Elucidating gene regulatory networks is crucial for understanding normal cell physiology and complex pathologic phenotypes. Existing computational methods for the genomewide \"reverse engineering\" of such networks have been successful only for lower eukaryotes with simple genomes. Here we present ARACNE, a novel algorithm, using microarray expression profiles, specifically designed to scale up to the complexity of regulatory networks in mammalian cells, yet general enough to address a wider range of network deconvolution problems. This method uses an information theoretic approach to eliminate the majority of indirect interactions inferred by coexpression methods. Results: We prove that ARACNE reconstructs the network exactly (asymptotically) if the effect of loops in the network topology is negligible, and we show that the algorithm works well in practice, even in the presence of numerous loops and complex topologies. We assess ARACNE's ability to reconstruct transcriptional regulatory networks using both a realistic synthetic dataset and a microarray dataset from human B cells. On synthetic datasets ARACNE achieves very low error rates and outperforms established methods, such as Relevance Networks and Bayesian Networks. Application to the deconvolution of genetic networks in human B cells demonstrates ARACNE's ability to infer validated transcriptional targets of the cMYC proto-oncogene. We also study the effects of misestimation of mutual information on network reconstruction, and show that algorithms based on mutual information ranking are more resilient to estimation errors. Conclusion: ARACNE shows promise in identifying direct transcriptional interactions in mammalian cellular networks, a problem that has challenged existing reverse engineering algorithms. This approach should enhance our ability to use microarray data to elucidate functional mechanisms that underlie cellular processes and to identify molecular targets of pharmacological compounds in mammalian cellular networks.",
                "authors": [
                    {
                        "name": "Margolin A.A."
                    },
                    {
                        "name": "Nemenman I."
                    },
                    {
                        "name": "Basso K."
                    },
                    {
                        "name": "Wiggins C."
                    },
                    {
                        "name": "Stolovitzky G."
                    },
                    {
                        "name": "Favera R.D."
                    },
                    {
                        "name": "Califano A."
                    }
                ],
                "citationCount": 1587,
                "date": "2006-03-20T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "ARACNE: An algorithm for the reconstruction of gene regulatory networks in a mammalian cellular context"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Systems biology",
            "uri": "http://edamontology.org/topic_2259"
        },
        {
            "term": "Interactions",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ],
    "validated": 1,
    "version": [
        "2"
    ]
}