{
    "additionDate": "2019-11-14T18:27:48Z",
    "biotoolsCURIE": "biotools:AutoGridFR",
    "biotoolsID": "AutoGridFR",
    "confidence_flag": "tool",
    "description": "Improvements on AutoDock Affinity Maps and Associated Software Tools | Precomputed affinity maps are used by AutoDock to efficiently describe rigid biomolecules called receptors in automated docking. These maps greatly speed up the docking process and allow users to experiment with the forcefield. Here, we present AutoGridFR (AGFR): a software tool facilitating the calculation of these maps. We describe a new version of the AutoSite algorithm that improves the description of binding pockets automatically detected on receptors, and an algorithm for adding affinity gradients which help search methods optimize solution using fewer evaluations of the scoring functions. AGFR supports the calculation of maps for various advanced docking techniques such as covalent docking, hydrated docking, and docking with flexible receptor sidechains",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein-protein docking",
                    "uri": "http://edamontology.org/operation_3899"
                },
                {
                    "term": "Scaffolding",
                    "uri": "http://edamontology.org/operation_3216"
                },
                {
                    "term": "Protein-ligand docking",
                    "uri": "http://edamontology.org/operation_0482"
                }
            ]
        }
    ],
    "homepage": "http://adfr.scripps.edu/AutoDockFR/agfr.html",
    "lastUpdate": "2020-12-02T16:46:44.372453Z",
    "name": "AutoGridFR",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1002/JCC.26054",
            "metadata": {
                "abstract": "© 2019 Wiley Periodicals, Inc.Precomputed affinity maps are used by AutoDock to efficiently describe rigid biomolecules called receptors in automated docking. These maps greatly speed up the docking process and allow users to experiment with the forcefield. Here, we present AutoGridFR (AGFR): a software tool facilitating the calculation of these maps. We describe a new version of the AutoSite algorithm that improves the description of binding pockets automatically detected on receptors, and an algorithm for adding affinity gradients which help search methods optimize solution using fewer evaluations of the scoring functions. AGFR supports the calculation of maps for various advanced docking techniques such as covalent docking, hydrated docking, and docking with flexible receptor sidechains. Maps are stored in a single file along with metadata supporting data provenance, reproducibility, and facilitating their management. Finally, maps can be calculated from the command line or through a modern graphical user interface which also supports their visualization. © 2019 Wiley Periodicals, Inc.",
                "authors": [
                    {
                        "name": "Zhang Y."
                    },
                    {
                        "name": "Forli S."
                    },
                    {
                        "name": "Omelchenko A."
                    },
                    {
                        "name": "Sanner M.F."
                    }
                ],
                "citationCount": 3,
                "date": "2019-12-15T00:00:00Z",
                "journal": "Journal of Computational Chemistry",
                "title": "AutoGridFR: Improvements on AutoDock Affinity Maps and Associated Software Tools"
            },
            "pmid": "31436329"
        }
    ],
    "topic": [
        {
            "term": "Molecular modelling",
            "uri": "http://edamontology.org/topic_2275"
        },
        {
            "term": "Data submission, annotation and curation",
            "uri": "http://edamontology.org/topic_0219"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}