{
    "accessibility": "Open access",
    "additionDate": "2019-05-29T14:17:59Z",
    "biotoolsCURIE": "biotools:DHS.rates",
    "biotoolsID": "DHS.rates",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "mahmoud.elkasabi@icf.com",
            "name": "Mahmoud Elkasabi",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "R package calculating key indicators based on the Demographic and Health Survey data.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://cran.r-project.org/web/packages/DHS.rates/vignettes/DHS.rates.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "homepage": "https://cran.r-project.org/package=DHS.rates",
    "language": [
        "R"
    ],
    "lastUpdate": "2020-06-16T10:55:22Z",
    "license": "GPL-2.0",
    "maturity": "Mature",
    "name": "DHS.rates",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "Ruta",
    "publication": [
        {
            "doi": "10.1371/journal.pone.0216403",
            "metadata": {
                "abstract": "© 2019 Mahmoud Elkasabi. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.The Demographic and Health Surveys (DHS) are a major source for many demographic and health indicators in developing countries. Although these indicators are well defined in the literature, using survey data to calculate some of these indicators has never been an easy task for data users. This paper presents the DHS.rates software, a user-friendly R package developed to calculate fertility indicators, such as the total fertility rate, general fertility rate, and age-specific fertility rates, and childhood mortality indicators, such as the neonatal mortality rate, post-neonatal mortality rate, infant mortality rate, child mortality rate, and under-5 mortality rate, from the DHS data. The package allows for national and subnational indicators. In addition, the package calculates sampling error indicators such as standard error, design effect, relative standard error, and confidence interval for each demographic indicator. The package can also be used to calculate the same indicators from other population surveys such as the Multiple Indicator Cluster Survey (MICS).",
                "authors": [
                    {
                        "name": "Elkasabi M."
                    }
                ],
                "citationCount": 3,
                "date": "2019-05-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "Calculating fertility and childhood mortality rates from survey data using the DHS.rates R package"
            },
            "pmid": "31125337",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Paediatrics",
            "uri": "http://edamontology.org/topic_3418"
        },
        {
            "term": "Reproductive health",
            "uri": "http://edamontology.org/topic_3420"
        },
        {
            "term": "Geriatric medicine",
            "uri": "http://edamontology.org/topic_3399"
        }
    ],
    "validated": 1,
    "version": [
        "0.7.0"
    ]
}