{
    "additionDate": "2021-01-18T07:11:39Z",
    "biotoolsCURIE": "biotools:pso-locbact",
    "biotoolsID": "pso-locbact",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "chinae@biotec.or.th",
            "name": "Chinae Thammarongtham",
            "orcidid": "https://orcid.org/0000-0001-5834-4795",
            "typeEntity": "Person"
        }
    ],
    "description": "A Consensus Method for Optimizing Multiple Classifier Results for Predicting the Subcellular Localization of Bacterial Proteins.\n\nSeveral computational approaches for predicting subcellular localization have been developed and proposed. These approaches provide diverse performance because of their different combinations of protein features, training datasets, training strategies, and computational machine learning algorithms. In some cases, these tools may yield inconsistent and conflicting prediction results. It is important to consider such conflicting or contradictory predictions from multiple prediction programs during protein annotation, especially in the case of a multiclass classification problem such as subcellular localization",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein signal peptide detection",
                    "uri": "http://edamontology.org/operation_0418"
                },
                {
                    "term": "Subcellular localisation prediction",
                    "uri": "http://edamontology.org/operation_2489"
                },
                {
                    "term": "Transmembrane protein analysis",
                    "uri": "http://edamontology.org/operation_0270"
                }
            ]
        }
    ],
    "homepage": "http://ncrna-pred.com/psolocbact.htm",
    "lastUpdate": "2021-01-29T18:08:57Z",
    "name": "PSO-LocBact",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1155/2019/5617153",
            "metadata": {
                "abstract": "© 2019 Supatcha Lertampaiporn et al.Several computational approaches for predicting subcellular localization have been developed and proposed. These approaches provide diverse performance because of their different combinations of protein features, training datasets, training strategies, and computational machine learning algorithms. In some cases, these tools may yield inconsistent and conflicting prediction results. It is important to consider such conflicting or contradictory predictions from multiple prediction programs during protein annotation, especially in the case of a multiclass classification problem such as subcellular localization. Hence, to address this issue, this work proposes the use of the particle swarm optimization (PSO) algorithm to combine the prediction outputs from multiple different subcellular localization predictors with the aim of integrating diverse prediction models to enhance the final predictions. Herein, we present PSO-LocBact, a consensus classifier based on PSO that can be used to combine the strengths of several preexisting protein localization predictors specially designed for bacteria. Our experimental results indicate that the proposed method can resolve inconsistency problems in subcellular localization prediction for both Gram-negative and Gram-positive bacterial proteins. The average accuracy achieved on each test dataset is over 98%, higher than that achieved with any individual predictor.",
                "authors": [
                    {
                        "name": "Chokesajjawatee N."
                    },
                    {
                        "name": "Lertampaiporn S."
                    },
                    {
                        "name": "Nuannimnoi S."
                    },
                    {
                        "name": "Thammarongtham C."
                    },
                    {
                        "name": "Visessanguan W."
                    },
                    {
                        "name": "Vorapreeda T."
                    }
                ],
                "citationCount": 3,
                "date": "2019-01-01T00:00:00Z",
                "journal": "BioMed Research International",
                "title": "PSO-LocBact: A Consensus Method for Optimizing Multiple Classifier Results for Predicting the Subcellular Localization of Bacterial Proteins"
            },
            "pmcid": "PMC6925685",
            "pmid": "31886228"
        }
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Membrane and lipoproteins",
            "uri": "http://edamontology.org/topic_0820"
        },
        {
            "term": "Protein targeting and localisation",
            "uri": "http://edamontology.org/topic_0140"
        }
    ]
}
