{
    "accessibility": "Open access",
    "additionDate": "2022-10-30T10:48:04.518260Z",
    "biotoolsCURIE": "biotools:crisprtracrrna",
    "biotoolsID": "crisprtracrrna",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "backofen@informatik.uni-freiburg.de",
            "name": "Rolf Backofen",
            "orcidid": "https://orcid.org/0000-0001-8231-3323",
            "typeEntity": "Person"
        },
        {
            "name": "Omer S Alkhnbashi",
            "typeEntity": "Person"
        }
    ],
    "description": "CRISPRtracrRNA: an end-to-end standalone bioinformatic tool for tracrRNA predictions. In order to robustly predict the new tracrRNA candidates, CRISPRtracrRNA combines different sources of evidence.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Loop modelling",
                    "uri": "http://edamontology.org/operation_0481"
                },
                {
                    "term": "Protein threading",
                    "uri": "http://edamontology.org/operation_0302"
                },
                {
                    "term": "Sequence alignment",
                    "uri": "http://edamontology.org/operation_0292"
                }
            ]
        }
    ],
    "homepage": "https://github.com/BackofenLab/CRISPRtracrRNA",
    "language": [
        "C",
        "Perl"
    ],
    "lastUpdate": "2024-11-24T15:25:05.378865Z",
    "license": "Not licensed",
    "name": "CRISPRtracrRNA",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btac466",
            "metadata": {
                "abstract": "Motivation: The CRISPR-Cas9 system is a Type II CRISPR system that has rapidly become the most versatile and widespread tool for genome engineering. It consists of two components, the Cas9 effector protein, and a single guide RNA that combines the spacer (for identifying the target) with the tracrRNA, a trans-activating small RNA required for both crRNA maturation and interference. While there are well-established methods for screening Cas effector proteins and CRISPR arrays, the detection of tracrRNA remains the bottleneck in detecting Class 2 CRISPR systems. Results: We introduce a new pipeline CRISPRtracrRNA for screening and evaluation of tracrRNA candidates in genomes. This pipeline combines evidence from different components of the Cas9-sgRNA complex. The core is a newly developed structural model via covariance models from a sequence-structure alignment of experimentally validated tracrRNAs. As additional evidence, we determine the terminator signal (required for the tracrRNA transcription) and the RNA–RNA interaction between the CRISPR array repeat and the 50-part of the tracrRNA. Repeats are detected via an ML-based approach (CRISPRidenify). Providing further evidence, we detect the cassette containing the Cas9 (Type II CRISPR systems) and Cas12 (Type V CRISPR systems) effector protein. Our tool is the first for detecting tracrRNA for Type V systems. Availability and implementation: The implementation of the CRISPRtracrRNA is available on GitHub upon requesting the access permission, (https://github.com/BackofenLab/CRISPRtracrRNA). Data generated in this study can be obtained upon request to the corresponding person: Rolf Backofen (backofen@informatik.uni-freiburg.de).",
                "authors": [
                    {
                        "name": "Alkhnbashi O.S."
                    },
                    {
                        "name": "Backofen R."
                    },
                    {
                        "name": "Hess W.R."
                    },
                    {
                        "name": "Mitrofanov A."
                    },
                    {
                        "name": "Ziemann M."
                    }
                ],
                "citationCount": 6,
                "date": "2022-09-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "CRISPRtracrRNA: robust approach for CRISPR tracrRNA detection"
            },
            "pmcid": "PMC9486595",
            "pmid": "36124799"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Genetic engineering",
            "uri": "http://edamontology.org/topic_3912"
        },
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ],
    "validated": 1
}
