
{
    "credit": [
        {
            "email": "chichinglee@mail.cgu.edu.tw",
            "name": "Support",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://cgts.cgu.edu.tw/vanno/Tutorial/"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Genetic variation",
                "uri": "http://edamontology.org/topic_0199"
            },
            {
                "term": "Data visualisation",
                "uri": "http://edamontology.org/topic_0092"
            },
            {
                "term": "Whole genome sequencing",
                "uri": "http://edamontology.org/topic_3673"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© 2014 WILEY PERIODICALS, INC. Next-generation sequencing (NGS) technologies have revolutionized the field of genetics and are trending toward clinical diagnostics. Exome and targeted sequencing in a disease context represent a major NGS clinical application, considering its utility and cost-effectiveness. With the ongoing discovery of disease-associated genes, various gene panels have been launched for both basic research and diagnostic tests. However, the fundamental inconsistencies among the diverse annotation sources, software packages, and data formats have complicated the subsequent analysis. To manage disease-associated NGS data, we developed Vanno, a Web-based application for in-depth analysis and rapid evaluation of disease-causative genome sequence alterations. Vanno integrates information from biomedical databases, functional predictions from available evaluation models, and mutation landscapes from TCGA cancer types. A highly integrated framework that incorporates filtering, sorting, clustering, and visual analytic modules is provided to facilitate exploration of oncogenomics datasets at different levels, such as gene, variant, protein domain, or three-dimensional structure. Such design is crucial for the extraction of knowledge from sequence alterations and translating biological insights into clinical applications. Taken together, Vanno supports almost all disease-associated gene tests and exome sequencing panels designed for NGS, providing a complete solution for targeted and exome sequencing analysis. Vanno is freely available at http://cgts.cgu.edu.tw/vanno.",
            "authors": [
                "Huang P.-J.",
                "Lee C.-C.",
                "Tan B.C.-M.",
                "Yeh Y.-M.",
                "Huang K.-Y.",
                "Gan R.-C.",
                "Chen T.-W.",
                "Lee C.-Y.",
                "Yang S.-T.",
                "Liao C.-S.",
                "Liu H.",
                "Tang P."
            ],
            "cit_count": 3,
            "doi": "10.1002/HUMU.22684",
            "journal": "Human Mutation",
            "pmid": "25196204",
            "title": "Vanno: A visualization-aided variant annotation tool",
            "year": "2015-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:vanno",
        "biotoolsID": "vanno",
        "description": "Visualization-aided variant annotation tool.",
        "homepage": "http://cgts.cgu.edu.tw/vanno/",
        "name": "Vanno"
    }
}