{
    "additionDate": "2021-01-18T07:01:42Z",
    "biotoolsCURIE": "biotools:intellipatent",
    "biotoolsID": "intellipatent",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "yjtseng@csie.ntu.edu.tw",
            "name": "Yufeng Jane Tseng",
            "orcidid": "https://orcid.org/0000-0002-8461-6181",
            "typeEntity": "Person"
        }
    ],
    "description": "A web-based intelligent system for fast chemical patent claim drafting.\n\nThe first step of automating composition patent drafting is to draft the claims around a Markush structure with substituents. Currently, this process depends heavily on experienced attorneys or patent agents, and few tools are available. IntelliPatent was created to accelerate this process. Users can simply upload a series of analogs of interest, and IntelliPatent will automatically extract the general structural scaffold and generate the patent claim text. The program can also extend the patent claim by adding commonly seen R groups from historical lists of the top 30 selling drugs in the US for all R substituents. The program takes MDL SD file formats as inputs, and the invariable core structure and variable substructures will be identified as the initial scaffold and R groups in the output Markush structure",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Scaffolding",
                    "uri": "http://edamontology.org/operation_3216"
                }
            ]
        }
    ],
    "homepage": "https://intellipatent.cmdm.tw/",
    "lastUpdate": "2021-02-05T07:23:25Z",
    "name": "IntelliPatent",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1186/S13321-019-0401-4",
            "metadata": {
                "abstract": "© 2019 The Author(s).The first step of automating composition patent drafting is to draft the claims around a Markush structure with substituents. Currently, this process depends heavily on experienced attorneys or patent agents, and few tools are available. IntelliPatent was created to accelerate this process. Users can simply upload a series of analogs of interest, and IntelliPatent will automatically extract the general structural scaffold and generate the patent claim text. The program can also extend the patent claim by adding commonly seen R groups from historical lists of the top 30 selling drugs in the US for all R substituents. The program takes MDL SD file formats as inputs, and the invariable core structure and variable substructures will be identified as the initial scaffold and R groups in the output Markush structure. The results can be downloaded in MS Word format (.docx). The suggested claims can be quickly generated with IntelliPatent. This web-based tool is freely accessible at https://intellipatent.cmdm.tw/.",
                "authors": [
                    {
                        "name": "Wang P.-H."
                    },
                    {
                        "name": "Tseng Y.J."
                    }
                ],
                "date": "2019-12-11T00:00:00Z",
                "journal": "Journal of Cheminformatics",
                "title": "IntelliPatent: A web-based intelligent system for fast chemical patent claim drafting"
            },
            "pmcid": "PMC6907166"
        }
    ],
    "toolType": [
        "Web service"
    ],
    "topic": [
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Compound libraries and screening",
            "uri": "http://edamontology.org/topic_3343"
        }
    ]
}