{
    "additionDate": "2019-11-14T19:34:40Z",
    "biotoolsCURIE": "biotools:pNovo_3",
    "biotoolsID": "pNovo_3",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "chihao@ict.ac.cn",
            "name": "Hao Chi",
            "typeEntity": "Person"
        },
        {
            "email": "smhe@ict.ac.cn",
            "name": "Si-Min He",
            "typeEntity": "Person"
        }
    ],
    "description": "pNovo 3 is a precise de novo peptide sequencing using a learning-to-rank framework.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Peptide database search",
                    "uri": "http://edamontology.org/operation_3646"
                },
                {
                    "term": "Polymorphism detection",
                    "uri": "http://edamontology.org/operation_3202"
                },
                {
                    "term": "de Novo sequencing",
                    "uri": "http://edamontology.org/operation_3644"
                }
            ]
        }
    ],
    "homepage": "http://pfind.ict.ac.cn/software/pNovo/index.html",
    "lastUpdate": "2021-01-17T19:38:59Z",
    "name": "pNovo 3",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ366",
            "metadata": {
                "abstract": "© 2019 The Author(s) 2019. Published by Oxford University Press.Motivation: De novo peptide sequencing based on tandem mass spectrometry data is the key technology of shotgun proteomics for identifying peptides without any database and assembling unknown proteins. However, owing to the low ion coverage in tandem mass spectra, the order of certain consecutive amino acids cannot be determined if all of their supporting fragment ions are missing, which results in the low precision of de novo sequencing. Results: In order to solve this problem, we developed pNovo 3, which used a learning-to-rank framework to distinguish similar peptide candidates for each spectrum. Three metrics for measuring the similarity between each experimental spectrum and its corresponding theoretical spectrum were used as important features, in which the theoretical spectra can be precisely predicted by the pDeep algorithm using deep learning. On seven benchmark datasets from six diverse species, pNovo 3 recalled 29-102% more correct spectra, and the precision was 11-89% higher than three other state-of-the-art de novo sequencing algorithms. Furthermore, compared with the newly developed DeepNovo, which also used the deep learning approach, pNovo 3 still identified 21-50% more spectra on the nine datasets used in the study of DeepNovo. In summary, the deep learning and learning-to-rank techniques implemented in pNovo 3 significantly improve the precision of de novo sequencing, and such machine learning framework is worth extending to other related research fields to distinguish the similar sequences.",
                "authors": [
                    {
                        "name": "Chi H."
                    },
                    {
                        "name": "He S.-M."
                    },
                    {
                        "name": "Yang H."
                    },
                    {
                        "name": "Zeng W.-F."
                    },
                    {
                        "name": "Zhou W.-J."
                    }
                ],
                "citationCount": 17,
                "date": "2019-07-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "PNovo 3: Precise de novo peptide sequencing using a learning-to-rank framework"
            },
            "pmcid": "PMC6612832",
            "pmid": "31510687"
        }
    ],
    "topic": [
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Whole genome sequencing",
            "uri": "http://edamontology.org/topic_3673"
        }
    ],
    "validated": 1
}
