{
    "additionDate": "2020-01-14T19:58:06Z",
    "biotoolsCURIE": "biotools:NeurodisM",
    "biotoolsID": "NeurodisM",
    "confidence_flag": "medium",
    "credit": [
        {
            "name": "Mengling Qi",
            "typeEntity": "Person"
        },
        {
            "name": "Shichao Fan",
            "typeEntity": "Person"
        },
        {
            "name": "Zhi Wang",
            "typeEntity": "Person"
        },
        {
            "email": "zhaohy8@mail.sysu.edu.cn",
            "name": "Huiying Zhao",
            "typeEntity": "Person"
        }
    ],
    "description": "Identifying Common Genes, Cell Types and Brain Regions Between Diseases of the Nervous System.\n\nBackground: Diseases of the nervous system are widely considered to be caused by genetic mutations, and they have been shown to share pathogenic genes. Discovering the shared mechanisms of these diseases is useful for designing common treatments. Method: In this study, by reviewing 518 articles published after 2007 on 20 diseases of the nervous system, we compiled data on 1607 mutations occurring in 365 genes, totals that are 1.9 and 3.2 times larger than those collected in the Clinvar database, respectively. A combination with the Clinvar data gives 2434 pathogenic mutations and 424 genes. Using this information, we measured the genetic similarities between the diseases according to the number of genes causing two diseases simultaneously. Further detection was carried out on the similarity between diseases in terms of cell types.\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'Clinvar', 'DMN'",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                }
            ]
        }
    ],
    "homepage": "http://biomed-ai.org/neurodism",
    "lastUpdate": "2020-01-14T19:58:06Z",
    "name": "NeurodisM",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.3389/FGENE.2019.01202",
            "metadata": {
                "abstract": "© Copyright © 2019 Qi, Fan, Wang, Yang, Xie, Chen, Zhang, Lin, Liu, Lin, Yan, Yang and Zhao.Background: Diseases of the nervous system are widely considered to be caused by genetic mutations, and they have been shown to share pathogenic genes. Discovering the shared mechanisms of these diseases is useful for designing common treatments. Method: In this study, by reviewing 518 articles published after 2007 on 20 diseases of the nervous system, we compiled data on 1607 mutations occurring in 365 genes, totals that are 1.9 and 3.2 times larger than those collected in the Clinvar database, respectively. A combination with the Clinvar data gives 2434 pathogenic mutations and 424 genes. Using this information, we measured the genetic similarities between the diseases according to the number of genes causing two diseases simultaneously. Further detection was carried out on the similarity between diseases in terms of cell types. Disease-related cell types were defined as those with disease-related gene enrichment among the marker genes of cells, as ascertained by analyzing single-cell sequencing data. Enrichment profiles of the disease-related genes over 25 cell types were constructed. The disease similarity in terms of cell types was obtained by calculating the distances between the enrichment profiles of these genes. The same strategy was applied to measure the disease similarity in terms of brain regions by analyzing the gene expression data from 10 brain regions. Results: The disease similarity was first measured in terms of genes. The result indicated that the proportions of overlapped genes between diseases were significantly correlated to the DMN scores (phenotypic similarity), with a Pearson correlation coefficient of 0.40 and P-value = 6.0×10-3. The disease similarity analysis for cell types identified that the distances between enrichment profiles of the disease-related genes were negatively correlated to the DMN scores, with Spearman correlation coefficient = -0.26 (P-value = 1.5 × 10-2). However, the brain region enrichment profile distances of the disease-related genes were not significantly correlated with the DMN score. Besides the similarity of diseases, this study identified novel relationships between diseases and cell types. Conclusion: We manually constructed the most comprehensive dataset to date for genes with mutations related to 20 nervous system diseases. By using this dataset, the similarities between diseases in terms of genes and cell types were found to be significantly correlated to their phenotypic similarity. However, the disease similarities in terms of brain regions were not significantly correlated with the phenotypic similarities. Thus, the phenotypic similarity between the diseases is more likely to be caused by dysfunctions of the same genes or the same types of neurons rather than the same brain regions. The data are collected into the database NeurodisM, which is available at http://biomed-ai.org/neurodism.",
                "authors": [
                    {
                        "name": "Qi M."
                    },
                    {
                        "name": "Fan S."
                    },
                    {
                        "name": "Wang Z."
                    },
                    {
                        "name": "Yang X."
                    },
                    {
                        "name": "Xie Z."
                    },
                    {
                        "name": "Chen K."
                    },
                    {
                        "name": "Zhang L."
                    },
                    {
                        "name": "Lin T."
                    },
                    {
                        "name": "Liu W."
                    },
                    {
                        "name": "Lin X."
                    },
                    {
                        "name": "Yan Y."
                    },
                    {
                        "name": "Yang Y."
                    },
                    {
                        "name": "Zhao H."
                    }
                ],
                "date": "2019-11-29T00:00:00Z",
                "journal": "Frontiers in Genetics",
                "title": "Identifying Common Genes, Cell Types and Brain Regions Between Diseases of the Nervous System"
            },
            "pmcid": "PMC6895906",
            "pmid": "31850066"
        }
    ],
    "topic": [
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        },
        {
            "term": "Neurobiology",
            "uri": "http://edamontology.org/topic_3304"
        }
    ]
}