{
    "additionDate": "2019-11-14T19:46:28Z",
    "biotoolsCURIE": "biotools:DIFFUSE",
    "biotoolsID": "DIFFUSE",
    "confidence_flag": "high",
    "credit": [
        {
            "email": "jiang@cs.ucr.edu",
            "name": "Tao Jiang",
            "orcidid": "https://orcid.org/0000-0003-3833-4498",
            "typeEntity": "Person"
        }
    ],
    "description": "predicting isoform functions from sequences and expression profiles via deep learning | Deep learning based prediction of IsoForm FUnctions from Sequences and Expression | DIFFUSE is a deep learning based method for predicting isoform functions by integrating the data of isoform sequences, domains and expression profiles. This is an instruction of predicting isoform functions using DIFFUSE",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Splice transcript prediction",
                    "uri": "http://edamontology.org/operation_0264"
                },
                {
                    "term": "Read binning",
                    "uri": "http://edamontology.org/operation_3798"
                },
                {
                    "term": "Weighted correlation network analysis",
                    "uri": "http://edamontology.org/operation_3766"
                }
            ]
        }
    ],
    "homepage": "https://github.com/haochenucr/DIFFUSE",
    "language": [
        "Python"
    ],
    "lastUpdate": "2019-11-14T19:46:28Z",
    "license": "MIT",
    "name": "DIFFUSE",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ367",
            "metadata": {
                "abstract": "© The Author(s) 2019. Published by Oxford University Press.Motivation: Alternative splicing generates multiple isoforms from a single gene, greatly increasing the functional diversity of a genome. Although gene functions have been well studied, little is known about the specific functions of isoforms, making accurate prediction of isoform functions highly desirable. However, the existing approaches to predicting isoform functions are far from satisfactory due to at least two reasons: (i) unlike genes, isoform-level functional annotations are scarce. (ii) The information of isoform functions is concealed in various types of data including isoform sequences, co-expression relationship among isoforms, etc. Results: In this study, we present a novel approach, DIFFUSE (Deep learning-based prediction of IsoForm FUnctions from Sequences and Expression), to predict isoform functions. To integrate various types of data, our approach adopts a hybrid framework by first using a deep neural network (DNN) to predict the functions of isoforms from their genomic sequences and then refining the prediction using a conditional random field (CRF) based on co-expression relationship. To overcome the lack of isoform-level ground truth labels, we further propose an iterative semi-supervised learning algorithm to train both the DNN and CRF together. Our extensive computational experiments demonstrate that DIFFUSE could effectively predict the functions of isoforms and genes. It achieves an average area under the receiver operating characteristics curve of 0.840 and area under the precision-recall curve of 0.581 over 4184 GO functional categories, which are significantly higher than the state-of-the-art methods. We further validate the prediction results by analyzing the correlation between functional similarity, sequence similarity, expression similarity and structural similarity, as well as the consistency between the predicted functions and some well-studied functional features of isoform sequences.",
                "authors": [
                    {
                        "name": "Chen H."
                    },
                    {
                        "name": "Shaw D."
                    },
                    {
                        "name": "Zeng J."
                    },
                    {
                        "name": "Bu D."
                    },
                    {
                        "name": "Jiang T."
                    }
                ],
                "citationCount": 1,
                "date": "2019-07-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "DIFFUSE: Predicting isoform functions from sequences and expression profiles via deep learning"
            },
            "pmcid": "PMC6612874",
            "pmid": "31510699"
        }
    ],
    "topic": [
        {
            "term": "RNA splicing",
            "uri": "http://edamontology.org/topic_3320"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        }
    ]
}