{"collectionID": [], "accessibility": [], "topic": [{"term": "Cheminformatics", "uri": "http://edamontology.org/topic_2258"}, {"term": "Biochemistry", "uri": "http://edamontology.org/topic_3292"}, {"term": "Structure prediction", "uri": "http://edamontology.org/topic_0082"}], "owner": "mbs_import", "cost": null, "relation": [], "download": [], "validated": 1, "publication": [{"doi": null, "note": null, "version": null, "pmid": "23330685", "type": null, "pmcid": null, "metadata": {"title": "BioSM: Metabolomics tool for identifying endogenous mammalian biochemical structures in chemical structure space", "abstract": "The structural identification of unknown biochemical compounds in complex biofluids continues to be a major challenge in metabolomics research. Using LC/MS, there are currently two major options for solving this problem: searching small biochemical databases, which often do not contain the unknown of interest or searching large chemical databases which include large numbers of nonbiochemical compounds. Searching larger chemical databases (larger chemical space) increases the odds of identifying an unknown biochemical compound, but only if nonbiochemical structures can be eliminated from consideration. In this paper we present BioSM; a cheminformatics tool that uses known endogenous mammalian biochemical compounds (as scaffolds) and graph matching methods to identify endogenous mammalian biochemical structures in chemical structure space. The results of a comprehensive set of empirical experiments suggest that BioSM identifies endogenous mammalian biochemical structures with high accuracy. In a leave-one-out cross validation experiment, BioSM correctly predicted 95% of 1388 Kyoto Encyclopedia of Genes and Genomes (KEGG) compounds as endogenous mammalian biochemicals using 1565 scaffolds. Analysis of two additional biological data sets containing 2330 human metabolites (HMDB) and 2416 plant secondary metabolites (KEGG) resulted in biochemical annotations of 89% and 72% of the compounds, respectively. When a data set of 3895 drugs (DrugBank and USAN) was tested, 48% of these structures were predicted to be biochemical. However, when a set of synthetic chemical compounds (Chembridge and Chemsynthesis databases) were examined, only 29% of the 458 207 structures were predicted to be biochemical. Moreover, BioSM predicted that 34% of 883 199 randomly selected compounds from PubChem were biochemical. We then expanded the scaffold list to 3927 biochemical compounds and reevaluated the above data sets to determine whether scaffold number influenced model performance. Although there were significant improvements in model sensitivity and specificity using the larger scaffold list, the data set comparison results were very similar. These results suggest that additional biochemical scaffolds will not further improve our representation of biochemical structure space and that the model is reasonably robust. BioSM provides a qualitative (yes/no) and quantitative (ranking) method for endogenous mammalian biochemical annotation of chemical space and, thus, will be useful in the identification of unknown biochemical structures in metabolomics. BioSM is freely available at http://metabolomics. pharm.uconn.edu. © 2013 American Chemical Society.", "citationCount": 14, "authors": [{"name": "Hamdalla M.A."}, {"name": "Mandoiu I.I."}, {"name": "Hill D.W."}, {"name": "Rajasekaran S."}, {"name": "Grant D.F."}], "date": "2013-03-25T00:00:00Z", "journal": "Journal of Chemical Information and Modeling"}}], "homepage_status": 1, "credit": [{"typeRole": ["Primary contact"], "name": null, "url": "http://metabolomics.pharm.uconn.edu/?q=contact", "gridid": null, "note": null, "orcidid": null, "typeEntity": "Person", "email": null}], "biotoolsCURIE": "biotools:biosm", "elixirPlatform": [], "elixirNode": [], "version": [], "elixir_badge": 0, "homepage": "http://metabolomics.pharm.uconn.edu/?q=Software.html", "function": [{"note": null, "input": [], "operation": [{"term": "Structure comparison", "uri": "http://edamontology.org/operation_2483"}], "cmd": null, "output": []}], "lastUpdate": "2018-12-10T12:58:57Z", "otherID": [], "description": "Cheminformatics tool that uses known mammalian biochemical compounds (scaffolds) and graph matching methods to identify biochemical structures in chemical structure space.", "toolType": ["Command-line tool"], "editPermission": {"type": "private", "authors": []}, "language": ["Java"], "link": [{"url": "http://www.mybiosoftware.com/biosm-1-00-identify-biochemical-structures-in-chemical-structure-space.html", "note": null, "type": "Software catalogue"}], "biotoolsID": "biosm", "additionDate": "2017-08-03T18:37:39Z", "name": "BioSM", "license": null, "documentation": [{"url": "http://metabolomics.pharm.uconn.edu/sites/default/files/BioSM%20User%20Guide.pdf", "note": null, "type": "User manual"}], "maturity": null, "confidence_flag": null, "operatingSystem": ["Linux", "Windows", "Mac"]}