{
    "additionDate": "2017-03-27T08:35:11Z",
    "biotoolsCURIE": "biotools:phylomedb_v3.0",
    "biotoolsID": "phylomedb_v3.0",
    "credit": [
        {
            "email": "tgabaldon@crg.es",
            "name": "T. Gabaldon",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "It is a public database for genome-wide collections of gene phylogenies (phylomes). It is also a major source for phylogeny-based orthology and paralogy predictions. For each protein-coding gene in a seed genome, the database provides original and processed alignments, phylogenetic trees derived from various methods and phylogeny-based predictions of orthology and paralogy relationships.",
    "documentation": [
        {
            "type": "API documentation",
            "url": "http://phylomedb.org/web_api"
        }
    ],
    "editPermission": {
        "authors": [
            "vsundesha"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Tree-based sequence alignment",
                    "uri": "http://edamontology.org/operation_0499"
                },
                {
                    "term": "Gene prediction",
                    "uri": "http://edamontology.org/operation_2454"
                },
                {
                    "term": "Phylogenetic tree reconstruction",
                    "uri": "http://edamontology.org/operation_3478"
                },
                {
                    "term": "Phylogenetic species tree construction",
                    "uri": "http://edamontology.org/operation_0544"
                }
            ]
        }
    ],
    "homepage": "http://phylomeDB.org",
    "lastUpdate": "2020-01-24T19:08:08Z",
    "name": "PhylomeDB v3.0",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "vsundesha",
    "publication": [
        {
            "metadata": {
                "abstract": "The growing availability of complete genomic sequences from diverse species has brought about the need to scale up phylogenomic analyses, including the reconstruction of large collections of phylogenetic trees. Here, we present the third version of PhylomeDB (http://phylomeDB.org), a public database for genome-wide collections of gene phylogenies (phylomes). Currently, PhylomeDB is the largest phylogenetic repository and hosts 17 phylomes, comprising 416 093 trees and 165 840 alignments. It is also a major source for phylogeny-based orthology and paralogy predictions, covering about 5 million proteins in 717 fully-sequenced genomes. For each protein-coding gene in a seed genome, the database provides original and processed alignments, phylogenetic trees derived from various methods and phylogeny-based predictions of orthology and paralogy relationships. The new version of phylomeDB has been extended with novel data access and visualization features, including the possibility of programmatic access. Available seed species include model organisms such as human, yeast, Escherichia coli or Arabidopsis thaliana, but also alternative model species such as the human pathogen Candida albicans, or the pea aphid Acyrtosiphon pisum. Finally, PhylomeDB is currently being used by several genome sequencing projects that couple the genome annotation process with the reconstruction of the corresponding phylome, a strategy that provides relevant evolutionary insights. © The Author(s) 2010.",
                "authors": [
                    {
                        "name": "Huerta-Cepas J."
                    },
                    {
                        "name": "Capella-Gutierrez S."
                    },
                    {
                        "name": "Pryszcz L.P."
                    },
                    {
                        "name": "Denisov I."
                    },
                    {
                        "name": "Kormes D."
                    },
                    {
                        "name": "Marcet-Houben M."
                    },
                    {
                        "name": "Gabaldon T."
                    }
                ],
                "citationCount": 100,
                "date": "2011-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "PhylomeDB v3.0: An expanding repository of genome-wide collections of trees, alignments and phylogeny-based orthology and paralogy predictions"
            },
            "pmid": "21075798"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Phylogeny",
            "uri": "http://edamontology.org/topic_0084"
        },
        {
            "term": "Phylogenomics",
            "uri": "http://edamontology.org/topic_0194"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        }
    ],
    "validated": 1
}