{
    "accessibility": "Open access",
    "additionDate": "2022-03-29T11:16:37.817109Z",
    "biotoolsCURIE": "biotools:rmisbeta",
    "biotoolsID": "rmisbeta",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "mollah.stat.bio@ru.ac.bd",
            "name": "Nurul Haque Mollah"
        },
        {
            "email": "shahjaman_brur@yahoo.com",
            "name": "Shahjaman"
        },
        {
            "name": "Rabiul Auwul",
            "orcidid": "https://orcid.org/0000-0003-2505-5422"
        }
    ],
    "description": "A robust missing value imputation approach in transcriptomics and metabolomics data.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://cran.r-project.org/web/packages/rMisbeta/rMisbeta.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Imputation",
                    "uri": "http://edamontology.org/operation_3557"
                }
            ]
        }
    ],
    "homepage": "https://CRAN.R-project.org/package=rMisbeta",
    "language": [
        "R"
    ],
    "lastUpdate": "2022-03-29T11:16:37.819911Z",
    "license": "GPL-3.0",
    "name": "rMisbeta",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1016/J.COMPBIOMED.2021.104911",
            "metadata": {
                "abstract": "© 2021 Elsevier LtdTranscriptomics and metabolomics data often contain missing values or outliers due to limitations of the data acquisition techniques. Most of the statistical methods require complete datasets for downstream analysis. A number of methods have been developed for missing value imputation using the classical mean and variance based on maximum likelihood estimators, which are not robust against outliers. Consequently, the performance of these methods deteriorates in the presence of outliers. Hence precise imputation of missing values and outliers handling are both concurrently important. Therefore, in this paper, we developed a robust iterative approach using robust estimators based on the minimum beta divergence method, which simultaneously impute missing values and outliers. We investigate the performance of the proposed method in a comparison with six frequently used missing value imputation methods such as Zero, KNN, robust SVD, EM, random forest (RF) and weighted least square approach (WLSA) through feature selection using both simulated and real datasets. Ten performance indices were used to explore the optimal method such as Frobenius norm (FOBN), accuracy (ACC), sensitivity (SN), specificity (SP), positive predictive value (PPV), negative predictive value (NPV), detection rate (DR), misclassification error rate (MER), the area under the ROC curve (AUC) and computational runtime. Evaluation based on both simulated and real data suggests the superiority of the proposed method over the other traditional methods in terms of various rates of outliers and missing values. The suggested approach also keeps almost equal performance in absence of outliers with the other methods. The proposed method is accurate, simple, and consumes lower computational time compared to the other methods. Therefore, our recommendation is to apply the proposed procedure for large-scale transcriptomics and metabolomics data analysis. The computational tool has been implemented in an R package, which is publicly available from https://CRAN.R-project.org/package=rMisbeta.",
                "authors": [
                    {
                        "name": "Auwul M.R."
                    },
                    {
                        "name": "Islam T."
                    },
                    {
                        "name": "Mollah M.N.H."
                    },
                    {
                        "name": "Moni M.A."
                    },
                    {
                        "name": "Rahman M.R."
                    },
                    {
                        "name": "Shahjaman M."
                    }
                ],
                "citationCount": 2,
                "date": "2021-11-01T00:00:00Z",
                "journal": "Computers in Biology and Medicine",
                "title": "rMisbeta: A robust missing value imputation approach in transcriptomics and metabolomics data"
            },
            "pmid": "34634637"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Data acquisition",
            "uri": "http://edamontology.org/topic_3077"
        },
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ],
    "validated": 1
}
