{
    "additionDate": "2021-01-18T10:43:59Z",
    "biotoolsCURIE": "biotools:meirlop",
    "biotoolsID": "meirlop",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "cbenner@ucsd.edu",
            "name": "Christopher Benner",
            "orcidid": "https://orcid.org/0000-0002-4618-0719",
            "typeEntity": "Person"
        }
    ],
    "description": "Improving score-based motif enrichment by incorporating sequence bias covariates.\n\nMotif Enrichment In Ranked Lists Of Peaks.\n\nThis project analyzes the relative enrichment of transcription factor binding motifs found in peaks at the top or bottom of a given ranking/score. It does this by calculating motif enrichment using a logistic regression model that describes the likelihood of a motif being present in sequences with higher/lower scores, while accounting for the effect of multiple covariates. The design is based on MOODS and statsmodels.\n\nTo get started using MEIRLOP, see our documentation, which gives you a quick idea of what goes into and out of MEIRLOP so you can use it for your own experiments. For a full usage example that downloads and generates all the data it needs on the fly, see our walkthrough, which recreates commands and output for the section \"MEIRLOP identifies enriched TF binding motifs in DNase I Hypersensitive Sites\" from the MEIRLOP manuscript.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Gene-set enrichment analysis",
                    "uri": "http://edamontology.org/operation_2436"
                },
                {
                    "term": "Peak calling",
                    "uri": "http://edamontology.org/operation_3222"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                },
                {
                    "term": "Sequence motif recognition",
                    "uri": "http://edamontology.org/operation_0239"
                }
            ]
        }
    ],
    "homepage": "https://github.com/npdeloss/meirlop",
    "lastUpdate": "2021-02-20T17:58:36Z",
    "license": "MIT",
    "name": "MEIRLOP",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1186/S12859-020-03739-4",
            "metadata": {
                "abstract": "© 2020 The Author(s).Background: Motif enrichment analysis (MEA) identifies over-represented transcription factor binding (TF) motifs in the DNA sequence of regulatory regions, enabling researchers to infer which transcription factors can regulate transcriptional response to a stimulus, or identify sequence features found near a target protein in a ChIP-seq experiment. Score-based MEA determines motifs enriched in regions exhibiting extreme differences in regulatory activity, but existing methods do not control for biases in GC content or dinucleotide composition. This lack of control for sequence bias, such as those often found in CpG islands, can obscure the enrichment of biologically relevant motifs. Results: We developed Motif Enrichment In Ranked Lists of Peaks (MEIRLOP), a novel MEA method that determines enrichment of TF binding motifs in a list of scored regulatory regions, while controlling for sequence bias. In this study, we compare MEIRLOP against other MEA methods in identifying binding motifs found enriched in differentially active regulatory regions after interferon-beta stimulus, finding that using logistic regression and covariates improves the ability to call enrichment of ISGF3 binding motifs from differential acetylation ChIP-seq data compared to other methods. Our method achieves similar or better performance compared to other methods when quantifying the enrichment of TF binding motifs from ENCODE TF ChIP-seq datasets. We also demonstrate how MEIRLOP is broadly applicable to the analysis of numerous types of NGS assays and experimental designs. Conclusions: Our results demonstrate the importance of controlling for sequence bias when accurately identifying enriched DNA sequence motifs using score-based MEA. MEIRLOP is available for download from https://github.com/npdeloss/meirlop under the MIT license.",
                "authors": [
                    {
                        "name": "Benner C."
                    },
                    {
                        "name": "Delos Santos N.P."
                    },
                    {
                        "name": "Texari L."
                    }
                ],
                "date": "2020-09-16T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "MEIRLOP: Improving score-based motif enrichment by incorporating sequence bias covariates"
            },
            "pmcid": "PMC7493370",
            "pmid": "32938397"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "ChIP-on-chip",
            "uri": "http://edamontology.org/topic_3179"
        },
        {
            "term": "ChIP-seq",
            "uri": "http://edamontology.org/topic_3169"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Protein sites, features and motifs",
            "uri": "http://edamontology.org/topic_3510"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ]
}
