
{
    "credit": [
        {
            "email": "jfk.lab@sickkids.ca",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://abragam.med.utoronto.ca/~JFKlab/"
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://abragam.med.utoronto.ca/~JFKlab/"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Protein structure prediction",
                    "uri": "http://edamontology.org/operation_0474"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Sequence analysis",
                "uri": "http://edamontology.org/topic_0080"
            },
            {
                "term": "Proteins",
                "uri": "http://edamontology.org/topic_0078"
            },
            {
                "term": "Structure prediction",
                "uri": "http://edamontology.org/topic_0082"
            },
            {
                "term": "Biochemistry",
                "uri": "http://edamontology.org/topic_3292"
            },
            {
                "term": "Molecular dynamics",
                "uri": "http://edamontology.org/topic_0176"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://www.mybiosoftware.com/ssp-secondary-structure-propensity.html"
        }
    ],
    "publication": [
        {
            "abstract": "The synucleins are a family of intrinsically disordered proteins involved in various human diseases. α-Synuclein has been extensively characterized due to its role in Parkinson's disease where it forms intracellular aggregates, while γ-synuclein is overexpressed in a majority of late-stage breast cancers. Despite fairly strong sequence similarity between the amyloid-forming regions of α- and γ-synuclein, γ-synuclein has only a weak propensity to form amyloid fibrils. We hypothesize that the different fibrillation tendencies of α- and γ-synuclein may be related to differences in structural propensities. Here we have measured chemical shifts for γ-synuclein and compared them to previously published shifts for α-synuclein. In order to facilitate direct comparison, we have implemented a simple new technique for re-referencing chemical shifts that we have found to be highly effective for both disordered and folded proteins. In addition, we have developed a new method that combines different chemical shifts into a single residue-specific secondary structure propensity (SSP) score. We observe significant differences between α- and γ-synuclein secondary structure propensities. Most interestingly, γ-synuclein has an increased α-helical propensity in the amyloid-forming region that is critical for α-synuclein fibrillation, suggesting that increased structural stability in this region may protect against γ-synuclein aggregation. This comparison of residue-specific secondary structure propensities between intrinsically disordered homologs highlights the sensitivity of transient structure to sequence changes, which we suggest may have been exploited as an evolutionary mechanism for fast modulation of protein structure and, hence, function. Published by Cold Spring Harbor Laboratory Press. Copyright © 2006 The Protein Society.",
            "authors": [
                "Marsh J.A.",
                "Singh V.K.",
                "Jia Z.",
                "Forman-Kay J.D."
            ],
            "cit_count": 403,
            "journal": "Protein Science",
            "pmid": "17088319",
            "title": "Sensitivity of secondary structure propensities to sequence differences between α- and γ-synuclein: Implications for fibrillation",
            "year": "2006-12-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:ssp-shift",
        "biotoolsID": "ssp-shift",
        "description": "An algorithm that combines chemical shifts from different nuclei into a score, which reflects the expected fraction of α- or β-structure.",
        "homepage": "http://abragam.med.utoronto.ca/~JFKlab/",
        "name": "SSP"
    }
}