{
    "additionDate": "2021-06-14T13:28:05Z",
    "biotoolsCURIE": "biotools:ac2",
    "biotoolsID": "ac2",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "teixeirasilva@ua.pt",
            "name": "Milton Silva",
            "orcidid": "https://orcid.org/0000-0002-7535-4933",
            "typeEntity": "Person"
        },
        {
            "email": "pratas@ua.pt",
            "name": "Diogo Pratas",
            "orcidid": "https://orcid.org/0000-0003-1176-552X",
            "typeEntity": "Person"
        },
        {
            "name": "Computational Biology Laboratory",
            "typeEntity": "Division",
            "url": "https://cobilab.github.io/"
        }
    ],
    "description": "AC2 is an efficient protein sequence compression tool using artificial neural networks and cache-hash models.",
    "download": [
        {
            "type": "Source code",
            "url": "https://github.com/cobilab/ac2/tree/master/benchmark"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein secondary structure prediction",
                    "uri": "http://edamontology.org/operation_0267"
                },
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                }
            ]
        }
    ],
    "homepage": "https://github.com/cobilab/ac2",
    "language": [
        "C",
        "C++"
    ],
    "lastUpdate": "2021-08-09T10:07:51.487994Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/cobilab/ac2/issues"
        }
    ],
    "name": "AC2",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.3390/E23050530",
            "metadata": {
                "abstract": "© 2021 by the authors. Licensee MDPI, Basel, Switzerland.Recently, the scientific community has witnessed a substantial increase in the generation of protein sequence data, triggering emergent challenges of increasing importance, namely efficient storage and improved data analysis. For both applications, data compression is a straightforward solution. However, in the literature, the number of specific protein sequence compressors is relatively low. Moreover, these specialized compressors marginally improve the compression ratio over the best general-purpose compressors. In this paper, we present AC2, a new lossless data compressor for protein (or amino acid) sequences. AC2 uses a neural network to mix experts with a stacked generalization approach and individual cache-hash memory models to the highest-context orders. Compared to the previous compressor (AC), we show gains of 2–9% and 6–7% in reference-free and reference-based modes, respectively. These gains come at the cost of three times slower computations. AC2 also improves memory usage against AC, with requirements about seven times lower, without being affected by the sequences’ input size. As an analysis application, we use AC2 to measure the similarity between each SARS-CoV-2 protein sequence with each viral protein sequence from the whole UniProt database. The results consistently show higher similarity to the pangolin coronavirus, followed by the bat and human coronaviruses, contributing with critical results to a current controversial subject. AC2 is available for free download under GPLv3 license.",
                "authors": [
                    {
                        "name": "Silva M."
                    },
                    {
                        "name": "Pratas D."
                    },
                    {
                        "name": "Pinho A.J."
                    }
                ],
                "date": "2021-01-01T00:00:00Z",
                "journal": "Entropy",
                "title": "Ac2: An efficient protein sequence compression tool using artificial neural networks and cache-hash models"
            },
            "pmcid": "PMC8146440",
            "pmid": "33925812"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        }
    ]
}