{
    "additionDate": "2017-03-30T22:04:18Z",
    "biotoolsCURIE": "biotools:polygenicpathways",
    "biotoolsID": "polygenicpathways",
    "credit": [
        {
            "email": "chris_car@yahoo.com",
            "name": "C.J. Carter",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "The datasets list genes, environmental risk factors and autoantibodies in a number of polygenic diseases and provide KEGG pathway analysis etched out by susceptibility genes. Host/pathogen interactions are also characterised for herpes simplex, helicobacter pylori and the HIV-1/AIDS virus.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://www.polygenicpathways.co.uk/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                },
                {
                    "term": "Gene prediction",
                    "uri": "http://edamontology.org/operation_2454"
                },
                {
                    "term": "Pathway or network analysis",
                    "uri": "http://edamontology.org/operation_2497"
                },
                {
                    "term": "Gene expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                },
                {
                    "term": "Virulence prediction",
                    "uri": "http://edamontology.org/operation_3461"
                }
            ]
        }
    ],
    "homepage": "http://www.polygenicpathways.co.uk",
    "lastUpdate": "2018-12-10T12:58:50Z",
    "name": "PolygenicPathways",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "Many genes implicated in schizophrenia can be related to glutamatergic transmission and neuroplasticity, oligodendrocyte function, and other families clearly related to neurobiology and schizophrenia phenotypes. Others appear rather to be involved in the life cycles of the pathogens implicated in the disease. For example, aspartylglucosaminidase (AGA), PLA2, SIAT8B, GALNT7, or B3GAT1 metabolize chemical ligands to which the influenza virus, herpes simplex, cytomegalovirus (CMV), rubella, or Toxoplasma gondii bind. The epidermal growth factor receptor (EGR/EGFR) is used by the CMV to gain entry to cells, and a CMV gene codes for an interleukin (IL-10) mimic that binds the host cognate receptor, IL10R. The fibroblast growth factor receptor (FGFR1) is used by herpes simplex. KPNA3 and RANBP5 control the nuclear import of the influenza virus. Disrupted in schizophrenia 1 (DISC1) controls the microtubule network that is used by viruses as a route to the nucleus, while DTNBP1, MUTED, and BLOC1S3 regulate endosomal to lysosomal routing that is also important in viral traffic. Neuregulin 1 activates ERBB receptors releasing a factor, EBP1, known to inhibit the influenza virus transcriptase. Other viral or bacterial components bind to genes or proteins encoded by CALR, FEZ1, FYN, HSPA1B, IL2, HTR2A, KPNA3, MED12, MED15, MICB, NQO2, PAX6, PIK3C3, RANBP5, or TP53, while the cerebral infectivity of the herpes simplex virus is modified by Apolipoprotein E (APOE). Genes encoding for proteins related to the innate immune response, including cytokine related (CCR5, CSF2RA, CSF2RB, IL1B, IL1RN, IL2, IL3, IL3RA, IL4, IL10, IL10RA, IL18RAP, lymphotoxin-alpha, tumor necrosis factor alpha [TNF]), human leukocyte antigen (HLA) antigens (HLA-A10, HLA-B, HLA-DRB1), and genes involved in antigen processing (angiotensin-converting enzyme and tripeptidyl peptidase 2) are all concerned with defense against invading pathogens. Human microRNAs (Hsa-mir-198 and Hsa-mir-206) are predicted to bind to influenza, rubella, or poliovirus genes. Certain genes associated with schizophrenia, including those also concerned with neurophysiology, are intimately related to the life cycles of the pathogens implicated in the disease. Several genes may affect pathogen virulence, while the pathogens in turn may affect genes and processes relevant to the neurophysiology of schizophrenia. For such genes, the strength of association in genetic studies is likely to be conditioned by the presence of the pathogen, which varies in different populations at different times, a factor that may explain the heterogeneity that plagues such studies. This scenario also suggests that drugs or vaccines designed to eliminate the pathogens that so clearly interact with schizophrenia susceptibility genes could have a dramatic effect on the incidence of the disease. © 2008 The Authors.",
                "authors": [
                    {
                        "name": "Carter C.J."
                    }
                ],
                "citationCount": 80,
                "date": "2009-11-01T00:00:00Z",
                "journal": "Schizophrenia Bulletin",
                "title": "Schizophrenia susceptibility genes directly implicated in the life cycles of pathogens: Cytomegalovirus, influenza, herpes simplex, rubella, and Toxoplasma gondii"
            },
            "pmid": "18552348"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Immunoproteins, genes and antigens",
            "uri": "http://edamontology.org/topic_2830"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Virology",
            "uri": "http://edamontology.org/topic_0781"
        }
    ],
    "validated": 1
}