{
    "additionDate": "2021-01-18T12:36:52Z",
    "biotoolsCURIE": "biotools:olbp",
    "biotoolsID": "olbp",
    "confidence_flag": "tool",
    "description": "Personal Fixations-Based Object Segmentation With Object Localization and Boundary Preservation.",
    "editPermission": {
        "type": "private"
    },
    "homepage": "https://github.com/MathLee/OLBPNet4PFOS",
    "lastUpdate": "2021-03-13T19:03:02Z",
    "name": "OLBP",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1109/TIP.2020.3044440",
            "metadata": {
                "abstract": "© 1992-2012 IEEE.As a natural way for human-computer interaction, fixation provides a promising solution for interactive image segmentation. In this paper, we focus on Personal Fixations-based Object Segmentation (PFOS) to address issues in previous studies, such as the lack of appropriate dataset and the ambiguity in fixations-based interaction. In particular, we first construct a new PFOS dataset by carefully collecting pixel-level binary annotation data over an existing fixation prediction dataset, such dataset is expected to greatly facilitate the study along the line. Then, considering characteristics of personal fixations, we propose a novel network based on Object Localization and Boundary Preservation (OLBP) to segment the gazed objects. Specifically, the OLBP network utilizes an Object Localization Module (OLM) to analyze personal fixations and locates the gazed objects based on the interpretation. Then, a Boundary Preservation Module (BPM) is designed to introduce additional boundary information to guard the completeness of the gazed objects. Moreover, OLBP is organized in the mixed bottom-up and top-down manner with multiple types of deep supervision. Extensive experiments on the constructed PFOS dataset show the superiority of the proposed OLBP network over 17 state-of-the-art methods, and demonstrate the effectiveness of the proposed OLM and BPM components. The constructed PFOS dataset and the proposed OLBP network are available at https://github.com/MathLee/OLBPNet4PFOS.",
                "authors": [
                    {
                        "name": "Li G."
                    },
                    {
                        "name": "Liu Z."
                    },
                    {
                        "name": "Shi R."
                    },
                    {
                        "name": "Hu Z."
                    },
                    {
                        "name": "Wei W."
                    },
                    {
                        "name": "Wu Y."
                    },
                    {
                        "name": "Huang M."
                    },
                    {
                        "name": "Ling H."
                    }
                ],
                "citationCount": 4,
                "date": "2021-01-01T00:00:00Z",
                "journal": "IEEE Transactions on Image Processing",
                "title": "Personal Fixations-Based Object Segmentation with Object Localization and Boundary Preservation"
            },
            "pmid": "33338017"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        }
    ]
}