{
    "accessibility": "Open access",
    "additionDate": "2023-02-12T15:25:34.027904Z",
    "biotoolsCURIE": "biotools:bluelight",
    "biotoolsID": "bluelight",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "chungyueh@ntunhs.edu.tw",
            "name": "Chung-Yueh Lien",
            "typeEntity": "Person"
        }
    ],
    "description": "Blue Light is a browser-based medical image viewer is primarily maintained by the Imaging Informatics Labs.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Image annotation",
                    "uri": "http://edamontology.org/operation_3553"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://github.com/cylab-tw/bluelight",
    "language": [
        "JavaScript"
    ],
    "lastUpdate": "2024-11-24T15:02:52.076392Z",
    "license": "MIT",
    "name": "BlueLight",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1007/s10278-022-00746-0",
            "metadata": {
                "abstract": "Recently, WebGL has been widely used in numerous web-based medical image viewers to present advanced imaging visualization. However, in the scenario of medical imaging, there are many challenges of computation time and memory consumption that limit the use of advanced image renderings, such as volume rendering and multiplanar reformation/reconstruction, in low-cost mobile devices. In this study, we propose a client-side rendering low-cost computation algorithm for common two- and three-dimensional medical imaging visualization implemented by pure JavaScript. Particularly, we used the functions of cascading style sheet transform and combinate with Digital Imaging and Communications in Medicine (DICOM)-related imaging to replace the application programming interface with high computation to reduce the computation time and save memory consumption while launching medical imaging interpretation on web browsers. The results show the proposed algorithm significantly reduced the consumption of central and graphics processing units on various web browsers. The proposed algorithm was implemented in an open-source web-based DICOM viewer BlueLight; the results show that it has sufficient rendering performance to display 3D medical images with DICOM-compliant annotations and has the ability to connect to image archive via DICOMweb as well.Keywords: WebGL, DICOMweb, Multiplanar reconstruction, Volume rendering, DICOM, JavaScript, Zero-footprint.",
                "authors": [
                    {
                        "name": "Chen T.-T."
                    },
                    {
                        "name": "Chu W.-C."
                    },
                    {
                        "name": "Lien C.-Y."
                    },
                    {
                        "name": "Sun Y.-C."
                    }
                ],
                "citationCount": 2,
                "date": "2023-04-01T00:00:00Z",
                "journal": "Journal of Digital Imaging",
                "title": "BlueLight: An Open Source DICOM Viewer Using Low-Cost Computation Algorithm Implemented with JavaScript Using Advanced Medical Imaging Visualization"
            },
            "pmcid": "PMC10039132",
            "pmid": "36538245"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        },
        {
            "term": "Medical informatics",
            "uri": "http://edamontology.org/topic_3063"
        },
        {
            "term": "Medicine",
            "uri": "http://edamontology.org/topic_3303"
        }
    ]
}
