
{
    "credit": [
        {
            "email": "foster.281@osu.edu",
            "name": "Mark P. Foster",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "https://research.cbc.osu.edu/foster.281/"
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "https://research.cbc.osu.edu/foster.281/software/#GUARDD"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Analysis",
                    "uri": "http://edamontology.org/operation_2945"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "MATLAB"
        ],
        "operatingSystem": [
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Desktop application"
        ],
        "topic": [
            {
                "term": "NMR",
                "uri": "http://edamontology.org/topic_0593"
            },
            {
                "term": "Molecular dynamics",
                "uri": "http://edamontology.org/topic_0176"
            },
            {
                "term": "Protein properties",
                "uri": "http://edamontology.org/topic_0123"
            },
            {
                "term": "Functional, regulatory and non-coding RNA",
                "uri": "http://edamontology.org/topic_0659"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/guardd-20110911-graphical-user-friendly-analysis-of-relaxation-dispersion-data.html"
        }
    ],
    "publication": [
        {
            "abstract": "Molecular dynamics are essential for life, and nuclear magnetic resonance (NMR) spectroscopy has been used extensively to characterize these phenomena since the 1950s. For the past 15 years, the Carr-Purcell Meiboom- Gill relaxation dispersion (CPMG RD) NMR experiment has afforded advanced NMR labs access to kinetic, thermodynamic, and structural details of protein and RNA dynamics in the crucial ls-ms time window. However, analysis of RD data is challenging because datasets are often large and require many non-linear fitting parameters, thereby confounding assessment of accuracy. Moreover, novice CPMG experimentalists face an additional barrier because current software options lack an intuitive user interface and extensive documentation. Hence, we present the open-source software package GUARDD (Graphical User-friendly Analysis of Relaxation Dispersion Data), which is designed to organize, automate, and enhance the analytical procedures which operate on CPMG RD data (http://code.google.com/p/guardd/). This MATLAB-based program includes a graphical user interface, permits global fitting to multi-field, multi-temperature, multi-coherence data, and implements x 2-mapping procedures, via grid-search and Monte Carlo methods, to enhance and assess fitting accuracy. The presentation features allow users to seamlessly traverse the large amount of results, and the RD Simulator feature can help design future experiments as well as serve as a teaching tool for those unfamiliar with RD phenomena. Based on these innovative features, we expect that GUARDD will fill a well-defined gap in service of the RD NMR community. © Springer Science+Business Media B.V. 2011.",
            "authors": [
                "Kleckner I.R.",
                "Foster M.P."
            ],
            "cit_count": 26,
            "journal": "Journal of Biomolecular NMR",
            "pmid": "22160811",
            "title": "GUARDD: User-friendly MATLAB software for rigorous analysis of CPMG RD NMR data",
            "year": "2012-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:guardd",
        "biotoolsID": "guardd",
        "description": "Tool designed to organize, automate, and enhance the analytical procedures which operate on CPMG RD NMR data.",
        "homepage": "https://research.cbc.osu.edu/foster.281/software/#GUARDD",
        "name": "GUARDD"
    }
}