{
    "additionDate": "2021-01-18T12:24:47Z",
    "biotoolsCURIE": "biotools:fangnet",
    "biotoolsID": "fangnet",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "dingx@bucm.edu.cn",
            "name": "Xia Ding",
            "typeEntity": "Person"
        },
        {
            "email": "Guxh1003@126.com",
            "name": "Xiaohong Gu",
            "typeEntity": "Person"
        },
        {
            "email": "biozy@ict.ac.cn",
            "name": "Yi Zhao",
            "typeEntity": "Person"
        }
    ],
    "description": "FangNet is a tool for mining herb hidden knowledge from traditional Chinese medicine clinical effective formulas using structure network algorithm.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                },
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                }
            ]
        }
    ],
    "homepage": "http://fangnet.org",
    "lastUpdate": "2021-03-10T19:54:19Z",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "http://fangnet.herb.ac.cn"
        }
    ],
    "name": "FangNet",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1016/J.CSBJ.2020.11.036",
            "metadata": {
                "abstract": "© 2020 The Author(s)The use of herbs to treat various human diseases has been recorded for thousands of years. In Asia's current medical system, numerous herbal formulas have been repeatedly verified to confirm their effectiveness in different periods, which is a great resource for drug innovation and discovery. Through the mining of these clinical effective formulas by network pharmacology and bioinformatics analysis, important biologically active ingredients derived from these natural products might be discovered. As modern medicine requires a combination of multiple drugs for the treatment of complex diseases, previously clinical formulas are also combinations of various herbs according to the main causes and accompanying symptoms. However, the herbs that play a major role in the treatment of diseases are always unclear. Therefore, how to rank each herb's relative importance and determine the core herbs, is the first step to assisting herb selection for active ingredients discovery. To solve this problem, we built the platform FangNet, which ranks all herbs on their relative topological importance using the PageRank algorithm, based on the constructed symptom-herb network from a collection of clinical empirical prescriptions. Three types of herb hidden knowledge, including herb importance rank, herb-herb co-occurrence, and associations to symptoms, were provided in an interactive visualization. Moreover, FangNet has designed role-based permission for teams to store, analyze, and jointly interpret their clinical formulas, in an easy and secure collaboration environment, aiming at creating a central hub for massive symptom-herb connections. FangNet can be accessed at http://fangnet.org or http://fangnet.herb.ac.cn.",
                "authors": [
                    {
                        "name": "Bu D."
                    },
                    {
                        "name": "Xia Y."
                    },
                    {
                        "name": "Zhang J."
                    },
                    {
                        "name": "Cao W."
                    },
                    {
                        "name": "Huo P."
                    },
                    {
                        "name": "Wang Z."
                    },
                    {
                        "name": "He Z."
                    },
                    {
                        "name": "Ding L."
                    },
                    {
                        "name": "Wu Y."
                    },
                    {
                        "name": "Zhang S."
                    },
                    {
                        "name": "Gao K."
                    },
                    {
                        "name": "Yu H."
                    },
                    {
                        "name": "Liu T."
                    },
                    {
                        "name": "Ding X."
                    },
                    {
                        "name": "Gu X."
                    },
                    {
                        "name": "Zhao Y."
                    }
                ],
                "citationCount": 2,
                "date": "2021-01-01T00:00:00Z",
                "journal": "Computational and Structural Biotechnology Journal",
                "title": "FangNet: Mining herb hidden knowledge from TCM clinical effective formulas using structure network algorithm"
            },
            "pmcid": "PMC7753081",
            "pmid": "33363710"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Medicine",
            "uri": "http://edamontology.org/topic_3303"
        },
        {
            "term": "Pharmacology",
            "uri": "http://edamontology.org/topic_0202"
        },
        {
            "term": "Drug discovery",
            "uri": "http://edamontology.org/topic_3336"
        }
    ]
}