{
    "additionDate": "2017-08-03T18:58:25Z",
    "biotoolsCURIE": "biotools:re-annotator",
    "biotoolsID": "re-annotator",
    "credit": [
        {
            "email": "altmann@stanford.edu",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.altmann.eu/"
        }
    ],
    "description": "This is a  a re-annotation pipeline for microarrays. It is primarily designed for gene expression microarrays but can be adapted to other types of microarrays.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://sourceforge.net/projects/reannotator/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                }
            ]
        }
    ],
    "homepage": "http://sourceforge.net/projects/reannotator/",
    "language": [
        "Perl"
    ],
    "lastUpdate": "2018-12-10T12:58:55Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/re-annotator-re-annotates-microarray-probes.html"
        }
    ],
    "name": "Re-Annotator",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "© 2015 Arloth et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Microarray technologies are established approaches for high throughput gene expression, methylation and genotyping analysis. An accurate mapping of the array probes is essential to generate reliable biological findings. However, manufacturers of the microarray platforms typically provide incomplete and outdated annotation tables, which often rely on older genome and transcriptome versions that differ substantially from up-to-date sequence databases. Here, we present the Re-Annotator, a re-Annotation pipeline for microarray probe sequences. It is primarily designed for gene expression microarrays but can also be adapted to other types of microarrays. The Re-Annotator uses a custom-built mRNA reference database to identify the positions of gene expression array probe sequences. We applied Re-Annotator to the Illumina Human-HT12 v4 microarray platform and found that about one quarter (25%) of the probes differed from the manufacturer's annotation. In further computational experiments on experimental gene expression data, we compared Re- Annotator to another probe re-Annotation tool, ReMOAT, and found that Re-Annotator provided an improved re-Annotation of microarray probes. A thorough re-Annotation of probe information is crucial to any microarray analysis. The Re-Annotator pipeline is freely available at http://sourceforge.net/projects/reannotator along with re-Annotated files for Illumina microarrays HumanHT-12 v3/v4 and MouseRef-8 v2.",
                "authors": [
                    {
                        "name": "Arloth J."
                    },
                    {
                        "name": "Bader D.M."
                    },
                    {
                        "name": "Roh S."
                    },
                    {
                        "name": "Altmann A."
                    }
                ],
                "citationCount": 28,
                "date": "2015-10-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "Re-Annotator: Annotation pipeline for microarray probe sequences"
            },
            "pmid": "26426330"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Data submission, annotation and curation",
            "uri": "http://edamontology.org/topic_0219"
        },
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        }
    ],
    "validated": 1
}