{
    "accessibility": "Open access",
    "additionDate": "2022-04-14T17:46:46.980955Z",
    "biotoolsCURIE": "biotools:cicersptedb",
    "biotoolsID": "cicersptedb",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "Achraf.ELALLALI@um6p.ma",
            "name": "Achraf El Allali",
            "orcidid": "https://orcid.org/0000-0002-4561-2161",
            "typeEntity": "Person"
        },
        {
            "email": "morad.mokhtar@um6p.ma",
            "name": "Morad M. Mokhtar",
            "orcidid": "https://orcid.org/0000-0002-9540-0458",
            "typeEntity": "Person"
        }
    ],
    "description": "A web-based database for high-resolution genome-wide identification of transposable elements in Cicer species.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Genome assembly",
                    "uri": "http://edamontology.org/operation_0525"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                }
            ]
        }
    ],
    "homepage": "http://cicersptedb.easyomics.org/index.php",
    "lastUpdate": "2022-04-14T17:46:46.983878Z",
    "name": "CicerSpTEdb",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PONE.0259540",
            "metadata": {
                "abstract": "© 2021 Mokhtar et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Recently, Cicer species have experienced increased research interest due to their economic importance, especially in genetics, genomics, and crop improvement. The Cicer arietinum, Cicer reticulatum, and Cicer echinospermum genomes have been sequenced and provide valuable resources for trait improvement. Since the publication of the chickpea draft genome, progress has been made in genome assembly, functional annotation, and identification of polymorphic markers. However, work is still needed to identify transposable elements (TEs) and make them available for researchers. In this paper, we present CicerSpTEdb, a comprehensive TE database for Cicer species that aims to improve our understanding of the organization and structural variations of the chickpea genome. Using structure and homology-based methods, 3942 C. echinospermum, 3579 C. reticulatum, and 2240 C. arietinum TEs were identified. Comparisons between Cicer species indicate that C. echinospermum has the highest number of LTR-RT and hAT TEs. C. reticulatum has more Mutator, PIF Harbinger, Tc1 Mariner, and CACTA TEs, while C. arietinum has the highest number of Helitron. CicerSpTEdb enables users to search and visualize TEs by location and download their results. The database will provide a powerful resource that can assist in developing TE target markers for molecular breeding and answer related biological questions.",
                "authors": [
                    {
                        "name": "Abd-Elhalim H.M."
                    },
                    {
                        "name": "Alsamman A.M."
                    },
                    {
                        "name": "El Allali A."
                    },
                    {
                        "name": "Mokhtar M.M."
                    }
                ],
                "date": "2021-11-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "CicerSpTEdb: A web-based database for high-resolution genome-wide identification of transposable elements in Cicer species"
            },
            "pmcid": "PMC8584679",
            "pmid": "34762703"
        }
    ],
    "toolType": [
        "Database portal",
        "Web application"
    ],
    "topic": [
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Mobile genetic elements",
            "uri": "http://edamontology.org/topic_0798"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        },
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        }
    ],
    "validated": 1
}
