{
    "additionDate": "2022-01-02T19:28:06.427973Z",
    "biotoolsCURIE": "biotools:dlff-acp",
    "biotoolsID": "dlff-acp",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "rfcao@ahu.edu.cn",
            "name": "Ruifen Cao",
            "typeEntity": "Person"
        },
        {
            "email": "ynbin@ahu.edu.cn",
            "name": "Yannan Bin",
            "typeEntity": "Person"
        }
    ],
    "description": "Deep Learning and Feature Fuse-based ACP prediction (DLFF-ACP). Pprediction of ACPs based on deep learning and multi-view features fusion.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                },
                {
                    "term": "Feature extraction",
                    "uri": "http://edamontology.org/operation_3937"
                },
                {
                    "term": "Sequence feature comparison",
                    "uri": "http://edamontology.org/operation_0256"
                }
            ]
        }
    ],
    "homepage": "https://github.com/wame-ng/DLFF-ACP",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-01-02T19:28:06.430350Z",
    "name": "DLFF-ACP",
    "operatingSystem": [
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.7717/PEERJ.11906",
            "metadata": {
                "abstract": "Copyright 2021 Cao et al.An emerging type of therapeutic agent, anticancer peptides (ACPs), has attracted attention because of its lower risk of toxic side effects. However process of identifying ACPs using experimental methods is both time-consuming and laborious. In this study, we developed a new and efficient algorithm that predicts ACPs by fusing multi-view features based on dual-channel deep neural network ensemble model. In the model, one channel used the convolutional neural network CNN to automatically extract the potential spatial features of a sequence. Another channel was used to process and extract more effective features from handcrafted features. Additionally, an effective feature fusion method was explored for the mutual fusion of different features. Finally, we adopted the neural network to predict ACPs based on the fusion features. The performance comparisons across the single and fusion features showed that the fusion of multi-view features could effectively improve the model’s predictive ability. Among these, the fusion of the features extracted by the CNN and composition of k-spaced amino acid group pairs achieved the best performance. To further validate the performance of our model, we compared it with other existing methods using two independent test sets. The results showed that our model’s area under curve was 0.90, which was higher than that of the other existing methods on the first test set and higher than most of the other existing methods on the second test set. The source code and datasets are available at https://github.com/wame-ng/DLFF-ACP.",
                "authors": [
                    {
                        "name": "Cao R."
                    },
                    {
                        "name": "Wang M."
                    },
                    {
                        "name": "Bin Y."
                    },
                    {
                        "name": "Zheng C."
                    }
                ],
                "date": "2021-08-01T00:00:00Z",
                "journal": "PeerJ",
                "title": "DLFF-ACP: Prediction of ACPs based on deep learning and multi-view features fusion"
            },
            "pmcid": "PMC8344685",
            "pmid": "34414035"
        }
    ],
    "topic": [
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Physics",
            "uri": "http://edamontology.org/topic_3318"
        }
    ]
}