{
    "additionDate": "2017-02-14T09:34:23Z",
    "biotoolsCURIE": "biotools:adgo",
    "biotoolsID": "adgo",
    "credit": [
        {
            "email": "dougnam@unist.ac.kr",
            "name": "ADGO Support",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "ADGO is a web tool that provides composite interpretations for microarray data comparing two sample groups. It also provides composite interpretations and enrichment analysis for lists of genes from diverse sources of biological information.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://www.btool.org/ADGO2"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Differential gene expression analysis",
                    "uri": "http://edamontology.org/operation_3223"
                },
                {
                    "term": "Gene-set enrichment analysis",
                    "uri": "http://edamontology.org/operation_2436"
                },
                {
                    "term": "Gene expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                },
                {
                    "term": "Service composition",
                    "uri": "http://edamontology.org/operation_3762"
                }
            ]
        }
    ],
    "homepage": "http://www.btool.org/ADGO2",
    "lastUpdate": "2018-12-10T12:58:54Z",
    "name": "ADGO",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "ADGO 2.0 is a web-based tool that provides composite interpretations for microarray data comparing two sample groups as well as lists of genes from diverse sources of biological information. Some other tools also incorporate composite annotations solely for interpreting lists of genes but usually provide highly redundant information. This new version has the following additional features: first, it provides multiple gene set analysis methods for microarray inputs as well as enrichment analyses for lists of genes. Second, it screens redundant composite annotations when generating and prioritizing them. Third, it incorporates union and subtracted sets as well as intersection sets. Lastly, users can upload their own gene sets (e.g. predicted miRNA targets) to generate and analyze new composite sets. The first two features are unique to ADGO 2.0. Using our tool, we demonstrate analyses of a microarray dataset and a list of genes for T-cell differentiation. The new ADGO is available at http://www.btool.org/ADGO2. © 2011 The Author(s).",
                "authors": [
                    {
                        "name": "Chi S.-M."
                    },
                    {
                        "name": "Kim J."
                    },
                    {
                        "name": "Kim S.-Y."
                    },
                    {
                        "name": "Nam D."
                    }
                ],
                "citationCount": 6,
                "date": "2011-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "ADGO 2.0: Interpreting microarray data and list of genes using composite annotations"
            },
            "pmid": "21624890"
        },
        {
            "metadata": {
                "abstract": "Motivation: Genes are typically expressed in modular manners in biological processes. Recent studies reflect such features in analyzing gene expression patterns by directly scoring gene sets. Gene annotations have been used to define the gene sets, which have served to reveal specific biological themes from expression data. However, current annotations have limited analytical power, because they are classified by single categories providing only unary information for the gene sets. Results: Here we propose a method for discovering composite biological hemes from expression data. We intersected two annotated gene sets from different categories of Gene Ontology (GO). We then scored the expression changes of all the single and intersected sets. In this way, we were able to uncover, for example, a gene set with the molecular function F and the cellular component C that showed significant expression change, while the changes in individual gene sets were not significant. We provided an exemplary analysis for HIV-1 immune response. In addition, we tested the method on 20 public datasets where we found many 'filtered' composite terms the number of which reached ∼34% (a strong criterion, 5% significance) of the number of significant unary terms on average. By using composite annotation, we can derive new and improved information about disease and biological processes from expression data. © 2006 Oxford University Press.",
                "authors": [
                    {
                        "name": "Nam D."
                    },
                    {
                        "name": "Kim S.-B."
                    },
                    {
                        "name": "Kim S.-K."
                    },
                    {
                        "name": "Yang S."
                    },
                    {
                        "name": "Kim S.-Y."
                    },
                    {
                        "name": "Chu I.-S."
                    }
                ],
                "citationCount": 27,
                "date": "2006-09-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "ADGO: Analysis of differentially expressed gene sets using composite GO annotation"
            },
            "pmid": "16837524"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Sample collections",
            "uri": "http://edamontology.org/topic_3277"
        },
        {
            "term": "Sequence composition, complexity and repeats",
            "uri": "http://edamontology.org/topic_0157"
        }
    ],
    "validated": 1
}