{
    "additionDate": "2021-01-18T08:40:31Z",
    "biotoolsCURIE": "biotools:statcheck",
    "biotoolsID": "statcheck",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "m.b.nuijten@uvt.nl",
            "name": "Michèle B. Nuijten",
            "orcidid": "https://orcid.org/0000-0002-1468-8585",
            "typeEntity": "Person"
        }
    ],
    "description": "Automatically detect statistical reporting inconsistencies to increase reproducibility of meta-analyses.\n\nstatcheck is a free, open source R package that can be used to automatically extract statistical null-hypothesis significant testing (NHST) results from articles and recompute the p-values based on the reported test statistic and degrees of freedom to detect possible inconsistencies.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://rpubs.com/michelenuijten/statcheckmanual"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Validation",
                    "uri": "http://edamontology.org/operation_2428"
                }
            ]
        }
    ],
    "homepage": "http://statcheck.io",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-02-24T09:26:13Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/MicheleNuijten/statcheck"
        }
    ],
    "name": "statcheck",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1002/JRSM.1408",
            "metadata": {
                "abstract": "© 2020 The Authors. Research Synthesis Methods published by John Wiley & Sons Ltd.We present the R package and web app statcheck to automatically detect statistical reporting inconsistencies in primary studies and meta-analyses. Previous research has shown a high prevalence of reported p-values that are inconsistent - meaning a re-calculated p-value, based on the reported test statistic and degrees of freedom, does not match the author-reported p-value. Such inconsistencies affect the reproducibility and evidential value of published findings. The tool statcheck can help researchers to identify statistical inconsistencies so that they may correct them. In this paper, we provide an overview of the prevalence and consequences of statistical reporting inconsistencies. We also discuss the tool statcheck in more detail and give an example of how it can be used in a meta-analysis. We end with some recommendations concerning the use of statcheck in meta-analyses and make a case for better reporting standards of statistical results.",
                "authors": [
                    {
                        "name": "Nuijten M.B."
                    },
                    {
                        "name": "Polanin J.R."
                    }
                ],
                "citationCount": 1,
                "date": "2020-09-01T00:00:00Z",
                "journal": "Research Synthesis Methods",
                "title": "“statcheck”: Automatically detect statistical reporting inconsistencies to increase reproducibility of meta-analyses"
            },
            "pmcid": "PMC7540394",
            "pmid": "32275351"
        }
    ],
    "topic": [
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ]
}