{
    "additionDate": "2019-11-14T18:26:47Z",
    "biotoolsCURIE": "biotools:AdequacyModel",
    "biotoolsID": "AdequacyModel",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "pedro.rafael.marinho@gmail.com",
            "name": "Pedro Rafael D. Marinho",
            "orcidid": "https://orcid.org/0000-0003-1591-8300",
            "typeEntity": "Person"
        }
    ],
    "description": "An R package for probability distributions and general purpose optimization | Several lifetime distributions have played an important role to fit survival data. However, for some of these models, the computation of maximum likelihood estimators is quite difficult due to presence of flat regions in the search space, among other factors. Several well-known derivative-based optimization tools are unsuitable for obtaining such estimates. To circumvent this problem, we introduce the AdequacyModel computational library version 2.0.0 for the R statistical environment with two major contributions: a general optimization technique based on the Particle Swarm Optimization (PSO) method (with a minor modification of the original algorithm) and a set of statistical measures for assessment of the adequacy of the fitted model",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://github.com/prdm0/AdequacyModel",
    "language": [
        "R"
    ],
    "lastUpdate": "2020-12-01T14:58:40Z",
    "name": "AdequacyModel",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PONE.0221487",
            "metadata": {
                "abstract": "© 2019 Marinho et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Several lifetime distributions have played an important role to fit survival data. However, for some of these models, the computation of maximum likelihood estimators is quite difficult due to presence of flat regions in the search space, among other factors. Several well-known derivative-based optimization tools are unsuitable for obtaining such estimates. To circumvent this problem, we introduce the AdequacyModel computational library version 2.0.0 for the R statistical environment with two major contributions: a general optimization technique based on the Particle Swarm Optimization (PSO) method (with a minor modification of the original algorithm) and a set of statistical measures for assessment of the adequacy of the fitted model. This library is very useful for researchers in probability and statistics and has been cited in various papers in these areas. It serves as the basis for the Newdistns library (version 2.1) published in an impact journal in the area of computational statistics, see https://CRAN.R-project.org/package=Newdistns. It is also the basis of the Wrapped library (version 2.0), see https://CRAN.R-project.org/package=Wrapped. A third package making use of the AdequacyModel library can be found in https://CRAN.Rproject.org/package=sglg. In addition, the proposed library has proved to be very useful for maximizing log-likelihood functions with complex search regions. The library provides a greater control of the optimization process by introducing a stop criterion based on a minimum number of iterations and the variance of a given proportion of optimal values. We emphasize that the new library can be used not only in statistics but in physics and mathematics as proved in several examples throughout the paper.",
                "authors": [
                    {
                        "name": "Marinho P.R.D."
                    },
                    {
                        "name": "Silva R.B."
                    },
                    {
                        "name": "Bourguignon M."
                    },
                    {
                        "name": "Cordeiro G.M."
                    },
                    {
                        "name": "Nadarajah S."
                    }
                ],
                "citationCount": 6,
                "date": "2019-08-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "AdequacyModel: An R package for probability distributions and general purpose optimization"
            },
            "pmcid": "PMC6710032",
            "pmid": "31450236"
        }
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ],
    "validated": 1
}