{
    "additionDate": "2021-12-06T13:26:51.075210Z",
    "biotoolsCURIE": "biotools:stplus",
    "biotoolsID": "stplus",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "ruijiang@tsinghua.edu.cn",
            "name": "Rui Jiang",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "stPlus is a reference-based method for the accurate enhancement of spatial transcriptomics. stPlus is a reference-based method for the accurate enhancement of spatial transcriptomics. Based on an auto-encoder with a carefully tailored loss function, stPlus performs joint embedding and predicts spatial gene expression via a weighted k-NN. The spatial transcriptomics enhanced by stPlus can provide better characterization of cell heterogeneity.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Expression correlation analysis",
                    "uri": "http://edamontology.org/operation_3463"
                },
                {
                    "term": "Gene expression profiling",
                    "uri": "http://edamontology.org/operation_0314"
                },
                {
                    "term": "Gene prediction",
                    "uri": "http://edamontology.org/operation_2454"
                }
            ]
        }
    ],
    "homepage": "http://health.tsinghua.edu.cn/software/stPlus/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T20:14:54.189194Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/xy-chen16/stPlus/issues"
        },
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/xy-chen16/stPlus"
        }
    ],
    "name": "stPlus",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btab298",
            "metadata": {
                "abstract": "Motivation: Single-cell RNA sequencing (scRNA-seq) techniques have revolutionized the investigation of transcriptomic landscape in individual cells. Recent advancements in spatial transcriptomic technologies further enable gene expression profiling and spatial organization mapping of cells simultaneously. Among the technologies, imaging-based methods can offer higher spatial resolutions, while they are limited by either the small number of genes imaged or the low gene detection sensitivity. Although several methods have been proposed for enhancing spatially resolved transcriptomics, inadequate accuracy of gene expression prediction and insufficient ability of cell-population identification still impede the applications of these methods. Results: We propose stPlus, a reference-based method that leverages information in scRNA-seq data to enhance spatial transcriptomics. Based on an auto-encoder with a carefully tailored loss function, stPlus performs joint embedding and predicts spatial gene expression via a weighted k-nearest-neighbor. stPlus outperforms baseline methods with higher gene-wise and cell-wise Spearman correlation coefficients. We also introduce a clustering-based approach to assess the enhancement performance systematically. Using the data enhanced by stPlus, cell populations can be better identified than using the measured data. The predicted expression of genes unique to scRNA-seq data can also well characterize spatial cell heterogeneity. Besides, stPlus is robust and scalable to datasets of diverse gene detection sensitivity levels, sample sizes and number of spatially measured genes. We anticipate stPlus will facilitate the analysis of spatial transcriptomics.",
                "authors": [
                    {
                        "name": "Boheng Z."
                    },
                    {
                        "name": "Rui J."
                    },
                    {
                        "name": "Shengquan C."
                    },
                    {
                        "name": "Xiaoyang C."
                    },
                    {
                        "name": "Xuegong Z."
                    }
                ],
                "citationCount": 53,
                "date": "2021-07-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "StPlus: A reference-based method for the accurate enhancement of spatial transcriptomics"
            },
            "pmcid": "PMC8336594",
            "pmid": "34252941",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ]
}
