{
    "additionDate": "2018-08-01T13:00:16Z",
    "biotoolsCURIE": "biotools:seqspark",
    "biotoolsID": "seqspark",
    "credit": [
        {
            "email": "sleal@bcm.edu",
            "name": "Suzanne M. Leal",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Analysis tool for large-scale rare variant association studies using whole-genome and exome sequence data.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://statgenetics.github.io/seqspark/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genetic variation analysis",
                    "uri": "http://edamontology.org/operation_3197"
                }
            ]
        }
    ],
    "homepage": "https://github.com/statgenetics/seqspark",
    "language": [
        "Java",
        "Scala",
        "Perl"
    ],
    "lastUpdate": "2019-01-15T02:11:30Z",
    "license": "Apache-2.0",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/statgenetics/seqspark/issues"
        }
    ],
    "name": "SEQSpark",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "daniel_stefan",
    "publication": [
        {
            "doi": "10.1016/j.ajhg.2017.05.017",
            "metadata": {
                "abstract": "© 2017 American Society of Human GeneticsMassively parallel sequencing technologies provide great opportunities for discovering rare susceptibility variants involved in complex disease etiology via large-scale imputation and exome and whole-genome sequence-based association studies. Due to modest effect sizes, large sample sizes of tens to hundreds of thousands of individuals are required for adequately powered studies. Current analytical tools are obsolete when it comes to handling these large datasets. To facilitate the analysis of large-scale sequence-based studies, we developed SEQSpark which implements parallel processing based on Spark to increase the speed and efficiency of performing data quality control, annotation, and association analysis. To demonstrate the versatility and speed of SEQSpark, we analyzed whole-genome sequence data from the UK10K, testing for associations with waist-to-hip ratios. The analysis, which was completed in 1.5 hr, included loading data, annotation, principal component analysis, and single variant and rare variant aggregate association analysis of >9 million variants. For rare variant aggregate analysis, an exome-wide significant association (p < 2.5 × 10−6) was observed with CCDC62 (SKAT-O [p = 6.89 × 10−7], combined multivariate collapsing [p = 1.48 × 10−6], and burden of rare variants [p = 1.48 × 10−6]). SEQSpark was also used to analyze 50,000 simulated exomes and it required 1.75 hr for the analysis of a quantitative trait using several rare variant aggregate association methods. Additionally, the performance of SEQSpark was compared to Variant Association Tools and PLINK/SEQ. SEQSpark was always faster and in some situations computation was reduced to a hundredth of the time. SEQSpark will empower large sequence-based epidemiological studies to quickly elucidate genetic variation involved in the etiology of complex traits.",
                "authors": [
                    {
                        "name": "Zhang D."
                    },
                    {
                        "name": "Zhao L."
                    },
                    {
                        "name": "Li B."
                    },
                    {
                        "name": "He Z."
                    },
                    {
                        "name": "Wang G.T."
                    },
                    {
                        "name": "Liu D.J."
                    },
                    {
                        "name": "Leal S.M."
                    }
                ],
                "citationCount": 7,
                "date": "2017-07-06T00:00:00Z",
                "journal": "American Journal of Human Genetics",
                "title": "SEQSpark: A Complete Analysis Tool for Large-Scale Rare Variant Association Studies Using Whole-Genome and Exome Sequence Data"
            },
            "pmcid": "PMC5501866",
            "pmid": "28669402",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Exome sequencing",
            "uri": "http://edamontology.org/topic_3676"
        },
        {
            "term": "Whole genome sequencing",
            "uri": "http://edamontology.org/topic_3673"
        }
    ],
    "validated": 1
}