{
    "additionDate": "2021-06-14T13:39:29Z",
    "biotoolsCURIE": "biotools:chrnet",
    "biotoolsID": "chrnet",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "pingzhao.hu@umanitoba.ca",
            "name": "Pingzhao Hu",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "ChrNet (Chromosome-based 1D-CNN network) is a tool for re-trainable chromosome-based 1D convolutional neural network for predicting immune cell types.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                },
                {
                    "term": "Data handling",
                    "uri": "http://edamontology.org/operation_2409"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Krisloveless/ChrNet",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-08-20T09:07:09Z",
    "license": "MIT",
    "name": "ChrNet",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1016/J.YGENO.2021.04.037",
            "metadata": {
                "abstract": "© 2021 Elsevier Inc.Cells from our immune system detect and kill pathogens to protect our body against various diseases. However, current methods for determining cell types have some major limitations, such as being time-consuming and with low throughput, etc. Immune cells that are associated with cancer tissues play a critical role in revealing tumor development. Identifying the immune composition within tumor microenvironment in a timely manner will be helpful in improving clinical prognosis and therapeutic management for cancer. Although unsupervised clustering approaches have been prevailing to process scRNA-seq datasets, their results vary among studies with different input parameters and sizes, and the identification of the cell types of the clusters is still very challenging. Genes in human genome can be aligned to chromosomes with specific orders. Hence, we hypothesize incorporating this information into our learning model will potentially improve the cell type classification performance. In order to utilize gene positional information, we introduced ChrNet, a novel chromosome-specific re-trainable supervised learning method based on one-dimensional convolutional neural network (1D-CNN). By benchmarking with several models, our model shows superior performance in immune cell type profiling with larger than 90% accuracy. It is expected that this approach can become a reference architecture for other cell type classification methods. Our ChrNet tool is available online at: https://github.com/Krisloveless/ChrNet.",
                "authors": [
                    {
                        "name": "Jia S."
                    },
                    {
                        "name": "Hu P."
                    }
                ],
                "date": "2021-07-01T00:00:00Z",
                "journal": "Genomics",
                "title": "ChrNet: A re-trainable chromosome-based 1D convolutional neural network for predicting immune cell types"
            },
            "pmid": "33932523",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        }
    ]
}