{
    "accessibility": "Open access",
    "additionDate": "2019-08-09T13:16:27Z",
    "biotoolsCURIE": "biotools:SCTree",
    "biotoolsID": "SCTree",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "lwan@amss.ac.cn",
            "name": "Lin Wan",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "mal@big.ac.cn",
            "name": "Liang Ma",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Statistical test of structured continuous trees based on discordance matrix.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/XQBai/SCTree-test/blob/master/README.md"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                }
            ]
        }
    ],
    "homepage": "https://github.com/XQBai/SCTree-test",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-06-16T10:55:26Z",
    "license": "Unlicense",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/XQBai/SCTree-test/issues"
        }
    ],
    "maturity": "Mature",
    "name": "SCTree",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "hans",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ425",
            "metadata": {
                "abstract": "© 2019 The Author(s).Motivation: Cell fate determination is a continuous process in which one cell type diversifies to other cell types following a hierarchical path. Advancements in single-cell technologies provide the opportunity to reveal the continuum of cell progression which forms a structured continuous tree (SCTree). Computational algorithms, which are usually based on a priori assumptions on the hidden structures, have previously been proposed as a means of recovering pseudo trajectory along cell differentiation process. However, there still lack of statistical framework on the assessments of intrinsic structure embedded in high-dimensional gene expression profile. Inherit noise and cell-to-cell variation underlie the single-cell data, however, pose grand challenges to testing even basic structures, such as linear versus bifurcation. Results: In this study, we propose an adaptive statistical framework, termed SCTree, to test the intrinsic structure of a high-dimensional single-cell dataset. SCTree test is conducted based on the tools derived from metric geometry and random matrix theory. In brief, by extending the Gromov-Farris transform and utilizing semicircular law, we formulate the continuous tree structure testing problem into a signal matrix detection problem. We show that the SCTree test is most powerful when the signal-to-noise ratio exceeds a moderate value. We also demonstrate that SCTree is able to robustly detect linear, single and multiple branching events with simulated datasets and real scRNA-seq datasets. Overall, the SCTree test provides a unified statistical assessment of the significance of the hidden structure of single-cell data. Availability and implementation: SCTree software is available at https://github.com/XQBai/SCTree-test. Supplementary information: Supplementary data are available at Bioinformatics online.",
                "authors": [
                    {
                        "name": "Bai X."
                    },
                    {
                        "name": "Ma L."
                    },
                    {
                        "name": "Wan L."
                    }
                ],
                "date": "2019-12-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Statistical test of structured continuous trees based on discordance matrix"
            },
            "pmid": "31116393",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ],
    "validated": 1
}
