{
    "additionDate": "2021-01-18T08:06:15Z",
    "biotoolsCURIE": "biotools:graphbin",
    "biotoolsID": "graphbin",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "vijini.mallawaarachchi@anu.edu.au",
            "typeEntity": "Person"
        }
    ],
    "description": "Refined binning of metagenomic contigs using assembly graphs.\n\nGraphBin is a NGS data-based metagenomic contig bin refinment tool that makes use of the contig connectivity information from the assembly graph to bin contigs. It utilizes the binning result of an existing binning tool and a label propagation algorithm to correct mis-binned contigs and predict the labels of contigs which are discarded due to short length.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Read binning",
                    "uri": "http://edamontology.org/operation_3798"
                },
                {
                    "term": "Sample comparison",
                    "uri": "http://edamontology.org/operation_3731"
                },
                {
                    "term": "Sequence assembly",
                    "uri": "http://edamontology.org/operation_0310"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Vini2/GraphBin",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-01-25T09:40:58Z",
    "license": "GPL-2.0",
    "name": "GraphBin",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAA180",
            "metadata": {
                "abstract": "© 2020 The Author(s) 2020. Published by Oxford University Press. All rights reserved. For permissions, please e-mail: journals.permissions@oup.com.Motivation: The field of metagenomics has provided valuable insights into the structure, diversity and ecology within microbial communities. One key step in metagenomics analysis is to assemble reads into longer contigs which are then binned into groups of contigs that belong to different species present in the metagenomic sample. Binning of contigs plays an important role in metagenomics and most available binning algorithms bin contigs using genomic features such as oligonucleotide/k-mer composition and contig coverage. As metagenomic contigs are derived from the assembly process, they are output from the underlying assembly graph which contains valuable connectivity information between contigs that can be used for binning. Results: We propose GraphBin, a new binning method that makes use of the assembly graph and applies a label propagation algorithm to refine the binning result of existing tools. We show that GraphBin can make use of the assembly graphs constructed from both the de Bruijn graph and the overlap-layout-consensus approach. Moreover, we demonstrate improved experimental results from GraphBin in terms of identifying mis-binned contigs and binning of contigs discarded by existing binning tools. To the best of our knowledge, this is the first time that the information from the assembly graph has been used in a tool for the binning of metagenomic contigs. Contact: vijini.mallawaarachchi@anu.edu.au or yu.lin@anu.edu.au",
                "authors": [
                    {
                        "name": "Lin Y."
                    },
                    {
                        "name": "Mallawaarachchi V."
                    },
                    {
                        "name": "Wickramarachchi A."
                    }
                ],
                "citationCount": 5,
                "date": "2020-06-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "GraphBin: Refined binning of metagenomic contigs using assembly graphs"
            },
            "pmid": "32167528"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "Microbial ecology",
            "uri": "http://edamontology.org/topic_3697"
        },
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ],
    "validated": 1
}
