{
    "additionDate": "2021-01-18T07:58:22Z",
    "biotoolsCURIE": "biotools:redpath",
    "biotoolsID": "redpath",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "ningchen@tsinghua.edu.cn",
            "name": "Ning Chen",
            "typeEntity": "Person"
        },
        {
            "email": "tingchen@tsinghua.edu.cn",
            "name": "Ting Chen",
            "typeEntity": "Person"
        }
    ],
    "description": "Reconstructing the Pseudo Development Time of Cell Lineages in Single-Cell RNA-Seq Data and Applications in Cancer.\n\nredPATH reconstructs the pseudo development time of cell lineages in single-cell RNA-seq data. It formulates the problem of pseudo temporal ordering into a Hamiltonian path problem and attempts to recover the pseudo development time in single-cell RNA-seq datasets. We provide a comprehensive analysis software tool with robust performance.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                },
                {
                    "term": "Principal component visualisation",
                    "uri": "http://edamontology.org/operation_2939"
                },
                {
                    "term": "Trajectory visualization",
                    "uri": "http://edamontology.org/operation_3890"
                }
            ]
        }
    ],
    "homepage": "https://github.com/tinglabs/redPATH",
    "language": [
        "R"
    ],
    "lastUpdate": "2024-11-24T20:37:53.349759Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "http://github.com/tinglab/redPATH"
        }
    ],
    "name": "redPATH",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1101/2020.03.05.977686"
        },
        {
            "doi": "10.1016/j.gpb.2020.06.014",
            "metadata": {
                "abstract": "The recent advancement of single-cell RNA sequencing (scRNA-seq) technologies facilitates the study of cell lineages in developmental processes and cancer. In this study, we developed a computational method, called redPATH, to reconstruct the pseudo developmental time of cell lineages using a consensus asymmetric Hamiltonian path algorithm. Besides, we developed a novel approach to visualize the trajectory development and implemented visualization methods to provide biological insights. We validated the performance of redPATH by segmenting different stages of cell development on multiple neural stem cell and cancer datasets, as well as other single-cell transcriptome data. In particular, we identified a stem cell-like subpopulation in malignant glioma cells. These cells express known proliferative markers, such as GFAP, ATP1A2, IGFBPL1, and ALDOC, and remain silenced for quiescent markers such as ID3. Furthermore, we identified MCL1 as a significant gene that regulates cell apoptosis and CSF1R for reprogramming macrophages to control tumor growth. In conclusion, redPATH is a comprehensive tool for analyzing scRNA-seq datasets along the pseudo developmental time. redPATH is available at https://github.com/tinglabs/redPATH.",
                "authors": [
                    {
                        "name": "Chen N."
                    },
                    {
                        "name": "Chen T."
                    },
                    {
                        "name": "Liu Z."
                    },
                    {
                        "name": "Xie K."
                    }
                ],
                "citationCount": 2,
                "date": "2021-04-01T00:00:00Z",
                "journal": "Genomics, Proteomics and Bioinformatics",
                "title": "redPATH: Reconstructing the Pseudo Development Time of Cell Lineages in Single-cell RNA-seq Data and Applications in Cancer"
            },
            "pmcid": "PMC8602773",
            "pmid": "33607293"
        }
    ],
    "topic": [
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Cytometry",
            "uri": "http://edamontology.org/topic_3934"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ]
}
