
{
    "credit": [
        {
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://proteomics.ucsd.edu/"
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://proteomics.ucsd.edu/software-tools/msplit/#documentation"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Search",
                    "uri": "http://edamontology.org/operation_2421"
                }
            ]
        }
    ],
    "labels": {
        "collectionID": [
            "Proteomics"
        ],
        "language": [
            "Java"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Peptides",
                "uri": "http://edamontology.org/topic_0154"
            },
            {
                "term": "Proteomics",
                "uri": "http://edamontology.org/topic_0121"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/msplit-1-0-multiplexed-spectral-library-search.html"
        }
    ],
    "publication": [
        {
            "abstract": "The success of high-throughput proteomics hinges on the ability of computational methods to identify peptides from tandem mass spectra (MS/MS). However, a common limitation of most peptide identification approaches is the nearly ubiquitous assumption that each MS/MS spectrum is generated from a single peptide. We propose a new computational approach for the identification of mixture spectra generated from more than one peptide. Capitalizing on the growing availability of large libraries of singlepeptide spectra (spectral libraries), our quantitative approach is able to identify up to 98% of all mixture spectra from equally abundant peptides and automatically adjust to varying abundance ratios of up to 10:1. Furthermore, we show how theoretical bounds on spectral similarity avoid the need to compare each experimental spectrum against all possible combinations of candidate peptides (achieving speedups of over five orders of magnitude) and demonstrate that mixture-spectra can be identified in a matter of seconds against proteome-scale spectral libraries. Although our approach was developed for and is demonstrated on peptide spectra, we argue that the generality of the methods allows for their direct application to other types of spectral libraries and mixture spectra. © 2010 by The American Society for Biochemistry and Molecular Biology, Inc.",
            "authors": [
                "Wang J.",
                "Perez-Santiago J.",
                "Katz J.E.",
                "Mallick P.",
                "Bandeira N."
            ],
            "cit_count": 54,
            "doi": "10.1074/mcp.M000136-MCP201",
            "journal": "Molecular and Cellular Proteomics",
            "title": "Peptide identification from mixture tandem mass spectra",
            "type": "Primary",
            "year": "2010-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:msplit",
        "biotoolsID": "msplit",
        "description": "M-SPLIT is a spectral-library search tool for identification of mixture spectra of up to two peptides.",
        "homepage": "http://proteomics.ucsd.edu/software-tools/msplit/",
        "name": "MSPLIT",
        "version": [
            "1.0"
        ]
    }
}