{
    "additionDate": "2018-06-20T16:18:39Z",
    "biotoolsCURIE": "biotools:mobi_2.0",
    "biotoolsID": "mobi_2.0",
    "credit": [
        {
            "email": "silvio.tosatto@unipd.it",
            "name": "Silvio C E Tosatto",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Improved method to define intrinsic disorder, mobility and linear binding regions in protein structures.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://protein.bio.unipd.it/mobi2/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein structure analysis",
                    "uri": "http://edamontology.org/operation_2406"
                }
            ]
        }
    ],
    "homepage": "http://protein.bio.unipd.it/mobi2/",
    "lastUpdate": "2018-12-10T12:58:59Z",
    "name": "Mobi 2.0",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btx592",
            "metadata": {
                "abstract": "© 2017 The Author.Motivation: The structures contained in the Protein Data Bank (PDB) database are of paramount importance to define our knowledge of folded proteins. While providing mainly circumstantial evidence, PDB data is also increasingly used to define the lack of unique structure, represented by mobile regions and even intrinsic disorder (ID). However, alternative definitions are used by different authors and potentially limit the generality of the analyses being carried out. Results: Here we present Mobi 2.0, a completely re-written version of the Mobi software for the determination of mobile and potentially disordered regions from PDB structures. Mobi 2.0 provides robust definitions of mobility based on four main sources of information: (i) missing residues, (ii) residues with high temperature factors, (iii) mobility between different models of the same structure and (iv) binding to another protein or nucleotide chain. Mobi 2.0 is well suited to aggregate information across different PDB structures for the same UniProt protein sequence, providing consensus annotations. The software is expected to standardize the treatment of mobility, allowing an easier comparison across different studies related to ID.",
                "authors": [
                    {
                        "name": "Piovesan D."
                    },
                    {
                        "name": "Tosatto S.C.E."
                    }
                ],
                "citationCount": 11,
                "date": "2018-01-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Mobi 2.0: An improved method to define intrinsic disorder, mobility and linear binding regions in protein structures"
            }
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Protein folds and structural domains",
            "uri": "http://edamontology.org/topic_0736"
        },
        {
            "term": "Protein properties",
            "uri": "http://edamontology.org/topic_0123"
        },
        {
            "term": "Protein structure analysis",
            "uri": "http://edamontology.org/topic_2814"
        }
    ],
    "validated": 1
}
