{
    "accessibility": "Open access",
    "additionDate": "2022-06-07T05:58:18.149782Z",
    "biotoolsCURIE": "biotools:csmcarbohydrate",
    "biotoolsID": "csmcarbohydrate",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "david.ascher@unimelb.edu.au",
            "name": "David B Ascher",
            "orcidid": "https://orcid.org/0000-0003-2948-2413",
            "typeEntity": "Person"
        },
        {
            "email": "douglas.pires@unimelb.edu.au",
            "name": "Douglas E V Pires",
            "orcidid": "https://orcid.org/0000-0002-3004-2119",
            "typeEntity": "Person"
        },
        {
            "email": "thanhbinh.nguyen@unimelb.edu.au",
            "name": "Thanh Binh Nguyen",
            "typeEntity": "Person"
        }
    ],
    "description": "CSM-carbohydrate, using machine learning algorithms to accurately predict their binding affinity and rank docking poses as a scoring function.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Molecular docking",
                    "uri": "http://edamontology.org/operation_0478"
                }
            ]
        }
    ],
    "homepage": "http://biosig.unimelb.edu.au/csm_carbohydrate/",
    "lastUpdate": "2022-06-07T05:58:18.152251Z",
    "name": "CSM-carbohydrate",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1093/BIB/BBAB512",
            "metadata": {
                "abstract": "© The Author(s) 2021. Published by Oxford University Press. All rights reserved.Protein-carbohydrate interactions are crucial for many cellular processes but can be challenging to biologically characterise. To improve our understanding and ability to model these molecular interactions, we used a carefully curated set of 370 protein-carbohydrate complexes with experimental structural and biophysical data in order to train and validate a new tool, cutoff scanning matrix (CSM)-carbohydrate, using machine learning algorithms to accurately predict their binding affinity and rank docking poses as a scoring function. Information on both protein and carbohydrate complementarity, in terms of shape and chemistry, was captured using graph-based structural signatures. Across both training and independent test sets, we achieved comparable Pearson’s correlations of 0.72 under cross-validation [root mean square error (RMSE) of 1.58 Kcal/mol] and 0.67 on the independent test (RMSE of 1.72 Kcal/mol), providing confidence in the generalisability and robustness of the final model. Similar performance was obtained across mono-, di- and oligosaccharides, further highlighting the applicability of this approach to the study of larger complexes. We show CSM-carbohydrate significantly outperformed previous approaches and have implemented our method and make all data freely available through both a user-friendly web interface and application programming interface, to facilitate programmatic access at http://biosig.unimelb.edu.au/csm_carbohydrate/. We believe CSM-carbohydrate will be an invaluable tool for helping assess docking poses and the effects of mutations on protein-carbohydrate affinity, unravelling important aspects that drive binding recognition.",
                "authors": [
                    {
                        "name": "Ascher D.B."
                    },
                    {
                        "name": "Binh Nguyen T."
                    },
                    {
                        "name": "Pires D.E.V."
                    }
                ],
                "date": "2022-01-01T00:00:00Z",
                "journal": "Briefings in Bioinformatics",
                "title": "CSM-carbohydrate: protein-carbohydrate binding affinity prediction and docking scoring function"
            },
            "pmcid": "PMC8769910",
            "pmid": "34882232"
        }
    ],
    "toolType": [
        "Desktop application",
        "Web application"
    ],
    "topic": [
        {
            "term": "Biophysics",
            "uri": "http://edamontology.org/topic_3306"
        },
        {
            "term": "Carbohydrates",
            "uri": "http://edamontology.org/topic_0152"
        },
        {
            "term": "Chemistry",
            "uri": "http://edamontology.org/topic_3314"
        },
        {
            "term": "Molecular modelling",
            "uri": "http://edamontology.org/topic_2275"
        }
    ],
    "validated": 1
}
