{
    "additionDate": "2021-03-19T09:10:12Z",
    "biotoolsCURIE": "biotools:dagitty",
    "biotoolsID": "dagitty",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "johannes.textor@ru.nl",
            "name": "Johannes Textor",
            "typeEntity": "Person"
        }
    ],
    "description": "DAGitty is a browser-based environment for creating, editing, and analyzing causal diagrams (also known as directed acyclic graphs or causal Bayesian networks).",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                },
                {
                    "term": "Network visualisation",
                    "uri": "http://edamontology.org/operation_3925"
                }
            ]
        }
    ],
    "homepage": "http://dagitty.net",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-05-05T09:00:42Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/jtextor/dagitty"
        }
    ],
    "name": "dagitty",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1002/CPZ1.45",
            "metadata": {
                "abstract": "© 2021 The Authors.Causal diagrams such as directed acyclic graphs (DAGs) are used in several scientific fields to help design and analyze studies that aim to infer causal effects from observational data; for example, DAGs can help identify suitable strategies to reduce confounding bias. However, DAGs can be difficult to design, and the validity of any DAG-derived strategy hinges on the validity of the postulated DAG itself. Researchers should therefore check whether the assumptions encoded in the DAG are consistent with the data before proceeding with the analysis. Here, we explain how the R package ‘dagitty’, based on the web tool dagitty.net, can be used to test the statistical implications of the assumptions encoded in a given DAG. We hope that this will help researchers discover model specification errors, avoid erroneous conclusions, and build better models. © 2021 The Authors. Basic Protocol 1: Constructing and importing DAG models from the dagitty web interface. Support Protocol 1: Installing R, RStudio, and the dagitty package. Basic Protocol 2: Testing DAGs against categorical data. Basic Protocol 3: Testing DAGs against continuous data. Support Protocol 2: Testing DAGs against continuous data with non-linearities. Basic Protocol 4: Testing DAGs against a combination of categorical and continuous data.",
                "authors": [
                    {
                        "name": "Ankan A."
                    },
                    {
                        "name": "Wortel I.M.N."
                    },
                    {
                        "name": "Textor J."
                    }
                ],
                "date": "2021-02-01T00:00:00Z",
                "journal": "Current Protocols",
                "title": "Testing Graphical Causal Models Using the R Package “dagitty”"
            },
            "pmid": "33592130",
            "type": [
                "Usage"
            ]
        },
        {
            "doi": "10.1093/ije/dyw341",
            "metadata": {
                "abstract": "© The Author 2017.Directed acyclic graphs (DAGs), which offer systematic representations of causal relationships, have become an established framework for the analysis of causal inference in epidemiology, often being used to determine covariate adjustment sets for minimizing confounding bias. DAGitty is a popular web application for drawing and analysing DAGs. Here we introduce the R package 'dagitty', which provides access to all of the capabilities of the DAGitty web application within the R platform for statistical computing, and also offers several new functions. We describe how the R package 'dagitty' can be used to: evaluate whether a DAG is consistent with the dataset it is intended to represent; enumerate 'statistically equivalent' but causally different DAGs; and identify exposureoutcome adjustment sets that are valid for causally different but statistically equivalent DAGs. This functionality enables epidemiologists to detect causal misspecifications in DAGs and make robust inferences that remain valid for a range of different DAGs. The R package 'dagitty' is available through the comprehensive R archive network (CRAN) at [https://cran.r-project.org/web/packages/dagitty/]. The source code is available on github at [https://github.com/jtextor/dagitty]. The web application 'DAGitty' is free software, licensed under the GNU general public licence (GPL) version 2 and is available at [http:// dagitty.net/].",
                "authors": [
                    {
                        "name": "Textor J."
                    },
                    {
                        "name": "van der Zander B."
                    },
                    {
                        "name": "Gilthorpe M.S."
                    },
                    {
                        "name": "Liskiewicz M."
                    },
                    {
                        "name": "Ellison G."
                    }
                ],
                "citationCount": 280,
                "date": "2016-12-01T00:00:00Z",
                "journal": "International Journal of Epidemiology",
                "title": "Robust causal inference using directed acyclic graphs: The R package 'dagitty'"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application",
        "Library"
    ],
    "topic": [
        {
            "term": "Public health and epidemiology",
            "uri": "http://edamontology.org/topic_3305"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ]
}