
{
    "credit": [
        {
            "email": "lams@cuhk.edu.hk",
            "name": "Sik Lok LAM",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Protein secondary structure prediction (coils)",
                    "uri": "http://edamontology.org/operation_0470"
                },
                {
                    "term": "Random sequence generation",
                    "uri": "http://edamontology.org/operation_0364"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "NMR",
                "uri": "http://edamontology.org/topic_0593"
            },
            {
                "term": "DNA",
                "uri": "http://edamontology.org/topic_0654"
            },
            {
                "term": "Structure prediction",
                "uri": "http://edamontology.org/topic_0082"
            },
            {
                "term": "MRI",
                "uri": "http://edamontology.org/topic_3444"
            }
        ]
    },
    "publication": [
        {
            "abstract": "Random coil phosphorus chemical shift has been studied using 16 17-nucleotide DNA sequences. Due to the presence of residual base stacking in these sequences, the temperature and sequence effects were investigated at 50 and 55°C. The phosphorus chemical shifts of random coil DNA sequences have been found to be independent of temperature. Sequence effect analysis shows that the phosphorus chemical shift of a nucleotide in a random coil DNA sequence depends on both its 5′- and 3′-nearest neighbors. A trimer model has been used to establish the random coil 31P chemical shift prediction protocol which shows an accuracy of 0.02 ppm. © 2004 Elsevier Inc. All rights reserved.",
            "authors": [
                "Ho C.N.",
                "Lam S.L."
            ],
            "cit_count": 15,
            "journal": "Journal of Magnetic Resonance",
            "pmid": "15546744",
            "title": "Random coil phosphorus chemical shift of deoxyribonucleic acids",
            "year": "2004-12-01"
        },
        {
            "pmid": "17517771"
        },
        {
            "abstract": "The sequence and temperature effects on random coil DNA carbon chemical shifts have been investigated using sixteen 17-nucleotide sequences. Temperature effect correction parameters have been determined for the aromatic C6/C8 carbons and the deoxyribose C1′, C2′, and C3′ carbons. The carbon chemical shifts of a specific nucleotide in a random coil sequence have been shown to depend mainly on the type of its nearest neighbors. A carbon chemical shift database containing all 64 different types of triplets has been established for predicting random coil DNA carbon chemical shifts. The use of this triplet database for carbon chemical shift predictions shows good accuracy with experimental data, with root-mean-square deviations of 0.09, 0.10, 0.10, and 0.10ppm and correlation coefficients of 0.999, 0.996, 0.978, and 0.974 for C6/C8, C1′, C2′, and C3′, respectively. © 2003 Elsevier Inc. All rights reserved.",
            "authors": [
                "Kwok C.W.",
                "Ho C.N.",
                "Chi L.M.",
                "Lam S.L."
            ],
            "cit_count": 8,
            "journal": "Journal of Magnetic Resonance",
            "pmid": "14675814",
            "title": "Random coil carbon chemical shifts of deoxyribonucleic acids",
            "year": "2004-01-01"
        },
        {
            "abstract": "Sixteen 17-nucleotide DNA sequences have been used to determine the sequence effect on random coil DNA proton chemical shifts. Based on the proton chemical shifts measured for the central nucleotides in 64 triplets and the correction factors determined for the next nearest neighbor effects, a parameter set has been derived for predicting random coil DNA proton chemical shifts. The root-mean-square deviation (RMSD) between the predicted and the observed aromatic H6/H8 proton chemical shifts of ∼200 data from 22 random coil DNA sequences was determined to be 0.02 ppm with a correlation coefficient of 0.998. For the H1′, H2′, H2″ and H3′ sugar protons, the RMSD values between the predicted and the experimental shifts were found to be 0.02, 0.03, 0.03 and 0.02 ppm, respectively.",
            "authors": [
                "Lam S.L.",
                "Ip L.N.",
                "Cui X.",
                "Ho C.N."
            ],
            "cit_count": 13,
            "journal": "Journal of Biomolecular NMR",
            "pmid": "12522297",
            "title": "Random coil proton chemical shifts of deoxyribonucleic acids",
            "year": "2002-12-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:dshift",
        "biotoolsID": "dshift",
        "description": "DSHIFT is a web server for predicting chemical shifts of DNA sequences in random coil form or double helical B-form.",
        "homepage": "http://www.chem.cuhk.edu.hk/DSHIFT/",
        "name": "DSHIFT"
    }
}