{
    "accessibility": "Open access",
    "additionDate": "2020-01-14T20:07:50Z",
    "biotoolsCURIE": "biotools:SISTR",
    "biotoolsID": "SISTR",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "description": "The Salmonella In Silico Typing Resource (SISTR) is an open-source and freely available web application for rapid in silico typing and serovar prediction from Salmonella genome assemblies using cgMLST and O and H antigen gene searching.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genome assembly",
                    "uri": "http://edamontology.org/operation_0525"
                },
                {
                    "term": "Multilocus sequence typing",
                    "uri": "http://edamontology.org/operation_3840"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://github.com/phac-nml/sistr_cmd",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T14:09:30.342912Z",
    "license": "Apache-2.0",
    "maturity": "Mature",
    "name": "SISTR",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1128/aem.02265-19",
            "metadata": {
                "abstract": "We compared the performance of four open-source in silico Salmonella typing tools (SeqSero, SeqSero2, Salmonella In Silico Typing Resource [SISTR], and Metric Oriented Sequence Typer [MOST]) to assess their potential for replacing laboratory serological testing with serovar predictions from whole-genome sequencing data. We conducted a retrospective analysis of 1,624 Salmonella isolates of 72 serovars submitted to the German National Salmonella Reference Laboratory between 1999 and 2019. All isolates are derived from animal and foodstuff origins. We conducted Illumina short-read sequencing and compared the in silico serovar prediction results with the results of routine laboratory serotyping. We found the bestperforming in silico serovar prediction tool to be SISTR, with 94% correctly typed isolates, followed by SeqSero2 (87%), SeqSero (81%), and MOST (79%). Furthermore, we found that mapping-based tools like SeqSero and SeqSero2 (allele mode) were more reliable for the prediction of monophasic variants, while sequence type and clusterbased methods like MOST and SISTR (core-genome multilocus sequence type [cg-MLST]), showed greater resilience when confronted with GC-biased sequencing data. We showed that the choice of library preparation kit could substantially affect O antigen detection, due to the low GC content of the wzx and wzy genes. Although the accuracy of computational serovar predictions is still not quite on par with traditional serotyping by Salmonella reference laboratories, the command-line tools investigated in this study perform a rapid, efficient, inexpensive, and reproducible analysis, which can be integrated into in-house characterization pipelines. Based on our results, we find SISTR most suitable for automated, routine serotyping for public health surveillance of Salmonella. IMPORTANCE Salmonella spp. are important foodborne pathogens. To reduce the number of infected patients, it is essential to understand which subtypes of the bacteria cause disease outbreaks. Traditionally, characterization of Salmonella requires serological testing, a laboratory method by which Salmonella isolates can be classified into over 2,600 distinct subtypes, called serovars. Due to recent advances in whole-genome sequencing, many tools have been developed to replace traditional testing methods with computational analysis of genome sequences. It is crucial to validate that these tools, many already in use for routine surveillance, deliver accurate and reliable serovar information. In this study, we set out to compare which of the currently available open-source command-line tools is most suitable to replace serological testing. A thorough evaluation of the differing computational approaches is highly important to ensure the backward compatibility of serotyping data and to maintain comparability between laboratories.",
                "authors": [
                    {
                        "name": "Borowiak M."
                    },
                    {
                        "name": "Deneke C."
                    },
                    {
                        "name": "Fischer J."
                    },
                    {
                        "name": "Malorny B."
                    },
                    {
                        "name": "Szabo I."
                    },
                    {
                        "name": "Tausch S.H."
                    },
                    {
                        "name": "Uelze L."
                    }
                ],
                "citationCount": 38,
                "date": "2020-03-01T00:00:00Z",
                "journal": "Applied and Environmental Microbiology",
                "title": "Performance and accuracy of four open-source tools for in silico serotyping of salmonella spp. Based on whole-genome short-read sequencing data"
            },
            "pmcid": "PMC7028957",
            "pmid": "31862714"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Immunoproteins and antigens",
            "uri": "http://edamontology.org/topic_2830"
        },
        {
            "term": "Public health and epidemiology",
            "uri": "http://edamontology.org/topic_3305"
        },
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        },
        {
            "term": "Whole genome sequencing",
            "uri": "http://edamontology.org/topic_3673"
        },
        {
            "term": "Zoology",
            "uri": "http://edamontology.org/topic_3500"
        }
    ],
    "validated": 1,
    "version": [
        "1.1.2"
    ]
}
