{
    "accessibility": "Open access",
    "additionDate": "2022-10-11T21:09:11.539260Z",
    "biotoolsCURIE": "biotools:mlyspred",
    "biotoolsID": "mlyspred",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Qiang Zhang"
        },
        {
            "name": "Xiangxiang Zeng"
        },
        {
            "name": "Yue Hong"
        },
        {
            "name": "Xiangrong Liu",
            "orcidid": "https://orcid.org/0000-0001-9885-1978"
        },
        {
            "name": "Yun Zuo",
            "orcidid": "https://orcid.org/0000-0002-0385-1818"
        }
    ],
    "description": "Graph-based multi-view clustering and multi-dimensional normal distribution resampling techniques to predict multiple lysine sites.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Protein sequence",
                        "uri": "http://edamontology.org/data_2976"
                    },
                    "format": [
                        {
                            "term": "FASTA",
                            "uri": "http://edamontology.org/format_1929"
                        }
                    ]
                }
            ],
            "operation": [
                {
                    "term": "PTM identification",
                    "uri": "http://edamontology.org/operation_3645"
                },
                {
                    "term": "PTM site prediction",
                    "uri": "http://edamontology.org/operation_0417"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "http://47.100.136.41:8181",
    "lastUpdate": "2024-11-24T15:27:10.779209Z",
    "name": "MLysPRED",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1093/bib/bbac277",
            "metadata": {
                "abstract": "Posttranslational modification of lysine residues, K-PTM, is one of the most popular PTMs. Some lysine residues in proteins can be continuously or cascaded covalently modified, such as acetylation, crotonylation, methylation and succinylation modification. The covalent modification of lysine residues may have some special functions in basic research and drug development. Although many computational methods have been developed to predict lysine PTMs, up to now, the K-PTM prediction methods have been modeled and learned a single class of K-PTM modification. In view of this, this study aims to fill this gap by building a multi-label computational model that can be directly used to predict multiple K-PTMs in proteins. In this study, a multi-label prediction model, MLysPRED, is proposed to identify multiple lysine sites using features generated from human protein sequences. In MLysPRED, three kinds of multi-label sequence encoding algorithms (MLDBPB, MLPSDAAP, MLPSTAAP) are proposed and combined with three encoding strategies (CHHAA, DR and Kmer) to convert preprocessed lysine sequences into effective numerical features. A multidimensional normal distribution oversampling technique and graph-based multi-view clustering under-sampling algorithm were first proposed and incorporated to reduce the proportion of the original training samples, and multi-label nearest neighbor algorithm is used for classification. It is observed that MLysPRED achieved an Aiming of 92.21%, Coverage of 94.98%, Accuracy of 89.63%, Absolute-True of 81.46% and Absolute-False of 0.0682 on the independent datasets. Additionally, comparison of results with five existing predictors also indicated that MLysPRED is very promising and encouraging to predict multiple K-PTMs in proteins. For the convenience of the experimental scientists, 'MLysPRED' has been deployed as a user-friendly web-server at http://47.100.136.41:8181.",
                "authors": [
                    {
                        "name": "Hong Y."
                    },
                    {
                        "name": "Liu X."
                    },
                    {
                        "name": "Zeng X."
                    },
                    {
                        "name": "Zhang Q."
                    },
                    {
                        "name": "Zuo Y."
                    }
                ],
                "citationCount": 3,
                "date": "2022-09-01T00:00:00Z",
                "journal": "Briefings in Bioinformatics",
                "title": "MLysPRED: Graph-based multi-view clustering and multi-dimensional normal distribution resampling techniques to predict multiple lysine sites"
            },
            "pmid": "35953081"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Drug development",
            "uri": "http://edamontology.org/topic_3373"
        },
        {
            "term": "Protein modifications",
            "uri": "http://edamontology.org/topic_0601"
        }
    ],
    "validated": 1
}
