{
    "additionDate": "2021-01-18T10:45:08Z",
    "biotoolsCURIE": "biotools:sergio",
    "biotoolsID": "sergio",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "sinhas@illinois.edu",
            "name": "Saurabh Sinha",
            "typeEntity": "Person"
        }
    ],
    "description": "SERGIO (Single-cell ExpRession of Genes In silicO). A Single-Cell Expression Simulator Guided by Gene Regulatory Networks.\n\nSERGIO is a simulator for single-cell expression data guided by gene regulatory networks. A command-line, easy-to-use version of SERGIO will be soon uploaded to PyPI. Here is the documentation for using SERGIO v1.0.0 as a module in python.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene regulatory network analysis",
                    "uri": "http://edamontology.org/operation_1781"
                },
                {
                    "term": "Gene regulatory network prediction",
                    "uri": "http://edamontology.org/operation_2437"
                },
                {
                    "term": "Pathway analysis",
                    "uri": "http://edamontology.org/operation_3928"
                },
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                }
            ]
        }
    ],
    "homepage": "https://github.com/PayamDiba/SERGIO",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-02-16T15:10:49Z",
    "license": "GPL-3.0",
    "name": "SERGIO",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1016/J.CELS.2020.08.003",
            "metadata": {
                "abstract": "© 2020 The AuthorsWe present SERGIO, a software tool that can simulate realistic single-cell transcriptomics datasets based on a user-specified gene regulatory network (GRN). Datasets simulated using SERGIO can be used to benchmark a variety of single-cell analysis tools, especially GRN inference methods. © 2020 The AuthorsA common approach to benchmarking of single-cell transcriptomics tools is to generate synthetic datasets that statistically resemble experimental data. However, most existing single-cell simulators do not incorporate transcription factor-gene regulatory interactions that underlie expression dynamics. Here, we present SERGIO, a simulator of single-cell gene expression data that models the stochastic nature of transcription as well as regulation of genes by multiple transcription factors according to a user-provided gene regulatory network. SERGIO can simulate any number of cell types in steady state or cells differentiating to multiple fates. We show that datasets generated by SERGIO are statistically comparable to experimental data generated by Illumina HiSeq2000, Drop-seq, Illumina 10X chromium, and Smart-seq. We use SERGIO to benchmark several single-cell analysis tools, including GRN inference methods, and identify Tcf7, Gata3, and Bcl11b as key drivers of T cell differentiation by performing in silico knockout experiments. SERGIO is freely available for download here: https://github.com/PayamDiba/SERGIO.",
                "authors": [
                    {
                        "name": "Dibaeinia P."
                    },
                    {
                        "name": "Sinha S."
                    }
                ],
                "citationCount": 1,
                "date": "2020-09-23T00:00:00Z",
                "journal": "Cell Systems",
                "title": "SERGIO: A Single-Cell Expression Simulator Guided by Gene Regulatory Networks"
            },
            "pmcid": "PMC7530147",
            "pmid": "32871105"
        }
    ],
    "topic": [
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Protein expression",
            "uri": "http://edamontology.org/topic_0108"
        }
    ]
}