{
    "accessibility": "Open access",
    "additionDate": "2021-11-11T19:30:52.360247Z",
    "biotoolsCURIE": "biotools:iontobioethics",
    "biotoolsID": "iontobioethics",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "Mohammed.Odeh@sky.com",
            "name": "Mohammed Odeh",
            "typeEntity": "Person"
        }
    ],
    "description": "A Framework for the Agile Development of Bioethics Ontologies in Pandemics, Applied to COVID-19.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Named-entity and concept recognition",
                    "uri": "http://edamontology.org/operation_3280"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://www.iontobioethics.org",
    "lastUpdate": "2021-11-11T19:30:52.362593Z",
    "name": "iOntoBioethics",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.3389/FMED.2021.619978",
            "metadata": {
                "abstract": "© Copyright © 2021 Odeh, Kharbat, Yousef, Odeh, Tbaishat, Hakooz, Dajani and Mansour.Background: Few ontological attempts have been reported for conceptualizing the bioethics domain. In addition to limited scope representativeness and lack of robust methodological approaches in driving research design and evaluation of bioethics ontologies, no bioethics ontologies exist for pandemics and COVID-19. This research attempted to investigate whether studying the bioethics research literature, from the inception of bioethics research publications, facilitates developing highly agile, and representative computational bioethics ontology as a foundation for the automatic governance of bioethics processes in general and the COVID-19 pandemic in particular. Research Design: The iOntoBioethics agile research framework adopted the Design Science Research Methodology. Using systematic literature mapping, the search space resulted in 26,170 Scopus indexed bioethics articles, published since 1971. iOntoBioethics underwent two distinctive stages: (1) Manually Constructing Bioethics (MCB) ontology from selected bioethics sources, and (2) Automatically generating bioethics ontological topic models with all 26,170 sources and using special-purpose developed Text Mining and Machine-Learning (TM&ML) engine. Bioethics domain experts validated these ontologies, and further extended to construct and validate the Bioethics COVID-19 Pandemic Ontology. Results: Cross-validation of the MCB and TM&ML bioethics ontologies confirmed that the latter provided higher-level abstraction for bioethics entities with well-structured bioethics ontology class hierarchy compared to the MCB ontology. However, both bioethics ontologies were found to complement each other forming a highly comprehensive Bioethics Ontology with around 700 concepts and associations COVID-19 inclusive. Conclusion: The iOntoBioethics framework yielded the first agile, semi-automatically generated, literature-based, and domain experts validated General Bioethics and Bioethics Pandemic Ontologies Operable in COVID-19 context with readiness for automatic governance of bioethics processes. These ontologies will be regularly and semi-automatically enriched as iOntoBioethics is proposed as an open platform for scientific and healthcare communities, in their infancy COVID-19 learning stage. iOntoBioethics not only it contributes to better understanding of bioethics processes, but also serves as a bridge linking these processes to healthcare systems. Such big data analytics platform has the potential to automatically inform bioethics governance adherence given the plethora of developing bioethics and COVID-19 pandemic knowledge. Finally, iOntoBioethics contributes toward setting the first building block for forming the field of “Bioethics Informatics”.",
                "authors": [
                    {
                        "name": "Dajani R."
                    },
                    {
                        "name": "Hakooz N."
                    },
                    {
                        "name": "Kharbat F.F."
                    },
                    {
                        "name": "Mansour A."
                    },
                    {
                        "name": "Odeh M."
                    },
                    {
                        "name": "Odeh Y."
                    },
                    {
                        "name": "Tbaishat D."
                    },
                    {
                        "name": "Yousef R."
                    }
                ],
                "date": "2021-05-21T00:00:00Z",
                "journal": "Frontiers in Medicine",
                "title": "iOntoBioethics: A Framework for the Agile Development of Bioethics Ontologies in Pandemics, Applied to COVID-19"
            },
            "pmcid": "PMC8175792",
            "pmid": "34095160"
        }
    ],
    "toolType": [
        "Workbench"
    ],
    "topic": [
        {
            "term": "Drug metabolism",
            "uri": "http://edamontology.org/topic_3375"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Medical informatics",
            "uri": "http://edamontology.org/topic_3063"
        },
        {
            "term": "Ontology and terminology",
            "uri": "http://edamontology.org/topic_0089"
        },
        {
            "term": "Regenerative medicine",
            "uri": "http://edamontology.org/topic_3395"
        }
    ]
}
