
{
    "credit": [
        {
            "email": "kyano@isc.meiji.ac.jp",
            "name": "Kentaro Yano",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "https://github.com/meiji-bioinf/heap"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "SNP detection",
                    "uri": "http://edamontology.org/operation_0484"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Shell"
        ],
        "operatingSystem": [
            "Linux",
            "Mac"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Sequencing",
                "uri": "http://edamontology.org/topic_3168"
            },
            {
                "term": "DNA polymorphism",
                "uri": "http://edamontology.org/topic_2885"
            },
            {
                "term": "Genetic variation",
                "uri": "http://edamontology.org/topic_0199"
            },
            {
                "term": "Genetics",
                "uri": "http://edamontology.org/topic_3053"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© The Author 2017.Recent availability of large-scale genomic resources enables us to conduct so called genome-wide association studies (GWAS) and genomic prediction (GP) studies, particularly with next-generation sequencing (NGS) data. The effectiveness of GWAS and GP depends on not only their mathematical models, but the quality and quantity of variants employed in the analysis. In NGS single nucleotide polymorphism (SNP) calling, conventional tools ideally require more reads for higher SNP sensitivity and accuracy. In this study, we aimed to develop a tool, Heap, that enables robustly sensitive and accurate calling of SNPs, particularly with a low coverage NGS data, which must be aligned to the reference genome sequences in advance. To reduce false positive SNPs, Heap determines genotypes and calls SNPs at each site except for sites at the both ends of reads or containing a minor allele supported by only one read. Performance comparison with existing tools showed that Heap achieved the highest F-scores with low coverage (7X) restriction-site associated DNA sequencing reads of sorghum and rice individuals. This will facilitate cost-effective GWAS and GP studies in this NGS era. Code and documentation of Heap are freely available from https://github.com/meiji-bioinf/heap (29 March 2017, date last accessed) and our web site (http://bioinf.mind.meiji.ac.jp/lab/en/tools.html (29 March 2017, date last accessed)).",
            "authors": [
                "Kobayashi M.",
                "Ohyanagi H.",
                "Takanashi H.",
                "Asano S.",
                "Kudo T.",
                "Kajiya-Kanegae H.",
                "Nagano A.J.",
                "Tainaka H.",
                "Tokunaga T.",
                "Sazuka T.",
                "Iwata H.",
                "Tsutsumi N.",
                "Yano K."
            ],
            "cit_count": 0,
            "doi": "10.1093/DNARES/DSX012",
            "journal": "DNA Research",
            "pmid": "28498906",
            "title": "Heap: a highly sensitive and accurate SNP detection tool for low-coverage high-throughput sequencing data",
            "year": "2017-08-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:heap",
        "biotoolsID": "heap",
        "description": "Highly sensitive and accurate SNP detection tool for low-coverage high-throughput sequencing data.",
        "homepage": "https://github.com/meiji-bioinf/heap",
        "name": "Heap",
        "version": [
            "0.8.0"
        ]
    }
}