
{
    "credit": [
        {
            "email": "info-cbcb@umiacs.umd.edu",
            "name": "Info CBCB",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Scaffolding",
                    "uri": "http://edamontology.org/operation_3216"
                },
                {
                    "term": "Sequence alignment",
                    "uri": "http://edamontology.org/operation_0292"
                },
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "C++",
            "Perl"
        ],
        "maturity": "Mature",
        "operatingSystem": [
            "Linux"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Genomics",
                "uri": "http://edamontology.org/topic_0622"
            },
            {
                "term": "Sequence assembly",
                "uri": "http://edamontology.org/topic_0196"
            },
            {
                "term": "Whole genome sequencing",
                "uri": "http://edamontology.org/topic_3673"
            }
        ]
    },
    "publication": [
        {
            "abstract": "The output of a genome assembler generally comprises a collection of contiguous DNA sequences (contigs) whose relative placement along the genome is not defined. A procedure called scaffolding is commonly used to order and orient these contigs using paired read information. This ordering of contigs is an essential step when finishing and analyzing the data from a whole-genome shotgun project. Most recent assemblers include a scaffolding module; however, users have little control over the scaffolding algorithm or the information produced. We thus developed a general-purpose scaffolder, called Bambus, which affords users significant flexibility in controlling the scaffolding parameters. Bambus was used recently to scaffold the low-coverage draft dog genome data. Most significantly, Bambus enables the use of linking data other than that inferred from mate-pair information. For example, the sequence of a completed genome can be used to guide the scaffolding of a related organism. We present several applications of Bambus: support for finishing, comparative genomics, analysis of the haplotype structure of genomes, and scaffolding of a mammalian genome at low coverage. Bambus is available as an open-source package from our Web site.",
            "authors": [
                "Pop M.",
                "Kosack D.S.",
                "Salzberg S.L."
            ],
            "cit_count": 131,
            "journal": "Genome Research",
            "pmid": "14707177",
            "title": "Hierarchical scaffolding with Bambus",
            "year": "2004-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:bambus",
        "biotoolsID": "bambus",
        "description": "An algorithm for scaffolding genome assemblies. It enables the use of linking data and allows the user to control the scaffolding parameters.",
        "homepage": "http://www.cbcb.umd.edu/software/bambus/",
        "name": "Bambus",
        "version": [
            "Bambus 2"
        ]
    }
}