{
    "additionDate": "2015-08-24T10:02:50Z",
    "biotoolsCURIE": "biotools:discotope",
    "biotoolsID": "discotope",
    "cost": "Free of charge (with restrictions)",
    "credit": [
        {
            "name": "CBS",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        },
        {
            "email": "lund@cbs.dtu.dk",
            "name": "Ole Lund",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Prediction of discontinuous B cell epitopes from protein three dimensional structures.",
    "documentation": [
        {
            "type": "General",
            "url": "http://www.cbs.dtu.dk/services/DiscoTope/instructions.php"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://www.cbs.dtu.dk/services/doc/discotope-1.1.readme"
        },
        {
            "type": "Binaries",
            "url": "http://www.cbs.dtu.dk/services/doc/discotope-1.1.readme"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Structure",
                        "uri": "http://edamontology.org/data_0883"
                    },
                    "format": [
                        {
                            "term": "PDB",
                            "uri": "http://edamontology.org/format_1476"
                        }
                    ]
                }
            ],
            "note": "predicts discontinuous B cell epitopes from protein three dimensional structures",
            "operation": [
                {
                    "term": "Epitope mapping",
                    "uri": "http://edamontology.org/operation_0416"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Protein features",
                        "uri": "http://edamontology.org/data_1277"
                    },
                    "format": [
                        {
                            "term": "Textual format",
                            "uri": "http://edamontology.org/format_2330"
                        }
                    ]
                }
            ]
        }
    ],
    "homepage": "http://cbs.dtu.dk/services/DiscoTope/",
    "lastUpdate": "2018-12-10T12:58:49Z",
    "license": "Other",
    "link": [
        {
            "type": "Repository",
            "url": "http://www.cbs.dtu.dk/services/doc/discotope-1.1.readme"
        },
        {
            "type": "Software catalogue",
            "url": "http://cbs.dtu.dk/services"
        }
    ],
    "maturity": "Emerging",
    "name": "DiscoTope",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "CBS",
    "publication": [
        {
            "doi": "10.1371/journal.pcbi.1002829",
            "metadata": {
                "abstract": "The interaction between antibodies and antigens is one of the most important immune system mechanisms for clearing infectious organisms from the host. Antibodies bind to antigens at sites referred to as B-cell epitopes. Identification of the exact location of B-cell epitopes is essential in several biomedical applications such as; rational vaccine design, development of disease diagnostics and immunotherapeutics. However, experimental mapping of epitopes is resource intensive making in silico methods an appealing complementary approach. To date, the reported performance of methods for in silico mapping of B-cell epitopes has been moderate. Several issues regarding the evaluation data sets may however have led to the performance values being underestimated: Rarely, all potential epitopes have been mapped on an antigen, and antibodies are generally raised against the antigen in a given biological context not against the antigen monomer. Improper dealing with these aspects leads to many artificial false positive predictions and hence to incorrect low performance values. To demonstrate the impact of proper benchmark definitions, we here present an updated version of the DiscoTope method incorporating a novel spatial neighborhood definition and half-sphere exposure as surface measure. Compared to other state-of-the-art prediction methods, Discotope-2.0 displayed improved performance both in cross-validation and in independent evaluations. Using DiscoTope-2.0, we assessed the impact on performance when using proper benchmark definitions. For 13 proteins in the training data set where sufficient biological information was available to make a proper benchmark redefinition, the average AUC performance was improved from 0.791 to 0.824. Similarly, the average AUC performance on an independent evaluation data set improved from 0.712 to 0.727. Our results thus demonstrate that given proper benchmark definitions, B-cell epitope prediction methods achieve highly significant predictive performances suggesting these tools to be a powerful asset in rational epitope discovery. The updated version of DiscoTope is available at www.cbs.dtu.dk/services/DiscoTope-2.0. © 2012 Kringelum et al.",
                "authors": [
                    {
                        "name": "Kringelum J.V."
                    },
                    {
                        "name": "Lundegaard C."
                    },
                    {
                        "name": "Lund O."
                    },
                    {
                        "name": "Nielsen M."
                    }
                ],
                "citationCount": 162,
                "date": "2012-12-01T00:00:00Z",
                "journal": "PLoS Computational Biology",
                "title": "Reliable B Cell Epitope Predictions: Impacts of Method Development and Improved Benchmarking"
            },
            "type": "Primary"
        }
    ],
    "toolType": [
        "Command-line tool",
        "Web application"
    ],
    "topic": [
        {
            "term": "Protein binding sites",
            "uri": "http://edamontology.org/topic_3534"
        },
        {
            "term": "Immunoproteins, genes and antigens",
            "uri": "http://edamontology.org/topic_2830"
        }
    ],
    "validated": 1,
    "version": [
        "2.0"
    ]
}