{
    "accessibility": "Open access",
    "additionDate": "2019-05-25T16:56:48Z",
    "biotoolsCURIE": "biotools:pblat",
    "biotoolsID": "pblat",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "wangm@mail.cbi.pku.edu.cn",
            "name": "M. Wang",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Multithread blat algorithm speeding up aligning sequences to genomes.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein threading",
                    "uri": "http://edamontology.org/operation_0302"
                },
                {
                    "term": "Read mapping",
                    "uri": "http://edamontology.org/operation_3198"
                }
            ]
        }
    ],
    "homepage": "https://github.com/icebert/pblat",
    "language": [
        "C"
    ],
    "lastUpdate": "2020-06-16T10:55:22Z",
    "license": "Unlicense",
    "maturity": "Mature",
    "name": "pblat",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "Ruta",
    "publication": [
        {
            "doi": "10.1186/s12859-019-2597-8",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: The blat is a widely used sequence alignment tool. It is especially useful for aligning long sequences and gapped mapping, which cannot be performed properly by other fast sequence mappers designed for short reads. However, the blat tool is single threaded and when used to map whole genome or whole transcriptome sequences to reference genomes this program can take days to finish, making it unsuitable for large scale sequencing projects and iterative analysis. Here, we present pblat (parallel blat), a parallelized blat algorithm with multithread and cluster computing support, which functions to rapidly fine map large scale DNA/RNA sequences against genomes. Results: The pblat algorithm takes advantage of modern multicore processors and significantly reduces the run time with the number of threads used. pblat utilizes almost equal amount of memory as when running blat. The results generated by pblat are identical with those generated by blat. The pblat tool is easy to install and can run on Linux and Mac OS systems. In addition, we provide a cluster version of pblat (pblat-cluster) running on computing clusters with MPI support. Conclusion: pblat is open source and free available for non-commercial users. It is easy to install and easy to use. pblat and pblat-cluster would facilitate the high-throughput mapping of large scale genomic and transcript sequences to reference genomes with both high speed and high precision.",
                "authors": [
                    {
                        "name": "Wang M."
                    },
                    {
                        "name": "Kong L."
                    }
                ],
                "citationCount": 10,
                "date": "2019-01-15T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "pblat: A multithread blat algorithm speeding up aligning sequences to genomes"
            },
            "pmcid": "PMC6334396",
            "pmid": "30646844",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "RNA-seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        }
    ],
    "validated": 1
}