{
    "additionDate": "2018-07-28T09:41:58Z",
    "biotoolsCURIE": "biotools:fluxpyt",
    "biotoolsID": "fluxpyt",
    "credit": [
        {
            "email": "shireesh@icgeb.res.in",
            "name": "Shireesh Srivastava",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Stationary 13C metabolic flux analysis for estimation of intracellular flux distribution.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Metabolic labeling",
                    "uri": "http://edamontology.org/operation_3715"
                }
            ]
        }
    ],
    "homepage": "https://sourceforge.net/projects/fluxpyt/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2018-12-10T12:59:00Z",
    "name": "FluxPyt",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.7717/peerj.4716",
            "metadata": {
                "abstract": "© 2018 Desai and Srivastava.13C-Metabolic flux analysis (MFA) is a powerful approach to estimate intracellular reaction rates which could be used in strain analysis and design. Processing and analysis of labeling data for calculation of fluxes and associated statistics is an essential part of MFA. However, various software currently available for data analysis employ proprietary platforms and thus limit accessibility. We developed FluxPyt, a Python-based truly open-source software package for conducting stationary 13C-MFA data analysis. The software is based on the efficient elementary metabolite unit framework. The standard deviations in the calculated fluxes are estimated using theMonte-Carlo analysis. FluxPyt also automatically creates flux maps based on a template for visualization of the MFA results. The flux distributions calculated by FluxPyt for two separate models: a small tricarboxylic acid cycle model and a larger Corynebacterium glutamicum model, were found to be in good agreement with those calculated by a previously published software. FluxPyt was tested in MicrosoftTM Windows 7 and 10, as well as in Linux Mint 18.2. The availability of a free and open 13C-MFA software that works in various operating systems will enable more researchers to perform 13C-MFA and to further modify and develop the package.",
                "authors": [
                    {
                        "name": "Desai T.S."
                    },
                    {
                        "name": "Srivastava S."
                    }
                ],
                "citationCount": 1,
                "date": "2018-01-01T00:00:00Z",
                "journal": "PeerJ",
                "title": "FluxPyt: A Python-based free and open-source software for 13C-metabolic flux analyses"
            },
            "pmcid": "PMC5933345",
            "pmid": "29736347"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Endocrinology and metabolism",
            "uri": "http://edamontology.org/topic_3407"
        },
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Data visualisation",
            "uri": "http://edamontology.org/topic_0092"
        }
    ],
    "validated": 1
}