{
    "additionDate": "2020-01-14T09:27:10Z",
    "biotoolsCURIE": "biotools:MISS-D",
    "biotoolsID": "MISS-D",
    "confidence_flag": "medium",
    "description": "A fast and scalable framework of medical image storage service based on distributed file system.\n\nBackground and Objective Processing of medical imaging big data is deeply challenging due to the size of data, computational complexity, security storage and inherent privacy issues. Traditional picture archiving and communication system, which is an imaging technology used in the healthcare industry, generally uses centralized high performance disk storage arrays in the practical solutions. The existing storage solutions are not suitable for the diverse range of medical imaging big data that needs to be stored reliably and accessed in a timely manner. The economical solution is emerging as the cloud computing which provides scalability, elasticity, performance and better managing cost. Cloud based storage architecture for medical imaging big data has attracted more and more attention in industry and academia.\n\n||| HOMEPAGE MISSING!.\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'framework'",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://www.ncbi.nlm.nih.gov/pubmed/?term=31759298",
    "lastUpdate": "2020-01-14T09:27:10Z",
    "name": "MISS-D",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1016/J.CMPB.2019.105189",
            "metadata": {
                "abstract": "© 2019 Elsevier B.V.Background and Objective Processing of medical imaging big data is deeply challenging due to the size of data, computational complexity, security storage and inherent privacy issues. Traditional picture archiving and communication system, which is an imaging technology used in the healthcare industry, generally uses centralized high performance disk storage arrays in the practical solutions. The existing storage solutions are not suitable for the diverse range of medical imaging big data that needs to be stored reliably and accessed in a timely manner. The economical solution is emerging as the cloud computing which provides scalability, elasticity, performance and better managing cost. Cloud based storage architecture for medical imaging big data has attracted more and more attention in industry and academia. Methods This study presents a novel, fast and scalable framework of medical image storage service based on distributed file system. Two innovations of the framework are introduced in this paper. An integrated medical imaging content indexing file model for large-scale image sequence is designed to adapt to the high performance storage efficiency on distributed file system. A virtual file pooling technology is proposed, which uses the memory-mapped file method to achieve an efficient data reading process and provides the data swapping strategy in the pool. Result The experiments show that the framework not only has comparable performance of reading and writing files which meets requirements in real-time application domain, but also bings greater convenience for clinical system developers by multiple client accessing types. The framework supports different user client types through the unified micro-service interfaces which basically meet the needs of clinical system development especially for online applications. The experimental results demonstrate the framework can meet the needs of real-time data access as well as traditional picture archiving and communication system. Conclusions This framework aims to allow rapid data accessing for massive medical images, which can be demonstrated by the online web client for MISS-D framework implemented in this paper for real-time data interaction. The framework also provides a substantial subset of features to existing open-source and commercial alternatives, which has a wide range of potential applications.",
                "authors": [
                    {
                        "name": "Li W."
                    },
                    {
                        "name": "Feng C."
                    },
                    {
                        "name": "Yu K."
                    },
                    {
                        "name": "Zhao D."
                    }
                ],
                "date": "2020-04-01T00:00:00Z",
                "journal": "Computer Methods and Programs in Biomedicine",
                "title": "MISS-D: A fast and scalable framework of medical image storage service based on distributed file system"
            },
            "pmid": "31759298"
        }
    ],
    "topic": [
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        },
        {
            "term": "Computer science",
            "uri": "http://edamontology.org/topic_3316"
        },
        {
            "term": "Data architecture, analysis and design",
            "uri": "http://edamontology.org/topic_3365"
        }
    ]
}