{
    "additionDate": "2019-09-09T07:53:48Z",
    "biotoolsCURIE": "biotools:RepeatFiller",
    "biotoolsID": "RepeatFiller",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "hiller@mpi-cbg.de",
            "name": "Michael Hiller",
            "orcidid": "https://orcid.org/0000-0003-3024-1449"
        }
    ],
    "description": "RepeatFiller incorporates newly-detected repeat-overlapping alignments into pairwise alignment chains. It only aligns local genomic regions that are bounded by colinear aligning blocks, as provided in the chains, which makes it feasible to consider all seeds including those that overlap repetitive regions.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Pairwise sequence alignment",
                    "uri": "http://edamontology.org/operation_0491"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Local alignment",
                    "uri": "http://edamontology.org/operation_0495"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Genome alignment",
                    "uri": "http://edamontology.org/operation_3182"
                }
            ]
        }
    ],
    "homepage": "https://github.com/hillerlab/GenomeAlignmentTools",
    "lastUpdate": "2021-01-07T18:57:51.081886Z",
    "name": "RepeatFiller",
    "owner": "osipova",
    "publication": [
        {
            "doi": "10.1093/GIGASCIENCE/GIZ132",
            "metadata": {
                "abstract": "© The Author(s) 2019. Published by Oxford University Press.BACKGROUND: Transposons and other repetitive sequences make up a large part of complex genomes. Repetitive sequences can be co-opted into a variety of functions and thus provide a source for evolutionary novelty. However, comprehensively detecting ancestral repeats that align between species is difficult because considering all repeat-overlapping seeds in alignment methods that rely on the seed-and-extend heuristic results in prohibitively high runtimes. RESULTS: Here, we show that ignoring repeat-overlapping alignment seeds when aligning entire genomes misses numerous alignments between repetitive elements. We present a tool, RepeatFiller, that improves genome alignments by incorporating previously undetected local alignments between repetitive sequences. By applying RepeatFiller to genome alignments between human and 20 other representative mammals, we uncover between 22 and 84 Mb of previously undetected alignments that mostly overlap transposable elements. We further show that the increased alignment coverage improves the annotation of conserved non-exonic elements, both by discovering numerous novel transposon-derived elements that evolve under constraint and by removing thousands of elements that are not under constraint in placental mammals. CONCLUSIONS: RepeatFiller contributes to comprehensively aligning repetitive genomic regions, which facilitates studying transposon co-option and genome evolution. Source code: https://github.com/hillerlab/GenomeAlignmentTools.",
                "authors": [
                    {
                        "name": "Osipova E."
                    },
                    {
                        "name": "Hecker N."
                    },
                    {
                        "name": "Hiller M."
                    }
                ],
                "citationCount": 2,
                "date": "2019-11-01T00:00:00Z",
                "journal": "GigaScience",
                "title": "RepeatFiller newly identifies megabases of aligning repetitive sequences and improves annotations of conserved non-exonic elements"
            }
        }
    ],
    "topic": [
        {
            "term": "Mobile genetic elements",
            "uri": "http://edamontology.org/topic_0798"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ]
}