{
    "additionDate": "2019-11-14T18:44:38Z",
    "biotoolsCURIE": "biotools:Racon",
    "biotoolsID": "Racon",
    "confidence_flag": "very low",
    "credit": [
        {
            "email": "cskang@korea.kr",
            "name": "Chon-Sik Kang",
            "typeEntity": "Person"
        },
        {
            "email": "changsookim@cnu.ac.kr",
            "name": "Changsoo Kim",
            "orcidid": "https://orcid.org/0000-0002-3596-2934",
            "typeEntity": "Person"
        }
    ],
    "description": "> VERY_LOW CONFIDENCE! | > CORRECT NAME OF TOOL COULD ALSO BE 'Constructing Reference Genome Single Lab', 'Phytozome' (bio.tools/phytozome), 'MinION', '895,678' | The Possibility to Use Oxford Nanopore Technology | Ultrafast consensus module for raw de novo genome assembly of long uncorrected reads. http://genome.cshlp.org/content/early/2017/01/18/gr.214270.116 Note: This was the original repository which will no longer be officially maintained. Please use the new official repository here: | Racon is intended as a standalone consensus module to correct raw contigs generated by rapid assembly methods which do not include a consensus step | Consensus module for raw de novo DNA assembly of long uncorrected reads",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genome assembly",
                    "uri": "http://edamontology.org/operation_0525"
                },
                {
                    "term": "Mapping assembly",
                    "uri": "http://edamontology.org/operation_0523"
                },
                {
                    "term": "Sequence trimming",
                    "uri": "http://edamontology.org/operation_3192"
                }
            ]
        }
    ],
    "homepage": "https://github.com/isovic/racon",
    "language": [
        "C++",
        "Python"
    ],
    "lastUpdate": "2019-11-14T18:44:38Z",
    "license": "MIT",
    "name": "Racon",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.3390/PLANTS8080270",
            "metadata": {
                "abstract": "© 2019 by the authors. Licensee MDPI, Basel, Switzerland.The whole genome sequencing (WGS) has become a crucial tool in understanding genome structure and genetic variation. The MinION sequencing of Oxford Nanopore Technologies (ONT) is an excellent approach for performing WGS and it has advantages in comparison with other Next-Generation Sequencing (NGS): It is relatively inexpensive, portable, has simple library preparation, can be monitored in real-time, and has no theoretical limits on reading length. Sorghum bicolor (L.) Moench is diploid (2n = 2x = 20) with a genome size of about 730 Mb, and its genome sequence information is released in the Phytozome database. Therefore, sorghum can be used as a good reference. However, plant species have complex and large genomes when compared to animals or microorganisms. As a result, complete genome sequencing is difficult for plant species. MinION sequencing that produces long-reads can be an excellent tool for overcoming the weak assembly of short-reads generated from NGS by minimizing the generation of gaps or covering the repetitive sequence that appears on the plant genome. Here, we conducted the genome sequencing for S. bicolor cv. BTx623 while using the MinION platform and obtained 895,678 reads and 17.9 gigabytes (Gb) (ca. 25× coverage of reference) from long-read sequence data. A total of 6124 contigs (covering 45.9%) were generated from Canu, and a total of 2661 contigs (covering 50%) were generated from Minimap and Miniasm with a Racon through a de novo assembly using two different tools and mapped assembled contigs against the sorghum reference genome. Our results provide an optimal series of long-read sequencing analysis for plant species while using the MinION platform and a clue to determine the total sequencing scale for optimal coverage that is based on various genome sizes.",
                "authors": [
                    {
                        "name": "Lee Y.G."
                    },
                    {
                        "name": "Choi S.C."
                    },
                    {
                        "name": "Kang Y."
                    },
                    {
                        "name": "Kim K.M."
                    },
                    {
                        "name": "Kang C.-S."
                    },
                    {
                        "name": "Kim C."
                    }
                ],
                "citationCount": 1,
                "date": "2019-08-01T00:00:00Z",
                "journal": "Plants",
                "title": "Constructing a reference genome in a single lab: The possibility to use oxford nanopore technology"
            },
            "pmcid": "PMC6724115",
            "pmid": "31390788"
        }
    ],
    "topic": [
        {
            "term": "Whole genome sequencing",
            "uri": "http://edamontology.org/topic_3673"
        },
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        }
    ]
}