{"credit":[{"name":"DRCAT","typeEntity":"Project","typeRoles":["Documentor"]},{"email":"unitrap@crg.es","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"http://unitrap.crg.es/about.php"}],"function":[{"input":[{"data":{"term":"Ensembl gene ID","uri":"http://edamontology.org/data_1033"}}],"operation":[{"term":"Query and retrieval","uri":"http://edamontology.org/operation_0224"}],"output":[{"data":{"term":"Gene report","uri":"http://edamontology.org/data_0916"},"format":[{"term":"HTML","uri":"http://edamontology.org/format_2331"}]}]}],"labels":{"collectionID":["DRCAT"],"operatingSystem":["Linux","Windows","Mac"],"toolType":["Database portal"],"topic":[{"term":"Gene structure","uri":"http://edamontology.org/topic_0114"}]},"publication":[{"abstract":"We have developed a comprehensive resource devoted to biologists wanting to optimize the use of gene trap clones in their experiments. We have processed 300 602 such clones from both public and private projects to generate 28 199 'UniTraps', i.e. distinct collections of unambiguous insertions at the same subgenic region of annotated genes. The UniTrap resource contains data relative to 9583 trapped genes, which represent 42.3% of the mouse gene content. Among the trapped genes, 7 728 have a counterpart in humans, and 677 are known to be involved in the pathogenesis of human diseases. The aim of this analysis is to provide the wet lab researchers with a comprehensive database and curated tools for (i) identifying and comparing the clones carrying a trap into the genes of interest, (ii) evaluating the severity of the mutation to the protein function in each independent trapping event and (iii) supplying complete information to perform PCR, RT-PCR and restriction experiments to verify the clone and identify the exact point of vector insertion. To share this unique resource with the scientific community, we have designed and implemented a web interface that is freely accessible at http://unitrap.cbm.fvg.it/. © 2007 The Author(s).","authors":["Roma G.","Sardiello M.","Cobellis G.","Cruz P.","Lago G.","Sanges R.","Stupka E."],"cit_count":6,"doi":"10.1093/nar/gkm825","journal":"Nucleic Acids Research","title":"The UniTrap resource: Tools for the biologist enabling optimized use of gene trap clones","type":"Primary","year":"2008-01-01"}],"summary":{"biotoolsCURIE":"biotools:unitrap","biotoolsID":"unitrap","description":"Tools for the biologist enabling optimized use of gene trap clones.","homepage":"http://unitrap.crg.es/about.php","name":"UniTrap gene trap clones"}}