{
    "accessibility": "Open access",
    "additionDate": "2020-01-24T12:37:12Z",
    "biotoolsCURIE": "biotools:Isodyn",
    "biotoolsID": "Isodyn",
    "description": "“C++”-program simulating the dynamics of metabolites and their isotopic isomers in the central metabolic network using a corresponding kinetic model. Supports the final step of 13C assisted the fluxomic analysis: evaluation of metabolic fluxes consistent with a given mass isotopomer distribution. The previous steps are supported by Ramid, Midcor, Isoform.",
    "documentation": [
        {
            "note": "Usage instruction and example",
            "type": [
                "General"
            ],
            "url": "https://github.com/seliv55/isodyn"
        }
    ],
    "download": [
        {
            "type": "Downloads page",
            "url": "https://github.com/seliv55/isodyn",
            "version": "1.0"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "elixirNode": [
        "Spain"
    ],
    "elixirPlatform": [
        "Tools"
    ],
    "function": [
        {
            "cmd": "./isodyn.out $fiso $fcon $inpar $oudir $fstat $fcmpr $manfi $FNCKAS",
            "input": [
                {
                    "data": {
                        "term": "Mass spectrum",
                        "uri": "http://edamontology.org/data_0943"
                    },
                    "format": [
                        {
                            "term": "TIDE TXT",
                            "uri": "http://edamontology.org/format_3835"
                        }
                    ]
                },
                {
                    "data": {
                        "term": "Mass spectrometry data",
                        "uri": "http://edamontology.org/data_2536"
                    },
                    "format": [
                        {
                            "term": "TIDE TXT",
                            "uri": "http://edamontology.org/format_3835"
                        }
                    ]
                }
            ],
            "note": "fiso=\"SW620-Glucose\"    # input data: file indicating 13C labeling of metabolites\nfcon=xglc               # input data: file with measured concentrations\ninpar=\"glc/1\"           # input data: initial set of parameters to start\noudir=\"glc/\"            # output directory\nfstat=\"glc/statfl\"      # path to write the results of fitting: mean and confidence intervals\nfcmpr=\"glc/statfl\"      # results of fitting for the conditions used for comparison.\nmanfi=77                # number of files to be saved during fitting\nFNCKAS     # various options for the fitting",
            "operation": [
                {
                    "term": "Modelling and simulation",
                    "uri": "http://edamontology.org/operation_2426"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Mass spectrum",
                        "uri": "http://edamontology.org/data_0943"
                    },
                    "format": [
                        {
                            "term": "TIDE TXT",
                            "uri": "http://edamontology.org/format_3835"
                        }
                    ]
                }
            ]
        }
    ],
    "homepage": "https://github.com/seliv55/isodyn",
    "language": [
        "R"
    ],
    "lastUpdate": "2020-06-16T10:55:27Z",
    "license": "Freeware",
    "link": [
        {
            "note": "Code and example",
            "type": [
                "Repository"
            ],
            "url": "https://github.com/seliv55/isodyn"
        }
    ],
    "name": "Isodyn",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "vitaly",
    "publication": [
        {
            "doi": "10.1007/978-1-0716-0159-4_12",
            "metadata": {
                "abstract": "© Springer Science+Business Media, LLC, part of Springer Nature 2020.Stable isotope-resolved metabolomics (SIRM), based on the analysis of biological samples from living cells incubated with artificial isotope enriched substrates, enables mapping the rates of biochemical reactions (metabolic fluxes). We developed software supporting a workflow of analysis of SIRM data obtained with mass spectrometry (MS). The evaluation of fluxes starting from raw MS recordings requires at least three steps of computer support: first, extraction of mass spectra of metabolites of interest, then correction of the spectra for natural isotope abundance, and finally, evaluation of fluxes by simulation of the corrected spectra using a corresponding mathematical model. A kinetic model based on ordinary differential equations (ODEs) for isotopomers of metabolites of the corresponding biochemical network supports the final part of the analysis, which provides a dynamic flux map.",
                "authors": [
                    {
                        "name": "Selivanov V.A."
                    },
                    {
                        "name": "Marin S."
                    },
                    {
                        "name": "Tarrago-Celada J."
                    },
                    {
                        "name": "Lane A.N."
                    },
                    {
                        "name": "Higashi R.M."
                    },
                    {
                        "name": "Fan T.W.-M."
                    },
                    {
                        "name": "de Atauri P."
                    },
                    {
                        "name": "Cascante M."
                    }
                ],
                "date": "2020-01-01T00:00:00Z",
                "journal": "Methods in Molecular Biology",
                "title": "Software supporting a workflow of quantitative dynamic flux maps estimation in central metabolism from SIRM experimental data"
            },
            "pmid": "31893378",
            "type": [
                "Method"
            ]
        },
        {
            "metadata": {
                "abstract": "Motivation: Analysis of the conversion of 13C glucose within the metabolic network allows the evaluation of the biochemical fluxes in interconnecting metabolic pathways. Such analyses require solving hundreds of equations with respect to individual isotopomer concentrations, and this assumes applying special software even for constructing the equations. The algorithm, proposed by others could be improved. Method: A C-code linked to the program written in Mathematica (Wolfram Research Inc.), constructs and solves differential equations for all isotopomer concentrations, using the general enzyme characteristics (Km, equilibrium constant, etc.). This code uses innovative algorithm of determination for the isotopomers-products, thus essentially decreasing the computation time. Feasible metabolic fluxes are provided by the parameters of enzyme kinetics found from the data fitting. Results: The software effectively evaluates metabolic fluxes based on the measured isotopomer distribution, as was illustrated by the analysis of glycolysis and pentose phosphate cycle. The mechanism of transketolase and transaldolase catalysis was shown to induce a specific kind of isotopomer re-distribution, which, despite the significance of its effect, usually is not taken into account. © Oxford University Press 2004; all rights reserved.",
                "authors": [
                    {
                        "name": "Selivanov V.A."
                    },
                    {
                        "name": "Puigjaner J."
                    },
                    {
                        "name": "Sillero A."
                    },
                    {
                        "name": "Centelles J.J."
                    },
                    {
                        "name": "Ramos-Montoya A."
                    },
                    {
                        "name": "Lee P.W.-N."
                    },
                    {
                        "name": "Cascante M."
                    }
                ],
                "citationCount": 33,
                "date": "2004-12-12T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "An optimized algorithm for flux estimation from isotopomer distribution in glucose metabolites"
            },
            "pmid": "15256408",
            "type": [
                "Method"
            ]
        },
        {
            "metadata": {
                "abstract": "Motivation: Addition of labeled substrates and the measurement of the subsequent distribution of the labels in isotopomers in reaction networks provide a unique method for assessing metabolic fluxes in whole cells. However, owing to insufficiency of information, attempts to quantify the fluxes often yield multiple possible sets of solutions that are consistent with a given experimental pattern of isotopomers. In the study of the pentose phosphate pathways, the need to consider isotope exchange reactions of transketolase (TK) and transaldolase (TA) (which in past analyses have often been ignored) magnifies this problem; but accounting for the interrelation between the fluxes known from biochemical studies and kinetic modeling solves it. The mathematical relationships between kinetic and equilibrium constants restrict the domain of estimated fluxes to the ones compatible not only with a given set of experimental data, but also with other biochemical information. Method: We present software that integrates kinetic modeling with isotopomer distribution analysis. It solves the ordinary differential equations for total concentrations (accounting for the kinetic mechanisms) as well as for all isotopomers in glycolysis and the pentose phosphate pathway (PPP). In the PPP the fluxes created in the TK and TA reactions are expressed through unitary rate constants. The algorithms that account for all the kinetic and equilbrium constant constraints are integrated with the previously developed algorithms, which have been further optimized. The most time-consuming calculations were programmed directly in assembly language; this gave an order of magnitude decrease in the computation time, thus allowing analysis of more complex systems. The software was developed as C-code linked to a program written in Mathematica (Wolfram Research, Champaign, IL), and also as a C++ program independent from Mathematica. Results: Implementing constraints imposed by kinetic and equilibrium constants in the isotopomer distribution analysis in the data from the cancer cells eliminated estimates of fluxes that were inconsistent with the kinetic mechanisms of TK and TA. Fluxes measured experimentally in cells can be used to estimate better the kinetics of TK and TA as they operate in situ. Thus, our approach of integrating various methods for in situ flux analysis opens up the possibility of designing new types of experiments to probe metabolic interrelationships, including the incorporation of additional biochemical information. © The Author 2005. Published by Oxford University Press. All rights reserved.",
                "authors": [
                    {
                        "name": "Selivanov V.A."
                    },
                    {
                        "name": "Meshalkina L.E."
                    },
                    {
                        "name": "Solovjeva O.N."
                    },
                    {
                        "name": "Kuchel P.W."
                    },
                    {
                        "name": "Ramos-Montoya A."
                    },
                    {
                        "name": "Kochetov G.A."
                    },
                    {
                        "name": "Lee P.W.N."
                    },
                    {
                        "name": "Cascante M."
                    }
                ],
                "citationCount": 29,
                "date": "2005-09-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Rapid simulation and analysis of isotopomer distributions using constraints based on enzyme mechanisms: An example from HT29 cancer cells"
            },
            "pmid": "16002431",
            "type": [
                "Method"
            ]
        },
        {
            "metadata": {
                "abstract": "Motivation: Metabolic flux analysis of biochemical reaction networks using isotope tracers requires software tools that can analyze the dynamics of isotopic isomer (isotopomer) accumulation in metabolites and reveal the underlying kinetic mechanisms of metabolism regulation. Since existing tools are restricted by the isotopic steady state and remain disconnected from the underlying kinetic mechanisms, we have recently developed a novel approach for the analysis of tracer-based metabolomic data that meets these requirements. The present contribution describes the last step of this development: implementation of (i) the algorithms for the determination of the kinetic parameters and respective metabolic fluxes consistent with the experimental data and (ii) statistical analysis of both fluxes and parameters, thereby lending it a practical application. Results: The C++ applications package for dynamic isotopomer distribution data analysis was supplemented by (i) five distinct methods for resolving a large system of differential equations; (ii) the 'simulated annealing' algorithm adopted to estimate the set of parameters and metabolic fluxes, which corresponds to the global minimum of the difference between the computed and measured isotopomer distributions; and (iii) the algorithms for statistical analysis of the estimated parameters and fluxes, which use the covariance matrix evaluation, as well as Monte Carlo simulations. An example of using this tool for the analysis of 13C distribution in the metabolites of glucose degradation pathways has demonstrated the evaluation of optimal set of parameters and fluxes consistent with the experimental pattern, their range and statistical significance, and also the advantages of using dynamic rather than the usual steady-state method of analysis. © 2006 Oxford University Press.",
                "authors": [
                    {
                        "name": "Selivanov V.A."
                    },
                    {
                        "name": "Marin S."
                    },
                    {
                        "name": "Lee P.W.N."
                    },
                    {
                        "name": "Cascante M."
                    }
                ],
                "citationCount": 29,
                "date": "2006-11-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Software for dynamic analysis of tracer-based metabolomic data: Estimation of metabolic fluxes and their statistical analysis"
            },
            "pmid": "17000750",
            "type": [
                "Method"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Fluxomics",
            "uri": "http://edamontology.org/topic_3955"
        }
    ],
    "version": [
        "1.0"
    ]
}