{
    "additionDate": "2017-02-10T14:15:40Z",
    "biotoolsCURIE": "biotools:promateus",
    "biotoolsID": "promateus",
    "credit": [
        {
            "email": "asaf.carmi@weizmann.ac.il",
            "name": "Asaf Carmi",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "mati.cohen@weizmann.ac.il",
            "name": "Mati Cohen",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "dana.reichmann@weizmann.ac.il",
            "name": "Dana Reichmann",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "Jaime.Prilusky@weizmann.ac.il",
            "name": "Jaimie Prilusky",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "ProMateus extends ProMate, a protein binding site predictor, and allows the user to suggest new features that might improve the prediction of the binding site locations.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://bioportal.weizmann.ac.il/promate/ProMateusShortHelp.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Peak calling",
                    "uri": "http://edamontology.org/operation_3222"
                },
                {
                    "term": "Transcription factor binding site prediction",
                    "uri": "http://edamontology.org/operation_0445"
                },
                {
                    "term": "Protein binding site prediction",
                    "uri": "http://edamontology.org/operation_2575"
                },
                {
                    "term": "Protein feature detection",
                    "uri": "http://edamontology.org/operation_3092"
                }
            ]
        }
    ],
    "homepage": "http://bioportal.weizmann.ac.il/promate/",
    "homepage_status": 1,
    "lastUpdate": "2018-12-10T12:58:56Z",
    "name": "ProMateus",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "Is the whole protein surface available for interaction with other proteins, or are specific sites pre-assigned according to their biophysical and structural character? And if so, is it possible to predict the location of the binding site from the surface properties? These questions are answered quantitatively by probing the surfaces of proteins using spheres of radius of 10Å on a database (DB) of 57 unique, non-homologous proteins involved in heteromeric, transient protein-protein interactions for which the structures of both the unbound and bound states were determined. In structural terms, we found the binding site to have a preference for β-sheets and for relatively long non-structured chains, but not for α-helices. Chemically, aromatic side-chains show a clear preference for binding sites. While the hydrophobic and polar content of the interface is similar to the rest of the surface, hydrophobic and polar residues tend to cluster in interfaces. In the crystal, the binding site has more bound water molecules surrounding it, and a lower B-factor already in the unbound protein. The same biophysical properties were found to hold for the unbound and bound DBs. All the significant interface properties were combined into ProMate, an interface prediction program. This was followed by an optimization step to choose the best combination of properties, as many of them are correlated. During optimization and prediction, the tested proteins were not used for data collection, to avoid over-fitting. The prediction algorithm is fully automated, and is used to predict the location of potential binding sites on unbound proteins with known structures. The algorithm is able to successfully predict the location of the interface for about 70% of the proteins. The success rate of the predictor was equal whether applied on the unbound DB or on the disjoint bound DB. A prediction is assumed correct if over half of the predicted continuous interface patch is indeed interface. The ability to predict the location of protein-protein interfaces has far reaching implications both towards our understanding of specificity and kinetics of binding, as well as in assisting in the analysis of the proteome. © 2004 Elsevier Ltd. All rights reserved.",
                "authors": [
                    {
                        "name": "Neuvirth H."
                    },
                    {
                        "name": "Raz R."
                    },
                    {
                        "name": "Schreiber G."
                    }
                ],
                "citationCount": 347,
                "date": "2004-04-16T00:00:00Z",
                "journal": "Journal of Molecular Biology",
                "title": "ProMate: A structure based prediction program to identify the location of protein-protein binding sites"
            },
            "pmid": "15050833"
        },
        {
            "metadata": {
                "abstract": "The development of bioinformatic tools by individual labs results in the abundance of parallel programs for the same task. For example, identification of binding site regions between interacting proteins is done using: ProMate, WHISCY, PPI-Pred, PINUP and others. All servers first identify unique properties of binding sites and then incorporate them into a predictor. Obviously, the resulting prediction would improve if the most suitable parameters from each of those predictors would be incorporated into one server. However, because of the variation in methods and databases, this is currently not feasible. Here, the protein-binding site prediction server is extended into a general protein-binding sites research tool, ProMateus. This web tool, based on ProMate's infrastructure enables the easy exploration and incorporation of new features and databases by the user, providing an evaluation of the benefit of individual features and their combination within a set framework. This transforms the individual research into a community exercise, bringing out the best from all users for optimized predictions. The analysis is demonstrated on a database of protein protein and protein-DNA interactions. This approach is basically different from that used in generating meta-servers. The implications of the open-research approach are discussed. ProMateus is available at http://bip.weizmann.ac.il/promate. © 2007 The Author(s).",
                "authors": [
                    {
                        "name": "Neuvirth H."
                    },
                    {
                        "name": "Heinemann U."
                    },
                    {
                        "name": "Birnbaum D."
                    },
                    {
                        "name": "Tishby N."
                    },
                    {
                        "name": "Schreiber G."
                    }
                ],
                "citationCount": 20,
                "date": "2007-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "ProMateus-an open research approach to protein-binding sites analysis"
            },
            "pmid": "17488838"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Protein binding sites",
            "uri": "http://edamontology.org/topic_3534"
        },
        {
            "term": "Nucleic acid sites, features and motifs",
            "uri": "http://edamontology.org/topic_3511"
        },
        {
            "term": "DNA binding sites",
            "uri": "http://edamontology.org/topic_3125"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        }
    ],
    "validated": 1
}