{
    "accessibility": [],
    "additionDate": "2017-01-13T13:15:09Z",
    "biotoolsCURIE": "biotools:issake",
    "biotoolsID": "issake",
    "collectionID": [],
    "confidence_flag": null,
    "cost": null,
    "credit": [
        {
            "email": "rwarren@bcgsc.ca",
            "gridid": null,
            "name": "R.L. Warren",
            "note": null,
            "orcidid": null,
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": null
        }
    ],
    "description": "Short Sequence Assembly by K-mer search and 3' read Extension, Immunology version (iSSAKE)",
    "documentation": [],
    "download": [],
    "editPermission": {
        "authors": [],
        "type": "private"
    },
    "elixirNode": [],
    "elixirPlatform": [],
    "elixir_badge": 0,
    "function": [
        {
            "cmd": null,
            "input": [],
            "note": null,
            "operation": [
                {
                    "term": "Sequence assembly",
                    "uri": "http://edamontology.org/operation_0310"
                }
            ],
            "output": []
        }
    ],
    "homepage": "https://github.com/brwnj/repertoire/blob/master/assembly/iSSAKE",
    "homepage_status": 0,
    "language": [
        "Perl",
        "Python"
    ],
    "lastUpdate": "2018-12-10T12:58:47Z",
    "license": "GPL-2.0",
    "link": [],
    "maturity": "Legacy",
    "name": "ISSAKE",
    "operatingSystem": [],
    "otherID": [],
    "owner": "seqwiki_import",
    "publication": [
        {
            "doi": null,
            "metadata": {
                "abstract": "Motivation: T-cell receptor (TCR) diversity in peripheral blood has not yet been fully profiled with sequence level resolution. Each T-cell clonotype expresses a unique receptor, generated by somatic recombination of TCR genes and the enormous potential for T-cell diversity makes repertoire analysis challenging. We developed a sequencing approach and assembly software (immuno-SSAKE or iSSAKE) for profiling T-cell metagenomes using short reads from the massively parallel sequencing platforms. Results: Models of sequence diversity for the TCRβ-chain CDR3 region were built using empirical data and used to simulate, at random, distinct TCR clonotypes at 1 - 20 p.p.m. Using simulated TCRβ (sTCRβ) sequences, we randomly created 20 million 36 nt reads having 1 - 2% random error, 20 million 42 or 50 nt reads having 1% random error and 20 million 36 nt reads with 1% error modeled on real short read data. Reads aligning to the end of known TCR variable (V) genes and having consecutive unmatched bases in the adjacent CDR3 were used to seed iSSAKE de novo assemblies of CDR3. With assembled 36 nt reads, we detect over 51% and 63% of rare (1 p.p.m.) clonotypes using a random or modeled error distribution, respectively. We detect over 99% of more abundant clonotypes (6 p.p.m. or higher) using either error distribution. Longer reads improve sensitivity, with assembled 42 and 50 nt reads identifying 82.0% and 94.7% of rare 1 p.p.m. clonotypes, respectively. Our approach illustrates the feasibility of complete profiling of the TCR repertoire using new massively parallel short read sequencing technology. © The Author 2009. Published by Oxford University Press. All rights reserved.",
                "authors": [
                    {
                        "name": "Warren R.L."
                    },
                    {
                        "name": "Nelson B.H."
                    },
                    {
                        "name": "Holt R.A."
                    }
                ],
                "citationCount": 30,
                "date": "2009-02-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Profiling model T-cell metagenomes with short reads"
            },
            "note": null,
            "pmcid": null,
            "pmid": "19136549",
            "type": null,
            "version": null
        }
    ],
    "relation": [],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        }
    ],
    "validated": 1,
    "version": []
}