{
    "accessibility": "Open access",
    "additionDate": "2023-03-06T10:30:37.888943Z",
    "biotoolsCURIE": "biotools:phyldiag",
    "biotoolsID": "phyldiag",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "hrc@bio.ens.psl.eu",
            "name": "Hugues Roest Crollius",
            "orcidid": "http://orcid.org/0000-0002-8209-173X",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://www.ibens.ens.fr/spip.php?article221"
        },
        {
            "email": "jlucas@biologie.ens.fr",
            "name": "Joseph MEX Lucas",
            "typeEntity": "Person",
            "typeRole": [
                "Developer"
            ]
        },
        {
            "name": "IBENS - DYOGEN Team",
            "typeEntity": "Institute",
            "url": "https://www.ibens.ens.fr/spip.php?rubrique43"
        }
    ],
    "description": "PhylDiag computes synteny blocs between two genomes. From the comparison of two extant genomes and corresponding gene families, PhylDiag detects conserved segments, i.e. segments of chromosomes unbroken during evolution.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genome analysis",
                    "uri": "http://edamontology.org/operation_3918"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Genome comparison",
                    "uri": "http://edamontology.org/operation_3209"
                }
            ]
        }
    ],
    "homepage": "https://github.com/DyogenIBENS/PhylDiag",
    "language": [
        "Python",
        "Shell"
    ],
    "lastUpdate": "2023-03-06T10:41:14.539429Z",
    "license": "CECILL-2.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/DyogenIBENS/PhylDiag"
        }
    ],
    "maturity": "Emerging",
    "name": "PhylDiag",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "alouis",
    "publication": [
        {
            "doi": "10.1186/1471-2105-15-268",
            "metadata": {
                "abstract": "Background: Extant genomes share regions where genes have the same order and orientation, which are thought to arise from the conservation of an ancestral order of genes during evolution. Such regions of so-called conserved synteny, or synteny blocks, must be precisely identified and quantified, as a prerequisite to better understand the evolutionary history of genomes.Results: Here we describe PhylDiag, a software that identifies statistically significant synteny blocks in pairwise comparisons of eukaryote genomes. Compared to previous methods, PhylDiag uses gene trees to define gene homologies, thus allowing gene deletions to be considered as events that may break the synteny. PhylDiag also accounts for gene orientations, blocks of tandem duplicates and lineage specific de novo gene births. Starting from two genomes and the corresponding gene trees, PhylDiag returns synteny blocks with gaps less than or equal to the maximum gap parameter gapmax. This parameter is theoretically estimated, and together with a utility to graphically display results, contributes to making PhylDiag a user friendly method. In addition, putative synteny blocks are subject to a statistical validation to verify that they are unlikely to be due to a random combination of genes.Conclusions: We benchmark several known metrics to measure 2D-distances in a matrix of homologies and we compare PhylDiag to i-ADHoRe 3.0 on real and simulated data. We show that PhylDiag correctly identifies small synteny blocks even with insertions, deletions, incorrect annotations or micro-inversions. Finally, PhylDiag allowed us to identify the most relevant distance metric for 2D-distance calculation between homologies.",
                "authors": [
                    {
                        "name": "Crollius H.R."
                    },
                    {
                        "name": "Lucas J.M.E.X."
                    },
                    {
                        "name": "Muffato M."
                    }
                ],
                "citationCount": 8,
                "date": "2014-08-08T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "PhylDiag: Identifying complex synteny blocks that include tandem duplications using phylogenetic gene trees"
            },
            "pmcid": "PMC4155083",
            "pmid": "25103980",
            "type": [
                "Primary"
            ]
        },
        {
            "doi": "10.1371/journal.pone.0180198",
            "metadata": {
                "abstract": "A conserved segment, i.e. a segment of chromosome unbroken during evolution, is an important operational concept in comparative genomics. Until now, algorithms that are designed to identify conserved segments often return synteny blocks that overlap, synteny blocks that include micro-rearrangements or synteny blocks erroneously short. Here we present definitions of conserved segments and synteny blocks independent of any heuristic method and we describe four new post-processing strategies to refine synteny blocks into accurate conserved segments. The first strategy identifies micro-rearrangements, the second strategy identifies mono-genic conserved segments, the third returns non-overlapping segments and the fourth repairs incorrect ruptures of synteny. All these refinements are implemented in a new version of PhylDiag that has been benchmarked against i-ADHoRe 3.0 and Cyntenator, based on a realistic simulated evolution and true simulated conserved segments.",
                "authors": [
                    {
                        "name": "Crollius H.R."
                    },
                    {
                        "name": "Lucas J.M.E.X."
                    }
                ],
                "citationCount": 2,
                "date": "2017-07-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "High precision detection of conserved segments from synteny blocks"
            },
            "pmcid": "PMC5495381",
            "pmid": "28671949",
            "type": [
                "Primary"
            ]
        }
    ],
    "relation": [
        {
            "biotoolsID": "genomicus",
            "type": "usedBy"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Comparative genomics",
            "uri": "http://edamontology.org/topic_0797"
        }
    ]
}
