{
    "accessibility": "Open access",
    "additionDate": "2022-12-31T15:51:53.047663Z",
    "biotoolsCURIE": "biotools:genecloudomics",
    "biotoolsID": "genecloudomics",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "Kumar_Selvarajoo@bii.a-star.edu.sg",
            "name": "Kumar Selvarajoo",
            "typeEntity": "Person"
        },
        {
            "email": "mohamed_helmy@bii.a-star.edu.sg",
            "name": "Mohamed Helmy",
            "typeEntity": "Person"
        },
        {
            "name": "Rahul Agrawal"
        },
        {
            "name": "Thuy Tien Bui"
        }
    ],
    "description": "A Data Analytic Cloud Platform for High-Throughput Gene Expression Analysis.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://github.com/buithuytien/GeneCloudOmics/blob/master/GeneCloudOmics_Help_1.0.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Expression correlation analysis",
                    "uri": "http://edamontology.org/operation_3463"
                },
                {
                    "term": "Expression data visualisation",
                    "uri": "http://edamontology.org/operation_0571"
                },
                {
                    "term": "Gene expression profiling",
                    "uri": "http://edamontology.org/operation_0314"
                },
                {
                    "term": "Gene-set enrichment analysis",
                    "uri": "http://edamontology.org/operation_2436"
                }
            ]
        }
    ],
    "homepage": "http://combio-sifbi.org/GeneCloudOmics/",
    "language": [
        "Python",
        "R"
    ],
    "lastUpdate": "2024-11-24T15:14:12.818466Z",
    "license": "Not licensed",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/cbio-astar-tools/GeneCloudOmics"
        }
    ],
    "name": "GeneCloudOmics",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.3389/fbinf.2021.693836",
            "metadata": {
                "abstract": "Gene expression profiling techniques, such as DNA microarray and RNA-Sequencing, have provided significant impact on our understanding of biological systems. They contribute to almost all aspects of biomedical research, including studying developmental biology, host-parasite relationships, disease progression and drug effects. However, the high-throughput data generations present challenges for many wet experimentalists to analyze and take full advantage of such rich and complex data. Here we present GeneCloudOmics, an easy-to-use web server for high-throughput gene expression analysis that extends the functionality of our previous ABioTrans with several new tools, including protein datasets analysis, and a web interface. GeneCloudOmics allows both microarray and RNA-Seq data analysis with a comprehensive range of data analytics tools in one package that no other current standalone software or web-based tool can do. In total, GeneCloudOmics provides the user access to 23 different data analytical and bioinformatics tasks including reads normalization, scatter plots, linear/non-linear correlations, PCA, clustering (hierarchical, k-means, t-SNE, SOM), differential expression analyses, pathway enrichments, evolutionary analyses, pathological analyses, and protein-protein interaction (PPI) identifications. Furthermore, GeneCloudOmics allows the direct import of gene expression data from the NCBI Gene Expression Omnibus database. The user can perform all tasks rapidly through an intuitive graphical user interface that overcomes the hassle of coding, installing tools/packages/libraries and dealing with operating systems compatibility and version issues, complications that make data analysis tasks challenging for biologists. Thus, GeneCloudOmics is a one-stop open-source tool for gene expression data analysis and visualization. It is freely available at http://combio-sifbi.org/GeneCloudOmics.",
                "authors": [
                    {
                        "name": "Agrawal R."
                    },
                    {
                        "name": "Ali J."
                    },
                    {
                        "name": "Bui T.T."
                    },
                    {
                        "name": "Helmy M."
                    },
                    {
                        "name": "Selvarajoo K."
                    },
                    {
                        "name": "Soudy M."
                    }
                ],
                "citationCount": 4,
                "date": "2021-01-01T00:00:00Z",
                "journal": "Frontiers in Bioinformatics",
                "title": "GeneCloudOmics: A Data Analytic Cloud Platform for High-Throughput Gene Expression Analysis"
            },
            "pmcid": "PMC9581002",
            "pmid": "36303746"
        },
        {
            "doi": "10.1007/978-1-0716-2617-7_12",
            "metadata": {
                "abstract": "Research in synthetic biology and metabolic engineering require a deep understanding on the function and regulation of complex pathway genes. This can be achieved through gene expression profiling which quantifies the transcriptome-wide expression under any condition, such as a cell development stage, mutant, disease, or treatment with a drug. The expression profiling is usually done using high-throughput techniques such as RNA sequencing (RNA-Seq) or microarray. Although both methods are based on different technical approaches, they provide quantitative measures of the expression levels of thousands of genes. The expression levels of the genes are compared under different conditions to identify the differentially expressed genes (DEGs), the genes with different expression levels under different conditions. DEGs, usually involving thousands in number, are then investigated using bioinformatics and data analytic tools to infer and compare their functional roles between conditions. Dealing with such large datasets, therefore, requires intensive data processing and analyses to ensure its quality and produce results that are statistically sound. Thus, there is a need for deep statistical and bioinformatics knowledge to deal with high-throughput gene expression data. This represents a barrier for wet biologists with limited computational, programming, and data analytic skills that prevent them from getting the full potential of the data. In this chapter, we present a step-by-step protocol to perform transcriptome analysis using GeneCloudOmics, a cloud-based web server that provides an end-to-end platform for high-throughput gene expression analysis.",
                "authors": [
                    {
                        "name": "Helmy M."
                    },
                    {
                        "name": "Selvarajoo K."
                    }
                ],
                "date": "2023-01-01T00:00:00Z",
                "journal": "Methods in Molecular Biology",
                "title": "Application of GeneCloudOmics: Transcriptomic Data Analytics for Synthetic Biology"
            },
            "pmid": "36227547"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        },
        {
            "term": "Synthetic biology",
            "uri": "http://edamontology.org/topic_3895"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ],
    "validated": 1
}
