{
    "accessibility": "Open access",
    "additionDate": "2022-06-25T07:57:55.317926Z",
    "biotoolsCURIE": "biotools:deepcage",
    "biotoolsID": "deepcage",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "ruijiang@tsinghua.edu.cn",
            "name": "Rui Jiang"
        },
        {
            "name": "Qiao Liu"
        }
    ],
    "description": "Incorporating transcription factors in genome-wide prediction of chromatin accessibility.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                },
                {
                    "term": "Transcriptional regulatory element prediction",
                    "uri": "http://edamontology.org/operation_0438"
                },
                {
                    "term": "Variant prioritisation",
                    "uri": "http://edamontology.org/operation_3226"
                }
            ]
        }
    ],
    "homepage": "https://github.com/kimmo1019/DeepCAGE",
    "language": [
        "Python",
        "Shell"
    ],
    "lastUpdate": "2024-11-24T16:01:30.955649Z",
    "license": "MIT",
    "name": "DeepCAGE",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1016/j.gpb.2021.08.015",
            "metadata": {
                "abstract": "Although computational approaches have been complementing high-throughput biological experiments for the identification of functional regions in the human genome, it remains a great challenge to systematically decipher interactions between transcription factors (TFs) and regulatory elements to achieve interpretable annotations of chromatin accessibility across diverse cellular contexts. To solve this problem, we propose DeepCAGE, a deep learning framework that integrates sequence information and binding statuses of TFs, for the accurate prediction of chromatin accessible regions at a genome-wide scale in a variety of cell types. DeepCAGE takes advantage of a densely connected deep convolutional neural network architecture to automatically learn sequence signatures of known chromatin accessible regions and then incorporates such features with expression levels and binding activities of human core TFs to predict novel chromatin accessible regions. In a series of systematic comparisons with existing methods, DeepCAGE exhibits superior performance in not only the classification but also the regression of chromatin accessibility signals. In a detailed analysis of TF activities, DeepCAGE successfully extracts novel binding motifs and measures the contribution of a TF to the regulation with respect to a specific locus in a certain cell type. When applied to whole-genome sequencing data analysis, our method successfully prioritizes putative deleterious variants underlying a human complex trait and thus provides insights into the understanding of disease-associated genetic variants. DeepCAGE can be downloaded from https://github.com/kimmo1019/DeepCAGE.",
                "authors": [
                    {
                        "name": "Hua K."
                    },
                    {
                        "name": "Jiang R."
                    },
                    {
                        "name": "Liu Q."
                    },
                    {
                        "name": "Wong W.H."
                    },
                    {
                        "name": "Zhang X."
                    }
                ],
                "citationCount": 6,
                "date": "2022-06-01T00:00:00Z",
                "journal": "Genomics, Proteomics and Bioinformatics",
                "title": "DeepCAGE: Incorporating Transcription Factors in Genome-wide Prediction of Chromatin Accessibility"
            },
            "pmcid": "PMC9801045",
            "pmid": "35293310"
        }
    ],
    "toolType": [
        "Workbench"
    ],
    "topic": [
        {
            "term": "Chromosome conformation capture",
            "uri": "http://edamontology.org/topic_3940"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ],
    "validated": 1
}
