{
    "additionDate": "2021-03-19T09:17:41Z",
    "biotoolsCURIE": "biotools:badgerfilm",
    "biotoolsID": "badgerfilm",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "amoy6@wisc.edu",
            "name": "Aurélien Moy",
            "orcidid": "https://orcid.org/0000-0001-7020-3776",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "name": "John Fournelle",
            "orcidid": "https://orcid.org/0000-0003-2753-1891",
            "typeEntity": "Person"
        }
    ],
    "description": "BadgerFilm is a tool which can calculate thickness(es) and composition(s) of thin films as well as composition of the substrate.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Aurelien354/BadgerFilm",
    "language": [
        "Visual Basic"
    ],
    "lastUpdate": "2021-04-11T12:33:18.445535Z",
    "name": "BadgerFilm",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1017/S1431927620024927",
            "metadata": {
                "abstract": "© 2021 World Scientific Publishing Co. Pte Ltd. All rights reserved.Since the 1960s, thicknesses and compositions of thin-film specimens have been determined by using the nondestructive technique of electron probe microanalysis. This approach, refined in the 1990s, is based upon models of the ionization depth distribution, the so-called φ(ρz) distribution, and is capable of analyzing layered specimens. Most of these quantification models have led to commercial programs. However, these programs may have possible limitations: some may not be directly compatible with modern computers, they often are \"black boxes\" making it difficult to assess the reliability of the results, and they are sometimes expensive enough to restrain many labs from purchasing them. We present a user-friendly, free, open-source program, BadgerFilm, implementing a documented φ(ρz) model and algorithms allowing the quantification of stratified samples. The program has the ability to calculate absolute X-ray intensities that can be directly compared with Monte Carlo simulations. We give a detailed explanation for the operation of the employed φ(ρz) model in thin films. A wide range of detailed Monte Carlo simulations and experimental data have been used to evaluate and validate the accuracy of the implemented algorithms. BadgerFilm demonstrated excellent quantification results for the films and in many cases for the substrates.",
                "authors": [
                    {
                        "name": "Moy A."
                    },
                    {
                        "name": "Fournelle J."
                    }
                ],
                "citationCount": 1,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Microscopy and Microanalysis",
                "title": "φ (ρz) Distributions in Bulk and Thin-Film Samples for EPMA. Part 2: BadgerFilm: A New Thin-Film Analysis Program"
            },
            "pmid": "33536112"
        },
        {
            "doi": "10.1017/S1431927620024915",
            "metadata": {
                "abstract": "© 2021 Cambridge University Press. All rights reserved.Electron probe microanalysis is a nondestructive technique widely used to determine the elemental composition of bulk samples. This was extended to layered specimens, with the development of appropriate software. The traditional quantification method requires the use of matrix correction procedures based upon models of the ionization depth distribution, the so-called f(?z) distribution. Most of these models have led to commercial quantification programs but only few of them allow the quantification of layered specimens. Therefore, we developed BadgerFilm, a free open-source thin film program available to the general public. This program implements a documented f(?z) model as well as algorithms to calculate fluorescence in bulk and thin film samples. Part 1 of the present work aims at describing the operation of the implemented f(?z) distribution model and validating its implementation against experimental measurements and Monte Carlo simulations on bulk samples. The program has the ability to predict absolute X-ray intensities that can be directly compared to Monte Carlo simulations. We demonstrate that the implemented model works very well for bulk materials. And as will be shown in Part 2, BadgerFilm predictions for thin film specimens are also shown to be in good agreements with experimental and Monte Carlo results.",
                "authors": [
                    {
                        "name": "Moy A."
                    },
                    {
                        "name": "Fournelle J."
                    }
                ],
                "citationCount": 1,
                "date": "2021-01-01T00:00:00Z",
                "journal": "Microscopy and Microanalysis",
                "title": "f (?z) Distributions in Bulk and Thin Film Samples for EPMA. Part 1: A Modified f (?z) Distribution for Bulk Materials, including Characteristic and Bremsstrahlung Fluorescence"
            },
            "pmid": "33551014"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Electron microscopy",
            "uri": "http://edamontology.org/topic_0611"
        },
        {
            "term": "X-ray diffraction",
            "uri": "http://edamontology.org/topic_2828"
        },
        {
            "term": "Probes and primers",
            "uri": "http://edamontology.org/topic_0632"
        }
    ]
}