{"credit":[{"email":"cnvallej@uc.cl","name":"Catalina A. Vallejos","typeEntity":"Person","typeRoles":["Primary contact"]},{"email":"eling@ebi.ac.uk","name":"Nils Eling","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"url":"http://bioconductor.org/packages/release/bioc/manuals/BASiCS/man/BASiCS.pdf"}],"download":[{"url":"http://bioconductor.org/packages/release/bioc/src/contrib/BASiCS_1.2.1.tar.gz"}],"function":[{"operation":[{"term":"Standardisation and normalisation","uri":"http://edamontology.org/operation_3435"}]},{"operation":[{"term":"Differential gene expression analysis","uri":"http://edamontology.org/operation_3223"}]}],"labels":{"collectionID":["BioConductor"],"language":["R"],"license":"GPL-2.0","operatingSystem":["Linux","Windows","Mac"],"toolType":["Library"],"topic":[{"term":"Cell biology","uri":"http://edamontology.org/topic_2229"},{"term":"Gene expression","uri":"http://edamontology.org/topic_0203"},{"term":"RNA-seq","uri":"http://edamontology.org/topic_3170"},{"term":"Sequencing","uri":"http://edamontology.org/topic_3168"},{"term":"Transcriptomics","uri":"http://edamontology.org/topic_3308"}]},"link":[{"type":"MIRROR","url":"https://github.com/catavallejos/BASiCS"},{"type":"ISSUE_TRACKER","url":"https://github.com/catavallejos/BASiCS/issues"},{"type":"MIRROR","url":"http://bioconductor.org/packages/BASiCS/"}],"publication":[{"abstract":"© 2015 Vallejos et al. Single-cell mRNA sequencing can uncover novel cell-to-cell heterogeneity in gene expression levels in seemingly homogeneous populations of cells. However, these experiments are prone to high levels of unexplained technical noise, creating new challenges for identifying genes that show genuine heterogeneous expression within the population of cells under study. BASiCS (Bayesian Analysis of Single-Cell Sequencing data) is an integrated Bayesian hierarchical model where: (i) cell-specific normalisation constants are estimated as part of the model parameters, (ii) technical variability is quantified based on spike-in genes that are artificially introduced to each analysed cell’s lysate and (iii) the total variability of the expression counts is decomposed into technical and biological components. BASiCS also provides an intuitive detection criterion for highly (or lowly) variable genes within the population of cells under study. This is formalised by means of tail posterior probabilities associated to high (or low) biological cell-to-cell variance contributions, quantities that can be easily interpreted by users. We demonstrate our method using gene expression measurements from mouse Embryonic Stem Cells. Cross-validation and meaningful enrichment of gene ontology categories within genes classified as highly (or lowly) variable supports the efficacy of our approach.","authors":["Vallejos C.A.","Marioni J.C.","Richardson S."],"cit_count":60,"doi":"10.1371/journal.pcbi.1004333","journal":"PLoS Computational Biology","title":"BASiCS: Bayesian Analysis of Single-Cell Sequencing Data","type":"Primary","year":"2015-06-24"},{"abstract":"© 2016 Vallejos et al. Traditional differential expression tools are limited to detecting changes in overall expression, and fail to uncover the rich information provided by single-cell level data sets. We present a Bayesian hierarchical model that builds upon BASiCS to study changes that lie beyond comparisons of means, incorporating built-in normalization and quantifying technical artifacts by borrowing information from spike-in genes. Using a probabilistic approach, we highlight genes undergoing changes in cell-to-cell heterogeneity but whose overall expression remains unchanged. Control experiments validate our method's performance and a case study suggests that novel biological insights can be revealed. Our method is implemented in R and available at https://github.com/catavallejos/BASiCS.","authors":["Vallejos C.A.","Richardson S.","Marioni J.C."],"cit_count":33,"doi":"10.1186/s13059-016-0930-3","journal":"Genome Biology","title":"Beyond comparisons of means: Understanding changes in gene expression at the single-cell level","type":"Other","year":"2016-04-15"},{"doi":"10.1101/237214","type":"Other"}],"summary":{"biotoolsCURIE":"biotools:basics","biotoolsID":"basics","description":"Bayesian Analysis of Single-Cell Sequencing data is an integrated Bayesian hierarchical model to perform statistical analyses of single-cell RNA sequencing datasets in the context of supervised experiments. It could perform built-in data normalisation and technical noise quantification. BASiCS provides an intuitive detection criterion for highly variable genes within a single group of cells. Also, it can compare gene expression patterns between two or more pre-specified groups of cells.","homepage":"http://bioconductor.org/packages/release/bioc/html/BASiCS.html","name":"BASiCS","version":["1.2.1"]}}