{"credit":[{"typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://www.bioprofiling.de/contact_us.html"}],"documentation":[{"type":"GENERAL","url":"http://www.bioprofiling.de/GEO/PPISURV/ppisurv.tutorial.html"}],"function":[{"operation":[{"term":"Pathway or network prediction","uri":"http://edamontology.org/operation_3439"}]}],"labels":{"operatingSystem":["Linux","Windows","Mac"],"toolType":["Web application"],"topic":[{"term":"Oncology","uri":"http://edamontology.org/topic_2640"},{"term":"Functional, regulatory and non-coding RNA","uri":"http://edamontology.org/topic_0659"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/ppisurv-cancer-survival-analyses.html"}],"publication":[{"abstract":"Multiple clinical studies have correlated gene expression with survival outcome in cancer on a genome-wide scale. However, in many cases, no obvious correlation between expression of well-known tumour-related genes (that is, p53, p73 and p21) and survival rates of patients has been observed. This can be mainly explained by the complex molecular mechanisms involved in cancer, which mask the clinical relevance of a gene with multiple functions if only gene expression status is considered. As we demonstrate here, in many such cases, the expression of the gene interaction partners (gene 'interactome') correlates significantly with cancer survival and is indicative of the role of that gene in cancer. On the basis of this principle, we have implemented a free online datamining tool (http://www.bioprofiling.de/PPISURV). PPISURV automatically correlates expression of an input gene interactome with survival rates on >40 publicly available clinical expression data sets covering various tumours involving about 8000 patients in total. To derive the query gene interactome, PPISURV employs several public databases including protein-protein interactions, regulatory and signalling pathways and protein post-translational modifications. © 2014 Macmillan Publishers Limited.","authors":["Antonov A.V.","Krestyaninova M.","Knight R.A.","Rodchenkov I.","Melino G.","Barlev N.A."],"cit_count":38,"journal":"Oncogene","pmid":"23686313","title":"PPISURV: A novel bioinformatics tool for uncovering the hidden role of specific genes in cancer survival outcome","year":"2014-03-27"}],"summary":{"biotoolsCURIE":"biotools:ppisurv","biotoolsID":"ppisurv","description":"Novel bioinformatics tool for uncovering the hidden role of specific genes in cancer survival outcome.","homepage":"http://www.bioprofiling.de/GEO/PPISURV/ppisurv.html","name":"PPISURV"}}