{
    "additionDate": "2020-07-04T14:19:43Z",
    "biotoolsCURIE": "biotools:pdbinder",
    "biotoolsID": "pdbinder",
    "description": "PDBinder is a bioinformatic method for the prediction of small ligand binding sites in protein structures",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Protein features",
                        "uri": "http://edamontology.org/data_1277"
                    }
                },
                {
                    "data": {
                        "term": "Protein structure",
                        "uri": "http://edamontology.org/data_1460"
                    },
                    "format": [
                        {
                            "term": "protein",
                            "uri": "http://edamontology.org/format_1208"
                        }
                    ]
                }
            ],
            "operation": [
                {
                    "term": "Ligand-binding site prediction",
                    "uri": "http://edamontology.org/operation_3897"
                },
                {
                    "term": "Nucleic acids-binding site prediction",
                    "uri": "http://edamontology.org/operation_0420"
                },
                {
                    "term": "Protein-protein binding site prediction",
                    "uri": "http://edamontology.org/operation_2464"
                }
            ]
        }
    ],
    "homepage": "http://cbm.bio.uniroma2.it/pdbinder/",
    "lastUpdate": "2024-11-24T15:18:14.668324Z",
    "name": "PDBinder",
    "owner": "HelmerCitterich",
    "publication": [
        {
            "doi": "10.1186/1471-2105-13-s4-s17",
            "metadata": {
                "abstract": "Background: The identification of ligand binding sites is a key task in the annotation of proteins with known structure but uncharacterized function. Here we describe a knowledge-based method exploiting the observation that unrelated binding sites share small structural motifs that bind the same chemical fragments irrespective of the nature of the ligand as a whole.Results: PDBinder compares a query protein against a library of binding and non-binding protein surface regions derived from the PDB. The results of the comparison are used to derive a propensity value for each residue which is correlated with the likelihood that the residue is part of a ligand binding site. The method was applied to two different problems: i) the prediction of ligand binding residues and ii) the identification of which surface cleft harbours the binding site. In both cases PDBinder performed consistently better than existing methods.PDBinder has been trained on a non-redundant set of 1356 high-quality protein-ligand complexes and tested on a set of 239 holo and apo complex pairs. We obtained an MCC of 0.313 on the holo set with a PPV of 0.413 while on the apo set we achieved an MCC of 0.271 and a PPV of 0.372.Conclusions: We show that PDBinder performs better than existing methods. The good performance on the unbound proteins is extremely important for real-world applications where the location of the binding site is unknown. Moreover, since our approach is orthogonal to those used in other programs, the PDBinder propensity value can be integrated in other algorithms further increasing the final performance. © 2012 Bianchi et al.; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Ausiello G."
                    },
                    {
                        "name": "Bianchi V."
                    },
                    {
                        "name": "Gherardini P.F."
                    },
                    {
                        "name": "Helmer-Citterich M."
                    }
                ],
                "citationCount": 16,
                "date": "2012-03-28T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Identification of binding pockets in protein structures using a knowledge-based potential derived from local structural similarities"
            },
            "pmcid": "PMC3434446",
            "pmid": "22536963",
            "type": [
                "Method"
            ],
            "version": "1.0"
        }
    ],
    "topic": [
        {
            "term": "Protein binding sites",
            "uri": "http://edamontology.org/topic_3534"
        },
        {
            "term": "Protein structure analysis",
            "uri": "http://edamontology.org/topic_2814"
        },
        {
            "term": "Structure prediction",
            "uri": "http://edamontology.org/topic_0082"
        }
    ],
    "validated": 1
}
