{
    "additionDate": "2018-05-10T19:50:45Z",
    "biotoolsCURIE": "biotools:vas",
    "biotoolsID": "vas",
    "credit": [
        {
            "email": "kevinyip@cse.cuhk.edu.hk",
            "name": "Kevin Y Yip",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "A convenient web portal for efficient integration of genomic features with millions of genetic variants.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://yiplab.cse.cuhk.edu.hk/vas/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "SNP annotation",
                    "uri": "http://edamontology.org/operation_3661"
                }
            ]
        }
    ],
    "homepage": "https://yiplab.cse.cuhk.edu.hk/vas/",
    "language": [
        "PHP",
        "Python"
    ],
    "lastUpdate": "2018-12-10T12:58:58Z",
    "name": "VAS",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1186/1471-2164-15-886",
            "metadata": {
                "abstract": "© 2014 Ho et al.Background: High-throughput experimental methods have fostered the systematic detection of millions of genetic variants from any human genome. To help explore the potential biological implications of these genetic variants, software tools have been previously developed for integrating various types of information about these genomic regions from multiple data sources. Most of these tools were designed either for studying a small number of variants at a time, or for local execution on powerful machines. Results: To make exploration of whole lists of genetic variants simple and accessible, we have developed a new Web-based system called VAS (Variant Annotation System, available at https://yiplab.cse.cuhk.edu.hk/vas/). It provides a large variety of information useful for studying both coding and non-coding variants, including whole-genome transcription factor binding, open chromatin and transcription data from the ENCODE consortium. By means of data compression, millions of variants can be uploaded from a client machine to the server in less than 50 megabytes of data. On the server side, our customized data integration algorithms can efficiently link millions of variants with tens of whole-genome datasets. These two enabling technologies make VAS a practical tool for annotating genetic variants from large genomic studies. We demonstrate the use of VAS in annotating genetic variants obtained from a migraine meta-analysis study and multiple data sets from the Personal Genomes Project. We also compare the running time of annotating 6.4 million SNPs of the CEU trio by VAS and another tool, showing that VAS is efficient in handling new variant lists without requiring any pre-computations. Conclusions: VAS is specially designed to handle annotation tasks with long lists of genetic variants and large numbers of annotating features efficiently. It is complementary to other existing tools with more specific aims such as evaluating the potential impacts of genetic variants in terms of disease risk. We recommend using VAS for a quick first-pass identification of potentially interesting genetic variants, to minimize the time required for other more in-depth downstream analyses.",
                "authors": [
                    {
                        "name": "Ho E.D."
                    },
                    {
                        "name": "Cao Q."
                    },
                    {
                        "name": "Lee S.D."
                    },
                    {
                        "name": "Yip K.Y."
                    }
                ],
                "citationCount": 1,
                "date": "2014-01-01T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "VAS: A convenient web portal for efficient integration of genomic features with millions of genetic variants"
            },
            "pmcid": "PMC4210471",
            "pmid": "25306238"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Nucleic acid sites, features and motifs",
            "uri": "http://edamontology.org/topic_3511"
        }
    ],
    "validated": 1
}