{
    "additionDate": "2020-01-14T19:46:36Z",
    "biotoolsCURIE": "biotools:MiCA",
    "biotoolsID": "MiCA",
    "confidence_flag": "tool",
    "description": "An extended tool for microarray gene expression analysis.\n\nGene expression microarrays capture a complete image of all the transcriptional activity in a biological sample. Microarrays produce a large amount of data, which becomes a challenge when it comes to exploring and interpreting using modern computational and statistical tools. We propose the Microarray Analysis (MiCA) tool that outperforms other similar tools both in terms of ease of use and statistical features requiring minimal input to conduct an analysis. MiCA is an integrated, interactive, and streamlined desktop software for the analysis of microarray gene expression data. MiCA consists of a complete microarray analysis pipeline including but not limited to fetching data directly from GEO, normalization, interactive quality control, batch-effect correction, regression analysis, surrogate variable analysis and functional annotation methods such as GSVA using known existing R packages.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Validation",
                    "uri": "http://edamontology.org/operation_2428"
                },
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                },
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                }
            ]
        }
    ],
    "homepage": "http://irzamsarfraz.com/mica/",
    "language": [
        "R"
    ],
    "lastUpdate": "2020-12-28T10:31:24Z",
    "name": "MiCA",
    "owner": "irzamsarfraz",
    "publication": [
        {
            "doi": "10.1016/J.COMPBIOMED.2019.103561",
            "metadata": {
                "abstract": "© 2019 Elsevier LtdGene expression microarrays capture a complete image of all the transcriptional activity in a biological sample. Microarrays produce a large amount of data, which becomes a challenge when it comes to exploring and interpreting using modern computational and statistical tools. We propose the Microarray Analysis (MiCA) tool that outperforms other similar tools both in terms of ease of use and statistical features requiring minimal input to conduct an analysis. MiCA is an integrated, interactive, and streamlined desktop software for the analysis of microarray gene expression data. MiCA consists of a complete microarray analysis pipeline including but not limited to fetching data directly from GEO, normalization, interactive quality control, batch-effect correction, regression analysis, surrogate variable analysis and functional annotation methods such as GSVA using known existing R packages. We compare the features offered by MiCA and other similar tools while performing differential expression analysis using previously published datasets. MiCA offers additional statistical and visualization methods to conduct a microarray data analysis compared to other available microarray analysis tools. MiCA minimizes the need for technical knowledge by providing a very intuitive and versatile interface that integrates all necessary tasks and features required for basic microarray data analysis. We analyzed multiple published datasets and showed that the features offered by MiCA not only simplify the analysis pipeline but also provide additional interpretation to the data.",
                "authors": [
                    {
                        "name": "Sarfraz I."
                    },
                    {
                        "name": "Asif M."
                    },
                    {
                        "name": "Hijazi K."
                    }
                ],
                "date": "2020-01-01T00:00:00Z",
                "journal": "Computers in Biology and Medicine",
                "title": "MiCA: An extended tool for microarray gene expression analysis"
            },
            "pmid": "31785415"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        }
    ],
    "validated": 1
}