{
    "accessibility": "Open access",
    "additionDate": "2022-10-19T18:27:59.244951Z",
    "biotoolsCURIE": "biotools:gtftools",
    "biotoolsID": "gtftools",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Cui-Xiang Lin"
        },
        {
            "name": "Jiantao Zheng"
        },
        {
            "name": "Hong-Dong Li",
            "orcidid": "https://orcid.org/0000-0003-3438-739X"
        }
    ],
    "description": "A software package for analyzing various features of gene models.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "DNA binding site prediction",
                    "uri": "http://edamontology.org/operation_3903"
                },
                {
                    "term": "Splicing analysis",
                    "uri": "http://edamontology.org/operation_2499"
                }
            ]
        }
    ],
    "homepage": "http://www.genemine.org/gtftools.php",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T15:26:55.930485Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "https://bioconda.github.io/recipes/gtftools/README.html"
        }
    ],
    "name": "GTFtools",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btac561",
            "metadata": {
                "abstract": "Motivation: Gene-centric bioinformatics studies frequently involve the calculation or the extraction of various features of genes such as splice sites, promoters, independent introns and untranslated regions (UTRs) through manipulation of gene models. Gene models are often annotated in gene transfer format (GTF) files. The features are essential for subsequent analysis such as intron retention detection, DNA-binding site identification and computing splicing strength of splice sites. Some features such as independent introns and splice sites are not provided in existing resources including the commonly used BioMart database. A package that implements and integrates functions to analyze various features of genes will greatly ease routine analysis for related bioinformatics studies. However, to the best of our knowledge, such a package is not available yet. Results: We introduce GTFtools, a stand-alone command-line software that provides a set of functions to calculate various gene features, including splice sites, independent introns, transcription start sites (TSS)-flanking regions, UTRs, isoform coordination and length, different types of gene lengths, etc. It takes the ENSEMBL or GENCODE GTF files as input and can be applied to both human and non-human gene models like the lab mouse. We compare the utilities of GTFtools with those of two related tools: Bedtools and BioMart. GTFtools is implemented in Python and not dependent on any third-party software, making it very easy to install and use.",
                "authors": [
                    {
                        "name": "Li H.-D."
                    },
                    {
                        "name": "Lin C.-X."
                    },
                    {
                        "name": "Zheng J."
                    }
                ],
                "citationCount": 8,
                "date": "2022-10-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "GTFtools: a software package for analyzing various features of gene models"
            },
            "pmid": "36000853"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "RNA splicing",
            "uri": "http://edamontology.org/topic_3320"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ],
    "validated": 1
}
