{
    "additionDate": "2021-01-18T11:48:46Z",
    "biotoolsCURIE": "biotools:chemfluo",
    "biotoolsID": "chemfluo",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "chenxiangck@126.com",
            "name": "Xiang Chen",
            "typeEntity": "Person"
        },
        {
            "email": "oriental-cds@163.com",
            "name": "Dong-Sheng Cao",
            "typeEntity": "Person"
        },
        {
            "email": "tingjunhou@zju.edu.cn",
            "name": "Ting-Jun Hou",
            "typeEntity": "Person"
        }
    ],
    "description": "ChemFLuo is a web-server for structure analysis and identification of fluorescent compounds. Fluorescent detection methods are indispensable tools for chemical biology. However, the undesirable effect induced by fluorescent compound interference has produced many false positive results, thus hampering the efficiency of drug development. In order to prescreen potential fluorescent interferences, we build a reliable prediction model based on a large data set. ChemFluo is a public webserver which could be useful to flag blue and green fluorescent compounds in large dataset.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Fold recognition",
                    "uri": "http://edamontology.org/operation_0303"
                },
                {
                    "term": "Validation",
                    "uri": "http://edamontology.org/operation_2428"
                },
                {
                    "term": "Virtual screening",
                    "uri": "http://edamontology.org/operation_3938"
                }
            ]
        }
    ],
    "homepage": "http://admet.scbdd.com/chemfluo/index/",
    "lastUpdate": "2021-02-11T15:00:24Z",
    "name": "ChemFLuo",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/BIB/BBAA282",
            "metadata": {
                "abstract": "© The Author(s) 2020. Published by Oxford University Press. All rights reserved. For Permissions, please email: journals.permissions@oup.com.BACKGROUND: Fluorescent detection methods are indispensable tools for chemical biology. However, the frequent appearance of potential fluorescent compound has greatly interfered with the recognition of compounds with genuine activity. Such fluorescence interference is especially difficult to identify as it is reproducible and possesses concentration-dependent characteristic. Therefore, the development of a credible screening tool to detect fluorescent compounds from chemical libraries is urgently needed in early stages of drug discovery. RESULTS: In this study, we developed a webserver ChemFLuo for fluorescent compound detection, based on two large and high-quality training datasets containing 4906 blue and 8632 green fluorescent compounds. These molecules were used to construct a group of prediction models based on the combination of three machine learning algorithms and seven types of molecular representations. The best blue fluorescence prediction model achieved with balanced accuracy (BA) = 0.858 and area under the receiver operating characteristic curve (AUC) = 0.931 for the validation set, and BA = 0.823 and AUC = 0.903 for the test set. The best green fluorescence prediction model achieved the prediction accuracy with BA = 0.810 and AUC = 0.887 for the validation set, and BA = 0.771 and AUC = 0.852 for the test set. Besides prediction model, 22 blue and 16 green representative fluorescent substructures were summarized for the screening of potential fluorescent compounds. The comparison with other fluorescence detection tools and theapplication to external validation sets and large molecule libraries have demonstrated the reliability of prediction model for fluorescent compound detection. CONCLUSION: ChemFLuo is a public webserver to filter out compounds with undesirable fluorescent properties, which will benefit the design of high-quality chemical libraries for drug discovery. It is freely available at http://admet.scbdd.com/chemfluo/index/.",
                "authors": [
                    {
                        "name": "Cao D.-S."
                    },
                    {
                        "name": "Chen X."
                    },
                    {
                        "name": "Dong J."
                    },
                    {
                        "name": "Hou T.-J."
                    },
                    {
                        "name": "Jiang H.-L."
                    },
                    {
                        "name": "Lu A.-P."
                    },
                    {
                        "name": "Yang Z.-J."
                    },
                    {
                        "name": "Yang Z.-Y."
                    },
                    {
                        "name": "Yin M."
                    }
                ],
                "date": "2021-07-20T00:00:00Z",
                "journal": "Briefings in bioinformatics",
                "title": "ChemFLuo: a web-server for structure analysis and identification of fluorescent compounds"
            },
            "pmid": "33201188"
        }
    ],
    "topic": [
        {
            "term": "Chemical biology",
            "uri": "http://edamontology.org/topic_3369"
        },
        {
            "term": "Drug development",
            "uri": "http://edamontology.org/topic_3373"
        },
        {
            "term": "Drug discovery",
            "uri": "http://edamontology.org/topic_3336"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Molecular biology",
            "uri": "http://edamontology.org/topic_3047"
        }
    ]
}
