
{
    "credit": [
        {
            "email": "browning@stat.auckland.ac.nz",
            "name": "Sharon Browning",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://faculty.washington.edu/sguy/"
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://onlinelibrary.wiley.com/doi/10.1002/gepi.20051/abstract"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Genetic variation analysis",
                    "uri": "http://edamontology.org/operation_3197"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "R",
            "Perl",
            "C"
        ],
        "operatingSystem": [
            "Linux",
            "Mac"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "DNA polymorphism",
                "uri": "http://edamontology.org/topic_2885"
            },
            {
                "term": "Genetics",
                "uri": "http://edamontology.org/topic_3053"
            },
            {
                "term": "Sequence analysis",
                "uri": "http://edamontology.org/topic_0080"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://www.mybiosoftware.com/ccrel-0-3-case-control-association-analysis-rellated-individuals.html"
        }
    ],
    "publication": [
        {
            "abstract": "Related individuals collected for use in linkage studies may be used in case-control linkage disequilibrium analysis, provided one takes into account correlations between individuals due to identity-by-descent (IBD) sharing. We account for these correlations by calculating a weight for each individual. The weights are used in constructing a composite likelihood, which is maximized iteratively to form likelihood ratio tests for single-marker and haplotypic associations. The method scales well with increasing pedigree size and complexity, and is applicable to both autosomal and X chromosomes. We apply the approach to an analysis of association between type 2 diabetes and single-nucleotide polymorphism markers in the PPAR-γ gene. Simulated data are used to check validity of the test and examine power. Analysis of related cases has better power than analysis of population-based cases because of the increased frequencies of disease-susceptibility alleles in pedigrees with multiple cases compared to the frequencies of these alleles in population-based cases. Also, utilizing all cases in a pedigree rather than just one per pedigree improves power by increasing the effective sample size. We demonstrate that our method has power at least as great as that of several competing methods, while offering advantages in the ability to handle missing data and perform haplotypic analysis. © 2004 Wiley-Liss, Inc.",
            "authors": [
                "Browning S.R.",
                "Briley J.D.",
                "Briley L.P.",
                "Chandra G.",
                "Charnecki J.H.",
                "Ehm M.G.",
                "Johansson K.A.",
                "Jones B.J.",
                "Karter A.J.",
                "Yarnall D.P.",
                "Wagner M.J."
            ],
            "cit_count": 35,
            "journal": "Genetic Epidemiology",
            "pmid": "15578751",
            "title": "Case-control single-marker and haplotypic association analysis of pedigree data",
            "year": "2005-02-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:ccrel",
        "biotoolsID": "ccrel",
        "description": "Case-Control association analysis with RELlated individuals, is a program for case-control genetic analysis that takes relatedness between individuals into account. It will perform single-marker and haplotypic tests, however it will only work with SNP or other biallelic markers.",
        "homepage": "http://www.stat.auckland.ac.nz/~browning/ccrel/ccrel.htm",
        "name": "CCREL"
    }
}