{
    "additionDate": "2019-11-14T18:13:17Z",
    "biotoolsCURIE": "biotools:ALTIS",
    "biotoolsID": "ALTIS",
    "confidence_flag": "high",
    "description": "> HOMEPAGE MISSING! | A fast and automatic lung and trachea CT-image segmentation method | PURPOSE:The automated segmentation of each lung and trachea in CT scans is commonly taken as a solved problem. Indeed, existing approaches may easily fail in the presence of some abnormalities caused by a disease, trauma, or previous surgery. For robustness, we present ALTIS (implementation is available at http: lids.ic.unicamp.br downloads) - a fast automatic lung and trachea CT-image segmentation method that relies on image features and relative shape- and intensity-based characteristics less affected by most appearance variations of abnormal lungs and trachea. METHODS:ALTIS consists of a sequence of image foresting transforms (IFTs) organized in three main steps: (a) lung-and-trachea extraction, (b) seed estimation inside background, trachea, left lung, and right lung, and (c) their delineation such that each object is defined by an optimum-path forest rooted at its internal seeds",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://www.ncbi.nlm.nih.gov/pubmed/?term=31435950",
    "lastUpdate": "2019-11-14T18:13:17Z",
    "name": "ALTIS",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1002/MP.13773",
            "metadata": {
                "abstract": "© 2019 American Association of Physicists in MedicinePurpose: The automated segmentation of each lung and trachea in CT scans is commonly taken as a solved problem. Indeed, existing approaches may easily fail in the presence of some abnormalities caused by a disease, trauma, or previous surgery. For robustness, we present ALTIS (implementation is available at http://lids.ic.unicamp.br/downloads) — a fast automatic lung and trachea CT-image segmentation method that relies on image features and relative shape- and intensity-based characteristics less affected by most appearance variations of abnormal lungs and trachea. Methods: ALTIS consists of a sequence of image foresting transforms (IFTs) organized in three main steps: (a) lung-and-trachea extraction, (b) seed estimation inside background, trachea, left lung, and right lung, and (c) their delineation such that each object is defined by an optimum-path forest rooted at its internal seeds. We compare ALTIS with two methods based on shape models (SOSM-S and MALF), and one algorithm based on seeded region growing (PTK). Results: The experiments involve the highest number of scans found in literature — 1255 scans, from multiple public data sets containing many anomalous cases, being only 50 normal scans used for training and 1205 scans used for testing the methods. Quantitative experiments are based on two metrics, DICE and ASSD. Furthermore, we also demonstrate the robustness of ALTIS in seed estimation. Considering the test set, the proposed method achieves an average DICE of 0.987 for both lungs and 0.898 for the trachea, whereas an average ASSD of 0.938 for the right lung, 0.856 for the left lung, and 1.316 for the trachea. These results indicate that ALTIS is statistically more accurate and considerably faster than the compared methods, being able to complete segmentation in a few seconds on modern PCs. Conclusion: ALTIS is the most effective and efficient choice among the compared methods to segment left lung, right lung, and trachea in anomalous CT scans for subsequent detection, segmentation, and quantitative analysis of abnormal structures in the lung parenchyma and pleural space.",
                "authors": [
                    {
                        "name": "Sousa A.M."
                    },
                    {
                        "name": "Martins S.B."
                    },
                    {
                        "name": "Falcao A.X."
                    },
                    {
                        "name": "Reis F."
                    },
                    {
                        "name": "Bagatin E."
                    },
                    {
                        "name": "Irion K."
                    }
                ],
                "date": "2019-01-01T00:00:00Z",
                "journal": "Medical Physics",
                "title": "ALTIS: A fast and automatic lung and trachea CT-image segmentation method"
            },
            "pmid": "31435950"
        }
    ],
    "topic": [
        {
            "term": "Surgery",
            "uri": "http://edamontology.org/topic_3421"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        },
        {
            "term": "Tomography",
            "uri": "http://edamontology.org/topic_3452"
        }
    ]
}