{
    "additionDate": "2017-03-30T22:04:55Z",
    "biotoolsCURIE": "biotools:hmdb",
    "biotoolsID": "hmdb",
    "credit": [
        {
            "name": "Contact Form",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://feedback.wishartlab.com/?site=hmdb"
        }
    ],
    "description": "Freely available electronic database containing detailed information about small molecule metabolites found in the human body. The database supports extensive text, sequence, chemical structure and relational query searches.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://www.hmdb.ca/help"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                },
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                },
                {
                    "term": "Structural similarity search",
                    "uri": "http://edamontology.org/operation_0360"
                },
                {
                    "term": "Structure database search",
                    "uri": "http://edamontology.org/operation_0339"
                }
            ]
        }
    ],
    "homepage": "http://www.hmdb.ca/",
    "language": [
        "Java",
        "Perl"
    ],
    "lastUpdate": "2018-12-10T12:58:55Z",
    "name": "HMDB",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "The Human Metabolome Database (HMDB) is currently the most complete and comprehensive curated collection of human metabolite and human metabolism data in the world. It contains records for more than 2180 endogenous metabolites with information gathered from thousands of books, journal articles and electronic databases. In addition to its comprehensive literature-derived data, the HMDB also contains an extensive collection of experimental metabolite concentration data compiled from hundreds of mass spectra (MS) and Nuclear Magnetic resonance (NMR) metabolomic analyses performed on urine, blood and cerebrospinal fluid samples. This is further supplemented with thousands of NMR and MS spectra collected on purified, reference metabolites. Each metabolite entry in the HMDB contains an average of 90 separate data fields including a comprehensive compound description, names and synonyms, structural information, physico-chemical data, reference NMR and MS spectra, biofluid concentrations, disease associations, pathway information, enzyme data, gene sequence data, SNP and mutation data as well as extensive links to images, references and other public databases. Extensive searching, relational querying and data browsing tools are also provided. The HMDB is designed to address the broad needs of biochemists, clinical chemists, physicians, medical geneticists, nutritionists and members of the metabolomics community. The HMDB is available at: www.hmdb.ca © 2007 Oxford University Press.",
                "authors": [
                    {
                        "name": "Amegbey G."
                    },
                    {
                        "name": "Arndt D."
                    },
                    {
                        "name": "Bamforth F."
                    },
                    {
                        "name": "Block D."
                    },
                    {
                        "name": "Cheng D."
                    },
                    {
                        "name": "Clements M."
                    },
                    {
                        "name": "Clive D."
                    },
                    {
                        "name": "Coutouly M.-A."
                    },
                    {
                        "name": "Dowlatabadi R."
                    },
                    {
                        "name": "Duggan G.E."
                    },
                    {
                        "name": "Eisner R."
                    },
                    {
                        "name": "Forsythe I."
                    },
                    {
                        "name": "Fung C."
                    },
                    {
                        "name": "Gebremedhin M."
                    },
                    {
                        "name": "Greiner R."
                    },
                    {
                        "name": "Guo A.C."
                    },
                    {
                        "name": "Guo N."
                    },
                    {
                        "name": "Hau D.D."
                    },
                    {
                        "name": "Jeroncic K."
                    },
                    {
                        "name": "Jewell K."
                    },
                    {
                        "name": "Knox C."
                    },
                    {
                        "name": "Lewis M."
                    },
                    {
                        "name": "Li L."
                    },
                    {
                        "name": "MacInnis G.D."
                    },
                    {
                        "name": "Marrie T."
                    },
                    {
                        "name": "Miniaci J."
                    },
                    {
                        "name": "Nikolai L."
                    },
                    {
                        "name": "Querengesser L."
                    },
                    {
                        "name": "Sawhney S."
                    },
                    {
                        "name": "Shrivastava S."
                    },
                    {
                        "name": "Stothard P."
                    },
                    {
                        "name": "Sykes B.D."
                    },
                    {
                        "name": "Tang P."
                    },
                    {
                        "name": "Tzur D."
                    },
                    {
                        "name": "Vogel H.J."
                    },
                    {
                        "name": "Wagner J."
                    },
                    {
                        "name": "Weljie A.M."
                    },
                    {
                        "name": "Wishart D.S."
                    },
                    {
                        "name": "Young N."
                    },
                    {
                        "name": "Zhang Y."
                    }
                ],
                "citationCount": 1842,
                "date": "2007-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "HMDB: The human metabolome database"
            },
            "pmid": "17202168"
        },
        {
            "metadata": {
                "abstract": "The Human Metabolome Database (HMDB, http://www.hmdb.ca) is a richly annotated resource that is designed to address the broad needs of biochemists, clinical chemists, physicians, medical geneticists, nutritionists and members of the metabolomics community. Since its first release in 2007, the HMDB has been used to facilitate the research for nearly 100 published studies in metabolomics, clinical biochemistry and systems biology. The most recent release of HMDB (version 2.0) has been significantly expanded and enhanced over the previous release (version 1.0). In particular, the number of fully annotated metabolite entries has grown from 2180 to more than 6800 (a 300% increase), while the number of metabolites with biofluid or tissue concentration data has grown by a factor of five (from 883 to 4413). Similarly, the number of purified compounds with reference to NMR, LC-MS and GC-MS spectra has more than doubled (from 380 to more than 790 compounds). In addition to this significant expansion in database size, many new database searching tools and new data content has been added or enhanced. These include better algorithms for spectral searching and matching, more powerful chemical substructure searches, faster text searching software, as well as dedicated pathway searching tools and customized, clickable metabolic maps. Changes to the user-interface have also been implemented to accommodate future expansion and to make database navigation much easier. These improvements should make the HMDB much more useful to a much wider community of users. © 2008 The Author(s).",
                "authors": [
                    {
                        "name": "Bouatra S."
                    },
                    {
                        "name": "Cheng D."
                    },
                    {
                        "name": "Clements M."
                    },
                    {
                        "name": "Clive D."
                    },
                    {
                        "name": "Cruz J.A."
                    },
                    {
                        "name": "Dawe M."
                    },
                    {
                        "name": "Dong E."
                    },
                    {
                        "name": "Eisner R."
                    },
                    {
                        "name": "Fang L."
                    },
                    {
                        "name": "Forsythei I."
                    },
                    {
                        "name": "Fradette R."
                    },
                    {
                        "name": "Gautam B."
                    },
                    {
                        "name": "Greiner R."
                    },
                    {
                        "name": "Guo A.C."
                    },
                    {
                        "name": "Hau D.D."
                    },
                    {
                        "name": "Huang P."
                    },
                    {
                        "name": "Jia L."
                    },
                    {
                        "name": "Knox C."
                    },
                    {
                        "name": "Lewis A."
                    },
                    {
                        "name": "Li L."
                    },
                    {
                        "name": "Lim E."
                    },
                    {
                        "name": "Liu P."
                    },
                    {
                        "name": "Mandal R."
                    },
                    {
                        "name": "Nazyrova A."
                    },
                    {
                        "name": "Peng J."
                    },
                    {
                        "name": "Psychogios N."
                    },
                    {
                        "name": "Shaykhutdinov R."
                    },
                    {
                        "name": "Shrivastava S."
                    },
                    {
                        "name": "Sinelnikov I."
                    },
                    {
                        "name": "Sobsey C.A."
                    },
                    {
                        "name": "Tzur D."
                    },
                    {
                        "name": "Vogel H.J."
                    },
                    {
                        "name": "Wishart D.S."
                    },
                    {
                        "name": "Xia J."
                    },
                    {
                        "name": "Xiong Y."
                    },
                    {
                        "name": "Young N."
                    },
                    {
                        "name": "Zuniga A."
                    },
                    {
                        "name": "de souza A."
                    }
                ],
                "citationCount": 1341,
                "date": "2009-01-09T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "HMDB: A knowledgebase for the human metabolome"
            },
            "pmid": "18953024"
        },
        {
            "metadata": {
                "abstract": "This review provides a summary of the applications and potential applications of metabolite profiling (i.e. metabolomics) in monitoring organ transplants. While the concept of metabolomics is relatively new to organ transplantation, the idea of measuring metabolites as a quick, noninvasive probe of organ function is not. Indeed, metabolite measurements of serum creatinine have long been used to assess pre- and post-operative organ function. Over the past 10 years, a number of lesser-known, organ-specific metabolites have also been shown to be good diagnostic indicators of both organ function and viability. In general, metabolomics offers a complementary picture to what can be revealed via techniques based on genomics, proteomics or histology. Because metabolic changes typically happen within seconds or minutes after an 'event', whereas some transcript, protein abundance or tissue changes may take place over days or weeks, metabolomic measurements may offer a particularly useful and inexpensive diagnostic tool to monitor donor organ viability or to detect organ rejection. The excitement associated with metabolomics, however, must be tempered by the fact that the technology for rapid metabolite identification is still in its infancy, and that metabolites are but one part of a very complex picture pertaining to organ function. Copyright © Blackwell Munksgaard 2005.",
                "authors": [
                    {
                        "name": "Wishart D.S."
                    }
                ],
                "citationCount": 122,
                "date": "2005-12-01T00:00:00Z",
                "journal": "American Journal of Transplantation",
                "title": "Metabolomics: The principles and potential applications to transplantation"
            },
            "pmid": "16302993"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "NMR",
            "uri": "http://edamontology.org/topic_0593"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Surgery",
            "uri": "http://edamontology.org/topic_3421"
        }
    ],
    "validated": 1
}
