{
    "additionDate": "2021-09-08T13:45:38.239290Z",
    "biotoolsCURIE": "biotools:fragsite",
    "biotoolsID": "fragsite",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "skolnick@gatech.edu",
            "name": "Jeffrey Skolnick",
            "orcidid": "https://orcid.org/0000-0002-1877-4958",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "FRAGSITE is a fragment-based machine learning algorithm that scores protein-ligand binding for ligand virtual screening.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein-protein docking",
                    "uri": "http://edamontology.org/operation_3899"
                },
                {
                    "term": "Scaffolding",
                    "uri": "http://edamontology.org/operation_3216"
                },
                {
                    "term": "Virtual screening",
                    "uri": "http://edamontology.org/operation_3938"
                }
            ]
        }
    ],
    "homepage": "http://sites.gatech.edu/cssb/FRAGSITE",
    "lastUpdate": "2024-11-24T20:19:18.184882Z",
    "link": [
        {
            "note": "FRAGSITE Virtual Ligand Screening",
            "type": [
                "Other"
            ],
            "url": "http://cssb2.biology.gatech.edu/FRAGSITE/index_vls.html"
        },
        {
            "note": "FRAGSITE Virtual Target Screening",
            "type": [
                "Other"
            ],
            "url": "http://cssb2.biology.gatech.edu/FRAGSITE/index_vts.html"
        }
    ],
    "name": "FRAGSITE",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1021/acs.jcim.0c01160",
            "metadata": {
                "abstract": "To reduce time and cost, virtual ligand screening (VLS) often precedes experimental ligand screening in modern drug discovery. Traditionally, high-resolution structure-based docking approaches rely on experimental structures, while ligand-based approaches need known binders to the target protein and only explore their nearby chemical space. In contrast, our structure-based FINDSITEcomb2.0 approach takes advantage of predicted, low-resolution structures and information from ligands that bind distantly related proteins whose binding sites are similar to the target protein. Using a boosted tree regression machine learning framework, we significantly improved FINDSITEcomb2.0 by integrating ligand fragment scores as encoded by molecular fingerprints with the global ligand similarity scores of FINDSITEcomb2.0. The new approach, FRAGSITE, exploits our observation that ligand fragments, e.g., rings, tend to interact with stereochemically conserved protein subpockets that also occur in evolutionarily unrelated proteins. FRAGSITE was benchmarked on the 102 protein DUD-E set, where any template protein whose sequence identify >30% to the target was excluded. Within the top 100 ranked molecules, FRAGSITE improves VLS precision and recall by 14.3 and 18.5%, respectively, relative to FINDSITEcomb2.0. Moreover, the mean top 1% enrichment factor increases from 25.2 to 30.2. On average, both outperform state-of-the-art deep learning-based methods such as AtomNet. On the more challenging unbiased set LIT-PCBA, FRAGSITE also shows better performance than ligand similarity-based and docking approaches such as two-dimensional ECFP4 and Surflex-Dock v.3066. On a subset of 23 targets from DEKOIS 2.0, FRAGSITE shows much better performance than the boosted tree regression-based, vScreenML scoring function. Experimental testing of FRAGSITE's predictions shows that it has more hits and covers a more diverse region of chemical space than FINDSITEcomb2.0. For the two proteins that were experimentally tested, DHFR, a well-studied protein that catalyzes the conversion of dihydrofolate to tetrahydrofolate, and the kinase ACVR1, FRAGSITE identified new small-molecule nanomolar binders. Interestingly, one new binder of DHFR is a kinase inhibitor predicted to bind in a new subpocket. For ACVR1, FRAGSITE identified new molecules that have diverse scaffolds and estimated nanomolar to micromolar affinities. Thus, FRAGSITE shows significant improvement over prior state-of-the-art ligand virtual screening approaches. A web server is freely available for academic users at http:/sites.gatech.edu/cssb/FRAGSITE.",
                "authors": [
                    {
                        "name": "Cao H."
                    },
                    {
                        "name": "Skolnick J."
                    },
                    {
                        "name": "Zhou H."
                    }
                ],
                "citationCount": 19,
                "date": "2021-04-26T00:00:00Z",
                "journal": "Journal of Chemical Information and Modeling",
                "title": "FRAGSITE: A Fragment-Based Approach for Virtual Ligand Screening"
            },
            "pmcid": "PMC8243409",
            "pmid": "33724022",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Drug discovery",
            "uri": "http://edamontology.org/topic_3336"
        },
        {
            "term": "Drug metabolism",
            "uri": "http://edamontology.org/topic_3375"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Molecular modelling",
            "uri": "http://edamontology.org/topic_2275"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
