{
    "accessibility": "Open access",
    "additionDate": "2022-10-03T23:03:11.951895Z",
    "biotoolsCURIE": "biotools:exoplot",
    "biotoolsID": "exoplot",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Carsten Alexander Raabe"
        },
        {
            "name": "Fengjun Zhang"
        },
        {
            "name": "Henrik Kaessmann"
        },
        {
            "name": "Jürgen Brosius"
        },
        {
            "name": "Jürgen Schmitz"
        },
        {
            "name": "Margarida Cardoso-Moreira"
        }
    ],
    "description": "Representation of alternative splicing in human tissues and developmental stages with transposed element (TE) involvement.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://retrogenomics3.uni-muenster.de:3838/exz-plot-d/how2use.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Alternative splicing prediction",
                    "uri": "http://edamontology.org/operation_0264"
                },
                {
                    "term": "Exonic splicing enhancer prediction",
                    "uri": "http://edamontology.org/operation_0446"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "http://retrogenomics3.uni-muenster.de:3838/exz-plot-d/",
    "lastUpdate": "2022-10-03T23:03:11.954331Z",
    "name": "ExoPLOT",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1016/J.YGENO.2022.110434",
            "metadata": {
                "abstract": "© 2022Advances in RNA high-throughput sequencing and large-scale functional assays yield new insights into the multifaceted activities of transposed elements (TE) and many other previously undiscovered sequence elements. Currently, no tool for easy access, analysis, quantification, and visualization of alternatively spliced exons across multiple tissues or developmental stages is available. Also, analysis pipelines demand computational skills or hardware requirements, which often are hard to meet by wet-lab scientists. We developed ExoPLOT to enable simplified access to massive RNA high throughput sequencing datasets to facilitate the analysis of alternative splicing across many biological samples. To demonstrate the functonality of ExoPLOT, we analyzed the contributon of exonized TEs to human coding sequences (CDS). mRNA splice variants containing the TE-derived exon were quantified and compared to expression levels of TE-free splice variants. For analysis, we utilized 313 human cerebrum, cerebellum, heart, kidney, liver, ovary, and testis transcriptomes, representing various pre- and postnatal developmental stages. ExoPLOT visualizes the relative expression levels of alternative transcripts, e.g., caused by the insertion of new TE-derived exons, across different developmental stages of and among multiple tissues. This tool also provides a unique link between evolution and function during exonization (gain of a new exon) and exaptation (recruitment/co-optation) of a new exon. As input for analysis, we derived a database of 1151 repeat-masked, exonized TEs, representing all prominent families of transposons in the human genome and the collection of human consensus coding sequences (CCDS). ExoPLOT screened preprocessed RNA high-throughput sequencing datasets from seven human tissues to quantify and visualize the dynamics in RNA splicing for these 1151 TE-derived exons during the entire human organ development. In addition, we successfully mapped and analyzed 993 recently described exonized sequences from the human frontal cortex onto these 313 transcriptome libraries. ExoPLOT's approach to preprocessing RNA deep sequencing datasets facilitates alternative splicing analysis and significantly reduces processing times. In addition, ExoPLOT's design allows studying alternative RNA isoforms other than TE-derived in a customized – coordinate-based manner and is available at http://retrogenomics3.uni-muenster.de:3838/exz-plot-d/.",
                "authors": [
                    {
                        "name": "Brosius J."
                    },
                    {
                        "name": "Cardoso-Moreira M."
                    },
                    {
                        "name": "Kaessmann H."
                    },
                    {
                        "name": "Raabe C.A."
                    },
                    {
                        "name": "Schmitz J."
                    },
                    {
                        "name": "Zhang F."
                    }
                ],
                "date": "2022-07-01T00:00:00Z",
                "journal": "Genomics",
                "title": "ExoPLOT: Representation of alternative splicing in human tissues and developmental stages with transposed element (TE) involvement"
            },
            "pmid": "35863675"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Mobile genetic elements",
            "uri": "http://edamontology.org/topic_0798"
        },
        {
            "term": "RNA splicing",
            "uri": "http://edamontology.org/topic_3320"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ],
    "validated": 1
}
