{
    "accessibility": "Open access",
    "additionDate": "2022-04-03T22:16:50.150630Z",
    "biotoolsCURIE": "biotools:pksps",
    "biotoolsID": "pksps",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "shishaoping@ncu.edu.cn",
            "name": "Shaoping Shi",
            "orcidid": "https://orcid.org/0000-0003-0045-868X",
            "typeEntity": "Person"
        },
        {
            "name": "Huan He"
        },
        {
            "name": "Jialin Yu"
        },
        {
            "name": "Xinyun Guo"
        }
    ],
    "description": "A novel method for predicting kinase of specific phosphorylation sites based on maximum weighted bipartite matching algorithm and phosphorylation sequence enrichment analysis.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "PTM site prediction",
                    "uri": "http://edamontology.org/operation_0417"
                },
                {
                    "term": "Protein interaction prediction",
                    "uri": "http://edamontology.org/operation_2492"
                },
                {
                    "term": "Protein secondary structure prediction",
                    "uri": "http://edamontology.org/operation_0267"
                }
            ]
        }
    ],
    "homepage": "https://github.com/guoxinyunncu/PKSPS",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-04-03T22:16:50.153056Z",
    "license": "Not licensed",
    "name": "PKSPS",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1093/BIB/BBAB436",
            "metadata": {
                "abstract": "© 2021 The Author(s) 2021. Published by Oxford University Press. All rights reserved. For Permissions, please email: journals.permissions@oup.com.With the development of biotechnology, a large number of phosphorylation sites have been experimentally confirmed and collected, but only a few of them have kinase annotations. Since experimental methods to detect kinases at specific phosphorylation sites are expensive and accidental, some computational methods have been proposed to predict the kinase of these sites, but most methods only consider single sequence information or single functional network information. In this study, a new method Predicting Kinase of Specific Phosphorylation Sites (PKSPS) is developed to predict kinases of specific phosphorylation sites in human proteins by combining PKSPS-Net with PKSPS-Seq, which considers protein-protein interaction (PPI) network information and sequence information. For PKSPS-Net, kinase-kinase and substrate-substrate similarity are quantified based on the topological similarity of proteins in the PPI network, and maximum weighted bipartite matching algorithm is proposed to predict kinase-substrate relationship. In PKSPS-Seq, phosphorylation sequence enrichment analysis is used to analyze the similarity of local sequences around phosphorylation sites and predict the kinase of specific phosphorylation sites (KSP). PKSPS has been proved to be more effective than the PKSPS-Net or PKSPS-Seq on different sets of kinases. Further comparison results show that the PKSPS method performs better than existing methods. Finally, the case study demonstrates the effectiveness of the PKSPS in predicting kinases of specific phosphorylation sites. The open source code and data of the PKSPS can be obtained from https://github.com/guoxinyunncu/PKSPS.",
                "authors": [
                    {
                        "name": "Guo X."
                    },
                    {
                        "name": "He H."
                    },
                    {
                        "name": "Shi S."
                    },
                    {
                        "name": "Yu J."
                    }
                ],
                "date": "2022-01-01T00:00:00Z",
                "journal": "Briefings in Bioinformatics",
                "title": "PKSPS: A novel method for predicting kinase of specific phosphorylation sites based on maximum weighted bipartite matching algorithm and phosphorylation sequence enrichment analysis"
            },
            "pmid": "34661630"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "Protein modifications",
            "uri": "http://edamontology.org/topic_0601"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ]
}
