{
    "accessibility": "Open access",
    "additionDate": "2022-09-05T22:13:42.033645Z",
    "biotoolsCURIE": "biotools:ml4bio",
    "biotoolsID": "ml4bio",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "christopher_magnano@hms.harvard.edu",
            "name": "Chris S Magnano",
            "typeEntity": "Person"
        },
        {
            "email": "gitter@biostat.wisc.edu",
            "name": "Anthony Gitter",
            "typeEntity": "Person"
        },
        {
            "name": "Debora Treu"
        },
        {
            "name": "Fangzhou Mu"
        },
        {
            "name": "Milica Cvetkovic"
        },
        {
            "name": "Rosemary S Russ"
        }
    ],
    "description": "An approachable, flexible and practical machine learning workshop for biologists.",
    "editPermission": {
        "type": "private"
    },
    "homepage": "https://github.com/gitter-lab/ml4bio",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-09-05T22:13:42.036390Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/carpentries-incubator/ml4bio-workshop"
        },
        {
            "type": [
                "Repository"
            ],
            "url": "https://pypi.org/project/ml4bio/"
        }
    ],
    "name": "ML4Bio",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAC233",
            "metadata": {
                "abstract": "© 2022 The Author(s) 2022.Summary: The increasing prevalence and importance of machine learning in biological research have created a need for machine learning training resources tailored towards biological researchers. However, existing resources are often inaccessible, infeasible or inappropriate for biologists because they require significant computational and mathematical knowledge, demand an unrealistic time-investment or teach skills primarily for computational researchers. We created the Machine Learning for Biologists (ML4Bio) workshop, a short, intensive workshop that empowers biological researchers to comprehend machine learning applications and pursue machine learning collaborations in their own research. The ML4Bio workshop focuses on classification and was designed around three principles: (i) emphasizing preparedness over fluency or expertise, (ii) necessitating minimal coding and mathematical background and (iii) requiring low time investment. It incorporates active learning methods and custom open-source software that allows participants to explore machine learning workflows. After multiple sessions to improve workshop design, we performed a study on three workshop sessions. Despite some confusion around identifying subtle methodological flaws in machine learning workflows, participants generally reported that the workshop met their goals, provided them with valuable skills and knowledge and greatly increased their beliefs that they could engage in research that uses machine learning. ML4Bio is an educational tool for biological researchers, and its creation and evaluation provide valuable insight into tailoring educational resources for active researchers in different domains.",
                "authors": [
                    {
                        "name": "Cvetkovic M."
                    },
                    {
                        "name": "Gitter A."
                    },
                    {
                        "name": "Magnano C.S."
                    },
                    {
                        "name": "Mu F."
                    },
                    {
                        "name": "Russ R.S."
                    },
                    {
                        "name": "Treu D."
                    }
                ],
                "date": "2022-07-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "An approachable, flexible and practical machine learning workshop for biologists"
            },
            "pmcid": "PMC9236579",
            "pmid": "35758797"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Mathematics",
            "uri": "http://edamontology.org/topic_3315"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ]
}
