{
    "additionDate": "2019-11-14T19:34:59Z",
    "biotoolsCURIE": "biotools:Cytokit",
    "biotoolsID": "Cytokit",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "eric@hammerlab.org",
            "name": "Eric Czech",
            "orcidid": "https://orcid.org/0000-0002-4254-4255",
            "typeEntity": "Person"
        }
    ],
    "description": "A single-cell analysis toolkit for high dimensional fluorescent microscopy imaging | Microscopy Image Cytometry Toolkit | Cytokit is a collection of tools for quantifying and analyzing properties of individual cells in large fluorescent microscopy datasets with a focus on those generated from multiplexed staining protocols. This includes a GPU-accelerated image processing pipeline (via TensorFlow), CLI tools for batch processing of experimental replicates (often requiring conditional configuration, as things tend go wrong when capturing hundreds of thousands of microscope images over a period of hours or days), and visualization UIs (either Cytokit Explorer or CellProfiler Analyst) | Med Google Cloud Platform kan du oprette, implementere og skalere apps, websites og tjenester på den samme infrastruktur som Google | Fortsæt til Google Cloud Platform | Skriv den tekst, du hører eller ser",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Deisotoping",
                    "uri": "http://edamontology.org/operation_3629"
                },
                {
                    "term": "Microscope image visualisation",
                    "uri": "http://edamontology.org/operation_3552"
                }
            ]
        }
    ],
    "homepage": "https://github.com/hammerlab/cytokit",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-12-17T12:17:11Z",
    "license": "Apache-2.0",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/hammerlab/cytokit/issues"
        },
        {
            "type": [
                "Other"
            ],
            "url": "https://console.cloud.google.com/storage/browser/cytokit/datasets"
        }
    ],
    "name": "Cytokit",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12859-019-3055-3",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Multiplexed in-situ fluorescent imaging offers several advantages over single-cell assays that do not preserve the spatial characteristics of biological samples. This spatial information, in addition to morphological properties and extensive intracellular or surface marker profiling, comprise promising avenues for rapid advancements in the understanding of disease progression and diagnosis. As protocols for conducting such imaging experiments continue to improve, it is the intent of this study to provide and validate software for processing the large quantity of associated data in kind. Results: Cytokit offers (i) an end-to-end, GPU-accelerated image processing pipeline; (ii) efficient input/output (I/O) strategies for operations specific to high dimensional microscopy; and (iii) an interactive user interface for cross filtering of spatial, graphical, expression, and morphological cell properties within the 100+ GB image datasets common to multiplexed immunofluorescence. Image processing operations supported in Cytokit are generally sourced from existing deep learning models or are at least in part adapted from open source packages to run in a single or multi-GPU environment. The efficacy of these operations is demonstrated through several imaging experiments that pair Cytokit results with those from an independent but comparable assay. A further validation also demonstrates that previously published results can be reproduced from a publicly available multiplexed image dataset. Conclusion: Cytokit is a collection of open source tools for quantifying and analyzing properties of individual cells in large fluorescent microscopy datasets that are often, but not necessarily, generated from multiplexed antibody labeling protocols over many fields of view or time periods. This project is best suited to bioinformaticians or other technical users that wish to analyze such data in a batch-oriented, high-throughput setting. All source code, documentation, and data generated for this article are available under the Apache License 2.0 at https://github.com/hammerlab/cytokit.",
                "authors": [
                    {
                        "name": "Aksoy B.A."
                    },
                    {
                        "name": "Aksoy P."
                    },
                    {
                        "name": "Czech E."
                    },
                    {
                        "name": "Hammerbacher J."
                    }
                ],
                "citationCount": 7,
                "date": "2019-09-02T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Cytokit: A single-cell analysis toolkit for high dimensional fluorescent microscopy imaging"
            },
            "pmcid": "PMC6720861",
            "pmid": "31477013"
        }
    ],
    "toolType": [
        "Suite"
    ],
    "topic": [
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Immunoproteins and antigens",
            "uri": "http://edamontology.org/topic_2830"
        }
    ],
    "validated": 1
}
