{"credit":[{"email":"wenlin@ibms.sinica.edu.tw","name":"Wen-chang Lin","typeEntity":"Person","typeRoles":["Primary contact"]},{"email":"mirrian@iis.sinica.edu.tw","name":"Mirrian Meng-Ru Ho","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"http://goods.ibms.sinica.edu.tw/DNVs/search.html"}],"function":[{"operation":[{"term":"Genotyping","uri":"http://edamontology.org/operation_3196"},{"term":"SNP annotation","uri":"http://edamontology.org/operation_3661"},{"term":"SNP detection","uri":"http://edamontology.org/operation_0484"},{"term":"Genetic variation analysis","uri":"http://edamontology.org/operation_3197"}]}],"labels":{"operatingSystem":["Linux","Windows","Mac"],"toolType":["Database portal"],"topic":[{"term":"DNA polymorphism","uri":"http://edamontology.org/topic_2885"},{"term":"Genetic variation","uri":"http://edamontology.org/topic_0199"},{"term":"Transcription factors and regulatory sites","uri":"http://edamontology.org/topic_0749"},{"term":"Gene transcripts","uri":"http://edamontology.org/topic_3512"}]},"publication":[{"abstract":"Gene duplications are scattered widely throughoutthe human genome. A single-base difference located in nearly identical duplicated segments may be misjudged as a single nucleotide polymorphism (SNP) from individuals. This imperfection is undistinguishable in current genotyping methods. As the next-generation sequencing technologies become more popular for sequencebased association studies, numerous ambiguous SNPs are rapidly accumulated. Thus, analyzing duplication variations in the reference genome to assist in preventing false positive SNPs is imperative. We have identified >10% of human genes associated with duplicated gene loci (DGL). Through meticulous sequence alignments of DGL, we systematically designated 1 236 956 variations as duplicated gene nucleotide variants (DNVs). The DNV database (dbDNV) (http://goods.ibms.sinica .edu.tw/DNVs/) has been established to promote more accurate variation annotation. Aside from the flat file download, users can explore the generelated duplications and the associated DNVs by DGL and DNV searches, respectively. In addition, the dbDNV contains 304 110 DNV-coupled SNPs. From DNV-coupled SNP search, users observewhich SNP records are also variants among duplicates. This is useful while ̃58% of exonic SNPs in DGL are DNV-coupled. Because of high accumulation of ambiguous SNPs, we suggest that annotating SNPs with DNVs possibilities should improve association studies of these variants with human diseases. © The Author(s) 2010.","authors":["Ho M.-R.","Tsai K.-W.","Chen C.-H.","Lin W.-C."],"cit_count":11,"journal":"Nucleic Acids Research","pmid":"21097891","title":"DbDNV: A resource of duplicated gene nucleotide variants in human genome","year":"2011-01-01"}],"summary":{"biotoolsCURIE":"biotools:dbdnv","biotoolsID":"dbdnv","description":"The duplicated gene nucleotide variants database (dbDNV) (http://goods.ibms.sinica.edu.tw/DNVs/) promotes accurate variation annotation. Aside from the flat file download, users can explore the gene-related duplications and the associated DNVs by DGL and DNV searches, respectively. In addition, the dbDNV contains 304,110 DNV-coupled SNPs. From DNV-coupled SNP search, users observe which SNP records are also variants among duplicates.","homepage":"http://goods.ibms.sinica.edu.tw/DNVs/","name":"dbDNV"}}