{
    "additionDate": "2021-01-18T12:21:14Z",
    "biotoolsCURIE": "biotools:harp",
    "biotoolsID": "harp",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "scv26@cam.ac.uk",
            "name": "Sundeep Chaitanya Vedithi",
            "typeEntity": "Person"
        }
    ],
    "description": "A database of structural impacts of systematic missense mutations in drug targets of <i>Mycobacterium leprae</i>.\n\nLast updated on September 22, 2020.\n\nHARP - A Web Resource for Predicted Structural Impacts of Anti-microbial Resistance Mutations in Leprosy.\n\nHARP (a database of Hansen's Disease Antimicrobial Resistance Profiles) is an integrated web-resource with predicted structural implications of systematic mis-sense mutations in known drug targets of Mycobacterium leprae.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Antimicrobial resistance prediction",
                    "uri": "http://edamontology.org/operation_3482"
                },
                {
                    "term": "Variant effect prediction",
                    "uri": "http://edamontology.org/operation_0331"
                },
                {
                    "term": "Molecular docking",
                    "uri": "http://edamontology.org/operation_0478"
                },
                {
                    "term": "Nucleic acid folding analysis",
                    "uri": "http://edamontology.org/operation_0279"
                },
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                }
            ]
        }
    ],
    "homepage": "https://harp-leprosy.org",
    "lastUpdate": "2021-01-30T11:05:09Z",
    "name": "HARP",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1016/J.CSBJ.2020.11.013",
            "metadata": {
                "abstract": "© 2020 The AuthorsComputational Saturation Mutagenesis is an in-silico approach that employs systematic mutagenesis of each amino acid residue in the protein to all other amino acid types, and predicts changes in thermodynamic stability and affinity to the other subunits/protein counterparts, ligands and nucleic acid molecules. The data thus generated are useful in understanding the functional consequences of mutations in antimicrobial resistance phenotypes. In this study, we applied computational saturation mutagenesis to three important drug-targets in Mycobacterium leprae (M. leprae) for the drugs dapsone, rifampin and ofloxacin namely Dihydropteroate Synthase (DHPS), RNA Polymerase (RNAP) and DNA Gyrase (GYR), respectively. M. leprae causes leprosy and is an obligate intracellular bacillus with limited protein structural information associating mutations with phenotypic resistance outcomes in leprosy. Experimentally solved structures of DHPS, RNAP and GYR of M. leprae are not available in the Protein Data Bank, therefore, we modelled the structures of these proteins using template-based comparative modelling and introduced systematic mutations in each model generating 80,902 mutations and mutant structures for all the three proteins. Impacts of mutations on stability and protein-subunit, protein-ligand and protein-nucleic acid affinities were computed using various in-house developed and other published protein stability and affinity prediction software. A consensus impact was estimated for each mutation using qualitative scoring metrics for physicochemical properties and by a categorical grouping of stability and affinity predictions. We developed a web database named HARP (a database of Hansen's Disease Antimicrobial Resistance Profiles), which is accessible at the URL - https://harp-leprosy.org and provides the details to each of these predictions.",
                "authors": [
                    {
                        "name": "Vedithi S.C."
                    },
                    {
                        "name": "Malhotra S."
                    },
                    {
                        "name": "Skwark M.J."
                    },
                    {
                        "name": "Munir A."
                    },
                    {
                        "name": "Acebron-Garcia-De-Eulate M."
                    },
                    {
                        "name": "Waman V.P."
                    },
                    {
                        "name": "Alsulami A."
                    },
                    {
                        "name": "Ascher D.B."
                    },
                    {
                        "name": "Blundell T.L."
                    }
                ],
                "citationCount": 6,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Computational and Structural Biotechnology Journal",
                "title": "HARP: a database of structural impacts of systematic missense mutations in drug targets of Mycobacterium leprae"
            },
            "pmcid": "PMC7711215",
            "pmid": "33304465"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Protein folding, stability and design",
            "uri": "http://edamontology.org/topic_0130"
        },
        {
            "term": "Molecular modelling",
            "uri": "http://edamontology.org/topic_2275"
        },
        {
            "term": "Nucleic acid structure analysis",
            "uri": "http://edamontology.org/topic_0097"
        }
    ]
}