{"collectionID": [], "accessibility": [], "topic": [{"term": "Transcriptomics", "uri": "http://edamontology.org/topic_3308"}, {"term": "Mapping", "uri": "http://edamontology.org/topic_0102"}], "owner": "seqwiki_import", "cost": null, "relation": [], "download": [], "validated": 1, "publication": [{"doi": null, "note": null, "version": null, "pmid": "22866951", "type": null, "pmcid": null, "metadata": {"title": "Ultra-high resolution HLA genotyping and allele discovery by highly multiplexed cDNA amplicon pyrosequencing", "abstract": "Background: High-resolution HLA genotyping is a critical diagnostic and research assay. Current methods rarely achieve unambiguous high-resolution typing without making population-specific frequency inferences due to a lack of locus coverage and difficulty in exon-phase matching. Achieving high-resolution typing is also becoming more challenging with traditional methods as the database of known HLA alleles increases.Results: We designed a cDNA amplicon-based pyrosequencing method to capture 94% of the HLA class I open-reading-frame with only two amplicons per sample, and an analogous method for class II HLA genes, with a primary focus on sequencing the DRB loci. We present a novel Galaxy server-based analysis workflow for determining genotype. During assay validation, we performed two GS Junior sequencing runs to determine the accuracy of the HLA class I amplicons and DRB amplicon at different levels of multiplexing. When 116 amplicons were multiplexed, we unambiguously resolved 99%of class I alleles to four- or six-digit resolution, as well as 100% unambiguous DRB calls. The second experiment, with 271 multiplexed amplicons, missed some alleles, but generated high-resolution, concordant typing for 93% of class I alleles, and 96% for DRB1 alleles. In a third, preliminary experiment we attempted to sequence novel amplicons for other class II loci with mixed success.Conclusions: The presented assay is higher-throughput and higher-resolution than existing HLA genotyping methods, and suitable for allele discovery or large cohort sampling. The validated class I and DRB primers successfully generated unambiguously high-resolution genotypes, while further work is needed to validate additional class II genotyping amplicons. © 2012 Lank et al.; licensee BioMed Central Ltd.", "citationCount": 23, "authors": [{"name": "Lank S.M."}, {"name": "Golbach B.A."}, {"name": "Creager H.M."}, {"name": "Wiseman R.W."}, {"name": "Keskin D.B."}, {"name": "Reinherz E.L."}, {"name": "Brusic V."}, {"name": "O'Connor D.H."}], "date": "2012-08-06T00:00:00Z", "journal": "BMC Genomics"}}], "homepage_status": 0, "credit": [{"typeRole": ["Primary contact"], "name": "Sebastian Boegel", "url": null, "gridid": null, "note": null, "orcidid": null, "typeEntity": "Person", "email": "boegels@uni-mainz.de"}], "biotoolsCURIE": "biotools:seq2hla", "elixirPlatform": [], "elixirNode": [], "version": [], "elixir_badge": 0, "homepage": "https://bitbucket.org/sebastian_boegel/seq2hla", "function": [{"note": null, "input": [], "operation": [{"term": "Read mapping", "uri": "http://edamontology.org/operation_3198"}, {"term": "Genetic variation analysis", "uri": "http://edamontology.org/operation_3197"}], "cmd": null, "output": []}], "lastUpdate": "2018-12-10T12:58:53Z", "otherID": [], "description": "seq2HLA is a computational tool to determine Human Leukocyte Antigen (HLA) directly from existing and future short RNA-Seq reads. \nIt takes standard RNA-Seq sequence reads in fastq format as input, uses a bowtie index comprising known HLA alleles and outputs the most likely HLA class I and class II types, a p-value for each call, and the expression of each class.", "toolType": ["Script"], "editPermission": {"type": "private", "authors": []}, "language": ["R", "Python"], "link": [], "biotoolsID": "seq2hla", "additionDate": "2017-01-13T13:16:16Z", "name": "Seq2HLA", "license": null, "documentation": [{"url": "https://bitbucket.org/sebastian_boegel/seq2hla/wiki/Home", "note": null, "type": "General"}], "maturity": "Mature", "confidence_flag": null, "operatingSystem": ["Linux", "Mac"]}