{
    "additionDate": "2021-01-18T09:20:06Z",
    "biotoolsCURIE": "biotools:taxonn",
    "biotoolsID": "taxonn",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "Wei.Xu@uhnresearch.ca",
            "name": "Wei Xu",
            "typeEntity": "Person"
        }
    ],
    "description": "ensemble of neural networks on stratified microbiome data for disease prediction.\n\nAn ensemble learning based method for training Convolutional Neural Networks on OTU data after stratification based on phyla. This is a deep learning methodology to arrange OTU data for CNN modelling based on similarity between OTUs in phylum level of the taxonomy tree.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/divya031090/TaxoNN_OTU",
    "language": [
        "Python",
        "R"
    ],
    "lastUpdate": "2021-02-26T16:29:10Z",
    "name": "TaxoNN",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAA542",
            "metadata": {
                "abstract": "© The Author(s) 2020. Published by Oxford University Press.Motivation: Research supports the potential use of microbiome as a predictor of some diseases. Motivated by the findings that microbiome data is complex in nature, and there is an inherent correlation due to hierarchical taxonomy of microbial Operational Taxonomic Units (OTUs), we propose a novel machine learning method incorporating a stratified approach to group OTUs into phylum clusters. Convolutional Neural Networks (CNNs) were used to train within each of the clusters individually. Further, through an ensemble learning approach, features obtained from each cluster were then concatenated to improve prediction accuracy. Our two-step approach comprising stratification prior to combining multiple CNNs, aided in capturing the relationships between OTUs sharing a phylum efficiently, as compared to using a single CNN ignoring OTU correlations. Results: We used simulated datasets containing 168 OTUs in 200 cases and 200 controls for model testing. Thirty-two OTUs, potentially associated with risk of disease were randomly selected and interactions between three OTUs were used to introduce non-linearity. We also implemented this novel method in two human microbiome studies: (i) Cirrhosis with 118 cases, 114 controls; (ii) type 2 diabetes (T2D) with 170 cases, 174 controls; to demonstrate the model's effectiveness. Extensive experimentation and comparison against conventional machine learning techniques yielded encouraging results. We obtained mean AUC values of 0.88, 0.92, 0.75, showing a consistent increment (5%, 3%, 7%) in simulations, Cirrhosis and T2D data, respectively, against the next best performing method, Random Forest. Availability and implementation: https://github.com/divya031090/TaxoNN_OTU.",
                "authors": [
                    {
                        "name": "Paterson A.D."
                    },
                    {
                        "name": "Sharma D."
                    },
                    {
                        "name": "Xu W."
                    }
                ],
                "citationCount": 1,
                "date": "2020-09-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "TaxoNN: Ensemble of neural networks on stratified microbiome data for disease prediction"
            },
            "pmcid": "PMC7750934",
            "pmid": "32449747"
        }
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Microbial ecology",
            "uri": "http://edamontology.org/topic_3697"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        }
    ]
}
