{
    "additionDate": "2017-01-13T13:14:26Z",
    "biotoolsCURIE": "biotools:echo",
    "biotoolsID": "echo",
    "credit": [
        {
            "email": "andrewhc@eecs.berkeley.edu",
            "name": "Andrew H. Chan",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "wckao@eecs.berkeley.edu",
            "name": "Wei-Chun Kao",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Reference-free short read error correction from diploid genomes, with explicit modeling of heterozygous sites.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://uc-echo.sourceforge.net/README.txt"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequencing error detection",
                    "uri": "http://edamontology.org/operation_3195"
                }
            ]
        }
    ],
    "homepage": "http://uc-echo.sourceforge.net/",
    "language": [
        "C++",
        "Python"
    ],
    "lastUpdate": "2018-12-10T12:58:53Z",
    "license": "BSD-3-Clause",
    "name": "ECHO",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "seqwiki_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Developing accurate, scalable algorithms to improve data quality is an important computational challenge associated with recent advances in high-throughput sequencing technology. In this study, a novel error-correction algorithm, called ECHO, is introduced for correcting base-call errors in short-reads, without the need of a reference genome. Unlike most previous methods, ECHO does not require the user to specify parameters of which optimal values are typically unknown a priori. ECHO automatically sets the parameters in the assumed model and estimates error characteristics specific to each sequencing run, while maintaining a running time that is within the range of practical use. ECHO is based on a probabilistic model and is able to assign a quality score to each corrected base. Furthermore, it explicitly models heterozygosity in diploid genomes and provides a reference-free method for detecting bases that originated from heterozygous sites. On both real and simulated data, ECHO is able to improve the accuracy of previous error-correction methods by several folds to an order of magnitude, depending on the sequence coverage depth and the position in the read. The improvement is most pronounced toward the end of the read, where previous methods become noticeably less effective. Using a whole-genome yeast data set, it is demonstrated here that ECHO is capable of coping with nonuniform coverage. Also, it is shown that using ECHO to perform error correction as a preprocessing step considerably facilitates de novo assembly, particularly in the case of low-to-moderate sequence coverage depth. © 2011 by Cold Spring Harbor Laboratory Press.",
                "authors": [
                    {
                        "name": "Kao W.-C."
                    },
                    {
                        "name": "Chan A.H."
                    },
                    {
                        "name": "Song Y.S."
                    }
                ],
                "citationCount": 76,
                "date": "2011-07-01T00:00:00Z",
                "journal": "Genome Research",
                "title": "ECHO: A reference-free short-read error correction algorithm"
            },
            "pmid": "21482625"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Data quality management",
            "uri": "http://edamontology.org/topic_3572"
        }
    ],
    "validated": 1
}