{
    "additionDate": "2017-02-07T13:18:23Z",
    "biotoolsCURIE": "biotools:elm",
    "biotoolsID": "elm",
    "credit": [
        {
            "email": "feedback@elm.eu.org",
            "name": "Support",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Tool for predicting eukaryotic protein functional sites that report domains, motifs, and sequence patterns based on the input sequence.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://elm.eu.org/infos/about.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence motif discovery",
                    "uri": "http://edamontology.org/operation_0238"
                },
                {
                    "term": "Protein fold recognition",
                    "uri": "http://edamontology.org/operation_0303"
                },
                {
                    "term": "Protein feature detection",
                    "uri": "http://edamontology.org/operation_3092"
                },
                {
                    "term": "Sequence motif recognition",
                    "uri": "http://edamontology.org/operation_0239"
                },
                {
                    "term": "Protein function prediction",
                    "uri": "http://edamontology.org/operation_1777"
                }
            ]
        }
    ],
    "homepage": "http://elm.eu.org/",
    "lastUpdate": "2018-12-10T12:58:55Z",
    "name": "Eukaryotic linear motif resource (ELM)",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "Linear motifs are short segments of multidomain proteins that provide regulatory functions independently of protein tertiary structure. Much of intracellular signalling passes through protein modifications at linear motifs. Many thousands of linear motif instances, most notably phosphorylation sites, have now been reported. Although clearly very abundant, linear motifs are difficult to predict de novo in protein sequences due to the difficulty of obtaining robust statistical assessments. The ELM resource at http://elm.eu.org/ provides an expanding knowledge base, currently covering 146 known motifs, with annotation that includes >1300 experimentally reported instances. ELM is also an exploratory tool for suggesting new candidates of known linear motifs in proteins of interest. Information about protein domains, protein structure and native disorder, cellular and taxonomic contexts is used to reduce or deprecate false positive matches. Results are graphically displayed in a 'Bar Code' format, which also displays known instances from homologous proteins through a novel 'Instance Mapper' protocol based on PHI-BLAST. ELM server output provides links to the ELM annotation as well as to a number of remote resources. Using the links, researchers can explore the motifs, proteins, complex structures and associated literature to evaluate whether candidate motifs might be worth experimental investigation. © The Author(s) 2009. Published by Oxford University Press.",
                "authors": [
                    {
                        "name": "Gould C.M."
                    },
                    {
                        "name": "Diella F."
                    },
                    {
                        "name": "Via A."
                    },
                    {
                        "name": "Puntervoll P."
                    },
                    {
                        "name": "Gemund C."
                    },
                    {
                        "name": "Chabanis-Davidson S."
                    },
                    {
                        "name": "Michael S."
                    },
                    {
                        "name": "Sayadi A."
                    },
                    {
                        "name": "Bryne J.C."
                    },
                    {
                        "name": "Chica C."
                    },
                    {
                        "name": "Seiler M."
                    },
                    {
                        "name": "Davey N.E."
                    },
                    {
                        "name": "Haslam N."
                    },
                    {
                        "name": "Weatheritt R.J."
                    },
                    {
                        "name": "Budd A."
                    },
                    {
                        "name": "Hughes T."
                    },
                    {
                        "name": "Pas J."
                    },
                    {
                        "name": "Rychlewski L."
                    },
                    {
                        "name": "Trave G."
                    },
                    {
                        "name": "Aasland R."
                    },
                    {
                        "name": "Helmer-Citterich M."
                    },
                    {
                        "name": "Linding R."
                    },
                    {
                        "name": "Gibson T.J."
                    }
                ],
                "citationCount": 204,
                "date": "2009-11-17T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "ELM: The status of the 2010 eukaryotic linear motif resource"
            },
            "pmid": "19920119"
        },
        {
            "metadata": {
                "abstract": "Linear motifs are short, evolutionarily plastic components of regulatory proteins and provide low-affinity interaction interfaces. These compact modules play central roles in mediating every aspect of the regulatory functionality of the cell. They are particularly prominent in mediating cell signaling, controlling protein turnover and directing protein localization. Given their importance, our understanding of motifs is surprisingly limited, largely as a result of the difficulty of discovery, both experimentally and computationally. The Eukaryotic Linear Motif (ELM) resource at http://elm.eu.org provides the biological community with a comprehensive database of known experimentally validated motifs, and an exploratory tool to discover putative linear motifs in user-submitted protein sequences. The current update of the ELM database comprises 1800 annotated motif instances representing 170 distinct functional classes, including approximately 500 novel instances and 24 novel classes. Several older motif class entries have been also revisited, improving annotation and adding novel instances. Furthermore, addition of full-text search capabilities, an enhanced interface and simplified batch download has improved the overall accessibility of the ELM data. The motif discovery portion of the ELM resource has added conservation, and structural attributes have been incorporated to aid users to discriminate biologically relevant motifs from stochastically occurring non-functional instances. © The Author(s) 2011. Published by Oxford University Press.",
                "authors": [
                    {
                        "name": "Dinkel H."
                    },
                    {
                        "name": "Michael S."
                    },
                    {
                        "name": "Weatheritt R.J."
                    },
                    {
                        "name": "Davey N.E."
                    },
                    {
                        "name": "Van Roey K."
                    },
                    {
                        "name": "Altenberg B."
                    },
                    {
                        "name": "Toedt G."
                    },
                    {
                        "name": "Uyar B."
                    },
                    {
                        "name": "Seiler M."
                    },
                    {
                        "name": "Budd A."
                    },
                    {
                        "name": "Jodicke L."
                    },
                    {
                        "name": "Dammert M.A."
                    },
                    {
                        "name": "Schroeter C."
                    },
                    {
                        "name": "Hammer M."
                    },
                    {
                        "name": "Schmidt T."
                    },
                    {
                        "name": "Jehl P."
                    },
                    {
                        "name": "McGuigan C."
                    },
                    {
                        "name": "Dymecka M."
                    },
                    {
                        "name": "Chica C."
                    },
                    {
                        "name": "Luck K."
                    },
                    {
                        "name": "Via A."
                    },
                    {
                        "name": "Chatr-Aryamontri A."
                    },
                    {
                        "name": "Haslam N."
                    },
                    {
                        "name": "Grebnev G."
                    },
                    {
                        "name": "Edwards R.J."
                    },
                    {
                        "name": "Steinmetz M.O."
                    },
                    {
                        "name": "Meiselbach H."
                    },
                    {
                        "name": "Diella F."
                    },
                    {
                        "name": "Gibson T.J."
                    }
                ],
                "citationCount": 233,
                "date": "2012-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "ELM - The database of eukaryotic linear motifs"
            },
            "pmid": "22110040"
        },
        {
            "metadata": {
                "abstract": "Multidomain proteins predominate in eukaryotic proteomes. Individual functions assigned to different sequence segments combine to create a complex function for the whole protein. While on-line resources are available for revealing globular domains in sequences, there has hitherto been no comprehensive collection of small functional sites/motifs comparable to the globular domain resources, yet these are as important for the function of multidomain proteins. Short linear peptide motifs are used for cell compartment targeting, protein-protein interaction, regulation by phosphorylation, acetylation, glycosylation and a host of other post-translational modifications. ELM, the Eukaryotic Linear Motif server at http://elm.eu.org/, is a new bioinformatics resource for investigating candidate short non-globular functional motifs in eukaryotic proteins, aiming to fill the void in bioinformatics tools. Sequence comparisons with short motifs are difficult to evaluate because the usual significance assessments are inappropriate. Therefore the server is implemented with several logical filters to eliminate false positives. Current filters are for cell compartment, globular domain clash and taxonomic range. In favourable cases, the filters can reduce the number of retained matches by an order of magnitude or more.",
                "authors": [
                    {
                        "name": "Puntervoll P."
                    },
                    {
                        "name": "Linding R."
                    },
                    {
                        "name": "Gemund C."
                    },
                    {
                        "name": "Chabanis-Davidson S."
                    },
                    {
                        "name": "Mattingsdal M."
                    },
                    {
                        "name": "Cameron S."
                    },
                    {
                        "name": "Martin D.M.A."
                    },
                    {
                        "name": "Ausiello G."
                    },
                    {
                        "name": "Brannetti B."
                    },
                    {
                        "name": "Costantini A."
                    },
                    {
                        "name": "Ferre F."
                    },
                    {
                        "name": "Maselli V."
                    },
                    {
                        "name": "Via A."
                    },
                    {
                        "name": "Cesareni G."
                    },
                    {
                        "name": "Diella F."
                    },
                    {
                        "name": "Superti-Furga G."
                    },
                    {
                        "name": "Wyrwicz L."
                    },
                    {
                        "name": "Ramu C."
                    },
                    {
                        "name": "McGuigan C."
                    },
                    {
                        "name": "Gudavalli R."
                    },
                    {
                        "name": "Letunic I."
                    },
                    {
                        "name": "Bork P."
                    },
                    {
                        "name": "Rychlewski L."
                    },
                    {
                        "name": "Kuster B."
                    },
                    {
                        "name": "Helmer-Citterich M."
                    },
                    {
                        "name": "Hunter W.N."
                    },
                    {
                        "name": "Aasland R."
                    },
                    {
                        "name": "Gibson T.J."
                    }
                ],
                "citationCount": 484,
                "date": "2003-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "ELM server: A new resource for investigating short functional sites in modular eukaryotic proteins"
            },
            "pmid": "12824381"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Sequence sites, features and motifs",
            "uri": "http://edamontology.org/topic_0160"
        },
        {
            "term": "Protein sites, features and motifs",
            "uri": "http://edamontology.org/topic_3510"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "Protein binding sites",
            "uri": "http://edamontology.org/topic_3534"
        }
    ],
    "validated": 1
}