{
    "additionDate": "2022-01-02T18:55:18.645740Z",
    "biotoolsCURIE": "biotools:deephistoclass",
    "biotoolsID": "deephistoclass",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "biraja.ghoshal@brunel.ac.uk",
            "name": "Biraja Ghoshal",
            "typeEntity": "Person"
        },
        {
            "email": "cecilia.lindskog@igp.uu.se",
            "name": "Cecilia Lindskog",
            "typeEntity": "Person"
        }
    ],
    "description": "A Novel Strategy for Confident Classification of Immunohistochemistry Images Using Deep Learning.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Fold recognition",
                    "uri": "http://edamontology.org/operation_0303"
                },
                {
                    "term": "Image annotation",
                    "uri": "http://edamontology.org/operation_3553"
                }
            ]
        }
    ],
    "homepage": "https://github.com/birajaghoshal/DeepHistoClass",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-01-02T18:55:18.648271Z",
    "name": "DeepHistoClass",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1016/J.MCPRO.2021.100140",
            "metadata": {
                "abstract": "© 2021 American Society for Biochemistry and Molecular Biology Inc.. All rights reserved.A multitude of efforts worldwide aim to create a single-cell reference map of the human body, for fundamental understanding of human health, molecular medicine, and targeted treatment. Antibody-based proteomics using immunohistochemistry (IHC) has proven to be an excellent technology for integration with large-scale single-cell transcriptomics datasets. The golden standard for evaluation of IHC staining patterns is manual annotation, which is expensive and may lead to subjective errors. Artificial intelligence holds much promise for efficient and accurate pattern recognition, but confidence in prediction needs to be addressed. Here, the aim was to present a reliable and comprehensive framework for automated annotation of IHC images. We developed a multilabel classification of 7848 complex IHC images of human testis corresponding to 2794 unique proteins, generated as part of the Human Protein Atlas (HPA) project. Manual annotation data for eight different cell types was generated as a basis for training and testing a proposed Hybrid Bayesian Neural Network. By combining the deep learning model with a novel uncertainty metric, DeepHistoClass (DHC) Confidence Score, the average diagnostic performance improved from 86.9% to 96.3%. This metric not only reveals which images are reliably classified by the model, but can also be utilized for identification of manual annotation errors. The proposed streamlined workflow can be developed further for other tissue types in health and disease and has important implications for digital pathology initiatives or large-scale protein mapping efforts such as the HPA project.",
                "authors": [
                    {
                        "name": "Ghoshal B."
                    },
                    {
                        "name": "Hikmet F."
                    },
                    {
                        "name": "Lindskog C."
                    },
                    {
                        "name": "Pineau C."
                    },
                    {
                        "name": "Tucker A."
                    }
                ],
                "date": "2021-01-01T00:00:00Z",
                "journal": "Molecular and Cellular Proteomics",
                "title": "Deephistoclass: A novel strategy for confident classification of immunohistochemistry images using deep learning"
            },
            "pmcid": "PMC8476775",
            "pmid": "34425263"
        }
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ],
    "validated": 1
}
