{
    "additionDate": "2022-11-07T07:28:41.337802Z",
    "biotoolsCURIE": "biotools:intomics_framework",
    "biotoolsID": "intomics_framework",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "ana.pacinkova@gmail.com",
            "name": "Anna Pačínková",
            "typeEntity": "Person"
        }
    ],
    "description": "IntOMICS: an efficient integrative framework based on Bayesian networks systematically analyses gene expression, copy number variation, DNA methylation, and biological prior knowledge to infer regulatory networks.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene expression profiling",
                    "uri": "http://edamontology.org/operation_0314"
                },
                {
                    "term": "Gene regulatory network analysis",
                    "uri": "http://edamontology.org/operation_1781"
                },
                {
                    "term": "Pathway analysis",
                    "uri": "http://edamontology.org/operation_3928"
                }
            ]
        }
    ],
    "homepage": "https://gitlab.ics.muni.cz/bias/intomics",
    "language": [
        "R"
    ],
    "lastUpdate": "2022-11-07T07:28:41.340937Z",
    "license": "Not licensed",
    "name": "IntOMICS",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1186/S12859-022-04891-9",
            "metadata": {
                "abstract": "© 2022, The Author(s).Background: Integration of multi-omics data can provide a more complex view of the biological system consisting of different interconnected molecular components, the crucial aspect for developing novel personalised therapeutic strategies for complex diseases. Various tools have been developed to integrate multi-omics data. However, an efficient multi-omics framework for regulatory network inference at the genome level that incorporates prior knowledge is still to emerge. Results: We present IntOMICS, an efficient integrative framework based on Bayesian networks. IntOMICS systematically analyses gene expression, DNA methylation, copy number variation and biological prior knowledge to infer regulatory networks. IntOMICS complements the missing biological prior knowledge by so-called empirical biological knowledge, estimated from the available experimental data. Regulatory networks derived from IntOMICS provide deeper insights into the complex flow of genetic information on top of the increasing accuracy trend compared to a published algorithm designed exclusively for gene expression data. The ability to capture relevant crosstalks between multi-omics modalities is verified using known associations in microsatellite stable/instable colon cancer samples. Additionally, IntOMICS performance is compared with two algorithms for multi-omics regulatory network inference that can also incorporate prior knowledge in the inference framework. IntOMICS is also applied to detect potential predictive biomarkers in microsatellite stable stage III colon cancer samples. Conclusions: We provide IntOMICS, a framework for multi-omics data integration using a novel approach to biological knowledge discovery. IntOMICS is a powerful resource for exploratory systems biology and can provide valuable insights into the complex mechanisms of biological processes that have a vital role in personalised medicine.",
                "authors": [
                    {
                        "name": "Pacinkova A."
                    },
                    {
                        "name": "Popovici V."
                    }
                ],
                "citationCount": 1,
                "date": "2022-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Using empirical biological knowledge to infer regulatory networks from multi-omics data"
            },
            "pmcid": "PMC9396869",
            "pmid": "35996085"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Copy number variation",
            "uri": "http://edamontology.org/topic_3958"
        },
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ],
    "validated": 1
}
