{
    "additionDate": "2015-12-02T14:55:21Z",
    "biotoolsCURIE": "biotools:rpredictor",
    "biotoolsID": "rpredictor",
    "collectionID": [
        "Czech Republic",
        "ELIXIR-CZ"
    ],
    "credit": [
        {
            "name": "ELIXIR-CZ",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        },
        {
            "email": "david.hoksza@gmail.com",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "panek@biomed.cas.cz",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "A web database for prediction, analysis and storage of secondary structures of RNAs.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://rpredictor.ms.mff.cuni.cz/documentation/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "elixirNode": [
        "Czech Republic"
    ],
    "elixirPlatform": [
        "Tools"
    ],
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Nucleic acid sequence record",
                        "uri": "http://edamontology.org/data_2887"
                    }
                }
            ],
            "operation": [
                {
                    "term": "Prediction and recognition",
                    "uri": "http://edamontology.org/operation_2423"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "RNA secondary structure",
                        "uri": "http://edamontology.org/data_0880"
                    }
                }
            ]
        }
    ],
    "homepage": "http://rpredictordb.elixir-czech.cz",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-11-03T07:31:32.332874Z",
    "maturity": "Mature",
    "name": "rPredictor",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "ELIXIR-CZ",
    "publication": [
        {
            "doi": "10.1109/BIBM.2014.6999394",
            "metadata": {
                "abstract": "© 2014 IEEE.Determining the structure of ribosomal RNAs (rRNAs) is one of the crucial steps in understanding the process of protein synthesis, for which rRNAs are one of the basic components. Nevertheless, due to extreme technical difficulties, spatial (3D) structures have been resolved experimentally for only 14 organisms. Also, computational prediction of 3D rRNA structure is almost impossible, and prediction of secondary structure (the list of base pairs in the folded RNA), an important intermediate step between sequence and 3D structure that is used broadly in modeling of RNA structures, is in the case of rRNAs hindered by both extreme sequence length and high structure complexity. Here we present a proof-of-concept for an rRNA secondary structure prediction method that utilizes known structures as structural templates. Our template-based prediction algorithm determines those regions of the sequence for which structure is being predicted that are conserved well enough so that their secondary structure can be copied over from the template. The structure of the remaining, unconserved regions is predicted using a thermodynamic folding model. Applying a baseline implementation of our algorithm to the E. coli 16S rRNA, we have achieved state-of-the-art recall and precision using the structure of T. thermophilus 16S rRNA as a template.",
                "authors": [
                    {
                        "name": "Panek J."
                    },
                    {
                        "name": "Hajic J."
                    },
                    {
                        "name": "Hoksza D."
                    }
                ],
                "date": "2014-01-01T00:00:00Z",
                "journal": "Proceedings - 2014 IEEE International Conference on Bioinformatics and Biomedicine, IEEE BIBM 2014",
                "title": "Template-based prediction of ribosomal RNA secondary structure"
            },
            "type": [
                "Primary"
            ]
        },
        {
            "doi": "10.3389/database/baz047",
            "type": [
                "Usage"
            ]
        },
        {
            "doi": "10.3389/fgene.2017.00147",
            "metadata": {
                "abstract": "© 2017 Pánek, Modrák and Schwarz.While understanding the structure of RNA molecules is vital for deciphering their functions, determining RNA structures experimentally is exceptionally hard. At the same time, extant approaches to computational RNA structure prediction have limited applicability and reliability. In this paper we provide a method to solve a simpler yet still biologically relevant problem: prediction of secondary RNA structure using structure of different molecules as a template. Our method identifies conserved and unconserved subsequences within an RNA molecule. For conserved subsequences, the template structure is directly transferred into the generated structure and combined with de-novo predicted structure for the unconserved subsequences with low evolutionary conservation. The method also determines, when the generated structure is unreliable. The method is validated using experimentally identified structures. The accuracy of the method exceeds that of classical prediction algorithms and constrained prediction methods. This is demonstrated by comparison using large number of heterogeneous RNAs. The presented method is fast and robust, and useful for various applications requiring knowledge of secondary structures of individual RNA sequences.",
                "authors": [
                    {
                        "name": "Panek J."
                    },
                    {
                        "name": "Modrak M."
                    },
                    {
                        "name": "Schwarz M."
                    }
                ],
                "citationCount": 2,
                "date": "2017-10-10T00:00:00Z",
                "journal": "Frontiers in Genetics",
                "title": "An algorithm for template-based prediction of secondary structures of individual RNA sequences"
            },
            "type": [
                "Method"
            ]
        },
        {
            "doi": "10.1186/s12859-017-1885-4",
            "metadata": {
                "abstract": "© 2017 The Author(s).Background: Visualization of RNA secondary structures is a complex task, and, especially in the case of large RNA structures where the expected layout is largely habitual, the existing visualization tools often fail to produce suitable visualizations. This led us to the idea to use existing layouts as templates for the visualization of new RNAs similarly to how templates are used in homology-based structure prediction. Results: This article introduces Traveler, a software tool enabling visualization of a target RNA secondary structure using an existing layout of a sufficiently similar RNA structure as a template. Traveler is based on an algorithm which converts the target and template structures into corresponding tree representations and utilizes tree edit distance coupled with layout modification operations to transform the template layout into the target one. Traveler thus accepts a pair of secondary structures and a template layout and outputs a layout for the target structure. Conclusions: Traveler is a command-line open source tool able to quickly generate layouts for even the largest RNA structures in the presence of a sufficiently similar layout. It is available at http://github.com/davidhoksza/traveler.",
                "authors": [
                    {
                        "name": "Elias R."
                    },
                    {
                        "name": "Hoksza D."
                    }
                ],
                "citationCount": 7,
                "date": "2017-11-15T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "TRAVeLer: A tool for template-based RNA secondary structure visualization"
            },
            "type": [
                "Method"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Nucleic acid structure analysis",
            "uri": "http://edamontology.org/topic_0097"
        },
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        }
    ],
    "version": [
        "1.0"
    ]
}