{
    "additionDate": "2021-01-18T07:39:47Z",
    "biotoolsCURIE": "biotools:stir",
    "biotoolsID": "stir",
    "confidence_flag": "tool",
    "description": "PET image reconstruction using physical and mathematical modelling for time of flight PET-MR scanners in the STIR library.\n\nThis work demonstrates how computational and physical modelling of the positron emission tomography (PET) image acquisition process for a state-of-the-art integrated PET and magnetic resonance imaging (PET-MR) system can produce images comparable to the manufacturer. The GE SIGNA PET MR scanner is manufactured by General Electric and has time-of-flight (TOF) capabilities of about 390 ps. All software development took place in the Software for Tomographic Image Reconstruction (STIR: http: stir.sf.net) library, which is a widely used open source software to reconstruct data as exported from emission tomography scanners. The new software developments will be integrated into STIR, providing the opportunity for researchers worldwide to establish and expand their image reconstruction methods",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Metabolic network modelling",
                    "uri": "http://edamontology.org/operation_3660"
                },
                {
                    "term": "Modelling and simulation",
                    "uri": "http://edamontology.org/operation_2426"
                },
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                }
            ]
        }
    ],
    "homepage": "http://stir.sourceforge.net/",
    "lastUpdate": "2021-02-24T09:52:49Z",
    "name": "STIR",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1016/J.YMETH.2020.01.005",
            "metadata": {
                "abstract": "© 2020 The AuthorsThis work demonstrates how computational and physical modelling of the positron emission tomography (PET) image acquisition process for a state-of-the-art integrated PET and magnetic resonance imaging (PET-MR) system can produce images comparable to the manufacturer. The GE SIGNA PET/MR scanner is manufactured by General Electric and has time-of-flight (TOF) capabilities of about 390 ps. All software development took place in the Software for Tomographic Image Reconstruction (STIR: http://stir.sf.net) library, which is a widely used open source software to reconstruct data as exported from emission tomography scanners. The new software developments will be integrated into STIR, providing the opportunity for researchers worldwide to establish and expand their image reconstruction methods. Furthermore, this work is of particular significance as it provides the first validation of TOF PET image reconstruction for real scanner datasets using the STIR library. This paper presents the methodology, analysis, and critical issues encountered in implementing an independent reconstruction software package. Acquired PET data were processed via several appropriate algorithms which are necessary to produce an accurate and precise quantitative image. This included mathematical, physical and anatomical modelling of the patient and simulation of various aspects of the acquisition. These included modelling of random coincidences using ‘singles’ rates per crystals, detector efficiencies and geometric effects. Attenuation effects were calculated by using the STIR's attenuation correction model. Modelling all these effects within the system matrix allowed the reconstruction of PET images which demonstrates the metabolic uptake of the administered radiopharmaceutical. These implementations were validated using measured phantom and clinical datasets. The developments are tested using the ordered subset expectation maximisation (OSEM) and the more recently proposed kernelised expectation maximisation (KEM) algorithm which incorporates anatomical information from MR images into PET reconstruction.",
                "authors": [
                    {
                        "name": "Wadhwa P."
                    },
                    {
                        "name": "Thielemans K."
                    },
                    {
                        "name": "Efthimiou N."
                    },
                    {
                        "name": "Wangerin K."
                    },
                    {
                        "name": "Keat N."
                    },
                    {
                        "name": "Emond E."
                    },
                    {
                        "name": "Deller T."
                    },
                    {
                        "name": "Bertolli O."
                    },
                    {
                        "name": "Deidda D."
                    },
                    {
                        "name": "Delso G."
                    },
                    {
                        "name": "Tohme M."
                    },
                    {
                        "name": "Jansen F."
                    },
                    {
                        "name": "Gunn R.N."
                    },
                    {
                        "name": "Hallett W."
                    },
                    {
                        "name": "Tsoumpas C."
                    }
                ],
                "citationCount": 6,
                "date": "2021-01-01T00:00:00Z",
                "journal": "Methods",
                "title": "PET image reconstruction using physical and mathematical modelling for time of flight PET-MR scanners in the STIR library"
            },
            "pmid": "32006678"
        }
    ],
    "topic": [
        {
            "term": "Tomography",
            "uri": "http://edamontology.org/topic_3452"
        },
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "Mathematics",
            "uri": "http://edamontology.org/topic_3315"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        }
    ]
}