{
    "additionDate": "2017-07-20T13:41:47Z",
    "biotoolsCURIE": "biotools:opentrials",
    "biotoolsID": "opentrials",
    "credit": [
        {
            "email": "ben.goldacre@phc.ox.ac.uk",
            "name": "Ben Goldacre",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://opentrials.net/about/"
        },
        {
            "email": "opentrials@okfn.org",
            "typeEntity": "Person",
            "typeRole": [
                "Support"
            ]
        }
    ],
    "description": "OpenTrials is a collaboration between Open Knowledge International and Dr Ben Goldacre from the University of Oxford DataLab. It aims to locate, match, and share all publicly accessible data and documents, on all trials conducted, on all medicines and other treatments, globally.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://opentrials.net/about/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Data",
                        "uri": "http://edamontology.org/data_0006"
                    }
                }
            ],
            "note": "Returns trials based on a search query. By default, it'll search in all of a trial's attributes.\n- `q` is a [ElasticSearch query string](https://www.elastic.co/guide/en/elasticsearch/reference/2.3/query-dsl-query-string-query.html#query-string-syntax) (e.g. `public_title:(depressive OR depression)`)\n- `page` can take a value between `1` and `100`\n- `per_page` can take a value between `10` and `100`",
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Data",
                        "uri": "http://edamontology.org/data_0006"
                    }
                }
            ]
        }
    ],
    "homepage": "https://opentrials.net/",
    "lastUpdate": "2021-04-26T08:38:16.122407Z",
    "link": [
        {
            "type": [
                "Social media"
            ],
            "url": "https://twitter.com/opentrials"
        },
        {
            "type": [
                "Discussion forum"
            ],
            "url": "https://discuss.okfn.org/c/projects/open-trials"
        }
    ],
    "maturity": "Emerging",
    "name": "OpenTrials API",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "otherID": [
        {
            "type": "rrid",
            "value": "RRID:SCR_015570"
        }
    ],
    "owner": "jmelius",
    "publication": [
        {
            "doi": "10.1186/s13063-016-1290-8",
            "metadata": {
                "abstract": "© 2016 Goldacre and Gray.OpenTrials is a collaborative and open database for all available structured data and documents on all clinical trials, threaded together by individual trial. With a versatile and expandable data schema, it is initially designed to host and match the following documents and data for each trial: registry entries; links, abstracts, or texts of academic journal papers; portions of regulatory documents describing individual trials; structured data on methods and results extracted by systematic reviewers or other researchers; clinical study reports; and additional documents such as blank consent forms, blank case report forms, and protocols. The intention is to create an open, freely re-usable index of all such information and to increase discoverability, facilitate research, identify inconsistent data, enable audits on the availability and completeness of this information, support advocacy for better data and drive up standards around open data in evidence-based medicine. The project has phase I funding. This will allow us to create a practical data schema and populate the database initially through web-scraping, basic record linkage techniques, crowd-sourced curation around selected drug areas, and import of existing sources of structured and documents. It will also allow us to create user-friendly web interfaces onto the data and conduct user engagement workshops to optimise the database and interface designs. Where other projects have set out to manually and perfectly curate a narrow range of information on a smaller number of trials, we aim to use a broader range of techniques and attempt to match a very large quantity of information on all trials. We are currently seeking feedback and additional sources of structured data.",
                "authors": [
                    {
                        "name": "Goldacre B."
                    },
                    {
                        "name": "Gray J."
                    }
                ],
                "citationCount": 1,
                "date": "2018-07-23T00:00:00Z",
                "journal": "Getting to Good: Research Integrity in the Biomedical Sciences",
                "title": "Opentrials: Towards a collaborative open database of all available information on all clinical trials"
            }
        }
    ],
    "toolType": [
        "Web API",
        "Database portal"
    ],
    "topic": [
        {
            "term": "Preclinical and clinical studies",
            "uri": "http://edamontology.org/topic_3379"
        }
    ],
    "validated": 1
}