{
    "additionDate": "2019-11-14T18:34:10Z",
    "biotoolsCURIE": "biotools:SE-DMTG",
    "biotoolsID": "SE-DMTG",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "liugx@jlu.edu.cn",
            "name": "Guixia Liu",
            "typeEntity": "Person"
        }
    ],
    "description": "> MEDIUM CONFIDENCE! | > HOMEPAGE MISSING! | A seed-extended algorithm for detecting protein complexes based on density and modularity with topological structure and GO annotations | BACKGROUND:The detection of protein complexes is of great significance for researching mechanisms underlying complex diseases and developing new drugs. Thus, various computational algorithms have been proposed for protein complex detection. However, most of these methods are based on only topological information and are sensitive to the reliability of interactions. As a result, their performance is affected by false-positive interactions in PPINs. Moreover, these methods consider only density and modularity and ignore protein complexes with various densities and modularities",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                },
                {
                    "term": "Protein interaction prediction",
                    "uri": "http://edamontology.org/operation_2492"
                }
            ]
        }
    ],
    "homepage": "https://github.com/RongquanWang/SE-DMTG",
    "lastUpdate": "2020-12-18T08:44:02Z",
    "name": "SE-DMTG",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12864-019-5956-Y",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: The detection of protein complexes is of great significance for researching mechanisms underlying complex diseases and developing new drugs. Thus, various computational algorithms have been proposed for protein complex detection. However, most of these methods are based on only topological information and are sensitive to the reliability of interactions. As a result, their performance is affected by false-positive interactions in PPINs. Moreover, these methods consider only density and modularity and ignore protein complexes with various densities and modularities. Results: To address these challenges, we propose an algorithm to exploit protein complexes in PPINs by a Seed-Extended algorithm based on Density and Modularity with Topological structure and GO annotations, named SE-DMTG to improve the accuracy of protein complex detection. First, we use common neighbors and GO annotations to construct a weighted PPIN. Second, we define a new seed selection strategy to select seed nodes. Third, we design a new fitness function to detect protein complexes with various densities and modularities. We compare the performance of SE-DMTG with that of thirteen state-of-the-art algorithms on several real datasets. Conclusion: The experimental results show that SE-DMTG not only outperforms some classical algorithms in yeast PPINs in terms of the F-measure and Jaccard but also achieves an ideal performance in terms of functional enrichment. Furthermore, we apply SE-DMTG to PPINs of several other species and demonstrate the outstanding accuracy and matching ratio in detecting protein complexes compared with other algorithms.",
                "authors": [
                    {
                        "name": "Wang R."
                    },
                    {
                        "name": "Wang C."
                    },
                    {
                        "name": "Sun L."
                    },
                    {
                        "name": "Liu G."
                    }
                ],
                "citationCount": 3,
                "date": "2019-08-07T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "A seed-extended algorithm for detecting protein complexes based on density and modularity with topological structure and GO annotations"
            },
            "pmcid": "PMC6686515",
            "pmid": "31390979"
        }
    ],
    "topic": [
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ],
    "validated": 1
}