
{
    "credit": [
        {
            "name": "Contact Form",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://book.bionumbers.org/contact/"
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://kirschner.med.harvard.edu/files/bionumbers/BioNumbershandout.pdf"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Molecular replacement",
                    "uri": "http://edamontology.org/operation_3455"
                },
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                },
                {
                    "term": "Text mining",
                    "uri": "http://edamontology.org/operation_0306"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "SQL"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Database portal"
        ],
        "topic": [
            {
                "term": "Small molecules",
                "uri": "http://edamontology.org/topic_0154"
            },
            {
                "term": "Database management",
                "uri": "http://edamontology.org/topic_3489"
            },
            {
                "term": "Cell biology",
                "uri": "http://edamontology.org/topic_2229"
            },
            {
                "term": "Zoology",
                "uri": "http://edamontology.org/topic_3500"
            },
            {
                "term": "Systems biology",
                "uri": "http://edamontology.org/topic_2259"
            }
        ]
    },
    "publication": [
        {
            "abstract": "BioNumbers (http://www.bionumbers.hms.harvard.edu) is a database of key numbers in molecular and cell biology-the quantitative properties of biological systems of interest to computational, systems and molecular cell biologists. Contents of the database range from cell sizes to metabolite concentrations, from reaction rates to generation times, from genome sizes to the number of mitochondria in a cell. While always of importance to biologists, having numbers in hand is becoming increasingly critical for experimenting, modeling, and analyzing biological systems. BioNumbers was motivated by an appreciation of how long it can take to find even the simplest number in the vast biological literature. All numbers are taken directly from a literature source and that reference is provided with the number. BioNumbers is designed to be highly searchable and queries can be performed by keywords or browsed by menus. BioNumbers is a collaborative community platform where registered users can add content and make comments on existing data. All new entries and commentary are curated to maintain high quality. Here we describe the database characteristics and implementation, demonstrate its use, and discuss future directions for its development. © The Author(s) 2009. Published by Oxford University Press.",
            "authors": [
                "Milo R.",
                "Jorgensen P.",
                "Moran U.",
                "Weber G.",
                "Springer M."
            ],
            "cit_count": 284,
            "journal": "Nucleic Acids Research",
            "pmid": "19854939",
            "title": "BioNumbers The database of key numbers in molecular and cell biology",
            "year": "2009-10-23"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:bionumbers",
        "biotoolsID": "bionumbers",
        "description": "Database of key numbers in molecular and cell biology--the quantitative properties of biological systems of interest to computational, systems and molecular cell biologists. Contents of the database range from cell sizes to metabolite concentrations, from reaction rates to generation times, from genome sizes to the number of mitochondria in a cell. All numbers are taken directly from a literature source and that reference is provided with the number.",
        "homepage": "http://www.bionumbers.hms.harvard.edu",
        "name": "BioNumbers"
    }
}