
{
    "credit": [
        {
            "email": "jmacdon@u.washington.edu",
            "name": "James W. MacDonald",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "User manual",
            "url": "http://bioconductor.org/packages/release/bioc/html/makecdfenv.html"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://bioconductor/packages/release/bioc/src/contrib/makecdfenv_1.50.0.tar.gz"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Gene expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                }
            ]
        }
    ],
    "labels": {
        "collectionID": [
            "BioConductor"
        ],
        "language": [
            "R"
        ],
        "license": "GPL-2.0",
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Command-line tool",
            "Library"
        ],
        "topic": [
            {
                "term": "Probes and primers",
                "uri": "http://edamontology.org/topic_0632"
            },
            {
                "term": "Gene expression",
                "uri": "http://edamontology.org/topic_0203"
            },
            {
                "term": "Molecular genetics",
                "uri": "http://edamontology.org/topic_3321"
            }
        ]
    },
    "publication": [
        {
            "abstract": "Background: Hybridization differences caused by target sequence differences can be a confounding factor in analyzing gene expression on microarrays, lead to false positives and reduce power to detect real expression differences. We prepared an R Bioconductor compatible package to detect, characterize and remove such probes in Affymetrix 3'IVT and exon-based arrays on the basis of correlation of signal intensities from probes within probe sets.Results: Using completely mouse genomes we determined type 1 (false negatives) and type 2 (false positives) errors with high accuracy and we show that our method routinely outperforms previous methods. When detecting 76.2% of known SNP/indels in mouse expression data, we obtain at most 5.5% false positives. At the same level of false positives, best previous method detected 72.6%. We also show that probes with differing binding affinity both hinder differential expression detection and introduce artifacts in cancer-healthy tissue comparison.Conclusions: Detection and removal of such probes should be a routine step in Affymetrix data preprocessing. We prepared a user friendly R package, compatible with Bioconductor, that allows the filtering and improving of data from Affymetrix microarrays experiments. © 2012 Dannemann et al.; licensee BioMed Central Ltd.",
            "authors": [
                "Dannemann M.",
                "Lachmann M.",
                "Lorenc A."
            ],
            "cit_count": 3,
            "doi": "10.1186/1471-2105-13-56",
            "journal": "BMC Bioinformatics",
            "title": "'maskBAD' - a package to detect and remove Affymetrix probes with binding affinity differences",
            "type": "Primary",
            "year": "2012-04-16"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:makecdfenv",
        "biotoolsID": "makecdfenv",
        "description": "This package has two functions. One reads a Affymetrix chip description file (CDF) and creates a hash table environment containing the location/probe set membership mapping. The other creates a package that automatically loads that environment.",
        "homepage": "http://bioconductor.org/packages/release/bioc/html/makecdfenv.html",
        "name": "makecdfenv",
        "version": [
            "1.50.0"
        ]
    }
}