{
    "additionDate": "2021-01-20T10:55:35Z",
    "biotoolsCURIE": "biotools:cg-target",
    "biotoolsID": "cg-target",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "charlie.boone@utoronto.ca",
            "name": "Charles Boone",
            "typeEntity": "Person"
        },
        {
            "email": "chadm@umn.edu",
            "name": "Chad L. Myers",
            "typeEntity": "Person"
        }
    ],
    "description": "Predicting bioprocess targets of chemical compounds through integration of chemical-genetic and genetic interactions.\n\nCG-TARGET is a collection of R scripts to be used for the purpose of predicting gene-set targets from chemical-genetic interaction profiles.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                },
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                }
            ]
        }
    ],
    "homepage": "https://github.com/csbio/CG-TARGET",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-05-13T06:17:12Z",
    "name": "CG-TARGET",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PCBI.1006532",
            "metadata": {
                "abstract": "© 2018 Simpkins et al. http://creativecommons.org/licenses/by/4.0/.Chemical-genetic interactions–observed when the treatment of mutant cells with chemical compounds reveals unexpected phenotypes–contain rich functional information linking compounds to their cellular modes of action. To systematically identify these interactions, an array of mutants is challenged with a compound and monitored for fitness defects, generating a chemical-genetic interaction profile that provides a quantitative, unbiased description of the cellular function(s) perturbed by the compound. Genetic interactions, obtained from genome-wide double-mutant screens, provide a key for interpreting the functional information contained in chemical-genetic interaction profiles. Despite the utility of this approach, integrative analyses of genetic and chemical-genetic interaction networks have not been systematically evaluated. We developed a method, called CG-TARGET (Chemical Genetic Translation via A Reference Genetic nETwork), that integrates large-scale chemical-genetic interaction screening data with a genetic interaction network to predict the biological processes perturbed by compounds. In a recent publication, we applied CG-TARGET to a screen of nearly 14,000 chemical compounds in Saccharomyces cerevisiae, integrating this dataset with the global S. cerevisiae genetic interaction network to prioritize over 1500 compounds with high-confidence biological process predictions for further study. We present here a formal description and rigorous benchmarking of the CG-TARGET method, showing that, compared to alternative enrichment-based approaches, it achieves similar or better accuracy while substantially improving the ability to control the false discovery rate of biological process predictions. Additional investigation of the compatibility of chemical-genetic and genetic interaction profiles revealed that one-third of observed chemical-genetic interactions contributed to the highest-confidence biological process predictions and that negative chemical-genetic interactions overwhelmingly formed the basis of these predictions. We also present experimental validations of CG-TARGET-predicted tubulin polymerization and cell cycle progression inhibitors. Our approach successfully demonstrates the use of genetic interaction networks in the high-throughput functional annotation of compounds to biological processes.",
                "authors": [
                    {
                        "name": "Simpkins S.W."
                    },
                    {
                        "name": "Nelson J."
                    },
                    {
                        "name": "Deshpande R."
                    },
                    {
                        "name": "Li S.C."
                    },
                    {
                        "name": "Piotrowski J.S."
                    },
                    {
                        "name": "Wilson E.H."
                    },
                    {
                        "name": "Gebre A.A."
                    },
                    {
                        "name": "Safizadeh H."
                    },
                    {
                        "name": "Okamoto R."
                    },
                    {
                        "name": "Yoshimura M."
                    },
                    {
                        "name": "Costanzo M."
                    },
                    {
                        "name": "Yashiroda Y."
                    },
                    {
                        "name": "Ohya Y."
                    },
                    {
                        "name": "Osada H."
                    },
                    {
                        "name": "Yoshida M."
                    },
                    {
                        "name": "Boone C."
                    },
                    {
                        "name": "Myers C.L."
                    }
                ],
                "citationCount": 5,
                "date": "2018-10-01T00:00:00Z",
                "journal": "PLoS Computational Biology",
                "title": "Predicting bioprocess targets of chemical compounds through integration of chemical-genetic and genetic interactions"
            },
            "pmcid": "PMC6226211",
            "pmid": "30376562"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Drug discovery",
            "uri": "http://edamontology.org/topic_3336"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        }
    ]
}