{
    "additionDate": "2017-03-25T18:18:19Z",
    "biotoolsCURIE": "biotools:weblab",
    "biotoolsID": "weblab",
    "credit": [
        {
            "email": "weblab@mail.cbi.pku.edu.cn",
            "name": "WebLab Team",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "An integrative knowledge sharing system that supports collaboration of biological researchers from various fields. WebLab allows users to fetch, analyze with more than 260 integrated bioinformatic tools, manipulate and share data under an intuitive web interface. These tools can be further organized as customized workflows.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Literature search",
                    "uri": "http://edamontology.org/operation_0305"
                },
                {
                    "term": "Text mining",
                    "uri": "http://edamontology.org/operation_0306"
                }
            ]
        }
    ],
    "homepage": "http://weblab.cbi.pku.edu.cn",
    "homepage_status": 1,
    "language": [
        "Java"
    ],
    "lastUpdate": "2018-12-10T12:58:54Z",
    "name": "WebLab",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "With the rapid progress of biological research, great demands are proposed for integrative knowledge-sharing systems to efficiently support collaboration of biological researchers from various fields. To fulfill such requirements, we have developed a data-centric knowledge-sharing platform WebLab for biologists to fetch, analyze, manipulate and share data under an intuitive web interface. Dedicated space is provided for users to store their input data and analysis results. Users can upload local data or fetch public data from remote databases, and then perform analysis using more than 260 integrated bioinformatic tools. These tools can be further organized as customized analysis workflows to accomplish complex tasks automatically. In addition to conventional biological data, WebLab also provides rich supports for scientific literatures, such as searching against full text of uploaded literatures and exporting citations into various well-known citation managers such as EndNote and BibTex. To facilitate team work among colleagues, WebLab provides a powerful and flexible sharing mechanism, which allows users to share input data, analysis results, scientific literatures and customized workflows to specified users or groups with sophisticated privilege settings. WebLab is publicly available at http://weblab.cbi.pku.edu.cn with all source code released as Free Software.",
                "authors": [
                    {
                        "name": "Liu X."
                    },
                    {
                        "name": "Wu J."
                    },
                    {
                        "name": "Wang J."
                    },
                    {
                        "name": "Liu X."
                    },
                    {
                        "name": "Zhao S."
                    },
                    {
                        "name": "Li Z."
                    },
                    {
                        "name": "Kong L."
                    },
                    {
                        "name": "Gu X."
                    },
                    {
                        "name": "Luo J."
                    },
                    {
                        "name": "Gao G."
                    }
                ],
                "citationCount": 22,
                "date": "2009-08-04T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "WebLab: A data-centric, knowledge-sharing bioinformatic platform"
            },
            "pmid": "19465388"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Literature and language",
            "uri": "http://edamontology.org/topic_3068"
        },
        {
            "term": "Bioinformatics",
            "uri": "http://edamontology.org/topic_0091"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Structure analysis",
            "uri": "http://edamontology.org/topic_0081"
        }
    ],
    "validated": 1
}