{
    "additionDate": "2017-03-24T11:45:21Z",
    "biotoolsCURIE": "biotools:info-rna",
    "biotoolsID": "info-rna",
    "credit": [
        {
            "name": "Contact Form",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://rna.informatik.uni-freiburg.de/EmailNotification.jsp?toolName=INFORNA"
        }
    ],
    "description": "INFO-RNA is a server for the design of RNA sequences that fold into a given pseudo-knot free RNA secondary structure.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://rna.informatik.uni-freiburg.de/Help.jsp?toolName=INFORNA"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "RNA secondary structure prediction",
                    "uri": "http://edamontology.org/operation_0278"
                },
                {
                    "term": "Structured RNA prediction and optimisation",
                    "uri": "http://edamontology.org/operation_0483"
                },
                {
                    "term": "Structure visualisation",
                    "uri": "http://edamontology.org/operation_0570"
                },
                {
                    "term": "RNA secondary structure alignment",
                    "uri": "http://edamontology.org/operation_0502"
                }
            ]
        }
    ],
    "homepage": "http://www.bioinf.uni-freiburg.de/Software/INFO-RNA/start.html",
    "language": [
        "C++"
    ],
    "lastUpdate": "2018-12-10T12:58:54Z",
    "name": "INFO-RNA",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "Motivation: The structure of RNA molecules is often crucial for their function. Therefore, secondary structure prediction has gained much interest. Here, we consider the inverse RNA folding problem, which means designing RNA sequences that fold into a given structure. Results: We introduce a new algorithm for the inverse folding problem (INFO-RNA) that consists of two parts; a dynamic programming method for good initial sequences and a following improved stochastic local search that uses an effective neighbor selection method. During the initialization, we design a sequence that among all sequences adopts the given structure with the lowest possible energy. For the selection of neighbors during the search, we use a kind of look-ahead of one selection step applying an additional energy-based criterion. Afterwards, the pre-ordered neighbors are tested using the actual optimization criterion of minimizing the structure distance between the target structure and the mfe structure of the considered neighbor. We compared our algorithm to RNAinverse and RNA-SSD for artificial and biological test sets. Using INFO-RNA, we performed better than RNAinverse and in most cases, we gained better results than RNA-SSD, the probably best inverse RNA folding tool on the market. © 2006 Oxford University Press.",
                "authors": [
                    {
                        "name": "Busch A."
                    },
                    {
                        "name": "Backofen R."
                    }
                ],
                "citationCount": 68,
                "date": "2006-08-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "INFO-RNA - A fast approach to inverse RNA folding"
            },
            "pmid": "16709587"
        },
        {
            "metadata": {
                "abstract": "INFO-RNA is a new web server for designing RNA sequences that fold into a user given secondary structure. Furthermore, constraints on the sequence can be specified, e.g. one can restrict sequence positions to a fixed nucleotide or to a set of nucleotides. Moreover, the user can allow violations of the constraints at some positions, which can be advantageous in complicated cases. The INFO-RNA web server allows biologists to design RNA sequences in an automatic manner. It is clearly and intuitively arranged and easy to use. The procedure is fast, as most applications are completed within seconds and it proceeds better and faster than other existing tools. The INFO-RNA web server is freely available at http://www.bioinf. uni-freiburg.de/Software/INFO-RNA/. © 2007 The Author(s).",
                "authors": [
                    {
                        "name": "Busch A."
                    },
                    {
                        "name": "Backofen R."
                    }
                ],
                "citationCount": 20,
                "date": "2007-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "INFO-RNA-a server for fast inverse RNA folding satisfying sequence constraints"
            },
            "pmid": "17452349"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        },
        {
            "term": "Structure prediction",
            "uri": "http://edamontology.org/topic_0082"
        },
        {
            "term": "Nucleic acid structure analysis",
            "uri": "http://edamontology.org/topic_0097"
        },
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Protein folds and structural domains",
            "uri": "http://edamontology.org/topic_0736"
        }
    ],
    "validated": 1
}