{
    "additionDate": "2018-05-16T11:47:03Z",
    "biotoolsCURIE": "biotools:miframe",
    "biotoolsID": "miframe",
    "credit": [
        {
            "email": "andreas.keller@ccb.uni-saarland.de",
            "name": "Keller A",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Analysis and visualization of miRNA sequencing data in neurological disorders.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://ccb-compute2.cs.uni-saarland.de/miframe/step_by_step_tutorial_miframe.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "RNA-Seq analysis",
                    "uri": "http://edamontology.org/operation_3680"
                },
                {
                    "term": "Sequence visualisation",
                    "uri": "http://edamontology.org/operation_0564"
                }
            ]
        }
    ],
    "homepage": "https://ccb-compute2.cs.uni-saarland.de/miframe/",
    "lastUpdate": "2018-12-11T18:19:13Z",
    "name": "miFRame",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1186/S12967-015-0594-X",
            "metadata": {
                "abstract": "© 2015 Backes et al.Background: While in the past decades nucleic acid analysis has been predominantly carried out using quantitative low- and high-throughput approaches such as qRT-PCR and microarray technology, next-generation sequencing (NGS) with its single base resolution is now frequently applied in DNA and RNA testing. Especially for small non-coding RNAs such as microRNAs there is a need for analysis and visualization tools that facilitate interpretation of the results also for clinicians. Methods: We developed miFRame, which supports the analysis of human small RNA NGS data. Our tool carries out different data analyses for known as well as predicted novel mature microRNAs from known precursors and presents the results in a well interpretable manner. Analyses include among others expression analysis of precursors and mature miRNAs, detection of novel precursors and detection of potential iso-microRNAs. Aggregation of results from different users moreover allows for evaluation whether remarkable results, such as novel mature miRNAs, are indeed specific for the respective experimental set-up or are frequently detected across a broad range of experiments. Results: We demonstrate the capabilities of miFRame, which is freely available at http://www.ccb.uni-saarland.de/miframeon two studies, circulating biomarker screening for Multiple Sclerosis (cohort includes clinically isolated syndrome, relapse remitting MS, matched controls) as well as Alzheimer Disease (cohort includes Alzheimer Disease, Mild Cognitive Impairment, matched controls). Here, our tool allowed for an improved biomarker discovery by identifying likely false positive marker candidates.",
                "authors": [
                    {
                        "name": "Backes C."
                    },
                    {
                        "name": "Frese K."
                    },
                    {
                        "name": "Grossmann T."
                    },
                    {
                        "name": "Haas J."
                    },
                    {
                        "name": "Keller A."
                    },
                    {
                        "name": "Leidinger P."
                    },
                    {
                        "name": "Meder B."
                    },
                    {
                        "name": "Meese E."
                    },
                    {
                        "name": "Ruprecht K."
                    }
                ],
                "citationCount": 5,
                "date": "2015-07-14T00:00:00Z",
                "journal": "Journal of Translational Medicine",
                "title": "miFRame: Analysis and visualization of miRNA sequencing data in neurological disorders"
            },
            "pmcid": "PMC4501052",
            "pmid": "26169944"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Data visualisation",
            "uri": "http://edamontology.org/topic_0092"
        },
        {
            "term": "Neurology",
            "uri": "http://edamontology.org/topic_3334"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "RNA-seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ],
    "validated": 1
}
