{"credit":[],"function":[{"operation":[{"term":"Peak calling","uri":"http://edamontology.org/operation_3222"},{"term":"Standardisation and normalisation","uri":"http://edamontology.org/operation_3435"}]}],"labels":{"language":["Python"],"topic":[{"term":"Machine learning","uri":"http://edamontology.org/topic_3474"},{"term":"Gene expression","uri":"http://edamontology.org/topic_0203"},{"term":"Mapping","uri":"http://edamontology.org/topic_0102"}]},"publication":[{"abstract":"© 2019, Springer Nature B.V.Key message: We developed a machine learning-based model to identify the hidden labels of m6A candidates from noisy m6A-seq data. Abstract: Peak-calling approaches, such as MeRIP-seq or m6A-seq, are commonly used to map m6A modifications. However, these technologies can only map m6A sites with 100–200 nt resolution and cannot reveal the precise location or the number of modified residues in a transcript. To address this challenge, we developed a novel machine learning-based approach, named HLMethy, to assign labels to m6A candidates from noisy m6A-seq data. The multiple instance learning framework was adopted and two different training strategies were used to generate the classification model. To test the performance of our model, the m6A sites with single-base resolution were used and our model achieved comparable performance against existing instance-level predictors, which suggest that our model has the potential to improve the data quality of m6A-seq at reduced costs. What’s more, our generic framework can be extended to other newly found modifications that are found by peak-calling approaches. The source code of HLMethy is available at https://github.com/liuze-nwafu/HLMethy.","authors":["Liu Z.","Dong W.","Luo W.J.","Jiang W.","Li Q.W.","He Z.L."],"cit_count":0,"doi":"10.1007/S11103-019-00930-X","journal":"Plant Molecular Biology","pmid":"31722090","title":"HLMethy: a machine learning-based model to identify the hidden labels of m6A candidates","year":"2019-12-01"}],"summary":{"biotoolsCURIE":"biotools:HLMethy","biotoolsID":"HLMethy","description":"a machine learning-based model to identify the hidden labels of m6A candidates.\n\nHLMethy: Machine learning-based model to identify the hidden labels of candidate m6A modifications","homepage":"https://github.com/liuze-nwafu/HLMethy","name":"HLMethy"}}