{
    "accessibility": "Open access",
    "additionDate": "2022-09-05T21:24:04.271675Z",
    "biotoolsCURIE": "biotools:mp-net",
    "biotoolsID": "mp-net",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "homin.park@ghent.ac.kr",
            "name": "Ho-min Park",
            "orcidid": "https://orcid.org/0000-0001-9937-8617",
            "typeEntity": "Person"
        },
        {
            "name": "Arnout Van Messem",
            "orcidid": "https://orcid.org/0000-0001-8545-7437"
        },
        {
            "name": "Maria Krishna de Guzman",
            "orcidid": "https://orcid.org/0000-0002-5754-2041"
        },
        {
            "name": "Sanghyeon Park",
            "orcidid": "https://orcid.org/0000-0002-9854-0085"
        },
        {
            "name": "Wesley De Neve",
            "orcidid": "https://orcid.org/0000-0002-8190-3839"
        }
    ],
    "description": "Deep learning-based segmentation for fluorescence microscopy images of microplastics isolated from clams.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                },
                {
                    "term": "Nucleic acid thermodynamic property calculation",
                    "uri": "http://edamontology.org/operation_0455"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                }
            ]
        }
    ],
    "homepage": "https://github.com/sanghyeonp/MP-Net",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-09-05T21:24:04.275393Z",
    "license": "MIT",
    "name": "MP-Net",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PONE.0269449",
            "metadata": {
                "abstract": "© 2022 Park et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Environmental monitoring of microplastics (MP) contamination has become an area of great research interest, given potential hazards associated with human ingestion of MP. In this context, determination of MP concentration is essential. However, cheap, rapid, and accurate quantification of MP remains a challenge to this date. This study proposes a deep learning-based image segmentation method that properly distinguishes fluorescent MP from other elements in a given microscopy image. A total of nine different deep learning models, six of which are based on U-Net, were investigated. These models were trained using at least 20,000 patches sampled from 99 fluorescence microscopy images of MP and their corresponding binary masks. MP-Net, which is derived from U-Net, was found to be the best performing model, exhibiting the highest mean F1-score (0.736) and mean IoU value (0.617). Test-time augmentation (using brightness, contrast, and HSV) was applied to MP-Net for robust learning. However, compared to the results obtained without augmentation, no clear improvement in predictive performance could be observed. Recovery assessment for both spiked and real images showed that, compared to already existing tools for MP quantification, the MP quantities predicted by MP-Net are those closest to the ground truth. This observation suggests that MP-Net allows creating masks that more accurately reflect the quantitative presence of fluorescent MP in microscopy images. Finally, MAP (Microplastics Annotation Package) is introduced, an integrated software environment for automated MP quantification, offering support for MP-Net, already existing MP analysis tools like MP-VAT, manual annotation, and model fine-tuning.",
                "authors": [
                    {
                        "name": "Baek J.Y."
                    },
                    {
                        "name": "De Neve W."
                    },
                    {
                        "name": "Park H.-M."
                    },
                    {
                        "name": "Park S."
                    },
                    {
                        "name": "Van Messem A."
                    },
                    {
                        "name": "Velickovic T.C."
                    },
                    {
                        "name": "de Guzman M.K."
                    }
                ],
                "date": "2022-06-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "MP-Net: Deep learning-based segmentation for fluorescence microscopy images of microplastics isolated from clams"
            },
            "pmcid": "PMC9200300",
            "pmid": "35704628"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Zoology",
            "uri": "http://edamontology.org/topic_3500"
        }
    ]
}
