{
    "additionDate": "2021-06-14T13:01:21Z",
    "biotoolsCURIE": "biotools:bfee2",
    "biotoolsID": "bfee2",
    "confidence_flag": "tool",
    "description": "Binding free energy estimator 2 (BFEE2) is a python-based software that automates absolute binding free energy calculations through either the alchemical or geometric route by molecular dynamics simulations.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Molecular dynamics",
                    "uri": "http://edamontology.org/operation_2476"
                },
                {
                    "term": "Parsing",
                    "uri": "http://edamontology.org/operation_1812"
                }
            ]
        }
    ],
    "homepage": "http://github.com/fhh2626/BFEE2",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-08-13T10:14:28.739951Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "http://github.com/fhh2626/BFEE2/issues"
        },
        {
            "type": [
                "Repository"
            ],
            "url": "http://pypi.org/project/BFEE2/"
        }
    ],
    "name": "BFEE2",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1021/ACS.JCIM.1C00269",
            "metadata": {
                "abstract": "© 2021 American Chemical Society.Accurate absolute binding free-energy estimation in silico, following either an alchemical or a geometrical route, involves several subprocesses and requires the introduction of geometric restraints. Human intervention, for instance, to define the necessary collective variables, prepare the input files, monitor the simulation, and perform post-treatments is, however, tedious, cumbersome, and prone to errors. With the aim of automating and streamlining free-energy calculations, especially for nonexperts, version 2.0 of the binding free energy estimator (BFEE2) provides both standardized alchemical and geometrical workflows and obviates the need for extensive human intervention to guarantee complete reproducibility of the results. To achieve the largest gamut of protein-ligand and, more generally, of host-guest complexes, BFEE2 supports most academic force fields, such as CHARMM, Amber, OPLS, and GROMOS. Configurational files are generated in the NAMD and Gromacs formats, and all the post-treatments are performed in an automated fashion. Moreover, convergence of the free-energy calculation can be monitored from the intermediate files generated during the simulation. All in all, BFEE2 is a foolproof, versatile tool for accurate absolute binding free-energy calculations, assisting the end-user over a broad range of applications.",
                "authors": [
                    {
                        "name": "Fu H."
                    },
                    {
                        "name": "Chen H."
                    },
                    {
                        "name": "Cai W."
                    },
                    {
                        "name": "Shao X."
                    },
                    {
                        "name": "Chipot C."
                    }
                ],
                "citationCount": 1,
                "date": "2021-05-24T00:00:00Z",
                "journal": "Journal of Chemical Information and Modeling",
                "title": "BFEE2: Automated, Streamlined, and Accurate Absolute Binding Free-Energy Calculations"
            },
            "pmid": "33906354",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Molecular dynamics",
            "uri": "http://edamontology.org/topic_0176"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        }
    ]
}