{
    "additionDate": "2021-01-18T11:43:37Z",
    "biotoolsCURIE": "biotools:ogda",
    "biotoolsID": "ogda",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "liutao@ouc.edu.cn",
            "name": "Tao Liu",
            "typeEntity": "Person"
        },
        {
            "name": "Jiangyong Qu",
            "typeEntity": "Person"
        },
        {
            "email": "wangxm@ytu.edu.cn",
            "name": "Xumin Wang",
            "typeEntity": "Person"
        }
    ],
    "description": "A comprehensive organelle genomes database for algae cpDNA and mtDNA.\n\nAlgae is the earliest evolutionary biological group on the earth, are thought to have appeared at least 2.6 billion years ago. As the most complex biological group, algae have shown the high diversity during the long evolutionary history. Algae are widely distributed in 4 kingdoms of the Eukaryota, including the Plantae, Protozoa, Acritarcha, Chromista and Fungi. Up to now, there are 46,177 species of eukaryotic algae have been recognized and classified (AlgaeBase, 2020), but in fact, more species need the further confirmation.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Genome assembly",
                    "uri": "http://edamontology.org/operation_0525"
                }
            ]
        }
    ],
    "homepage": "http://ogda.ytu.edu.cn/",
    "lastUpdate": "2021-03-18T10:07:37Z",
    "name": "OGDA",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1093/DATABASE/BAAA097",
            "metadata": {
                "abstract": "© The Author(s) 2020. Published by Oxford University Press. This is an Open Access article distributed under the terms of the Creative Commons Attribution License (http://creativecommons.org/licenses/by/4.0/), which permits unrestricted reuse, distribution, and reproduction in any medium, provided the original work is properly cited.Algae are the oldest taxa on Earth, with an evolutionary relationship that spans prokaryotes (Cyanobacteria) and eukaryotes. A long evolutionary history has led to high algal diversity. Their organelle DNAs are characterized by uniparental inheritance and a compact genome structure compared with nuclear genomes; thus, they are efficient molecular tools for the analysis of gene structure, genome structure, organelle function and evolution. However, an integrated organelle genome database for algae, which could enable users to both examine and use relevant data, has not previously been developed. Therefore, to provide an organelle genome platform for algae, we have developed a user-friendly database named Organelle Genome Database for Algae (OGDA, http://ogda.ytu.edu.cn/). OGDA contains organelle genome data either retrieved from several public databases or sequenced in our laboratory (Laboratory of Genetics and Breeding of Marine Organism [MOGBL]), which are continuously updated. The first release of OGDA contains 1055 plastid genomes and 755 mitochondrial genomes. Additionally, a variety of applications have been integrated into this platform to analyze the structural characteristics, collinearity and phylogeny of organellar genomes for algae. This database represents a useful tool for users, enabling the rapid retrieval and analysis of information related to organellar genomes for biological discovery.",
                "authors": [
                    {
                        "name": "Liu T."
                    },
                    {
                        "name": "Cui Y."
                    },
                    {
                        "name": "Jia X."
                    },
                    {
                        "name": "Zhang J."
                    },
                    {
                        "name": "Li R."
                    },
                    {
                        "name": "Yu Y."
                    },
                    {
                        "name": "Jia S."
                    },
                    {
                        "name": "Qu J."
                    },
                    {
                        "name": "Wang X."
                    }
                ],
                "date": "2021-01-01T00:00:00Z",
                "journal": "Database",
                "title": "OGDA: A comprehensive organelle genome database for algae"
            },
            "pmcid": "PMC7698662",
            "pmid": "33247934"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Phylogeny",
            "uri": "http://edamontology.org/topic_0084"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Taxonomy",
            "uri": "http://edamontology.org/topic_0637"
        }
    ]
}