{
    "accessibility": "Open access",
    "additionDate": "2024-01-29T20:21:35.204613Z",
    "biotoolsCURIE": "biotools:lncrtpred",
    "biotoolsID": "lncrtpred",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "zhumur@jcbose.ac.in",
            "name": "Zhumur Ghosh",
            "orcidid": "https://orcid.org/0000-0002-4877-7551",
            "typeEntity": "Person"
        },
        {
            "name": "Gourab Das",
            "typeEntity": "Person"
        },
        {
            "name": "Sibun Parida",
            "typeEntity": "Person"
        },
        {
            "name": "Troyee Das",
            "typeEntity": "Person"
        }
    ],
    "description": "LncRTPred is a target prediction tool to predict the interaction between lncRNA and mRNA for both Human and Mouse species.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Sequence",
                        "uri": "http://edamontology.org/data_2044"
                    },
                    "format": [
                        {
                            "term": "FASTA",
                            "uri": "http://edamontology.org/format_1929"
                        }
                    ]
                }
            ],
            "operation": [
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                }
            ]
        }
    ],
    "homepage": "http://bicresources.jcbose.ac.in/zhumur/lncrtpred/index.html",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T14:18:14.361794Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/zglabDIB/LncRTPred"
        }
    ],
    "name": "LncRTPred",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1002/iub.2778",
            "metadata": {
                "abstract": "Long non-coding RNAs (lncRNAs) play a significant role in various biological processes. Hence, it is utmost important to elucidate their functions in order to understand the molecular mechanism of a complex biological system. This versatile RNA molecule has diverse modes of interaction, one of which constitutes lncRNA–mRNA interaction. Hence, identifying its target mRNA is essential to understand the function of an lncRNA explicitly. Existing lncRNA target prediction tools mainly adopt thermodynamics approach. Large execution time and inability to perform real-time prediction limit their usage. Further, lack of negative training dataset has been a hindrance in the path of developing machine learning (ML) based lncRNA target prediction tools. In this work, we have developed a ML-based lncRNA–mRNA target prediction model- ‘LncRTPred’. Here we have addressed the existing problems by generating reliable negative dataset and creating robust ML models. We have identified the non-interacting lncRNA and mRNAs from the unlabelled dataset using BLAT. It is further filtered to get a reliable set of outliers. LncRTPred provides a cumulative_model_score as the final output against each query. In terms of prediction accuracy, LncRTPred outperforms other popular target prediction protocols like LncTar. Further, we have tested its performance against experimentally validated disease-specific lncRNA–mRNA interactions. Overall, performance of LncRTPred is heavily dependent on the size of the training dataset, which is highly reflected by the difference in its performance for human and mouse species. Its performance for human species shows better as compared to that for mouse when applied on an unknown data due to smaller size of the training dataset in case of mouse compared to that of human. Availability of increased number of lncRNA–mRNA interaction data for mouse will improve the performance of LncRTPred in future. Both webserver and standalone versions of LncRTPred are available. Web server link: http://bicresources.jcbose.ac.in/zhumur/lncrtpred/index.html. Github Link: https://github.com/zglabDIB/LncRTPred.",
                "authors": [
                    {
                        "name": "Das G."
                    },
                    {
                        "name": "Das T."
                    },
                    {
                        "name": "Ghosh Z."
                    },
                    {
                        "name": "Parida S."
                    }
                ],
                "date": "2024-01-01T00:00:00Z",
                "journal": "IUBMB Life",
                "title": "LncRTPred: Predicting RNA–RNA mode of interaction mediated by lncRNA"
            },
            "pmid": "37606159"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        }
    ]
}
