{
    "additionDate": "2021-03-19T08:27:54Z",
    "biotoolsCURIE": "biotools:bbppred",
    "biotoolsID": "bbppred",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "jfxia@ahu.edu.cn",
            "name": "Junfeng Xia",
            "orcidid": "http://orcid.org/0000-0003-3024-1705",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "BBPpred is a web application used to identify Blood-brain barrier peptides (BBPs) using a logistic regression classifier based on feature representation learning scheme. BBPs can cross the blood-brain barrier based on various mechanisms and have a variety of biomedical applications.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Feature extraction",
                    "uri": "http://edamontology.org/operation_3937"
                },
                {
                    "term": "Protein function prediction",
                    "uri": "http://edamontology.org/operation_1777"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "http://BBPpred.xialab.info",
    "lastUpdate": "2021-04-11T12:03:38Z",
    "name": "BBPpred",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1021/ACS.JCIM.0C01115",
            "metadata": {
                "abstract": "© 2021 American Chemical Society.Blood-brain barrier peptides (BBPs) have a large range of biomedical applications since they can cross the blood-brain barrier based on different mechanisms. As experimental methods for the identification of BBPs are laborious and expensive, computational approaches are necessary to be developed for predicting BBPs. In this work, we describe a computational method, BBPpred (blood-brain barrier peptides prediction), that can efficiently identify BBPs using logistic regression. We investigate a wide variety of features from amino acid sequence information, and then a feature learning method is adopted to represent the informative features. To improve the prediction performance, seven informative features are selected for classification by eliminating redundant and irrelevant features. In addition, we specifically create two benchmark data sets (training and independent test), which contain a total of 119 BBPs from public databases and the literature. On the training data set, BBPpred shows promising performances with an AUC score of 0.8764 and an AUPR score of 0.8757 using the 10-fold cross-validation. We also test our new method on the independent test data set and obtain a favorable performance. We envision that BBPpred will be a useful tool for identifying, annotating, and characterizing BBPs. BBPpred is freely available at http://BBPpred.xialab.info.",
                "authors": [
                    {
                        "name": "Bin Y."
                    },
                    {
                        "name": "Dai R."
                    },
                    {
                        "name": "De Spiegeleer B."
                    },
                    {
                        "name": "Tang W."
                    },
                    {
                        "name": "Wynendaele E."
                    },
                    {
                        "name": "Xia J."
                    },
                    {
                        "name": "Zhang W."
                    },
                    {
                        "name": "Zhu Q."
                    }
                ],
                "citationCount": 3,
                "date": "2021-01-25T00:00:00Z",
                "journal": "Journal of Chemical Information and Modeling",
                "title": "BBPpred: Sequence-Based Prediction of Blood-Brain Barrier Peptides with Feature Representation Learning and Logistic Regression"
            },
            "pmid": "33426873"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Literature and language",
            "uri": "http://edamontology.org/topic_3068"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
