{
    "additionDate": "2017-08-03T18:55:37Z",
    "biotoolsCURIE": "biotools:phewas",
    "biotoolsID": "phewas",
    "credit": [
        {
            "email": "josh.denny@vanderbilt.edu",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Analyze many phenotypes compared to a single genetic variant (or other attribute). This method was originally described using electronic medical record (EMR) data from EMR-linked in the Vanderbilt DNA biobank, BioVU, but can also be applied to other richly phenotyped sets. ::DEVELOPER Biomedical Language Processing Lab.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://www.vumc.org/cpm/cpm-blog/phewas-phenome-wide-association-studies"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Pathway or network analysis",
                    "uri": "http://edamontology.org/operation_2497"
                }
            ]
        }
    ],
    "homepage": "https://phewascatalog.org/",
    "language": [
        "Perl"
    ],
    "lastUpdate": "2018-12-10T12:58:55Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/phewas-0-9-3-1-phenome-wide-association-studies.html"
        }
    ],
    "name": "PheWAS",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Motivation: Emergence of genetic data coupled to longitudinal electronic medical records (EMRs) offers the possibility of phenome-wide association scans (PheWAS) for disease-gene associations. We propose a novel method to scan phenomic data for genetic associations using International Classification of Disease (ICD9) billing codes, which are available in most EMR systems. We have developed a code translation table to automatically define 776 different disease populations and their controls using prevalent ICD9 codes derived from EMR data. As a proof of concept of this algorithm, we genotyped the first 6005 European-Americans accrued into BioVU, Vanderbilt's DNA biobank, at five single nucleotide polymorphisms (SNPs) with previously reported disease associations: atrial fibrillation, Crohn's disease, carotid artery stenosis, coronary artery disease, multiple sclerosis, systemic lupus erythematosus and rheumatoid arthritis. The PheWAS software generated cases and control populations across all ICD9 code groups for each of these five SNPs, and disease-SNP associations were analyzed. The primary outcome of this study was replication of seven previously known SNP-disease associations for these SNPs. Results: Four of seven known SNP-disease associations using the PheWAS algorithm were replicated with P-values between 2.8×10-6 and 0.011. The PheWAS algorithm also identified 19 previously unknown statistical associations between these SNPs and diseases at P <0.01. This study indicates that PheWAS analysis is a feasible method to investigate SNP-disease associations. Further evaluation is needed to determine the validity of these associations and the appropriate statistical thresholds for clinical significance. Availability:The PheWAS software and code translation table are freely available at http://knowledgemap.mc.vanderbilt.edu/research. Contact: josh.denny@vanderbilt.edu. © The Author(s) 2010. Published by Oxford University Press.",
                "authors": [
                    {
                        "name": "Denny J.C."
                    },
                    {
                        "name": "Ritchie M.D."
                    },
                    {
                        "name": "Basford M.A."
                    },
                    {
                        "name": "Pulley J.M."
                    },
                    {
                        "name": "Bastarache L."
                    },
                    {
                        "name": "Brown-Gentry K."
                    },
                    {
                        "name": "Wang D."
                    },
                    {
                        "name": "Masys D.R."
                    },
                    {
                        "name": "Roden D.M."
                    },
                    {
                        "name": "Crawford D.C."
                    }
                ],
                "citationCount": 518,
                "date": "2010-03-24T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "PheWAS: Demonstrating the feasibility of a phenome-wide scan to discover gene-disease associations"
            },
            "pmid": "20335276"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Biobank",
            "uri": "http://edamontology.org/topic_3337"
        },
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        },
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        }
    ],
    "validated": 1
}