{
    "additionDate": "2019-11-14T18:10:08Z",
    "biotoolsCURIE": "biotools:MEXCOwalk",
    "biotoolsID": "MEXCOwalk",
    "confidence_flag": "tool",
    "description": "Mutual Exclusion and Coverage Based Random Walk to Identify Cancer Modules | This is the original repository for the MEXCOwalk paper | The evaluation file can also be run with multiple models and compared to MEXCOwalk. Simply store the models in 'out/connected_components_isolarge/model_x' and add the model name to the evaluations section in the evaluation file as follows:",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                },
                {
                    "term": "Parsing",
                    "uri": "http://edamontology.org/operation_1812"
                }
            ]
        }
    ],
    "homepage": "https://github.com/abu-compbio/MEXCOwalk",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-12-28T09:58:15Z",
    "name": "MEXCOwalk",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ655",
            "metadata": {
                "abstract": "© 2019 The Author(s) 2019. Published by Oxford University Press. All rights reserved. For permissions, please e-mail: journals.permissions@oup.com.Motivation: Genomic analyses from large cancer cohorts have revealed the mutational heterogeneity problem which hinders the identification of driver genes based only on mutation profiles. One way to tackle this problem is to incorporate the fact that genes act together in functional modules. The connectivity knowledge present in existing protein-protein interaction (PPI) networks together with mutation frequencies of genes and the mutual exclusivity of cancer mutations can be utilized to increase the accuracy of identifying cancer driver modules. Results: We present a novel edge-weighted random walk-based approach that incorporates connectivity information in the form of protein-protein interactions (PPIs), mutual exclusivity and coverage to identify cancer driver modules. MEXCOwalk outperforms several state-of-the-art computational methods on TCGA pan-cancer data in terms of recovering known cancer genes, providing modules that are capable of classifying normal and tumor samples and that are enriched for mutations in specific cancer types. Furthermore, the risk scores determined with output modules can stratify patients into low-risk and high-risk groups in multiple cancer types. MEXCOwalk identifies modules containing both well-known cancer genes and putative cancer genes that are rarely mutated in the pan-cancer data. The data, the source code and useful scripts are available at: https://github.com/abu-compbio/MEXCOwalk.",
                "authors": [
                    {
                        "name": "Ahmed R."
                    },
                    {
                        "name": "Baali I."
                    },
                    {
                        "name": "Erten C."
                    },
                    {
                        "name": "Hoxha E."
                    },
                    {
                        "name": "Kazan H."
                    }
                ],
                "citationCount": 3,
                "date": "2020-02-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "MEXCOwalk: Mutual exclusion and coverage based random walk to identify cancer modules"
            },
            "pmid": "31432076"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        }
    ],
    "validated": 1
}
