{"credit":[{"email":"d.mapleson@gmail.com","name":"Dr. Daniel Mapleson","typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://www.uea.ac.uk/computing/the-uea-computational-biology-laboratory"},{"email":"simon.moxon@yale.edu","name":"Dr. Simon Moxon,","typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://www.uea.ac.uk/computing/mirplex"}],"documentation":[{"type":"GENERAL","url":"http://www.uea.ac.uk/computing/mirplex"}],"function":[{"operation":[{"term":"Prediction and recognition","uri":"http://edamontology.org/operation_2423"}]}],"labels":{"language":["Java"],"operatingSystem":["Linux","Windows","Mac"],"toolType":["Command-line tool"],"topic":[{"term":"Sequencing","uri":"http://edamontology.org/topic_3168"},{"term":"Functional, regulatory and non-coding RNA","uri":"http://edamontology.org/topic_0659"},{"term":"RNA","uri":"http://edamontology.org/topic_0099"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/mirplex-0-1-microrna-prediction-high-throughput-sequencing-data.html"}],"publication":[{"abstract":"MicroRNAs (miRNAs) are a class of small non-coding RNA (sRNA) involved in gene regulation through mRNA decay and translational repression. In animals, miRNAs have crucial regulatory functions during embryonic development and they have also been implicated in several diseases such as cancer, cardiovascular and neurodegenerative disorders. As such, it is of importance to successfully characterize new miRNAs in order to further study their function. Recent advances in sequencing technologies have made it possible to capture a high-resolution snapshot of the complete sRNA content of an organism or tissue. A common approach to miRNA detection involves searching such data for telltale miRNA signatures. However, current miRNA prediction tools usually require a sequenced genome to analyse regions flanking aligned sRNA reads in order to identify characteristic miRNA hairpin secondary structures. Since only a handful of published genomes are available, there is a need for novel methods to identify miRNAs in sRNA datasets from high-throughput sequencing devices without requiring a reference genome. This paper presents miRPlex, a tool for miRNA prediction that requires only sRNA datasets as input. Mature miRNAs are predicted from such datasets through a multi-stage process, involving filtering, miRNA:miRNA* duplex generation and duplex classification using a support vector machine. Tests on sRNA datasets from model animals demonstrate that the tool is effective at predicting genuine miRNA duplexes, and, for some sets, achieves a high degree of precision when considering only the mature sequence. © 2012 Wiley Periodicals, Inc.","authors":["Mapleson D.","Moxon S.","Dalmay T.","Moulton V."],"cit_count":7,"journal":"Journal of Experimental Zoology Part B: Molecular and Developmental Evolution","pmid":"23184675","title":"MirPlex: A Tool for Identifying miRNAs in High-Throughput sRNA Datasets Without a Genome","year":"2013-01-01"}],"summary":{"biotoolsCURIE":"biotools:mirplex","biotoolsID":"mirplex","description":"Tool for microRNA prediction from high-throughput sequencing data that requires only small RNA datasets as input.","homepage":"http://www.uea.ac.uk/computing/mirplex","name":"MiRPlex"}}