{
    "additionDate": "2017-12-18T00:06:23Z",
    "biotoolsCURIE": "biotools:fread",
    "biotoolsID": "fread",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://opig.stats.ox.ac.uk/"
        }
    ],
    "description": "FREAD is a database search loop structure prediction protocol. Loops are generally located in the protein’s surface and they are known to be notoriously difficult to predict.The basic assumption of FREAD is that local sequence similarity may determine the backbone structure of a local protein structure if it is constrained within anchor structures.",
    "documentation": [
        {
            "type": "User manual",
            "url": "http://opig.stats.ox.ac.uk/webapps/fread/php/tutorial.php"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Structure prediction",
                    "uri": "http://edamontology.org/operation_0271"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Prediction",
                    "uri": "http://edamontology.org/operation_2423"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Protein sequence analysis",
                    "uri": "http://edamontology.org/operation_2479"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Search",
                    "uri": "http://edamontology.org/operation_2421"
                }
            ]
        }
    ],
    "homepage": "http://opig.stats.ox.ac.uk/webapps/fread/php/index.php",
    "lastUpdate": "2018-12-10T12:58:57Z",
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/fread-3-0-1-database-search-loop-structure-prediction-protocol.html"
        }
    ],
    "name": "FREAD",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1002/prot.22658",
            "metadata": {
                "abstract": "Loops are the most variable regions of protein structure and are, in general, the least accurately predicted. Their prediction has been approached in two ways, ab initio and database search. In recent years, it has been thought that ab initio methods are more powerful. In light of the continued rapid expansion in the number of known protein structures, we have re-evaluated FREAD, a database search method and demonstrate that the power of database search methods may have been underestimated. We found that sequence similarity as quantified by environment specific substitution scores can be used to significantly improve prediction. In fact, FREAD performs appreciably better for an identifiable subset of loops (two thirds of shorter loops and half of the longer loops tested) than the ab initio methods of MODELLER, PLOP, and RAPPER. Within this subset, FREAD's predictive ability is length independent, in general, producing results within 2A RMSD, compared to an average of over 10Å for loop length 20 for any of the other tested methods. We also benchmarked the prediction protocols on a set of 212 loops from the model structures in CASP 7 and 8. An extended version of FREAD is able to make predictions for 127 of these, it gives the best prediction of the methods tested in 61 of these cases. In examining FREAD's ability to predict in the model environment, we found that whole structure quality did not affect the quality of loop predictions. © 2009 Wiley-Liss, Inc.",
                "authors": [
                    {
                        "name": "Choi Y."
                    },
                    {
                        "name": "Deane C.M."
                    }
                ],
                "citationCount": 81,
                "date": "2010-04-28T00:00:00Z",
                "journal": "Proteins: Structure, Function and Bioinformatics",
                "title": "FREAD revisited: Accurate loop structure prediction using a database search algorithm"
            },
            "type": "Primary"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Structure prediction",
            "uri": "http://edamontology.org/topic_0082"
        },
        {
            "term": "Protein structure",
            "uri": "http://edamontology.org/topic_2814"
        }
    ],
    "validated": 1,
    "version": [
        "3.0.1"
    ]
}