{
    "accessibility": "Open access",
    "additionDate": "2025-03-28T11:13:12.813456Z",
    "biotoolsCURIE": "biotools:we_sa",
    "biotoolsID": "we_sa",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "description": "WeSA, (weighted socioaffinity), is a statistical score which can rank results from protein experiments of the bait-prey type, e.g. affinity purification, immunoprecipitation or proximity labelling.\n\nYou can enter lists of interacting proteins according to the results of your experiment. Input your raw data before any filtering is done.\n\nAs a result you will get a re-ordered list of scores which allows one to understand which interactions are more likely than others based on what previous experiments can add to your data.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://wesa.russelllab.org/help"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "homepage": "https://wesa.russelllab.org/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2025-03-28T12:14:32.901305Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/russelllab/wesa"
        }
    ],
    "name": "WeSA",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/nar/gkae423",
            "metadata": {
                "abstract": "Protein-protein interaction experiments still yield many false positive interactions. The socioaffinity metric can distinguish true protein-protein interactions from noise based on available data. Here, we present WeSA (Weighted SocioAffinity), which considers large datasets of interaction proteomics data (IntAct, BioGRID, the BioPlex) to score human protein interactions and, in a statistically robust way, flag those (even from a single experiment) that are likely to be false positives. ROC analysis (using CORUM-PDB positives and Negatome negatives) shows that WeSA improves over other measures of interaction confidence. WeSA shows consistently good results over all datasets (up to: AUC = 0.93 and at best threshold: TPR = 0.84, FPR = 0.11, Precision = 0.98). WeSA is freely available without login (wesa.russelllab.org). Users can submit their own data or look for organized information on human protein interactions using the web server. Users can either retrieve available information for a list of proteins of interest or calculate scores for new experiments. The server outputs either pre-computed or updated WeSA scores for the input enriched with information from databases. The summary is presented as a table and a network-based visualization allowing the user to remove those nodes/edges that the method considers spurious.",
                "authors": [
                    {
                        "name": "Beyer T."
                    },
                    {
                        "name": "Boldt K."
                    },
                    {
                        "name": "Gonzalez-Sanchez J.-C."
                    },
                    {
                        "name": "Russell R.B."
                    },
                    {
                        "name": "Shtetinska M.M."
                    },
                    {
                        "name": "Ueffing M."
                    }
                ],
                "citationCount": 1,
                "date": "2024-07-05T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "WeSA: A web server for improving analysis of affinity proteomics data"
            },
            "pmcid": "PMC11223876",
            "pmid": "38795065"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Protein interaction experiment",
            "uri": "http://edamontology.org/topic_3957"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        }
    ]
}
