{
    "additionDate": "2020-01-14T09:41:01Z",
    "biotoolsCURIE": "biotools:x-cnn",
    "biotoolsID": "x-cnn",
    "confidence_flag": "tool",
    "description": "X-CNN is a method for fine-mapping chromatin interactions,  e.g. Hi-C, using ChIP-seq and/or DNase data.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Peak detection",
                    "uri": "http://edamontology.org/operation_3215"
                },
                {
                    "term": "Peak calling",
                    "uri": "http://edamontology.org/operation_3222"
                },
                {
                    "term": "Pathway or network prediction",
                    "uri": "http://edamontology.org/operation_3439"
                }
            ]
        }
    ],
    "homepage": "https://github.com/ernstlab/X-CNN",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-01-09T15:25:33Z",
    "license": "MIT",
    "name": "X-CNN",
    "owner": "hans",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ843",
            "metadata": {
                "abstract": "© The Author(s) 2019. Published by Oxford University Press. All rights reserved.Motivation: Chromatin interactions play an important role in genome architecture and gene regulation. The Hi-C assay generates such interactions maps genome-wide, but at relatively low resolutions (e.g. 5-25 kb), which is substantially coarser than the resolution of transcription factor binding sites or open chromatin sites that are potential sources of such interactions. Results: To predict the sources of Hi-C-identified interactions at a high resolution (e.g. 100 bp), we developed a computational method that integrates data from DNase-seq and ChIP-seq of TFs and histone marks. Our method, v-CNN, uses this data to first train a convolutional neural network (CNN) to discriminate between called Hi-C interactions and non-interactions. v-CNN then predicts the high-resolution source of each Hi-C interaction using a feature attribution method. We show these predictions recover original Hi-C peaks after extending them to be coarser. We also show v-CNN predictions enrich for evolutionarily conserved bases, eQTLs and CTCF motifs, supporting their biological significance. v-CNN provides an approach for analyzing important aspects of genome architecture and gene regulation at a higher resolution than previously possible. Availability and implementation: v-CNN software is available on GitHub (https://github.com/ernstlab/X-CNN).",
                "authors": [
                    {
                        "name": "Jaroszewisz A."
                    },
                    {
                        "name": "Ernst J."
                    }
                ],
                "date": "2020-01-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "An integrative approach for fine-mapping chromatin interactions"
            },
            "pmid": "31742318"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "ChIP-seq",
            "uri": "http://edamontology.org/topic_3169"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        }
    ],
    "validated": 1
}