{
    "additionDate": "2017-02-10T11:34:37Z",
    "biotoolsCURIE": "biotools:praline",
    "biotoolsID": "praline",
    "collectionID": [
        "JIB.tools"
    ],
    "credit": [
        {
            "email": "bioinf-l@few.vu.nl",
            "name": "Centre for Integrative Bioinformatics VU (IBIVU), Vrije Universiteit",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Praline is a multiple sequence alignment program that can integrate information from sequence similarity searches and secondary structure prediction.",
    "documentation": [
        {
            "type": "General",
            "url": "http://www.ibi.vu.nl/programs/pralinewww/help.php"
        }
    ],
    "editPermission": {
        "authors": [
            "bjsommer"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence similarity search",
                    "uri": "http://edamontology.org/operation_0346"
                },
                {
                    "term": "RNA secondary structure prediction",
                    "uri": "http://edamontology.org/operation_0278"
                },
                {
                    "term": "Protein secondary structure prediction",
                    "uri": "http://edamontology.org/operation_0267"
                },
                {
                    "term": "Multiple sequence alignment",
                    "uri": "http://edamontology.org/operation_0492"
                }
            ]
        }
    ],
    "homepage": "http://ibivu.cs.vu.nl/programs/pralinewww/",
    "lastUpdate": "2019-09-18T18:29:09Z",
    "link": [
        {
            "note": "PRALINE@JIB.tools - a web registry of tools published in the Journal of Integrative Bioinformatics",
            "type": "Software catalogue",
            "url": "https://jib.tools/details.php?id=57"
        }
    ],
    "name": "PRALINE",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "We introduce the online server for PRALINE (http://ibium.cs.vu.nl/programs/pralinewww/), an iterative versatile progressive multiple sequence alignment (MSA) tool. PRALINE provides various MSA optimisation strategies including weighted global and local profile pre-processing, secondary structure-guided alignment and a reliability measure for aligned individual residue positions. The latter can also be used to optimise the alignment when the profile pre-processing strategies are iterated. In addition, we have modelled the server output to enable comprehensive visualisation of the generated alignment and easy figure generation for publications. The alignment is represented in five default colour schemes based on: residue type, position conservation, position reliability, residue hydrophobicity and secondary structure; depending on the options set. We have also implemented a custom colour scheme that allows the user to select which colour will represent one or more amino acids in the alignment. The grouping of sequences, on which the alignment is based, can also be visualised as a dendrogram. The PRALINE algorithm is designed to work more as a toolkit for MSA rather than a one step process.",
                "authors": [
                    {
                        "name": "Simossis V.A."
                    },
                    {
                        "name": "Heringa J."
                    }
                ],
                "citationCount": 34,
                "date": "2003-01-01T00:00:00Z",
                "journal": "Computational Biology and Chemistry",
                "title": "The PRALINE online server: Optimising progressive multiple alignment on the web"
            },
            "pmid": "14642759"
        },
        {
            "metadata": {
                "abstract": "Diamond STING is a new version of the STING suite of programs for a comprehensive analysis of a relationship between protein sequence, structure, function and stability. We have added a number of new functionalities by both providing more structure parameters to the STING Database and by improving/expanding the interface for enhanced data handling. The integration among the STING components has also been improved. A new key feature is the ability of the STING server to handle local files containing protein structures (either modeled or not yet deposited to the Protein Data Bank) so that they can be used by the principal STING components: JavaProtein Dossier (J PD) and STING Report. The current capabilities of the new STING version and a couple of biologically relevant applications are described here. We have provided an example where Diamond STING identifies the active site amino acids and folding essential amino acids (both previously determined by experiments) by filtering out all but those residues by selecting the numerical values/ranges for a set of corresponding parameters. This is the fundamental step toward a more interesting endeavor - the prediction of such residues. Diamond STING is freely accessible at http://sms.cbi.cnptia.embrapa.br and http://trantor.bioc.columbia.edu/SMS. © 2005 Oxford University Press.",
                "authors": [
                    {
                        "name": "Neshich G."
                    },
                    {
                        "name": "Borro L.C."
                    },
                    {
                        "name": "Higa R.H."
                    },
                    {
                        "name": "Kuser P.R."
                    },
                    {
                        "name": "Yamagishi M.E.B."
                    },
                    {
                        "name": "Franco E.H."
                    },
                    {
                        "name": "Krauchenco J.N."
                    },
                    {
                        "name": "Fileto R."
                    },
                    {
                        "name": "Ribeiro A.A."
                    },
                    {
                        "name": "Bezerra G.B.P."
                    },
                    {
                        "name": "Velludo T.M."
                    },
                    {
                        "name": "Jimenez T.S."
                    },
                    {
                        "name": "Furukawa N."
                    },
                    {
                        "name": "Teshima H."
                    },
                    {
                        "name": "Kitajima K."
                    },
                    {
                        "name": "Bava A."
                    },
                    {
                        "name": "Sarai A."
                    },
                    {
                        "name": "Togawa R.C."
                    },
                    {
                        "name": "Mancini A.L."
                    }
                ],
                "citationCount": 20,
                "date": "2005-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "The diamond STING server"
            },
            "pmid": "15980473"
        },
        {
            "metadata": {
                "abstract": "PRofile ALIgNEment (PRALINE) is a fully customizable multiple sequence alignment application. In addition to a number of available alignment strategies, PRALINE can integrate information from database homology searches to generate a homology-extended multiple alignment. PRALINE also provides a choice of seven different secondary structure prediction programs that can be used individually or in combination as a consensus for integrating structural information into the alignment process. The program can be used through two separate interfaces: one has been designed to cater to more advanced needs of researchers in the field, and the other for standard construction of high confidence alignments. The web-based output is designed to facilitate the comprehensive visualization of the generated alignments by means of five default colour schemes based on: residue type, position conservation, position reliability, residue hydrophobicity and secondary structure, depending on the options set. A user can also define a custom colour scheme by selecting which colour will represent one or more amino acids in the alignment. All generated alignments are also made available in the PDF format for easy figure generation for publications. The grouping of sequences, on which the alignment is based, can also be visualized as a dendrogram. PRALINE is available at http://ibivu.cs.vu.nl/programs/ pralinewww/. © 2005 Oxford University Press.",
                "authors": [
                    {
                        "name": "Simossis V.A."
                    },
                    {
                        "name": "Heringa J."
                    }
                ],
                "citationCount": 274,
                "date": "2005-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "PRALINE: A multiple sequence alignment toolbox that integrates homology-extended and secondary structure information"
            },
            "pmid": "15980472"
        },
        {
            "metadata": {
                "abstract": "We present a profile-profile multiple alignment strategy that uses database searching to collect homologues for each sequence in a given set, in order to enrich their available evolutionary information for the alignment. For each of the alignment sequences, the putative homologous sequences that score above a pre-defined threshold are incorporated into a position-specific pre-alignment profile. The enriched position-specific profile is used for standard progressive alignment, thereby more accurately describing the characteristic features of the given sequence set. We show that owing to the incorporation of the pre-alignment information into a standard progressive multiple alignment routine, the alignment quality between distant sequences increases significantly and outperforms state-of-the-art methods, such as T-COFFEE and MUSCLE. We also show that although entirely sequence-based, our novel strategy is better at aligning distant sequences when compared with a recent contact-based alignment method. Therefore, our pre-alignment profile strategy should be advantageous for applications that rely on high alignment accuracy such as local structure prediction, comparative modelling and threading. © The Author 2005. Published by Oxford University Press. All rights reserved.",
                "authors": [
                    {
                        "name": "Simossis V.A."
                    },
                    {
                        "name": "Kleinjung J."
                    },
                    {
                        "name": "Heringa J."
                    }
                ],
                "citationCount": 79,
                "date": "2005-10-18T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "Homology-extended sequence alignment"
            },
            "pmid": "15699183"
        },
        {
            "metadata": {
                "abstract": "Efforts to use computers in predicting the secondary structure of proteins based only on primary structure information started over a quarter century ago [1-3]. Although the results were encouraging initially, the accuracy of the pioneering methods generally did not attain the level required for using predictions of secondary structures reliably in modelling the three-dimensional topology of proteins. During the last decade, however, the introduction of new computational techniques as well as the use of multiple sequence information has lead to a dramatic increase in the success rate of prediction methods, such that successful 3D modelling based on predicted secondary structure has become feasible [e.g., Ref 4]. This review is aimed at presenting an overview of the scale of the secondary structure prediction problem and associated pitfalls, as well as the history of the development of computational prediction methods. As recent successful strategies for secondary structure prediction all rely on multiple sequence information, some methods for accurate protein multiple sequence alignments will also be described. While the main focus is on prediction methods for globular proteins, also the prediction of trans-membrane segments within membrane proteins will be briefly summarised. Finally, an integrated iterative approach tying secondary structure prediction and multiple alignment will be introduced [5].",
                "authors": [
                    {
                        "name": "Heringa J."
                    }
                ],
                "citationCount": 33,
                "date": "2000-01-01T00:00:00Z",
                "journal": "Current Protein and Peptide Science",
                "title": "Computational Methods for Protein Secondary Structure Prediction Using Multiple Sequence Alignments"
            },
            "pmid": "12369910"
        },
        {
            "metadata": {
                "abstract": "This paper describes three weighting schemes for improving the accuracy of progressive multiple sequence alignment methods: (1) global profile pre-processing, to capture for each sequence information about other sequences in a profile before the actual multiple alignment takes place; (2) local pre-processing; which incorporates a new protocol to only use non-overlapping local sequence regions to construct the pre-processed profiles; and (3) local-global alignment, a weighting scheme based on the double dynamic programming (DDP) technique to softly bias global alignment to local sequence motifs. The first two schemes allow the compilation of residue-specific multiple alignment reliability indices, which can be used in an iterative fashion. The schemes have been implemented with associated iterative modes in the PRALINE multiple sequence alignment method, and have been evaluated using the BAliBASE benchmark alignment database. These tests indicate that PRALINE is a toolbox able to build alignments with very high quality. We found that local profile pre-processing raises the alignment quality by 5.5% compared to PRALINE alignments generated under default conditions. Iteration enhances the quality by a further percentage point. The implications of multiple alignment scoring functions and iteration in relation to alignment quality and benchmarking are discussed. © 2002 Elsevier Science Ltd. All rights reserved.",
                "authors": [
                    {
                        "name": "Heringa J."
                    }
                ],
                "citationCount": 37,
                "date": "2002-06-29T00:00:00Z",
                "journal": "Computers and Chemistry",
                "title": "Local weighting schemes for protein multiple sequence alignment"
            },
            "pmid": "12144176"
        },
        {
            "metadata": {
                "abstract": "Multiple sequence alignment remains one of the most powerful tools for assessing sequence relateness and the identification of structurally and functionally important protein regions. In this work, two new techniques are introduced to increase the sensitivity of dynamic programming and to enable checks for alignment consistency: Profile-preprocessed and secondary structure-induced alignments. Both strategies are based upon the hierarchical dynamic programming technique and can be applied separately or used in combination. Alignments resulting from the strategies are shown in comparison with the multiple alignment methods CLUSTALX and MULTAL for distant sequence sets of the flavoxin and cupredoxin protein families. © 1999 Elsevier Science Ltd. All rights reserved.",
                "authors": [
                    {
                        "name": "Heringa J."
                    }
                ],
                "citationCount": 98,
                "date": "1999-06-15T00:00:00Z",
                "journal": "Computers and Chemistry",
                "title": "Two strategies for sequence comparison: Profile-preprocessed and secondary structure-induced multiple alignment"
            },
            "pmid": "10404624"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Structure prediction",
            "uri": "http://edamontology.org/topic_0082"
        },
        {
            "term": "Protein secondary structure",
            "uri": "http://edamontology.org/topic_3542"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "Protein folds and structural domains",
            "uri": "http://edamontology.org/topic_0736"
        },
        {
            "term": "Nucleic acid structure analysis",
            "uri": "http://edamontology.org/topic_0097"
        }
    ]
}