{
    "additionDate": "2021-01-18T08:00:39Z",
    "biotoolsCURIE": "biotools:barleynet",
    "biotoolsID": "barleynet",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "insuklee@yonsei.ac.kr",
            "name": "Insuk Lee",
            "typeEntity": "Person"
        },
        {
            "name": "Sungho Lee",
            "typeEntity": "Person"
        },
        {
            "name": "Tak Lee",
            "typeEntity": "Person"
        }
    ],
    "description": "BarleyNet is a co-functional gene network with a companion web server for network-assisted systems genetics analysis of cultivated barley. It is a Bayesian statistics-based combination of a wide range of biological data, including the genomic information of the latest IBSC_v2 genome and barley-specific gene expression profiles. It is able to prioritize novel genes for biological trait of interest or infer functions of unannotated barley genes by combining prior knowledge from forward- or reverse-genetics studies of user with the information included in BarleyNet via three in silico gene/function prioritization algorithms implemented in BarleyNet web server.",
    "download": [
        {
            "type": "Downloads page",
            "url": "http://www.inetbio.org/barleynet/download.php"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                },
                {
                    "term": "Homology-based gene prediction",
                    "uri": "http://edamontology.org/operation_3663"
                },
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                }
            ]
        }
    ],
    "homepage": "https://www.inetbio.org/barleynet",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-01-31T15:14:10Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/netbiolab/BarleyNet/"
        }
    ],
    "name": "BarleyNet",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.3389/FPLS.2020.00098",
            "metadata": {
                "abstract": "© Copyright © 2020 Lee, Lee, Yang and Lee.Cultivated barley (Hordeum vulgare L.) is one of the most produced cereal crops worldwide after maize, bread wheat, and rice. Barley is an important crop species not only as a food source, but also in plant genetics because it harbors numerous stress response alleles in its genome that can be exploited for crop engineering. However, the functional annotation of its genome is relatively poor compared with other major crops. Moreover, bioinformatics tools for system-wide analyses of omics data from barley are not yet available. We have thus developed BarleyNet, a co-functional network of 26,145 barley genes, along with a web server for network-based predictions (http://www.inetbio.org/barleynet). We demonstrated that BarleyNet's prediction of biological processes is more accurate than that of an existing barley gene network. We implemented three complementary network-based algorithms for prioritizing genes or functional concepts to study genetic components of complex traits such as environmental stress responses: (i) a pathway-centric search for candidate genes of pathways or complex traits; (ii) a gene-centric search to infer novel functional concepts for genes; and (iii) a context-centric search for novel genes associated with stress response. We demonstrated the usefulness of these network analysis tools in the study of stress response using proteomics and transcriptomics data from barley leaves and roots upon drought or heat stresses. These results suggest that BarleyNet will facilitate our understanding of the underlying genetic components of complex traits in barley.",
                "authors": [
                    {
                        "name": "Lee I."
                    },
                    {
                        "name": "Lee S."
                    },
                    {
                        "name": "Lee T."
                    },
                    {
                        "name": "Yang S."
                    }
                ],
                "citationCount": 2,
                "date": "2020-02-18T00:00:00Z",
                "journal": "Frontiers in Plant Science",
                "title": "BarleyNet: A Network-Based Functional Omics Analysis Server for Cultivated Barley, Hordeum vulgare L."
            },
            "pmcid": "PMC7040090",
            "pmid": "32133024"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        },
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        }
    ]
}
