{
    "additionDate": "2019-11-14T19:50:49Z",
    "biotoolsCURIE": "biotools:CFNet",
    "biotoolsID": "CFNet",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "jianma@cs.cmu.edu",
            "name": "Jian Ma",
            "typeEntity": "Person"
        }
    ],
    "description": "Rotation equivariant and invariant neural networks for microscopy image analysis | Conic Convolution and DFT Network (CFNet) combines a novel rotation equivariant convolution scheme, called conic convolution, and the DFT to aid networks in learning rotation-invariant tasks. This network has been especially designed to improve performance of CNNs on automated computational tasks related to microscopy image analysis",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                }
            ]
        }
    ],
    "homepage": "https://github.com/bchidest/CFNet",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-12-10T16:02:05Z",
    "name": "CFNet",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ353",
            "metadata": {
                "abstract": "© 2019 The Author(s) 2019. Published by Oxford University Press.Motivation: Neural networks have been widely used to analyze high-throughput microscopy images. However, the performance of neural networks can be significantly improved by encoding known invariance for particular tasks. Highly relevant to the goal of automated cell phenotyping from microscopy image data is rotation invariance. Here we consider the application of two schemes for encoding rotation equivariance and invariance in a convolutional neural network, namely, the group-equivariant CNN (G-CNN), and a new architecture with simple, efficient conic convolution, for classifying microscopy images. We additionally integrate the 2D-discrete-Fourier transform (2D-DFT) as an effective means for encoding global rotational invariance. We call our new method the Conic Convolution and DFT Network (CFNet). Results: We evaluated the efficacy of CFNet and G-CNN as compared to a standard CNN for several different image classification tasks, including simulated and real microscopy images of subcellular protein localization, and demonstrated improved performance. We believe CFNet has the potential to improve many high-throughput microscopy image analysis applications.",
                "authors": [
                    {
                        "name": "Chidester B."
                    },
                    {
                        "name": "Zhou T."
                    },
                    {
                        "name": "Do M.N."
                    },
                    {
                        "name": "Ma J."
                    }
                ],
                "citationCount": 4,
                "date": "2019-07-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Rotation equivariant and invariant neural networks for microscopy image analysis"
            },
            "pmcid": "PMC6612823",
            "pmid": "31510662"
        }
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ],
    "validated": 1
}