{
    "additionDate": "2017-02-10T14:14:21Z",
    "biotoolsCURIE": "biotools:dynavacs",
    "biotoolsID": "dynavacs",
    "description": "Tool for designing DNA vaccines that includes steps for chosing a suitable expression vector, ensuring optimal expression by codon optimization, engineering CpG motifs for enhancing immune responses, and providing additional sequence signals for efficient translation. It also allows to include restriction enzyme mapping and design of primers spanning user specified sequences.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence tagged site (STS) mapping",
                    "uri": "http://edamontology.org/operation_2871"
                },
                {
                    "term": "Mapping",
                    "uri": "http://edamontology.org/operation_2429"
                },
                {
                    "term": "DNA vaccine design",
                    "uri": "http://edamontology.org/operation_0560"
                },
                {
                    "term": "PCR primer design",
                    "uri": "http://edamontology.org/operation_0308"
                }
            ]
        }
    ],
    "homepage": "http://miracle.igib.res.in/dynavac/",
    "homepage_status": 1,
    "lastUpdate": "2018-12-10T12:58:39Z",
    "name": "DyNAVacS",
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "DNA vaccines have slowly emerged as keystones in preventive immunology due to their versatility in inducing both cell-mediated as well as humoral immune responses. The design of an efficient DNA vaccine, involves choice of a suitable expression vector, ensuring optimal expression by codon optimization, engineering CpG motifs for enhancing immune responses and providing additional sequence signals for efficient translation. DyNAVacS is a web-based tool created for rapid and easy design of DNA vaccines. It follows a stepwise design flow, which guides the user through the various sequential steps in the design of the vaccine. Further, it allows restriction enzyme mapping, design of primers spanning user specified sequences and provides information regarding the vectors currently used for generation of DNA vaccines. The web version uses Apache HTTP server. The interface was written in HTML and utilizes the Common Gateway Interface scripts written in PERL for functionality. DyNAVacS is an integrated tool consisting of user-friendly programs, which require minimal information from the user. The software is available free of cost, as a web based application at URL: http://miracle.igib.res.in/ dynavac/.",
                "authors": [
                    {
                        "name": "Harish N."
                    },
                    {
                        "name": "Gupta R."
                    },
                    {
                        "name": "Agarwal P."
                    },
                    {
                        "name": "Scaria V."
                    },
                    {
                        "name": "Pillai B."
                    }
                ],
                "citationCount": 27,
                "date": "2006-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "DyNAVacS: An integrative tool for optimized DNA vaccine design"
            },
            "pmid": "16845007"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Probes and primers",
            "uri": "http://edamontology.org/topic_0632"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Protein expression",
            "uri": "http://edamontology.org/topic_0108"
        },
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        }
    ],
    "validated": 1
}