{
    "accessibility": "Open access",
    "additionDate": "2019-08-11T18:07:52Z",
    "biotoolsCURIE": "biotools:PanoromiX",
    "biotoolsID": "PanoromiX",
    "cost": "Free of charge",
    "description": "Time-course network medicine platform integrating molecular assays and pathophenotypic data.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://bioinfo-abcc.ncifcrf.gov/panoromics/#"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "https://github.com/panoromix/PanoromiX/releases"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Pathway or network prediction",
                    "uri": "http://edamontology.org/operation_3439"
                },
                {
                    "term": "Pathway or network comparison",
                    "uri": "http://edamontology.org/operation_0277"
                },
                {
                    "term": "Gene regulatory network analysis",
                    "uri": "http://edamontology.org/operation_1781"
                }
            ]
        }
    ],
    "homepage": "https://bioinfo-abcc.ncifcrf.gov/panoromics/",
    "language": [
        "JavaScript"
    ],
    "lastUpdate": "2020-06-16T10:55:25Z",
    "license": "Unlicense",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/panoromix/PanoromiX"
        },
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/panoromix/PanoromiX/issues"
        }
    ],
    "maturity": "Mature",
    "name": "PanoromiX",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "Ruta",
    "publication": [
        {
            "doi": "10.1186/s12859-018-2494-6",
            "metadata": {
                "abstract": "© 2018 The Author(s).Background: Network medicine aims to map molecular perturbations of any given diseases onto complex networks with functional interdependencies that underlie a pathological phenotype. Furthermore, investigating the time dimension of disease progression from a network perspective is key to gaining key insights to the disease process and to identify diagnostic or therapeutic targets. Existing platforms are ineffective to modularize the large complex systems into subgroups and consolidate heterogeneous data to web-based interactive animation. Results: We have developed PanoromiX platform, a data-agnostic dynamic interactive visualization web application, enables the visualization of outputs from genome based molecular assays onto modular and interactive networks that are correlated with any pathophenotypic data (MRI, Xray, behavioral, etc.) over a time course all in one pane. As a result, PanoromiX reveals the complex organizing principles that orchestrate a disease-pathology from a gene regulatory network (nodes, edges, hubs, etc.) perspective instead of snap shots of assays. Without extensive programming experience, users can design, share, and interpret their dynamic networks through the PanoromiX platform with rich built-in functionalities. Conclusions: This emergent tool of network medicine is the first to visualize the interconnectedness of tailored genome assays to pathological networks and phenotypes for cells or organisms in a data-agnostic manner. As an advanced network medicine tool, PanoromiX allows monitoring of panel of biomarker perturbations over the progression of diseases, disease classification based on changing network modules that corresponds to specific patho-phenotype as opposed to clinical symptoms, systematic exploration of complex molecular interactions and distinct disease states via regulatory network changes, and the discovery of novel diagnostic and therapeutic targets.",
                "authors": [
                    {
                        "name": "Yang R."
                    },
                    {
                        "name": "Watson D."
                    },
                    {
                        "name": "Williams J."
                    },
                    {
                        "name": "Kumar R."
                    },
                    {
                        "name": "Campbell R."
                    },
                    {
                        "name": "Mudunuri U."
                    },
                    {
                        "name": "Hammamieh R."
                    },
                    {
                        "name": "Jett M."
                    }
                ],
                "date": "2018-11-29T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "PanoromiX: A time-course network medicine platform integrating molecular assays and pathophenotypic data"
            },
            "pmcid": "PMC6267067",
            "pmid": "30497372",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        }
    ],
    "validated": 1
}