
{
    "credit": [
        {
            "email": "jingwang.uestc@gmail.com",
            "name": "Jing Wang",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "User manual",
            "url": "http://bioconductor.org/packages/release/bioc/html/GOFunction.html"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://bioconductor/packages/release/bioc/src/contrib/GOFunction_1.22.0.tar.gz"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Statistical inference",
                    "uri": "http://edamontology.org/operation_3658"
                }
            ]
        }
    ],
    "labels": {
        "collectionID": [
            "BioConductor"
        ],
        "language": [
            "R"
        ],
        "license": "GPL-2.0",
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Command-line tool",
            "Library"
        ],
        "topic": [
            {
                "term": "Genomics",
                "uri": "http://edamontology.org/topic_0622"
            }
        ]
    },
    "publication": [
        {
            "abstract": "In high-throughput studies of diseases, terms enriched with disease-related genes based on Gene Ontology (GO) are routinely found. However, most current algorithms used to find significant GO terms cannot handle the redundancy that results from the dependencies of GO terms. Simply based on some numerical considerations, current algorithms developed for reducing this redundancy may produce results that do not account for biologically interesting cases. In this article, we present several rules used to design a tool called GO-function for extracting biologically relevant terms from statistically significant GO terms for a disease. Using one gene expression profile for colorectal cancer, we compared GO-function with four algorithms designed to treat redundancy. Then, we validated results obtained in this data set by GO-function using another data set for colorectal cancer. Our analysis showed that GO-function can identify disease-related terms that are more statistically and biologically meaningful than those found by the other four algorithms. © The Author 2011. Published by Oxford University Press.",
            "authors": [
                "Wang J.",
                "Zhou X.",
                "Zhu J.",
                "Gu Y.",
                "Zhao W.",
                "Zou J.",
                "Guo Z."
            ],
            "cit_count": 45,
            "doi": "10.1093/bib/bbr041",
            "journal": "Briefings in Bioinformatics",
            "title": "Go-function: Deriving biologically relevant functions from statistically significant functions",
            "type": "Primary",
            "year": "2012-03-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:gofunction",
        "biotoolsID": "gofunction",
        "description": "The GO-function package provides a tool to address the redundancy that result from the GO structure or multiple annotation genes and derive biologically relevant functions from the statistically significant functions based on some intuitive assumption and statistical testing.",
        "homepage": "http://bioconductor.org/packages/release/bioc/html/GOFunction.html",
        "name": "GOFunction",
        "version": [
            "1.22.0"
        ]
    }
}