{"credit":[{"name":"BioCatalogue","typeEntity":"Project","typeRoles":["Documentor"],"url":"https://www.biocatalogue.org"},{"typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://www.g-language.org/wiki/home"}],"documentation":[{"type":"GENERAL","url":"http://ws.g-language.org/gdoc/"}],"function":[{"operation":[{"term":"Sequence analysis","uri":"http://edamontology.org/operation_2403"}]}],"labels":{"operatingSystem":["Linux","Windows","Mac"],"toolType":["Web service"],"topic":[{"term":"Sequence analysis","uri":"http://edamontology.org/topic_0080"},{"term":"Statistics and probability","uri":"http://edamontology.org/topic_2269"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"https://www.biocatalogue.org/services/2623"}],"publication":[{"abstract":"The popular European Molecular Biology Open Software Suite (EMBOSS) currently contains over 400 tools used in various bioinformatics researches, equipped with sophisticated development frameworks for interoperability and tool discoverability as well as rich documentations and various user interfaces. In order to further strengthen EMBOSS in the fields of genomics, we here present a novel EMBOSS associated software (EMBASSY) package named GEMBASSY, which adds more than 50 analysis tools from the G-language Genome Analysis Environment and its Representational State Transfer (REST) and SOAP web services. GEMBASSY basically contains wrapper programs of G-language REST/SOAP web services to provide intuitive and easy access to various annotations within complete genome flatfiles, as well as tools for analyzing nucleic composition, calculating codon usage, and visualizing genomic information. For example, analysis methods such as for calculating distance between sequences by genomic signatures and for predicting gene expression levels from codon usage bias are effective in the interpretation of meta-genomic and meta-transcriptomic data. GEMBASSY tools can be used seamlessly with other EMBOSS tools and UNIX command line tools. The source code written in C is available from GitHub (https://github.com/celery-kotone/GEMBASSY/) and the distribution package is freely available from the GEMBASSY web site (http://www.g-language.org/gembassy/). © 2013 Itaya et al.; licensee BioMed Central Ltd.","authors":["Itaya H.","Oshita K.","Arakawa K.","Tomita M."],"cit_count":2,"doi":"10.1186/1751-0473-8-17","journal":"Source Code for Biology and Medicine","title":"GEMBASSY: An EMBOSS associated software package for comprehensive genome analyses","type":"Primary","year":"2013-08-29"}],"summary":{"biotoolsCURIE":"biotools:g-language_ws","biotoolsID":"g-language_ws","description":"Great variety of useful genome analysis tools.","homepage":"http://ws.g-language.org/gdoc/","name":"G-language Genome Analysis Environment WS","version":["1"]}}