{
    "name": "MICheck", 
    "description": "Verify gene annotations in previously published microbial genomes.", 
    "homepage": "http://www.genoscope.cns.fr/agc/tools/micheck/", 
    "biotoolsID": "micheck", 
    "biotoolsCURIE": "biotools:micheck", 
    "version": [], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_3672", 
                    "term": "Gene functional annotation"
                }, 
                {
                    "uri": "http://edamontology.org/operation_0362", 
                    "term": "Genome annotation"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Web application"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_0622", 
            "term": "Genomics"
        }, 
        {
            "uri": "http://edamontology.org/topic_3697", 
            "term": "Microbial ecology"
        }, 
        {
            "uri": "http://edamontology.org/topic_3339", 
            "term": "Microbial collection"
        }
    ], 
    "operatingSystem": [
        "Linux", 
        "Windows", 
        "Mac"
    ], 
    "language": [
        "PHP", 
        "C"
    ], 
    "license": null, 
    "collectionID": [], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [], 
    "download": [], 
    "documentation": [
        {
            "url": "http://www.genoscope.cns.fr/agc/tools/micheck/html/Method.html?AMIGA=9c10f44b4b5bf1290bf6ed1adb416563", 
            "type": "General", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": null, 
            "pmid": "15980515", 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "MICheck: A web tool for fast checking of syntactic annotations of bacterial genomes", 
                "abstract": "The annotation of newly sequenced bacterial genomes begins with running several automatic analysis methods, with major emphasis on the identification of protein-coding genes. DNA sequences are heterogeneous in local nucleotide composition and this leads sometimes to sequences being annotated as authentic genes when they are not protein-coding genes or are true but uncharacterized protein-coding genes. This first annotation step is generally followed by an expert manual annotation of the predicted genes. The genomic data (sequence and annotations) organized in an appropriate databank file format is subsequently submitted to an entry point of the International Nucleotide Sequence Database. These procedures are inevitably subject to mistakes, and this can lead to unintentional syntactic annotation errors being stored in public databanks. Here, we present a new web program, MICheck (MIcrobial genome Checker), that enables rapid verification of sets of annotated genes and frameshifts in previously published bacterial genomes. The web interface allows one easily to investigate the MICheck results, i.e. inaccurate or missed gene annotations: a graphical representation is drawn, in which the genomic context of a unique coding DNA sequence annotation or a predicted frameshift is given, using information on the coding potential (curves) and annotation of the neighbouring genes. We illustrate some capabilities of the MICheck site through the analysis of 20 bacterial genomes, 9 of which were selected for their 'Reviewed' status in the National Center for Biotechnology Information (NCBI) Reference Sequence Project (RefSeq). In the context of the numerous re-annotation projects for microbial genomes, this tool can be seen as a preliminary step before the functional re-annotation step to check quickly for missing or wrongly annotated genes. The MICheck website is accessible at the following address: http://www.genoscope.cns.fr/agc/ tools/micheck. © 2005 Oxford University Press.", 
                "date": "2005-07-01T00:00:00Z", 
                "citationCount": 18, 
                "authors": [
                    {
                        "name": "Cruveiller S."
                    }, 
                    {
                        "name": "Le Saux J."
                    }, 
                    {
                        "name": "Vallenet D."
                    }, 
                    {
                        "name": "Lajus A."
                    }, 
                    {
                        "name": "Bocs S."
                    }, 
                    {
                        "name": "Medigue C."
                    }
                ], 
                "journal": "Nucleic Acids Research"
            }
        }
    ], 
    "credit": [
        {
            "name": "Claudine Medigue", 
            "email": "claudine.medigue@genoscope.cns.fr", 
            "url": null, 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "ELIXIR-EE", 
    "additionDate": "2017-02-10T14:14:07Z", 
    "lastUpdate": "2018-12-10T12:58:55Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 1, 
    "homepage_status": 0, 
    "elixir_badge": 0
}