{
    "accessibility": "Open access",
    "additionDate": "2022-12-29T18:36:13.406814Z",
    "biotoolsCURIE": "biotools:justdeepit",
    "biotoolsID": "justdeepit",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "sun@biunit.dev",
            "name": "Jianqiang Sun",
            "typeEntity": "Person"
        },
        {
            "name": "Takehiko Yamanaka"
        },
        {
            "name": "Wei Cao"
        }
    ],
    "description": "Software tool with graphical and character user interfaces for deep learning-based object detection and segmentation in image analysis.\n\nDeep learning has been applied to solve various problems, especially in image recognition, across many fields including the life sciences and agriculture.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Feature extraction",
                    "uri": "http://edamontology.org/operation_3937"
                },
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                },
                {
                    "term": "Image annotation",
                    "uri": "http://edamontology.org/operation_3553"
                }
            ]
        }
    ],
    "homepage": "https://github.com/biunit/JustDeepIt",
    "language": [
        "JavaScript",
        "Python"
    ],
    "lastUpdate": "2024-11-24T15:15:07.793293Z",
    "license": "MIT",
    "name": "JustDeepIt",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.3389/fpls.2022.964058",
            "metadata": {
                "abstract": "Image processing and analysis based on deep learning are becoming mainstream and increasingly accessible for solving various scientific problems in diverse fields. However, it requires advanced computer programming skills and a basic familiarity with character user interfaces (CUIs). Consequently, programming beginners face a considerable technical hurdle. Because potential users of image analysis are experimentalists, who often use graphical user interfaces (GUIs) in their daily work, there is a need to develop GUI-based easy-to-use deep learning software to support their work. Here, we introduce JustDeepIt, a software written in Python, to simplify object detection and instance segmentation using deep learning. JustDeepIt provides both a GUI and a CUI. It contains various functional modules for model building and inference, and it is built upon the popular PyTorch, MMDetection, and Detectron2 libraries. The GUI is implemented using the Python library FastAPI, simplifying model building for various deep learning approaches for beginners. As practical examples of JustDeepIt, we prepared four case studies that cover critical issues in plant science: (1) wheat head detection with Faster R-CNN, YOLOv3, SSD, and RetinaNet; (2) sugar beet and weed segmentation with Mask R-CNN; (3) plant segmentation with U2-Net; and (4) leaf segmentation with U2-Net. The results support the wide applicability of JustDeepIt in plant science applications. In addition, we believe that JustDeepIt has the potential to be applied to deep learning-based image analysis in various fields beyond plant science.",
                "authors": [
                    {
                        "name": "Cao W."
                    },
                    {
                        "name": "Sun J."
                    },
                    {
                        "name": "Yamanaka T."
                    }
                ],
                "citationCount": 3,
                "date": "2022-10-06T00:00:00Z",
                "journal": "Frontiers in Plant Science",
                "title": "JustDeepIt: Software tool with graphical and character user interfaces for deep learning-based object detection and segmentation in image analysis"
            },
            "pmcid": "PMC9583140",
            "pmid": "36275541"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Agricultural science",
            "uri": "http://edamontology.org/topic_3810"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Informatics",
            "uri": "http://edamontology.org/topic_0605"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        }
    ],
    "validated": 1
}
