{
    "accessibility": "Open access",
    "additionDate": "2019-05-28T08:24:21Z",
    "biotoolsCURIE": "biotools:CiDD",
    "biotoolsID": "CiDD",
    "cost": "Free of charge (with restrictions)",
    "credit": [
        {
            "email": "pascheet@mdanderson.org",
            "name": "Paul Scheet",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Cancer in silico Drug Discovery (CIDD) is a platform to integrate data from the TCGA, Connectivity Map (CMap) and Cancer Cell Line Encyclopedia to facilitate and automate discovery of candidate drug compounds with the ultimate goal for treatment or chemo-prevention of cancer.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://sites.google.com/site/integrativecancergenomics/software/cidd"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Differential gene expression analysis",
                    "uri": "http://edamontology.org/operation_3223"
                },
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                },
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                }
            ]
        }
    ],
    "homepage": "http://cidd.scheetlabsoftware.org/",
    "language": [
        "Python",
        "R"
    ],
    "lastUpdate": "2020-06-16T10:55:22Z",
    "license": "GPL-3.0",
    "maturity": "Mature",
    "name": "CiDD",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "Ruta",
    "publication": [
        {
            "doi": "10.1158/1535-7163.MCT-14-0260",
            "metadata": {
                "abstract": "©2014 AACR.Large-scale cancer datasets such as The Cancer Genome Atlas (TCGA) allow researchers to profile tumors based on a wide range of clinical and molecular characteristics. Subsequently, TCGA-derived gene expression profiles can be analyzed with the Connectivity Map (CMap) to find candidate drugs to target tumors with specific clinical phenotypes or molecular characteristics. This represents a powerful computational approach for candidate drug identification, but due to the complexity of TCGA and technology differences between CMap and TCGA experiments, such analyses are challenging to conduct and reproduce. We present Cancer in silico Drug Discovery (CiDD; scheet.org/software), a computational drug discovery platform that addresses these challenges. CiDD integrates data from TCGA, CMap, and Cancer Cell Line Encyclopedia (CCLE) to perform computational drug discovery experiments, generating hypotheses for the following three general problems: (i) determining whether specific clinical phenotypes or molecular characteristics are associated with unique gene expression signatures; (ii) finding candidate drugs to repress these expression signatures; and (iii) identifying cell lines that resemble the tumors being studied for subsequent in vitro experiments. The primary input to CiDD is a clinical or molecular characteristic. The output is a biologically annotated list of candidate drugs and a list of cell lines for in vitro experimentation. We applied CiDD to identify candidate drugs to treat colorectal cancers harboring mutations in BRAF. CiDD identified EGFR and proteasome inhibitors, while proposing five cell lines for in vitro testing. CiDD facilitates phenotype-driven, systematic drug discovery based on clinical and molecular data from TCGA.",
                "authors": [
                    {
                        "name": "Chang K."
                    },
                    {
                        "name": "Fowler J."
                    },
                    {
                        "name": "Kopetz S."
                    },
                    {
                        "name": "San Lucas F.A."
                    },
                    {
                        "name": "Scheet P."
                    },
                    {
                        "name": "Vilar E."
                    }
                ],
                "citationCount": 13,
                "date": "2014-12-01T00:00:00Z",
                "journal": "Molecular Cancer Therapeutics",
                "title": "Cancer In Silico drug discovery: A systems biology tool for identifying candidate drugs to target specific molecular tumor subtypes"
            },
            "pmcid": "PMC4341901",
            "pmid": "25349306",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Drug discovery",
            "uri": "http://edamontology.org/topic_3336"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ],
    "validated": 1
}
