{
    "additionDate": "2021-03-19T08:31:20Z",
    "biotoolsCURIE": "biotools:nebula-kmer",
    "biotoolsID": "nebula-kmer",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "fhormozd@ucdavis.edu",
            "name": "Fereydoun Hormozdiari",
            "typeEntity": "Person"
        },
        {
            "email": "pkhorsand@ucdavis.edu",
            "name": "Parsoa Khorsand",
            "typeEntity": "Person"
        }
    ],
    "description": "Ultra-efficient mapping-free structural variant genotyper.\n\nNebula is an ultra-efficient mapping-free structural variation genotyper based on kmer counting.\n\nNebula is a mapping-free approach for accurate and efficient genotyping of SVs. Nebula is a two-stage approach and consists of a kmer extraction phase and a genotyping phase. Given as input a set of SV coordinates (BED/VCF), the reference assembly (FASTA), and a set of mapped samples on which the genotype of these SVs is already known, Nebula extracts a collection of kmers that represent the input SVs (kmer extraction phase) and these extracted kmers will then be used to genotype the same set of SVs on any new WGS sample(s) without the need to map the reads to the reference genome (genotyping phase). This is done by counting the kmers in the WGS reads of the new sample(s) and predicting genotypes using a likelihood model.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "De-novo assembly",
                    "uri": "http://edamontology.org/operation_0524"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Phasing",
                    "uri": "http://edamontology.org/operation_3454"
                },
                {
                    "term": "SNP detection",
                    "uri": "http://edamontology.org/operation_0484"
                },
                {
                    "term": "k-mer counting",
                    "uri": "http://edamontology.org/operation_3472"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Parsoa/Nebula",
    "language": [
        "C++"
    ],
    "lastUpdate": "2021-04-11T11:29:58Z",
    "name": "Nebula-kmer",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1093/NAR/GKAB025",
            "metadata": {
                "abstract": "© 2021 Oxford University Press. All rights reserved.Large scale catalogs of common genetic variants (including indels and structural variants) are being created using data from second and third generation whole-genome sequencing technologies. However, the genotyping of these variants in newly sequenced samples is a nontrivial task that requires extensive computational resources. Furthermore, current approaches are mostly limited to only specific types of variants and are generally prone to various errors and ambiguities when genotyping complex events. We are proposing an ultra-efficient approach for genotyping any type of structural variation that is not limited by the shortcomings and complexities of current mapping-based approaches. Our method Nebula utilizes the changes in the count of k-mers to predict the genotype of structural variants. We have shown that not only Nebula is an order of magnitude faster than mapping based approaches for genotyping structural variants, but also has comparable accuracy to state-of-the-art approaches. Furthermore, Nebula is a generic framework not limited to any specific type of event. Nebula is publicly available at http://github.com/Parsoa/Nebula. &copy; 2021 The Author(s). Published by Oxford University Press on behalf of Nucleic Acids Research.",
                "authors": [
                    {
                        "name": "Hormozdiari F."
                    },
                    {
                        "name": "Khorsand P."
                    }
                ],
                "date": "2021-05-07T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "Nebula: Ultra-efficient mapping-free structural variant genotyper"
            },
            "pmid": "33503255"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Structural variation",
            "uri": "http://edamontology.org/topic_3175"
        },
        {
            "term": "Whole genome sequencing",
            "uri": "http://edamontology.org/topic_3673"
        }
    ]
}
