{
    "additionDate": "2020-01-14T09:20:19Z",
    "biotoolsCURIE": "biotools:RaNA-Seq",
    "biotoolsID": "RaNA-Seq",
    "confidence_flag": "tool",
    "description": "RaNA-Seq is an open bioinformatics tool for the quick analysis of RNA-Seq data. It performs a full analysis in minutes quantifying FASTQ files, calculating quality control metrics, running differential expression analyses and enabling the interpretation of results with functional analyses. Our analysis pipeline integrates cutting edge bioinformatics tools and simplify its application with a friendly Web interface designed for non-experienced users in these analyses. Each analysis can be customized setting up input parameters and applies generally accepted and reproducible protocols. Analysis results are presented as interactive graphics and reports, ready for their interpretation and publication.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "RNA-Seq quantification",
                    "uri": "http://edamontology.org/operation_3800"
                },
                {
                    "term": "Gene-set enrichment analysis",
                    "uri": "http://edamontology.org/operation_2436"
                },
                {
                    "term": "RNA-Seq analysis",
                    "uri": "http://edamontology.org/operation_3680"
                }
            ]
        }
    ],
    "homepage": "https://ranaseq.eu",
    "lastUpdate": "2021-01-15T18:40:18Z",
    "name": "RaNA-Seq",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ854",
            "metadata": {
                "abstract": "© The Author(s) 2019. Published by Oxford University Press. All rights reserved.RaNA-Seq is a cloud platform for the rapid analysis and visualization of RNA-Seq data. It performs a full analysis in minutes by quantifying FASTQ files, calculating quality control metrics, running differential expression analyses and enabling the explanation of results with functional analyses. Our analysis pipeline applies generally accepted and reproducible protocols that can be applied with two simple steps in its web interface. Analysis results are presented as interactive graphics and reports, ready for their interpretation and publication. Availability and implementation: RaNA-Seq web service is freely available online at https://ranaseq.eu.",
                "authors": [
                    {
                        "name": "Prieto C."
                    },
                    {
                        "name": "Barrios D."
                    }
                ],
                "citationCount": 1,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "RaNA-Seq: Interactive RNA-Seq analysis from FASTQ files to functional analysis"
            },
            "pmid": "31730197"
        }
    ],
    "topic": [
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Bioinformatics",
            "uri": "http://edamontology.org/topic_0091"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        }
    ],
    "validated": 1
}