{
    "additionDate": "2017-12-18T00:15:45Z",
    "biotoolsCURIE": "biotools:tmvar",
    "biotoolsID": "tmvar",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://sites.google.com/site/chihhsuanwei/"
        }
    ],
    "description": "Text-mining approach based on conditional random field (CRF) for extracting a wide range of sequence variants in both protein and gene levels according to a standard sequence variants nomenclature developed by the human genome variation society (HGVS).",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://www.ncbi.nlm.nih.gov/research/bionlp/Tools/tmvar/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Text mining",
                    "uri": "http://edamontology.org/operation_0306"
                }
            ]
        }
    ],
    "homepage": "https://www.ncbi.nlm.nih.gov/research/bionlp/Tools/tmvar/",
    "language": [
        "Java"
    ],
    "lastUpdate": "2019-01-15T02:19:18Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/tmvar-text-mining-approach-for-extracting-sequence-variants-in-biomedical-literature.html"
        }
    ],
    "name": "tmVar",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btx541",
            "metadata": {
                "abstract": "© 2017 The Author.Motivation: Despite significant efforts in expert curation, clinical relevance about most of the 154 million dbSNP reference variants (RS) remains unknown. However, a wealth of knowledge about the variant biological function/disease impact is buried in unstructured literature data. Previous studies have attempted to harvest and unlock such information with text-mining techniques but are of limited use because their mutation extraction results are not standardized or integrated with curated data. Results: We propose an automatic method to extract and normalize variant mentions to unique identifiers (dbSNP RSIDs). Our method, in benchmarking results, demonstrates a high F-measure of ∼90% and compared favorably to the state of the art. Next, we applied our approach to the entire PubMed and validated the results by verifying that each extracted variant-gene pair matched the dbSNP annotation based on mapped genomic position, and by analyzing variants curated in ClinVar. We then determined which text-mined variants and genes constituted novel discoveries. Our analysis reveals 41 889 RS numbers (associated with 9151 genes) not found in ClinVar. Moreover, we obtained a rich set worth further review: 12 462 rare variants (MAF≤0.01) in 3849 genes which are presumed to be deleterious and not frequently found in the general population. To our knowledge, this is the first large-scale study to analyze and integrate text-mined variant data with curated knowledge in existing databases. Our results suggest that databases can be significantly enriched by text mining and that the combined information can greatly assist human efforts in evaluating/prioritizing variants in genomic research.",
                "authors": [
                    {
                        "name": "Wei C.-H."
                    },
                    {
                        "name": "Phan L."
                    },
                    {
                        "name": "Feltz J."
                    },
                    {
                        "name": "Maiti R."
                    },
                    {
                        "name": "Hefferon T."
                    },
                    {
                        "name": "Lu Z."
                    }
                ],
                "citationCount": 31,
                "date": "2018-01-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "TmVar 2.0: Integrating genomic variant information from literature with dbSNP and ClinVar for precision medicine"
            },
            "pmcid": "PMC5860583",
            "pmid": "28968638",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Natural language processing",
            "uri": "http://edamontology.org/topic_0218"
        },
        {
            "term": "Protein expression",
            "uri": "http://edamontology.org/topic_0108"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        }
    ],
    "validated": 1
}