{
    "additionDate": "2017-01-17T15:07:57Z",
    "biotoolsCURIE": "biotools:peakseq",
    "biotoolsID": "peakseq",
    "collectionID": [
        "EBI Training Tools"
    ],
    "credit": [
        {
            "email": "joel.rozowsky@yale.edu",
            "name": "Joel Rozowsky",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "Arif.Harmanci@yale.edu",
            "name": "Arif Harmanci",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "PeakSeq is a program for identifying and ranking peak regions in ChIP-Seq experiments.",
    "documentation": [
        {
            "type": "General",
            "url": "http://info.gersteinlab.org/PeakSeq"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Peak calling",
                    "uri": "http://edamontology.org/operation_3222"
                }
            ]
        }
    ],
    "homepage": "http://info.gersteinlab.org/PeakSeq",
    "language": [
        "Perl",
        "C"
    ],
    "lastUpdate": "2018-12-10T12:58:56Z",
    "name": "PeakSeq",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "ebi_training_import",
    "publication": [
        {
            "doi": "10.1038/nbt.1518",
            "metadata": {
                "abstract": "Chromatin immunoprecipitation (ChIP) followed by tag sequencing (ChIP-seq) using high-throughput next-generation instrumentation is fast, replacing chromatin immunoprecipitation followed by genome tiling array analysis (ChIP-chip) as the preferred approach for mapping of sites of transcription-factor binding and chromatin modification. Using two deeply sequenced data sets for human RNA polymerase II and STAT1, each with matching input-DNA controls, we describe a general scoring approach to address unique challenges in ChIP-seq data analysis. Our approach is based on the observation that sites of potential binding are strongly correlated with signal peaks in the control, likely revealing features of open chromatin. We develop a two-pass strategy called PeakSeq to compensate for this. A two-pass strategy compensates for signal caused by open chromatin, as revealed by inclusion of the controls. The first pass identifies putative binding sites and compensates for genomic variation in the 'mappability' of sequences. The second pass filters out sites not significantly enriched compared to the normalized control, computing precise enrichments and significances. Our scoring procedure enables us to optimize experimental design by estimating the depth of sequencing required for a desired level of coverage and demonstrating that more than two replicates provides only a marginal gain in information. © 2009 Nature America, Inc. All rights reserved.",
                "authors": [
                    {
                        "name": "Rozowsky J."
                    },
                    {
                        "name": "Euskirchen G."
                    },
                    {
                        "name": "Auerbach R.K."
                    },
                    {
                        "name": "Zhang Z.D."
                    },
                    {
                        "name": "Gibson T."
                    },
                    {
                        "name": "Bjornson R."
                    },
                    {
                        "name": "Carriero N."
                    },
                    {
                        "name": "Snyder M."
                    },
                    {
                        "name": "Gerstein M.B."
                    }
                ],
                "citationCount": 385,
                "date": "2009-01-25T00:00:00Z",
                "journal": "Nature Biotechnology",
                "title": "PeakSeq enables systematic scoring of ChIP-seq experiments relative to controls"
            }
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "ChIP-seq",
            "uri": "http://edamontology.org/topic_3169"
        }
    ],
    "validated": 1
}