{
    "additionDate": "2020-01-14T09:22:16Z",
    "biotoolsCURIE": "biotools:MySweetGestation",
    "biotoolsID": "MySweetGestation",
    "confidence_flag": "high",
    "description": "A novel smartphone application for women with or at risk of diabetes during pregnancy.\n\nMobile health (mHealth) applications (apps) have been recently introduced as an easily accessible tool for providing information to pregnant women with diabetes. Despite the growing number of apps on the topic \"diabetes & pregnancy\", a smartphone app offering comprehensive and individualized information to both women (before and during gestation) and their healthcare professionals was still missing. To overcome this lack, the Italian Diabetes and Pregnancy Study Group conceived and realized in 2016 a novel mobile app called \"MySweetGestation\". It is designed to be an interactive educational tool for both patients and physicians not expert in the field.\n\n||| HOMEPAGE MISSING!",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://www.ncbi.nlm.nih.gov/pubmed/?term=31669627",
    "lastUpdate": "2020-01-14T09:22:16Z",
    "name": "MySweetGestation",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1016/J.DIABRES.2019.107896",
            "metadata": {
                "abstract": "© 2019 Elsevier B.V.Mobile health (mHealth) applications (apps) have been recently introduced as an easily accessible tool for providing information to pregnant women with diabetes. Despite the growing number of apps on the topic “diabetes & pregnancy”, a smartphone app offering comprehensive and individualized information to both women (before and during gestation) and their healthcare professionals was still missing. To overcome this lack, the Italian Diabetes and Pregnancy Study Group conceived and realized in 2016 a novel mobile app called “MySweetGestation”. It is designed to be an interactive educational tool for both patients and physicians not expert in the field. Through an interactive way of learning, it provides validated information to the user, focusing on different area of interest: from prevention and risk factors for developing diabetes during pregnancy to treatment and follow-up strategies after gestation. Three years since its publication, MySweetGestation has been downloaded in different western and eastern countries worldwide, suggesting a widespread social impact. Easily accessible personalized information made available via mHealth technology may be of great importance to spread controlled information among the pregnant population. MySweetGestation, being an interactive educational device for both patients and healthcare professionals, may contribute to improve the management of pregnant women with diabetes.",
                "authors": [
                    {
                        "name": "Tumminia A."
                    },
                    {
                        "name": "Vitacolonna E."
                    },
                    {
                        "name": "Sciacca L."
                    },
                    {
                        "name": "Dodesini A.R."
                    },
                    {
                        "name": "Festa C."
                    },
                    {
                        "name": "Lencioni C."
                    },
                    {
                        "name": "Marcone T."
                    },
                    {
                        "name": "Pintaudi B."
                    },
                    {
                        "name": "Scavini M."
                    },
                    {
                        "name": "Succurro E."
                    },
                    {
                        "name": "Torlone E."
                    },
                    {
                        "name": "Napoli A."
                    }
                ],
                "date": "2019-12-01T00:00:00Z",
                "journal": "Diabetes Research and Clinical Practice",
                "title": "“MySweetGestation”: A novel smartphone application for women with or at risk of diabetes during pregnancy"
            },
            "pmid": "31669627"
        }
    ]
}