{
    "additionDate": "2018-05-23T14:45:49Z",
    "biotoolsCURIE": "biotools:dintor",
    "biotoolsID": "dintor",
    "collectionID": [
        "Proteomics"
    ],
    "credit": [
        {
            "email": "christian.weichenberger@eurac.edu",
            "name": "Christian Weichenberger",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Functional annotation of genomic and proteomic data.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://dintor.eurac.edu/"
        }
    ],
    "editPermission": {
        "authors": [
            "cweich",
            "proteomics.bio.tools"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genome annotation",
                    "uri": "http://edamontology.org/operation_0362"
                }
            ]
        }
    ],
    "homepage": "https://dintor.eurac.edu/",
    "language": [
        "Perl",
        "Python"
    ],
    "lastUpdate": "2019-07-04T10:37:23Z",
    "license": "MIT",
    "name": "Dintor",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1186/S12864-015-2279-5",
            "metadata": {
                "abstract": "© 2015 Weichenberger et al.Background: During the last decade, a great number of extremely valuable large-scale genomics and proteomics datasets have become available to the research community. In addition, dropping costs for conducting high-throughput sequencing experiments and the option to outsource them considerably contribute to an increasing number of researchers becoming active in this field. Even though various computational approaches have been developed to analyze these data, it is still a laborious task involving prudent integration of many heterogeneous and frequently updated data sources, creating a barrier for interested scientists to accomplish their own analysis. Results: We have implemented Dintor, a data integration framework that provides a set of over 30 tools to assist researchers in the exploration of genomics and proteomics datasets. Each of the tools solves a particular task and several tools can be combined into data processing pipelines. Dintor covers a wide range of frequently required functionalities, from gene identifier conversions and orthology mappings to functional annotation of proteins and genetic variants up to candidate gene prioritization and Gene Ontology-based gene set enrichment analysis. Since the tools operate on constantly changing datasets, we provide a mechanism to unambiguously link tools with different versions of archived datasets, which guarantees reproducible results for future tool invocations. We demonstrate a selection of Dintor's capabilities by analyzing datasets from four representative publications. The open source software can be downloaded and installed on a local Unix machine. For reasons of data privacy it can be configured to retrieve local data only. In addition, the Dintor tools are available on our public Galaxy web service at http://dintor.eurac.edu. Conclusions: Dintor is a computational annotation framework for the analysis of genomic and proteomic datasets, providing a rich set of tools that cover the most frequently encountered tasks. A major advantage is its capability to consistently handle multiple versions of tool-associated datasets, supporting the researcher in delivering reproducible results.",
                "authors": [
                    {
                        "name": "Bernstein E."
                    },
                    {
                        "name": "Blankenburg H."
                    },
                    {
                        "name": "D'Elia Y."
                    },
                    {
                        "name": "Domingues F.S."
                    },
                    {
                        "name": "Konig E."
                    },
                    {
                        "name": "Palermo A."
                    },
                    {
                        "name": "Weichenberger C.X."
                    }
                ],
                "citationCount": 9,
                "date": "2015-12-21T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "Dintor: Functional annotation of genomic and proteomic data"
            },
            "pmcid": "PMC4687148",
            "pmid": "26691694"
        }
    ],
    "toolType": [
        "Command-line tool",
        "Web application"
    ],
    "topic": [
        {
            "term": "Data submission, annotation and curation",
            "uri": "http://edamontology.org/topic_0219"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        }
    ],
    "validated": 1
}
