{
    "additionDate": "2021-01-18T09:59:10Z",
    "biotoolsCURIE": "biotools:logicnet",
    "biotoolsID": "logicnet",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "a.malekpour@ut.ac.ir",
            "name": "Seyed Amir Malekpour",
            "orcidid": "https://orcid.org/0000-0002-3525-3548",
            "typeEntity": "Person"
        }
    ],
    "description": "Probabilistic continuous logics in reconstructing gene regulatory networks.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Gene regulatory network analysis",
                    "uri": "http://edamontology.org/operation_1781"
                },
                {
                    "term": "Gene regulatory network prediction",
                    "uri": "http://edamontology.org/operation_2437"
                }
            ]
        }
    ],
    "homepage": "https://github.com/CompBioIPM/LogicNet",
    "lastUpdate": "2021-02-17T07:31:38Z",
    "name": "LogicNet",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1186/S12859-020-03651-X",
            "metadata": {
                "abstract": "© 2020 The Author(s).Background: Gene Regulatory Networks (GRNs) have been previously studied by using Boolean/multi-state logics. While the gene expression values are usually scaled into the range [0, 1], these GRN inference methods apply a threshold to discretize the data, resulting in missing information. Most of studies apply fuzzy logics to infer the logical gene-gene interactions from continuous data. However, all these approaches require an a priori known network structure. Results: Here, by introducing a new probabilistic logic for continuous data, we propose a novel logic-based approach (called the LogicNet) for the simultaneous reconstruction of the GRN structure and identification of the logics among the regulatory genes, from the continuous gene expression data. In contrast to the previous approaches, the LogicNet does not require an a priori known network structure to infer the logics. The proposed probabilistic logic is superior to the existing fuzzy logics and is more relevant to the biological contexts than the fuzzy logics. The performance of the LogicNet is superior to that of several Mutual Information-based and regression-based tools for reconstructing GRNs. Conclusions: The LogicNet reconstructs GRNs and logic functions without requiring prior knowledge of the network structure. Moreover, in another application, the LogicNet can be applied for logic function detection from the known regulatory genes-target interactions. We also conclude that computational modeling of the logical interactions among the regulatory genes significantly improves the GRN reconstruction accuracy.",
                "authors": [
                    {
                        "name": "Alizad-Rahvar A.R."
                    },
                    {
                        "name": "Malekpour S.A."
                    },
                    {
                        "name": "Sadeghi M."
                    }
                ],
                "citationCount": 1,
                "date": "2020-07-20T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "LogicNet: Probabilistic continuous logics in reconstructing gene regulatory networks"
            },
            "pmcid": "PMC7372900",
            "pmid": "32690031"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ]
}
