
{
    "credit": [
        {
            "email": "pierre.tuffery@univ-paris-diderot.fr",
            "name": "Pierre Tufféry",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "https://bioserv.rpbs.univ-paris-diderot.fr/services/PEP-SiteFinder"
        }
    ],
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Protein sequence",
                        "uri": "http://edamontology.org/data_2976"
                    },
                    "format": [
                        {
                            "term": "FASTA",
                            "uri": "http://edamontology.org/format_1929"
                        }
                    ]
                },
                {
                    "data": {
                        "term": "Protein structure",
                        "uri": "http://edamontology.org/data_1460"
                    },
                    "format": [
                        {
                            "term": "PDB",
                            "uri": "http://edamontology.org/format_1476"
                        }
                    ]
                }
            ],
            "operation": [
                {
                    "term": "Ab initio structure prediction",
                    "uri": "http://edamontology.org/operation_0476"
                },
                {
                    "term": "Ligand-binding site prediction",
                    "uri": "http://edamontology.org/operation_3897"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Protein-ligand complex",
                        "uri": "http://edamontology.org/data_1461"
                    },
                    "format": [
                        {
                            "term": "PDB",
                            "uri": "http://edamontology.org/format_1476"
                        }
                    ]
                }
            ]
        }
    ],
    "labels": {
        "accessibility": [
            "Open access"
        ],
        "cost": "Free of charge",
        "maturity": "Mature",
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Protein binding sites",
                "uri": "http://edamontology.org/topic_3534"
            },
            {
                "term": "Molecular modelling",
                "uri": "http://edamontology.org/topic_2275"
            }
        ]
    },
    "publication": [
        {
            "abstract": "Peptide-protein interactions are important to many processes of life, particularly for signal transmission or regulatory mechanisms. When no information is known about the interaction between a protein and a peptide, it is of interest to propose candidate sites of interaction at the protein surface, to assist the design of biological experiments to probe the interaction, or to serve as a starting point for more focused in silico approaches. PEP-SiteFinder is a tool that will, given the structure of a protein and the sequence of a peptide, identify protein residues predicted to be at peptide-protein interface. PEP-SiteFinder relies on the 3D de novo generation of peptide conformations given its sequence. These conformations then undergo a fast blind rigid docking on the complete protein surface, and we have found, as the result of a benchmark over 41 complexes, that the best poses overlap to some extent the experimental patch of interaction for close to 90% complexes. In addition, PEP-SiteFinder also returns a propensity index we have found informative about the confidence of the prediction. The PEP-SiteFinder web server is available at http://bioserv.rpbs.univ-paris-diderot.fr/PEP-SiteFinder. © 2014 The Author(s).",
            "authors": [
                "Saladin A.",
                "Rey J.",
                "Thevenet P.",
                "Zacharias M.",
                "Moroy G.",
                "Tuffery P."
            ],
            "cit_count": 44,
            "journal": "Nucleic Acids Research",
            "pmid": "24803671",
            "title": "PEP-SiteFinder: A tool for the blind identification of peptide binding sites on protein surfaces",
            "type": "Primary",
            "year": "2014-07-01"
        },
        {
            "abstract": "© Springer Science+Business Media LLC 2017.The blind identification of candidate patches of interaction on the protein surface is a difficult task that can hardly be accomplished without a heuristic or the use of simplified representations to speed up the search. The PEP-SiteFinder protocol performs a systematic blind search on the protein surface using a rigid docking procedure applied to a limited set of peptide suboptimal conformations expected to approximate satisfactorily the conformation of the peptide in interaction. All steps rely on a coarse-grained representation of the protein and the peptide. While simple, such a protocol can help to infer useful information, assuming a critical analysis of the results. Moreover, such a protocol can be extended to a semi-flexible protocol where the suboptimal conformations are directly folded in the vicinity of the receptor.",
            "authors": [
                "Lamiable A.",
                "Thevenet P.",
                "Eustache S.",
                "Saladin A.",
                "Moroy G.",
                "Tuffery P."
            ],
            "cit_count": 0,
            "journal": "Methods in Molecular Biology",
            "pmid": "28236231",
            "title": "Peptide suboptimal conformation sampling for the prediction of protein-peptide interactions",
            "type": "Usage",
            "year": "2017-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:pep-sitefinder",
        "biotoolsID": "pep-sitefinder",
        "description": "PEP-SiteFinder is a web server tool for the blind identification of peptide binding sites on protein surfaces.",
        "homepage": "https://mobyle.rpbs.univ-paris-diderot.fr/cgi-bin/portal.py#forms::PEP-SiteFinder",
        "name": "PEP-SiteFinder",
        "version": [
            "1.0"
        ]
    }
}