{
    "additionDate": "2018-06-06T19:36:42Z",
    "biotoolsCURIE": "biotools:beastling",
    "biotoolsID": "beastling",
    "credit": [
        {
            "email": "luke@maurits.id.au",
            "name": "Luke Maurits",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Open source software tool designed to simplify the preparation of Bayesian phylogenetic analyses of linguistic data using the BEAST 2 platform.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/glottobank/BEASTling_paper/blob/master/README.md"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Phylogenetic tree analysis",
                    "uri": "http://edamontology.org/operation_0324"
                }
            ]
        }
    ],
    "homepage": "https://github.com/glottobank/BEASTling_paper",
    "language": [
        "Python"
    ],
    "lastUpdate": "2018-12-10T12:58:59Z",
    "name": "BEASTling",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "migle_sur",
    "publication": [
        {
            "doi": "10.1371/journal.pone.0180908",
            "metadata": {
                "abstract": "© 2017 Maurits et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.We present a new open source software tool called BEASTling, designed to simplify the preparation of Bayesian phylogenetic analyses of linguistic data using the BEAST 2 platform. BEASTling transforms comparatively short and human-readable configuration files into the XML files used by BEAST to specify analyses. By taking advantage of Creative Commons-licensed data from the Glottolog language catalog, BEASTling allows the user to conveniently filter datasets using names for recognised language families, to impose monophyly constraints so that inferred language trees are backward compatible with Glottolog classifications, or to assign geographic location data to languages for phylogeographic analyses. Support for the emerging cross-linguistic linked data format (CLDF) permits easy incorporation of data published in cross-linguistic linked databases into analyses. BEASTling is intended to make the power of Bayesian analysis more accessible to historical linguists without strong programming backgrounds, in the hopes of encouraging communication and collaboration between those developing computational models of language evolution (who are typically not linguists) and relevant domain experts.",
                "authors": [
                    {
                        "name": "Maurits L."
                    },
                    {
                        "name": "Forkel R."
                    },
                    {
                        "name": "Kaiping G.A."
                    },
                    {
                        "name": "Atkinson Q.D."
                    }
                ],
                "citationCount": 4,
                "date": "2017-08-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "BEASTling: A software tool for linguistic phylogenetics using BEAST 2"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ],
    "validated": 1
}