{
    "name": "Tripal", 
    "description": "Tripal is a collection of open-source, freely-available Drupal modules that serves as a web interface for a GMOD Chado database. It is designed to allow anyone with genomic data to quickly create an online genomic database using community supported tools. Tripal is part of the open-source tool collection available through the Generic Model Organism Database (GMOD) project.", 
    "homepage": "http://tripal.sourceforge.net/", 
    "biotoolsID": "tripal", 
    "biotoolsCURIE": "biotools:tripal", 
    "version": [], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_0337", 
                    "term": "Visualisation"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Suite"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_0622", 
            "term": "Genomics"
        }, 
        {
            "uri": "http://edamontology.org/topic_3053", 
            "term": "Genetics"
        }
    ], 
    "operatingSystem": [
        "Linux"
    ], 
    "language": [
        "PHP"
    ], 
    "license": null, 
    "collectionID": [], 
    "maturity": "Mature", 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [], 
    "download": [], 
    "documentation": [
        {
            "url": "http://tripal.info/tutorials/v2.x", 
            "type": "General", 
            "note": null
        }, 
        {
            "url": "http://tripal.info/tutorials/v3.x", 
            "type": "General", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": "10.1093/DATABASE/BAT075", 
            "pmid": "24163125", 
            "pmcid": "PMC3808541", 
            "type": "Primary", 
            "version": null, 
            "metadata": null
        }, 
        {
            "doi": null, 
            "pmid": "21959868", 
            "pmcid": null, 
            "type": "Other", 
            "version": null, 
            "metadata": {
                "title": "Tripal: A construction toolkit for online genome databases", 
                "abstract": "As the availability, affordability and magnitude of genomics and genetics research increases so does the need to provide online access to resulting data and analyses. Availability of a tailored online database is the desire for many investigators or research communities; however, managing the Information Technology infrastructure needed to create such a database can be an undesired distraction from primary research or potentially cost prohibitive. Tripal provides simplified site development by merging the power of Drupal, a popular web Content Management System with that of Chado, a communityderived database schema for storage of genomic, genetic and other related biological data. Tripal provides an interface that extends the content management features of Drupal to the data housed in Chado. Furthermore, Tripal provides a web-based Chado installer, genomic data loaders, web-based editing of data for organisms, genomic features, biological libraries, controlled vocabularies and stock collections. Also available are Tripal extensions that support loading and visualizations of NCBI BLAST, InterPro, Kyoto Encyclopedia of Genes and Genomes and Gene Ontology analyses, as well as an extension that provides integration of Tripal with GBrowse, a popular GMOD tool. An Application Programming Interface is available to allow creation of custom extensions by site developers, and the look-and-feel of the site is completely customizable through Drupal-based PHP template files. Addition of non-biological content and user-management is afforded through Drupal. Tripal is an open source and freely available software package found at http://tripal.sourceforge. © The Author(s) 2011.", 
                "date": "2011-12-01T00:00:00Z", 
                "citationCount": 25, 
                "authors": [
                    {
                        "name": "Ficklin S.P."
                    }, 
                    {
                        "name": "Sanderson L.-A."
                    }, 
                    {
                        "name": "Cheng C.-H."
                    }, 
                    {
                        "name": "Staton M.E."
                    }, 
                    {
                        "name": "Lee T."
                    }, 
                    {
                        "name": "Cho I.-H."
                    }, 
                    {
                        "name": "Jung S."
                    }, 
                    {
                        "name": "Bett K.E."
                    }, 
                    {
                        "name": "Main D."
                    }
                ], 
                "journal": "Database"
            }
        }
    ], 
    "credit": [
        {
            "name": "Support Forum", 
            "email": null, 
            "url": "https://github.com/tripal/tripal/issues", 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "seqwiki_import", 
    "additionDate": "2017-01-13T13:16:54Z", 
    "lastUpdate": "2019-01-15T02:41:27Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 1, 
    "homepage_status": 0, 
    "elixir_badge": 0
}