{
    "additionDate": "2017-01-13T13:16:54Z",
    "biotoolsCURIE": "biotools:tripal",
    "biotoolsID": "tripal",
    "credit": [
        {
            "name": "Support Forum",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://github.com/tripal/tripal/issues"
        }
    ],
    "description": "Tripal is a collection of open-source, freely-available Drupal modules that serves as a web interface for a GMOD Chado database. It is designed to allow anyone with genomic data to quickly create an online genomic database using community supported tools. Tripal is part of the open-source tool collection available through the Generic Model Organism Database (GMOD) project.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://tripal.info/tutorials/v2.x"
        },
        {
            "type": [
                "General"
            ],
            "url": "http://tripal.info/tutorials/v3.x"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "http://tripal.sourceforge.net/",
    "language": [
        "PHP"
    ],
    "lastUpdate": "2024-11-25T14:23:32.607899Z",
    "maturity": "Mature",
    "name": "Tripal",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "seqwiki_import",
    "publication": [
        {
            "doi": "10.1093/database/bar044",
            "metadata": {
                "abstract": "As the availability, affordability and magnitude of genomics and genetics research increases so does the need to provide online access to resulting data and analyses. Availability of a tailored online database is the desire for many investigators or research communities; however, managing the Information Technology infrastructure needed to create such a database can be an undesired distraction from primary research or potentially cost prohibitive. Tripal provides simplified site development by merging the power of Drupal, a popular web Content Management System with that of Chado, a communityderived database schema for storage of genomic, genetic and other related biological data. Tripal provides an interface that extends the content management features of Drupal to the data housed in Chado. Furthermore, Tripal provides a web-based Chado installer, genomic data loaders, web-based editing of data for organisms, genomic features, biological libraries, controlled vocabularies and stock collections. Also available are Tripal extensions that support loading and visualizations of NCBI BLAST, InterPro, Kyoto Encyclopedia of Genes and Genomes and Gene Ontology analyses, as well as an extension that provides integration of Tripal with GBrowse, a popular GMOD tool. An Application Programming Interface is available to allow creation of custom extensions by site developers, and the look-and-feel of the site is completely customizable through Drupal-based PHP template files. Addition of non-biological content and user-management is afforded through Drupal. Tripal is an open source and freely available software package found at http://tripal.sourceforge. © The Author(s) 2011.",
                "authors": [
                    {
                        "name": "Bett K.E."
                    },
                    {
                        "name": "Cheng C.-H."
                    },
                    {
                        "name": "Cho I.-H."
                    },
                    {
                        "name": "Ficklin S.P."
                    },
                    {
                        "name": "Jung S."
                    },
                    {
                        "name": "Lee T."
                    },
                    {
                        "name": "Main D."
                    },
                    {
                        "name": "Sanderson L.-A."
                    },
                    {
                        "name": "Staton M.E."
                    }
                ],
                "citationCount": 59,
                "date": "2011-12-01T00:00:00Z",
                "journal": "Database",
                "title": "Tripal: A construction toolkit for online genome databases"
            },
            "pmcid": "PMC3263599",
            "pmid": "21959868",
            "type": [
                "Other"
            ]
        },
        {
            "doi": "10.1093/database/bat075",
            "metadata": {
                "abstract": "Tripal is an open-source freely available toolkit for construction of online genomic and genetic databases. It aims to facilitate development of community-driven biological websites by integrating the GMOD Chado database schema with Drupal, a popular website creation and content management software. Tripal provides a suite of tools for interaction with a Chado database and display of content therein. The tools are designed to be generic to support the various ways in which data may be stored in Chado. Previous releases of Tripal have supported organisms, genomic libraries, biological stocks, stock collections and genomic features, their alignments and annotations. Also, Tripal and its extension modules provided loaders for commonly used file formats such as FASTA, GFF, OBO, GAF, BLAST XML, KEGG heir files and InterProScan XML. Default generic templates were provided for common views of biological data, which could be customized using an open Application Programming Interface to change the way data are displayed. Here, we report additional tools and functionality that are part of release v1.1 of Tripal. These include (i) a new bulk loader that allows a site curator to import data stored in a custom tab delimited format; (ii) full support of every Chado table for Drupal Views (a powerful tool allowing site developers to construct novel displays and search pages); (iii) new modules including 'Feature Map', 'Genetic', 'Publication', 'Project', 'Contact' and the 'Natural Diversity' modules. Tutorials, mailing lists, download and set-up instructions, extension modules and other documentation can be found at the Tripal website located at http://tripal.info. © The Author(s) 2013. Published by Oxford University Press.",
                "authors": [
                    {
                        "name": "Bett K.E."
                    },
                    {
                        "name": "Cheng C.-H."
                    },
                    {
                        "name": "Feltus F.A."
                    },
                    {
                        "name": "Ficklin S.P."
                    },
                    {
                        "name": "Jung S."
                    },
                    {
                        "name": "Main D."
                    },
                    {
                        "name": "Sanderson L.-A."
                    }
                ],
                "citationCount": 50,
                "date": "2013-12-01T00:00:00Z",
                "journal": "Database",
                "title": "Tripal v1.1: A standards-based toolkit for construction of online genetic and genomic databases"
            },
            "pmcid": "PMC3808541",
            "pmid": "24163125",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Suite"
    ],
    "topic": [
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        }
    ],
    "validated": 1
}
