{
    "additionDate": "2021-11-29T11:34:54.042379Z",
    "biotoolsCURIE": "biotools:rust-expression-browser",
    "biotoolsID": "rust-expression-browser",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "Diane.Saunders@jic.ac.uk",
            "name": "Diane G. O. Saunders",
            "orcidid": "https://orcid.org/0000-0003-2847-5721",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Rust Expression Browser is an open source database for simultaneous analysis of host and pathogen gene expression profiles with expVIP.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Expression profile comparison",
                    "uri": "http://edamontology.org/operation_0315"
                },
                {
                    "term": "Gene expression profiling",
                    "uri": "http://edamontology.org/operation_0314"
                },
                {
                    "term": "RNA-Seq quantification",
                    "uri": "http://edamontology.org/operation_3800"
                }
            ]
        }
    ],
    "homepage": "http://www.rust-expression.com",
    "lastUpdate": "2021-11-29T11:34:54.044864Z",
    "name": "Rust Expression Browser",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1186/S12864-021-07488-3",
            "metadata": {
                "abstract": "© 2021, The Author(s).Background: Transcriptomics is being increasingly applied to generate new insight into the interactions between plants and their pathogens. For the wheat yellow (stripe) rust pathogen (Puccinia striiformis f. sp. tritici, Pst) RNA-based sequencing (RNA-Seq) has proved particularly valuable, overcoming the barriers associated with its obligate biotrophic nature. This includes the application of RNA-Seq approaches to study Pst and wheat gene expression dynamics over time and the Pst population composition through the use of a novel RNA-Seq based surveillance approach called “field pathogenomics”. As a dual RNA-Seq approach, the field pathogenomics technique also provides gene expression data from the host, giving new insight into host responses. However, this has created a wealth of data for interrogation. Results: Here, we used the field pathogenomics approach to generate 538 new RNA-Seq datasets from Pst-infected field wheat samples, doubling the amount of transcriptomics data available for this important pathosystem. We then analysed these datasets alongside 66 RNA-Seq datasets from four Pst infection time-courses and 420 Pst-infected plant field and laboratory samples that were publicly available. A database of gene expression values for Pst and wheat was generated for each of these 1024 RNA-Seq datasets and incorporated into the development of the rust expression browser (http://www.rust-expression.com). This enables for the first time simultaneous ‘point-and-click’ access to gene expression profiles for Pst and its wheat host and represents the largest database of processed RNA-Seq datasets available for any of the three Puccinia wheat rust pathogens. We also demonstrated the utility of the browser through investigation of expression of putative Pst virulence genes over time and examined the host plants response to Pst infection. Conclusions: The rust expression browser offers immense value to the wider community, facilitating data sharing and transparency and the underlying database can be continually expanded as more datasets become publicly available.",
                "authors": [
                    {
                        "name": "Adams T.M."
                    },
                    {
                        "name": "Bryant R."
                    },
                    {
                        "name": "Bryson R."
                    },
                    {
                        "name": "Campos P.E."
                    },
                    {
                        "name": "Fenwick P."
                    },
                    {
                        "name": "Feuerhelm D."
                    },
                    {
                        "name": "Hayes C."
                    },
                    {
                        "name": "Henriksson T."
                    },
                    {
                        "name": "Hubbard A."
                    },
                    {
                        "name": "Jevtic R."
                    },
                    {
                        "name": "Judge C."
                    },
                    {
                        "name": "Kerton M."
                    },
                    {
                        "name": "Lage J."
                    },
                    {
                        "name": "Lewis C.M."
                    },
                    {
                        "name": "Lilly C."
                    },
                    {
                        "name": "Meidan U."
                    },
                    {
                        "name": "Novoselovic D."
                    },
                    {
                        "name": "Olsson T.S.G."
                    },
                    {
                        "name": "Patrick C."
                    },
                    {
                        "name": "Ramirez-Gonzalez R.H."
                    },
                    {
                        "name": "Saunders D.G.O."
                    },
                    {
                        "name": "Wanyera R."
                    }
                ],
                "date": "2021-12-01T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "Rust expression browser: an open source database for simultaneous analysis of host and pathogen gene expression profiles with expVIP"
            },
            "pmcid": "PMC7941908",
            "pmid": "33750297",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Agricultural science",
            "uri": "http://edamontology.org/topic_3810"
        },
        {
            "term": "Gene regulation",
            "uri": "http://edamontology.org/topic_0204"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ]
}
