{
    "additionDate": "2017-08-03T18:58:37Z",
    "biotoolsCURIE": "biotools:resprox",
    "biotoolsID": "resprox",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.resprox.ca/contact.html"
        }
    ],
    "description": "ResProx (Resolution-by-proxy or Res(p)) is a web server that predicts the atomic resolution of NMR protein structures using only PDB coordinate data as input. More specfically, ResProx uses machine learning techniques to accurately estimate (with a correlation coefficient of 0.92 between observed and calculated) the atomic resolution of a protein structure from 25 measurable features that can be derived from its atomic coordinates.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://www.resprox.ca/documentation.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein structure prediction",
                    "uri": "http://edamontology.org/operation_0474"
                }
            ]
        }
    ],
    "homepage": "http://www.resprox.ca/",
    "lastUpdate": "2018-12-10T12:58:45Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/resprox-comparing-quality-nmr-protein-structures.html"
        }
    ],
    "name": "ResProx",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "In protein X-ray crystallography, resolution is often used as a good indicator of structural quality. Diffraction resolution of protein crystals correlates well with the number of X-ray observables that are used in structure generation and, therefore, with protein coordinate errors. In protein NMR, there is no parameter identical to X-ray resolution. Instead, resolution is often used as a synonym of NMR model quality. Resolution of NMR structures is often deduced from ensemble precision, torsion angle normality and number of distance restraints per residue. The lack of common techniques to assess the resolution of X-ray and NMR structures complicates the comparison of structures solved by these two methods. This problem is sometimes approached by calculating ''equivalent resolution'' from structure quality metrics. However, existing protocols do not offer a comprehensive assessment of protein structure as they calculate equivalent resolution from a relatively small number (<5) of protein parameters. Here, we report a development of a protocol that calculates equivalent resolution from 25 measurable protein features. This new method offers better performance (correlation coefficient of 0.92, mean absolute error of 0.28 A) than existing predictors of equivalent resolution. Because the method uses coordinate data as a proxy for X-ray diffraction data, we call this measure ''Resolution-by-Proxy'' or ResProx. We demonstrate that ResProx can be used to identify under-restrained, poorly refined or inaccurate NMR structures, and can discover structural defects that the other equivalent resolution methods cannot detect. The ResProx web server is available at http://www.resprox.ca. © 2012 Springer Science+Business Media B.V.",
                "authors": [
                    {
                        "name": "Berjanskii M."
                    },
                    {
                        "name": "Liang Y."
                    },
                    {
                        "name": "Lin G."
                    },
                    {
                        "name": "Wishart D.S."
                    },
                    {
                        "name": "Zhou J."
                    }
                ],
                "citationCount": 44,
                "date": "2012-07-01T00:00:00Z",
                "journal": "Journal of Biomolecular NMR",
                "title": "Resolution-by-proxy: A simple measure for assessing and comparing the overall quality of NMR protein structures"
            },
            "pmid": "22678091"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "NMR",
            "uri": "http://edamontology.org/topic_0593"
        },
        {
            "term": "Structure prediction",
            "uri": "http://edamontology.org/topic_0082"
        }
    ],
    "validated": 1
}
