{
    "additionDate": "2017-12-18T00:13:10Z",
    "biotoolsCURIE": "biotools:simwalk",
    "biotoolsID": "simwalk",
    "credit": [
        {
            "email": "esobel@ucla.edu",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Statistical analysis for haplotype, parametric linkage, non-parametric linkage (NPL), identity by descent (IBD) and mistyping analyses on any size of pedigree. Uses Markov chain Monte Carlo (MCMC) and simulated annealing algorithms.",
    "documentation": [
        {
            "type": "General",
            "url": "https://watson.hgen.pitt.edu/docs/SW2_News.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Statistical analysis",
                    "uri": "http://edamontology.org/operation_2238"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Analysis",
                    "uri": "http://edamontology.org/operation_2945"
                }
            ]
        }
    ],
    "homepage": "http://watson.hgen.pitt.edu/docs/simwalk2.html",
    "language": [
        "Fortran"
    ],
    "lastUpdate": "2018-12-10T12:58:58Z",
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/simwalk-2-91-statistical-analysis-qualitative-traits.html"
        }
    ],
    "name": "SimWalk",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1086/338920",
            "metadata": {
                "abstract": "Detection of genotyping errors and integration of such errors in statistical analysis are relatively neglected topics, given their importance in gene mapping. A few inopportunely placed errors, if ignored, can tremendously affect evidence for linkage. The present study takes a fresh look at the calculation of pedigree likelihoods in the presence of genotyping error. To accommodate genotyping error, we present extensions to the Lander-Green-Kruglyak deterministic algorithm for small pedigrees and to the Markov-chain Monte Carlo stochastic algorithm for large pedigrees. These extensions can accommodate a variety of error models and refrain from simplifying assumptions, such as allowing, at most, one error per pedigree. In principle, almost any statistical genetic analysis can be performed taking errors into account, without actually correcting or deleting suspect genotypes. Three examples illustrate the possibilities. These examples make use of the full pedigree data, multiple linked markers, and a prior error model. The first example is the estimation of genotyping error rates from pedigree data. The second - and currently most useful - example is the computation of posterior mistyping probabilities. These probabilities cover both Mendelian-consistent and Mendeliani-inconsistent errors. The third example is the selection of the true pedigree structure connecting a group of people from among several competing pedigree structures. Paternity testing and twin zygosity testing are typical applications.",
                "authors": [
                    {
                        "name": "Sobel E."
                    },
                    {
                        "name": "Papp J.C."
                    },
                    {
                        "name": "Lange K."
                    }
                ],
                "citationCount": 269,
                "date": "2002-01-01T00:00:00Z",
                "journal": "American Journal of Human Genetics",
                "title": "Detection and integration of genotyping errors in statistical genetics"
            },
            "type": "Primary"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Linkage",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        }
    ],
    "validated": 1,
    "version": [
        "2.91"
    ]
}