{"collectionID": ["BIG N2N", "UGent"], "accessibility": [], "topic": [{"term": "Genetic variation", "uri": "http://edamontology.org/topic_0199"}], "owner": "Katrijn.Vannerum@ugent.be", "cost": null, "relation": [], "download": [], "validated": 1, "publication": [{"doi": "10.1016/S0378-1119(02)00689-3", "note": null, "version": null, "pmid": "12354655", "type": "Primary", "pmcid": null, "metadata": {"title": "Dealing with saturation at the amino acid level: A case study based on anciently duplicated zebrafish genes", "abstract": "The ray-finned fishes (Actinopterygii) seem to have two copies of many tetrapod (Sarcopterygii) genes. The origin of these duplicate fish genes is the subject of some controversy. One explanation for the existence of these extra fish genes could be an increase in the rate of independent gene duplications in fishes. Alternatively, gene duplicates in fish may have been formed in the ancestor of all or most Actinopterygii during a complete genome duplication event. A third possibility is that tetrapods have lost more genes than fish after gene or genome duplication events in the common ancestor of both lineages. These three hypotheses can be tested by phylogenetic reconstruction. Previously, we found that a large number of anciently duplicated genes of zebrafish are sister sequences in evolutionary trees suggesting that they were produced in Actinopterygii after the divergence of Sarcopterygii [Phil. Trans. R. Soc. Lond. B 356 (2001) 119]. On the other hand, several well-supported trees showed one of the two fish genes as the sister sequence to a monophyletic clade that included the second fish gene and genes from frog, chicken, mouse and human. These so-called outgroup topologies suggest that the origin of many fish duplicates predates the divergence of the Sarcopterygii and Actinopterygii and support the hypothesis that tetrapods have lost duplicates that have been retained in fish. Here we show that many of these 'outgroup' tree topologies are erroneous and can be corrected when mutational saturation is taken into account. To this end, a Java-based application has been developed to visualize the amount of saturation in amino acid sequences. The program graphically displays the number of observed frequent and rare amino acid replacements between pairs of sequences against their overall evolutionary distance. Discrimination between frequent and rare amino acid replacements is based on substitution probability matrices (e.g. PAM and BLOSUM). Evolutionary distances between sequences can be computed from the fraction of unsaturated sites only and evolutionary trees inferred by pairwise distance methods. When trees are computed by omitting the saturated fraction of sites, most fish duplicates are sister sequences. © 2002 Elsevier Science B.V. All rights reserved.", "citationCount": 58, "authors": [{"name": "Van De Peer Y."}, {"name": "Frickey T."}, {"name": "Taylor J.S."}, {"name": "Meyer A."}], "date": "2002-08-07T00:00:00Z", "journal": "Gene"}}], "homepage_status": 0, "credit": [{"typeRole": ["Provider"], "name": "ugent.be", "url": null, "gridid": null, "note": null, "orcidid": null, "typeEntity": "Institute", "email": null}, {"typeRole": ["Primary contact"], "name": null, "url": null, "gridid": null, "note": null, "orcidid": null, "typeEntity": "Person", "email": "yves.vandepeer@psb.vib-ugent.be"}, {"typeRole": [], "name": "Axel Meyer", "url": null, "gridid": null, "note": null, "orcidid": "http://orcid.org/0000-0002-0888-8193", "typeEntity": null, "email": "axel.meyer@uni-konstanz.de"}], "biotoolsCURIE": "biotools:asatura", "elixirPlatform": [], "elixirNode": [], "version": ["1"], "elixir_badge": 0, "homepage": "http://bioinformatics.psb.ugent.be/software/details/ASaturA", "function": [{"note": null, "input": [{"data": {"term": "Sequence set", "uri": "http://edamontology.org/data_0850"}, "format": []}], "operation": [{"term": "Sequence comparison", "uri": "http://edamontology.org/operation_2451"}], "cmd": null, "output": [{"data": {"term": "Phylogenetic data", "uri": "http://edamontology.org/data_2523"}, "format": []}]}], "lastUpdate": "2018-12-16T12:41:41Z", "otherID": [], "description": "Discriminates aa substitutions with high and low probabilities of occurrence.", "toolType": ["Desktop application"], "editPermission": {"type": "private", "authors": []}, "language": ["Java"], "link": [], "biotoolsID": "asatura", "additionDate": "2016-05-17T10:18:47Z", "name": "ASaturA", "license": null, "documentation": [{"url": "http://bioinformatics.psb.ugent.be/downloads/psb/asatura/README.txt", "note": null, "type": "General"}], "maturity": null, "confidence_flag": null, "operatingSystem": ["Linux", "Windows", "Mac"]}