{
    "additionDate": "2021-01-18T11:15:04Z",
    "biotoolsCURIE": "biotools:two-sigma",
    "biotoolsID": "two-sigma",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "did@email.unc.edu",
            "name": "Yun Li",
            "typeEntity": "Person"
        },
        {
            "email": "yun_li@med.unc.edu",
            "name": "Di Wu",
            "typeEntity": "Person"
        }
    ],
    "description": "TWO-SIGMA (TWO-component SInGle cell Model-based Association method) and TWO-SIGMA-G (TWO-SIGMA based Geneset Testing) is a novel two-component single cell model-based association method for single-cell RNA-seq data.\n\ntwosigma is an R package for differential expression (DE) analysis and gene set testing (GST) in single-cell RNA-seq (scRNA-seq) data.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Differential gene expression analysis",
                    "uri": "http://edamontology.org/operation_3223"
                },
                {
                    "term": "Gene-set enrichment analysis",
                    "uri": "http://edamontology.org/operation_2436"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "https://github.com/edvanburen/twosigma",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-03-06T14:17:44Z",
    "name": "TWO-SIGMA",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1002/GEPI.22361",
            "metadata": {
                "abstract": "© 2020 Wiley Periodicals LLCIn this paper, we develop TWO-SIGMA, a TWO-component SInGle cell Model-based Association method for differential expression (DE) analyses in single-cell RNA-seq (scRNA-seq) data. The first component models the probability of “drop-out” with a mixed-effects logistic regression model and the second component models the (conditional) mean expression with a mixed-effects negative binomial regression model. TWO-SIGMA is extremely flexible in that it: (i) does not require a log-transformation of the outcome, (ii) allows for overdispersed and zero-inflated counts, (iii) accommodates a correlation structure between cells from the same individual via random effect terms, (iv) can analyze unbalanced designs (in which the number of cells does not need to be identical for all samples), (v) can control for additional sample-level and cell-level covariates including batch effects, (vi) provides interpretable effect size estimates, and (vii) enables general tests of DE beyond two-group comparisons. To our knowledge, TWO-SIGMA is the only method for analyzing scRNA-seq data that can simultaneously accomplish each of these features. Simulations studies show that TWO-SIGMA outperforms alternative regression-based approaches in both type-I error control and power enhancement when the data contains even moderate within-sample correlation. A real data analysis using pancreas islet single-cells exhibits the flexibility of TWO-SIGMA and demonstrates that incorrectly failing to include random effect terms can have dramatic impacts on scientific conclusions. TWO-SIGMA is implemented in the R package twosigma available at https://github.com/edvanburen/twosigma.",
                "authors": [
                    {
                        "name": "Hu M."
                    },
                    {
                        "name": "Jin F."
                    },
                    {
                        "name": "Li Y."
                    },
                    {
                        "name": "Li Y."
                    },
                    {
                        "name": "Van Buren E."
                    },
                    {
                        "name": "Weng C."
                    },
                    {
                        "name": "Wu D."
                    }
                ],
                "citationCount": 1,
                "date": "2021-03-01T00:00:00Z",
                "journal": "Genetic Epidemiology",
                "title": "TWO-SIGMA: A novel two-component single cell model-based association method for single-cell RNA-seq data"
            },
            "pmid": "32989764"
        }
    ],
    "topic": [
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ]
}
