{
    "additionDate": "2024-03-18T15:15:44.560903Z",
    "biotoolsCURIE": "biotools:tipred",
    "biotoolsID": "tipred",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "pramote.c@ku.th",
            "name": "Pramote Chumnanpuen",
            "typeEntity": "Person"
        },
        {
            "email": "watshara.sho@mahidol.ac.th",
            "name": "Watshara Shoombuatong",
            "typeEntity": "Person"
        }
    ],
    "description": "A novel stacked ensemble approach for the accelerated discovery of tyrosinase inhibitory peptides.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Feature selection",
                    "uri": "http://edamontology.org/operation_3936"
                },
                {
                    "term": "Protein secondary structure prediction",
                    "uri": "http://edamontology.org/operation_0267"
                },
                {
                    "term": "Virtual screening",
                    "uri": "http://edamontology.org/operation_3938"
                }
            ]
        }
    ],
    "homepage": "http://pmlabstack.pythonanywhere.com/TIPred",
    "lastUpdate": "2024-11-24T14:08:34.806709Z",
    "name": "TIPred",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/s12859-023-05463-1",
            "metadata": {
                "abstract": "Background: Tyrosinase is an enzyme involved in melanin production in the skin. Several hyperpigmentation disorders involve the overproduction of melanin and instability of tyrosinase activity resulting in darker, discolored patches on the skin. Therefore, discovering tyrosinase inhibitory peptides (TIPs) is of great significance for basic research and clinical treatments. However, the identification of TIPs using experimental methods is generally cost-ineffective and time-consuming. Results: Herein, a stacked ensemble learning approach, called TIPred, is proposed for the accurate and quick identification of TIPs by using sequence information. TIPred explored a comprehensive set of various baseline models derived from well-known machine learning (ML) algorithms and heterogeneous feature encoding schemes from multiple perspectives, such as chemical structure properties, physicochemical properties, and composition information. Subsequently, 130 baseline models were trained and optimized to create new probabilistic features. Finally, the feature selection approach was utilized to determine the optimal feature vector for developing TIPred. Both tenfold cross-validation and independent test methods were employed to assess the predictive capability of TIPred by using the stacking strategy. Experimental results showed that TIPred significantly outperformed the state-of-the-art method in terms of the independent test, with an accuracy of 0.923, MCC of 0.757 and an AUC of 0.977. Conclusions: The proposed TIPred approach could be a valuable tool for rapidly discovering novel TIPs and effectively identifying potential TIP candidates for follow-up experimental validation. Moreover, an online webserver of TIPred is publicly available at http://pmlabstack.pythonanywhere.com/TIPred .",
                "authors": [
                    {
                        "name": "Charoenkwan P."
                    },
                    {
                        "name": "Chumnanpuen P."
                    },
                    {
                        "name": "Kongsompong S."
                    },
                    {
                        "name": "Schaduangrat N."
                    },
                    {
                        "name": "Shoombuatong W."
                    }
                ],
                "citationCount": 2,
                "date": "2023-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "TIPred: a novel stacked ensemble approach for the accelerated discovery of tyrosinase inhibitory peptides"
            },
            "pmcid": "PMC10512532",
            "pmid": "37735626"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Bioinformatics",
            "uri": "http://edamontology.org/topic_0091"
        },
        {
            "term": "Chemistry",
            "uri": "http://edamontology.org/topic_3314"
        },
        {
            "term": "Enzymes",
            "uri": "http://edamontology.org/topic_0821"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
