{
    "additionDate": "2021-03-19T09:08:54Z",
    "biotoolsCURIE": "biotools:es-arcnn",
    "biotoolsID": "es-arcnn",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "yufei.huang@utsa.edu",
            "name": "Yufei Huang"
        }
    ],
    "description": "ES-ARCNN is a tool for identifying enhancers' strength by using data augmentation and residual convolutional neural network",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "DNA mapping",
                    "uri": "http://edamontology.org/operation_2520"
                },
                {
                    "term": "Exonic splicing enhancer prediction",
                    "uri": "http://edamontology.org/operation_0446"
                },
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                },
                {
                    "term": "Reverse complement",
                    "uri": "http://edamontology.org/operation_0363"
                }
            ]
        }
    ],
    "homepage": "http://compgenomics.utsa.edu/ES-ARCNN/",
    "lastUpdate": "2021-05-05T13:00:23Z",
    "name": "ES-ARCNN",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1016/J.AB.2021.114120",
            "metadata": {
                "abstract": "© 2021 Elsevier Inc.Enhancers are non-coding DNA sequences bound by proteins called transcription factors. They function as distant regulators of gene transcription and participate in the development and maintenance of cell types and tissues. Since experimental validation of enhancers is expensive and time-consuming, many computational methods have been developed to predict enhancers and their strength. However, most of these methods still lack good performance in the prediction of enhancer strength. Here, we present a method to predict Enhancers Strength (i.e., strong and weak) by using Augmented data and Residual Convolutional Neural Network (ES-ARCNN). To train ES-ARCNN, we used two data augmentation tricks (i.e., reverse complement and shift) to previously identified enhancers for enlarging a previously identified dataset of enhancers. We further employed a residual convolutional neural network and trained it using the augmented dataset. Compared with other state-of-the-art methods in the 10-fold cross-validation (CV) test, ES-ARCNN has the best performance with the accuracy of 66.17%, and the tricks of data augmentation can effectively improve the prediction performance. We further tested ES-ARCNN on an independent dataset and obtained 65.5% accuracy, which has more than 4% improvement over the other three existing methods. The results in 10CV and independent tests show that ES-ARCNN can effectively predict the enhancer strength. The transcription factor binding sites (TFBSs) enrichment analysis shows that from the mechanistic perspective, enhancer strength is associated with a higher density of important TFBSs in a tissue. A user-friendly web-application is also provided at http://compgenomics.utsa.edu/ES-ARCNN/.",
                "authors": [
                    {
                        "name": "Flores M."
                    },
                    {
                        "name": "Huang Y."
                    },
                    {
                        "name": "Zhang T.-H."
                    }
                ],
                "citationCount": 2,
                "date": "2021-04-01T00:00:00Z",
                "journal": "Analytical Biochemistry",
                "title": "ES-ARCNN: Predicting enhancer strength by using data augmentation and residual convolutional neural network"
            },
            "pmid": "33535061"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ]
}
