{
    "accessibility": "Open access",
    "additionDate": "2021-12-05T16:38:28.395123Z",
    "biotoolsCURIE": "biotools:endorex",
    "biotoolsID": "endorex",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "mabrouk@iro.umontreal.ca",
            "name": "Nadia El-Mabrouk",
            "typeEntity": "Person"
        }
    ],
    "description": "Gene tree and species tree reconciliation with endosymbiotic gene transfer.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene tree construction",
                    "uri": "http://edamontology.org/operation_0553"
                },
                {
                    "term": "Phylogenetic reconstruction",
                    "uri": "http://edamontology.org/operation_3478"
                },
                {
                    "term": "Phylogenetic tree reconciliation",
                    "uri": "http://edamontology.org/operation_3947"
                },
                {
                    "term": "Tree dating",
                    "uri": "http://edamontology.org/operation_3942"
                }
            ]
        }
    ],
    "homepage": "https://github.com/AEVO-lab/EndoRex",
    "language": [
        "Python",
        "Shell"
    ],
    "lastUpdate": "2021-12-05T16:38:28.397642Z",
    "name": "EndoRex",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAB328",
            "metadata": {
                "abstract": "© 2021 The Author(s) 2021. Published by Oxford University Press.Motivation: It is largely established that all extant mitochondria originated from a unique endosymbiotic event integrating an α-proteobacterial genome into an eukaryotic cell. Subsequently, eukaryote evolution has been marked by episodes of gene transfer, mainly from the mitochondria to the nucleus, resulting in a significant reduction of the mitochondrial genome, eventually completely disappearing in some lineages. However, in other lineages such as in land plants, a high variability in gene repertoire distribution, including genes encoded in both the nuclear and mitochondrial genome, is an indication of an ongoing process of Endosymbiotic Gene Transfer (EGT). Understanding how both nuclear and mitochondrial genomes have been shaped by gene loss, duplication and transfer is expected to shed light on a number of open questions regarding the evolution of eukaryotes, including rooting of the eukaryotic tree. Results: We address the problem of inferring the evolution of a gene family through duplication, loss and EGT events, the latter considered as a special case of horizontal gene transfer occurring between the mitochondrial and nuclear genomes of the same species (in one direction or the other). We consider both EGT events resulting in maintaining (EGTcopy) or removing (EGTcut) the gene copy in the source genome. We present a linear-time algorithm for computing the DLE (Duplication, Loss and EGT) distance, as well as an optimal reconciled tree, for the unitary cost, and a dynamic programming algorithm allowing to output all optimal reconciliations for an arbitrary cost of operations. We illustrate the application of our EndoRex software and analyze different costs settings parameters on a plant dataset and discuss the resulting reconciled trees.",
                "authors": [
                    {
                        "name": "Anselmetti Y."
                    },
                    {
                        "name": "El-Mabrouk N."
                    },
                    {
                        "name": "Lafond M."
                    },
                    {
                        "name": "Ouangraoua A."
                    }
                ],
                "date": "2021-07-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Gene tree and species tree reconciliation with endosymbiotic gene transfer"
            },
            "pmcid": "PMC8312264",
            "pmid": "34252921"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Phylogeny",
            "uri": "http://edamontology.org/topic_0084"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        }
    ],
    "validated": 1
}
