{
    "accessibility": "Open access",
    "additionDate": "2022-10-03T23:18:56.861801Z",
    "biotoolsCURIE": "biotools:epivisr",
    "biotoolsID": "epivisr",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "stefan.roeder@ufz.de",
            "name": "Stefan Röder",
            "orcidid": "https://orcid.org/0000-0001-9367-663X",
            "typeEntity": "Person"
        },
        {
            "name": "Ana C. Zenclussen"
        },
        {
            "name": "Gunda Herberth"
        },
        {
            "name": "Mario Bauer"
        }
    ],
    "description": "A Tool for Exploratory Data Analysis and Visualisation within Epigenome Wide Methylation Analyses (EWAS).",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Methylation analysis",
                    "uri": "http://edamontology.org/operation_3204"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://github.com/SteRoe/EpiVisR",
    "language": [
        "R"
    ],
    "lastUpdate": "2022-10-03T23:18:56.865443Z",
    "license": "Other",
    "name": "EpiVisR",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1186/S12859-022-04836-2",
            "metadata": {
                "abstract": "© 2022, The Author(s).Background: With the widespread availability of microarray technology for epigenetic research, methods for calling differentially methylated probes or differentially methylated regions have become effective tools to analyze this type of data. Furthermore, visualization is usually employed for quality check of results and for further insights. Expert knowledge is required to leverage capabilities of these methods. To overcome this limitation and make visualization in epigenetic research available to the public, we designed EpiVisR. Results: The EpiVisR tool allows to select and visualize combinations of traits (i.e., concentrations of chemical compounds) and differentially methylated probes/regions. It supports various modes of enriched presentation to get the most knowledge out of existing data: (1) enriched Manhattan plot and enriched volcano plot for selection of probes, (2) trait-methylation plot for visualization of selected trait values against methylation values, (3) methylation profile plot for visualization of a selected range of probes against selected trait values as well as, (4) correlation profile plot for selection and visualization of further probes that are correlated to the selected probe. EpiVisR additionally allows exporting selected data to external tools for tasks such as network analysis. Conclusion: The key advantage of EpiVisR is the annotation of data in the enriched plots (and tied tables) as well as linking to external data sources for further integrated data analysis. Using the EpiVisR approach will allow users to integrate data from traits with epigenetic analyses that are connected by belonging to the same individuals. Merging data from various data sources among the same cohort and visualizing them will enable users to gain more insights from existing data.",
                "authors": [
                    {
                        "name": "Bauer M."
                    },
                    {
                        "name": "Herberth G."
                    },
                    {
                        "name": "Roder S."
                    },
                    {
                        "name": "Zenclussen A.C."
                    }
                ],
                "date": "2022-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "EpiVisR: exploratory data analysis and visualization in epigenome-wide association analyses"
            },
            "pmcid": "PMC9308245",
            "pmid": "35870905"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Epigenomics",
            "uri": "http://edamontology.org/topic_3173"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        },
        {
            "term": "Probes and primers",
            "uri": "http://edamontology.org/topic_0632"
        }
    ]
}
