
{
    "credit": [
        {
            "email": "rainer.breitling@glasgow.ac.uk",
            "name": "Rainer Breitling",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://mzmatch.sourceforge.net/"
        },
        {
            "email": "m.a.swertz@rug.nl",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "url": "http://mzmatch.sourceforge.net/mzmatch.R/00Index.html"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Spectral analysis",
                    "uri": "http://edamontology.org/operation_3214"
                }
            ]
        }
    ],
    "labels": {
        "collectionID": [
            "Proteomics"
        ],
        "language": [
            "Java"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Desktop application"
        ],
        "topic": [
            {
                "term": "Data architecture, analysis and design",
                "uri": "http://edamontology.org/topic_3365"
            },
            {
                "term": "Metabolomics",
                "uri": "http://edamontology.org/topic_3172"
            },
            {
                "term": "Proteomics experiment",
                "uri": "http://edamontology.org/topic_3520"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://www.mybiosoftware.com/mzmatchpeakml-2-0-metabolomics-data-analysis.html"
        }
    ],
    "publication": [
        {
            "abstract": "The recent proliferation of high-resolution mass spectrometers has generated a wealth of new data analysis methods. However, flexible integration of these methods into configurations best suited to the research question is hampered by heterogeneous file formats and monolithic software development. The mzXML, mzData, and mzML file formats have enabled uniform access to unprocessed raw data. In this paper we present our efforts to produce an equally simple and powerful format, PeakML, to uniformly exchange processed intermediary and result data. To demonstrate the versatility of PeakML, we have developed an open source Java toolkit for processing, filtering, and annotating mass spectra in a customizable pipeline (mzMatch), as well as a user-friendly data visualization environment (PeakML Viewer). The PeakML format in particular enables the flexible exchange of processed data between software created by different groups or companies, as we illustrate by providing a PeakML-based integration of the widely used XCMS package with mzMatch data processing tools. As an added advantage, downstream analysis can benefit from direct access to the full mass trace information underlying summarized mass spectrometry results, providing the user with the means to rapidly verify results. The PeakML/mzMatch software is freely available at http://mzmatch.sourceforge.net, with documentation, tutorials, and a community forum. © 2011 American Chemical Society.",
            "authors": [
                "Scheltema R.A.",
                "Jankevics A.",
                "Jansen R.C.",
                "Swertz M.A.",
                "Breitling R."
            ],
            "cit_count": 137,
            "journal": "Analytical Chemistry",
            "pmid": "21401061",
            "title": "PeakML/mzMatch: A file format, Java library, R library, and tool-chain for mass spectrometry data analysis",
            "year": "2011-04-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:mzmatch",
        "biotoolsID": "mzmatch",
        "description": "Modular, open source and platform independent data processing pipeline for metabolomics LC/MS data written in the Java language. It was designed to provide small tools for the common processing tasks for LC/MS data.",
        "homepage": "http://mzmatch.sourceforge.net/",
        "name": "mzMatch"
    }
}