
{
    "credit": [
        {
            "email": "lee_dong_yup@bti.a-star.edu.sg",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://synlinker.syncti.org/contact.php"
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://synlinker.syncti.org/help.php"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Protein sequence analysis",
                    "uri": "http://edamontology.org/operation_2479"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Proteins",
                "uri": "http://edamontology.org/topic_0078"
            },
            {
                "term": "Protein expression",
                "uri": "http://edamontology.org/topic_0108"
            },
            {
                "term": "Protein properties",
                "uri": "http://edamontology.org/topic_0123"
            },
            {
                "term": "Genetics",
                "uri": "http://edamontology.org/topic_3053"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://www.mybiosoftware.com/synlinker-designing-linkers-and-synthetic-fusion-proteins.html"
        }
    ],
    "publication": [
        {
            "abstract": "© The Author 2015. Published by Oxford University Press. All rights reserved. Summary: Synthetic fusion proteins have shown great potential in various biotechnological and (bio)pharmaceutical applications. They usually contain more than two protein domains joined by a linker peptide sequence which is often selected intuitively or in ad hoc manner. Thus, we developed an integrated web-based system, SynLinker, to provide appropriate linker candidates for constructing fusion proteins. We compiled a total of 2260 linker sequences comprising of natural linkers extracted from a set of non-redundant multi-domain proteins in Protein Data Bank and artificial/empirical linkers collected from literature and patents. Multiple query interface allows users to search for the desired linker candidates based on selection criteria and their preferences. In addition, a selected linker can be combined with two domain structures which are uploaded and appended at its N and C terminals, thereby predicting a de novo structure of the fusion protein. Hence, SynLinker can serve as a systematic tool for researchers who are interested in designing synthetic fusion proteins. Availability and implementation: SynLinker is freely available at http://bioinfo.bti.a-star.edu.sg/synlinker.",
            "authors": [
                "Liu C.",
                "Chin J.X.",
                "Lee D.-Y."
            ],
            "cit_count": 6,
            "journal": "Bioinformatics",
            "pmid": "26227144",
            "title": "SynLinker: An integrated system for designing linkers and synthetic fusion proteins",
            "year": "2015-05-25"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:synlinker",
        "biotoolsID": "synlinker",
        "description": "An integrated system to provide suitable linker candidates for novel recombinant fusion proteins.",
        "homepage": "http://synlinker.syncti.org/",
        "name": "SynLinker"
    }
}