{
    "additionDate": "2024-02-23T09:06:24.042666Z",
    "biotoolsCURIE": "biotools:cda",
    "biotoolsID": "cda",
    "confidence_flag": "high",
    "credit": [
        {
            "email": "Konstantinos.Margetis@mountsinai.org",
            "name": "Konstantinos Margetis"
        }
    ],
    "description": "Machine learning-based prediction of short-term adverse postoperative outcomes in cervical disc arthroplasty patients.",
    "editPermission": {
        "type": "private"
    },
    "homepage": "http://huggingface.co/spaces/MSHS-Neurosurgery-Research/NSQIP-CDA",
    "lastUpdate": "2024-11-24T14:13:48.655610Z",
    "name": "CDA",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1016/j.wneu.2023.06.025",
            "metadata": {
                "abstract": "Objective: This study aimed to assess the effectiveness of machine learning (ML) algorithms in predicting short-term adverse postoperative outcomes after cervical disc arthroplasty (CDA) and to create a user-friendly and accessible tool for this purpose. Methods: The American College of Surgeons (ACS) National Surgical Quality Improvement Program (NSQIP) database was used to identify patients who underwent CDA. The outcome of interest was the combined occurrence of adverse events in the short-term postoperative period, including prolonged stay, major complications, nonhome discharges, and 30-day readmissions. To predict the combined outcome of interest, short-term adverse postoperative outcomes, 4 different ML algorithms were utilized to develop predictive models, and these models were incorporated into an open access web application. Results: A total of 6,604 patients that underwent CDA were included in the analysis. The mean area under the receiver operating characteristic curve (AUROC) and accuracy were 0.814 and 87.8% for all algorithms. SHapley Additive exPlanations (SHAP) analyses revealed that white race was the most important predictor variable for all 4 algorithms. The following URL will take users to the open access web application created to provide predictions for individual patients based on their characteristics: huggingface.co/spaces/MSHS-Neurosurgery-Research/NSQIP-CDA. Conclusions: ML approaches have the potential to predict postoperative outcomes after CDA surgery. As the amount of data in spinal surgery grows, the development of predictive models as clinically useful decision-making tools may significantly improve risk assessment and prognosis. We present and make publicly available predictive models for CDA intended to achieve the goals mentioned above.",
                "authors": [
                    {
                        "name": "Karabacak M."
                    },
                    {
                        "name": "Margetis K."
                    }
                ],
                "citationCount": 6,
                "date": "2023-09-01T00:00:00Z",
                "journal": "World Neurosurgery",
                "title": "Machine Learning-Based Prediction of Short-Term Adverse Postoperative Outcomes in Cervical Disc Arthroplasty Patients"
            },
            "pmid": "37330003"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Surgery",
            "uri": "http://edamontology.org/topic_3421"
        }
    ]
}
