{
    "additionDate": "2021-01-18T08:09:27Z",
    "biotoolsCURIE": "biotools:disofun",
    "biotoolsID": "disofun",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "xiangliang.zhang@kaust.edu.sa",
            "name": "Xiangliang Zhang",
            "typeEntity": "Person"
        },
        {
            "email": "gxyu@swu.edu.cn",
            "name": "Guoxian Yu",
            "typeEntity": "Person"
        }
    ],
    "description": "DisoFun is a tool for differentiating isoform functions with collaborative matrix factorization.\n\nDescription :This page includes the codes of DisoFun which are implemented and tested on Matlab2014a version by Mr. Wang (Keyao Wang, Email: l: keyaowang@email.swu.edu.cn) an) and free for academic usage. You can run it at your own disk. For other purposes, please contact Dr. Yu (Guoxian Yu, Email: l: gxyu@swu.edu.cn). I). If you have any problem on using these codes, just contact us via Email.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                },
                {
                    "term": "Gene functional annotation",
                    "uri": "http://edamontology.org/operation_3672"
                },
                {
                    "term": "Alternative splicing prediction",
                    "uri": "http://edamontology.org/operation_0264"
                }
            ]
        }
    ],
    "homepage": "http://mlda.swu.edu.cn/codes.php?name=DisoFun",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2021-03-01T09:37:10Z",
    "name": "DisoFun",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ847",
            "metadata": {
                "abstract": "© The Author(s) 2019. Published by Oxford University Press. All rights reserved.Motivation: Isoforms are alternatively spliced mRNAs of genes. They can be translated into different functional proteoforms, and thus greatly increase the functional diversity of protein variants (or proteoforms). Differentiating the functions of isoforms (or proteoforms) helps understanding the underlying pathology of various complex diseases at a deeper granularity. Since existing functional genomic databases uniformly record the annotations at the gene-level, and rarely record the annotations at the isoform-level, differentiating isoform functions is more challenging than the traditional gene-level function prediction. Results: Several approaches have been proposed to differentiate the functions of isoforms. They generally follow the multi-instance learning paradigm by viewing each gene as a bag and the spliced isoforms as its instances, and push functions of bags onto instances. These approaches implicitly assume the collected annotations of genes are complete and only integrate multiple RNA-seq datasets. As such, they have compromised performance. We propose a data integrative solution (called DisoFun) to Differentiate isoform Functions with collaborative matrix factorization. DisoFun assumes the functional annotations of genes are aggregated from those of key isoforms. It collaboratively factorizes the isoform data matrix and gene-term data matrix (storing Gene Ontology annotations of genes) into low-rank matrices to simultaneously explore the latent key isoforms, and achieve function prediction by aggregating predictions to their originating genes. In addition, it leverages the PPI network and Gene Ontology structure to further coordinate the matrix factorization. Extensive experimental results show that DisoFun improves the area under the receiver operating characteristic curve and area under the precision-recall curve of existing solutions by at least 7.7 and 28.9%, respectively. We further investigate DisoFun on four exemplar genes (LMNA, ADAM15, BCL2L1 and CFLAR) with known functions at the isoform-level, and observed that DisoFun can differentiate functions of their isoforms with 90.5% accuracy. Availability and implementation: The code of DisoFun is available at mlda.swu.edu.cn/codes.php?name¼DisoFun.",
                "authors": [
                    {
                        "name": "Wang K."
                    },
                    {
                        "name": "Wang J."
                    },
                    {
                        "name": "Domeniconi C."
                    },
                    {
                        "name": "Zhang X."
                    },
                    {
                        "name": "Yu G."
                    }
                ],
                "citationCount": 8,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Differentiating isoform functions with collaborative matrix factorization"
            },
            "pmid": "32176770"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "RNA splicing",
            "uri": "http://edamontology.org/topic_3320"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Ontology and terminology",
            "uri": "http://edamontology.org/topic_0089"
        }
    ]
}