{"credit":[{"email":"richa@helix.nih.gov","name":"Richa Agarwala","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"https://www.ncbi.nlm.nih.gov/CBBresearch/Schaffer/caspar.html"}],"function":[{"operation":[{"term":"Linkage analysis","uri":"http://edamontology.org/operation_0283"}]}],"labels":{"operatingSystem":["Linux"],"toolType":["Command-line tool"],"topic":[{"term":"Genetics","uri":"http://edamontology.org/topic_3053"},{"term":"Mapping","uri":"http://edamontology.org/topic_0102"},{"term":"Simulation experiment","uri":"http://edamontology.org/topic_3524"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/caspar-conditional-linkage-analyses.html"}],"publication":[{"abstract":"We have developed software and statistical tools for linkage analysis of polygenic diseases. We use type I diabetes mellitus (insulin-dependent diabetes mellitus, IDDM) as our model system. Two susceptibility loci (IDDM1 on 6p21 and IDDM2 on 11 p15) are well established, and recent genome searches suggest the existence of other susceptibility loci. We have implemented CASPAR, a software tool that makes it possible to test for linkage quickly and efficiently using multiple polymorphic DNA markers simultaneously in nuclear families consisting of two unaffected parents and a pair of affected siblings (ASP). We use a simulation-based method to determine whether lod scores from a collection of ASP tests are significant. We test our new software and statistical tools to assess linkage of IDDM5 and IDDM1 conditioned on analyses with 1 or 2 other unlinked type I diabetes susceptibility loci. The results from the CASPAR analysis suggest that conditioning of IDDM5 on IDDM1 and IDDM4, and of IDDM7 on IDDM1 and IDDM1 provides significant benefits for the genetic analysis of polygenic loci. © 1997 S. Karger AG, Basel.","authors":["Buhler J.","Owerbach D.","Schaffer A.A.","Kimmel M.","Gabbay K.H."],"cit_count":14,"journal":"Human Heredity","pmid":"9239508","title":"Linkage analyses in type I diabetes mellitus using caspar, a software and statistical program for conditional analysis of polygenic diseases","year":"1997-01-01"}],"summary":{"biotoolsCURIE":"biotools:caspar","biotoolsID":"caspar","description":"Computerized Affected Sibling Pair Analyzer and Reporter, main novel feature is conditional linkage analyses, in which the population can be subdivided according to criteria at some loci and analyzed for linkage at other loci. CASPAR uses simulation to overcome the problems inherent in such multiple testing.","homepage":"http://www.ncbi.nlm.nih.gov/CBBresearch/Schaffer/caspar.html","name":"CASPAR"}}