{
    "additionDate": "2017-02-14T09:35:58Z",
    "biotoolsCURIE": "biotools:mgenomesubtractor",
    "biotoolsID": "mgenomesubtractor",
    "credit": [
        {
            "email": "hyou@sjtu.edu.cn",
            "name": "Hong-Yu Ou",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "mGenomeSubtractor performs mpiBLAST-based comparison of reference bacterial genomes against multiple user-selected genomes. Such in silico subtractive hybridization also allows for definition of species-specific gene pools and can be used to develop genomic arrays.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://202.120.12.134/mGS2/Instruction_mGenomeSubtractor.htm"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genome comparison",
                    "uri": "http://edamontology.org/operation_3209"
                },
                {
                    "term": "Genome feature comparison",
                    "uri": "http://edamontology.org/operation_3194"
                }
            ]
        }
    ],
    "homepage": "http://bioinfo-mml.sjtu.edu.cn/mGS/",
    "language": [
        "Perl"
    ],
    "lastUpdate": "2018-12-10T12:58:57Z",
    "name": "mGenomeSubtractor",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "mGenomeSubtractor performs an mpiBLAST-based comparison of reference bacterial genomes against multiple user-selected genomes for investigation of strain variable accessory regions. With parallel computing architecture, mGenomeSubtractor is able to run rapid BLAST searches of the segmented reference genome against multiple subject genomes at the DNA or amino acid level within a minute. In addition to comparison of protein coding sequences, the highly flexible sliding window-based genome fragmentation approach offered can be used to identify short unique sequences within or between genes. mGenome-Subtractor provides powerful schematic outputs for exploration of identified core and accessory regions, including searches against databases of mobile genetic elements, virulence factors or bacterial essential genes, examination of G+C content and binucleotide distribution bias, and integrated primer design tools. mGenomeSubtractor also allows for the ready definition of species-specific gene pools based on available genomes. Pangenomic arrays can be easily developed using the efficient oligonucleotide design tool. This simple high-throughput in silico 'subtractive hybridization' analytical tool will support the rapidly escalating number of comparative bacterial genomics studies aimed at defining genomic biomarkers of evolutionary lineage, phenotype, pathotype, environmental adaptation and/or disease-association of diverse bacterial species. mGenomeSubtractor is freely available to all users without any login requirement at: http://bioinfo-mml.sjtu.edu.cn/mGS/. © The Author(s) 2010. Published by Oxford University Press.",
                "authors": [
                    {
                        "name": "Deng Z."
                    },
                    {
                        "name": "Harrison E.M."
                    },
                    {
                        "name": "He X."
                    },
                    {
                        "name": "Ou H.-Y."
                    },
                    {
                        "name": "Rajakumar K."
                    },
                    {
                        "name": "Shao Y."
                    },
                    {
                        "name": "Tai C."
                    }
                ],
                "citationCount": 60,
                "date": "2010-04-30T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "mGenomeSubtractor: A web-based tool for parallel in silico subtractive hybridization analysis of multiple bacterial genomes"
            },
            "pmid": "20435682"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        }
    ],
    "validated": 1
}
