{"collectionID": [], "accessibility": [], "topic": [{"term": "Systems biology", "uri": "http://edamontology.org/topic_2259"}, {"term": "Data visualisation", "uri": "http://edamontology.org/topic_0092"}, {"term": "Molecular interactions, pathways and networks", "uri": "http://edamontology.org/topic_0602"}], "owner": "d.gabrielaitis", "cost": null, "relation": [], "download": [], "validated": 1, "publication": [{"doi": "10.1186/s12918-015-0189-4", "note": null, "version": null, "pmid": null, "type": null, "pmcid": null, "metadata": {"title": "DeDaL: Cytoscape 3 app for producing and morphing data-driven and structure-driven network layouts", "abstract": "© 2015 Czerwinska et al.Background: Visualization and analysis of molecular profiling data together with biological networks are able to provide new mechanistic insights into biological functions. Currently, it is possible to visualize high-throughput data on top of pre-defined network layouts, but they are not always adapted to a given data analysis task. A network layout based simultaneously on the network structure and the associated multidimensional data might be advantageous for data visualization and analysis in some cases. Results: We developed a Cytoscape app, which allows constructing biological network layouts based on the data from molecular profiles imported as values of node attributes. DeDaL is a Cytoscape 3 app, which uses linear and non-linear algorithms of dimension reduction to produce data-driven network layouts based on multidimensional data (typically gene expression). DeDaL implements several data pre-processing and layout post-processing steps such as continuous morphing between two arbitrary network layouts and aligning one network layout with respect to another one by rotating and mirroring. The combination of all these functionalities facilitates the creation of insightful network layouts representing both structural network features and correlation patterns in multivariate data. We demonstrate the added value of applying DeDaL in several practical applications, including an example of a large protein-protein interaction network. Conclusions: DeDaL is a convenient tool for applying data dimensionality reduction methods and for designing insightful data displays based on data-driven layouts of biological networks, built within Cytoscape environment. DeDaL is freely available for downloading at http://bioinfo-out.curie.fr/projects/dedal/", "citationCount": 8, "authors": [{"name": "Czerwinska U."}, {"name": "Calzone L."}, {"name": "Barillot E."}, {"name": "Zinovyev A."}], "date": "2015-08-14T00:00:00Z", "journal": "BMC Systems Biology"}}], "homepage_status": 0, "credit": [{"typeRole": ["Primary contact"], "name": "Andrei Zinovyev", "url": null, "gridid": null, "note": null, "orcidid": null, "typeEntity": "Person", "email": "Andrei.Zinovyev@curie.fr"}], "biotoolsCURIE": "biotools:dedal", "elixirPlatform": [], "elixirNode": [], "version": [], "elixir_badge": 0, "homepage": "http://bioinfo-out.curie.fr/projects/dedal/", "function": [{"note": null, "input": [], "operation": [{"term": "Metabolic network modelling", "uri": "http://edamontology.org/operation_3660"}], "cmd": null, "output": []}], "lastUpdate": "2018-12-10T12:59:01Z", "otherID": [], "description": "Cytoscape 3.0 app for producing an morphing data-driven and structure-driven network layouts.", "toolType": ["Plug-in"], "editPermission": {"type": "private", "authors": []}, "language": ["Java"], "link": [], "biotoolsID": "dedal", "additionDate": "2018-08-23T08:05:29Z", "name": "DeDaL", "license": "GPL-3.0", "documentation": [{"url": "http://bioinfo-out.curie.fr/projects/dedal/#tutorial", "note": null, "type": "General"}], "maturity": null, "confidence_flag": null, "operatingSystem": ["Linux", "Windows", "Mac"]}