
{
    "credit": [
        {
            "email": "zhouy1016@163.com",
            "name": "Yan Zhou",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "url": "http://bioconductor.org/packages/release/bioc/html/methylMnM.html"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://bioconductor/packages/release/bioc/src/contrib/methylMnM_1.12.0.tar.gz"
        }
    ],
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Sequence",
                        "uri": "http://edamontology.org/data_2044"
                    },
                    "format": [
                        {
                            "term": "BED",
                            "uri": "http://edamontology.org/format_3003"
                        }
                    ]
                }
            ],
            "operation": [
                {
                    "term": "Methylation analysis",
                    "uri": "http://edamontology.org/operation_3204"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Statistical estimate score",
                        "uri": "http://edamontology.org/data_0951"
                    },
                    "format": [
                        {
                            "term": "BED",
                            "uri": "http://edamontology.org/format_3003"
                        }
                    ]
                }
            ]
        }
    ],
    "labels": {
        "collectionID": [
            "BioConductor"
        ],
        "language": [
            "R"
        ],
        "license": "GPL-3.0",
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Command-line tool",
            "Library"
        ],
        "topic": [
            {
                "term": "Epigenetics",
                "uri": "http://edamontology.org/topic_3295"
            },
            {
                "term": "Sequencing",
                "uri": "http://edamontology.org/topic_3168"
            },
            {
                "term": "Methylated DNA immunoprecipitation",
                "uri": "http://edamontology.org/topic_3674"
            }
        ]
    },
    "publication": [
        {
            "abstract": "DNA methylation plays key roles in diverse biological processes such as X chromosome inactivation, transposable element repression, genomic imprinting, and tissue-specific gene expression. Sequencing-based DNA methylation profiling provides an unprecedented opportunity to map and compare complete DNA methylomes. This includes one of the most widely applied technologies for measuring DNA methylation: methylated DNA immunoprecipitation followed by sequencing (MeDIP-seq), coupled with a complementary method, methylation-sensitive restriction enzyme sequencing (MRE-seq). A computational approach that integrates data from these two different but complementary assays and predicts methylation differences between samples has been unavailable. Here, we present a novel integrative statistical framework M&M (for integration of MeDIP-seq and MRE-seq) that dynamically scales, normalizes, and combines MeDIPseq and MRE-seq data to detect differentially methylated regions. Using sample-matched whole-genome bisulfite sequencing (WGBS) as a gold standard, we demonstrate superior accuracy and reproducibility of M&M compared to existing analytical methods for MeDIP-seq data alone. M&M leverages the complementary nature of MeDIP-seq and MREseq data to allow rapid comparative analysis between whole methylomes at a fraction of the cost of WGBS. Comprehensive analysis of nineteen human DNA methylomes with M&M reveals distinct DNA methylation patterns among different tissue types, cell types, and individuals, potentially underscoring divergent epigenetic regulation at different scales of phenotypic diversity. We find that differential DNA methylation at enhancer elements, with concurrent changes in histone modifications and transcription factor binding, is common at the cell, tissue, and individual levels, whereas promoter methylation is more prominent in reinforcing fundamental tissue identities. © 2013, Published by Cold Spring Harbor Laboratory Press.",
            "authors": [
                "Zhang B.",
                "Zhou Y.",
                "Lin N.",
                "Lowdon R.F.",
                "Hong C.",
                "Nagarajan R.P.",
                "Cheng J.B.",
                "Li D.",
                "Stevens M.",
                "Lee H.J.",
                "Xing X.",
                "Zhou J.",
                "Sundaram V.",
                "Elliott G.",
                "Gu J.",
                "Shi T.",
                "Gascard P.",
                "Sigaroudinia M.",
                "Tlsty T.D.",
                "Kadlecek T.",
                "Weiss A.",
                "O'Geen H.",
                "Farnham P.J.",
                "Maire C.L.",
                "Ligon K.L.",
                "Madden P.A.F.",
                "Tam A.",
                "Moore R.",
                "Hirst M.",
                "Marra M.A.",
                "Zhang B.",
                "Costello J.F.",
                "Wang T."
            ],
            "cit_count": 73,
            "doi": "10.1101/gr.156539.113",
            "journal": "Genome Research",
            "title": "Functional DNA methylation differences between tissues, cell types, and across individuals discovered using the M&M algorithm",
            "type": "Primary",
            "year": "2013-09-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:methylmnm",
        "biotoolsID": "methylmnm",
        "description": "To give the exactly p-value and q-value of MeDIP-seq and MRE-seq data for different samples comparation.",
        "homepage": "http://bioconductor.org/packages/release/bioc/html/methylMnM.html",
        "name": "methylMnM",
        "version": [
            "1.12.0"
        ]
    }
}