{
    "additionDate": "2016-03-03T13:48:33Z",
    "biotoolsCURIE": "biotools:rubi",
    "biotoolsID": "rubi",
    "credit": [
        {
            "name": "ELIXIR-ITA-PADOVA",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        },
        {
            "email": "silvio.tosatto@unipd.it",
            "name": "Silvio C.E. Tosatto",
            "orcidid": "http://orcid.org/0000-0003-4525-7793",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://protein.bio.unipd.it"
        }
    ],
    "description": "New web server to detect regions of proteins which are thought to contain ubiquitinated lysines.",
    "documentation": [
        {
            "type": "General",
            "url": "http://protein.bio.unipd.it/rubi/help_pages/help.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Prediction and recognition",
                    "uri": "http://edamontology.org/operation_2423"
                }
            ]
        }
    ],
    "homepage": "http://protein.bio.unipd.it/rubi/",
    "lastUpdate": "2019-01-10T04:39:04Z",
    "name": "RUBI",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "ELIXIR-ITA-PADOVA",
    "publication": [
        {
            "doi": "10.1007/s00726-013-1645-3",
            "metadata": {
                "abstract": "Post-translational modification of protein lysines was recently shown to be a common feature of eukaryotic organisms. The ubiquitin modification is regarded as a versatile regulatory mechanism with many important cellular roles. Large-scale datasets are becoming available for H. sapiens ubiquitination. However, using current experimental techniques the vast majority of their sites remain unidentified and in silico tools may offer an alternative. Here, we introduce Rapid UBIquitination (RUBI) a sequence-based ubiquitination predictor designed for rapid application on a genome scale. RUBI was constructed using an iterative approach. At each iteration, important factors which influenced performance and its usability were investigated. The final RUBI model has an AUC of 0.868 on a large cross-validation set and is shown to outperform other available methods on independent sets. Predicted intrinsic disorder is shown to be weakly anti-correlated to ubiquitination for the H. sapiens dataset and improves performance slightly. RUBI predicts the number of ubiquitination sites correctly within three sites for ca. 80 % of the tested proteins. The average potentially ubiquitinated proteome fraction is predicted to be at least 25 % across a variety of model organisms, including several thousand possible H. sapiens proteins awaiting experimental characterization. RUBI can accurately predict ubiquitination on unseen examples and has a signal across different eukaryotic organisms. The factors which influenced the construction of RUBI could also be tested in other post-translational modification predictors. One of the more interesting factors is the influence of intrinsic protein disorder on ubiquitinated lysines where residues with low disorder probability are preferred. © 2013 Springer-Verlag Wien.",
                "authors": [
                    {
                        "name": "Walsh I."
                    },
                    {
                        "name": "Di Domenico T."
                    },
                    {
                        "name": "Tosatto S.C.E."
                    }
                ],
                "citationCount": 11,
                "date": "2014-04-01T00:00:00Z",
                "journal": "Amino Acids",
                "title": "RUBI: Rapid proteomic-scale prediction of lysine ubiquitination and factors influencing predictor performance"
            },
            "pmid": "24363213",
            "type": "Primary"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        }
    ],
    "validated": 1,
    "version": [
        "1.0"
    ]
}