{
    "additionDate": "2021-01-18T11:04:50Z",
    "biotoolsCURIE": "biotools:genetribe",
    "biotoolsID": "genetribe",
    "confidence_flag": "tool",
    "description": "A Collinearity-Incorporating Homology Inference Strategy for Connecting Emerging Assemblies in the Triticeae Tribe as a Pilot Practice in the Plant Pangenomic Era.\n\nMultilevel homolog-identification pipeline.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence assembly",
                    "uri": "http://edamontology.org/operation_0310"
                },
                {
                    "term": "Gene tree construction",
                    "uri": "http://edamontology.org/operation_0553"
                },
                {
                    "term": "Homology-based gene prediction",
                    "uri": "http://edamontology.org/operation_3663"
                }
            ]
        }
    ],
    "homepage": "https://chenym1.github.io/genetribe/",
    "lastUpdate": "2021-01-22T19:20:53Z",
    "name": "GeneTribe",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1016/J.MOLP.2020.09.019",
            "metadata": {
                "abstract": "© 2020 The AuthorPlant genome sequencing has dramatically increased, and some species even have multiple high-quality reference versions. Demands for clade-specific homology inference and analysis have increased in the pangenomic era. Here we present a novel method, GeneTribe (https://chenym1.github.io/genetribe/), for homology inference among genetically similar genomes that incorporates gene collinearity and shows better performance than traditional sequence-similarity-based methods in terms of accuracy and scalability. The Triticeae tribe is a typical allopolyploid-rich clade with complex species relationships that includes many important crops, such as wheat, barley, and rye. We built Triticeae-GeneTribe (http://wheat.cau.edu.cn/TGT/), a homology database, by integrating 12 Triticeae genomes and 3 outgroup model genomes and implemented versatile analysis and visualization functions. With macrocollinearity analysis, we were able to construct a refined model illustrating the structural rearrangements of the 4A-5A-7B chromosomes in wheat as two major translocation events. With collinearity analysis at both the macro- and microscale, we illustrated the complex evolutionary history of homologs of the wheat vernalization gene Vrn2, which evolved as a combined result of genome translocation, duplication, and polyploidization and gene loss events. Our work provides a useful practice for connecting emerging genome assemblies, with awareness of the extensive polyploidy in plants, and will help researchers efficiently exploit genome sequence resources. © 2020 The AuthorThis work reports the development of a novel method incorporating collinearity for homology inference among genetically similar genomes, with improved performance and scalability. A comprehensive homology database is built for the tribe Triticeae. With macro- and microcollinearity analysis, the authors proposed a refined model of the chromosome 4A-5A-7B translocations and illustrated the complex evolutionary history of the TaVrn2 homologs.",
                "authors": [
                    {
                        "name": "Chen Y."
                    },
                    {
                        "name": "Song W."
                    },
                    {
                        "name": "Xie X."
                    },
                    {
                        "name": "Wang Z."
                    },
                    {
                        "name": "Guan P."
                    },
                    {
                        "name": "Peng H."
                    },
                    {
                        "name": "Jiao Y."
                    },
                    {
                        "name": "Ni Z."
                    },
                    {
                        "name": "Sun Q."
                    },
                    {
                        "name": "Guo W."
                    }
                ],
                "citationCount": 2,
                "date": "2020-12-07T00:00:00Z",
                "journal": "Molecular Plant",
                "title": "A Collinearity-Incorporating Homology Inference Strategy for Connecting Emerging Assemblies in the Triticeae Tribe as a Pilot Practice in the Plant Pangenomic Era"
            },
            "pmid": "32979565"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        },
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        }
    ],
    "validated": 1
}