{
    "additionDate": "2021-01-18T11:27:03Z",
    "biotoolsCURIE": "biotools:mspectraai",
    "biotoolsID": "mspectraai",
    "confidence_flag": "high",
    "credit": [
        {
            "email": "jqcheng@scu.edu.cn",
            "name": "Jingqiu Cheng",
            "typeEntity": "Person"
        },
        {
            "email": "yanghao@scu.edu.cn",
            "name": "Hao Yang",
            "typeEntity": "Person"
        }
    ],
    "description": "A powerful platform for deciphering proteome profiling of multi-tumor mass spectrometry data by using deep neural networks.\n\nA powerful software for deciphering proteome profiling of multi-tumour mass spectrometry data using deep neural networks.\n\nMSpectraAI is a free, user-friendly and comprehensive software for mining and classifying raw LC-MS2-based proteomics or metabolomics data of different samples using deep learning models. Users can also built your own deep neural network model in this software. It is developed with R and an example is shown here: https://www.omicsolution.org/wukong/MSpectraAI/.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                },
                {
                    "term": "Spectral counting",
                    "uri": "http://edamontology.org/operation_3637"
                },
                {
                    "term": "Spectrum calculation",
                    "uri": "http://edamontology.org/operation_3860"
                }
            ]
        }
    ],
    "homepage": "https://github.com/wangshisheng/MSpectraAI",
    "language": [
        "JavaScript",
        "R"
    ],
    "lastUpdate": "2021-03-01T09:56:55Z",
    "license": "GPL-3.0",
    "name": "MSpectraAI",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1186/S12859-020-03783-0",
            "metadata": {
                "abstract": "© 2020 The Author(s).Background: Mass spectrometry (MS) has become a promising analytical technique to acquire proteomics information for the characterization of biological samples. Nevertheless, most studies focus on the final proteins identified through a suite of algorithms by using partial MS spectra to compare with the sequence database, while the pattern recognition and classification of raw mass-spectrometric data remain unresolved. Results: We developed an open-source and comprehensive platform, named MSpectraAI, for analyzing large-scale MS data through deep neural networks (DNNs); this system involves spectral-feature swath extraction, classification, and visualization. Moreover, this platform allows users to create their own DNN model by using Keras. To evaluate this tool, we collected the publicly available proteomics datasets of six tumor types (a total of 7,997,805 mass spectra) from the ProteomeXchange consortium and classified the samples based on the spectra profiling. The results suggest that MSpectraAI can distinguish different types of samples based on the fingerprint spectrum and achieve better prediction accuracy in MS1 level (average 0.967). Conclusion: This study deciphers proteome profiling of raw mass spectrometry data and broadens the promising application of the classification and prediction of proteomics data from multi-tumor samples using deep learning methods. MSpectraAI also shows a better performance compared to the other classical machine learning approaches.",
                "authors": [
                    {
                        "name": "Cheng J."
                    },
                    {
                        "name": "Wang S."
                    },
                    {
                        "name": "Yang H."
                    },
                    {
                        "name": "Zhou H."
                    },
                    {
                        "name": "Zhu H."
                    }
                ],
                "date": "2020-10-07T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "MSpectraAI: A powerful platform for deciphering proteome profiling of multi-tumor mass spectrometry data by using deep neural networks"
            },
            "pmcid": "PMC7539376",
            "pmid": "33028193"
        }
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        }
    ]
}
