{
    "additionDate": "2018-05-18T10:42:38Z",
    "biotoolsCURIE": "biotools:histonehmm",
    "biotoolsID": "histonehmm",
    "credit": [
        {
            "email": "matthias.heinig@helmholtz-muenchen.de",
            "name": "Matthias Heinig",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "heinig@molgen.mpg.de",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Analyse ChIP-seq data of histone modifications with broad genomic footprints like H3K27me3. It allows for calling modified regions in single samples as well as for calling differentially modified regions in a comparison of two samples.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://histonehmm.molgen.mpg.de/v1.6/histoneHMM.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Differential gene expression analysis",
                    "uri": "http://edamontology.org/operation_3223"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Peak calling",
                    "uri": "http://edamontology.org/operation_3222"
                }
            ]
        }
    ],
    "homepage": "https://github.com/matthiasheinig/histoneHMM",
    "language": [
        "C++",
        "Fortran",
        "R"
    ],
    "lastUpdate": "2018-12-10T12:58:58Z",
    "license": "GPL-3.0",
    "name": "histoneHMM",
    "owner": "aotamendi.1",
    "publication": [
        {
            "doi": "10.1186/s12859-015-0491-6",
            "metadata": {
                "abstract": "© 2015 Heinig et al.Background: ChIP-seq has become a routine method for interrogating the genome-wide distribution of various histone modifications. An important experimental goal is to compare the ChIP-seq profiles between an experimental sample and a reference sample, and to identify regions that show differential enrichment. However, comparative analysis of samples remains challenging for histone modifications with broad domains, such as heterochromatin-associated H3K27me3, as most ChIP-seq algorithms are designed to detect well defined peak-like features. Results: To address this limitation we introduce histoneHMM, a powerful bivariate Hidden Markov Model for the differential analysis of histone modifications with broad genomic footprints. histoneHMM aggregates short-reads over larger regions and takes the resulting bivariate read counts as inputs for an unsupervised classification procedure, requiring no further tuning parameters. histoneHMM outputs probabilistic classifications of genomic regions as being either modified in both samples, unmodified in both samples or differentially modified between samples. We extensively tested histoneHMM in the context of two broad repressive marks, H3K27me3 and H3K9me3, and evaluated region calls with follow up qPCR as well as RNA-seq data. Our results show that histoneHMM outperforms competing methods in detecting functionally relevant differentially modified regions. Conclusion: histoneHMM is a fast algorithm written in C++ and compiled as an R package. It runs in the popular R computing environment and thus seamlessly integrates with the extensive bioinformatic tool sets available through Bioconductor. This makeshistoneHMM an attractive choice for the differential analysis of ChIP-seq data. Software is available from http://histonehmm.molgen.mpg.de.",
                "authors": [
                    {
                        "name": "Colome-Tatche M."
                    },
                    {
                        "name": "Heinig M."
                    },
                    {
                        "name": "Hubner N."
                    },
                    {
                        "name": "Johannes F."
                    },
                    {
                        "name": "Pravenec M."
                    },
                    {
                        "name": "Rintisch C."
                    },
                    {
                        "name": "Schafer S."
                    },
                    {
                        "name": "Taudt A."
                    },
                    {
                        "name": "Vingron M."
                    }
                ],
                "citationCount": 13,
                "date": "2015-12-12T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "histoneHMM: Differential analysis of histone modifications with broad genomic footprints"
            },
            "pmcid": "PMC4347972",
            "pmid": "25884684"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "ChIP-seq",
            "uri": "http://edamontology.org/topic_3169"
        },
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        },
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        },
        {
            "term": "RNA-seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ],
    "validated": 1,
    "version": [
        "1.7"
    ]
}
