{
    "additionDate": "2017-01-17T14:56:40Z",
    "biotoolsCURIE": "biotools:purecn",
    "biotoolsID": "purecn",
    "collectionID": [
        "BioConductor"
    ],
    "credit": [
        {
            "email": "markus.riester@novartis.com",
            "name": "Markus Riester",
            "orcidid": "http://orcid.org/0000-0002-4759-8332",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "This package estimates tumor purity, copy number, loss of heterozygosity (LOH), and status of single nucleotide variants (SNVs). It is designed for targeted short read sequencing data, integrating well with standard somatic variant detection pipelines and supporting for tumor samples without matching normal samples.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://bioconductor.org/packages/release/bioc/html/PureCN.html"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://bioconductor/packages/release/bioc/src/contrib/PureCN_1.2.3.tar.gz"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence classification",
                    "uri": "http://edamontology.org/operation_2995"
                },
                {
                    "term": "Copy number estimation",
                    "uri": "http://edamontology.org/operation_3233"
                }
            ]
        }
    ],
    "homepage": "http://bioconductor.org/packages/release/bioc/html/PureCN.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2019-01-13T18:20:52Z",
    "license": "Artistic-2.0",
    "name": "PureCN",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "bioconductor_import",
    "publication": [
        {
            "doi": "10.1186/s13029-016-0060-z",
            "metadata": {
                "abstract": "© 2016 The Author(s).Background: Matched sequencing of both tumor and normal tissue is routinely used to classify variants of uncertain significance (VUS) into somatic vs. germline. However, assays used in molecular diagnostics focus on known somatic alterations in cancer genes and often only sequence tumors. Therefore, an algorithm that reliably classifies variants would be helpful for retrospective exploratory analyses. Contamination of tumor samples with normal cells results in differences in expected allelic fractions of germline and somatic variants, which can be exploited to accurately infer genotypes after adjusting for local copy number. However, existing algorithms for determining tumor purity, ploidy and copy number are not designed for unmatched short read sequencing data. Results: We describe a methodology and corresponding open source software for estimating tumor purity, copy number, loss of heterozygosity (LOH), and contamination, and for classification of single nucleotide variants (SNVs) by somatic status and clonality. This R package, PureCN, is optimized for targeted short read sequencing data, integrates well with standard somatic variant detection pipelines, and has support for matched and unmatched tumor samples. Accuracy is demonstrated on simulated data and on real whole exome sequencing data. Conclusions: Our algorithm provides accurate estimates of tumor purity and ploidy, even if matched normal samples are not available. This in turn allows accurate classification of SNVs. The software is provided as open source (Artistic License 2.0) R/Bioconductor package PureCN (http://bioconductor.org/packages/PureCN/).",
                "authors": [
                    {
                        "name": "Riester M."
                    },
                    {
                        "name": "Singh A.P."
                    },
                    {
                        "name": "Brannon A.R."
                    },
                    {
                        "name": "Yu K."
                    },
                    {
                        "name": "Campbell C.D."
                    },
                    {
                        "name": "Chiang D.Y."
                    },
                    {
                        "name": "Morrissey M.P."
                    }
                ],
                "citationCount": 31,
                "date": "2016-12-15T00:00:00Z",
                "journal": "Source Code for Biology and Medicine",
                "title": "PureCN: Copy number calling and SNV classification using targeted short read sequencing"
            },
            "pmcid": "PMC5157099",
            "pmid": "27999612",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool",
        "Library"
    ],
    "topic": [
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ],
    "validated": 1,
    "version": [
        "1.2.3"
    ]
}