{
    "additionDate": "2019-11-14T19:41:48Z",
    "biotoolsCURIE": "biotools:UT-Heart",
    "biotoolsID": "UT-Heart",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "okada@sml.k.u-tokyo.ac.jp",
            "name": "Jun-ichi Okada",
            "typeEntity": "Person"
        }
    ],
    "description": "Clinical and pharmacological application of multiscale multiphysics heart simulator, UT-Heart | Cardiotoxicity Hazard Map/ECG Data Base NEW | The world’s leading technologies open the new door for:",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Modelling and simulation",
                    "uri": "http://edamontology.org/operation_2426"
                }
            ]
        }
    ],
    "homepage": "http://ut-heart.com/",
    "lastUpdate": "2021-01-08T14:33:18Z",
    "name": "UT-Heart",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.4196/KJPP.2019.23.5.295",
            "metadata": {
                "abstract": "Copyright © Korean J Physiol Pharmacol,A heart simulator, UT-Heart, is a finite element model of the human heart that can reproduce all the fundamental activities of the working heart, including propagation of excitation, contraction, and relaxation and generation of blood pressure and blood flow, based on the molecular aspects of the cardiac electrophysiology and excitation-contraction coupling. In this paper, we present a brief review of the practical use of UT-Heart. As an example, we focus on its application for predicting the effect of cardiac resynchronization therapy (CRT) and evaluating the proarrhythmic risk of drugs. Patient-specific, multiscale heart simulation successfully predicted the response to CRT by reproducing the complex pathophysiology of the heart. A proarrhythmic risk assessment system combining in vitro channel assays and in silico simulation of cardiac electrophysiology using UT-Heart successfully predicted drug-induced arrhythmogenic risk. The assessment system was found to be reliable and efficient. We also developed a comprehensive hazard map on the various combinations of ion channel inhibitors. This in silico electrocardiogram database (now freely available at http://ut-heart.com/) can facilitate proarrhythmic risk assessment without the need to perform computationally expensive heart simulation. Based on these results, we conclude that the heart simulator, UT-Heart, could be a useful tool in clinical medicine and drug discovery.",
                "authors": [
                    {
                        "name": "Hisada T."
                    },
                    {
                        "name": "Okada J.-I."
                    },
                    {
                        "name": "Sugiura S."
                    },
                    {
                        "name": "Washio T."
                    }
                ],
                "citationCount": 1,
                "date": "2019-01-01T00:00:00Z",
                "journal": "Korean Journal of Physiology and Pharmacology",
                "title": "Clinical and pharmacological application of multiscale multiphysics heart simulator, UT-Heart"
            },
            "pmcid": "PMC6717797",
            "pmid": "31496866"
        }
    ],
    "topic": [
        {
            "term": "Cardiology",
            "uri": "http://edamontology.org/topic_3335"
        },
        {
            "term": "Pharmacology",
            "uri": "http://edamontology.org/topic_0202"
        },
        {
            "term": "Preclinical and clinical studies",
            "uri": "http://edamontology.org/topic_3379"
        }
    ],
    "validated": 1
}
