
{
    "credit": [
    ],
    "documentation": [
        {
            "url": "https://bioinformatics.erc.monash.edu/apps/LFQ-Analyst/LFQ-Analyst_manual.pdf"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Principal component visualisation",
                    "uri": "http://edamontology.org/operation_2939"
                },
                {
                    "term": "Label-free quantification",
                    "uri": "http://edamontology.org/operation_3634"
                },
                {
                    "term": "Imputation",
                    "uri": "http://edamontology.org/operation_3557"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "R"
        ],
        "license": "GPL-3.0",
        "topic": [
            {
                "term": "Proteomics",
                "uri": "http://edamontology.org/topic_0121"
            },
            {
                "term": "Sequence analysis",
                "uri": "http://edamontology.org/topic_0080"
            },
            {
                "term": "Small molecules",
                "uri": "http://edamontology.org/topic_0154"
            },
            {
                "term": "Metabolomics",
                "uri": "http://edamontology.org/topic_3172"
            },
            {
                "term": "Proteomics experiment",
                "uri": "http://edamontology.org/topic_3520"
            }
        ]
    },
    "link": [
        {
            "type": "REPOSITORY",
            "url": "https://github.com/MonashBioinformaticsPlatform/LFQ-Analyst"
        }
    ],
    "publication": [
        {
            "abstract": "© 2019 American Chemical Society.Relative label-free quantification (LFQ) of shotgun proteomics data using precursor (MS1) signal intensities is one of the most commonly used applications to comprehensively and globally quantify proteins across biological samples and conditions. Due to the popularity of this technique, several software packages, such as the popular software suite MaxQuant, have been developed to extract, analyze, and compare spectral features and to report quantitative information of peptides, proteins, and even post-Translationally modified sites. However, there is still a lack of accessible tools for the interpretation and downstream statistical analysis of these complex data sets, in particular for researchers and biologists with no or only limited experience in proteomics, bioinformatics, and statistics. We have therefore created LFQ-Analyst, which is an easy-To-use, interactive web application developed to perform differential expression analysis with \"one click\" and to visualize label-free quantitative proteomic data sets preprocessed with MaxQuant. LFQ-Analyst provides a wealth of user-Analytic features and offers numerous publication-quality result graphics to facilitate statistical and exploratory analysis of label-free quantitative data sets. LFQ-Analyst, including an in-depth user manual, is freely available at https://bioinformatics.erc.monash.edu/apps/LFQ-Analyst.",
            "authors": [
                "Shah A.D.",
                "Goode R.J.A.",
                "Huang C.",
                "Powell D.R.",
                "Schittenhelm R.B."
            ],
            "cit_count": 0,
            "doi": "10.1021/ACS.JPROTEOME.9B00496",
            "journal": "Journal of Proteome Research",
            "pmid": "31657565",
            "title": "Lfq-Analyst: An easy-To-use interactive web platform to analyze and visualize label-free proteomics data preprocessed with maxquant",
            "year": "2019-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:LFQ-Analyst",
        "biotoolsID": "LFQ-Analyst",
        "description": "An Easy-To-Use Interactive Web Platform To Analyze and Visualize Label-Free Proteomics Data Preprocessed with MaxQuant.\n\nA tool for analysing label-free quantitative proteomics dataset https://bioinformatics.erc.monash.edu/apps/LFQ-Analyst/.\n\nLFQ-Analyst: An easy-to-use interactive web-platform to analyze and visualize proteomics data preprocessed with MaxQuant.\n\nLFQ-Analyst is an easy-to-use, interactive web application developed to perform differential expression analysis with “one click” and to visualize label-free quantitative proteomic datasets preprocessed with MaxQuant. LFQ-Analyst provides a wealth of user-analytic features and offers numerous publication-quality result output graphics and tables to facilitate statistical and exploratory analysis of label-free quantitative datasets",
        "homepage": "https://bioinformatics.erc.monash.edu/apps/LFQ-Analyst",
        "name": "LFQ-Analyst"
    }
}