{
    "accessibility": "Open access",
    "additionDate": "2021-05-06T15:54:45Z",
    "biotoolsCURIE": "biotools:lmap_s",
    "biotoolsID": "lmap_s",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "emaldonado@ciimar.up.pt",
            "name": "Emanuel Maldonado",
            "orcidid": "https://orcid.org/0000-0002-0084-6116",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "A user-friendly pipeline software package developed in Perl, to enable multiple genes/datasets high-throughput estimations of multiple sequence alignment (MSA) and phylogenetic trees (PT). Additionally, LMAP_S makes possible uncovering optimal estimations of both MSA and phylogenies. LMAP_S was designed for the workstation multi-core environment and integrates over 30 scientific software, for which provides easy installation.\n\nThe LMAP_S package additionally includes our RYcode.pl application for purine/pyrimidine DNA/RNA (re-)coding.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://lmap-s.sourceforge.io/LMAP_S_Manual.pdf"
        }
    ],
    "download": [
        {
            "type": "Software package",
            "url": "https://lmap-s.sourceforge.io/",
            "version": "1.0.0"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Multiple sequence alignment",
                    "uri": "http://edamontology.org/operation_0492"
                },
                {
                    "term": "Optimisation and refinement",
                    "uri": "http://edamontology.org/operation_2425"
                },
                {
                    "term": "Phylogenetic inference (method centric)",
                    "uri": "http://edamontology.org/operation_0539"
                },
                {
                    "term": "Phylogenetic tree topology analysis",
                    "uri": "http://edamontology.org/operation_0551"
                }
            ]
        }
    ],
    "homepage": "https://lmap-s.sourceforge.io/",
    "language": [
        "Perl"
    ],
    "lastUpdate": "2021-05-10T14:21:53Z",
    "license": "GPL-3.0",
    "maturity": "Mature",
    "name": "LMAP_S",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "emaldonado",
    "publication": [
        {
            "doi": "10.1186/s12859-019-3292-5",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Recent advances in genome sequencing technologies and the cost drop in high-throughput sequencing continue to give rise to a deluge of data available for downstream analyses. Among others, evolutionary biologists often make use of genomic data to uncover phenotypic diversity and adaptive evolution in protein-coding genes. Therefore, multiple sequence alignments (MSA) and phylogenetic trees (PT) need to be estimated with optimal results. However, the preparation of an initial dataset of multiple sequence file(s) (MSF) and the steps involved can be challenging when considering extensive amount of data. Thus, it becomes necessary the development of a tool that removes the potential source of error and automates the time-consuming steps of a typical workflow with high-throughput and optimal MSA and PT estimations. Results: We introduce LMAP_S (Lightweight Multigene Alignment and Phylogeny eStimation), a user-friendly command-line and interactive package, designed to handle an improved alignment and phylogeny estimation workflow: MSF preparation, MSA estimation, outlier detection, refinement, consensus, phylogeny estimation, comparison and editing, among which file and directory organization, execution, manipulation of information are automated, with minimal manual user intervention. LMAP_S was developed for the workstation multi-core environment and provides a unique advantage for processing multiple datasets. Our software, proved to be efficient throughout the workflow, including, the (unlimited) handling of more than 20 datasets. Conclusions: We have developed a simple and versatile LMAP_S package enabling researchers to effectively estimate multiple datasets MSAs and PTs in a high-throughput fashion. LMAP_S integrates more than 25 software providing overall more than 65 algorithm choices distributed in five stages. At minimum, one FASTA file is required within a single input directory. To our knowledge, no other software combines MSA and phylogeny estimation with as many alternatives and provides means to find optimal MSAs and phylogenies. Moreover, we used a case study comparing methodologies that highlighted the usefulness of our software. LMAP_S has been developed as an open-source package, allowing its integration into more complex open-source bioinformatics pipelines. LMAP_S package is released under GPLv3 license and is freely available at https://lmap-s.sourceforge.io/.",
                "authors": [
                    {
                        "name": "Antunes A."
                    },
                    {
                        "name": "Maldonado E."
                    }
                ],
                "date": "2019-12-30T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "LMAP_S: Lightweight Multigene Alignment and Phylogeny eStimation"
            },
            "type": [
                "Primary"
            ],
            "version": "1.0.0"
        }
    ],
    "toolType": [
        "Command-line tool",
        "Desktop application",
        "Workflow"
    ],
    "topic": [
        {
            "term": "Comparative genomics",
            "uri": "http://edamontology.org/topic_0797"
        },
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        }
    ],
    "version": [
        "1.0.0"
    ]
}
