{
    "additionDate": "2020-01-14T09:40:46Z",
    "biotoolsCURIE": "biotools:GeneBridge",
    "biotoolsID": "GeneBridge",
    "confidence_flag": "tool",
    "description": "Identifying gene function and module connections by the integration of multispecies expression compendia.\n\nIntegrative systems analysis identifying the associations between genes and biological process or modules.\n\nFor analyzed results for a given gene or module/gene set, please visit https://systems-genetics.org/genebridge.\n\nSystems analysis toolkit containing Gene-Module Association Determination (G-MAD) and Module-Module Association Determination (M-MAD) to identify the associations between genes and biological process or modules, as well as associations between modules.\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'G-MAD', 'WDFY4'",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Imputation",
                    "uri": "http://edamontology.org/operation_3557"
                },
                {
                    "term": "Gene-set enrichment analysis",
                    "uri": "http://edamontology.org/operation_2436"
                },
                {
                    "term": "Gene functional annotation",
                    "uri": "http://edamontology.org/operation_3672"
                }
            ]
        }
    ],
    "homepage": "https://github.com/lihaone/GeneBridge",
    "language": [
        "R"
    ],
    "lastUpdate": "2020-12-03T07:40:56.032564Z",
    "license": "GPL-3.0",
    "name": "GeneBridge",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1101/GR.251983.119",
            "metadata": {
                "abstract": "© 2019 Li et al.The functions of many eukaryotic genes are still poorly understood. Here, we developed and validated a new method, termed GeneBridge, which is based on two linked approaches to impute gene function and bridge genes with biological processes. First, Gene-Module Association Determination (G-MAD) allows the annotation of gene function. Second, Module-Module Association Determination (M-MAD) allows predicting connectivity among modules. We applied the GeneBridge tools to large-scale multispecies expression compendia-1700 data sets with over 300,000 samples from human, mouse, rat, fly, worm, and yeast-collected in this study. G-MAD identifies novel functions of genes-for example, DDT in mitochondrial respiration and WDFY4 in T cell activation-and also suggests novel components for modules, such as for cholesterol biosynthesis. By applying G-MAD on data sets from respective tissues, tissue-specific functions of genes were identified-for instance, the roles of EHHADH in liver and kidney, as well as SLC6A1 in brain and liver. Using M-MAD, we identified a list of module-module associations, such as those between mitochondria and proteasome, mitochondria and histone demethylation, as well as ribosomes and lipid biosynthesis. The GeneBridge tools together with the expression compendia are available as an open resource, which will facilitate the identification of connections linking genes, modules, phenotypes, and diseases.",
                "authors": [
                    {
                        "name": "Li H."
                    },
                    {
                        "name": "Rukina D."
                    },
                    {
                        "name": "David F.P.A."
                    },
                    {
                        "name": "Yang Li T."
                    },
                    {
                        "name": "Oh C.-M."
                    },
                    {
                        "name": "Gao A.W."
                    },
                    {
                        "name": "Katsyuba E."
                    },
                    {
                        "name": "Sleiman M.B."
                    },
                    {
                        "name": "Komljenovic A."
                    },
                    {
                        "name": "Huang Q."
                    },
                    {
                        "name": "Williams R.W."
                    },
                    {
                        "name": "Robinson-Rechavi M."
                    },
                    {
                        "name": "Schoonjans K."
                    },
                    {
                        "name": "Morgenthaler S."
                    },
                    {
                        "name": "Auwerx J."
                    }
                ],
                "citationCount": 1,
                "date": "2019-01-01T00:00:00Z",
                "journal": "Genome Research",
                "title": "Identifying gene function and module connections by the integration of multispecies expression compendia"
            },
            "pmcid": "PMC6886503",
            "pmid": "31754022"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Lipids",
            "uri": "http://edamontology.org/topic_0153"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        }
    ]
}