{
    "additionDate": "2017-08-03T18:58:19Z",
    "biotoolsCURIE": "biotools:rvs",
    "biotoolsID": "rvs",
    "credit": [
        {
            "email": "lisa.strug@utoronto.ca",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "A novel likelihood-based method for genetic association with NGS data from external control groups. The tool substitutes genotype calls by their expected values given observed sequence data and implements a robust variance estimate for the score statistic.",
    "documentation": [
        {
            "type": "General",
            "url": "http://strug.ccb.sickkids.ca/rvs/index.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genetic variation analysis",
                    "uri": "http://edamontology.org/operation_3197"
                }
            ]
        }
    ],
    "homepage": "http://strug.ccb.sickkids.ca/rvs/index.html",
    "homepage_status": 1,
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-10T12:58:51Z",
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/rvs-20140305-genetic-association-with-ngs-data.html"
        }
    ],
    "name": "RVS",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Motivation: Sufficiently powered case-control studies with next-generation sequence (NGS) data remain prohibitively expensive for many investigators. If feasible, a more efficient strategy would be to include publicly available sequenced controls. However, these studies can be confounded by differences in sequencing platform; alignment, single nucleotide polymorphism and variant calling algorithms; read depth; and selection thresholds. Assuming one can match cases and controls on the basis of ethnicity and other potential confounding factors, and one has access to the aligned reads in both groups, we investigate the effect of systematic differences in read depth and selection threshold when comparing allele frequencies between cases and controls. We propose a novel likelihood-based method, the robust variance score (RVS), that substitutes genotype calls by their expected values given observed sequence data. Results: We show theoretically that the RVS eliminates read depth bias in the estimation of minor allele frequency. We also demonstrate that, using simulated and real NGS data, the RVS method controls Type I error and has comparable power to the 'gold standard' analysis with the true underlying genotypes for both common and rare variants. Availability and implementation: An RVS R script and instructions can be found at strug.research.sickkids.ca, and at https://github.com/strug- lab/RVS. © The Author 2014.",
                "authors": [
                    {
                        "name": "Derkach A."
                    },
                    {
                        "name": "Chiang T."
                    },
                    {
                        "name": "Gong J."
                    },
                    {
                        "name": "Addis L."
                    },
                    {
                        "name": "Dobbins S."
                    },
                    {
                        "name": "Tomlinson I."
                    },
                    {
                        "name": "Houlston R."
                    },
                    {
                        "name": "Pal D.K."
                    },
                    {
                        "name": "Strug L.J."
                    }
                ],
                "citationCount": 13,
                "date": "2014-08-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Association analysis using next-generation sequence data from publicly available control groups: The robust variance score statistic"
            },
            "pmid": "24733292"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ],
    "validated": 1
}