{
    "additionDate": "2018-05-31T14:45:49Z",
    "biotoolsCURIE": "biotools:grouper",
    "biotoolsID": "grouper",
    "credit": [
        {
            "email": "rob.patro@cs.stonybrook.edu",
            "name": "Rob Patro",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Graph-based clustering and annotation for improved de novo transcriptome analysis.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/COMBINE-lab/grouper"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence annotation",
                    "uri": "http://edamontology.org/operation_0361"
                },
                {
                    "term": "Sequence clustering",
                    "uri": "http://edamontology.org/operation_0291"
                }
            ]
        }
    ],
    "homepage": "https://github.com/COMBINE-lab/grouper",
    "language": [
        "Python"
    ],
    "lastUpdate": "2018-12-10T12:58:59Z",
    "name": "Grouper",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/bty378",
            "metadata": {
                "abstract": "© The Author(s) 2018.Motivation: De novo transcriptome analysis using RNA-seq offers a promising means to study gene expression in non-model organisms. Yet, the difficulty of transcriptome assembly means that the contigs provided by the assembler often represent a fractured and incomplete view of the transcriptome, complicating downstream analysis. We introduce Grouper, a new method for clustering contigs from de novo assemblies that are likely to belong to the same transcripts and genes; these groups can subsequently be analyzed more robustly. When provided with access to the genome of a related organism, Grouper can transfer annotations to the de novo assembly, further improving the clustering. Results: On de novo assemblies from four different species, we show that Grouper is able to accurately cluster a larger number of contigs than the existing state-of-the-art method. TheGrouper pipeline is able to map greater than 10% more reads against the contigs, leading to accurate downstreamdifferential expression analyses. The labeling module, in the presence of a closely related annotated genome, can efficiently transfer annotations to the contigs and use this information to further improve clustering. Overall, Grouper provides a complete and efficient pipeline for processing de novo transcriptomic assemblies.",
                "authors": [
                    {
                        "name": "Almodaresi F."
                    },
                    {
                        "name": "Malik L."
                    },
                    {
                        "name": "Patro R."
                    }
                ],
                "citationCount": 6,
                "date": "2018-10-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Grouper: Graph-based clustering and annotation for improved de novo transcriptome analysis"
            }
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ],
    "validated": 1
}
