{
    "additionDate": "2017-12-18T00:07:28Z",
    "biotoolsCURIE": "biotools:hthmotif",
    "biotoolsID": "hthmotif",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://stormo.wustl.edu/"
        }
    ],
    "description": "HTHmotif is a novel sequence-based method for identifying transcription factor binding sites in prokaryotic genomes",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Motif discovery",
                    "uri": "http://edamontology.org/operation_0238"
                }
            ]
        }
    ],
    "homepage": "http://stormo.wustl.edu/HTHmotif",
    "language": [
        "Perl",
        "C"
    ],
    "lastUpdate": "2018-12-10T12:58:57Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/hthmotif-hth-motif-discovery.html"
        }
    ],
    "name": "HTHmotif",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btq501",
            "metadata": {
                "abstract": "Motivation: Computational techniques for microbial genomic sequence analysis are becoming increasingly important. With next-generation sequencing technology and the human microbiome project underway, current sequencing capacity is significantly greater than the speed at which organisms of interest can be studied experimentally. Most related computational work has been focused on sequence assembly, gene annotation and metabolic network reconstruction. We have developed a method that will primarily use available sequence data in order to determine prokaryotic transcription factor (TF) binding specificities. Results: Specificity determining residues (critical residues) were identified from crystal structures of DNA-protein complexes and TFs with the same critical residues were grouped into specificity classes. The putative binding regions for each class were defined as the set of promoters for each TF itself (autoregulatory) and the immediately upstream and downstream operons. MEME was used to find putative motifs within each separate class. Tests on the LacI and TetR TF families, using RegulonDB annotated sites, showed the sensitivity of prediction 86% and 80%, respectively. © The Author 2010. Published by Oxford University Press. All rights reserved.",
                "authors": [
                    {
                        "name": "Sahota G."
                    },
                    {
                        "name": "Stormo G.D."
                    }
                ],
                "citationCount": 15,
                "date": "2010-11-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Novel sequence-based method for identifying transcription factor binding sites in prokaryotic genomes"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Transcription",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Transcription factor binding sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        }
    ],
    "validated": 1
}