{
    "additionDate": "2018-08-05T10:50:22Z",
    "biotoolsCURIE": "biotools:cellnetvis",
    "biotoolsID": "cellnetvis",
    "credit": [
        {
            "email": "henry@icmc.usp.br",
            "name": "Henry Heberle",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Web tool for visualization of biological networks using force-directed layout constrained by cellular components.",
    "documentation": [
        {
            "type": "General",
            "url": "http://bioinfo03.ibi.unicamp.br/lnbio/IIS2/cellnetvis/help.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Pathway or network visualisation",
                    "uri": "http://edamontology.org/operation_3083"
                }
            ]
        }
    ],
    "homepage": "http://bioinfo03.ibi.unicamp.br/lnbio/IIS2/cellnetvis/",
    "language": [
        "JavaScript"
    ],
    "lastUpdate": "2018-12-10T12:59:01Z",
    "license": "GPL-3.0",
    "name": "CellNetVis",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "migle_sur",
    "publication": [
        {
            "doi": "10.1186/s12859-017-1787-5",
            "metadata": {
                "abstract": "© 2017 The Author(s). Background: The advent of \"omics\" science has brought new perspectives in contemporary biology through the high-throughput analyses of molecular interactions, providing new clues in protein/gene function and in the organization of biological pathways. Biomolecular interaction networks, or graphs, are simple abstract representations where the components of a cell (e.g. proteins, metabolites etc.) are represented by nodes and their interactions are represented by edges. An appropriate visualization of data is crucial for understanding such networks, since pathways are related to functions that occur in specific regions of the cell. The force-directed layout is an important and widely used technique to draw networks according to their topologies. Placing the networks into cellular compartments helps to quickly identify where network elements are located and, more specifically, concentrated. Currently, only a few tools provide the capability of visually organizing networks by cellular compartments. Most of them cannot handle large and dense networks. Even for small networks with hundreds of nodes the available tools are not able to reposition the network while the user is interacting, limiting the visual exploration capability. Results: Here we propose CellNetVis, a web tool to easily display biological networks in a cell diagram employing a constrained force-directed layout algorithm. The tool is freely available and open-source. It was originally designed for networks generated by the Integrated Interactome System and can be used with networks from others databases, like InnateDB. Conclusions: CellNetVis has demonstrated to be applicable for dynamic investigation of complex networks over a consistent representation of a cell on the Web, with capabilities not matched elsewhere.",
                "authors": [
                    {
                        "name": "Heberle H."
                    },
                    {
                        "name": "Carazzolle M.F."
                    },
                    {
                        "name": "Telles G.P."
                    },
                    {
                        "name": "Meirelles G.V."
                    },
                    {
                        "name": "Minghim R."
                    }
                ],
                "citationCount": 2,
                "date": "2017-09-13T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "CellNetVis: A web tool for visualization of biological networks using force-directed layout constrained by cellular components"
            },
            "type": "Primary"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        }
    ],
    "validated": 1
}