{
    "accessibility": "Open access",
    "additionDate": "2019-06-21T08:56:23Z",
    "biotoolsCURIE": "biotools:mtProtEvol",
    "biotoolsID": "mtProtEvol",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "genkvg@gmail.com",
            "name": "Konstantin Gunbin",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Resource presenting molecular evolution analysis of proteins involved in the function of Vertebrate mitochondria.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                },
                {
                    "term": "Accessible surface calculation",
                    "uri": "http://edamontology.org/operation_0384"
                },
                {
                    "term": "Phylogenetic tree reconstruction",
                    "uri": "http://edamontology.org/operation_3478"
                }
            ]
        }
    ],
    "homepage": "http://bioinfodbs.kantiana.ru/mtProtEvol/",
    "lastUpdate": "2020-06-16T10:55:23Z",
    "maturity": "Mature",
    "name": "mtProtEvol",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "Ruta",
    "publication": [
        {
            "doi": "10.1186/s12862-019-1371-x",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Heterotachy is the variation in the evolutionary rate of aligned sites in different parts of the phylogenetic tree. It occurs mainly due to epistatic interactions among the substitutions, which are highly complex and make it difficult to study protein evolution. The vast majority of computational evolutionary approaches for studying these epistatic interactions or their evolutionary consequences in proteins require high computational time. However, recently, it has been shown that the evolution of residue solvent accessibility (RSA) is tightly linked with changes in protein fitness and intra-protein epistatic interactions. This provides a computationally fast alternative, based on comparison of evolutionary rates of amino acid replacements with the rates of RSA evolutionary changes in order to recognize any shifts in epistatic interaction. Results: Based on RSA information, data randomization and phylogenetic approaches, we constructed a software pipeline, which can be used to analyze the evolutionary consequences of intra-protein epistatic interactions with relatively low computational time. We analyzed the evolution of 512 protein families tightly linked to mitochondrial function in Vertebrates and created \"mtProtEvol\", the web resource with data on protein evolution. In strict agreement with lifespan and metabolic rate data, we demonstrated that different functional categories of mitochondria-related proteins subjected to selection on accelerated and decelerated RSA rates in rodents and primates. For example, accelerated RSA evolution in rodents has been shown for Krebs cycle enzymes, respiratory chain and reactive oxygen species metabolism, while in primates these functions are stress-response, translation and mtDNA integrity. Decelerated RSA evolution in rodents has been demonstrated for translational machinery and oxidative stress response components. Conclusions: mtProtEvol is an interactive resource focused on evolutionary analysis of epistatic interactions in protein families involved in Vertebrata mitochondria function and available at http://bioinfodbs.kantiana.ru/mtProtEvol/. This resource and the devised software pipeline may be useful tool for researchers in area of protein evolution.",
                "authors": [
                    {
                        "name": "Kuzminkova A.A."
                    },
                    {
                        "name": "Sokol A.D."
                    },
                    {
                        "name": "Ushakova K.E."
                    },
                    {
                        "name": "Popadin K.Y."
                    },
                    {
                        "name": "Gunbin K.V."
                    }
                ],
                "citationCount": 2,
                "date": "2019-02-26T00:00:00Z",
                "journal": "BMC Evolutionary Biology",
                "title": "MtProtEvol: The resource presenting molecular evolution analysis of proteins involved in the function of Vertebrate mitochondria"
            },
            "pmcid": "PMC6391778",
            "pmid": "30813887",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        },
        {
            "term": "Protein expression",
            "uri": "http://edamontology.org/topic_0108"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        }
    ]
}