{"credit":[{"email":"sigven@ifi.uio.no","name":"Sigve Nakken","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"https://github.com/sigven/pcgr"}],"function":[{"operation":[{"term":"Genome annotation","uri":"http://edamontology.org/operation_0362"},{"term":"Genetic variation analysis","uri":"http://edamontology.org/operation_3197"}]}],"labels":{"language":["R","Python"],"license":"MIT","operatingSystem":["Linux","Mac"],"toolType":["Command-line tool"],"topic":[{"term":"Oncology","uri":"http://edamontology.org/topic_2640"},{"term":"Genomics","uri":"http://edamontology.org/topic_0622"},{"term":"Biotherapeutics","uri":"http://edamontology.org/topic_3374"},{"term":"Genetic variation","uri":"http://edamontology.org/topic_0199"},{"term":"DNA structural variation","uri":"http://edamontology.org/topic_3175"}]},"publication":[{"abstract":"© The Author(s) 2017. Published by Oxford University Press. Summary Individual tumor genomes pose a major challenge for clinical interpretation due to their unique sets of acquired mutations. There is a general scarcity of tools that can (i) systematically interrogate cancer genomes in the context of diagnostic, prognostic, and therapeutic biomarkers, (ii) prioritize and highlight the most important findings and (iii) present the results in a format accessible to clinical experts. We have developed a stand-alone, open-source software package for somatic variant annotation that integrates a comprehensive set of knowledge resources related to tumor biology and therapeutic biomarkers, both at the gene and variant level. Our application generates a tiered report that will aid the interpretation of individual cancer genomes in a clinical setting. Availability and implementation The software is implemented in Python/R, and is freely available through Docker technology. Documentation, example reports, and installation instructions are accessible via the project GitHub page: https://github.com/sigven/pcgr.","authors":["Nakken S.","Fournous G.","Vodak D.","Aasheim L.B.","Myklebost O.","Hovig E."],"cit_count":1,"doi":"10.1093/bioinformatics/btx817","journal":"Bioinformatics","title":"Personal Cancer Genome Reporter: Variant interpretation report for precision oncology","year":"2018-05-15"}],"summary":{"biotoolsCURIE":"biotools:pcgr","biotoolsID":"pcgr","description":"Stand-alone software package for functional annotation and translation of individual cancer genomes for precision oncology. It interprets both somatic SNVs/InDels and copy number aberrations.","homepage":"https://github.com/sigven/pcgr","name":"PCGR"}}