{
    "additionDate": "2015-08-03T09:36:18Z",
    "biotoolsCURIE": "biotools:tnrs",
    "biotoolsID": "tnrs",
    "credit": [
        {
            "name": "BioCatalogue",
            "typeEntity": "Project",
            "typeRole": [
                "Documentor"
            ],
            "url": "https://www.biocatalogue.org"
        },
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.iplantcollaborative.org/contact"
        }
    ],
    "description": "Online application for automated and user-supervised standardization of plant scientific names.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://tnrs.iplantcollaborative.org/about.html#api"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                }
            ]
        }
    ],
    "homepage": "http://tnrs.iplantcollaborative.org/about.html#api",
    "lastUpdate": "2018-12-10T12:58:51Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "https://www.biocatalogue.org/services/3739"
        }
    ],
    "name": "Taxonomic Name Resolution Service (TNRS)",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "BioCatalogue",
    "publication": [
        {
            "doi": "10.1186/1471-2105-14-16",
            "metadata": {
                "abstract": "Background: The digitization of biodiversity data is leading to the widespread application of taxon names that are superfluous, ambiguous or incorrect, resulting in mismatched records and inflated species numbers. The ultimate consequences of misspelled names and bad taxonomy are erroneous scientific conclusions and faulty policy decisions. The lack of tools for correcting this 'names problem' has become a fundamental obstacle to integrating disparate data sources and advancing the progress of biodiversity science.Results: The TNRS, or Taxonomic Name Resolution Service, is an online application for automated and user-supervised standardization of plant scientific names. The TNRS builds upon and extends existing open-source applications for name parsing and fuzzy matching. Names are standardized against multiple reference taxonomies, including the Missouri Botanical Garden's Tropicos database. Capable of processing thousands of names in a single operation, the TNRS parses and corrects misspelled names and authorities, standardizes variant spellings, and converts nomenclatural synonyms to accepted names. Family names can be included to increase match accuracy and resolve many types of homonyms. Partial matching of higher taxa combined with extraction of annotations, accession numbers and morphospecies allows the TNRS to standardize taxonomy across a broad range of active and legacy datasets.Conclusions: We show how the TNRS can resolve many forms of taxonomic semantic heterogeneity, correct spelling errors and eliminate spurious names. As a result, the TNRS can aid the integration of disparate biological datasets. Although the TNRS was developed to aid in standardizing plant names, its underlying algorithms and design can be extended to all organisms and nomenclatural codes. The TNRS is accessible via a web interface at http://tnrs.iplantcollaborative.org/ and as a RESTful web service and application programming interface. Source code is available at https://github.com/iPlantCollaborativeOpenSource/TNRS/. © 2013 Boyle et al.; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Boyle B."
                    },
                    {
                        "name": "Hopkins N."
                    },
                    {
                        "name": "Lu Z."
                    },
                    {
                        "name": "Raygoza Garay J.A."
                    },
                    {
                        "name": "Mozzherin D."
                    },
                    {
                        "name": "Rees T."
                    },
                    {
                        "name": "Matasci N."
                    },
                    {
                        "name": "Narro M.L."
                    },
                    {
                        "name": "Piel W.H."
                    },
                    {
                        "name": "Mckay S.J."
                    },
                    {
                        "name": "Lowry S."
                    },
                    {
                        "name": "Freeland C."
                    },
                    {
                        "name": "Peet R.K."
                    },
                    {
                        "name": "Enquist B.J."
                    }
                ],
                "citationCount": 227,
                "date": "2013-01-16T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "The taxonomic name resolution service: An online tool for automated standardization of plant names"
            }
        }
    ],
    "toolType": [
        "Web API"
    ],
    "topic": [
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        }
    ],
    "validated": 1,
    "version": [
        "1"
    ]
}