{
    "additionDate": "2021-01-18T10:53:52Z",
    "biotoolsCURIE": "biotools:crustybase",
    "biotoolsID": "crustybase",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "chyde@crustybase.org",
            "name": "Cameron J. Hyde",
            "orcidid": "https://orcid.org/0000-0002-5913-9766",
            "typeEntity": "Person"
        }
    ],
    "description": "CrustyBase is an interactive online database for crustacean transcriptomes. CrustyBase provides an environment for navigating and visualising crustacean transcriptome datasets. Users can search existing transcriptomes or import new datasets of their own.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                },
                {
                    "term": "RNA-Seq analysis",
                    "uri": "http://edamontology.org/operation_3680"
                }
            ]
        }
    ],
    "homepage": "https://crustybase.org",
    "lastUpdate": "2021-02-18T16:21:24Z",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "https://crustybase.org/blast"
        }
    ],
    "name": "CrustyBase",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1186/S12864-020-07063-2",
            "metadata": {
                "abstract": "© 2020 The Author(s).Transcriptome sequencing has opened the field of genomics to a wide variety of researchers, owing to its efficiency, applicability across species and ability to quantify gene expression. The resulting datasets are a rich source of information that can be mined for many years into the future, with each dataset providing a unique angle on a specific context in biology. Maintaining accessibility to this accumulation of data presents quite a challenge for researchers. The primary focus of conventional genomics databases is the storage, navigation and interpretation of sequence data, which is typically classified down to the level of a species or individual. The addition of expression data adds a new dimension to this paradigm - the sampling context. Does gene expression describe different tissues, a temporal distribution or an experimental treatment? These data not only describe an individual, but the biological context surrounding that individual. The structure and utility of a transcriptome database must therefore reflect these attributes. We present an online database which has been designed to maximise the accessibility of crustacean transcriptome data by providing intuitive navigation within and between datasets and instant visualization of gene expression and protein structure. The site is accessible at https://crustybase.org and currently holds 10 datasets from a range of crustacean species. It also allows for upload of novel transcriptome datasets through a simple web interface, allowing the research community to contribute their own data to a pool of shared knowledge.",
                "authors": [
                    {
                        "name": "Hyde C.J."
                    },
                    {
                        "name": "Fitzgibbon Q.P."
                    },
                    {
                        "name": "Elizur A."
                    },
                    {
                        "name": "Smith G.G."
                    },
                    {
                        "name": "Ventura T."
                    }
                ],
                "citationCount": 1,
                "date": "2020-09-14T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "CrustyBase: An interactive online database for crustacean transcriptomes"
            },
            "pmcid": "PMC7490944",
            "pmid": "32928113"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Biological databases",
            "uri": "http://edamontology.org/topic_3071"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        }
    ]
}