{
    "additionDate": "2020-01-09T17:43:31Z",
    "biotoolsCURIE": "biotools:PolyASite",
    "biotoolsID": "PolyASite",
    "confidence_flag": "tool",
    "description": "a consolidated atlas of polyadenylation sites from 3' end sequencing.\n\nA portal to the curated set of poly(A) sites that we inferred in the human, mouse and worm genomes, based on all 3’ end sequencing datasets that we could identify in the SRA nucleotide database as of June 2019.\n\nLearn more about the techniques used for 3' end sequencing.\n\nSamples contributing to our atlases.\n\nGet details on any sample we used for building our atlases. You can also filter, either by organism or by protocol, or just try a search term.\n\nSearch for poly(A) sites in your gene/genomic region of interest.\n\nIn the 2P-Seq protocol, reverse transcription is accomplished by an anchored oligo(dT) primer.\n\nThe Atlas - our curated dataset of poly(A) sites - can be downloaded or explored in the UCSC genome browser.\n\nIf you use PolyASite in your work, please cite:.\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'PolyASite 2.0'",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "PolyA signal detection",
                    "uri": "http://edamontology.org/operation_0428"
                },
                {
                    "term": "Genome visualisation",
                    "uri": "http://edamontology.org/operation_3208"
                },
                {
                    "term": "Reverse complement",
                    "uri": "http://edamontology.org/operation_0363"
                }
            ]
        }
    ],
    "homepage": "https://polyasite.unibas.ch",
    "lastUpdate": "2020-12-05T13:18:09.523684Z",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "https://polyasite.unibas.ch/protocols"
        },
        {
            "type": [
                "Other"
            ],
            "url": "https://polyasite.unibas.ch/samples"
        },
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/zavolanlab/PAQR_KAPAC"
        }
    ],
    "name": "PolyASite",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/NAR/GKZ918",
            "metadata": {
                "abstract": "© 2019 The Author(s) 2019. Published by Oxford University Press on behalf of Nucleic Acids Research.Generated by 3′ end cleavage and polyadenylation at alternative polyadenylation (poly(A)) sites, alternative terminal exons account for much of the variation between human transcript isoforms. More than a dozen protocols have been developed so far for capturing and sequencing RNA 3′ ends from a variety of cell types and species. In previous studies, we have used these data to uncover novel regulatory signals and cell type-specific isoforms. Here we present an update of the PolyASite (https://polyasite.unibas.ch) resource of poly(A) sites, constructed from publicly available human, mouse and worm 3′ end sequencing datasets by enforcing uniform quality measures, including the flagging of putative internal priming sites. Through integrated processing of all data, we identified and clustered sites that are closely spaced and share polyadenylation signals, as these are likely the result of stochastic variations in processing. For each cluster, we identified the representative-most frequently processed-site and estimated the relative use in the transcriptome across all samples. We have established a modern web portal for efficient finding, exploration and export of data. Database generation is fully automated, greatly facilitating incorporation of new datasets and the updating of underlying genome resources.",
                "authors": [
                    {
                        "name": "Herrmann C.J."
                    },
                    {
                        "name": "Schmidt R."
                    },
                    {
                        "name": "Kanitz A."
                    },
                    {
                        "name": "Artimo P."
                    },
                    {
                        "name": "Gruber A.J."
                    },
                    {
                        "name": "Zavolan M."
                    }
                ],
                "citationCount": 3,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "PolyASite 2.0: A consolidated atlas of polyadenylation sites from 3′ end sequencing"
            },
            "pmid": "31617559"
        }
    ],
    "topic": [
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        },
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        }
    ]
}