{
    "additionDate": "2021-01-18T09:34:01Z",
    "biotoolsCURIE": "biotools:bagel2-bayesian",
    "biotoolsID": "bagel2-bayesian",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "traver@hart-lab.org",
            "name": "Traver Hart",
            "typeEntity": "Person"
        }
    ],
    "description": "The Bayesian Analysis of Gene Essentiality 2 (BAGEL2) is a robust gene essentiality identifier from CRISPR-cas9 genome wide pooled library screen data.",
    "editPermission": {
        "type": "private"
    },
    "homepage": "https://github.com/hart-lab/bagel",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T20:46:24.860600Z",
    "license": "MIT",
    "name": "BAGEL2",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1186/s13073-020-00809-3",
            "metadata": {
                "abstract": "Background: Identifying essential genes in genome-wide loss-of-function screens is a critical step in functional genomics and cancer target finding. We previously described the Bayesian Analysis of Gene Essentiality (BAGEL) algorithm for accurate classification of gene essentiality from short hairpin RNA and CRISPR/Cas9 genome-wide genetic screens. Results: We introduce an updated version, BAGEL2, which employs an improved model that offers a greater dynamic range of Bayes Factors, enabling detection of tumor suppressor genes; a multi-target correction that reduces false positives from off-target CRISPR guide RNA; and the implementation of a cross-validation strategy that improves performance ~ 10× over the prior bootstrap resampling approach. We also describe a metric for screen quality at the replicate level and demonstrate how different algorithms handle lower quality data in substantially different ways. Conclusions: BAGEL2 substantially improves the sensitivity, specificity, and performance over BAGEL and establishes the new state of the art in the analysis of CRISPR knockout fitness screens. BAGEL2 is written in Python 3 and source code, along with all supporting files, are available on github (https://github.com/hart-lab/bagel).",
                "authors": [
                    {
                        "name": "Hart T."
                    },
                    {
                        "name": "Kim E."
                    }
                ],
                "citationCount": 55,
                "date": "2021-12-01T00:00:00Z",
                "journal": "Genome Medicine",
                "title": "Improved analysis of CRISPR fitness screens and reduced off-target effects with the BAGEL2 gene essentiality classifier"
            },
            "pmcid": "PMC7789424",
            "pmid": "33407829",
            "type": [
                "Primary"
            ]
        },
        {
            "doi": "10.1101/2020.05.30.125526",
            "type": [
                "Primary"
            ]
        }
    ],
    "topic": [
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ]
}
