{
    "accessibility": [],
    "additionDate": "2017-02-14T09:36:00Z",
    "biotoolsCURIE": "biotools:endeavour",
    "biotoolsID": "endeavour",
    "collectionID": [],
    "confidence_flag": null,
    "cost": null,
    "credit": [
        {
            "email": null,
            "gridid": null,
            "name": "Contact Form",
            "note": null,
            "orcidid": null,
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://endeavour.esat.kuleuven.be/Contact.aspx"
        }
    ],
    "description": "ENDEAVOUR is a computational approach to prioritize candidate genes for further study. Users input training genes already known to be involved in the process under study and the candidate genes to prioritize. The web server supports multiple species and integrates multiple genomic data to generate the final prioritization.  ENDEAVOUR has been benchmarked in silico and experimentally validated leading to the discovery of novel disease genes in several genetic diseases.",
    "documentation": [
        {
            "note": null,
            "type": "User manual",
            "url": "https://endeavour.esat.kuleuven.be/files/endeavour_manual/EndeavourWebServerManual.html"
        }
    ],
    "download": [],
    "editPermission": {
        "authors": [],
        "type": "private"
    },
    "elixirNode": [],
    "elixirPlatform": [],
    "elixir_badge": 0,
    "function": [
        {
            "cmd": null,
            "input": [],
            "note": null,
            "operation": [
                {
                    "term": "Data handling",
                    "uri": "http://edamontology.org/operation_2409"
                },
                {
                    "term": "Validation",
                    "uri": "http://edamontology.org/operation_2428"
                }
            ],
            "output": []
        }
    ],
    "homepage": "https://endeavour.esat.kuleuven.be/",
    "homepage_status": 0,
    "language": [
        "PHP",
        "Java"
    ],
    "lastUpdate": "2018-12-10T12:58:53Z",
    "license": null,
    "link": [],
    "maturity": null,
    "name": "ENDEAVOUR",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "otherID": [],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "doi": null,
            "metadata": {
                "abstract": "Endeavour (http://www.esat.kuleuven.be/endeavourweb; this web site is free and open to all users and there is no login requirement) is a web resource for the prioritization of candidate genes. Using a training set of genes known to be involved in a biological process of interest, our approach consists of (i) inferring several models (based on various genomic data sources), (ii) applying each model to the candidate genes to rank those candidates against the profile of the known genes and (iii) merging the several rankings into a global ranking of the candidate genes. In the present article, we describe the latest developments of Endeavour. First, we provide a web-based user interface, besides our Java client, to make Endeavour more universally accessible. Second, we support multiple species: in addition to Homo sapiens, we now provide gene prioritization for three major model organisms: Mus musculus, Rattus norvegicus and Caenorhabditis elegans. Third, Endeavour makes use of additional data sources and is now including numerous databases: ontologies and annotations, protein-protein interactions, cis-regulatory information, gene expression data sets, sequence information and text-mining data. We tested the novel version of Endeavour on 32 recent disease gene associations from the literature. Additionally, we describe a number of recent independent studies that made use of Endeavour to prioritize candidate genes for obesity and Type II diabetes, cleft lip and cleft palate, and pulmonary fibrosis.",
                "authors": [
                    {
                        "name": "Tranchevent L.C."
                    },
                    {
                        "name": "Barriot R."
                    },
                    {
                        "name": "Yu S."
                    },
                    {
                        "name": "Van Vooren S."
                    },
                    {
                        "name": "Van Loo P."
                    },
                    {
                        "name": "Coessens B."
                    },
                    {
                        "name": "De Moor B."
                    },
                    {
                        "name": "Aerts S."
                    },
                    {
                        "name": "Moreau Y."
                    }
                ],
                "citationCount": 168,
                "date": "2008-01-01T00:00:00Z",
                "journal": "Nucleic acids research",
                "title": "ENDEAVOUR update: a web resource for gene prioritization in multiple species."
            },
            "note": null,
            "pmcid": null,
            "pmid": "18508807",
            "type": null,
            "version": null
        },
        {
            "doi": null,
            "metadata": {
                "abstract": "The identification of genes involved in health and disease remains a challenge. We describe a bioinformatics approach, together with a freely accessible, interactive and flexible software termed Endeavour, to prioritize candidate genes underlying biological processes or diseases, based on their similarity to known genes involved in these phenomena. Unlike previous approaches, ours generates distinct prioritizations for multiple heterogeneous data sources, which are then integrated, or fused, into a global ranking using order statistics. In addition, it offers the flexibility of including additional data sources. Validation of our approach revealed it was able to efficiently prioritize 627 genes in disease data sets and 76 genes in biological pathway sets, identify candidates of 16 mono- or polygenic diseases, and discover regulatory genes of myeloid differentiation. Furthermore, the approach identified a novel gene involved in craniofacial development from a 2-Mb chromosomal region, deleted in some patients with DiGeorge-like birth defects. The approach described here offers an alternative integrative method for gene discovery. © 2006 Nature Publishing Group.",
                "authors": [
                    {
                        "name": "Aerts S."
                    },
                    {
                        "name": "Lambrechts D."
                    },
                    {
                        "name": "Maity S."
                    },
                    {
                        "name": "Van Loo P."
                    },
                    {
                        "name": "Coessens B."
                    },
                    {
                        "name": "De Smet F."
                    },
                    {
                        "name": "Tranchevent L.-C."
                    },
                    {
                        "name": "De Moor B."
                    },
                    {
                        "name": "Marynen P."
                    },
                    {
                        "name": "Hassan B."
                    },
                    {
                        "name": "Carmeliet P."
                    },
                    {
                        "name": "Moreau Y."
                    }
                ],
                "citationCount": 604,
                "date": "2006-05-01T00:00:00Z",
                "journal": "Nature Biotechnology",
                "title": "Gene prioritization through genomic data fusion"
            },
            "note": null,
            "pmcid": null,
            "pmid": "16680138",
            "type": null,
            "version": null
        }
    ],
    "relation": [],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        },
        {
            "term": "Experimental design and studies",
            "uri": "http://edamontology.org/topic_3678"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        }
    ],
    "validated": 1,
    "version": []
}