{
    "additionDate": "2021-03-19T09:06:53Z",
    "biotoolsCURIE": "biotools:coverifi",
    "biotoolsID": "coverifi",
    "collectionID": [
        "COVID-19"
    ],
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "dhiraj.murthy@austin.utexas.edu",
            "name": "Dhiraj Murthy",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "CoVerifi is a COVID-19 news verification system. It is a web application which combines both the power of machine learning and the power of human feedback to assess the credibility of news. By allowing users the ability to “vote” on news content, the CoVerifi platform enables the release of labelled data as open source, which will enable further research on preventing the spread of COVID-19-related misinformation.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Text mining",
                    "uri": "http://edamontology.org/operation_0306"
                }
            ]
        }
    ],
    "homepage": "https://coverifi.web.app/",
    "language": [
        "JavaScript",
        "Python"
    ],
    "lastUpdate": "2021-05-05T07:27:26Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/nlkolluri/CoVerifi"
        }
    ],
    "name": "CoVerifi",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1016/J.OSNEM.2021.100123",
            "metadata": {
                "abstract": "© 2021 Elsevier B.V.There is an abundance of misinformation, disinformation, and “fake news” related to COVID-19, leading the director-general of the World Health Organization to term this an ‘infodemic’. Given the high volume of COVID-19 content on the Internet, many find it difficult to evaluate veracity. Vulnerable and marginalized groups are being misinformed and subject to high levels of stress. Riots and panic buying have also taken place due to “fake news”. However, individual research-led websites can make a major difference in terms of providing accurate information. For example, the Johns Hopkins Coronavirus Resource Center website has over 81 million entries linked to it on Google. With the outbreak of COVID-19 and the knowledge that deceptive news has the potential to measurably affect the beliefs of the public, new strategies are needed to prevent the spread of misinformation. This study seeks to make a timely intervention to the information landscape through a COVID-19 “fake news”, misinformation, and disinformation website. In this article, we introduce CoVerifi, a web application which combines both the power of machine learning and the power of human feedback to assess the credibility of news. By allowing users the ability to “vote” on news content, the CoVerifi platform will allow us to release labelled data as open source, which will enable further research on preventing the spread of COVID-19-related misinformation. We discuss the development of CoVerifi and the potential utility of deploying the system at scale for combating the COVID-19 “infodemic”.",
                "authors": [
                    {
                        "name": "Kolluri N.L."
                    },
                    {
                        "name": "Murthy D."
                    }
                ],
                "date": "2021-03-01T00:00:00Z",
                "journal": "Online Social Networks and Media",
                "title": "CoVerifi: A COVID-19 news verification system"
            },
            "pmcid": "PMC7825993",
            "pmid": "33521412"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ]
}