{
    "additionDate": "2017-12-18T00:08:18Z",
    "biotoolsCURIE": "biotools:lrmotifs",
    "biotoolsID": "lrmotifs",
    "credit": [
        {
            "email": "dsimcha@gmail.com",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "LRMotifs is a novel method of DNA sequence motif discovery based on logistic regression and rigorous hypothesis testing.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence motif discovery",
                    "uri": "http://edamontology.org/operation_0238"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Motif discovery",
                    "uri": "http://edamontology.org/operation_0238"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Regression",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "http://code.google.com/p/likelihood-ratio-motifs/",
    "language": [
        "D"
    ],
    "lastUpdate": "2018-12-10T12:58:57Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/lrmotifs-logistic-regression-based-dna-motif-discovery.html"
        }
    ],
    "name": "LRMotifs",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1371/journal.pone.0047836",
            "metadata": {
                "abstract": "A major challenge in molecular biology is reverse-engineering the cis-regulatory logic that plays a major role in the control of gene expression. This program includes searching through DNA sequences to identify \"motifs\" that serve as the binding sites for transcription factors or, more generally, are predictive of gene expression across cellular conditions. Several approaches have been proposed for de novo motif discovery-searching sequences without prior knowledge of binding sites or nucleotide patterns. However, unbiased validation is not straightforward. We consider two approaches to unbiased validation of discovered motifs: testing the statistical significance of a motif using a DNA \"background\" sequence model to represent the null hypothesis and measuring performance in predicting membership in gene clusters. We demonstrate that the background models typically used are \"too null,\" resulting in overly optimistic assessments of significance, and argue that performance in predicting TF binding or expression patterns from DNA motifs should be assessed by held-out data, as in predictive learning. Applying this criterion to common motif discovery methods resulted in universally poor performance, although there is a marked improvement when motifs are statistically significant against real background sequences. Moreover, on synthetic data where \"ground truth\" is known, discriminative performance of all algorithms is far below the theoretical upper bound, with pronounced \"over-fitting\" in training. A key conclusion from this work is that the failure of de novo discovery approaches to accurately identify motifs is basically due to statistical intractability resulting from the fixed size of co-regulated gene clusters, and thus such failures do not necessarily provide evidence that unfound motifs are not active biologically. Consequently, the use of prior knowledge to enhance motif discovery is not just advantageous but necessary. An implementation of the LR and ALR algorithms is available at http://code.google.com/p/likelihood-ratio-motifs/. © 2012 Simcha et al.",
                "authors": [
                    {
                        "name": "Simcha D."
                    },
                    {
                        "name": "Price N.D."
                    },
                    {
                        "name": "Geman D."
                    }
                ],
                "citationCount": 17,
                "date": "2012-11-07T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "The Limits of De Novo DNA Motif Discovery"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        }
    ],
    "validated": 1,
    "version": [
        "1.0"
    ]
}