{
    "accessibility": "Open access",
    "additionDate": "2023-01-17T21:25:33.219115Z",
    "biotoolsCURIE": "biotools:jupytope",
    "biotoolsID": "jupytope",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "asckkwoh@ntu.edu.sg",
            "name": "Kwoh Chee Keong",
            "typeEntity": "Person"
        },
        {
            "name": "Ng Teng Ann"
        },
        {
            "name": "Shamima Rashid"
        }
    ],
    "description": "Computational extraction of structural properties of viral epitopes.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Epitope mapping",
                    "uri": "http://edamontology.org/operation_0416"
                },
                {
                    "term": "Side chain modelling",
                    "uri": "http://edamontology.org/operation_0480"
                },
                {
                    "term": "Small molecule design",
                    "uri": "http://edamontology.org/operation_4009"
                }
            ]
        }
    ],
    "homepage": "https://github.com/shamimarashid/Jupytope",
    "language": [
        "Python"
    ],
    "lastUpdate": "2023-01-17T21:25:33.221668Z",
    "license": "GPL-3.0",
    "name": "Jupytope",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1093/bib/bbac362",
            "metadata": {
                "abstract": "© The Author(s) 2022. Published by Oxford University Press. All rights reserved. For Permissions, please email: journals.permissions@oup.com.Epitope residues located on viral surface proteins are of immense interest in immunology and related applications such as vaccine development, disease diagnosis and drug design. Most tools rely on sequence-based statistical comparisons, such as information entropy of residue positions in aligned columns to infer location and properties of epitope sites. To facilitate cross-structural comparisons of epitopes on viral surface proteins, a python-based extraction tool implemented with Jupyter notebook is presented (Jupytope). Given a viral antigen structure of interest, a list of known epitope sites and a reference structure, the corresponding epitope structural properties can quickly be obtained. The tool integrates biopython modules for commonly used software such as NACCESS, DSSP as well as residue depth and outputs a list of structure-derived properties such as dihedral angles, solvent accessibility, residue depth and secondary structure that can be saved in several convenient data formats. To ensure correct spatial alignment, Jupytope takes a list of given epitope sites and their corresponding reference structure and aligns them before extracting the desired properties. Examples are demonstrated for epitopes of Influenza and severe acute respiratory syndrome coronavirus 2 (SARS-CoV2) viral strains. The extracted properties assist detection of two Influenza subtypes and show potential in distinguishing between four major clades of SARS-CoV2, as compared with randomized labels. The tool will facilitate analytical and predictive works on viral epitopes through the extracted structural information. Jupytope and extracted datasets are available at https://github.com/shamimarashid/Jupytope.",
                "authors": [
                    {
                        "name": "Kwoh C.K."
                    },
                    {
                        "name": "Ng T.A."
                    },
                    {
                        "name": "Rashid S."
                    }
                ],
                "date": "2022-11-19T00:00:00Z",
                "journal": "Briefings in bioinformatics",
                "title": "Jupytope: computational extraction of structural properties of viral epitopes"
            },
            "pmid": "36094101"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Immunoproteins and antigens",
            "uri": "http://edamontology.org/topic_2830"
        },
        {
            "term": "Protein structural motifs and surfaces",
            "uri": "http://edamontology.org/topic_0166"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Vaccinology",
            "uri": "http://edamontology.org/topic_3966"
        }
    ],
    "validated": 1
}
