{
    "additionDate": "2022-09-30T11:26:51.448184Z",
    "biotoolsCURIE": "biotools:ccimpute",
    "biotoolsID": "ccimpute",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "mamalec@indiana.edu",
            "name": "Marcin Malec",
            "typeEntity": "Person"
        },
        {
            "name": "Mehmet Dalkilic"
        }
    ],
    "description": "the ccImpute R package is an effective algorithm to correct for dropout events and improve downstream analysis of scRNA-seq data",
    "download": [
        {
            "type": "Test data",
            "url": "https://github.com/khazum/ccImputeDatasets"
        }
    ],
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                },
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "Imputation",
                    "uri": "http://edamontology.org/operation_3557"
                }
            ]
        }
    ],
    "homepage": "https://github.com/khazum/ccImpute",
    "language": [
        "C++",
        "R"
    ],
    "lastUpdate": "2024-11-24T15:33:23.838400Z",
    "license": "Not licensed",
    "name": "ccImpute",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1186/s12859-022-04814-8",
            "metadata": {
                "abstract": "Background: In recent years, the introduction of single-cell RNA sequencing (scRNA-seq) has enabled the analysis of a cell’s transcriptome at an unprecedented granularity and processing speed. The experimental outcome of applying this technology is a M× N matrix containing aggregated mRNA expression counts of M genes and N cell samples. From this matrix, scientists can study how cell protein synthesis changes in response to various factors, for example, disease versus non-disease states in response to a treatment protocol. This technology’s critical challenge is detecting and accurately recording lowly expressed genes. As a result, low expression levels tend to be missed and recorded as zero - an event known as dropout. This makes the lowly expressed genes indistinguishable from true zero expression and different than the low expression present in cells of the same type. This issue makes any subsequent downstream analysis difficult. Results: To address this problem, we propose an approach to measure cell similarity using consensus clustering and demonstrate an effective and efficient algorithm that takes advantage of this new similarity measure to impute the most probable dropout events in the scRNA-seq datasets. We demonstrate that our approach exceeds the performance of existing imputation approaches while introducing the least amount of new noise as measured by clustering performance characteristics on datasets with known cell identities. Conclusions: ccImpute is an effective algorithm to correct for dropout events and thus improve downstream analysis of scRNA-seq data. ccImpute is implemented in R and is available at https://github.com/khazum/ccImpute.",
                "authors": [
                    {
                        "name": "Dalkilic M."
                    },
                    {
                        "name": "Kurban H."
                    },
                    {
                        "name": "Malec M."
                    }
                ],
                "citationCount": 5,
                "date": "2022-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "ccImpute: an accurate and scalable consensus clustering based algorithm to impute dropout events in the single-cell RNA-seq data"
            },
            "pmcid": "PMC9306045",
            "pmid": "35869420"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ],
    "validated": 1
}
