{
    "additionDate": "2017-08-03T19:06:47Z",
    "biotoolsCURIE": "biotools:mgsz",
    "biotoolsID": "mgsz",
    "credit": [
        {
            "email": "pashupati.mishra@helsinki.fi",
            "name": "Pashupati Mishra",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://ekhidna.biocenter.helsinki.fi/"
        }
    ],
    "description": "Gene set analysis method based on GSZ (Gene Set Z-score) statistics and asymptotic p-value. It is different from the standard GSZ method in that it assigns asymptotic p-values to the gene set scores instead of empirical p-values.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://ekhidna.biocenter.helsinki.fi/downloads/pashupati/mGSZ.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene set testing",
                    "uri": "http://edamontology.org/operation_3224"
                }
            ]
        }
    ],
    "homepage": "http://ekhidna.biocenter.helsinki.fi/downloads/pashupati/mGSZ.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-10T12:58:50Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/mgsz-1-0-gsz-gene-set-analysis-methods-based-on-gsz-statistics.html"
        }
    ],
    "name": "mGSZ",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "© 2014 The Author.Motivation: Gene set analysis is the analysis of a set of genes that collectively contribute to a biological process. Most popular gene set analysis methods are based on empirical P-value that requires large number of permutations. Despite numerous gene set analysis methods developed in the past decade, the most popular methods still suffer from serious limitations. Results: We present a gene set analysis method (mGSZ) based on Gene Set Z-scoring function (GSZ) and asymptotic P-values. Asymptotic P-value calculation requires fewer permutations, and thus speeds up the gene set analysis process. We compare the GSZ-scoring function with seven popular gene set scoring functions and show that GSZ stands out as the best scoring function. In addition, we show improved performance of the GSA method when the max-mean statistics is replaced by the GSZ scoring function. We demonstrate the importance of both gene and sample permutations by showing the consequences in the absence of one or the other. A comparison of asymptotic and empirical methods of P-value estimation demonstrates a clear advantage of asymptotic P-value over empirical P-value. We show that mGSZ outperforms the state-of-the-art methods based on two different evaluations. We compared mGSZ results with permutation and rotation tests and show that rotation does not improve our asymptotic P-values. We also propose well-known asymptotic distribution models for three of the compared methods.",
                "authors": [
                    {
                        "name": "Mishra P."
                    },
                    {
                        "name": "Toronen P."
                    },
                    {
                        "name": "Leino Y."
                    },
                    {
                        "name": "Holm L."
                    }
                ],
                "citationCount": 10,
                "date": "2014-01-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Gene set analysis: Limitations in popular existing methods and proposed improvements"
            },
            "pmid": "24903419"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        },
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        }
    ],
    "validated": 1
}