{
    "additionDate": "2021-11-20T07:22:26.248619Z",
    "biotoolsCURIE": "biotools:chip-gsm",
    "biotoolsID": "chip-gsm",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "xuan@vt.edu",
            "name": "Jianhua Xuan",
            "orcidid": "https://orcid.org/0000-0001-7256-1374",
            "typeEntity": "Person"
        }
    ],
    "description": "Inferring active transcription factor modules to predict functional regulatory elements.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Transcriptional regulatory element prediction",
                    "uri": "http://edamontology.org/operation_0438"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                },
                {
                    "term": "Phylogenetic footprinting",
                    "uri": "http://edamontology.org/operation_0327"
                }
            ]
        }
    ],
    "homepage": "https://sourceforge.net/projects/chipgsm/",
    "lastUpdate": "2021-11-20T07:22:26.251093Z",
    "name": "ChIP-GSM",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PCBI.1009203",
            "metadata": {
                "abstract": "© 2021 Chen et al.Transcription factors (TFs) often function as a module including both master factors and mediators binding at cis-regulatory regions to modulate nearby gene transcription. ChIPseq profiling of multiple TFs makes it feasible to infer functional TF modules. However, when inferring TF modules based on co-localization of ChIP-seq peaks, often many weak binding events are missed, especially for mediators, resulting in incomplete identification of modules. To address this problem, we develop a ChIP-seq data-driven Gibbs Sampler to infer Modules (ChIP-GSM) using a Bayesian framework that integrates ChIP-seq profiles of multiple TFs. ChIP-GSM samples read counts of module TFs iteratively to estimate the binding potential of a module to each region and, across all regions, estimates the module abundance. Using inferred module-region probabilistic bindings as feature units, ChIP-GSM then employs logistic regression to predict active regulatory elements. Validation of ChIPGSM predicted regulatory regions on multiple independent datasets sharing the same context confirms the advantage of using TF modules for predicting regulatory activity. In a case study of K562 cells, we demonstrate that the ChIP-GSM inferred modules form as groups, activate gene expression at different time points, and mediate diverse functional cellular processes. Hence, ChIP-GSM infers biologically meaningful TF modules and improves the prediction accuracy of regulatory region activities. Copyright:",
                "authors": [
                    {
                        "name": "Chen X."
                    },
                    {
                        "name": "Neuwald A.F."
                    },
                    {
                        "name": "Hilakivi-Clarke L."
                    },
                    {
                        "name": "Clarke R."
                    },
                    {
                        "name": "Xuan J."
                    }
                ],
                "date": "2021-07-01T00:00:00Z",
                "journal": "PLoS Computational Biology",
                "title": "ChIP-GSM: Inferring active transcription factor modules to predict functional regulatory elements"
            },
            "pmcid": "PMC8330942",
            "pmid": "34292930"
        }
    ],
    "toolType": [
        "Workbench"
    ],
    "topic": [
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "ChIP-seq",
            "uri": "http://edamontology.org/topic_3169"
        },
        {
            "term": "Gene regulation",
            "uri": "http://edamontology.org/topic_0204"
        },
        {
            "term": "Tomography",
            "uri": "http://edamontology.org/topic_3452"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        }
    ]
}