{
    "additionDate": "2015-01-29T15:47:52Z",
    "biotoolsCURIE": "biotools:psi-blast",
    "biotoolsID": "psi-blast",
    "collectionID": [
        "BLAST",
        "EBI Tools",
        "Job Dispatcher Tools"
    ],
    "credit": [
        {
            "name": "EMBL-EBI",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        },
        {
            "name": "Job Dispatcher",
            "typeEntity": "Person",
            "typeRole": [
                "Developer"
            ]
        },
        {
            "name": "NCBI",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        },
        {
            "name": "Job Dispatcher Team",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://www.ebi.ac.uk/people/service-teams/"
        }
    ],
    "description": "Iterative protein sequence similarity search based on BLAST: search with a custom, position-specific, scoring matrix which can help find distant evolutionary relationships.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://www.ebi.ac.uk/Tools/sss/psiblast/"
        },
        {
            "type": [
                "Terms of use"
            ],
            "url": "http://www.ebi.ac.uk/about/terms-of-use"
        }
    ],
    "editPermission": {
        "authors": [
            "biomadeira",
            "nandana"
        ],
        "type": "group"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Protein sequence",
                        "uri": "http://edamontology.org/data_2976"
                    }
                }
            ],
            "operation": [
                {
                    "term": "Sequence similarity search",
                    "uri": "http://edamontology.org/operation_0346"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Position-specific scoring matrix",
                        "uri": "http://edamontology.org/data_2854"
                    }
                },
                {
                    "data": {
                        "term": "Sequence search results",
                        "uri": "http://edamontology.org/data_0857"
                    }
                }
            ]
        }
    ],
    "homepage": "http://www.ebi.ac.uk/Tools/sss/psiblast/",
    "lastUpdate": "2022-08-16T11:33:40.600101Z",
    "link": [
        {
            "type": [
                "Helpdesk"
            ],
            "url": "http://www.ebi.ac.uk/support/"
        }
    ],
    "name": "PSI-BLAST (EBI)",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "biomadeira",
    "publication": [
        {
            "doi": "10.1093/nar/gkac240",
            "metadata": {
                "abstract": "© 2022 The Author(s). Published by Oxford University Press on behalf of Nucleic Acids Research.The EMBL-EBI search and sequence analysis tools frameworks provide integrated access to EMBL-EBI's data resources and core bioinformatics analytical tools. EBI Search (https://www.ebi.ac.uk/ebisearch) provides a full-text search engine across nearly 5 billion entries, while the Job Dispatcher tools framework (https://www.ebi.ac.uk/services) enables the scientific community to perform a diverse range of sequence analysis using popular bioinformatics applications. Both allow users to interact through user-friendly web applications, as well as via RESTful and SOAP-based APIs. Here, we describe recent improvements to these services and updates made to accommodate the increasing data requirements during the COVID-19 pandemic.",
                "authors": [
                    {
                        "name": "Basutkar P."
                    },
                    {
                        "name": "Edbali O."
                    },
                    {
                        "name": "Kolesnikov A."
                    },
                    {
                        "name": "Lee J."
                    },
                    {
                        "name": "Lopez R."
                    },
                    {
                        "name": "Madeira F."
                    },
                    {
                        "name": "Madhusoodanan N."
                    },
                    {
                        "name": "Pearce M."
                    },
                    {
                        "name": "Tivey A.R.N."
                    }
                ],
                "citationCount": 14,
                "date": "2022-07-05T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "Search and sequence analysis tools services from EMBL-EBI in 2022"
            }
        },
        {
            "doi": "10.1006/jmbi.1999.3233",
            "metadata": {
                "abstract": "The recognition of remote protein homologies is a major aspect of the structural and functional annotation of newly determined genomes. Here we benchmark the coverage and error rate of genome annotation using the widely used homology-searching program PSI-BLAST (position-specific iterated basic local alignment search tool). This study evaluates the one-to-many success rate for recognition, as often there are several homologues in the database and only one needs to be identified for annotating the sequence. In contrast, previous benchmarks considered one-to-one recognition in which a single query was required to find a particular target. The benchmark constructs a model genome from the full sequences of the structural classification of protein (SCOP) database and searches against a target library of remote homologous domains (< 20% identity). The structural benchmark provides a reliable list of correct and false homology assignments. PSI-BLAST successfully annotated 40% of the domains in the model genome that had at least one homologue in the target library. This coverage is more than three times that if one-to-one recognition is evaluated (11% coverage of domains). Although a structural benchmark was used, the results equally apply to just sequence homology searches. Accordingly, structural and sequence assignments were made to the sequences of Mycoplasma genitalium and Mycobacterium tuberculosis (see http://www.bmm.icnet.uk). The extent of missed assignments and of new superfamilies can be estimated for these genomes for both structural and functional annotations.",
                "authors": [
                    {
                        "name": "MacCallum R.M."
                    },
                    {
                        "name": "Muller A."
                    },
                    {
                        "name": "Sternberg M.J.E."
                    }
                ],
                "citationCount": 96,
                "date": "1999-11-12T00:00:00Z",
                "journal": "Journal of Molecular Biology",
                "title": "Benchmarking PSI-BLAST in genome annotation"
            },
            "pmid": "10547299"
        },
        {
            "doi": "10.1093/nar/25.17.3389",
            "metadata": {
                "abstract": "The BLAST programs are widely used tools for searching protein and DNA databases for sequence similarities. For protein comparisons, a variety of definitional, algorithmic and statistical refinements described here permits the execution time of the BLAST programs to be decreased substantially while enhancing their sensitivity to weak similarities. A new criterion for triggering the extension of word hits, combined with a new heuristic for generating gapped alignments, yields a gapped BLAST program that runs at approximately three times the speed of the original. In addition, a method is introduced for automatically combining statistically significant alignments produced by BLAST into a position-specific score matrix, and searching the database using this matrix. The resulting Position-Specific Iterated BLAST (PSI-BLAST) program runs at approximately the same speed per iteration as gapped BLAST, but in many cases is much more sensitive to weak but biologically relevant sequence similarities. PSI-BLAST is used to uncover several new and interesting members of the BRCT superfamily.",
                "authors": [
                    {
                        "name": "Altschul S.F."
                    },
                    {
                        "name": "Lipman D.J."
                    },
                    {
                        "name": "Madden T.L."
                    },
                    {
                        "name": "Miller W."
                    },
                    {
                        "name": "Schaffer A.A."
                    },
                    {
                        "name": "Zhang J."
                    },
                    {
                        "name": "Zhang Z."
                    }
                ],
                "citationCount": 58760,
                "date": "1997-09-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "Gapped BLAST and PSI-BLAST: A new generation of protein database search programs"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        }
    ],
    "validated": 1,
    "version": [
        "1"
    ]
}
