{
    "name": "PROVEAN", 
    "description": "A software tool which predicts whether an amino acid substitution or indel has an impact on the biological function of a protein.", 
    "homepage": "http://provean.jcvi.org/index.php", 
    "biotoolsID": "provean", 
    "biotoolsCURIE": "biotools:provean", 
    "version": [], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_0361", 
                    "term": "Sequence annotation"
                }, 
                {
                    "uri": "http://edamontology.org/operation_3197", 
                    "term": "Genetic variation analysis"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Web application"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_0080", 
            "term": "Sequence analysis"
        }, 
        {
            "uri": "http://edamontology.org/topic_3120", 
            "term": "Protein variants"
        }
    ], 
    "operatingSystem": [
        "Linux", 
        "Windows", 
        "Mac"
    ], 
    "language": [
        "Shell"
    ], 
    "license": "GPL-3.0", 
    "collectionID": [
        "Animal and Crop Genomics"
    ], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [], 
    "download": [], 
    "documentation": [
        {
            "url": "http://provean.jcvi.org/index.php", 
            "type": "General", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": "10.1371/journal.pone.0046688", 
            "pmid": null, 
            "pmcid": null, 
            "type": "Primary", 
            "version": null, 
            "metadata": {
                "title": "Predicting the Functional Effect of Amino Acid Substitutions and Indels", 
                "abstract": "As next-generation sequencing projects generate massive genome-wide sequence variation data, bioinformatics tools are being developed to provide computational predictions on the functional effects of sequence variations and narrow down the search of casual variants for disease phenotypes. Different classes of sequence variations at the nucleotide level are involved in human diseases, including substitutions, insertions, deletions, frameshifts, and non-sense mutations. Frameshifts and non-sense mutations are likely to cause a negative effect on protein function. Existing prediction tools primarily focus on studying the deleterious effects of single amino acid substitutions through examining amino acid conservation at the position of interest among related sequences, an approach that is not directly applicable to insertions or deletions. Here, we introduce a versatile alignment-based score as a new metric to predict the damaging effects of variations not limited to single amino acid substitutions but also in-frame insertions, deletions, and multiple amino acid substitutions. This alignment-based score measures the change in sequence similarity of a query sequence to a protein sequence homolog before and after the introduction of an amino acid variation to the query sequence. Our results showed that the scoring scheme performs well in separating disease-associated variants (n = 21,662) from common polymorphisms (n = 37,022) for UniProt human protein variations, and also in separating deleterious variants (n = 15,179) from neutral variants (n = 17,891) for UniProt non-human protein variations. In our approach, the area under the receiver operating characteristic curve (AUC) for the human and non-human protein variation datasets is ~0.85. We also observed that the alignment-based score correlates with the deleteriousness of a sequence variation. In summary, we have developed a new algorithm, PROVEAN (Protein Variation Effect Analyzer), which provides a generalized approach to predict the functional effects of protein sequence variations including single or multiple amino acid substitutions, and in-frame insertions and deletions. The PROVEAN tool is available online at http://provean.jcvi.org. © 2012 Choi et al.", 
                "date": "2012-10-08T00:00:00Z", 
                "citationCount": 968, 
                "authors": [
                    {
                        "name": "Choi Y."
                    }, 
                    {
                        "name": "Sims G.E."
                    }, 
                    {
                        "name": "Murphy S."
                    }, 
                    {
                        "name": "Miller J.R."
                    }, 
                    {
                        "name": "Chan A.P."
                    }
                ], 
                "journal": "PLoS ONE"
            }
        }
    ], 
    "credit": [
        {
            "name": null, 
            "email": null, 
            "url": "http://provean.jcvi.org/contact.php", 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "vzn529@binf.ku.dk", 
    "additionDate": "2017-08-20T17:18:10Z", 
    "lastUpdate": "2019-01-29T12:03:50Z", 
    "editPermission": {
        "type": "group", 
        "authors": [
            "animalandcropgenomics"
        ]
    }, 
    "validated": 1, 
    "homepage_status": 0, 
    "elixir_badge": 0
}