{
    "additionDate": "2021-01-18T07:03:13Z",
    "biotoolsCURIE": "biotools:ut-aim250",
    "biotoolsID": "ut-aim250",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "cheny8@uthscsa.edu",
            "name": "Yidong Chen",
            "typeEntity": "Person"
        }
    ],
    "description": "An ancestry informative marker panel design for individual ancestry estimation of Hispanic population using whole exome sequencing data.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Sequence trimming",
                    "uri": "http://edamontology.org/operation_3192"
                },
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Linkage disequilibrium calculation",
                    "uri": "http://edamontology.org/operation_0488"
                }
            ]
        }
    ],
    "homepage": "https://github.com/chenlabgccri/UT-AIM250",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-03-10T13:20:56Z",
    "name": "UT-AIM250",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1186/S12864-019-6333-6",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Europeans and American Indians were major genetic ancestry of Hispanics in the U.S. These ancestral groups have markedly different incidence rates and outcomes in many types of cancers. Therefore, the genetic admixture may cause biased genetic association study with cancer susceptibility variants specifically in Hispanics. For example, the incidence rate of liver cancer has been shown with substantial disparity between Hispanic, Asian and non-Hispanic white populations. Currently, ancestry informative marker (AIM) panels have been widely utilized with up to a few hundred ancestry-informative single nucleotide polymorphisms (SNPs) to infer ancestry admixture. Notably, current available AIMs are predominantly located in intron and intergenic regions, while the whole exome sequencing (WES) protocols commonly used in translational research and clinical practice do not cover these markers. Thus, it remains challenging to accurately determine a patient's admixture proportion without additional DNA testing. Results: In this study we designed an unique AIM panel that infers 3-way genetic admixture from three distinct and selective continental populations (African (AFR), European (EUR), and East Asian (EAS)) within evolutionarily conserved exonic regions. Initially, about 1 million exonic SNPs from selective three populations in the 1000 Genomes Project were trimmed by their linkage disequilibrium (LD), restricted to biallelic variants, and finally we optimized to an AIM panel with 250 SNP markers, or the UT-AIM250 panel, using their ancestral informativeness statistics. Comparing to published AIM panels, UT-AIM250 performed better accuracy when we tested with three ancestral populations (accuracy: 0.995 ± 0.012 for AFR, 0.997 ± 0.007 for EUR, and 0.994 ± 0.012 for EAS). We further demonstrated the performance of the UT-AIM250 panel to admixed American (AMR) samples of the 1000 Genomes Project and obtained similar results (AFR, 0.085 ± 0.098; EUR, 0.665 ± 0.182; and EAS, 0.250 ± 0.205) to previously published AIM panels (Phillips-AIM34: AFR, 0.096 ± 0.127, EUR, 0.575 ± 0.290, and EAS, 0.330 ± 0.315; Wei-AIM278: AFR, 0.070 ± 0.096, EUR, 0.537 ± 0.267, and EAS, 0.393 ± 0.300). Subsequently, we applied the UT-AIM250 panel to a clinical dataset of 26 self-reported Hispanic patients in South Texas with hepatocellular carcinoma (HCC). We estimated the admixture proportions using WES data of adjacent non-cancer liver tissues (AFR, 0.065 ± 0.043; EUR, 0.594 ± 0.150; and EAS, 0.341 ± 0.160). Similar admixture proportions were identified from corresponding tumor tissues. In addition, we estimated admixture proportions of The Cancer Genome Atlas (TCGA) collection of hepatocellular carcinoma (TCGA-LIHC) samples (376 patients) using the UT-AIM250 panel. The panel obtained consistent admixture proportions from tumor and matched normal tissues, identified 3 possible incorrectly reported race/ethnicity, and/or provided race/ethnicity determination if necessary. Conclusions: Here we demonstrated the feasibility of using evolutionarily conserved exonic regions to infer admixture proportions and provided a robust and reliable control for sample collection or patient stratification for genetic analysis. R implementation of UT-AIM250 is available at https://github.com/chenlabgccri/UT-AIM250.",
                "authors": [
                    {
                        "name": "Wang L.-J."
                    },
                    {
                        "name": "Zhang C.W."
                    },
                    {
                        "name": "Su S.C."
                    },
                    {
                        "name": "Chen H.-I.H."
                    },
                    {
                        "name": "Chiu Y.-C."
                    },
                    {
                        "name": "Lai Z."
                    },
                    {
                        "name": "Bouamar H."
                    },
                    {
                        "name": "Ramirez A.G."
                    },
                    {
                        "name": "Cigarroa F.G."
                    },
                    {
                        "name": "Sun L.-Z."
                    },
                    {
                        "name": "Chen Y."
                    }
                ],
                "citationCount": 2,
                "date": "2019-12-30T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "An ancestry informative marker panel design for individual ancestry estimation of Hispanic population using whole exome sequencing data"
            },
            "pmcid": "PMC6936141",
            "pmid": "31888480"
        }
    ],
    "topic": [
        {
            "term": "Exome sequencing",
            "uri": "http://edamontology.org/topic_3676"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        }
    ]
}