{
    "accessibility": "Open access",
    "additionDate": "2019-08-09T13:20:05Z",
    "biotoolsCURIE": "biotools:SPHARM-PDM",
    "biotoolsID": "SPHARM-PDM",
    "cost": "Free of charge",
    "description": "Tool that computes point-based models using a parametric boundary description for the computing of Shape analysis.",
    "documentation": [
        {
            "note": "Tutorial material",
            "type": [
                "Training material"
            ],
            "url": "https://na-mic.org/wiki/UNC_SPHARM-PDM_Tutorial"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "homepage": "https://www.nitrc.org/projects/spharm-pdm/",
    "language": [
        "C++"
    ],
    "lastUpdate": "2020-06-16T10:55:26Z",
    "license": "Apache-2.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/NIRALUser/SPHARM-PDM"
        },
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/NIRALUser/SPHARM-PDM/issues"
        },
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://discourse.slicer.org/c/community/slicer-salt"
        }
    ],
    "maturity": "Mature",
    "name": "SPHARM-PDM",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "hans",
    "publication": [
        {
            "doi": "10.1117/12.2503894",
            "metadata": {
                "abstract": "© 2019 SPIE.Shape analysis is an important method used in neuroimaging research community due to its potential to precisely locate morphological changes between healthy and pathological structures. A popular shape analysis framework in the neuroimaging community is based on the encoding surface locations as spherical harmonics for a representation called SPHARM-PDM. The SPHARM-PDM pipeline takes a set of brain segmentation of a single brain structure (for example, hippocampus) as input and converts them into a corresponding spherical harmonic description (SPHARM), which is then sampled into triangulated surface (SPHARM-PDM). At present, the SPHARM-PDM pipeline utilizes an area-preserving optimization of the spherical mapping based on an initial heat-equation based mapping of the surface mesh to the unit sphere. In the case of objects with complex shape, this initial spherical mapping suffers from a high degree of mapping distortion that cannot always be corrected by the following optimization procedure. Here we proposed the use of an alternative initialization based on a conformal flattening. This method adopts a bijective angle preserving conformal flattening scheme to replace the heat equation mapping scheme as initialization for use in the SPHARM-PDM pipeline. After quantitative measures of shape calculated from various complex structures, we concluded that in most cases, the new pipeline produced dramatically better results than the old pipeline. The main contribution of this paper is a command line tool based on the Slicer Execution Model, which merges the conformal flattening into the SPHARM-PDM pipeline for use in the SALT shape analysis toolbox.",
                "authors": [
                    {
                        "name": "Fang Z."
                    },
                    {
                        "name": "Mostapha M."
                    },
                    {
                        "name": "Prieto J."
                    },
                    {
                        "name": "Styner M."
                    }
                ],
                "date": "2019-01-01T00:00:00Z",
                "journal": "Progress in Biomedical Optics and Imaging - Proceedings of SPIE",
                "title": "Conformal initialization for shape analysis applications in SALT"
            },
            "pmcid": "PMC6498854",
            "pmid": "31057203",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ],
    "validated": 1
}