
{
    "credit": [
        {
            "name": "Laurent Gautier",
            "typeEntity": "Person",
            "typeRoles": [
                "Developer"
            ]
        },
        {
            "name": "CBS",
            "typeEntity": "Institute",
            "typeRoles": [
                "Provider"
            ]
        },
        {
            "email": "lund@cbs.dtu.dk",
            "name": "Ole Lund",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://bioinformatics.psb.ugent.be/webtools/tapir/"
        }
    ],
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Sequence",
                        "uri": "http://edamontology.org/data_2044"
                    },
                    "format": [
                        {
                            "term": "FASTQ",
                            "uri": "http://edamontology.org/format_1930"
                        },
                        {
                            "term": "FASTA",
                            "uri": "http://edamontology.org/format_1929"
                        }
                    ]
                }
            ],
            "note": "Fast DNA search",
            "operation": [
                {
                    "term": "Prediction and recognition",
                    "uri": "http://edamontology.org/operation_2423"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Sequence",
                        "uri": "http://edamontology.org/data_2044"
                    },
                    "format": [
                        {
                            "term": "dna",
                            "uri": "http://edamontology.org/format_1212"
                        }
                    ]
                }
            ]
        }
    ],
    "labels": {
        "cost": "Free of charge (with restrictions)",
        "maturity": "Emerging",
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Sequence analysis",
                "uri": "http://edamontology.org/topic_0080"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://www.cbs.dtu.dk/services"
        }
    ],
    "publication": [
        {
            "abstract": "Cheap DNA sequencing may soon become routine not only for human genomes but also for practically anything requiring the identification of living organisms from their DNA: tracking of infectious agents, control of food products, bioreactors, or environmental samples. We propose a novel general approach to the analysis of sequencing data where a reference genome does not have to be specified. Using a distributed architecture we are able to query a remote server for hints about what the reference might be, transferring a relatively small amount of data. Our system consists of a server with known reference DNA indexed, and a client with raw sequencing reads. The client sends a sample of unidentified reads, and in return receives a list of matching references. Sequences for the references can be retrieved and used for exhaustive computation on the reads, such as alignment. To demonstrate this approach we have implemented a web server, indexing tens of thousands of publicly available genomes and genomic regions from various organisms and returning lists of matching hits from query sequencing reads. We have also implemented two clients: one running in a web browser, and one as a python script. Both are able to handle a large number of sequencing reads and from portable devices (the browser-based running on a tablet), perform its task within seconds, and consume an amount of bandwidth compatible with mobile broadband networks. Such client-server approaches could develop in the future, allowing a fully automated processing of sequencing data and routine instant quality check of sequencing runs from desktop sequencers. A web access is available at http://tapir.cbs.dtu. dk. The source code for a python command-line client, a server, and supplementary data are available at http://bit.ly/1aURxkc. © 2013 Gautier, Lund.",
            "authors": [
                "Gautier L.",
                "Lund O."
            ],
            "cit_count": 3,
            "doi": "10.1371/journal.pone.0083784",
            "journal": "PLoS ONE",
            "title": "Low-bandwidth and non-compute intensive remote identification of microbes from raw sequencing reads",
            "type": "Primary",
            "year": "2013-12-31"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:tapir_cbs",
        "biotoolsID": "tapir_cbs",
        "description": "This service is like a DNA search engine.",
        "homepage": "http://bioinformatics.psb.ugent.be/webtools/tapir/",
        "name": "Tapir",
        "version": [
            "1.9"
        ]
    }
}