{
    "additionDate": "2021-01-18T07:08:20Z",
    "biotoolsCURIE": "biotools:sakeima",
    "biotoolsID": "sakeima",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "fabio.vandin@unipd.it",
            "name": "Fabio Vandin",
            "typeEntity": "Person"
        }
    ],
    "description": "Fast Approximation of Frequent k-Mers and Applications to Metagenomics.\n\nSampling Algorithm for K-mers Approximation (Pellegrina, Pizzi, Vandin).\n\nSAKEIMA is a sampling-based algorithm for computing an approximation of the most frequent k-mers from a dataset of reads or a sequence. It's implementation is based on Jellyfish (version 2 https://github.com/gmarcais/Jellyfish ).",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "k-mer counting",
                    "uri": "http://edamontology.org/operation_3472"
                },
                {
                    "term": "RNA-Seq quantification",
                    "uri": "http://edamontology.org/operation_3800"
                },
                {
                    "term": "Sorting",
                    "uri": "http://edamontology.org/operation_3802"
                }
            ]
        }
    ],
    "homepage": "https://github.com/VandinLab/SAKEIMA",
    "language": [
        "C++"
    ],
    "lastUpdate": "2021-02-10T15:20:50Z",
    "name": "SAKEIMA",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1089/CMB.2019.0314",
            "metadata": {
                "abstract": "© Copyright 2020, Mary Ann Liebert, Inc., publishers 2020.Estimating the abundances of all k-mers in a set of biological sequences is a fundamental and challenging problem with many applications in biological analysis. Although several methods have been designed for the exact or approximate solution of this problem, they all require to process the entire data set, which can be extremely expensive for high-throughput sequencing data sets. Although in some applications it is crucial to estimate all k-mers and their abundances, in other situations it may be sufficient to report only frequent k-mers, which appear with relatively high frequency in a data set. This is the case, for example, in the computation of k-mers' abundance-based distances among data sets of reads, commonly used in metagenomic analyses. In this study, we develop, analyze, and test a sampling-based approach, called Sampling Algorithm for K-mErs approxIMAtion (SAKEIMA), to approximate the frequent k-mers and their frequencies in a high-throughput sequencing data set while providing rigorous guarantees on the quality of the approximation. SAKEIMA employs an advanced sampling scheme and we show how the characterization of the Vapnik-Chervonenkis dimension, a core concept from statistical learning theory, of a properly defined set of functions leads to practical bounds on the sample size required for a rigorous approximation. Our experimental evaluation shows that SAKEIMA allows to rigorously approximate frequent k-mers by processing only a fraction of a data set and that the frequencies estimated by SAKEIMA lead to accurate estimates of k-mer-based distances between high-throughput sequencing data sets. Overall, SAKEIMA is an efficient and rigorous tool to estimate k-mers' abundances providing significant speedups in the analysis of large sequencing data sets.",
                "authors": [
                    {
                        "name": "Pellegrina L."
                    },
                    {
                        "name": "Pizzi C."
                    },
                    {
                        "name": "Vandin F."
                    }
                ],
                "citationCount": 3,
                "date": "2020-04-01T00:00:00Z",
                "journal": "Journal of Computational Biology",
                "title": "Fast Approximation of Frequent k-Mers and Applications to Metagenomics"
            },
            "pmid": "31891535"
        }
    ],
    "topic": [
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "Microbial ecology",
            "uri": "http://edamontology.org/topic_3697"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ]
}