{
    "accessibility": "Open access",
    "additionDate": "2022-11-08T08:01:11.935579Z",
    "biotoolsCURIE": "biotools:karawun",
    "biotoolsID": "karawun",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "Richard.Beare@mcri.edu.au",
            "name": "Richard Beare",
            "orcidid": "http://orcid.org/0000-0002-7530-5664",
            "typeEntity": "Person"
        },
        {
            "name": "Joseph Yuan-Mou Yang"
        }
    ],
    "description": "Karawun converts the results of a diffusion MRI tractography study, as might be used for surgical planning, to a form that is readable by the Brainlab software suite.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://developmentalimagingmcri.github.io/karawun/"
        }
    ],
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                }
            ]
        }
    ],
    "homepage": "https://github.com/DevelopmentalImagingMCRI/karawun",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-11-08T08:01:11.938385Z",
    "license": "Apache-2.0",
    "name": "Karawun",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1007/S11548-022-02736-7",
            "metadata": {
                "abstract": "© 2022, The Author(s).Purpose: The neuroimaging research community—which includes a broad range of scientific, medical, statistical, and engineering disciplines—has developed many tools to advance our knowledge of brain structure, function, development, aging, and disease. Past research efforts have clearly shaped clinical practice. However, translation of new methodologies into clinical practice is challenging. Anything that can reduce these barriers has the potential to improve the rate at which research outcomes can contribute to clinical practice. In this article, we introduce Karawun, a file format conversion tool, that has become a key part of our work in translating advances in diffusion imaging acquisition and analysis into neurosurgical practice at our institution. Methods: Karawun links analysis workflows created using open-source neuroimaging software, to Brainlab (Brainlab AG, Munich, Germany), a commercially available surgical planning and navigation suite. Karawun achieves this using DICOM standards supporting representation of 3D structures, including tractography streamlines, and thus offers far more than traditional screenshot or color overlay approaches. Results: We show that neurosurgical planning data, created from multimodal imaging data using analysis methods implemented in open-source research software, can be imported into Brainlab. The datasets can be manipulated as if they were created by Brainlab, including 3D visualizations of white matter tracts and other objects. Conclusion: Clinicians can explore and interact with the results of research neuroimaging pipelines using familiar tools within their standard clinical workflow, understand the impact of the new methods on their practice and provide feedback to methods developers. This capability has been important to the translation of advanced analysis techniques into practice at our institution.",
                "authors": [
                    {
                        "name": "Alexander B."
                    },
                    {
                        "name": "Beare R."
                    },
                    {
                        "name": "Kean M."
                    },
                    {
                        "name": "Maixner W."
                    },
                    {
                        "name": "Seal M."
                    },
                    {
                        "name": "Warren A."
                    },
                    {
                        "name": "Wray A."
                    },
                    {
                        "name": "Yang J.Y.-M."
                    }
                ],
                "date": "2022-01-01T00:00:00Z",
                "journal": "International Journal of Computer Assisted Radiology and Surgery",
                "title": "Karawun: a software package for assisting evaluation of advances in multimodal imaging for neurosurgical planning and intraoperative neuronavigation"
            },
            "pmid": "36070033"
        }
    ],
    "toolType": [
        "Command-line tool",
        "Library"
    ],
    "topic": [
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        },
        {
            "term": "Protein expression",
            "uri": "http://edamontology.org/topic_0108"
        },
        {
            "term": "Surgery",
            "uri": "http://edamontology.org/topic_3421"
        }
    ]
}
