{
    "accessibility": "Open access",
    "additionDate": "2019-08-09T13:19:38Z",
    "biotoolsCURIE": "biotools:RECIST_1.1",
    "biotoolsID": "RECIST_1.1",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "hahns@snu.ac.kr",
            "name": "Seokyung Hahn",
            "orcidid": "https://orcid.org/0000-0002-4684-4917",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "yshoka@gmail.com",
            "name": "Soon Ho Yoon",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Measurement variability calculator.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                }
            ]
        }
    ],
    "homepage": "http://studyanalysis2017.pythonanywhere.com/",
    "lastUpdate": "2020-06-16T10:55:26Z",
    "license": "Unlicense",
    "maturity": "Mature",
    "name": "RECIST 1.1",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "hans",
    "publication": [
        {
            "doi": "10.1186/S12874-019-0727-7",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Radiologic assessments of baseline and post-treatment tumor burden are subject to measurement variability, but the impact of this variability on the objective response rate (ORR) and progression rate in specific trials has been unpredictable on a practical level. In this study, we aimed to develop an algorithm for evaluating the quantitative impact of measurement variability on the ORR and progression rate. Methods: First, we devised a hierarchical model for estimating the distribution of measurement variability using a clinical trial dataset of computed tomography scans. Next, a simulation method was used to calculate the probability representing the effect of measurement errors on categorical diagnoses in various scenarios using the estimated distribution. Based on the probabilities derived from the simulation, we developed an algorithm to evaluate the reliability of an ORR (or progression rate) (i.e., the variation in the assessed rate) by generating a 95% central range of ORR (or progression rate) results if a reassessment was performed. Finally, we performed validation using an external dataset. In the validation of the estimated distribution of measurement variability, the coverage level was calculated as the proportion of the 95% central ranges of hypothetical second readings that covered the actual burden sizes. In the validation of the evaluation algorithm, for 100 resampled datasets, the coverage level was calculated as the proportion of the 95% central ranges of ORR results that covered the ORR from a real second assessment. Results: We built a web tool for implementing the algorithm (publicly available at http://studyanalysis2017.pythonanywhere.com/). In the validation of the estimated distribution and the algorithm, the coverage levels were 93 and 100%, respectively. Conclusions: The validation exercise using an external dataset demonstrated the adequacy of the statistical model and the utility of the developed algorithm. Quantification of variation in the ORR and progression rate due to potential measurement variability is essential and will help inform decisions made on the basis of trial data.",
                "authors": [
                    {
                        "name": "Yoon J.-H."
                    },
                    {
                        "name": "Yoon S.H."
                    },
                    {
                        "name": "Hahn S."
                    }
                ],
                "date": "2019-05-02T00:00:00Z",
                "journal": "BMC Medical Research Methodology",
                "title": "Development of an algorithm for evaluating the impact of measurement variability on response categorization in oncology trials"
            },
            "pmcid": "PMC6498480",
            "pmid": "31046712",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Tomography",
            "uri": "http://edamontology.org/topic_3452"
        }
    ]
}