{
    "additionDate": "2021-01-18T12:07:03Z",
    "biotoolsCURIE": "biotools:logikey",
    "biotoolsID": "logikey",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "c.benzmueller@fu-berlin.de",
            "name": "Christoph Benzmüller",
            "typeEntity": "Person"
        },
        {
            "email": "x.parent.xavier@gmail.com",
            "name": "Xavier Parent",
            "typeEntity": "Person"
        }
    ],
    "description": "Deontic logics, logic combinations and expressive ethical and legal reasoning (Isabelle/HOL dataset).\n\nLogiKEy Workbench (dataset of formalized knowledge): Flexible, Pluralistic Foundations for Legal and Ethical Reasoning, Metaphysics and Maths.",
    "editPermission": {
        "type": "private"
    },
    "homepage": "http://logikey.org",
    "lastUpdate": "2021-02-17T07:34:29Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/cbenzmueller/LogiKEy"
        }
    ],
    "name": "LogiKEy",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1016/J.DIB.2020.106409",
            "metadata": {
                "abstract": "© 2020The LogiKEy workbench and dataset for ethical and legal reasoning is presented. This workbench simultaneously supports development, experimentation, assessment and deployment of formal logics and ethical and legal theories at different conceptual layers. More concretely, it comprises, in form of a dataset (Isabelle/HOL theory files), formal encodings of multiple deontic logics, logic combinations, deontic paradoxes and normative theories in the higher-order proof assistant system Isabelle/HOL. The data were acquired through application of the LogiKEy methodology, which supports experimentation with different normative theories, in different application scenarios, and which is not tied to specific logics or logic combinations. Our workbench consolidates related research contributions of the authors and it may serve as a starting point for further studies and experiments in flexible and expressive ethical and legal reasoning. It may also support hands-on teaching of non-trivial logic formalisms in lecture courses and tutorials. The LogiKEy methodology and framework is discussed in more detail in the companion research article titled “Designing Normative Theories for Ethical and Legal Reasoning: LogiKEy Framework, Methodology, and Tool Support” [5].",
                "authors": [
                    {
                        "name": "Benzmuller C."
                    },
                    {
                        "name": "Farjami A."
                    },
                    {
                        "name": "Fuenmayor D."
                    },
                    {
                        "name": "Meder P."
                    },
                    {
                        "name": "Parent X."
                    },
                    {
                        "name": "Steen A."
                    },
                    {
                        "name": "Zahoransky V."
                    },
                    {
                        "name": "van der Torre L."
                    }
                ],
                "date": "2020-12-01T00:00:00Z",
                "journal": "Data in Brief",
                "title": "LogiKEy workbench: Deontic logics, logic combinations and expressive ethical and legal reasoning (Isabelle/HOL dataset)"
            },
            "pmcid": "PMC7586073",
            "pmid": "33134442"
        }
    ],
    "toolType": [
        "Workbench"
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Mathematics",
            "uri": "http://edamontology.org/topic_3315"
        }
    ]
}
