{
    "additionDate": "2018-08-06T03:49:25Z",
    "biotoolsCURIE": "biotools:trend",
    "biotoolsID": "trend",
    "credit": [
        {
            "email": "jiaxu@mail.missouri.edu",
            "name": "Jia Xu",
            "orcidid": "http://orcid.org/0000-0002-0189-5833",
            "typeEntity": "Person",
            "typeRole": [
                "Contributor"
            ]
        },
        {
            "email": "trendmizzou@gmail.com",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "A multiplatform software that can track equilibrium and nonequilibrium population shifts among two-dimensional Data frames.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://trendmizzou.gitbooks.io/trend-manual/content/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Principal component plotting",
                    "uri": "http://edamontology.org/operation_2939"
                }
            ]
        }
    ],
    "homepage": "https://biochem.missouri.edu/trend/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2019-01-15T01:17:01Z",
    "license": "Proprietary",
    "name": "TREND",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "daniel_stefan",
    "publication": [
        {
            "doi": "10.1016/j.bpj.2016.12.018",
            "metadata": {
                "abstract": "© 2017 Biophysical SocietyPrincipal component analysis (PCA) discovers patterns in multivariate data that include spectra, microscopy, and other biophysical measurements. Direct application of PCA to crowded spectra, images, and movies (without selecting peaks or features) was shown recently to identify their equilibrium or temporal changes. To enable the community to utilize these capabilities with a wide range of measurements, we have developed multiplatform software named TREND to Track Equilibrium and Nonequilibrium population shifts among two-dimensional Data frames. TREND can also carry this out by independent component analysis. We highlight a few examples of finding concurrent processes. TREND extracts dual phases of binding to two sites directly from the NMR spectra of the titrations. In a cardiac movie from magnetic resonance imaging, TREND resolves principal components (PCs) representing breathing and the cardiac cycle. TREND can also reconstruct the series of measurements from selected PCs, as illustrated for a biphasic, NMR-detected titration and the cardiac MRI movie. Fidelity of reconstruction of series of NMR spectra or images requires more PCs than needed to plot the largest population shifts. TREND reads spectra from many spectroscopies in the most common formats (JCAMP-DX and NMR) and multiple movie formats. The TREND package thus provides convenient tools to resolve the processes recorded by diverse biophysical methods.",
                "authors": [
                    {
                        "name": "Van Doren S.R."
                    },
                    {
                        "name": "Xu J."
                    }
                ],
                "citationCount": 10,
                "date": "2017-01-24T00:00:00Z",
                "journal": "Biophysical Journal",
                "title": "Tracking Equilibrium and Nonequilibrium Shifts in Data with TREND"
            },
            "pmcid": "PMC5266145",
            "pmid": "28122211",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Data architecture, analysis and design",
            "uri": "http://edamontology.org/topic_3365"
        },
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        },
        {
            "term": "NMR",
            "uri": "http://edamontology.org/topic_0593"
        }
    ],
    "validated": 1
}
