{
    "accessibility": "Open access",
    "additionDate": "2023-11-28T18:35:32.516382Z",
    "biotoolsCURIE": "biotools:vernet-b",
    "biotoolsID": "vernet-b",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "bian@bit.edu.cn",
            "name": "Liheng Bian",
            "typeEntity": "Person"
        },
        {
            "email": "xiaofei3965@bjhmoh.cn",
            "name": "Fei Xiao",
            "typeEntity": "Person"
        },
        {
            "email": "yuxue2652@bjhmoh.cn",
            "name": "Xue Yu",
            "typeEntity": "Person"
        }
    ],
    "description": "Artificial intelligence-based recognition for variant pathogenicity of BRCA1 using AlphaFold2-predicted structures.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein feature detection",
                    "uri": "http://edamontology.org/operation_3092"
                },
                {
                    "term": "Variant effect prediction",
                    "uri": "http://edamontology.org/operation_0331"
                },
                {
                    "term": "Virulence prediction",
                    "uri": "http://edamontology.org/operation_3461"
                }
            ]
        }
    ],
    "homepage": "http://ai-lab.bjrz.org.cn/vERnet",
    "lastUpdate": "2023-11-28T18:35:32.518932Z",
    "name": "vERnet-B",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.7150/THNO.79362",
            "metadata": {
                "abstract": "With the surge of the high-throughput sequencing technologies, many genetic variants have been identified in the past decade. The vast majority of these variants are defined as variants of uncertain significance (VUS), as their significance to the function or health of an organism is not known. It is urgently needed to develop intelligent models for the clinical interpretation of VUS. State-of-the-art artificial intelligence (AI)-based variant effect predictors only learn features from primary amino acid sequences, leaving out information about the most important three-dimensional structure that is more related to its function. Methods: We proposed a deep convolutional neural network model named variant effect recognition network for BRCA1 (vERnet-B) to recognize the clinical pathogenicity of missense single-nucleotide variants in the BRCT domain of BRCA1. vERnet-B learned features associated with the pathogenicity from the tertiary protein structures of variants predicted by AlphaFold2. Results: After performing a series of validation and analyses on vERnet-B, we discovered that it exhibited significant advances over previous works. Recognizing the phenotypic consequences of VUS is one of the most daunting challenges in genetic informatics; however, we achieved 85% accuracy in recognizing disease BRCA1 variants with an ideal balance of false-positive and true-positive detection rates. vERnet-B correctly recognized the pathogenicity of variant A1708E, which was poorly predicted by AlphaFold2 as previously described. The vERnet-B web server is freely available from URL: http://ai-lab.bjrz.org.cn/vERnet. Conclusions: We applied protein tertiary structures to successfully recognize the pathogenic missense SNVs, which were difficult to be addressed by classical approaches based on sequences. Our work demonstrated that AlphaFold2-predicted structures were expected to be used for rich feature learning and revealed unique insights into the clinical interpretation of VUS in disease-related genes, using vERnet-B as a discovery tool.",
                "authors": [
                    {
                        "name": "Bian L."
                    },
                    {
                        "name": "Li C."
                    },
                    {
                        "name": "Li H."
                    },
                    {
                        "name": "Liu Y."
                    },
                    {
                        "name": "Su F."
                    },
                    {
                        "name": "Xiao F."
                    },
                    {
                        "name": "Xie Y."
                    },
                    {
                        "name": "Xu S."
                    },
                    {
                        "name": "Yu X."
                    },
                    {
                        "name": "Zhang L."
                    },
                    {
                        "name": "Zhang Z."
                    },
                    {
                        "name": "Zhuo Z."
                    }
                ],
                "date": "2023-01-01T00:00:00Z",
                "journal": "Theranostics",
                "title": "Artificial intelligence-based recognition for variant pathogenicity of BRCA1 using AlphaFold2-predicted structures"
            },
            "pmcid": "PMC9800725",
            "pmid": "36593954"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "NMR",
            "uri": "http://edamontology.org/topic_0593"
        },
        {
            "term": "Protein structure analysis",
            "uri": "http://edamontology.org/topic_2814"
        }
    ]
}
