{
    "accessibility": "Open access",
    "additionDate": "2024-02-25T15:27:10.304654Z",
    "biotoolsCURIE": "biotools:idesc",
    "biotoolsID": "idesc",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "xiting.yan@yale.edu",
            "name": "Xiting Yan",
            "orcidid": "https://orcid.org/0000-0001-8688-9004",
            "typeEntity": "Person"
        },
        {
            "email": "zuoheng.wang@yale.edu",
            "name": "Zuoheng Wang",
            "typeEntity": "Person"
        }
    ],
    "description": "The goal of iDESC is to identify differential expressed gene signatures between two groups in single cell RNA-seq considering subject effect with zero-inflated negative binomial mixed model.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                },
                {
                    "term": "Differential gene expression profiling",
                    "uri": "http://edamontology.org/operation_3223"
                },
                {
                    "term": "Genetic variation analysis",
                    "uri": "http://edamontology.org/operation_3197"
                }
            ]
        }
    ],
    "homepage": "https://github.com/yl883/iDESC",
    "language": [
        "R"
    ],
    "lastUpdate": "2024-02-25T15:27:10.307148Z",
    "license": "CC-BY-4.0",
    "name": "iDESC",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12859-023-05432-8",
            "metadata": {
                "abstract": "Background: Single-cell RNA sequencing (scRNA-seq) technology has enabled assessment of transcriptome-wide changes at single-cell resolution. Due to the heterogeneity in environmental exposure and genetic background across subjects, subject effect contributes to the major source of variation in scRNA-seq data with multiple subjects, which severely confounds cell type specific differential expression (DE) analysis. Moreover, dropout events are prevalent in scRNA-seq data, leading to excessive number of zeroes in the data, which further aggravates the challenge in DE analysis. Results: We developed iDESC to detect cell type specific DE genes between two groups of subjects in scRNA-seq data. iDESC uses a zero-inflated negative binomial mixed model to consider both subject effect and dropouts. The prevalence of dropout events (dropout rate) was demonstrated to be dependent on gene expression level, which is modeled by pooling information across genes. Subject effect is modeled as a random effect in the log-mean of the negative binomial component. We evaluated and compared the performance of iDESC with eleven existing DE analysis methods. Using simulated data, we demonstrated that iDESC had well-controlled type I error and higher power compared to the existing methods. Applications of those methods with well-controlled type I error to three real scRNA-seq datasets from the same tissue and disease showed that the results of iDESC achieved the best consistency between datasets and the best disease relevance. Conclusions: iDESC was able to achieve more accurate and robust DE analysis results by separating subject effect from disease effect with consideration of dropouts to identify DE genes, suggesting the importance of considering subject effect and dropouts in the DE analysis of scRNA-seq data with multiple subjects.",
                "authors": [
                    {
                        "name": "Adams T.S."
                    },
                    {
                        "name": "Chupp G.L."
                    },
                    {
                        "name": "Kaminski N."
                    },
                    {
                        "name": "Liu Y."
                    },
                    {
                        "name": "McDonough J.E."
                    },
                    {
                        "name": "Schupp J.C."
                    },
                    {
                        "name": "Wang N."
                    },
                    {
                        "name": "Wang Z."
                    },
                    {
                        "name": "Wu W."
                    },
                    {
                        "name": "Yan X."
                    },
                    {
                        "name": "Zhao J."
                    }
                ],
                "citationCount": 3,
                "date": "2023-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "iDESC: identifying differential expression in single-cell RNA sequencing data with multiple subjects"
            },
            "pmcid": "PMC10463720",
            "pmid": "37608264"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ]
}
