{
    "additionDate": "2021-01-18T09:37:14Z",
    "biotoolsCURIE": "biotools:redcraft",
    "biotoolsID": "redcraft",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "coleca@cse.sc.edu",
            "name": "Casey A. Cole",
            "typeEntity": "Person"
        }
    ],
    "description": "A Computational Platform Using Residual Dipolar Coupling NMR Data for Determining Structures of Perdeuterated Proteins Without NOEs.\n\nNuclear Magnetic Resonance (NMR) spectroscopy is one of the two primary experimental means of characterizing macromolecular structures, including protein structures. Structure determination by NMR spectroscopy has traditionally relied heavily on distance restraints derived from nuclear Overhauser effect (NOE) measurements. While structure determination of proteins from NOE-based restraints is well understood and broadly used, structure determination by NOEs imposes increasing quantity of data for analysis, increased cost of structure determination and is less available in the study of perdeuterated proteins. In the recent decade, Residual Dipolar Couplings (RDCs) have been investigated as an alternative source of data for structural elucidation of proteins by NMR",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Phasing",
                    "uri": "http://edamontology.org/operation_3454"
                },
                {
                    "term": "Protein modelling",
                    "uri": "http://edamontology.org/operation_0477"
                },
                {
                    "term": "Protein structure assignment",
                    "uri": "http://edamontology.org/operation_0320"
                },
                {
                    "term": "Protein structure validation",
                    "uri": "http://edamontology.org/operation_0321"
                }
            ]
        }
    ],
    "homepage": "https://bitbucket.org/hvalafar/redcraft/src/master/",
    "lastUpdate": "2021-03-22T14:10:56Z",
    "name": "REDCRAFT",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1101/2020.06.17.156638"
        },
        {
            "doi": "10.1371/journal.pcbi.1008060",
            "metadata": {
                "abstract": "© 2021 Cole et al.Nuclear Magnetic Resonance (NMR) spectroscopy is one of the three primary experimental means of characterizing macromolecular structures, including protein structures. Structure determination by solution NMR spectroscopy has traditionally relied heavily on distance restraints derived from nuclear Overhauser effect (NOE) measurements. While structure determination of proteins from NOE-based restraints is well understood and broadly used, structure determination from Residual Dipolar Couplings (RDCs) is relatively less well developed. Here, we describe the new features of the protein structure modeling program REDCRAFT and focus on the new Adaptive Decimation (AD) feature. The AD plays a critical role in improving the robustness of REDCRAFT to missing or noisy data, while allowing structure determination of larger proteins from less data. In this report we demonstrate the successful application of REDCRAFT in structure determination of proteins ranging in size from 50 to 145 residues using experimentally collected data, and of larger proteins (145 to 573 residues) using simulated RDC data. In both cases, REDCRAFT uses only RDC data that can be collected from perdeuterated proteins. Finally, we compare the accuracy of structure determination from RDCs alone with traditional NOE-based methods for the structurally novel PF.2048.1 protein. The RDC-based structure of PF.2048.1 exhibited 1.0 Å BB-RMSD with respect to a high-quality NOE-based structure. Although optimal strategies would include using RDC data together with chemical shift, NOE, and other NMR data, these studies provide proof-of-principle for robust structure determination of largely-perdeuterated proteins from RDC data alone using REDCRAFT.",
                "authors": [
                    {
                        "name": "Cole C.A."
                    },
                    {
                        "name": "Daigham N.S."
                    },
                    {
                        "name": "Liu G."
                    },
                    {
                        "name": "Montelione G.T."
                    },
                    {
                        "name": "Valafar H."
                    }
                ],
                "date": "2021-02-01T00:00:00Z",
                "journal": "PLoS Computational Biology",
                "title": "REDCRAFT: A computational platform using residual dipolar coupling NMR data for determining structures of perdeuterated proteins in solution"
            }
        }
    ],
    "topic": [
        {
            "term": "Molecular dynamics",
            "uri": "http://edamontology.org/topic_0176"
        },
        {
            "term": "NMR",
            "uri": "http://edamontology.org/topic_0593"
        },
        {
            "term": "Protein expression",
            "uri": "http://edamontology.org/topic_0108"
        },
        {
            "term": "Protein structure analysis",
            "uri": "http://edamontology.org/topic_2814"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
