{
    "additionDate": "2017-12-18T00:11:15Z",
    "biotoolsCURIE": "biotools:probe_select",
    "biotoolsID": "probe_select",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://stormo.wustl.edu/"
        }
    ],
    "description": "Probe Select is the probes program to select oligos for DNA microarray.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Microarray data analysis",
                    "uri": "http://edamontology.org/operation_2495"
                }
            ]
        }
    ],
    "homepage": "http://stormo.wustl.edu/resources.html",
    "language": [
        "C++",
        "C"
    ],
    "lastUpdate": "2018-12-14T10:01:41Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/probe-select-select-oligos-dna-microarray.html"
        }
    ],
    "name": "Probe Select",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/17.11.1067",
            "metadata": {
                "abstract": "Motivation: High density DNA oligo microarrays are widely used in biomedical research. Selection of optimal DNA oligos that are deposited on the microarrays is critical. Based on sequence information and hybridization free energy, we developed a new algorithm to select optimal short (20-25 bases) or long (50 or 70 bases) oligos from genes or open reading frames (ORFs) and predict their hybridization behavior. Having optimized probes for each gene is valuable for two reasons. By minimizing background hybridization they provide more accurate determinations of true expression levels. Having optimum probes minimizes the number of probes needed per gene, thereby decreasing the cost of each microarray, raising the number of genes on each chip and increasing its usage. Results: In this paper we describe algorithms to optimize the selection of specific probes for each gene in an entire genome. The criteria for truly optimum probes are easily stated but they are not computable at all levels currently. We have developed an heuristic approach that is efficiently computable at all levels and should provide a good approximation to the true optimum set. We have run the program on the complete genomes for several model organisms and deposited the results in a database that is available on-line (http://ural.wustl.edu/~lif/ probe.pl).",
                "authors": [
                    {
                        "name": "Li F."
                    },
                    {
                        "name": "Stormo G.D."
                    }
                ],
                "citationCount": 176,
                "date": "2001-01-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Selection of optimal DNA oligos for gene expression arrays"
            },
            "pmid": "11724738",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Probes",
            "uri": "http://edamontology.org/topic_0632"
        },
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        }
    ],
    "validated": 1
}