{
    "accessibility": [],
    "additionDate": "2018-08-12T11:24:57Z",
    "biotoolsCURIE": "biotools:deepem",
    "biotoolsID": "deepem",
    "collectionID": [],
    "confidence_flag": null,
    "cost": null,
    "credit": [
        {
            "email": "youdong_mao@dfci.harvard.edu",
            "gridid": null,
            "name": "Youdong Mao",
            "note": null,
            "orcidid": null,
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": null
        }
    ],
    "description": "Deep-learning based particle recognition program.",
    "documentation": [],
    "download": [],
    "editPermission": {
        "authors": [],
        "type": "private"
    },
    "elixirNode": [],
    "elixirPlatform": [],
    "elixir_badge": 0,
    "function": [
        {
            "cmd": null,
            "input": [],
            "note": "single-particle recognition from noisy cryo-EM micrographs, enabling automated particle picking, selection and verification in an integrated fashion",
            "operation": [
                {
                    "term": "Analysis",
                    "uri": "http://edamontology.org/operation_2945"
                }
            ],
            "output": []
        }
    ],
    "homepage": "http://ipccsb.dfci.harvard.edu/deepem/",
    "homepage_status": 0,
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2018-12-10T12:59:01Z",
    "license": null,
    "link": [],
    "maturity": null,
    "name": "DeepEM",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "otherID": [],
    "owner": "migle_sur",
    "publication": [
        {
            "doi": "10.1186/s12859-017-1757-y",
            "metadata": {
                "abstract": "© 2017 The Author(s). Background: Single-particle cryo-electron microscopy (cryo-EM) has become a mainstream tool for the structural determination of biological macromolecular complexes. However, high-resolution cryo-EM reconstruction often requires hundreds of thousands of single-particle images. Particle extraction from experimental micrographs thus can be laborious and presents a major practical bottleneck in cryo-EM structural determination. Existing computational methods for particle picking often use low-resolution templates for particle matching, making them susceptible to reference-dependent bias. It is critical to develop a highly efficient template-free method for the automatic recognition of particle images from cryo-EM micrographs. Results: We developed a deep learning-based algorithmic framework, DeepEM, for single-particle recognition from noisy cryo-EM micrographs, enabling automated particle picking, selection and verification in an integrated fashion. The kernel of DeepEM is built upon a convolutional neural network (CNN) composed of eight layers, which can be recursively trained to be highly \"knowledgeable\". Our approach exhibits an improved performance and accuracy when tested on the standard KLH dataset. Application of DeepEM to several challenging experimental cryo-EM datasets demonstrated its ability to avoid the selection of un-wanted particles and non-particles even when true particles contain fewer features. Conclusions: The DeepEM methodology, derived from a deep CNN, allows automated particle extraction from raw cryo-EM micrographs in the absence of a template. It demonstrates an improved performance, objectivity and accuracy. Application of this novel method is expected to free the labor involved in single-particle verification, significantly improving the efficiency of cryo-EM data processing.",
                "authors": [
                    {
                        "name": "Zhu Y."
                    },
                    {
                        "name": "Ouyang Q."
                    },
                    {
                        "name": "Mao Y."
                    }
                ],
                "citationCount": 11,
                "date": "2017-07-21T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "A deep convolutional neural network approach to single-particle recognition in cryo-electron microscopy"
            },
            "note": null,
            "pmcid": null,
            "pmid": null,
            "type": "Primary",
            "version": null
        }
    ],
    "relation": [],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Electron microscopy",
            "uri": "http://edamontology.org/topic_0611"
        }
    ],
    "validated": 1,
    "version": []
}