{
    "additionDate": "2019-11-14T18:02:27Z",
    "biotoolsCURIE": "biotools:SNAPPy",
    "biotoolsID": "SNAPPy",
    "confidence_flag": "tool",
    "description": "a snakemake pipeline for scalable HIV-1 subtyping by phylogenetic pairing | SNAPPy is a Snakemake pipeline for HIV-1 subtyping by phylogenetic pairing | This is the repository for SNAPPy, a Snakemake pipeline for HIV-1 subtyping by phylogenetic pairing. SNAPPy allows high-throughput HIV-1 subtyping locally while being resource efficient and scalable. This pipeline was constructed using Snakemake , and it uses MAFFT and for multiple sequence alignment, BLAST for similarirty querys, IQ-TREE for phylogenetic inference, and several Biopython modules for data parsing an analysis. For in-depth information on how the tool works please visit the documentation page. SNAPPy was design for Linux based operative systems | Welcome to snappy’s documentation! — SNAPPy-HIV1-Subtyping 1.0.0 documentation | Free document hosting provided by Read the Docs",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://snappy-hiv1-subtyping.readthedocs.io/"
        }
    ],
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence trimming",
                    "uri": "http://edamontology.org/operation_3192"
                },
                {
                    "term": "Parsing",
                    "uri": "http://edamontology.org/operation_1812"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                }
            ]
        }
    ],
    "homepage": "https://github.com/PMMAraujo/snappy",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-12-21T12:35:21Z",
    "license": "MIT",
    "name": "SNAPPy",
    "owner": "nosorio",
    "publication": [
        {
            "doi": "10.1093/ve/vez050",
            "metadata": {
                "abstract": "© 2019 The Author(s).Human immunodeficiency virus 1 (HIV-1) genome sequencing is routinely done for drug resistance monitoring in hospitals worldwide. Subtyping these extensive datasets of HIV-1 sequences is a critical first step in molecular epidemiology and evolution studies. The clinical relevance of HIV-1 subtypes is increasingly recognized. Several studies suggest subtype-related differences in disease progression, transmission route efficiency, immune evasion, and even therapeutic outcomes. HIV-1 subtyping is mainly done using web-servers. These tools have limitations in scalability and potential noncompliance with data protection legislation. Thus, the aim of this work was to develop an efficient method for large-scale local HIV-1 subtyping. We designed SNAPPy: a snakemake pipeline for scalable HIV-1 subtyping by phylogenetic pairing. It contains several tasks of phylogenetic inference and BLAST queries, which can be executed sequentially or in parallel, taking advantage of multiple-core processing units. Although it was built for subtyping, SNAPPy is also useful to perform extensive HIV-1 alignments. This tool facilitates large-scale sequence-based HIV-1 research by providing a local, resource efficient and scalable alternative for HIV-1 subtyping. It is capable of analyzing full-length genomes or partial HIV-1 genomic regions (GAG, POL, and ENV) and recognizes more than ninety circulating recombinant forms. SNAPPy is freely available at: https://github.com/PMMAraujo/snappy/releases.",
                "authors": [
                    {
                        "name": "Araujo P.M.M."
                    },
                    {
                        "name": "Martins J.S."
                    },
                    {
                        "name": "Osorio N.S."
                    }
                ],
                "citationCount": 4,
                "date": "2019-07-01T00:00:00Z",
                "journal": "Virus Evolution",
                "title": "SNAPPy: A snakemake pipeline for scalable HIV-1 subtyping by phylogenetic pairing"
            }
        }
    ],
    "topic": [
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        },
        {
            "term": "Public health and epidemiology",
            "uri": "http://edamontology.org/topic_3305"
        }
    ],
    "validated": 1
}