{
    "additionDate": "2020-01-09T17:48:07Z",
    "biotoolsCURIE": "biotools:OHNOLOGS_v2",
    "biotoolsID": "OHNOLOGS_v2",
    "confidence_flag": "tool",
    "description": "A comprehensive resource for the genes retained from whole genome duplication in vertebrates.\n\nThe code repository for OHNOLOGS v2.0 sever and multi-genome synteny comparison.\n\nA Repository of Genes Retained from Whole Genome Duplications in the Vertebrate Genomes.\n\nOHNOLOGS version 2.0 is now live with more genomes and more genome duplications!.\n\nSingh P.P. and Isambert H. (2019) OHNOLOGS v2: A comprehensive resource for the genes retained from whole genome duplication in vertebrates. Nucleic Acids Research.\n\nSingh PP & Isambert H. (2019) OHNOLOGS v2: A comprehensive resource for the genes retained from whole genome duplication in vertebrates. Nucleic Acids Research. Full text.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence assembly",
                    "uri": "http://edamontology.org/operation_0310"
                },
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                }
            ]
        }
    ],
    "homepage": "http://ohnologs.curie.fr",
    "language": [
        "R",
        "Perl"
    ],
    "lastUpdate": "2021-01-04T13:08:13Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/param-p-singh/Ohnologs-v2.0"
        }
    ],
    "name": "OHNOLOGS v2",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/NAR/GKZ909",
            "metadata": {
                "abstract": "© 2019 The Author(s) 2019. Published by Oxford University Press on behalf of Nucleic Acids Research.All vertebrates including human have evolved from an ancestor that underwent two rounds of whole genome duplication (2R-WGD). In addition, teleost fish underwent an additional third round of genome duplication (3R-WGD). The genes retained from these genome duplications, so-called ohnologs, have been instrumental in the evolution of vertebrate complexity, development and susceptibility to genetic diseases. However, the identification of vertebrate ohnologs has been challenging, due to lineage specific genome rearrangements since 2R-and 3R-WGD. We previously identified vertebrate ohnologs using a novel synteny comparison across multiple genomes. Here, we refine and apply this approach on 27 vertebrate genomes to identify ohnologs from both 2R-and 3R-WGD, while taking into account the phylogenetically biased sampling of available species. We assemble vertebrate ohnolog pairs and families in an expanded OHNOLOGS v2 database. We find that teleost fish have retained more 2R-WGD ohnologs than mammals and sauropsids, and that these 2R-ohnologs have retained significantly more ohnologs from the subsequent 3R-WGD than genes without 2R-ohnologs. Interestingly, species with fewer extant genes, such as sauropsids, have retained similar or higher proportions of ohnologs. OHNOLOGS v2 should allow deeper evolutionary genomic analysis of the impact of WGD on vertebrates and can be freely accessed at http://ohnologs.curie.fr.",
                "authors": [
                    {
                        "name": "Singh P.P."
                    },
                    {
                        "name": "Isambert H."
                    }
                ],
                "citationCount": 18,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "OHNOLOGS v2: A comprehensive resource for the genes retained from whole genome duplication in vertebrates"
            },
            "pmid": "31612943"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        },
        {
            "term": "Nucleic acids",
            "uri": "http://edamontology.org/topic_0077"
        },
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        }
    ],
    "validated": 1
}