{
    "additionDate": "2018-07-24T10:38:20Z",
    "biotoolsCURIE": "biotools:busybee",
    "biotoolsID": "busybee",
    "credit": [
        {
            "email": "andreas.keller@ccb.uni-saarland.de",
            "name": "Prof. Dr. Andreas Keller",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Automated deconvolution of metagenomic data into population-level genomic bins using assembled contigs (Illumina) or long reads (Pacific Biosciences, Oxford Nanopore Technologies).",
    "documentation": [
        {
            "type": "Training material",
            "url": "https://ccb-microbe.cs.uni-saarland.de/busybee/tutorial/"
        },
        {
            "type": "General",
            "url": "https://ccb-microbe.cs.uni-saarland.de/busybee/fqa/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Read binning",
                    "uri": "http://edamontology.org/operation_3798"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Sequence assembly",
                    "uri": "http://edamontology.org/operation_0310"
                }
            ]
        }
    ],
    "homepage": "https://ccb-microbe.cs.uni-saarland.de/busybee",
    "lastUpdate": "2018-12-10T12:59:00Z",
    "name": "BusyBee",
    "owner": "aotamendi.1",
    "publication": [
        {
            "doi": "10.1093/nar/gkx348",
            "metadata": {
                "abstract": "© The Author(s) 2017. Published by Oxford University Press on behalf of Nucleic Acids Research. Metagenomics-based studies of mixed microbial communities are impacting biotechnology, life sciences and medicine. Computational binning of metagenomic data is a powerful approach for the culture-independent recovery of population-resolved genomic sequences, i.e. from individual or closely related, constituent microorganisms. Existing binning solutions often require a priori characterized reference genomes and/or dedicated compute resources. Extending currently available reference-independent binning tools, we developed the BusyBee Web server for the automated deconvolution of metagenomic data into population-level genomic bins using assembled contigs (Illumina) or long reads (Pacific Biosciences, Oxford Nanopore Technologies). A reversible compression step as well as bootstrapped supervised binning enable quick turnaround times. The binning results are represented in interactive 2D scatterplots. Moreover, bin quality estimates, taxonomic annotations and annotations of antibiotic resistance genes are computed and visualized. Ground truth-based benchmarks of BusyBee Web demonstrate comparably high performance to state-of-the-art binning solutions for assembled contigs and markedly improved performance for long reads (median F1 scores: 70.02-95.21%). Furthermore, the applicability to real-world metagenomic datasets is shown. In conclusion, our reference-independent approach automatically bins assembled contigs or long reads, exhibits high sensitivity and precision, enables intuitive inspection of the results, and only requires FASTA-formatted input. The web-based application is freely accessible at: Https://ccb-microbe.cs.uni-saarland.de/busybee.",
                "authors": [
                    {
                        "name": "Laczny C.C."
                    },
                    {
                        "name": "Kiefer C."
                    },
                    {
                        "name": "Galata V."
                    },
                    {
                        "name": "Fehlmann T."
                    },
                    {
                        "name": "Backes C."
                    },
                    {
                        "name": "Keller A."
                    }
                ],
                "citationCount": 3,
                "date": "2017-07-03T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "BusyBee Web: Metagenomic data analysis by bootstrapped supervised binning and annotation"
            },
            "type": "Primary"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "Biotechnology",
            "uri": "http://edamontology.org/topic_3297"
        },
        {
            "term": "Microbial ecology",
            "uri": "http://edamontology.org/topic_3697"
        }
    ],
    "validated": 1
}