{
    "additionDate": "2021-01-18T11:29:04Z",
    "biotoolsCURIE": "biotools:liger",
    "biotoolsID": "liger",
    "confidence_flag": "tool",
    "credit": [
        {
            "name": "Joshua D. Welch",
            "typeEntity": "Person"
        }
    ],
    "description": "Jointly defining cell types from multiple single-cell datasets using LIGER.\n\nLIGER (Linked Inference of Genomic Experimental Relationships).\n\nLIGER (liger) is a package for integrating and analyzing multiple single-cell datasets, developed by the Macosko lab and maintained/extended by the Welch lab. It relies on integrative non-negative matrix factorization to identify shared and dataset-specific factors.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Relation extraction",
                    "uri": "http://edamontology.org/operation_3625"
                },
                {
                    "term": "Expression profile clustering",
                    "uri": "http://edamontology.org/operation_0313"
                }
            ]
        }
    ],
    "homepage": "https://github.com/MacoskoLab/liger",
    "language": [
        "R",
        "C++"
    ],
    "lastUpdate": "2021-02-16T08:40:31Z",
    "license": "GPL-3.0",
    "name": "LIGER",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1038/S41596-020-0391-8",
            "metadata": {
                "abstract": "© 2020, The Author(s), under exclusive licence to Springer Nature Limited.High-throughput single-cell sequencing technologies hold tremendous potential for defining cell types in an unbiased fashion using gene expression and epigenomic state. A key challenge in realizing this potential is integrating single-cell datasets from multiple protocols, biological contexts, and data modalities into a joint definition of cellular identity. We previously developed an approach, called linked inference of genomic experimental relationships (LIGER), that uses integrative nonnegative matrix factorization to address this challenge. Here, we provide a step-by-step protocol for using LIGER to jointly define cell types from multiple single-cell datasets. The main stages of the protocol are data preprocessing and normalization, joint factorization, quantile normalization and joint clustering, and visualization. We describe how to jointly define cell types from single-cell RNA-seq (scRNA-seq) and single-nucleus ATAC-seq (snATAC-seq) data, but similar steps apply across a wide range of other settings and data types, including cross-species analysis, single-nucleus DNA methylation, and spatial transcriptomics. Our protocol contains examples of expected results, describes common pitfalls, and relies only on our freely available, open-source R implementation of LIGER. We also provide R Markdown tutorials showing the outputs from each individual code segment. The analysis process can be performed in 1–4 h, depending on dataset size, and assumes no specialized bioinformatics training.",
                "authors": [
                    {
                        "name": "Liu J."
                    },
                    {
                        "name": "Gao C."
                    },
                    {
                        "name": "Sodicoff J."
                    },
                    {
                        "name": "Kozareva V."
                    },
                    {
                        "name": "Macosko E.Z."
                    },
                    {
                        "name": "Welch J.D."
                    }
                ],
                "citationCount": 8,
                "date": "2020-11-01T00:00:00Z",
                "journal": "Nature Protocols",
                "title": "Jointly defining cell types from multiple single-cell datasets using LIGER"
            },
            "pmid": "33046898"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Epigenomics",
            "uri": "http://edamontology.org/topic_3173"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ]
}