{
    "additionDate": "2021-01-18T10:26:02Z",
    "biotoolsCURIE": "biotools:ipdmada",
    "biotoolsID": "ipdmada",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "j.wang-4@umcutrecht.nl",
            "name": "Junfeng Wang",
            "typeEntity": "Person"
        }
    ],
    "description": "An R Shiny tool for analyzing and visualizing individual patient data meta-analyses of diagnostic test accuracy.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://jwang7.shinyapps.io/ipdmada/",
    "language": [
        "R"
    ],
    "lastUpdate": "2024-11-24T20:45:29.429546Z",
    "name": "IPDmada",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1002/jrsm.1444",
            "metadata": {
                "abstract": "Background: Individual patient data meta-analyses (IPD-MA) are regarded as the gold standard for systematic reviews, which also applies to systematic reviews of diagnostic test accuracy (DTA) studies. An increasing number of DTA systematic reviews with IPD-MA have been published in recent years, but there is much variation in how these IPD-MA were performed. A number of existing methods were found, but there is no consensus as to which methods are preferred as the standard methods for statistical analysis in DTA IPD-MA. Objectives: To create a web-based tool which integrates recommended statistical analyses for DTA IPD-MA, and allows researchers to analyse the data and visualize the results with interactive plots. Methods: A systematic methodological review was performed to identify statistical analyses and data visualization methods used in DTA IPD-MA. Methods were evaluated by the authors and recommended analyses were integrated into the IPDmada tool which is freely available online with the user interface developed with R Shiny package. Results: IPDmada allows users to upload their own data, perform the meta-analysis with both continuous and dichotomized tests, and incorporate individual level covariate-adjusted analysis. All tables and figures can be exported as.csv or.pdf files. A hypothetical dataset was used to illustrate the application of IPDmada. Conclusions: IPDmada will be very helpful to researchers doing DTA IPD-MA, since it not only facilitates the statistical analysis but also provides a standard framework. The introduction of IPDmada will harmonize the methods used in DTA IPD-MA and ensure the quality of such analyses. Highlights: IPDmada is a newly developed web-based tool for performing statistical analysis of individual patient data meta-analysis of diagnostic accuracy and visualizing the results. The tool is freely available to all the researchers, and requiring no installation of statistical software/packages. The tool has an user-friendly interface, and allows meta-analysis on both dichotomized and continuous test results. Researchers can easily use this tool to investigate the threshold effect and covariate effect on the summary accuracy. The introduction and implementation of IPDmada will serve as a useful tool for DTA IPD-MA and increase the quality of such studies.",
                "authors": [
                    {
                        "name": "Keusters W.R."
                    },
                    {
                        "name": "Leeflang M.M.G."
                    },
                    {
                        "name": "Wang J."
                    },
                    {
                        "name": "Wen L."
                    }
                ],
                "citationCount": 9,
                "date": "2021-01-01T00:00:00Z",
                "journal": "Research Synthesis Methods",
                "title": "IPDmada: An R Shiny tool for analyzing and visualizing individual patient data meta-analyses of diagnostic test accuracy"
            },
            "pmcid": "PMC7821168",
            "pmid": "32808437"
        }
    ],
    "toolType": [
        "Web service"
    ],
    "topic": [
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ]
}
