{
    "additionDate": "2021-03-19T08:59:14Z",
    "biotoolsCURIE": "biotools:chainchecker",
    "biotoolsID": "chainchecker",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "k.gaythorpe@imperial.ac.uk",
            "name": "Katy Gaythorpe",
            "orcidid": "https://orcid.org/0000-0003-3734-9081",
            "typeEntity": "Person"
        }
    ],
    "description": "chainchecker is an application to visualise and explore transmission chains for Ebola virus disease.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                },
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                }
            ]
        }
    ],
    "homepage": "https://shiny.dide.imperial.ac.uk/chainchecker",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-04-22T14:47:22Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/imperialebola2018/chainchecker"
        }
    ],
    "name": "chainchecker",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PONE.0247002",
            "metadata": {
                "abstract": "Copyright: © This is an open access article, free of all copyright, and may be freely reproduced, distributed, transmitted, modified, built upon, or otherwise used by anyone for any lawful purpose. The work is made available under the Creative Commons CC0 public domain dedication.2020 saw the continuation of the second largest outbreak of Ebola virus disease (EVD) in history. Determining epidemiological links between cases is a key part of outbreak control. However, due to the large quantity of data and subsequent data entry errors, inconsistencies in potential epidemiological links are difficult to identify. We present chainchecker, an online and offline shiny application which visualises, curates and verifies transmission chain data. The application includes the calculation of exposure windows for individual cases of EVD based on user defined incubation periods and user specified symptom profiles. It has an upload function for viral hemorrhagic fever data and utility for additional entries. This data may then be visualised as a transmission tree with inconsistent links highlighted. Finally, there is utility for cluster analysis and the ability to highlight nosocomial transmission. chainchecker is a R shiny application which has an offline version for use with VHF (viral hemorrhagic fever) databases or linelists. The software is available at https://shiny.dide.imperial.ac.uk/chainchecker which is a web-based application that links to the desktop application available for download and the github repository, https://github.com/imperialebola2018/chainchecker.",
                "authors": [
                    {
                        "name": "Gaythorpe K."
                    },
                    {
                        "name": "Morris A."
                    },
                    {
                        "name": "Imai N."
                    },
                    {
                        "name": "Stewart M."
                    },
                    {
                        "name": "Freeman J."
                    },
                    {
                        "name": "Choi M."
                    }
                ],
                "date": "2021-02-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "Chainchecker: An application to visualise and explore transmission chains for Ebola virus disease"
            },
            "pmcid": "PMC7894960",
            "pmid": "33606709"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Infectious disease",
            "uri": "http://edamontology.org/topic_3324"
        },
        {
            "term": "Public health and epidemiology",
            "uri": "http://edamontology.org/topic_3305"
        },
        {
            "term": "Biological databases",
            "uri": "http://edamontology.org/topic_3071"
        }
    ]
}