{
    "additionDate": "2016-02-26T12:23:17Z",
    "biotoolsCURIE": "biotools:imir",
    "biotoolsID": "imir",
    "credit": [
        {
            "email": "aweisz@unisa.it",
            "name": "Alessandro Weisz",
            "orcidid": "http://orcid.org/0000-0003-0455-2083",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.labmedmolge.unisa.it/index"
        },
        {
            "email": "aweisz@unisa.it",
            "name": "Alessandro Weisz",
            "orcidid": "http://orcid.org/0000-0003-0455-2083",
            "typeRole": [
                "Support"
            ],
            "url": "http://www.labmedmolge.unisa.it/index"
        },
        {
            "name": "Giorgio Giurato",
            "orcidid": "http://orcid.org/0000-0002-0538-8978",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.labmedmolge.unisa.it/index"
        },
        {
            "name": "Giorgio Giurato",
            "orcidid": "http://orcid.org/0000-0002-0538-8978",
            "typeRole": [
                "Developer"
            ],
            "url": "http://www.labmedmolge.unisa.it/index"
        },
        {
            "name": "ELIXIR-ITA-SALERNO",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        }
    ],
    "description": "Modular pipeline for comprehensive analysis of small RNA-Seq data, comprising specific tools for adapter trimming, quality filtering, differential expression analysis, biological target prediction and other useful options by integrating multiple open source modules and resources in an automated workflow.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://www.labmedmolge.unisa.it/italiano/home/imir"
        }
    ],
    "editPermission": {
        "authors": [
            "annamarabotti"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Analysis",
                    "uri": "http://edamontology.org/operation_2945"
                }
            ]
        }
    ],
    "homepage": "http://www.labmedmolge.unisa.it/italiano/home/imir",
    "lastUpdate": "2024-04-18T12:51:50.210205Z",
    "name": "iMir",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "ELIXIR-ITA-SALERNO",
    "publication": [
        {
            "doi": "10.1186/1471-2105-14-362",
            "metadata": {
                "abstract": "Background: Qualitative and quantitative analysis of small non-coding RNAs by next generation sequencing (smallRNA-Seq) represents a novel technology increasingly used to investigate with high sensitivity and specificity RNA population comprising microRNAs and other regulatory small transcripts. Analysis of smallRNA-Seq data to gather biologically relevant information, i.e. detection and differential expression analysis of known and novel non-coding RNAs, target prediction, etc., requires implementation of multiple statistical and bioinformatics tools from different sources, each focusing on a specific step of the analysis pipeline. As a consequence, the analytical workflow is slowed down by the need for continuous interventions by the operator, a critical factor when large numbers of datasets need to be analyzed at once.Results: We designed a novel modular pipeline (iMir) for comprehensive analysis of smallRNA-Seq data, comprising specific tools for adapter trimming, quality filtering, differential expression analysis, biological target prediction and other useful options by integrating multiple open source modules and resources in an automated workflow. As statistics is crucial in deep-sequencing data analysis, we devised and integrated in iMir tools based on different statistical approaches to allow the operator to analyze data rigorously. The pipeline created here proved to be efficient and time-saving than currently available methods and, in addition, flexible enough to allow the user to select the preferred combination of analytical steps. We present here the results obtained by applying this pipeline to analyze simultaneously 6 smallRNA-Seq datasets from either exponentially growing or growth-arrested human breast cancer MCF-7 cells, that led to the rapid and accurate identification, quantitation and differential expression analysis of ~450 miRNAs, including several novel miRNAs and isomiRs, as well as identification of the putative mRNA targets of differentially expressed miRNAs. In addition, iMir allowed also the identification of ~70 piRNAs (piwi-interacting RNAs), some of which differentially expressed in proliferating vs growth arrested cells.Conclusion: The integrated data analysis pipeline described here is based on a reliable, flexible and fully automated workflow, useful to rapidly and efficiently analyze high-throughput smallRNA-Seq data, such as those produced by the most recent high-performance next generation sequencers. iMir is available at http://www.labmedmolge.unisa.it/inglese/research/imir. © 2013 Giurato et al.; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "De Filippo M.R."
                    },
                    {
                        "name": "Giurato G."
                    },
                    {
                        "name": "Hashim A."
                    },
                    {
                        "name": "Nassa G."
                    },
                    {
                        "name": "Ravo M."
                    },
                    {
                        "name": "Rinaldi A."
                    },
                    {
                        "name": "Rizzo F."
                    },
                    {
                        "name": "Tarallo R."
                    },
                    {
                        "name": "Weisz A."
                    }
                ],
                "citationCount": 48,
                "date": "2013-12-13T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "IMir: An integrated pipeline for high-throughput analysis of small non-coding RNA data obtained by smallRNA-Seq"
            },
            "pmcid": "PMC3878829",
            "pmid": "24330401",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Functional genomics",
            "uri": "http://edamontology.org/topic_0085"
        }
    ],
    "validated": 1,
    "version": [
        "1"
    ]
}
