{
    "accessibility": "Open access",
    "additionDate": "2022-07-25T21:00:37.028331Z",
    "biotoolsCURIE": "biotools:probc",
    "biotoolsID": "probc",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "emre.sefer@ozyegin.edu.tr",
            "name": "Emre Sefer",
            "typeEntity": "Person"
        }
    ],
    "description": "Joint modeling of epigenome and transcriptome effects in 3D genome.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Binding site prediction",
                    "uri": "http://edamontology.org/operation_2575"
                },
                {
                    "term": "Peak calling",
                    "uri": "http://edamontology.org/operation_3222"
                },
                {
                    "term": "Transcription factor binding site prediction",
                    "uri": "http://edamontology.org/operation_0445"
                }
            ]
        }
    ],
    "homepage": "http://www.github.com/seferlab/probc",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T15:53:02.356780Z",
    "license": "Not licensed",
    "name": "PROBC",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1186/s12864-022-08498-5",
            "metadata": {
                "abstract": "Background: Hi-C and its high nucleosome resolution variant Micro-C provide a window into the spatial packing of a genome in 3D within the cell. Even though both techniques do not directly depend on the binding of specific antibodies, previous work has revealed enriched interactions and domain structures around multiple chromatin marks; epigenetic modifications and transcription factor binding sites. However, the joint impact of chromatin marks in Hi-C and Micro-C interactions have not been globally characterized, which limits our understanding of 3D genome characteristics. An emerging question is whether it is possible to deduce 3D genome characteristics and interactions by integrative analysis of multiple chromatin marks and associate interactions to functionality of the interacting loci. Result: We come up with a probabilistic method ProbC to decompose Hi-C and Micro-C interactions by known chromatin marks. ProbC is based on convex likelihood optimization, which can directly take into account both interaction existence and nonexistence. Through ProbC, we discover histone modifications (H3K27ac, H3K9me3, H3K4me3, H3K4me1) and CTCF as particularly predictive of Hi-C and Micro-C contacts across cell types and species. Moreover, histone modifications are more effective than transcription factor binding sites in explaining the genome’s 3D shape through these interactions. ProbC can successfully predict Hi-C and Micro-C interactions in given species, while it is trained on different cell types or species. For instance, it can predict missing nucleosome resolution Micro-C interactions in human ES cells trained on mouse ES cells only from these 5 chromatin marks with above 0.75 AUC. Additionally, ProbC outperforms the existing methods in predicting interactions across almost all chromosomes. Conclusion: Via our proposed method, we optimally decompose Hi-C interactions in terms of these chromatin marks at genome and chromosome levels. We find a subset of histone modifications and transcription factor binding sites to be predictive of both Hi-C and Micro-C interactions and TADs across human, mouse, and different cell types. Through learned models, we can predict interactions on species just from chromatin marks for which Hi-C data may be limited.",
                "authors": [
                    {
                        "name": "Sefer E."
                    }
                ],
                "citationCount": 2,
                "date": "2022-12-01T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "ProbC: joint modeling of epigenome and transcriptome effects in 3D genome"
            },
            "pmcid": "PMC8994916",
            "pmid": "35397520"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "ChIP-seq",
            "uri": "http://edamontology.org/topic_3169"
        },
        {
            "term": "Epigenomics",
            "uri": "http://edamontology.org/topic_3173"
        },
        {
            "term": "Epistasis",
            "uri": "http://edamontology.org/topic_3974"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ],
    "validated": 1
}
