{
    "additionDate": "2017-10-10T16:35:37Z",
    "biotoolsCURIE": "biotools:plantpis",
    "biotoolsID": "plantpis",
    "credit": [
        {
            "email": "flavio.licciulli@ba.itb.cnr.it",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://plantpis.ba.itb.cnr.it/index.php?option=com_content&view=article&id=48&Itemid=64"
        }
    ],
    "description": "It is a web querying system for a database collecting plant protease inhibitors data. Protease inhibitors in plants are naturally occurring proteins that inhibit the function of endogenous and exogenous proteases. PlantPIs contains information extracted principally from MEROPS database, filtered, annotated and compared with data stored in other protein and gene public databases, using both automated techniques and domain expert evaluations.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://plantpis.ba.itb.cnr.it/index.php?option=com_content&view=frontpage&Itemid=66"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                }
            ]
        }
    ],
    "homepage": "http://plantpis.ba.itb.cnr.it/",
    "lastUpdate": "2018-12-10T12:58:59Z",
    "name": "PlantPIs",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "flavioli",
    "publication": [
        {
            "metadata": {
                "abstract": "PlantPIs is a web querying system for a database collection of plant protease inhibitors data. Protease inhibitors in plants are naturally occurring proteins that inhibit the function of endogenous and exogenous proteases. In this paper the design and development of a web framework providing a clear and very flexible way of querying plant protease inhibitors data is reported. The web resource is based on a relational database, containing data of plants protease inhibitors publicly accessible, and a graphical user interface providing all the necessary browsing tools, including a data exporting function. PlantPIs contains information extracted principally from MEROPS database, filtered, annotated and compared with data stored in other protein and gene public databases, using both automated techniques and domain expert evaluations. The data are organized to allow a flexible and easy way to access stored information. The database is accessible at http://www.plantpis.ba.itb.cnr.it/. © 2011 Bentham Science Publishers Ltd.",
                "authors": [
                    {
                        "name": "Consiglio A."
                    },
                    {
                        "name": "Grillo G."
                    },
                    {
                        "name": "Licciulli F."
                    },
                    {
                        "name": "Ceci L.R."
                    },
                    {
                        "name": "Liuni S."
                    },
                    {
                        "name": "Losito N."
                    },
                    {
                        "name": "Volpicella M."
                    },
                    {
                        "name": "Gallerani R."
                    },
                    {
                        "name": "de Leo F."
                    }
                ],
                "citationCount": 4,
                "date": "2011-08-01T00:00:00Z",
                "journal": "Current Protein and Peptide Science",
                "title": "Plantpis - an interactive web resource on plant protease inhibitors"
            },
            "pmid": "21418024"
        },
        {
            "metadata": {
                "abstract": "PLANT-Pls is a database developed to facilitate retrieval of information on plant protease inhibitors (Pls) and related genes. For each PI, links to sequence databases are reported together with a summary of the functional properties of the molecule (and its mutants) as deduced from literature. PLANT-Pls contains information for 351 plant Pls, plus several isoinhibitors. The database is accessible at http://bighost.area.ba.cnr.it/PLANT-Pls.",
                "authors": [
                    {
                        "name": "De Leo F."
                    },
                    {
                        "name": "Volpicella M."
                    },
                    {
                        "name": "Licciulli F."
                    },
                    {
                        "name": "Liuni S."
                    },
                    {
                        "name": "Gallerani R."
                    },
                    {
                        "name": "Ceci L.R."
                    }
                ],
                "citationCount": 99,
                "date": "2002-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "PLANT-Pls: A database for plant protease inhibitors and their genes"
            },
            "pmid": "11752333"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        },
        {
            "term": "Gene and protein families",
            "uri": "http://edamontology.org/topic_0623"
        }
    ],
    "validated": 1
}