{
    "additionDate": "2017-08-03T18:49:59Z",
    "biotoolsCURIE": "biotools:most",
    "biotoolsID": "most",
    "credit": [
        {
            "email": "lin@bios.unc.edu",
            "name": "DANYU LIN",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://dlin.web.unc.edu/"
        }
    ],
    "description": "Able to analyze all the traits jointly. The framework is flexible in that it can handle both continuous and binary traits, or a mixture of them. In addition, it can accommodate family data, can adjust for covariates (such as ancestry variables, age, gender, etc.), and can be combined efficiently across studies with different designs.",
    "documentation": [
        {
            "type": "General",
            "url": "http://dlin.web.unc.edu/software/MOST/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Statistical calculation",
                    "uri": "http://edamontology.org/operation_2238"
                }
            ]
        }
    ],
    "homepage": "http://dlin.web.unc.edu/software/MOST/",
    "language": [
        "C"
    ],
    "lastUpdate": "2018-12-10T12:58:55Z",
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/1-0-multivariate-outcome-score-test.html"
        }
    ],
    "name": "MOST",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Genetic association studies often collect data on multiple traits that are correlated. Discovery of genetic variants influencing multiple traits can lead to better understanding of the etiology of complex human diseases. Conventional univariate association tests may miss variants that have weak or moderate effects on individual traits. We propose several multivariate test statistics to complement univariate tests. Our framework covers both studies of unrelated individuals and family studies and allows any type/mixture of traits. We relate the marginal distributions of multivariate traits to genetic variants and covariates through generalized linear models without modeling the dependence among the traits or family members. We construct score-type statistics, which are computationally fast and numerically stable even in the presence of covariates and which can be combined efficiently across studies with different designs and arbitrary patterns of missing data. We compare the power of the test statistics both theoretically and empirically. We provide a strategy to determine genome-wide significance that properly accounts for the linkage disequilibrium (LD) of genetic variants. The application of the new methods to the meta-analysis of five major cardiovascular cohort studies identifies a new locus (HSCB) that is pleiotropic for the four traits analyzed. © 2013 WILEY PERIODICALS, INC.",
                "authors": [
                    {
                        "name": "He Q."
                    },
                    {
                        "name": "Avery C.L."
                    },
                    {
                        "name": "Lin D.-Y."
                    }
                ],
                "citationCount": 22,
                "date": "2013-12-01T00:00:00Z",
                "journal": "Genetic Epidemiology",
                "title": "A general framework for association tests with multivariate traits in large-scale genomics studies"
            },
            "pmid": "24227293"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        },
        {
            "term": "GWAS study",
            "uri": "http://edamontology.org/topic_3517"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ],
    "validated": 1
}