{"collectionID": ["denbi-gcbn", "de.NBI"], "accessibility": [], "topic": [{"term": "Data management", "uri": "http://edamontology.org/topic_3071"}], "owner": "ipk", "cost": "Free of charge (with restrictions)", "relation": [], "download": [{"url": "http://edal.ipk-gatersleben.de/download.html", "note": null, "version": null, "type": "Source code"}, {"url": "http://edal.ipk-gatersleben.de/download.html", "note": null, "version": null, "type": "Binaries"}], "validated": 1, "publication": [{"doi": "10.1186/1471-2105-15-214", "note": null, "version": null, "pmid": null, "type": "Primary", "pmcid": null, "metadata": {"title": "E!DAL - a framework to store, share and publish research data", "abstract": "Background: The life-science community faces a major challenge in handling \" big data\" , highlighting the need for high quality infrastructures capable of sharing and publishing research data. Data preservation, analysis, and publication are the three pillars in the \" big data life cycle\" . The infrastructures currently available for managing and publishing data are often designed to meet domain-specific or project-specific requirements, resulting in the repeated development of proprietary solutions and lower quality data publication and preservation overall.Results: e!DAL is a lightweight software framework for publishing and sharing research data. Its main features are version tracking, metadata management, information retrieval, registration of persistent identifiers (DOI), an embedded HTTP(S) server for public data access, access as a network file system, and a scalable storage backend. e!DAL is available as an API for local non-shared storage and as a remote API featuring distributed applications. It can be deployed \" out-of-the-box\" as an on-site repository.Conclusions: e!DAL was developed based on experiences coming from decades of research data management at the Leibniz Institute of Plant Genetics and Crop Plant Research (IPK). Initially developed as a data publication and documentation infrastructure for the IPK's role as a data center in the DataCite consortium, e!DAL has grown towards being a general data archiving and publication infrastructure. The e!DAL software has been deployed into the Maven Central Repository. Documentation and Software are also available at: http://edal.ipk-gatersleben.de. © 2014 Arend et al.; licensee BioMed Central Ltd.", "citationCount": 29, "authors": [{"name": "Arend D."}, {"name": "Lange M."}, {"name": "Chen J."}, {"name": "Colmsee C."}, {"name": "Flemming S."}, {"name": "Hecht D."}, {"name": "Scholz U."}], "date": "2014-06-24T00:00:00Z", "journal": "BMC Bioinformatics"}}, {"doi": "10.1093/database/baw033", "note": null, "version": null, "pmid": null, "type": "Other", "pmcid": null, "metadata": {"title": "PGP repository: A Plant phenomics and genomics data publication infrastructure", "abstract": "© The Author(s) 2016. Published by Oxford University Press.Plant genomics and phenomics represents the most promising tools for accelerating yield gains and overcoming emerging crop productivity bottlenecks. However, accessing this wealth of plant diversity requires the characterization of this material using state-ofthe-art genomic, phenomic and molecular technologies and the release of subsequent research data via a long-term stable, open-access portal. Although several international consortia and public resource centres offer services for plant research data management, valuable digital assets remains unpublished and thus inaccessible to the scientific community. Recently, the Leibniz Institute of Plant Genetics and Crop Plant Research and the German Plant Phenotyping Network have jointly initiated the Plant Genomics and Phenomics Research Data Repository (PGP) as infrastructure to comprehensively publish plant research data. This covers in particular cross-domain datasets that are not being published in central repositories because of its volume or unsupported data scope, like image collections from plant phenotyping and microscopy, unfinished genomes, genotyping data, visualizations of morphological plant models, data from mass spectrometry as well as software and documents. The repository is hosted at Leibniz Institute of Plant Genetics and Crop Plant Research using e!DAL as software infrastructure and a Hierarchical Storage Management System as data archival backend. A novel developed data submission tool was made available for the consortium that features a high level of automation to lower the barriers of data publication. After an internal review process, data are published as citable digital object identifiers and a core set of technical metadata is registered at DataCite. The used e!DAL-embedded Web frontend generates for each dataset a landing page and supports an interactive exploration. PGP is registered as research data repository at BioSharing.org, re3data.org and OpenAIRE as valid EU Horizon 2020 open data archive. Above features, the programmatic interface and the support of standard metadata formats, enable PGP to fulfil the FAIR data principles-findable, accessible, interoperable, reusable.", "citationCount": 18, "authors": [{"name": "Arend D."}, {"name": "Junker A."}, {"name": "Scholz U."}, {"name": "Schuler D."}, {"name": "Wylie J."}, {"name": "Lange M."}], "date": "2016-01-01T00:00:00Z", "journal": "Database"}}], "homepage_status": 0, "credit": [{"typeRole": ["Contributor"], "name": "Astrid Junker", "url": null, "gridid": null, "note": null, "orcidid": null, "typeEntity": null, "email": null}, {"typeRole": ["Contributor"], "name": "Uwe Scholz", "url": null, "gridid": null, "note": null, "orcidid": null, "typeEntity": null, "email": null}, {"typeRole": ["Provider"], "name": "Leibniz Institute of Plant Genetics and Crop Plant Research (IPK) Gatersleben", "url": null, "gridid": null, "note": null, "orcidid": null, "typeEntity": "Institute", "email": null}, {"typeRole": ["Contributor"], "name": "Leibniz Institute of Plant Genetics and Crop Plant Research as infrastructural service", "url": null, "gridid": null, "note": null, "orcidid": null, "typeEntity": "Funding agency", "email": null}, {"typeRole": ["Contributor"], "name": "European Commission within the transPlant project", "url": null, "gridid": null, "note": null, "orcidid": null, "typeEntity": "Funding agency", "email": null}, {"typeRole": ["Contributor"], "name": "German Federal Ministry of Education and Research within the German-Plant-Phenotyping Network", "url": null, "gridid": null, "note": null, "orcidid": null, "typeEntity": "Funding agency", "email": null}, {"typeRole": ["Provider"], "name": "ipk", "url": null, "gridid": null, "note": null, "orcidid": null, "typeEntity": "Institute", "email": null}, {"typeRole": ["Maintainer"], "name": "Matthias Lange", "url": null, "gridid": null, "note": null, "orcidid": null, "typeEntity": null, "email": "lange@ipk-gatersleben.de"}, {"typeRole": ["Maintainer"], "name": "Daniel Arend", "url": null, "gridid": null, "note": null, "orcidid": null, "typeEntity": null, "email": "arendd@ipk-gatersleben.de"}, {"typeRole": ["Primary contact"], "name": "Matthias Lange", "url": null, "gridid": null, "note": null, "orcidid": null, "typeEntity": "Person", "email": "lange@ipk-gatersleben.de"}, {"typeRole": ["Primary contact"], "name": "Daniel Arend", "url": null, "gridid": null, "note": null, "orcidid": null, "typeEntity": "Person", "email": "arendd@ipk-gatersleben.de"}], "biotoolsCURIE": "biotools:pgp", "elixirPlatform": [], "elixirNode": [], "version": [], "elixir_badge": 0, "homepage": "http://edal-pgp.ipk-gatersleben.de/", "function": [{"note": null, "input": [], "operation": [{"term": "Deposition", "uri": "http://edamontology.org/operation_3431"}], "cmd": null, "output": []}], "lastUpdate": "2018-12-14T10:38:50Z", "otherID": [], "description": "Plant Genomics and Phenomics Research Data Repository (e!DAL-PGP) as infrastructure to comprehensively publish plant research data. This covers in particular cross-domain datasets that are not being published in central repositories because of its volume or unsupported data scope, like image collections from plant phenotyping and microscopy, unfinished genomes, genotyping data, visualizations of morphological plant models, data from mass spectrometry as well as software and documents. PGP is registered as research data repository at BioSharing.org, re3data.org and OpenAIRE as valid EU Horizon 2020 open data archive. Above features, the programmatic interface and the support of standard metadata formats, enable PGP to fulfil the FAIR data principles - findable, accessible, interoperable, reusable.", "toolType": ["Library"], "editPermission": {"type": "group", "authors": ["ipk"]}, "language": ["Java"], "link": [{"url": "https://doi.ipk-gatersleben.de/report", "note": null, "type": "Repository"}], "biotoolsID": "pgp", "additionDate": "2016-10-24T12:40:58Z", "name": "Plant Genomics and Phenomics Research Data Repository (PGP)", "license": "CC-BY-4.0", "documentation": [{"url": "https://edal.ipk-gatersleben.de/document/PGP-contract.pdf", "note": null, "type": "Terms of use"}, {"url": "http://edal.ipk-gatersleben.de/pgp", "note": null, "type": "Citation instructions"}, {"url": "http://edal.ipk-gatersleben.de/pgp", "note": null, "type": "General"}], "maturity": "Mature", "confidence_flag": null, "operatingSystem": ["Linux", "Windows", "Mac"]}