{
    "additionDate": "2021-01-18T10:44:45Z",
    "biotoolsCURIE": "biotools:sapphire",
    "biotoolsID": "sapphire",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "rob.lavigne@kuleuven.be",
            "name": "Rob Lavigne",
            "orcidid": "https://orcid.org/0000-0001-7377-1314",
            "typeEntity": "Person"
        }
    ],
    "description": "a neural network based classifier for σ70 promoter prediction in Pseudomonas.\n\nSequence Analyser for the Prediction of Prokaryote Homology Inferred Regulatory Elements.\n\nFor sequences longer than 5k basepairs, it is advisable to download SAPPHIRE and run it locally.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Promoter prediction",
                    "uri": "http://edamontology.org/operation_0440"
                },
                {
                    "term": "Gene regulatory network prediction",
                    "uri": "http://edamontology.org/operation_2437"
                }
            ]
        }
    ],
    "homepage": "http://www.biosapphire.com",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-02-11T16:03:12Z",
    "name": "SAPPHIRE",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1186/S12859-020-03730-Z",
            "metadata": {
                "abstract": "© 2020 The Author(s).Background: In silico promoter prediction represents an important challenge in bioinformatics as it provides a first-line approach to identifying regulatory elements to support wet-lab experiments. Historically, available promoter prediction software have focused on sigma factor-associated promoters in the model organism E. coli. As a consequence, traditional promoter predictors yield suboptimal predictions when applied to other prokaryotic genera, such as Pseudomonas, a Gram-negative bacterium of crucial medical and biotechnological importance. Results: We developed SAPPHIRE, a promoter predictor for σ70 promoters in Pseudomonas. This promoter prediction relies on an artificial neural network that evaluates sequences on their similarity to the - 35 and - 10 boxes of σ70 promoters found experimentally in P. aeruginosa and P. putida. SAPPHIRE currently outperforms established predictive software when classifying Pseudomonas σ70 promoters and was built to allow further expansion in the future. Conclusions: SAPPHIRE is the first predictive tool for bacterial σ70 promoters in Pseudomonas. SAPPHIRE is free, publicly available and can be accessed online at www.biosapphire.com. Alternatively, users can download the tool as a Python 3 script for local application from this site.",
                "authors": [
                    {
                        "name": "Coppens L."
                    },
                    {
                        "name": "Lavigne R."
                    }
                ],
                "date": "2020-09-22T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "SAPPHIRE: A neural network based classifier for σ70 promoter prediction in Pseudomonas"
            },
            "pmcid": "PMC7510298",
            "pmid": "32962628"
        }
    ],
    "topic": [
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Medical biotechnology",
            "uri": "http://edamontology.org/topic_3576"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ]
}