{
    "accessibility": [],
    "additionDate": "2017-12-18T00:10:16Z",
    "biotoolsCURIE": "biotools:pet-tool",
    "biotoolsID": "pet-tool",
    "collectionID": [],
    "confidence_flag": null,
    "cost": null,
    "credit": [
        {
            "email": "sungk@gis.a-star.edu.sg",
            "gridid": null,
            "name": null,
            "note": null,
            "orcidid": null,
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": null
        }
    ],
    "description": "PET-Tool is a mySQL-based muti-component software package specifically designed for processing the sequences generated from PET (Paired-End diTag) technology.",
    "documentation": [],
    "download": [],
    "editPermission": {
        "authors": [],
        "type": "private"
    },
    "elixirNode": [],
    "elixirPlatform": [],
    "elixir_badge": 0,
    "function": [
        {
            "cmd": null,
            "input": [],
            "note": null,
            "operation": [
                {
                    "term": "Processing",
                    "uri": "http://edamontology.org/operation_2409"
                }
            ],
            "output": []
        }
    ],
    "homepage": "http://www.gis.a-star.edu.sg/PET_Tool/",
    "homepage_status": 1,
    "language": [
        "C"
    ],
    "lastUpdate": "2018-12-10T12:58:58Z",
    "license": null,
    "link": [
        {
            "note": null,
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/pet-tool-3-0-processing-sequences-generated-pet-technology.html"
        }
    ],
    "maturity": null,
    "name": "PET-Tool",
    "operatingSystem": [
        "Linux"
    ],
    "otherID": [],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1186/1471-2105-7-390",
            "metadata": {
                "abstract": "Background: We recently developed the Paired End diTag (PET) strategy for efficient characterization of mammalian transcriptomes and genomes. The paired end nature of short PET sequences derived from long DNA fragments raised a new set of bioinformatics challenges, including how to extract PETs from raw sequence reads, and correctly yet efficiently map PETs to reference genome sequences. To accommodate and streamline data analysis of the large volume PET sequences generated from each PET experiment, an automated PET data process pipeline is desirable. Results: We designed an integrated computation program package, PET-Tool, to automatically process PET sequences and map them to the genome sequences. The Tool was implemented as a web-based application composed of four modules: the Extractor module for PET extraction; the Examiner module for analytic evaluation of PET sequence quality; the Mapper module for locating PET sequences in the genome sequences; and the ProjectManager module for data organization. The performance of PET-Tool was evaluated through the analyses of 2.7 million PET sequences. It was demonstrated that PET-Tool is accurate and efficient in extracting PET sequences and removing artifacts from large volume dataset. Using optimized mapping criteria, over 70% of quality PET sequences were mapped specifically to the genome sequences. With a 2.4 GHz LINUX machine, it takes approximately six hours to process one million PETs from extraction to mapping. Conclusion: The speed, accuracy, and comprehensiveness have proved that PET-Tool is an important and useful component in PET experiments, and can be extended to accommodate other related analyses of paired-end sequences. The Tool also provides user-friendly functions for data quality check and system for multi-layer data management. © 2006 Chiu et al; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Chiu K.P."
                    },
                    {
                        "name": "Wong C.-H."
                    },
                    {
                        "name": "Chen Q."
                    },
                    {
                        "name": "Ariyaratne P."
                    },
                    {
                        "name": "Ooi H.S."
                    },
                    {
                        "name": "Wei C.-L."
                    },
                    {
                        "name": "Sung W.-K.K."
                    },
                    {
                        "name": "Ruan Y."
                    }
                ],
                "citationCount": 24,
                "date": "2006-08-25T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "PET-tool: A software suite for comprehensive processing and managing of Paired-End diTag (PET) sequence data"
            },
            "note": null,
            "pmcid": null,
            "pmid": null,
            "type": "Primary",
            "version": null
        }
    ],
    "relation": [],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Sequences",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        }
    ],
    "validated": 1,
    "version": [
        "3.0"
    ]
}