
{
    "credit": [
        {
            "email": "fastpcr@primerdigital.com",
            "name": "Support",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://primerdigital.com/"
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://primerdigital.com/tools/pcr.html"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence assembly",
                    "uri": "http://edamontology.org/operation_0310"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Design",
                    "uri": "http://edamontology.org/operation_2430"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "PCR primer design",
                    "uri": "http://edamontology.org/operation_0308"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Java"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Desktop application"
        ],
        "topic": [
            {
                "term": "Primers",
                "uri": "http://edamontology.org/topic_0632"
            },
            {
                "term": "Assembly",
                "uri": "http://edamontology.org/topic_0196"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/jpcr-1-9-11-java-tools-pcr-silico-pcr-oligonucleotide-assembly-analysis.html"
        }
    ],
    "publication": [
        {
            "abstract": "© 2017 Elsevier Inc. Polymerase chain reaction (PCR) is one of the most important laboratory techniques used in molecular biology, genetics and molecular diagnostics. The success of a PCR-based method largely depends on the correct nucleic acid sequence analysis in silico prior to a wet-bench experiment. Here, we report the development of an online Java-based software for virtual PCR on linear or circular DNA templates and multiple primer or probe search from large or small databases. Primer or probe sensitivity and specificity are predicted by searching a database to find sequences with an optimal number of mismatches, similarity and stability. The software determines primer location, orientation, efficiency of binding and calculates primer melting temperatures for standard and degenerate oligonucleotides. The software is suitable for batch file processing, which is essential for automation when working with large amounts of data. The online Java software is available for download at http://primerdigital.com/tools/pcr.html. Accession numbers for the sequences resulting from this study: EU140956 EU177767 EU867815 EU882730 FJ975775-FJ975780 HM481419 HM481420 KC686837–KC686839 KM262797",
            "authors": [
                "Kalendar R.",
                "Khassenov B.",
                "Ramankulov Y.",
                "Samuilova O.",
                "Ivanov K.I."
            ],
            "cit_count": 11,
            "doi": "10.1016/j.ygeno.2017.05.005",
            "journal": "Genomics",
            "title": "FastPCR: An in silico tool for fast primer and probe design and advanced sequence analysis",
            "type": "Primary",
            "year": "2017-07-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:jpcr",
        "biotoolsID": "jpcr",
        "description": "A java application based on FastPCR software and provides comprehensive and professional facilities for designing primers for most PCR applications and their combinations: standard, multiplex, long distance, inverse, real-time, unique, group-specific, bisulphite modification assays, polymerase extension PCR multi-fragments assembly cloning (OE-PCR); and microarray design;",
        "homepage": "http://primerdigital.com/tools/pcr.html",
        "name": "jPCR",
        "version": [
            "1.15.8"
        ]
    }
}