
{
    "credit": [
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Phasing",
                    "uri": "http://edamontology.org/operation_3454"
                },
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "MATLAB"
        ],
        "topic": [
            {
                "term": "Imaging",
                "uri": "http://edamontology.org/topic_3382"
            },
            {
                "term": "Physics",
                "uri": "http://edamontology.org/topic_3318"
            },
            {
                "term": "Biology",
                "uri": "http://edamontology.org/topic_3070"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© 2019 Optical Society of America under the terms of the OSA Open Access Publishing AgreementAlternating projection based methods, such as ePIE and rPIE, have been used widely in ptychography. However, they only work well if there are adequate measurements (diffraction patterns); in the case of sparse data (i.e. fewer measurements) alternating projection underperforms and might not even converge. In this paper, we propose semi-implicit relaxed Douglas-Rachford (sDR), an accelerated iterative method, to solve the classical ptychography problem. Using both simulated and experimental data, we show that sDR improves the convergence speed and the reconstruction quality relative to extended ptychographic iterative engine (ePIE) and regularized ptychographic iterative engine (rPIE). Furthermore, in certain cases when sparsity is high, sDR converges while ePIE and rPIE fail or encounter slow convergence. To facilitate others to use the algorithm, we post the Matlab source code of sDR on a public website (www.physics.ucla.edu/research/imaging/sDR/index.html). We anticipate that this algorithm can be generally applied to the ptychographic reconstruction of a wide range of samples in the physical and biological sciences.",
            "authors": [
                "Pham M.",
                "Rana A.",
                "Miao J.",
                "Osher S."
            ],
            "cit_count": 0,
            "doi": "10.1364/OE.27.031246",
            "journal": "Optics Express",
            "pmid": "31684360",
            "title": "Semi-implicit relaxed Douglas-Rachford algorithm (sDR) for ptychography",
            "year": "2019-10-28"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:sDR_autogenerated",
        "biotoolsID": "sDR_autogenerated",
        "description": "Semi-implicit relaxed Douglas-Rachford algorithm (sDR) for ptychography.\n\nFree Matlab Source Codes for the semi-implicit relaxed Douglas-Rachford (sDR) Algorithm.\n\nFree Matlab Source Codes for the semi implicit relaxed Douglas-Rachford (sDR).\n\nThis page describes an iterative Ptychography reconstruction algorithm, termed semi-implicit relaxed Douglas-Rachford (sDR), which has been developed to improve the robustness and the convergence of sequential extended Ptychographic iteartive engine (ePIE)",
        "homepage": "http://www.physics.ucla.edu/research/imaging/sDR/index.html",
        "name": "sDR_autogenerated"
    }
}