{
    "accessibility": "Open access",
    "additionDate": "2021-11-20T07:58:35.408896Z",
    "biotoolsCURIE": "biotools:colbuilder",
    "biotoolsID": "colbuilder",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "frauke.graeter@h-its.org",
            "name": "Frauke Gräter",
            "typeEntity": "Person"
        }
    ],
    "description": "A server to build collagen fibril models.",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://colbuilder.h-its.org",
    "lastUpdate": "2021-11-20T07:58:35.412530Z",
    "name": "ColBuilder",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1016/J.BPJ.2021.07.009",
            "metadata": {
                "abstract": "© 2021Type I collagen is the main structural component of many tissues in the human body. It provides excellent mechanical properties to connective tissue and acts as a protein interaction hub. There is thus a wide interest in understanding the properties and diverse functions of type I collagen at the molecular level. A precondition is an atomistic collagen I structure as it occurs in native tissue. To this end, we built full-atom models of cross-linked collagen fibrils by integrating the low-resolution structure of collagen fibril available from x-ray fiber diffraction with high-resolution structures of short collagen-like peptides from x-ray crystallography and mass spectrometry data. We created a Web resource of collagen models for 20 different species with a large variety of cross-link types and localization within the fibril to facilitate structure-based analyses and simulations of type I collagen in health and disease. To easily enable simulations, we provide parameters of the modeled cross-links for an Amber force field. The repository of collagen models is available at https://colbuilder.h-its.org.",
                "authors": [
                    {
                        "name": "Grater F."
                    },
                    {
                        "name": "Obarska-Kosinska A."
                    },
                    {
                        "name": "Rennekamp B."
                    },
                    {
                        "name": "Unal A."
                    }
                ],
                "date": "2021-09-07T00:00:00Z",
                "journal": "Biophysical Journal",
                "title": "ColBuilder: A server to build collagen fibril models"
            },
            "pmcid": "PMC8456305",
            "pmid": "34265261"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "X-ray diffraction",
            "uri": "http://edamontology.org/topic_2828"
        }
    ]
}
