{"credit":[],"function":[{"operation":[{"term":"Deposition","uri":"http://edamontology.org/operation_3431"},{"term":"Sequence assembly","uri":"http://edamontology.org/operation_0310"},{"term":"Multilocus sequence typing","uri":"http://edamontology.org/operation_3840"}]}],"labels":{"topic":[{"term":"Whole genome sequencing","uri":"http://edamontology.org/topic_3673"},{"term":"Sequence assembly","uri":"http://edamontology.org/topic_0196"},{"term":"Genomics","uri":"http://edamontology.org/topic_0622"}]},"publication":[{"abstract":"© Springer Science+Business Media, LLC, part of Springer Nature 2020.PlasmidFinder and in silico plasmid multiLocus sequence typing (pMLST) are two easy-to-use web tools for detection and characterization of plasmid sequences in whole-genome sequencing (WGS) data from Enterobacteriaceae. These tools have been adopted worldwide and facilitate plasmid detection and typing based on draft genomes of multi-drug-resistant Enterobacteriaceae. The PlasmidFinder database currently includes 133 unique plasmid replicon sequences. It was built starting with 126 sequences devised on fully sequenced plasmids available at the NCBI nucleotide database in 2014 and has been continuously updated to include novel replicons detected in more recently sequenced plasmids associated with the family Enterobacteriaceae. PlasmidFinder is usable for replicon sequence analysis of raw as well as assembled sequencing data. For pMLST analysis, a weekly updated database was generated from www.pubmlst.org and integrated into a web tool called in silico pMLST.","authors":["Carattoli A.","Hasman H."],"cit_count":0,"doi":"10.1007/978-1-4939-9877-7_20","journal":"Methods in Molecular Biology","pmid":"31584170","title":"PlasmidFinder and In Silico pMLST: Identification and Typing of Plasmid Replicons in Whole-Genome Sequencing (WGS)","year":"2020-01-01"}],"summary":{"biotoolsCURIE":"biotools:pMLST","biotoolsID":"pMLST","description":"Identification and Typing of Plasmid Replicons in Whole-Genome Sequencing (WGS).\n\nPlasmidFinder and in silico plasmid multiLocus sequence typing (pMLST) are two easy-to-use web tools for detection and characterization of plasmid sequences in whole-genome sequencing (WGS) data from Enterobacteriaceae. These tools have been adopted worldwide and facilitate plasmid detection and typing based on draft genomes of multi-drug-resistant Enterobacteriaceae. The PlasmidFinder database currently includes 133 unique plasmid replicon sequences. It was built starting with 126 sequences devised on fully sequenced plasmids available at the NCBI nucleotide database in 2014 and has been continuously updated to include novel replicons detected in more recently sequenced plasmids associated with the family Enterobacteriaceae.\n\n||| HOMEPAGE MISSING!.\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'silico pMLST', 'pubmlst'","homepage":"https://www.ncbi.nlm.nih.gov/pubmed/?term=31584170","name":"pMLST"}}