{
    "additionDate": "2017-08-03T19:00:32Z",
    "biotoolsCURIE": "biotools:srmstats",
    "biotoolsID": "srmstats",
    "collectionID": [
        "Proteomics"
    ],
    "credit": [
        {
            "email": "chang54@purdue.edu",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.stat.purdue.edu/~ovitek/Home.html"
        }
    ],
    "description": "A statistical framework for protein quantification in SRM experiments based on a family of linear mixed-effects models.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://www.stat.purdue.edu/~chang54/SRMstats/R_implementation.html"
        }
    ],
    "editPermission": {
        "authors": [
            "proteomics.bio.tools"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Spectral analysis",
                    "uri": "http://edamontology.org/operation_3214"
                }
            ]
        }
    ],
    "homepage": "http://www.stat.purdue.edu/~chang54/SRMstats/Home.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2019-07-19T17:39:57Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/srmstats-1-7-protein-significance-analysis-srm-measurements.html"
        }
    ],
    "name": "SRMstats",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Selected reaction monitoring (SRM) is a targeted mass spectrometry technique that provides sensitive and accurate protein detection and quantification in complex biological mixtures. Statistical and computational tools are essential for the design and analysis of SRM experiments, particularly in studies with large sample throughput. Currently, most such tools focus on the selection of optimized transitions and on processing signals from SRM assays. Little attention is devoted to protein significance analysis, which combines the quantitative measurements for a protein across isotopic labels, peptides, charge states, transitions, samples, and conditions, and detects proteins that change in abundance between conditions while controlling the false discovery rate. We propose a statistical modeling framework for protein significance analysis. It is based on linear mixed-effects models and is applicable to most experimental designs for both isotope label-based and label-free SRM workflows. We illustrate the utility of the framework in two studies: one with a group comparison experimental design and the other with a time course experimental design. We further verify the accuracy of the framework in two controlled data sets, one from the NCI-CPTAC reproducibility investigation and the other from an in-house spike-in study. The proposed framework is sensitive and specific, produces accurate results in broad experimental circumstances, and helps to optimally design future SRM experiments. The statistical framework is implemented in an open-source R-based software package SRMstats, and can be used by researchers with a limited statistics background as a standalone tool or in integration with the existing computational pipelines. © 2012 by The American Society for Biochemistry and Molecular Biology, Inc.",
                "authors": [
                    {
                        "name": "Chang C.-Y."
                    },
                    {
                        "name": "Picotti P."
                    },
                    {
                        "name": "Huttenhain R."
                    },
                    {
                        "name": "Heinzelmann-Schwarz V."
                    },
                    {
                        "name": "Jovanovic M."
                    },
                    {
                        "name": "Aebersold R."
                    },
                    {
                        "name": "Vitek O."
                    }
                ],
                "citationCount": 108,
                "date": "2012-01-01T00:00:00Z",
                "journal": "Molecular and Cellular Proteomics",
                "title": "Protein significance analysis in selected reaction monitoring (SRM) measurements"
            },
            "pmid": "22190732"
        }
    ],
    "relation": [
        {
            "biotoolsID": "R",
            "type": "uses"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        }
    ],
    "validated": 1
}