{
    "additionDate": "2020-01-14T09:51:48Z",
    "biotoolsCURIE": "biotools:directors",
    "biotoolsID": "directors",
    "confidence_flag": "very low",
    "description": "Plastic Surgery Training and the Problematic Resident.\n\nINTRODUCTION:Plastic surgery resident education is a significant commitment by both programs and residents. Unfortunately, problematic resident behavior may occur and be difficult to manage. This study was designed to survey plastic surgery program directors to elucidate their experience with problematic resident behavior. METHODS:A electronic survey was prepared using the online platform, qualtrics. The survey was distributed by email to all plastic surgery program directors. Questions were designed to evaluate frequency of problematic behavior and methods to manage the behaviors. A reminder was sent 3 weeks after initial distribution. Responses were collected for an additional 3 weeks. Responses were pooled separately for integrated and independent program directors. RESULTS:Thirty-eight program directors responded including 10 independent and 28 integrated program directors.\n\n||| HOMEPAGE MISSING!",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://www.ncbi.nlm.nih.gov/pubmed/?term=31688121",
    "lastUpdate": "2020-01-14T09:51:48Z",
    "name": "directors",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1097/SAP.0000000000002074",
            "metadata": {
                "abstract": "INTRODUCTION: Plastic surgery resident education is a significant commitment by both programs and residents. Unfortunately, problematic resident behavior may occur and be difficult to manage. This study was designed to survey plastic surgery program directors to elucidate their experience with problematic resident behavior. METHODS: A electronic survey was prepared using the online platform, qualtrics. The survey was distributed by email to all plastic surgery program directors. Questions were designed to evaluate frequency of problematic behavior and methods to manage the behaviors. A reminder was sent 3 weeks after initial distribution. Responses were collected for an additional 3 weeks. Responses were pooled separately for integrated and independent program directors. RESULTS: Thirty-eight program directors responded including 10 independent and 28 integrated program directors. Integrated and independent program directors estimated prevalence of problematic behavior at 17.5 ± 14.4% and 11.8 ± 7.9%, respectively. Poor clinical skills/judgment and unprofessional behavior were the most commonly reported problematic behaviors by integrated program directors at 21% each. These were also the most commonly reported behaviors by independent program directors at 20.8% and 16.7%, respectively. Fourteen integrated program directors and 5 independent program directors reported having dismissed a resident. Only 5 integrated and 2 independent program directors reported warning signs in hindsight during the resident's initial application. Nine integrated program directors and 4 independent program directors reported at least sometimes reviewing applicant social media accounts. CONCLUSIONS: Prevalence of problematic behavior is estimated between 10% and 20% of plastic surgery residents. Type of problematic behavior are similar between integrated and independent residents. Warning signs on initial application are uncommon. As such, understanding problematic behaviors and methods to manage them are essential.",
                "authors": [
                    {
                        "name": "Ovadia S.A."
                    },
                    {
                        "name": "Zoghbi Y."
                    },
                    {
                        "name": "Thaller S.R."
                    }
                ],
                "date": "2020-01-01T00:00:00Z",
                "journal": "Annals of plastic surgery",
                "title": "Plastic Surgery Training and the Problematic Resident: A Survey of Plastic Surgery Program Directors"
            },
            "pmid": "31688121"
        }
    ],
    "topic": [
        {
            "term": "Surgery",
            "uri": "http://edamontology.org/topic_3421"
        }
    ]
}