{
    "accessibility": [],
    "additionDate": "2017-02-10T11:34:06Z",
    "biotoolsCURIE": "biotools:enterix",
    "biotoolsID": "enterix",
    "collectionID": [],
    "confidence_flag": null,
    "cost": null,
    "credit": [
        {
            "email": "florea@jhu.edu",
            "gridid": null,
            "name": "EnteriX Support",
            "note": null,
            "orcidid": null,
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": null
        }
    ],
    "description": "EnteriX is a collection of tools for viewing pairwise and multiple alignments for bacterial genome sequences.",
    "documentation": [],
    "download": [],
    "editPermission": {
        "authors": [],
        "type": "private"
    },
    "elixirNode": [],
    "elixirPlatform": [],
    "elixir_badge": 0,
    "function": [
        {
            "cmd": null,
            "input": [],
            "note": null,
            "operation": [
                {
                    "term": "Pairwise sequence alignment",
                    "uri": "http://edamontology.org/operation_0491"
                },
                {
                    "term": "Multiple sequence alignment",
                    "uri": "http://edamontology.org/operation_0492"
                },
                {
                    "term": "Sequence alignment",
                    "uri": "http://edamontology.org/operation_0292"
                },
                {
                    "term": "Genome alignment",
                    "uri": "http://edamontology.org/operation_3182"
                }
            ],
            "output": []
        }
    ],
    "homepage": "http://enterix.cbcb.umd.edu/",
    "homepage_status": 0,
    "language": [
        "Perl",
        "C"
    ],
    "lastUpdate": "2018-12-10T12:58:56Z",
    "license": null,
    "link": [],
    "maturity": null,
    "name": "EnteriX",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "otherID": [],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "doi": null,
            "metadata": {
                "abstract": "With the increase in the flow of sequence data, both in contigs and whole genomes, visual aids for comparison and analysis studies are becoming imperative. We describe three web-based tools for visualizing alignments of bacterial genomes. The first, called Enteric, produces a graphical, hypertext view of pairwise alignments between a reference genome and sequences from each of several related organisms, covering 20 kb around a user-specified position. Insertions, deletions and rearrangements relative to the reference genome are color-coded, which reveals many intriguing differences among genomes. The second, Menteric, computes and displays nucleotide-level multiple alignments of the same sequences, together with annotations of ORFs and regulatory sites, in a 1 kb region surrounding a given address. The third, a Java-based viewer called Maj, combines some features of the previous tools, and adds a zoom-in mechanism. We compare the Escherichia coli K-12 genome with the partially sequenced genomes of Klebsiella pneumoniae, Yersinia pestis, Vibrio cholerae, and the Salmonella enterica serovars Typhimurium, Typhi and Paratyphi A. Examination of the pairwise and multiple alignments in a region allows one to draw inferences about regulatory patterns and functional assignments. For example, these tools revealed that rffH, a gene involved in enterobacterial common antigen (ECA) biosynthesis, is partly deleted in one of the genomes. We used PCR to show that this deletion occurs sporadically in some strains of some serovars of S.enterica subspecies I but not in any strains tested from six other subspecies. The resulting cell surface diversity may be associated with selection by the host immune response.",
                "authors": [
                    {
                        "name": "Florea L."
                    },
                    {
                        "name": "Riemer C."
                    },
                    {
                        "name": "Schwartz S."
                    },
                    {
                        "name": "Zhang Z."
                    },
                    {
                        "name": "Stojanovic N."
                    },
                    {
                        "name": "Miller W."
                    },
                    {
                        "name": "McClelland M."
                    }
                ],
                "citationCount": 25,
                "date": "2000-09-15T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "Web-based visualization tools for bacterial genome alignments"
            },
            "note": null,
            "pmcid": null,
            "pmid": "10982867",
            "type": null,
            "version": null
        },
        {
            "doi": null,
            "metadata": {
                "abstract": "We describe EnteriX, a suite of three web-based visualization tools for graphically portraying alignment information from comparisons among several fixed and user-supplied sequences from related enterobacterial species, anchored on a reference genome (http://bio.cse.psu.edu/). The first visualization, Enteric, displays stacked pairwise alignments between a reference genome and each of the related bacteria, represented schematically as PiPs (Percent Identity Plots). Encoded in the views are large-scale genomic rearrangement events and functional landmarks. The second visualization, Menteric, computes and displays 1 Kb views of nucleotide-level multiple alignments of the sequences, together with annotations of genes, regulatory sites and conserved regions. The third, a Java-based tool named Maj, displays alignment information in two formats, corresponding roughly to the Enteric and Menteric views, and adds zoom-in capabilities. The uses of such tools are diverse, from examining the multiple sequence alignment to infer conserved sites with potential regulatory roles, to scrutinizing the commonalities and differences between the genomes for pathogenicity or phylogenetic studies. The EnteriX suite currently includes >15 enterobacterial genomes, generates views centered on four different anchor genomes and provides support for including user sequences in the alignments.",
                "authors": [
                    {
                        "name": "Florea L."
                    },
                    {
                        "name": "McClelland M."
                    },
                    {
                        "name": "Riemer C."
                    },
                    {
                        "name": "Schwartz S."
                    },
                    {
                        "name": "Miller W."
                    }
                ],
                "citationCount": 19,
                "date": "2003-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "EnteriX 2003: Visualization tools for genome alignments of Enterobacteriaceae"
            },
            "note": null,
            "pmcid": null,
            "pmid": "12824359",
            "type": null,
            "version": null
        }
    ],
    "relation": [],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "Whole genome sequencing",
            "uri": "http://edamontology.org/topic_3673"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        }
    ],
    "validated": 1,
    "version": []
}