
{
    "credit": [
        {
            "email": "hkhan@bcgsc.ca",
            "name": "Hamza Khan",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        },
        {
            "email": "ibirol@bcgsc.ca",
            "name": "Inanc Birol",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "https://github.com/bcgsc/ChopStitch"
        }
    ],
    "function": [
        {
            "note": "Splicegraph construction",
            "operation": [
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                },
                {
                    "term": "Sequence annotation",
                    "uri": "http://edamontology.org/operation_0361"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "C++",
            "Python"
        ],
        "license": "GPL-3.0",
        "operatingSystem": [
            "Linux",
            "Mac"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Gene transcripts",
                "uri": "http://edamontology.org/topic_3512"
            },
            {
                "term": "RNA splicing",
                "uri": "http://edamontology.org/topic_3320"
            },
            {
                "term": "Whole genome sequencing",
                "uri": "http://edamontology.org/topic_3673"
            },
            {
                "term": "Transcriptomics",
                "uri": "http://edamontology.org/topic_3308"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© The Author(s) 2017. Published by Oxford University Press. Motivation Sequencing studies on non-model organisms often interrogate both genomes and transcriptomes with massive amounts of short sequences. Such studies require de novo analysis tools and techniques, when the species and closely related species lack high quality reference resources. For certain applications such as de novo annotation, information on putative exons and alternative splicing may be desirable. Results Here we present ChopStitch, a new method for finding putative exons de novo and constructing splice graphs using an assembled transcriptome and whole genome shotgun sequencing (WGSS) data. ChopStitch identifies exon-exon boundaries in de novo assembled RNA-Seq data with the help of a Bloom filter that represents the k-mer spectrum of WGSS reads. The algorithm also accounts for base substitutions in transcript sequences that may be derived from sequencing or assembly errors, haplotype variations, or putative RNA editing events. The primary output of our tool is a FASTA file containing putative exons. Further, exon edges are interrogated for alternative exon-exon boundaries to detect transcript isoforms, which are represented as splice graphs in DOT output format. Availability and implementation ChopStitch is written in Python and C++ and is released under the GPL license. It is freely available at https://github.com/bcgsc/ChopStitch.",
            "authors": [
                "Khan H.",
                "Mohamadi H.",
                "Vandervalk B.P.",
                "Warren R.L.",
                "Chu J.",
                "Birol I."
            ],
            "cit_count": 1,
            "doi": "10.1093/bioinformatics/btx839",
            "journal": "Bioinformatics",
            "title": "ChopStitch: Exon annotation and splice graph construction using transcriptome assembly and whole genome sequencing data",
            "year": "2018-05-15"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:chopstitch",
        "biotoolsID": "chopstitch",
        "description": "Finding putative exons and constructing splicegraphs using Trans-ABySS contigs.",
        "homepage": "https://github.com/bcgsc/ChopStitch",
        "name": "ChopStitch"
    }
}