{
    "additionDate": "2017-09-29T02:50:33Z",
    "biotoolsCURIE": "biotools:mutexsl",
    "biotoolsID": "mutexsl",
    "credit": [
        {
            "email": "s.srihari@uq.edu.au",
            "name": "Sriganesh Srihari",
            "orcidid": "http://orcid.org/0000-0002-0713-6723",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Inferring synthetic lethal interactions from mutual exclusivity of genetic events in cancer. Australia.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://sites.google.com/site/mutexsl/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Prediction and recognition",
                    "uri": "http://edamontology.org/operation_2423"
                }
            ]
        }
    ],
    "homepage": "https://sites.google.com/site/mutexsl/",
    "lastUpdate": "2019-01-11T01:37:25Z",
    "maturity": "Emerging",
    "name": "MutExSL",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "sriganeshms",
    "publication": [
        {
            "doi": "10.1186/s13062-015-0086-1",
            "metadata": {
                "abstract": "© 2015 Srihari et al.Background: Synthetic lethality (SL) refers to the genetic interaction between two or more genes where only their co-alteration (e.g. by mutations, amplifications or deletions) results in cell death. In recent years, SL has emerged as an attractive therapeutic strategy against cancer: by targeting the SL partners of altered genes in cancer cells, these cells can be selectively killed while sparing the normal cells. Consequently, a number of studies have attempted prediction of SL interactions in human, a majority by extrapolating SL interactions inferred through large-scale screens in model organisms. However, these predicted SL interactions either do not hold in human cells or do not include genes that are (frequently) altered in human cancers, and are therefore not attractive in the context of cancer therapy. Results: Here, we develop a computational approach to infer SL interactions directly from frequently altered genes in human cancers. It is based on the observation that pairs of genes that are altered in a (significantly) mutually exclusive manner in cancers are likely to constitute lethal combinations. Using genomic copy-number and gene-expression data from four cancers, breast, prostate, ovarian and uterine (total 3980 samples) from The Cancer Genome Atlas, we identify 718 genes that are frequently amplified or upregulated, and are likely to be synthetic lethal with six key DNA-damage response (DDR) genes in these cancers. By comparing with published data on gene essentiality (~16000 genes) from ten DDR-deficient cancer cell lines, we show that our identified genes are enriched among the top quartile of essential genes in these cell lines, implying that our inferred genes are highly likely to be (synthetic) lethal upon knockdown in these cell lines. Among the inferred targets are tousled-like kinase 2 (TLK2) and the deubiquitinating enzyme ubiquitin-specific-processing protease 7 (USP7) whose overexpression correlates with poor survival in cancers. Conclusion: Mutual exclusivity between frequently occurring genetic events identifies synthetic lethal combinations in cancers. These identified genes are essential in cell lines, and are potential candidates for targeted cancer therapy. Availability: http://bioinformatics.org.au/tools-data/underMutExSL Reviewers: This article was reviewed by Dr Michael Galperin, Dr Sebastian Maurer-Stroh and Professor Sanghyuk Lee.",
                "authors": [
                    {
                        "name": "Srihari S."
                    },
                    {
                        "name": "Singla J."
                    },
                    {
                        "name": "Wong L."
                    },
                    {
                        "name": "Ragan M.A."
                    }
                ],
                "citationCount": 29,
                "date": "2015-10-01T00:00:00Z",
                "journal": "Biology Direct",
                "title": "Inferring synthetic lethal interactions from mutual exclusivity of genetic events in cancer"
            },
            "pmcid": "PMC4590705",
            "pmid": "26427375",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Biomedical science",
            "uri": "http://edamontology.org/topic_3344"
        },
        {
            "term": "Computational biology",
            "uri": "http://edamontology.org/topic_3307"
        }
    ],
    "validated": 1,
    "version": [
        "v1"
    ]
}