{
    "additionDate": "2021-01-18T12:33:26Z",
    "biotoolsCURIE": "biotools:hooknet",
    "biotoolsID": "hooknet",
    "confidence_flag": "tool",
    "description": "Multi-resolution convolutional neural networks for semantic segmentation in histopathology whole-slide images.\n\nA platform for end-to-end development of machine learning solutions in biomedical imaging.\n\nUpload medical imaging data easily and securely.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                }
            ]
        }
    ],
    "homepage": "http://grand-challenge.org",
    "lastUpdate": "2021-01-30T12:00:23Z",
    "name": "HookNet",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1016/J.MEDIA.2020.101890",
            "metadata": {
                "abstract": "© 2020 The AuthorsWe propose HookNet, a semantic segmentation model for histopathology whole-slide images, which combines context and details via multiple branches of encoder-decoder convolutional neural networks. Concentric patches at multiple resolutions with different fields of view, feed different branches of HookNet, and intermediate representations are combined via a hooking mechanism. We describe a framework to design and train HookNet for achieving high-resolution semantic segmentation and introduce constraints to guarantee pixel-wise alignment in feature maps during hooking. We show the advantages of using HookNet in two histopathology image segmentation tasks where tissue type prediction accuracy strongly depends on contextual information, namely (1) multi-class tissue segmentation in breast cancer and, (2) segmentation of tertiary lymphoid structures and germinal centers in lung cancer. We show the superiority of HookNet when compared with single-resolution U-Net models working at different resolutions as well as with a recently published multi-resolution model for histopathology image segmentation. We have made HookNet publicly available by releasing the source code1 as well as in the form of web-based applications2,3 based on the grand-challenge.org platform.",
                "authors": [
                    {
                        "name": "Balkenhol M."
                    },
                    {
                        "name": "Ciompi F."
                    },
                    {
                        "name": "Silina K."
                    },
                    {
                        "name": "van Rijthoven M."
                    },
                    {
                        "name": "van der Laak J."
                    }
                ],
                "citationCount": 3,
                "date": "2021-02-01T00:00:00Z",
                "journal": "Medical Image Analysis",
                "title": "HookNet: Multi-resolution convolutional neural networks for semantic segmentation in histopathology whole-slide images"
            },
            "pmid": "33260110"
        }
    ],
    "toolType": [
        "Web service"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        }
    ]
}
