{
    "additionDate": "2021-01-18T07:08:57Z",
    "biotoolsCURIE": "biotools:tempel",
    "biotoolsID": "tempel",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "yinr0002@e.ntu.edu.sg",
            "typeEntity": "Person"
        }
    ],
    "description": "time-series mutation prediction of influenza A viruses via attention-based recurrent neural networks.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein secondary structure prediction",
                    "uri": "http://edamontology.org/operation_0267"
                },
                {
                    "term": "Variant effect prediction",
                    "uri": "http://edamontology.org/operation_0331"
                },
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                }
            ]
        }
    ],
    "homepage": "https://drive.google.com/drive/folders/15WULR5__6k47iRotRPl3H7ghi3RpeNXH",
    "lastUpdate": "2021-02-26T18:08:44Z",
    "name": "Tempel",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAA050",
            "metadata": {
                "abstract": "© 2020 The Author(s). Published by Oxford University Press. All rights reserved.Motivation: Influenza viruses are persistently threatening public health, causing annual epidemics and sporadic pandemics. The evolution of influenza viruses remains to be the main obstacle in the effectiveness of antiviral treatments due to rapid mutations. The goal of this work is to predict whether mutations are likely to occur in the next flu season using historical glycoprotein hemagglutinin sequence data. One of the major challenges is to model the temporality and dimensionality of sequential influenza strains and to interpret the prediction results. Results: In this article, we propose an efficient and robust time-series mutation prediction model (Tempel) for the mutation prediction of influenza A viruses. We first construct the sequential training samples with splittings and embeddings. By employing recurrent neural networks with attention mechanisms, Tempel is capable of considering the historical residue information. Attention mechanisms are being increasingly used to improve the performance of mutation prediction by selectively focusing on the parts of the residues. A framework is established based on Tempel that enables us to predict the mutations at any specific residue site. Experimental results on three influenza datasets show that Tempel can significantly enhance the predictive performance compared with widely used approaches and provide novel insights into the dynamics of viral mutation and evolution.",
                "authors": [
                    {
                        "name": "Yin R."
                    },
                    {
                        "name": "Luusua E."
                    },
                    {
                        "name": "Dabrowski J."
                    },
                    {
                        "name": "Zhang Y."
                    },
                    {
                        "name": "Kwoh C.K."
                    }
                ],
                "citationCount": 10,
                "date": "2020-05-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Tempel: Time-series mutation prediction of influenza A viruses via attention-based recurrent neural networks"
            },
            "pmid": "31999330"
        }
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Evolutionary biology",
            "uri": "http://edamontology.org/topic_3299"
        }
    ]
}