{
    "additionDate": "2018-11-27T08:05:35Z",
    "biotoolsCURIE": "biotools:rapidgsea",
    "biotoolsID": "rapidgsea",
    "credit": [
        {
            "email": "hundt@uni-mainz.de",
            "name": "Christian Hundt",
            "orcidid": "http://orcid.org/0000-0002-7995-1858",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "We present rapidGSEA – a software suite consisting of two tools for facilitating permutation-based gene set enrichment analysis(GSEA): cudaGSEA and ompGSEA. cudaGSEA is a CUDA-accelerated tool using fine-grained parallelization schemes on massively parallel architectures while ompGSEA is a coarse-grained multi-threaded tool for multi-core CPUs.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/gravitino/cudaGSEA/blob/master/README.md"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence analysis",
                    "uri": "http://edamontology.org/operation_2403"
                }
            ]
        }
    ],
    "homepage": "https://github.com/gravitino/cudaGSEA",
    "language": [
        "C++"
    ],
    "lastUpdate": "2019-01-13T17:31:31Z",
    "license": "Unlicense",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/gravitino/cudaGSEA/issues"
        }
    ],
    "name": "rapidGSEA",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "daniel_stefan",
    "publication": [
        {
            "doi": "10.1186/s12859-016-1244-x",
            "metadata": {
                "abstract": "© 2016 The Author(s).Background: Gene Set Enrichment Analysis (GSEA) is a popular method to reveal significant dependencies between predefined sets of gene symbols and observed phenotypes by evaluating the deviation of gene expression values between cases and controls. An established measure of inter-class deviation, the enrichment score, is usually computed using a weighted running sum statistic over the whole set of gene symbols. Due to the lack of analytic expressions the significance of enrichment scores is determined using a non-parametric estimation of their null distribution by permuting the phenotype labels of the probed patients. Accordingly, GSEA is a time-consuming task due to the large number of required permutations to accurately estimate the nominal p-value - a circumstance that is even more pronounced during multiple hypothesis testing since its estimate is lower-bounded by the inverse number of samples in permutation space. Results: We present rapidGSEA - a software suite consisting of two tools for facilitating permutation-based GSEA: cudaGSEA and ompGSEA. cudaGSEA is a CUDA-accelerated tool using fine-grained parallelization schemes on massively parallel architectures while ompGSEA is a coarse-grained multi-threaded tool for multi-core CPUs. Nominal p-value estimation of 4,725 gene sets on a data set consisting of 20,639 unique gene symbols and 200 patients (183 cases + 17 controls) each probing one million permutations takes 19 hours on a Xeon CPU and less than one hour on a GeForce Titan X GPU while the established GSEA tool from the Broad Institute (broadGSEA) takes roughly 13 days. Conclusion: cudaGSEA outperforms broadGSEA by around two orders-of-magnitude on a single Tesla K40c or GeForce Titan X GPU. ompGSEA provides around one order-of-magnitude speedup to broadGSEA on a standard Xeon CPU. The rapidGSEA suite is open-source software and can be downloaded at https://github.com/gravitino/cudaGSEA as standalone application or package for the R framework.",
                "authors": [
                    {
                        "name": "Hundt C."
                    },
                    {
                        "name": "Hildebrandt A."
                    },
                    {
                        "name": "Schmidt B."
                    }
                ],
                "citationCount": 1,
                "date": "2016-09-23T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "rapidGSEA: Speeding up gene set enrichment analysis on multi-core CPUs and CUDA-enabled GPUs"
            },
            "pmcid": "PMC5035472",
            "pmid": "27663265",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ],
    "validated": 1
}