{
    "additionDate": "2015-08-03T09:36:04Z",
    "biotoolsCURIE": "biotools:worms",
    "biotoolsID": "worms",
    "credit": [
        {
            "name": "BioCatalogue",
            "typeEntity": "Project",
            "typeRole": [
                "Documentor"
            ],
            "url": "https://www.biocatalogue.org"
        },
        {
            "email": "info@marinespecies.org",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Search the WoRMS taxonomy.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://www.marinespecies.org/aphia.php?p=webservice"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                }
            ]
        }
    ],
    "homepage": "http://www.marinespecies.org/aphia.php?p=webservice",
    "lastUpdate": "2018-12-10T12:58:51Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "https://www.biocatalogue.org/services/3332"
        }
    ],
    "name": "World Register of Marine Species (WORMS)",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "BioCatalogue",
    "publication": [
        {
            "doi": "10.1371/journal.pone.0051629",
            "metadata": {
                "abstract": "The World Register of Marine Species is an over 90% complete open-access inventory of all marine species names. Here we illustrate the scale of the problems with species names, synonyms, and their classification, and describe how WoRMS publishes online quality assured information on marine species. Within WoRMS, over 100 global, 12 regional and 4 thematic species databases are integrated with a common taxonomy. Over 240 editors from 133 institutions and 31 countries manage the content. To avoid duplication of effort, content is exchanged with 10 external databases. At present WoRMS contains 460,000 taxonomic names (from Kingdom to subspecies), 368,000 species level combinations of which 215,000 are currently accepted marine species names, and 26,000 related but non-marine species. Associated information includes 150,000 literature sources, 20,000 images, and locations of 44,000 specimens. Usage has grown linearly since its launch in 2007, with about 600,000 unique visitors to the website in 2011, and at least 90 organisations from 12 countries using WoRMS for their data management. By providing easy access to expert-validated content, WoRMS improves quality control in the use of species names, with consequent benefits to taxonomy, ecology, conservation and marine biodiversity research and management. The service manages information on species names that would otherwise be overly costly for individuals, and thus minimises errors in the application of nomenclature standards. WoRMS' content is expanding to include host-parasite relationships, additional literature sources, locations of specimens, images, distribution range, ecological, and biological data. Species are being categorised as introduced (alien, invasive), of conservation importance, and on other attributes. These developments have a multiplier effect on its potential as a resource for biodiversity research and management. As a consequence of WoRMS, we are witnessing improved communication within the scientific community, and anticipate increased taxonomic efficiency and quality control in marine biodiversity research and management. © 2013 Costello et al.",
                "authors": [
                    {
                        "name": "Costello M.J."
                    },
                    {
                        "name": "Bouchet P."
                    },
                    {
                        "name": "Boxshall G."
                    },
                    {
                        "name": "Fauchald K."
                    },
                    {
                        "name": "Gordon D."
                    },
                    {
                        "name": "Hoeksema B.W."
                    },
                    {
                        "name": "Poore G.C.B."
                    },
                    {
                        "name": "van Soest R.W.M."
                    },
                    {
                        "name": "Stohr S."
                    },
                    {
                        "name": "Walter T.C."
                    },
                    {
                        "name": "Vanhoorne B."
                    },
                    {
                        "name": "Decock W."
                    },
                    {
                        "name": "Appeltans W."
                    }
                ],
                "citationCount": 113,
                "date": "2013-01-16T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "Global Coordination and Standardisation in Marine Biodiversity through the World Register of Marine Species (WoRMS) and Related Databases"
            },
            "type": [
                "Other"
            ]
        }
    ],
    "toolType": [
        "Web service"
    ],
    "topic": [
        {
            "term": "Data management",
            "uri": "http://edamontology.org/topic_3071"
        },
        {
            "term": "Data mining",
            "uri": "http://edamontology.org/topic_3473"
        }
    ],
    "validated": 1,
    "version": [
        "1"
    ]
}