
{
    "credit": [
        {
            "email": "zeynep.gumus@mssm.edu",
            "name": "Zeynep H Gümüş",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://research.mssm.edu/gumuslab/software.html"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Pathway or network visualisation",
                    "uri": "http://edamontology.org/operation_3083"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "C++"
        ],
        "license": "GPL-3.0",
        "operatingSystem": [
            "Linux",
            "Mac"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Molecular interactions, pathways and networks",
                "uri": "http://edamontology.org/topic_0602"
            },
            {
                "term": "Data visualisation",
                "uri": "http://edamontology.org/topic_0092"
            },
            {
                "term": "Pathology",
                "uri": "http://edamontology.org/topic_0634"
            },
            {
                "term": "Medicines research and development",
                "uri": "http://edamontology.org/topic_3376"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© The Author 2017. Published by Oxford University Press. Visualizations of biomolecular networks assist in systems-level data exploration in many cellular processes. Data generated from high-throughput experiments increasingly inform these networks, yet current tools do not adequately scale with concomitant increase in their size and complexity. We present an open source software platform, interactome-CAVE (iCAVE), for visualizing large and complex biomolecular interaction networks in 3D. Users can explore networks (i) in 3D using a desktop, (ii) in stereoscopic 3D using 3D-vision glasses and a desktop, or (iii) in immersive 3D within a CAVE environment. iCAVE introduces 3D extensions of known 2D network layout, clustering, and edge-bundling algorithms, as well as new 3D network layout algorithms. Furthermore, users can simultaneously query several built-in databases within iCAVE for network generation or visualize their own networks (e.g., disease, drug, protein, metabolite). iCAVE has modular structure that allows rapid development by addition of algorithms, datasets, or features without affecting other parts of the code. Overall, iCAVE is the first freely available open source tool that enables 3D (optionally stereoscopic or immersive) visualizations of complex, dense, or multi-layered biomolecular networks. While primarily designed for researchers utilizing biomolecular networks, iCAVE can assist researchers in any field.",
            "authors": [
                "Liluashvili V.",
                "Kalayci S.",
                "Fluder E.",
                "Wilson M.",
                "Gabow A.",
                "Zeynep H.G."
            ],
            "cit_count": 3,
            "doi": "10.1093/gigascience/gix054",
            "journal": "GigaScience",
            "title": "iCAVE: An open source tool for visualizing biomolecular networks in 3D, stereoscopic 3D and immersive 3D",
            "year": "2017-08-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:icave",
        "biotoolsID": "icave",
        "description": "Visualizing biomolecular networks in 3D, stereoscopic 3D and immersive 3D.",
        "homepage": "http://research.mssm.edu/gumuslab/software.html",
        "name": "iCAVE"
    }
}