
{
    "credit": [
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Validation",
                    "uri": "http://edamontology.org/operation_2428"
                }
            ]
        }
    ],
    "labels": {
        "topic": [
            {
                "term": "Public health and epidemiology",
                "uri": "http://edamontology.org/topic_3305"
            },
            {
                "term": "Nutritional science",
                "uri": "http://edamontology.org/topic_3390"
            },
            {
                "term": "Analytical chemistry",
                "uri": "http://edamontology.org/topic_3370"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© 2018 American Society for Nutrition. All rights reserved.During dietary supplement (DS) manufacturing, many ingredients are added at higher than declared-label amounts, but overages are not standardized among manufacturers. As a result, researchers may underestimate nutrient intakes from DSs. The Dietary Supplement Ingredient Database (DSID) provides statistical tools on the basis of the results of chemical analysis to convert label claims into analytically predicted ingredient amounts. These adjustments to labels are linked to DS products reported in NHANES. In this article, we describe the purpose of the DSID, the statistical methodology underlying online calculators of analytically verified supplement content estimates, and the application and significance of DSID label adjustments in nutritional epidemiology. Tables summarizing the numbers of NHANES DS products with ingredient overages and below label content show the importance of DSID adjustments to labels for accurate intake calculations.We show the differences between analytically based estimates and labeled content for vitamin D, calcium, iodine, caffeine, and omega-3 (n-3) fatty acids and their potential impact on the accuracy of intake assessments in large surveys. Analytical overages >20% of label levels are predicted for several nutrients in 50-99% of multivitamin-mineral products (MVMs) reported in NHANES: For iodine and selenium in adult MVMs, for iodine and vitamins D and E in children's MVMs, and for iodine, chromium, and potassium in nonprescription prenatal MVMs. Predicted overages of 10-20% for calcium can be applied to most MVMs and overages >10% for folic acid in the vast majority of adult and children's MVMs. DSID studies are currently evaluating ingredient levels in prescription prenatal MVMs and levels of constituents in botanical DSs. We estimate that the majority of MVM products reported in NHANES have significant overages for several ingredients. It is important to account for nonlabeled additional nutrient exposure from DSs to better evaluate nutritional status in the United States.",
            "authors": [
                "Andrews K.W.",
                "Gusev P.A.",
                "McNeal M.",
                "Savarala S.",
                "Dang P.T.V.",
                "Oh L.",
                "Atkinson R.",
                "Pehrsson P.R.",
                "Dwyer J.T.",
                "Saldanha L.G.",
                "Betz J.M.",
                "Costello R.B.",
                "Douglass L.W."
            ],
            "cit_count": 1,
            "doi": "10.1093/JN/NXY092",
            "journal": "Journal of Nutrition",
            "pmid": "31505677",
            "title": "Dietary Supplement Ingredient Database (DSID) and the application of analytically based estimates of ingredient amount to intake calculations",
            "year": "2018-08-01"
        },
        {
            "abstract": "© 2018 American Society for Nutrition. All rights reserved.The Dietary Supplement Label Database (DSLD) is sponsored by the Office of Dietary Supplements (ODS) and the National Library of Medicine (NLM). It provides a searchable, free database of the contents of ∼65,000 supplement labels. A companion database of analytically verified product labels [the Dietary Supplement Ingredient Database (DSID)] was created by ODS, NLM, and the USDA. There are considerable challenges to populating both databases, but the DSID faces unique analytic chemistry challenges. This article describes the challenges to creating analytically verified marketplace surveys of dietary supplement (DS) product content claims for inclusion in public databases. Nutritionists and public health scientists require information on actual exposures to DS constituents because labeled content may not match labeled product content. Analytic verification of composition of DSs provides a link to actual exposure. A public database of analytically derived DS content was developed to provide more accurate estimates of dietary intake in population-based epidemiologic studies. The DSID has conducted surveys of several types of vitamin- A nd mineralcontaining DSs. Results showing label content claims as analytically derived values are available in the current DSID. A recent pilot project explored the feasibility of adding botanical DS products to the DSID. Candidates for future botanical DSID studies will be based on sales volume, potential public health impacts, and the availability of validated analytic methods and reference materials. Databases like DSID and the DSLD are essential for researchers and clinicians to evaluate dietary ingredient intakes in population-based epidemiologic studies. Together, these databases provide a picture of the DS marketplace. The DSID provides an analytic survey of marketed DSs. However, selection of future botanical supplements for DSID evaluation involves analytic challenges. Even when appropriate resources are available, method selection and data evaluation are resource- A nd time-consuming.",
            "authors": [
                "Betz J.M.",
                "Rimmer C.A.",
                "Saldanha L.G.",
                "Phillips M.M.",
                "Andrews K.W.",
                "Wise S.A.",
                "Wood L.J.",
                "Kuszak A.J.",
                "Gusev P.A.",
                "Pehrsson P.R."
            ],
            "cit_count": 0,
            "doi": "10.1093/JN/NXY134",
            "journal": "Journal of Nutrition",
            "pmid": "31505676",
            "title": "Challenges in developing analytically validated laboratory-derived dietary supplement databases",
            "year": "2018-08-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:DSID",
        "biotoolsID": "DSID",
        "description": "> CORRECT NAME OF TOOL COULD ALSO BE 'DSID DSLD' | Dietary Supplement Ingredient Database (DSID) and the Application of Analytically Based Estimates of Ingredient Amount to Intake Calculations | Challenges in Developing Analytically Validated Laboratory-Derived Dietary Supplement Databases | Dietary Supplement Ingredient Database | Dietary Supplement Ingridient Database | The Dietary Supplement Ingredient Database (DSID) provides estimated levels of ingredients in dietary supplement products sold in the United States",
        "homepage": "https://dsid.usda.nih.gov",
        "name": "DSID"
    }
}