{
    "accessibility": "Open access",
    "additionDate": "2022-01-20T00:24:22.904704Z",
    "biotoolsCURIE": "biotools:hta",
    "biotoolsID": "hta",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "levyalona@gmail.com",
            "name": "Alona Levy-Jurgenson",
            "orcidid": "https://orcid.org/0000-0003-3315-1748",
            "typeEntity": "Person"
        },
        {
            "email": "zohar.yakhini@gmail.com",
            "name": "Zohar Yakhini",
            "typeEntity": "Person"
        },
        {
            "name": "Xavier Tekpli"
        }
    ],
    "description": "Assessing heterogeneity in spatial data using the HTA index with applications to spatial transcriptomics and imaging.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                },
                {
                    "term": "Splitting",
                    "uri": "http://edamontology.org/operation_3359"
                }
            ]
        }
    ],
    "homepage": "https://github.com/alonalj/hta",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-01-20T00:24:22.907084Z",
    "license": "MIT",
    "name": "HTA",
    "operatingSystem": [
        "Mac",
        "Linux",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAB569",
            "pmcid": "PMC8598444",
            "pmid": "34358288"
        },
        {
            "doi": "10.3390/IJERPH18168846",
            "metadata": {
                "abstract": "© 2021 by the authors. Licensee MDPI, Basel, Switzerland.Introduction: To make more efficient use of limited resources, Vietnam incorporated health technology assessment (HTA) into the decision-making process for the health insurance benefit package in 2014. We evaluated progress in HTA institutionalization in Vietnam based on the theoretical framework developed by the National Institute for Health and Care Excellence and the Health Intervention and Technology Assessment Program, identified negative and conducive factors for HTA development, and finally suggested policy recommendations that fit the Vietnamese context. Methods: Semi-structured in-depth qualitative interviews were conducted between December 2017 and March and April 2018 with a purposive sample of 24 stakeholders involved in decision-making for health insurance reimbursement. We employed thematic analysis to examine themes within the data. Results: Despite a variety of activities (i.e., training and advising/mentoring) and a substantial level of output (i.e., policy statements, focal points assigned, and case studies/demonstration projects), Vietnam has not yet reached the policy decision stage based on HTA with scientific integrity and active stakeholder participation. Most respondents, except some clinicians, supported the use of HTA. The lack of capacity of human resources in the government sector and academia, the limited data infrastructure, the absence of guidelines, the government’s interest in immediate budget-saving, and public resistance were identified as barriers to the advancement of HTA. Conclusions: A structured data repository, guidelines based on the Vietnamese context for both policy decision-making at the central level and daily clinical decision-making at the micro-level, and integration of a participatory process into HTA are suggested as priorities for HTA institutionalization in Vietnam.",
                "authors": [
                    {
                        "name": "Lee H.-Y."
                    },
                    {
                        "name": "Nguyen T.T.-T."
                    },
                    {
                        "name": "Park S."
                    },
                    {
                        "name": "Hoang V.M."
                    },
                    {
                        "name": "Kim W.-H."
                    }
                ],
                "date": "2021-08-02T00:00:00Z",
                "journal": "International Journal of Environmental Research and Public Health",
                "title": "Health technology assessment development in vietnam: A qualitative study of current progress, barriers, facilitators, and future strategies"
            },
            "pmcid": "PMC8392551",
            "pmid": "34444597"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        }
    ]
}