{
    "additionDate": "2019-11-14T19:29:55Z",
    "biotoolsCURIE": "biotools:MOLI",
    "biotoolsID": "MOLI",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "ccollins@prostatecentre.com",
            "name": "Colin C Collins",
            "typeEntity": "Person"
        },
        {
            "email": "ester@cs.sfu.ca",
            "name": "Martin Ester",
            "typeEntity": "Person"
        }
    ],
    "description": "Multi-omics late integration with deep neural networks for drug response prediction | MOTIVATION:Historically, gene expression has been shown to be the most informative data for drug response prediction. Recent evidence suggests that integrating additional omics can improve the prediction accuracy which raises the question of how to integrate the additional omics. Regardless of the integration strategy, clinical utility and translatability are crucial. Thus, we reasoned a multi-omics approach combined with clinical datasets would improve drug response prediction and clinical relevance. RESULTS:We propose MOLI, a multi-omics late integration method based on deep neural networks. MOLI takes somatic mutation, copy number aberration and gene expression data as input, and integrates them for drug response prediction",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Imputation",
                    "uri": "http://edamontology.org/operation_3557"
                }
            ]
        }
    ],
    "homepage": "https://github.com/hosseinshn/MOLI",
    "lastUpdate": "2020-12-29T10:03:40Z",
    "name": "MOLI",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ318",
            "metadata": {
                "abstract": "© 2019 The Author(s) 2019. Published by Oxford University Press.Motivation: Historically, gene expression has been shown to be the most informative data for drug response prediction. Recent evidence suggests that integrating additional omics can improve the prediction accuracy which raises the question of how to integrate the additional omics. Regardless of the integration strategy, clinical utility and translatability are crucial. Thus, we reasoned a multi-omics approach combined with clinical datasets would improve drug response prediction and clinical relevance. Results: We propose MOLI, a multi-omics late integration method based on deep neural networks. MOLI takes somatic mutation, copy number aberration and gene expression data as input, and integrates them for drug response prediction. MOLI uses type-specific encoding sub-networks to learn features for each omics type, concatenates them into one representation and optimizes this representation via a combined cost function consisting of a triplet loss and a binary cross-entropy loss. The former makes the representations of responder samples more similar to each other and different from the non-responders, and the latter makes this representation predictive of the response values. We validate MOLI on in vitro and in vivo datasets for five chemotherapy agents and two targeted therapeutics. Compared to state-of-the-art single-omics and early integration multi-omics methods, MOLI achieves higher prediction accuracy in external validations. Moreover, a significant improvement in MOLI's performance is observed for targeted drugs when training on a pan-drug input, i.e. using all the drugs with the same target compared to training only on drug-specific inputs. MOLI's high predictive power suggests it may have utility in precision oncology.",
                "authors": [
                    {
                        "name": "Sharifi-Noghabi H."
                    },
                    {
                        "name": "Zolotareva O."
                    },
                    {
                        "name": "Collins C.C."
                    },
                    {
                        "name": "Ester M."
                    }
                ],
                "citationCount": 23,
                "date": "2019-07-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "MOLI: Multi-omics late integration with deep neural networks for drug response prediction"
            },
            "pmcid": "PMC6612815",
            "pmid": "31510700"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ],
    "validated": 1
}