{
    "accessibility": "Open access (with restrictions)",
    "additionDate": "2021-10-28T20:25:02.719884Z",
    "biotoolsCURIE": "biotools:cruxome",
    "biotoolsID": "cruxome",
    "confidence_flag": "tool",
    "cost": "Free of charge (with restrictions)",
    "credit": [
        {
            "email": "david.cram@berrygenomics.com",
            "name": "David S. Cram",
            "typeEntity": "Person"
        },
        {
            "email": "zhangyu001@berrygenomics.com",
            "name": "Yu Zhang",
            "typeEntity": "Person"
        }
    ],
    "description": "Whole Exome Sequencing Data Analyze System. Tool for annotating, interpreting and reporting genetic variants.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                },
                {
                    "term": "Variant classification",
                    "uri": "http://edamontology.org/operation_3225"
                },
                {
                    "term": "Virulence prediction",
                    "uri": "http://edamontology.org/operation_3461"
                }
            ]
        }
    ],
    "homepage": "http://114.251.61.49:10024/cruxome/",
    "language": [
        "Java"
    ],
    "lastUpdate": "2021-10-28T20:25:02.722474Z",
    "name": "Cruxome",
    "operatingSystem": [
        "Mac",
        "Linux",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1186/S12864-021-07728-6",
            "metadata": {
                "abstract": "© 2021, The Author(s).Background: Next-generation sequencing (NGS) is an efficient tool used for identifying pathogenic variants that cause Mendelian disorders. However, the lack of bioinformatics training of researchers makes the interpretation of identified variants a challenge in terms of precision and efficiency. In addition, the non-standardized phenotypic description of human diseases also makes it difficult to establish an integrated analysis pathway for variant annotation and interpretation. Solutions to these bottlenecks are urgently needed. Results: We develop a tool named “Cruxome” to automatically annotate and interpret single nucleotide variants (SNVs) and small insertions and deletions (InDels). Our approach greatly simplifies the current burdensome task of clinical geneticists and scientists to identify the causative pathogenic variants and build personal knowledge reference bases. The integrated architecture of Cruxome offers key advantages such as an interactive and user-friendly interface and the assimilation of electronic health records of the patient. By combining a natural language processing algorithm, Cruxome can efficiently process the clinical description of diseases to HPO standardized vocabularies. By using machine learning, in silico predictive algorithms, integrated multiple databases and supplementary tools, Cruxome can automatically process SNVs and InDels variants (trio-family or proband-only cases) and clinical diagnosis records, then annotate, score, identify and interpret pathogenic variants to finally generate a standardized clinical report following American College of Medical Genetics and Genomics/ Association for Molecular Pathology (ACMG/AMP) guidelines. Cruxome also provides supplementary tools to examine and visualize the genes or variations in historical cases, which can help to better understand the genetic basis of the disease. Conclusions: Cruxome is an efficient tool for annotation and interpretation of variations and dramatically reduces the workload for clinical geneticists and researchers to interpret NGS results, simplifying their decision-making processes. We present an online version of Cruxome, which is freely available to academics and clinical researchers. The site is accessible at http://114.251.61.49:10024/cruxome/.",
                "authors": [
                    {
                        "name": "Han Q."
                    },
                    {
                        "name": "Yang Y."
                    },
                    {
                        "name": "Wu S."
                    },
                    {
                        "name": "Liao Y."
                    },
                    {
                        "name": "Zhang S."
                    },
                    {
                        "name": "Liang H."
                    },
                    {
                        "name": "Cram D.S."
                    },
                    {
                        "name": "Zhang Y."
                    }
                ],
                "date": "2021-12-01T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "Cruxome: a powerful tool for annotating, interpreting and reporting genetic variants"
            },
            "pmcid": "PMC8173893",
            "pmid": "34082700"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Exome sequencing",
            "uri": "http://edamontology.org/topic_3676"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Natural language processing",
            "uri": "http://edamontology.org/topic_0218"
        },
        {
            "term": "Whole genome sequencing",
            "uri": "http://edamontology.org/topic_3673"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        }
    ]
}