{
    "additionDate": "2022-06-13T10:25:52.453786Z",
    "biotoolsCURIE": "biotools:exaid",
    "biotoolsID": "exaid",
    "confidence_flag": "tool",
    "credit": [
        {
            "name": "Adriano Lucieri"
        },
        {
            "name": "Sheraz Ahmed"
        }
    ],
    "description": "A multimodal explanation framework for computer-aided diagnosis of skin lesions.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                }
            ]
        }
    ],
    "homepage": "https://exaid.kl.dfki.de/",
    "lastUpdate": "2022-06-13T10:25:52.456402Z",
    "name": "ExAID",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1016/J.CMPB.2022.106620",
            "metadata": {
                "abstract": "© 2022Background and objectives: One principal impediment in the successful deployment of Artificial Intelligence (AI) based Computer-Aided Diagnosis (CAD) systems in everyday clinical workflows is their lack of transparent decision-making. Although commonly used eXplainable AI (XAI) methods provide insights into these largely opaque algorithms, such explanations are usually convoluted and not readily comprehensible. The explanation of decisions regarding the malignancy of skin lesions from dermoscopic images demands particular clarity, as the underlying medical problem definition is ambiguous in itself. This work presents ExAID (Explainable AI for Dermatology), a novel XAI framework for biomedical image analysis that provides multi-modal concept-based explanations, consisting of easy-to-understand textual explanations and visual maps, to justify the predictions. Methods: Our framework relies on Concept Activation Vectors to map human-understandable concepts to those learned by an arbitrary Deep Learning (DL) based algorithm, and Concept Localisation Maps to highlight those concepts in the input space. This identification of relevant concepts is then used to construct fine-grained textual explanations supplemented by concept-wise location information to provide comprehensive and coherent multi-modal explanations. All decision-related information is presented in a diagnostic interface for use in clinical routines. Moreover, the framework includes an educational mode providing dataset-level explanation statistics as well as tools for data and model exploration to aid medical research and education processes. Results: Through rigorous quantitative and qualitative evaluation of our framework on a range of publicly available dermoscopic image datasets, we show the utility of multi-modal explanations for CAD-assisted scenarios even in case of wrong disease predictions. We demonstrate that concept detectors for the explanation of pre-trained networks reach accuracies of up to 81.46%, which is comparable to supervised networks trained end-to-end. Conclusions: We present a new end-to-end framework for the multi-modal explanation of DL-based biomedical image analysis in Melanoma classification and evaluate its utility on an array of datasets. Since perspicuous explanation is one of the cornerstones of any CAD system, we believe that ExAID will accelerate the transition from AI research to practice by providing dermatologists and researchers with an effective tool that they can both understand and trust. ExAID can also serve as the basis for similar applications in other biomedical fields.",
                "authors": [
                    {
                        "name": "Ahmed S."
                    },
                    {
                        "name": "Bajwa M.N."
                    },
                    {
                        "name": "Braun S.A."
                    },
                    {
                        "name": "Dengel A."
                    },
                    {
                        "name": "Lucieri A."
                    },
                    {
                        "name": "Malik M.I."
                    }
                ],
                "date": "2022-03-01T00:00:00Z",
                "journal": "Computer Methods and Programs in Biomedicine",
                "title": "ExAID: A multimodal explanation framework for computer-aided diagnosis of skin lesions"
            },
            "pmid": "35033756"
        }
    ],
    "toolType": [
        "Web application",
        "Workbench"
    ],
    "topic": [
        {
            "term": "Dermatology",
            "uri": "http://edamontology.org/topic_3404"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ],
    "validated": 1
}
