{
    "accessibility": "Open access",
    "additionDate": "2019-11-14T19:56:08Z",
    "biotoolsCURIE": "biotools:PhysiCell",
    "biotoolsID": "PhysiCell",
    "collectionID": [
        "PerMedCoE"
    ],
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Jonathan Ozik",
            "orcidid": "https://orcid.org/0000-0002-3495-6735",
            "typeEntity": "Person"
        }
    ],
    "description": "PhysiCell is a physics-based cell simulator.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://www.mathcancer.org/blog/physicell-tutorials/"
        }
    ],
    "download": [
        {
            "type": "Software package",
            "url": "https://github.com/MathCancer/PhysiCell",
            "version": "1.9.1"
        }
    ],
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Molecular dynamics",
                    "uri": "http://edamontology.org/operation_2476"
                }
            ]
        }
    ],
    "homepage": "http://physicell.mathcancer.org",
    "language": [
        "C++"
    ],
    "lastUpdate": "2024-11-24T14:51:11.950872Z",
    "license": "BSD-3-Clause",
    "name": "PhysiCell",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1039/c9me00036d",
            "metadata": {
                "abstract": "We present an integrated framework for enabling dynamic exploration of design spaces for cancer immunotherapies with detailed dynamical simulation models on high-performance computing resources. Our framework combines PhysiCell, an open source agent-based simulation platform for cancer and other multicellular systems, and EMEWS, an open source platform for extreme-scale model exploration. We build an agent-based model of immunosurveillance against heterogeneous tumours, which includes spatial dynamics of stochastic tumour-immune contact interactions. We implement active learning and genetic algorithms using high-performance computing workflows to adaptively sample the model parameter space and iteratively discover optimal cancer regression regions within biological and clinical constraints.",
                "authors": [
                    {
                        "name": "An G."
                    },
                    {
                        "name": "Collier N."
                    },
                    {
                        "name": "Heiland R."
                    },
                    {
                        "name": "Macklin P."
                    },
                    {
                        "name": "Ozik J."
                    }
                ],
                "citationCount": 31,
                "date": "2019-08-01T00:00:00Z",
                "journal": "Molecular Systems Design and Engineering",
                "title": "Learning-accelerated discovery of immune-tumour interactions"
            },
            "pmcid": "PMC6690424",
            "pmid": "31497314"
        },
        {
            "doi": "10.1371/journal.pcbi.1005991",
            "metadata": {
                "abstract": "Many multicellular systems problems can only be understood by studying how cells move, grow, divide, interact, and die. Tissue-scale dynamics emerge from systems of many interacting cells as they respond to and influence their microenvironment. The ideal “virtual laboratory” for such multicellular systems simulates both the biochemical microenvironment (the “stage”) and many mechanically and biochemically interacting cells (the “players” upon the stage). PhysiCell—physics-based multicellular simulator—is an open source agent-based simulator that provides both the stage and the players for studying many interacting cells in dynamic tissue microenvironments. It builds upon a multi-substrate biotransport solver to link cell phenotype to multiple diffusing substrates and signaling factors. It includes biologically-driven sub-models for cell cycling, apoptosis, necrosis, solid and fluid volume changes, mechanics, and motility “out of the box.” The C++ code has minimal dependencies, making it simple to maintain and deploy across platforms. PhysiCell has been parallelized with OpenMP, and its performance scales linearly with the number of cells. Simulations up to 105-106cells are feasible on quad-core desktop workstations; larger simulations are attainable on single HPC compute nodes. We demonstrate PhysiCell by simulating the impact of necrotic core biomechanics, 3-D geometry, and stochasticity on the dynamics of hanging drop tumor spheroids and ductal carcinoma in situ (DCIS) of the breast. We demonstrate stochastic motility, chemical and contact-based interaction of multiple cell types, and the extensibility of PhysiCell with examples in synthetic multicellular systems (a “cellular cargo delivery” system, with application to anti-cancer treatments), cancer heterogeneity, and cancer immunology. PhysiCell is a powerful multicellular systems simulator that will be continually improved with new capabilities and performance improvements. It also represents a significant independent code base for replicating results from other simulation platforms. The PhysiCell source code, examples, documentation, and support are available under the BSD license at http://PhysiCell.MathCancer.org and http://PhysiCell.sf.net.",
                "authors": [
                    {
                        "name": "Friedman S.H."
                    },
                    {
                        "name": "Ghaffarizadeh A."
                    },
                    {
                        "name": "Heiland R."
                    },
                    {
                        "name": "Macklin P."
                    },
                    {
                        "name": "Mumenthaler S.M."
                    }
                ],
                "citationCount": 260,
                "date": "2018-02-01T00:00:00Z",
                "journal": "PLoS Computational Biology",
                "title": "PhysiCell: An open source physics-based cell simulator for 3-D multicellular systems"
            },
            "pmcid": "PMC5841829",
            "pmid": "29474446"
        }
    ],
    "relation": [
        {
            "biotoolsID": "physipkpd",
            "type": "usedBy"
        }
    ],
    "topic": [
        {
            "term": "Computer science",
            "uri": "http://edamontology.org/topic_3316"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Systems biology",
            "uri": "http://edamontology.org/topic_2259"
        }
    ],
    "validated": 1
}
