{"credit":[],"labels":{"language":["R"],"topic":[{"term":"Cardiology","uri":"http://edamontology.org/topic_3335"},{"term":"Software engineering","uri":"http://edamontology.org/topic_3372"}]},"publication":[{"abstract":"Translational research in the medical sector is dependent on clear communication between all participants. Visualization helps to represent data from different sources in a comprehensible way across disciplines. Existing tools for clinical data management are usually monolithic and technically challenging to set up, others require a transformation into specific data models while providing mostly non-interactive visualizations or being specialized to very particular use cases. Statistical programming languages (R, Julia) on the other hand offer great flexibility in data analytics, but are harder to access for clinicians with little to no programming expertise. Our software, the Medical Data Explorer (MedEx), aims to fill this gap as light-weight, intuitive, web-based solution with simple data import routes. We couple a modern dynamic web interface with an in-memory database solution for near real-time responsiveness. MedEx provides multiple visualization options (Scatterplot, correlation heatmap, bar chart, grouped boxplot, grouped histogram, coplot) to get an easy overview on the loaded data as well as to perform pattern discovery and elementary statistics. We demonstrate the utility of MedEx, by example, on data from the cardiology research warehouse of Heidelberg University Hospital. In summary, our tool empowers clinicians to conduct their own interactive exploratory data analysis.","authors":["Kindermann A.","Stepanova E.","Hund H.","Geis N.","Malone B.","Dieterich C."],"cit_count":0,"doi":"10.3233/SHTI190818","journal":"Studies in health technology and informatics","pmid":"31483266","title":"MedEx - Data Analytics for Medical Domain Experts in Real-Time","year":"2019-09-03"}],"summary":{"biotoolsCURIE":"biotools:MedEx","biotoolsID":"MedEx","description":"> HOMEPAGE MISSING! | Data Analytics for Medical Domain Experts in Real-Time | Translational research in the medical sector is dependent on clear communication between all participants. Visualization helps to represent data from different sources in a comprehensible way across disciplines. Existing tools for clinical data management are usually monolithic and technically challenging to set up, others require a transformation into specific data models while providing mostly non-interactive visualizations or being specialized to very particular use cases. Statistical programming languages (R, Julia) on the other hand offer great flexibility in data analytics, but are harder to access for clinicians with little to no programming expertise. Our software, the Medical Data Explorer (MedEx), aims to fill this gap as light-weight, intuitive, web-based solution with simple data import routes","homepage":"https://www.ncbi.nlm.nih.gov/pubmed/?term=31483266","name":"MedEx"}}