{
    "accessibility": "Open access",
    "additionDate": "2022-07-14T05:12:42.773702Z",
    "biotoolsCURIE": "biotools:agln",
    "biotoolsID": "agln",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Hong Yu"
        },
        {
            "name": "Jiangyun Li",
            "orcidid": "https://orcid.org/0000-0003-2288-7901"
        }
    ],
    "description": "A framework called Attention guided Global enhancement and Local refinement Network (AGLN) to improve the encoder-decoder network for image segmentation.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                },
                {
                    "term": "Deisotoping",
                    "uri": "http://edamontology.org/operation_3629"
                }
            ]
        }
    ],
    "homepage": "https://github.com/zhasen1996/AGLN",
    "language": [
        "C++",
        "Pascal",
        "Python"
    ],
    "lastUpdate": "2022-07-14T05:12:42.776093Z",
    "license": "MIT",
    "name": "AGLN",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1109/TIP.2022.3166673",
            "metadata": {
                "abstract": "© 1992-2012 IEEE.The encoder-decoder architecture is widely used as a lightweight semantic segmentation network. However, it struggles with a limited performance compared to a well-designed Dilated-FCN model for two major problems. First, commonly used upsampling methods in the decoder such as interpolation and deconvolution suffer from a local receptive field, unable to encode global contexts. Second, low-level features may bring noises to the network decoder through skip connections for the inadequacy of semantic concepts in early encoder layers. To tackle these challenges, a Global Enhancement Method is proposed to aggregate global information from high-level feature maps and adaptively distribute them to different decoder layers, alleviating the shortage of global contexts in the upsampling process. Besides, aLocal Refinement Module is developed by utilizing the decoder features as the semantic guidance to refine the noisy encoder features before the fusion of these two (the decoder features and the encoder features). Then, the two methods are integrated into a Context Fusion Block, and based on that, a novel Attention guided Global enhancement and Local refinement Network (AGLN) is elaborately designed. Extensive experiments on PASCAL Context, ADE20K, and PASCAL VOC 2012 datasets have demonstrated the effectiveness of the proposed approach. In particular, with a vanilla ResNet-101 backbone, AGLN achieves the state-of-the-art result (56.23% mean IOU) on the PASCAL Context dataset. The code is available at https://github.com/zhasen1996/AGLN.",
                "authors": [
                    {
                        "name": "Chen C."
                    },
                    {
                        "name": "Ding M."
                    },
                    {
                        "name": "Li J."
                    },
                    {
                        "name": "Yu H."
                    },
                    {
                        "name": "Zha S."
                    },
                    {
                        "name": "Zhang T."
                    }
                ],
                "date": "2022-01-01T00:00:00Z",
                "journal": "IEEE Transactions on Image Processing",
                "title": "Attention Guided Global Enhancement and Local Refinement Network for Semantic Segmentation"
            },
            "pmid": "35436194"
        }
    ],
    "toolType": [
        "Workbench"
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        }
    ],
    "validated": 1
}
