
{
    "credit": [
        {
            "name": "Contact list",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://gene2drug.tigem.it/contacts.php"
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://gene2drug.tigem.it/about.php"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Pathway analysis",
                    "uri": "http://edamontology.org/operation_2497"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "R"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Library",
            "Web application"
        ],
        "topic": [
            {
                "term": "Molecular interactions, pathways and networks",
                "uri": "http://edamontology.org/topic_0602"
            },
            {
                "term": "Genetics",
                "uri": "http://edamontology.org/topic_3053"
            },
            {
                "term": "Drug development",
                "uri": "http://edamontology.org/topic_3373"
            },
            {
                "term": "Small molecules",
                "uri": "http://edamontology.org/topic_0154"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© The Author(s) 2017. Published by Oxford University Press. All rights reserved. For Permissions, please e-mail: journals.permissions@oup.com. Motivation Drug repositioning has been proposed as an effective shortcut to drug discovery. The availability of large collections of transcriptional responses to drugs enables computational approaches to drug repositioning directly based on measured molecular effects. Results We introduce a novel computational methodology for rational drug repositioning, which exploits the transcriptional responses following treatment with small molecule. Specifically, given a therapeutic target gene, a prioritization of potential effective drugs is obtained by assessing their impact on the transcription of genes in the pathway(s) including the target. We performed in silico validation and comparison with a state-of-art technique based on similar principles. We next performed experimental validation in two different real-case drug repositioning scenarios: (i) upregulation of the glutamate-pyruvate transaminase (GPT), which has been shown to induce reduction of oxalate levels in a mouse model of primary hyperoxaluria, and (ii) activation of the transcription factor TFEB, a master regulator of lysosomal biogenesis and autophagy, whose modulation may be beneficial in neurodegenerative disorders. Availability and implementation A web tool for Gene2drug is freely available at http://gene2drug.tigem.it. An R package is under development and can be obtained from https://github.com/franapoli/gep2pep. Contact dibernardo@tigem.it Supplementary informationSupplementary dataare available at Bioinformatics online.",
            "authors": [
                "Napolitano F.",
                "Carrella D.",
                "Mandriani B.",
                "Pisonero-Vaquero S.",
                "Sirci F.",
                "Medina D.L.",
                "Brunetti-Pierri N.",
                "Di Bernardo D."
            ],
            "cit_count": 3,
            "doi": "10.1093/bioinformatics/btx800",
            "journal": "Bioinformatics",
            "title": "Gene2drug: A computational tool for pathway-based rational drug repositioning",
            "year": "2018-05-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:gene2drug",
        "biotoolsID": "gene2drug",
        "description": "Computational tool for pathway-based rational drug repositioning.",
        "homepage": "http://gene2drug.tigem.it/",
        "name": "Gene2drug"
    }
}