{
    "additionDate": "2019-11-14T20:03:28Z",
    "biotoolsCURIE": "biotools:Tox21",
    "biotoolsID": "Tox21",
    "confidence_flag": "low",
    "credit": [
        {
            "email": "Houck.keith@epa.gov",
            "name": "Katie Paul-Friedman",
            "typeEntity": "Person"
        }
    ],
    "description": "> LOW CONFIDENCE! | > CORRECT NAME OF TOOL COULD ALSO BE 'agonist', 'RXR' | Limited Chemical Structural Diversity Found to Modulate Thyroid Hormone Receptor in the Tox21 Chemical Library | Concentration 5-30% of expected value",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Dimethyl",
                    "uri": "http://edamontology.org/operation_3642"
                }
            ]
        }
    ],
    "homepage": "https://tripod.nih.gov/tox21/samples",
    "lastUpdate": "2019-11-14T20:03:28Z",
    "name": "Tox21",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1289/EHP5314",
            "metadata": {
                "abstract": "© 2019, Public Health Services, US Dept of Health and Human Services. All rights reserved.BACKGROUND: Thyroid hormone receptors (TRs) are critical endocrine receptors that regulate a multitude of processes in adult and developing organisms, and thyroid hormone disruption is of high concern for neurodevelopmental and reproductive toxicities in particular. To date, only a small number of chemical classes have been identified as possible TR modulators, and the receptors appear highly selective with respect to the ligand structural diversity. Thus, the question of whether TRs are an important screening target for protection of human and wildlife health remains. OBJECTIVE: Our goal was to evaluate the hypothesis that there is limited structural diversity among environmentally relevant chemicals capable of modulating TR activity via the collaborative interagency Tox21 project. METHODS: We screened the Tox21 chemical library (8,305 unique structures) in a quantitative high-throughput, cell-based reporter gene assay for TR agonist or antagonist activity. Active compounds were further characterized using additional orthogonal assays, including mammalian one-hybrid assays, coactivator recruitment assays, and a high-throughput, fluorescent imaging, nuclear receptor translocation assay. RESULTS: Known agonist reference chemicals were readily identified in the TR transactivation assay, but only a single novel, direct agonist was found, the pharmaceutical betamipron. Indirect activation of TR through activation of its heterodimer partner, the retinoid-X-receptor (RXR), was also readily detected by confirmation in an RXR agonist assay. Identifying antagonists with high confidence was a challenge with the presence of significant confounding cytotoxicity and other, non-TR-specific mechanisms common to the transactivation assays. Only three pharmaceuticals—mefenamic acid, diclazuril, and risarestat—were confirmed as antagonists. DISCUSSION: The results support limited structural diversity for direct ligand effects on TR and imply that other potential target sites in the thyroid hormone axis should be a greater priority for bioactivity screening for thyroid axis disruptors. https://doi.org/10.1289/EHP5314.",
                "authors": [
                    {
                        "name": "Paul-Friedman K."
                    },
                    {
                        "name": "Martin M."
                    },
                    {
                        "name": "Crofton K.M."
                    },
                    {
                        "name": "Hsu C.-W."
                    },
                    {
                        "name": "Sakamuru S."
                    },
                    {
                        "name": "Zhao J."
                    },
                    {
                        "name": "Xia M."
                    },
                    {
                        "name": "Huang R."
                    },
                    {
                        "name": "Stavreva D.A."
                    },
                    {
                        "name": "Soni V."
                    },
                    {
                        "name": "Varticovski L."
                    },
                    {
                        "name": "Raziuddin R."
                    },
                    {
                        "name": "Hager G.L."
                    },
                    {
                        "name": "Houck K.A."
                    }
                ],
                "citationCount": 3,
                "date": "2019-09-01T00:00:00Z",
                "journal": "Environmental Health Perspectives",
                "title": "Limited chemical structural diversity found to modulate thyroid hormone receptor in the Tox21 chemical library"
            },
            "pmcid": "PMC6792352",
            "pmid": "31566444"
        }
    ],
    "topic": [
        {
            "term": "Compound libraries and screening",
            "uri": "http://edamontology.org/topic_3343"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "NMR",
            "uri": "http://edamontology.org/topic_0593"
        }
    ]
}