{
    "additionDate": "2022-09-28T11:18:53.171663Z",
    "biotoolsCURIE": "biotools:anticp2",
    "biotoolsID": "anticp2",
    "credit": [
        {
            "name": "Gajendra P.S. Raghava",
            "url": "https://webs.iiitd.edu.in/raghava/anticp2/index.html"
        }
    ],
    "description": "AntiCP 2.0 is an updated version of AntiCP, developed to predict and design anticancer peptides with high accuracy",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://webs.iiitd.edu.in/raghava/anticp2/index.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein comparison",
                    "uri": "http://edamontology.org/operation_2997"
                }
            ]
        }
    ],
    "homepage": "https://webs.iiitd.edu.in/raghava/anticp2/index.html",
    "lastUpdate": "2022-09-28T11:19:29.200630Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "https://webs.iiitd.edu.in/raghava/anticp2/index.html"
        }
    ],
    "name": "anticp2",
    "owner": "raghavagps",
    "publication": [
        {
            "metadata": {
                "abstract": "© 2020 The Author(s) 2020. Published by Oxford University Press. All rights reserved. For Permissions, please email: journals.permissions@oup.com.Increasing use of therapeutic peptides for treating cancer has received considerable attention of the scientific community in the recent years. The present study describes the in silico model developed for predicting and designing anticancer peptides (ACPs). ACPs residue composition analysis show the preference of A, F, K, L and W. Positional preference analysis revealed that residues A, F and K are favored at N-terminus and residues L and K are preferred at C-terminus. Motif analysis revealed the presence of motifs like LAKLA, AKLAK, FAKL and LAKL in ACPs. Machine learning models were developed using various input features and implementing different machine learning classifiers on two datasets main and alternate dataset. In the case of main dataset, dipeptide composition based ETree classifier model achieved maximum Matthews correlation coefficient (MCC) of 0.51 and 0.83 area under receiver operating characteristics (AUROC) on the training dataset. In the case of alternate dataset, amino acid composition based ETree classifier performed best and achieved the highest MCC of 0.80 and AUROC of 0.97 on the training dataset. Five-fold cross-validation technique was implemented for model training and testing, and their performance was also evaluated on the validation dataset. Best models were implemented in the webserver AntiCP 2.0, which is freely available at https://webs.iiitd.edu.in/raghava/anticp2/. The webserver is compatible with multiple screens such as iPhone, iPad, laptop and android phones. The standalone version of the software is available at GitHub; docker-based container also developed.",
                "authors": [
                    {
                        "name": "Agrawal P."
                    },
                    {
                        "name": "Bhagat D."
                    },
                    {
                        "name": "Mahalwal M."
                    },
                    {
                        "name": "Raghava G.P.S."
                    },
                    {
                        "name": "Sharma N."
                    }
                ],
                "citationCount": 39,
                "date": "2021-05-01T00:00:00Z",
                "journal": "Briefings in Bioinformatics",
                "title": "AntiCP 2.0: An updated model for predicting anticancer peptides"
            },
            "pmid": "32770192"
        }
    ],
    "topic": [
        {
            "term": "Computational biology",
            "uri": "http://edamontology.org/topic_3307"
        }
    ]
}
