{
    "additionDate": "2021-01-18T11:04:56Z",
    "biotoolsCURIE": "biotools:kobt",
    "biotoolsID": "kobt",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "motsingerreifaa@nih.gov",
            "name": "Alison A Motsinger-Reif",
            "typeEntity": "Person"
        }
    ],
    "description": "Knockoff Boosted Tree for Model-Free Variable Selection.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Feature selection",
                    "uri": "http://edamontology.org/operation_3936"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "https://cran.r-project.org/web/packages/KOBT/index.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2024-11-24T20:44:03.979547Z",
    "license": "GPL-2.0",
    "name": "KOBT",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btaa770",
            "metadata": {
                "abstract": "Motivation: The recently proposed knockoff filter is a general framework for controlling the false discovery rate (FDR) when performing variable selection. This powerful new approach generates a 'knockoff' of each variable tested for exact FDR control. Imitation variables that mimic the correlation structure found within the original variables serve as negative controls for statistical inference. Current applications of knockoff methods use linear regression models and conduct variable selection only for variables existing in model functions. Here, we extend the use of knockoffs for machine learning with boosted trees, which are successful and widely used in problems where no prior knowledge of model function is required. However, currently available importance scores in tree models are insufficient for variable selection with FDR control. Results: We propose a novel strategy for conducting variable selection without prior model topology knowledge using the knockoff method with boosted tree models. We extend the current knockoff method to model-free variable selection through the use of tree-based models. Additionally, we propose and evaluate two new sampling methods for generating knockoffs, namely the sparse covariance and principal component knockoff methods. We test and compare these methods with the original knockoff method regarding their ability to control type I errors and power. In simulation tests, we compare the properties and performance of importance test statistics of tree models. The results include different combinations of knockoffs and importance test statistics. We consider scenarios that include main-effect, interaction, exponential and second-order models while assuming the true model structures are unknown. We apply our algorithm for tumor purity estimation and tumor classification using Cancer Genome Atlas (TCGA) gene expression data. Our results show improved discrimination between difficult-to-discriminate cancer types.",
                "authors": [
                    {
                        "name": "Jiang T."
                    },
                    {
                        "name": "Li Y."
                    },
                    {
                        "name": "Motsinger-Reif A.A."
                    }
                ],
                "citationCount": 7,
                "date": "2021-04-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Knockoff boosted tree for model-free variable selection"
            },
            "pmcid": "PMC8128453",
            "pmid": "32966559"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ]
}
