{
    "additionDate": "2019-11-14T19:59:34Z",
    "biotoolsCURIE": "biotools:ALS",
    "biotoolsID": "ALS",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "a.schoenhuth@cwi.nl",
            "name": "Alexander Schönhuth",
            "typeEntity": "Person"
        }
    ],
    "description": "Using the structure of genome data in the design of deep neural networks for predicting amyotrophic lateral sclerosis from genotype | Deep learning frame for genetic disease | Synthetic data https://drive.google.com/open?id=1Mya0YdT4Hf9wUfbcX6y5mubEFWky6Jg-",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Imputation",
                    "uri": "http://edamontology.org/operation_3557"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                }
            ]
        }
    ],
    "homepage": "https://github.com/byin-cwi/ALS-Deeplearning",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-12-09T12:54:48Z",
    "name": "ALS",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ369",
            "metadata": {
                "abstract": "© 2019 The Author(s) 2019. Published by Oxford University Press.Motivation: Amyotrophic lateral sclerosis (ALS) is a neurodegenerative disease caused by aberrations in the genome. While several disease-causing variants have been identified, a major part of heritability remains unexplained. ALS is believed to have a complex genetic basis where non-additive combinations of variants constitute disease, which cannot be picked up using the linear models employed in classical genotype-phenotype association studies. Deep learning on the other hand is highly promising for identifying such complex relations. We therefore developed a deep-learning based approach for the classification of ALS patients versus healthy individuals from the Dutch cohort of the Project MinE dataset. Based on recent insight that regulatory regions harbor the majority of disease-associated variants, we employ a two-step approach: first promoter regions that are likely associated to ALS are identified, and second individuals are classified based on their genotype in the selected genomic regions. Both steps employ a deep convolutional neural network. The network architecture accounts for the structure of genome data by applying convolution only to parts of the data where this makes sense from a genomics perspective. Results: Our approach identifies potentially ALS-associated promoter regions, and generally outperforms other classification methods. Test results support the hypothesis that non-additive combinations of variants contribute to ALS. Architectures and protocols developed are tailored toward processing population-scale, whole-genome data. We consider this a relevant first step toward deep learning assisted genotype-phenotype association in whole genome-sized data.",
                "authors": [
                    {
                        "name": "Yin B."
                    },
                    {
                        "name": "Balvert M."
                    },
                    {
                        "name": "Van Der Spek R.A.A."
                    },
                    {
                        "name": "Dutilh B.E."
                    },
                    {
                        "name": "Bohte S."
                    },
                    {
                        "name": "Veldink J."
                    },
                    {
                        "name": "Schonhuth A."
                    }
                ],
                "citationCount": 8,
                "date": "2019-07-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Using the structure of genome data in the design of deep neural networks for predicting amyotrophic lateral sclerosis from genotype"
            },
            "pmcid": "PMC6612814",
            "pmid": "31510706"
        }
    ],
    "topic": [
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ],
    "validated": 1
}