{
    "additionDate": "2020-01-14T09:06:50Z",
    "biotoolsCURIE": "biotools:Jasmine",
    "biotoolsID": "Jasmine",
    "confidence_flag": "tool",
    "description": "a Java pipeline for isomiR characterization in miRNA-Seq Data.\n\nMOTIVATION:The existence of complex subpopulations of miRNA isoforms, or isomiRs, is well established. While many tools exist for investigating isomiR populations, they differ in how they characterize an isomiR, making it difficult to compare results across different tools. Thus, there is a need for a more comprehensive and systematic standard for defining isomiRs. Such a standard would allow investigation of isomiR population structure in progressively more refined sub-populations, permitting the identification of more subtle changes between conditions and leading to an improved understanding of the processes that generate these differences. RESULTS:We developed Jasmine, a software tool that incorporates a hierarchal framework for characterizing isomiR populations",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Read mapping",
                    "uri": "http://edamontology.org/operation_3198"
                },
                {
                    "term": "miRNA expression analysis",
                    "uri": "http://edamontology.org/operation_3792"
                }
            ]
        }
    ],
    "homepage": "https://bitbucket.org/bipous/jasmine/src/master/",
    "language": [
        "R",
        "Java"
    ],
    "lastUpdate": "2020-12-14T13:48:30Z",
    "name": "Jasmine",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ806",
            "metadata": {
                "abstract": "© The Author(s) 2019. Published by Oxford University Press.Motivation: The existence of complex subpopulations of miRNA isoforms, or isomiRs, is well established. While many tools exist for investigating isomiR populations, they differ in how they characterize an isomiR, making it difficult to compare results across different tools. Thus, there is a need for a more comprehensive and systematic standard for defining isomiRs. Such a standard would allow investigation of isomiR population structure in progressively more refined sub-populations, permitting the identification of more subtle changes between conditions and leading to an improved understanding of the processes that generate these differences. Results: We developed Jasmine, a software tool that incorporates a hierarchal framework for characterizing isomiR populations. Jasmine is a Java application that can process raw read data in fastq/fasta format, or mapped reads in SAM format to produce a detailed characterization of isomiR populations. Thus, Jasmine can reveal structure not apparent in a standard miRNA-Seq analysis pipeline. Availability and implementation: Jasmine is implemented in Java and R and freely available at bitbucket https://bitbucket.org/bipous/jasmine/src/master/.",
                "authors": [
                    {
                        "name": "Zhong X."
                    },
                    {
                        "name": "Pla A."
                    },
                    {
                        "name": "Rayner S."
                    }
                ],
                "citationCount": 3,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Jasmine: A Java pipeline for isomiR characterization in miRNA-Seq data"
            },
            "pmid": "31681943"
        }
    ],
    "toolType": [
        "Command-line tool",
        "Library"
    ],
    "topic": [
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ],
    "validated": 1
}