{
    "additionDate": "2019-11-14T18:18:04Z",
    "biotoolsCURIE": "biotools:PeakProbe",
    "biotoolsID": "PeakProbe",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "psmith66@fordham.edu",
            "name": "Paul Smith",
            "typeEntity": "Person"
        }
    ],
    "description": "Prediction of models for ordered solvent in macromolecular structures by a classifier based upon resolution-independent projections of local feature data | Tool for identifying/classifying solvent molecules in macromolecular x-ray crystal structures | -- Paul Smith, PhD. Assistant Prof. of Chemistry, FordhamUniversity (psmith66@fordham.edu) -- Laurel Jones, PhD Candidate,Northwestern University -- Michael Tynes, Data Sciences GraduateProgram, Fordham University | -- PeakProbe must be run under the \"phenix.python\" environment or be made aware of the locations of all necessary CCTBX imports -- A PDB file and structure factor data are required and can be specified in any order or suitable format as per PHENIX norms -- The program has several modes of operation and many configurable parameters, but the essentials are covered below",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Post-translation modification site prediction",
                    "uri": "http://edamontology.org/operation_0417"
                },
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Side chain modelling",
                    "uri": "http://edamontology.org/operation_0480"
                }
            ]
        }
    ],
    "homepage": "https://github.com/paulsmith638/PeakProbe.git",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-01-05T10:28:46Z",
    "name": "PeakProbe",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1107/S2059798319008933",
            "metadata": {
                "abstract": "© 2019 International Union of Crystallography.Current software tools for the automated building of models for macromolecular X-ray crystal structures are capable of assembling high-quality models for ordered macromolecule and small-molecule scattering components with minimal or no user supervision. Many of these tools also incorporate robust functionality for modelling the ordered water molecules that are found in nearly all macromolecular crystal structures. However, no current tools focus on differentiating these ubiquitous water molecules from other frequently occurring multi-atom solvent species, such as sulfate, or the automated building of models for such species. PeakProbe has been developed specifically to address the need for such a tool. PeakProbe predicts likely solvent models for a given point (termed a 'peak') in a structure based on analysis ('probing') of its local electron density and chemical environment. PeakProbe maps a total of 19 resolution-dependent features associated with electron density and two associated with the local chemical environment to a two-dimensional score space that is independent of resolution. Peaks are classified based on the relative frequencies with which four different classes of solvent (including water) are observed within a given region of this score space as determined by large-scale sampling of solvent models in the Protein Data Bank. Designed to classify peaks generated from difference density maxima, PeakProbe also incorporates functionality for identifying peaks associated with model errors or clusters of peaks likely to correspond to multi-atom solvent, and for the validation of existing solvent models using solvent-omit electron-density maps. When tasked with classifying peaks into one of four distinct solvent classes, PeakProbe achieves greater than 99% accuracy for both peaks derived directly from the atomic coordinates of existing solvent models and those based on difference density maxima. While the program is still under development, a fully functional version is publicly available. PeakProbe makes extensive use of cctbx libraries, and requires a PHENIX licence and an up-to-date phenix.python environment for execution.",
                "authors": [
                    {
                        "name": "Jones L."
                    },
                    {
                        "name": "Tynes M."
                    },
                    {
                        "name": "Smith P."
                    }
                ],
                "date": "2019-08-01T00:00:00Z",
                "journal": "Acta Crystallographica Section D: Structural Biology",
                "title": "Prediction of models for ordered solvent in macromolecular structures by a classifier based upon resolution-independent projections of local feature data"
            },
            "pmcid": "PMC6677017",
            "pmid": "31373570"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Chemistry",
            "uri": "http://edamontology.org/topic_3314"
        }
    ],
    "validated": 1
}