
{
    "credit": [
        {
            "email": "lukas.habegger@yale.edu",
            "name": "Lukas Habegger",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://info.gersteinlab.org/RSEQtools"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "RNA-Seq quantification",
                    "uri": "http://edamontology.org/operation_3800"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "C"
        ],
        "license": "CC-BY-NC-4.0",
        "maturity": "Mature",
        "operatingSystem": [
            "Linux",
            "Mac"
        ],
        "toolType": [
            "Suite"
        ],
        "topic": [
            {
                "term": "RNA-Seq",
                "uri": "http://edamontology.org/topic_3170"
            },
            {
                "term": "Sequence analysis",
                "uri": "http://edamontology.org/topic_0080"
            }
        ]
    },
    "publication": [
        {
            "abstract": "Summary: The advent of next-generation sequencing for functional genomics has given rise to quantities of sequence information that are often so large that they are difficult to handle. Moreover, sequence reads from a specific individual can contain sufficient information to potentially identify and genetically characterize that person, raising privacy concerns. In order to address these issues, we have developed the Mapped Read Format (MRF), a compact data summary format for both short and long read alignments that enables the anonymization of confidential sequence information, while allowing one to still carry out many functional genomics studies. We have developed a suite of tools (RSEQtools) that use this format for the analysis of RNA-Seq experiments. These tools consist of a set of modules that perform common tasks such as calculating gene expression values, generating signal tracks of mapped reads and segmenting that signal into actively transcribed regions. Moreover, the tools can readily be used to build customizable RNA-Seq workflows. In addition to the anonymization afforded by MRF, this format also facilitates the decoupling of the alignment of reads from downstream analyses. © The Author(s) 2010. Published by Oxford University Press.",
            "authors": [
                "Habegger L.",
                "Sboner A.",
                "Gianoulis T.A.",
                "Rozowsky J.",
                "Agarwal A.",
                "Snyder M.",
                "Gerstein M."
            ],
            "cit_count": 67,
            "journal": "Bioinformatics",
            "pmid": "21134889",
            "title": "RSEQtools: A modular framework to analyze RNA-Seq data using compact, anonymized data summaries",
            "year": "2011-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:rseqtools",
        "biotoolsID": "rseqtools",
        "description": "The tool includes a format specification for RNA-Seq data that provides confidentially-aware; data summaries as well as several tools for performing common analyses: expression measurements (e.g. RPKMs), creation of signal tracks, segmentation, annotation manipulations, etc.",
        "homepage": "http://rseqtools.gersteinlab.org/",
        "name": "RSEQtools"
    }
}