{"credit":[{"name":"SIB Swiss Institute of Bioinformatics","typeEntity":"Institute","typeRoles":["Provider"]},{"email":"Evgeny.Zdobnov@isb-sib.ch","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"http://cegg.unige.ch/mirortho/info"}],"function":[{"note":"Query and retrieval","operation":[{"term":"Query and retrieval","uri":"http://edamontology.org/operation_0224"}]}],"labels":{"language":["Python"],"operatingSystem":["Linux","Windows","Mac"],"toolType":["Database portal"],"topic":[{"term":"Genomics","uri":"http://edamontology.org/topic_0622"},{"term":"Phylogeny","uri":"http://edamontology.org/topic_0084"},{"term":"Sequence analysis","uri":"http://edamontology.org/topic_0080"},{"term":"Functional, regulatory and non-coding RNA","uri":"http://edamontology.org/topic_0659"},{"term":"Evolutionary biology","uri":"http://edamontology.org/topic_3299"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://expasy.org"}],"publication":[{"abstract":"MicroRNAs (miRNAs) are short, non-protein coding RNAs that direct the widespread phenomenon of post-transcriptional regulation of metazoan genes. The mature ∼22-nt long RNA molecules are processed from genome-encoded stem-loop structured precursor genes. Hundreds of such genes have been experimentally validated in vertebrate genomes, yet their discovery remains challenging, and substantially higher numbers have been estimated. The miROrtho database (http://cegg.unige.ch/ mirortho) presents the results of a comprehensive computational survey of miRNA gene candidates across the majority of sequenced metazoan genomes. We designed and applied a three-tier analysis pipeline: (i) an SVM-based ab initio screen for potent hairpins, plus homologs of known miRNAs, (ii) an orthology delineation procedure and (iii) an SVM-based classifier of the ortholog multiple sequence alignments. The web interface provides direct access to putative miRNA annotations, ortholog multiple alignments, RNA secondary structure conservation, and sequence data. The miROrtho data are conceptually complementary to the miRBase catalog of experimentally verified miRNA sequences, providing a consistent comparative genomics perspective as well as identifying many novel miRNA genes with strong evolutionary support. © 2008 The Author(s).","authors":["Gerlach D.","Kriventseva E.V.","Rahman N.","Vejnar C.E.","Zdobnov E.M."],"cit_count":50,"doi":"10.1093/nar/gkn707","journal":"Nucleic Acids Research","title":"miROrtho: Computational survey of microRNA genes","type":"Primary","year":"2009-01-09"}],"summary":{"biotoolsCURIE":"biotools:mirortho","biotoolsID":"mirortho","description":"miROrtho contains predictions of precursor miRNA genes covering several animal genomes combining orthology and a Support Vector Machine. We provide homology extended alignments of already known miRBase families and putative miRNA families exclusively predicted by our SVM and orthology pipeline.","homepage":"http://cegg.unige.ch/mirortho","name":"miROrtho"}}