{
    "additionDate": "2018-06-21T15:50:35Z",
    "biotoolsCURIE": "biotools:bartender",
    "biotoolsID": "bartender",
    "credit": [
        {
            "email": "sasha.levy@stonybrook.edu",
            "name": "Sasha Levy",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "song.wu@stonybrook.edu",
            "name": "Song Wu",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Fast and accurate clustering algorithm to count barcode reads.",
    "documentation": [
        {
            "type": "General",
            "url": "https://github.com/LaoZZZZZ/bartender-1.1"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence clustering",
                    "uri": "http://edamontology.org/operation_0291"
                },
                {
                    "term": "Community profiling",
                    "uri": "http://edamontology.org/operation_3200"
                }
            ]
        }
    ],
    "homepage": "https://github.com/LaoZZZZZ/bartender-1.1",
    "language": [
        "C++"
    ],
    "lastUpdate": "2018-12-10T12:58:59Z",
    "name": "Bartender",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btx655",
            "metadata": {
                "abstract": "© The Author 2017. Published by Oxford University Press. All rights reserved. Motivation Barcode sequencing (bar-seq) is a high-throughput, and cost effective method to assay large numbers of cell lineages or genotypes in complex cell pools. Because of its advantages, applications for bar-seq are quickly growing - from using neutral random barcodes to study the evolution of microbes or cancer, to using pseudo-barcodes, such as shRNAs or sgRNAs to simultaneously screen large numbers of cell perturbations. However, the computational pipelines for bar-seq clustering are not well developed. Available methods often yield a high frequency of under-clustering artifacts that result in spurious barcodes, or over-clustering artifacts that group distinct barcodes together. Here, we developed Bartender, an accurate clustering algorithm to detect barcodes and their abundances from raw next-generation sequencing data. Results In contrast with existing methods that cluster based on sequence similarity alone, Bartender uses a modified two-sample proportion test that also considers cluster size. This modification results in higher accuracy and lower rates of under- and over-clustering artifacts. Additionally, Bartender includes unique molecular identifier handling and a 'multiple time point' mode that matches barcode clusters between different clustering runs for seamless handling of time course data. Bartender is a set of simple-to-use command line tools that can be performed on a laptop at comparable run times to existing methods.",
                "authors": [
                    {
                        "name": "Zhao L."
                    },
                    {
                        "name": "Liu Z."
                    },
                    {
                        "name": "Levy S.F."
                    },
                    {
                        "name": "Wu S."
                    }
                ],
                "citationCount": 3,
                "date": "2018-03-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Bartender: A fast and accurate clustering algorithm to count barcode reads"
            }
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Gene and protein families",
            "uri": "http://edamontology.org/topic_0623"
        }
    ],
    "validated": 1,
    "version": [
        "1.1"
    ]
}