{
    "additionDate": "2017-01-17T14:56:16Z",
    "biotoolsCURIE": "biotools:mergeomics",
    "biotoolsID": "mergeomics",
    "credit": [
        {
            "email": "darneson@ucla.edu",
            "name": "Douglas Arneson",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "xyang123@ucla.edu",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Multidimensional Data Integration. This web aplication serves as a flexible framework for integrating multidimensional omics-disease associations, functional genomics, canonical pathways and gene-gene interaction networks to generate mechanistic hypotheses. It includes two main parts: a Marker Set Enrichment Analysis (MSEA) and a weighted Key Driver Analysis (wKDA).",
    "documentation": [
        {
            "type": [
                "Training material"
            ],
            "url": "http://mergeomics.research.idre.ucla.edu/tutorial.php"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Pathway or network analysis",
                    "uri": "http://edamontology.org/operation_2497"
                }
            ]
        }
    ],
    "homepage": "http://mergeomics.research.idre.ucla.edu/home.php",
    "language": [
        "PHP",
        "JavaScript"
    ],
    "lastUpdate": "2018-12-10T12:58:58Z",
    "license": "GPL-2.0",
    "link": [
        {
            "note": "Bioconductor package of Mergeomics",
            "type": [
                "Software catalogue"
            ],
            "url": "https://bioconductor.org/packages/release/bioc/html/Mergeomics.html"
        }
    ],
    "name": "Mergeomics",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "bioconductor_import",
    "publication": [
        {
            "doi": "10.1186/s12864-016-3057-8",
            "metadata": {
                "abstract": "© 2016 The Author(s).Background: Human diseases are commonly the result of multidimensional changes at molecular, cellular, and systemic levels. Recent advances in genomic technologies have enabled an outpour of omics datasets that capture these changes. However, separate analyses of these various data only provide fragmented understanding and do not capture the holistic view of disease mechanisms. To meet the urgent needs for tools that effectively integrate multiple types of omics data to derive biological insights, we have developed Mergeomics, a computational pipeline that integrates multidimensional disease association data with functional genomics and molecular networks to retrieve biological pathways, gene networks, and central regulators critical for disease development. Results: To make the Mergeomics pipeline available to a wider research community, we have implemented an online, user-friendly web server (http://mergeomics.research.idre.ucla.edu/). The web server features a modular implementation of the Mergeomics pipeline with detailed tutorials. Additionally, it provides curated genomic resources including tissue-specific expression quantitative trait loci, ENCODE functional annotations, biological pathways, and molecular networks, and offers interactive visualization of analytical results. Multiple computational tools including Marker Dependency Filtering (MDF), Marker Set Enrichment Analysis (MSEA), Meta-MSEA, and Weighted Key Driver Analysis (wKDA) can be used separately or in flexible combinations. User-defined summary-level genomic association datasets (e.g., genetic, transcriptomic, epigenomic) related to a particular disease or phenotype can be uploaded and computed real-time to yield biologically interpretable results, which can be viewed online and downloaded for later use. Conclusions: Our Mergeomics web server offers researchers flexible and user-friendly tools to facilitate integration of multidimensional data into holistic views of disease mechanisms in the form of tissue-specific key regulators, biological pathways, and gene networks.",
                "authors": [
                    {
                        "name": "Arneson D."
                    },
                    {
                        "name": "Bhattacharya A."
                    },
                    {
                        "name": "Shu L."
                    },
                    {
                        "name": "Makinen V.-P."
                    },
                    {
                        "name": "Yang X."
                    }
                ],
                "citationCount": 26,
                "date": "2016-09-09T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "Mergeomics: A web server for identifying pathological pathways, networks, and key regulators via multidimensional data integration"
            },
            "pmcid": "PMC5016927",
            "pmid": "27612452",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application",
        "Library",
        "Workflow",
        "Suite"
    ],
    "topic": [
        {
            "term": "Omics",
            "uri": "http://edamontology.org/topic_3391"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Functional genomics",
            "uri": "http://edamontology.org/topic_0085"
        },
        {
            "term": "Experimental design and studies",
            "uri": "http://edamontology.org/topic_3678"
        },
        {
            "term": "GWAS study",
            "uri": "http://edamontology.org/topic_3517"
        }
    ],
    "validated": 1
}