{
    "additionDate": "2021-03-19T09:03:10Z",
    "biotoolsCURIE": "biotools:iupacpal",
    "biotoolsID": "iupacpal",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "solon.pissis@cwi.nl",
            "name": "Solon P. Pissis",
            "orcidid": "https://orcid.org/0000-0002-1445-1932",
            "typeEntity": "Person"
        }
    ],
    "description": "Efficient identification of inverted repeats in IUPAC-encoded DNA sequences.\n\nAn inverted repeat is a DNA sequence followed downstream by its reverse complement, potentially with a gap in the centre.\n\nIUPACpal is an exact tool for efficient identification of inverted repeats in IUPAC-encoded DNA sequences as substrings of a large text, allowing also for potential mismatches and gaps.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genome indexing",
                    "uri": "http://edamontology.org/operation_3211"
                },
                {
                    "term": "Repeat sequence analysis",
                    "uri": "http://edamontology.org/operation_0237"
                },
                {
                    "term": "Reverse complement",
                    "uri": "http://edamontology.org/operation_0363"
                }
            ]
        }
    ],
    "homepage": "https://sourceforge.net/projects/iupacpal/",
    "lastUpdate": "2021-04-05T08:57:52Z",
    "name": "IUPACPAL",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1186/S12859-021-03983-2",
            "metadata": {
                "abstract": "© 2021, The Author(s).Background: An inverted repeat is a DNA sequence followed downstream by its reverse complement, potentially with a gap in the centre. Inverted repeats are found in both prokaryotic and eukaryotic genomes and they have been linked with countless possible functions. Many international consortia provide a comprehensive description of common genetic variation making alternative sequence representations, such as IUPAC encoding, necessary for leveraging the full potential of such broad variation datasets. Results: We present IUPACpal, an exact tool for efficient identification of inverted repeats in IUPAC-encoded DNA sequences allowing also for potential mismatches and gaps in the inverted repeats. Conclusion: Within the parameters that were tested, our experimental results show that IUPACpal compares favourably to a similar application packaged with EMBOSS. We show that IUPACpal identifies many previously unidentified inverted repeats when compared with EMBOSS, and that this is also performed with orders of magnitude improved speed.",
                "authors": [
                    {
                        "name": "Alamro H."
                    },
                    {
                        "name": "Alzamel M."
                    },
                    {
                        "name": "Iliopoulos C.S."
                    },
                    {
                        "name": "Pissis S.P."
                    },
                    {
                        "name": "Watts S."
                    }
                ],
                "date": "2021-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "IUPACpal: efficient identification of inverted repeats in IUPAC-encoded DNA sequences"
            },
            "pmcid": "PMC7866733",
            "pmid": "33549041"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Sequence composition, complexity and repeats",
            "uri": "http://edamontology.org/topic_0157"
        }
    ]
}
