{
    "accessibility": "Open access",
    "additionDate": "2023-02-26T12:50:13.399292Z",
    "biotoolsCURIE": "biotools:omicsgat",
    "biotoolsID": "omicsgat",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "wzhang.cs@ucf.edu",
            "name": "Wei Zhang",
            "typeEntity": "Person"
        },
        {
            "name": "Joseph Filipek"
        },
        {
            "name": "Khandakar Tanvir Ahmed"
        },
        {
            "name": "Sudipto Baul"
        }
    ],
    "description": "omicsGAT is a graph attention network based framework for cancer subtype analysis. It performs the task of classification or clustering of patient/cell samples based on the gene expression. It strives to secure important information while discarding the rest by assigning different attention coefficients to the neighbors of a sample in a network/graph.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Expression profile clustering",
                    "uri": "http://edamontology.org/operation_0313"
                },
                {
                    "term": "RNA-Seq quantification",
                    "uri": "http://edamontology.org/operation_3800"
                }
            ]
        }
    ],
    "homepage": "https://github.com/CompbioLabUCF/omicsGAT",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T14:57:42.817469Z",
    "license": "Not licensed",
    "name": "omicsGAT",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.3390/ijms231810220",
            "metadata": {
                "abstract": "The use of high-throughput omics technologies is becoming increasingly popular in all facets of biomedical science. The mRNA sequencing (RNA-seq) method reports quantitative measures of more than tens of thousands of biological features. It provides a more comprehensive molecular perspective of studied cancer mechanisms compared to traditional approaches. Graph-based learning models have been proposed to learn important hidden representations from gene expression data and network structure to improve cancer outcome prediction, patient stratification, and cell clustering. However, these graph-based methods cannot rank the importance of the different neighbors for a particular sample in the downstream cancer subtype analyses. In this study, we introduce omicsGAT, a graph attention network (GAT) model to integrate graph-based learning with an attention mechanism for RNA-seq data analysis. The multi-head attention mechanism in omicsGAT can more effectively secure information of a particular sample by assigning different attention coefficients to its neighbors. Comprehensive experiments on The Cancer Genome Atlas (TCGA) breast cancer and bladder cancer bulk RNA-seq data and two single-cell RNA-seq datasets validate that (1) the proposed model can effectively integrate neighborhood information of a sample and learn an embedding vector to improve disease phenotype prediction, cancer patient stratification, and cell clustering of the sample and (2) the attention matrix generated from the multi-head attention coefficients provides more useful information compared to the sample correlation-based adjacency matrix. From the results, we can conclude that some neighbors play a more important role than others in cancer subtype analyses of a particular sample based on the attention coefficient.",
                "authors": [
                    {
                        "name": "Ahmed K.T."
                    },
                    {
                        "name": "Baul S."
                    },
                    {
                        "name": "Filipek J."
                    },
                    {
                        "name": "Zhang W."
                    }
                ],
                "citationCount": 8,
                "date": "2022-09-01T00:00:00Z",
                "journal": "International Journal of Molecular Sciences",
                "title": "omicsGAT: Graph Attention Network for Cancer Subtype Analyses"
            },
            "pmcid": "PMC9499656",
            "pmid": "36142140"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ]
}
