{
    "additionDate": "2019-11-14T19:49:22Z",
    "biotoolsCURIE": "biotools:TwinsUK",
    "biotoolsID": "TwinsUK",
    "confidence_flag": "high",
    "description": "The UK Adult Twin Registry Update | If you would like access to data or samples from the Department Of Twin Research & Genetic Epidemiology or are interested in proposing a collaboration with us, please first follow the link DTR Policy Document for data access which will give you the necessary background information | You will then need to complete a “Data Access Proposal Form” (links below) and email the completed form to the Data Access Manager Victoria Vazquez or fax to +44 (0)20 7188 6718 for consideration by the Department of Twin Research Executive Committee | No attempt should be made to link or combine the data provided under this agreement to other information or archived data available for the data sets provided, even if access to that data has been formally granted to you, or it is freely available without restriction, unless specific permission to do so has been received from the TwinsUK TREC | The proposal should specify the data and or samples required clearly",
    "editPermission": {
        "type": "public"
    },
    "homepage": "http://twinsuk.ac.uk/resources-for-researchers/access-our-data/",
    "lastUpdate": "2019-11-14T19:49:22Z",
    "name": "TwinsUK",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1017/THG.2019.65",
            "metadata": {
                "abstract": "© The Author(s) 2019 This is an Open Access article, distributed under the terms of the Creative Commons Attribution licence (https://creativecommons.org/licenses/by/4.0/), which permits unrestricted re-use, distribution, and reproduction in any medium, provided the original work is properly cited.TwinsUK is the largest cohort of community-dwelling adult twins in the UK. The registry comprises over 14,000 volunteer twins (14,838 including mixed, single and triplets); it is predominantly female (82%) and middle-aged (mean age 59). In addition, over 1800 parents and siblings of twins are registered volunteers. During the last 27 years, TwinsUK has collected numerous questionnaire responses, physical/cognitive measures and biological measures on over 8500 subjects. Data were collected alongside four comprehensive phenotyping clinical visits to the Department of Twin Research and Genetic Epidemiology, King's College London. Such collection methods have resulted in very detailed longitudinal clinical, biochemical, behavioral, dietary and socioeconomic cohort characterization; it provides a multidisciplinary platform for the study of complex disease during the adult life course, including the process of healthy aging. The major strength of TwinsUK is the availability of several 'omic' technologies for a range of sample types from participants, which includes genomewide scans of single-nucleotide variants, next-generation sequencing, metabolomic profiles, microbiomics, exome sequencing, epigenetic markers, gene expression arrays, RNA sequencing and telomere length measures. TwinsUK facilitates and actively encourages sharing the 'TwinsUK' resource with the scientific community - interested researchers may request data via the TwinsUK website (http://twinsuk.ac.uk/resources-for-researchers/access-our-data/) for their own use or future collaboration with the study team. In addition, further cohort data collection is planned via the Wellcome Open Research gateway (https://wellcomeopenresearch.org/gateways). The current article presents an up-to-date report on the application of technological advances, new study procedures in the cohort and future direction of TwinsUK.",
                "authors": [
                    {
                        "name": "Verdi S."
                    },
                    {
                        "name": "Abbasian G."
                    },
                    {
                        "name": "Bowyer R.C.E."
                    },
                    {
                        "name": "Lachance G."
                    },
                    {
                        "name": "Yarand D."
                    },
                    {
                        "name": "Christofidou P."
                    },
                    {
                        "name": "Mangino M."
                    },
                    {
                        "name": "Menni C."
                    },
                    {
                        "name": "Bell J.T."
                    },
                    {
                        "name": "Falchi M."
                    },
                    {
                        "name": "Small K.S."
                    },
                    {
                        "name": "Williams F.M.K."
                    },
                    {
                        "name": "Hammond C.J."
                    },
                    {
                        "name": "Hart D.J."
                    },
                    {
                        "name": "Spector T.D."
                    },
                    {
                        "name": "Steves C.J."
                    }
                ],
                "date": "2019-01-01T00:00:00Z",
                "journal": "Twin Research and Human Genetics",
                "title": "TwinsUK: The UK Adult Twin Registry Update"
            },
            "pmid": "31526404"
        }
    ],
    "topic": [
        {
            "term": "Public health and epidemiology",
            "uri": "http://edamontology.org/topic_3305"
        },
        {
            "term": "Microbial ecology",
            "uri": "http://edamontology.org/topic_3697"
        },
        {
            "term": "Geriatric medicine",
            "uri": "http://edamontology.org/topic_3399"
        }
    ]
}