{
    "additionDate": "2018-06-18T18:19:26Z",
    "biotoolsCURIE": "biotools:rucs",
    "biotoolsID": "rucs",
    "credit": [
        {
            "email": "mcft@cbs.dtu.dk",
            "name": "Martin Christen Frølund Thomsen",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Rapid identification of PCR primers for unique core sequences.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://cge.cbs.dtu.dk/services/RUCS/instructions.php"
        },
        {
            "note": "Source code",
            "type": [
                "General"
            ],
            "url": "https://bitbucket.org/genomicepidemiology/rucs"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "PCR primer design",
                    "uri": "http://edamontology.org/operation_0308"
                }
            ]
        }
    ],
    "homepage": "https://cge.cbs.dtu.dk/services/RUCS/",
    "lastUpdate": "2018-12-10T12:58:59Z",
    "name": "RUCS",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btx526",
            "metadata": {
                "abstract": "© The Author 2017. Published by Oxford University Press. All rights reserved.Motivation: Designing PCR primers to target a specific selection of whole genome sequenced strains can be a long, arduous and sometimes impractical task. Such tasks would benefit greatly from an automated tool to both identify unique targets, and to validate the vast number of potential primer pairs for the targets in silico. Results: Here we present RUCS, a program that will find PCR primer pairs and probes for the unique core sequences of a positive genome dataset complement to a negative genome dataset. The resulting primer pairs and probes are in addition to simple selection also validated through a complex in silico PCR simulation. We compared our method, which identifies the unique core sequences, against an existing tool called ssGeneFinder, and found that our method was 6.5-20 times more sensitive. We used RUCS to design primer pairs that would target a set of genomes known to contain the mcr-1 colistin resistance gene. Three of the predicted pairs were chosen for experimental validation using PCR and gel electrophoresis. All three pairs successfully produced an amplicon with the target length for the samples containing mcr-1 and no amplification products were produced for the negative samples. The novel methods presented in this manuscript can reduce the time needed to identify target sequences, and provide a quick virtual PCR validation to eliminate time wasted on ambiguously binding primers.",
                "authors": [
                    {
                        "name": "Thomsen M.C.F."
                    },
                    {
                        "name": "Hasman H."
                    },
                    {
                        "name": "Westh H."
                    },
                    {
                        "name": "Kaya H."
                    },
                    {
                        "name": "Lund O."
                    }
                ],
                "citationCount": 1,
                "date": "2017-12-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "RUCS: Rapid identification of PCR primers for unique core sequences"
            }
        }
    ],
    "toolType": [
        "Command-line tool",
        "Web application"
    ],
    "topic": [
        {
            "term": "PCR experiment",
            "uri": "http://edamontology.org/topic_3519"
        },
        {
            "term": "Probes and primers",
            "uri": "http://edamontology.org/topic_0632"
        },
        {
            "term": "Laboratory information management",
            "uri": "http://edamontology.org/topic_0607"
        }
    ],
    "validated": 1
}