{
    "additionDate": "2020-01-14T08:56:13Z",
    "biotoolsCURIE": "biotools:LFastqC",
    "biotoolsID": "LFastqC",
    "confidence_flag": "high",
    "credit": [
        {
            "email": "sultan.al_yami@uconn.edu",
            "name": "Sultan Al Yami",
            "orcidid": "https://orcid.org/0000-0002-0371-0847",
            "typeEntity": "Person"
        }
    ],
    "description": "A lossless non-reference-based FASTQ compressor.\n\nContribute to sya12005/LFastqC development by creating an account on GitHub.\n\nYou can’t perform that action at this time",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://github.uconn.edu/sya12005/LFastqC",
    "lastUpdate": "2020-01-14T08:56:13Z",
    "name": "LFastqC",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PONE.0224806",
            "metadata": {
                "abstract": "© 2019 Al Yami, Huang. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.The cost-effectiveness of next-generation sequencing (NGS) has led to the advancement of genomic research, thereby regularly generating a large amount of raw data that often requires efficient infrastructures such as data centers to manage the storage and transmission of such data. The generated NGS data are highly redundant and need to be efficiently compressed to reduce the cost of storage space and transmission bandwidth. We present a lossless, non-reference-based FASTQ compression algorithm, known as LFastqC, an improvement over the LFQC tool, to address these issues. LFastqC is compared with several state-of-the-art compressors, and the results indicate that LFastqC achieves better compression ratios for important datasets such as the LS454, PacBio, and MinION. Moreover, LFastqC has a better compression and decompression speed than LFQC, which was previously the top-performing compression algorithm for the LS454 dataset. LFastqC is freely available at https://github.uconn.edu/sya12005/LFastqC.",
                "authors": [
                    {
                        "name": "Yami S.A."
                    },
                    {
                        "name": "Huang C.-H."
                    }
                ],
                "date": "2019-11-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "LFasTQC: A lossless non-reference-based FASTQ compressor"
            },
            "pmcid": "PMC6855649",
            "pmid": "31725736"
        }
    ],
    "topic": [
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Data management",
            "uri": "http://edamontology.org/topic_3071"
        }
    ]
}