{
    "accessibility": "Open access",
    "additionDate": "2023-03-18T11:22:07.301086Z",
    "biotoolsCURIE": "biotools:pneumokity",
    "biotoolsID": "pneumokity",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "norman.fry@ukhsa.gov.uk",
            "name": "Norman K. Fry",
            "orcidid": "https://orcid.org/0000-0003-4862-6507",
            "typeEntity": "Person"
        },
        {
            "name": "Carmen L. Sheppard",
            "orcidid": "https://orcid.org/0000-0002-2699-9057"
        },
        {
            "name": "Catherine Satzke",
            "orcidid": "https://orcid.org/0000-0003-3164-8849"
        },
        {
            "name": "Sam Manna",
            "orcidid": "https://orcid.org/0000-0002-7694-9605"
        }
    ],
    "description": "A fast, flexible, specific, and sensitive tool for Streptococcus pneumoniae serotype screening and mixed serotype detection from genome sequence data.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Sequence assembly",
                    "uri": "http://edamontology.org/operation_0310"
                },
                {
                    "term": "Sequence trimming",
                    "uri": "http://edamontology.org/operation_3192"
                },
                {
                    "term": "Splitting",
                    "uri": "http://edamontology.org/operation_3359"
                }
            ]
        }
    ],
    "homepage": "https://github.com/CarmenSheppard/PneumoKITy",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T14:53:51.226936Z",
    "license": "Not licensed",
    "name": "PneumoKITy",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1099/mgen.0.000904",
            "metadata": {
                "abstract": "Determination of serotypes of Streptococcus pneumoniae is essential for monitoring current vaccine programmes. Since October 2017, pneumococcal serotypes in England have been derived from whole genome sequencing (WGS) data using our bioinformatic tool PneumoCaT. That tool was designed for serotype determination from pure cultures in a reference laboratory. To help determine multiple serotypes in pneumococcal carriage samples, we developed a new software tool named PneumoK-ITy (Pneumococcal K-mer Integrated Typing) that uses the powerful Mash k-mer screening method for pneumococcal serotyp-ing. Mash k-mer screening is more sequence specific and much faster than the mapping method used in PneumoCaT and can determine 54 (58.1 %) of the 93 serotypes in the SSI Diagnostica phenotypical serotyping scheme to type level with the remain-der called to serogroup or subgroup level (e.g., 11A/D). PneumoKITy can be run on both FastQ and assembly input, requiring up to 11× less memory and running up to 29× faster than the current version of PneumoCaT (1.2.1) on FastQ files. PneumoK-ITy can be used as a rapid, flexible serotype screening method which adds sensitive detection of mixed serotypes, e.g., for nasopharyngeal carriage studies where the presence of multiple serotypes is common. PneumoKITy’s ability to function from assembly file, for pure culture serotype detection, increases its speed. This speed potentially enables the software to be run using low infrastructure overhead via web-based platforms. PneumoKITy could be used as a fast initial screening method with other tools used for those serotypes that could not be fully determined to type level if necessary. PneumoKITy was found to be highly accurate and sensitive when run on a panel of FastQ files derived from mixed cultures with all serotypes in 47/51 (92.2 %) of samples being accurately detected. PneumoKITy was also able to accurately estimate the relative abundance of serotypes in the same sample. Estimates being within a mean relative abundance of 1.5 % of the expected abundance in mixtures with known concentrations. PneumoKITy was able to detect minor serotypes with expected abundance of 1 % in the known mixture serotypes. PneumoKITy is a rapid, flexible tool with wide-ranging applications outside of the pure-culture, reference laboratory serotyping remit of PneumoCaT.",
                "authors": [
                    {
                        "name": "Amin-Chowdhury Z."
                    },
                    {
                        "name": "Bertran M."
                    },
                    {
                        "name": "Fry N.K."
                    },
                    {
                        "name": "Groves N."
                    },
                    {
                        "name": "Ladhani S."
                    },
                    {
                        "name": "Litt D.J."
                    },
                    {
                        "name": "Manna S."
                    },
                    {
                        "name": "Satzke C."
                    },
                    {
                        "name": "Sheppard C.L."
                    }
                ],
                "citationCount": 8,
                "date": "2022-01-01T00:00:00Z",
                "journal": "Microbial Genomics",
                "title": "PneumoKITy: A fast, flexible, specific, and sensitive tool for Streptococcus pneumoniae serotype screening and mixed serotype detection from genome sequence data"
            },
            "pmcid": "PMC9837567",
            "pmid": "36748701"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Gene structure",
            "uri": "http://edamontology.org/topic_0114"
        },
        {
            "term": "Public health and epidemiology",
            "uri": "http://edamontology.org/topic_3305"
        },
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        },
        {
            "term": "Whole genome sequencing",
            "uri": "http://edamontology.org/topic_3673"
        }
    ]
}
