{
    "accessibility": "Open access",
    "additionDate": "2021-01-18T10:08:41Z",
    "biotoolsCURIE": "biotools:cordite",
    "biotoolsID": "cordite",
    "collectionID": [
        "COVID-19"
    ],
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "dominik.heider@uni-marburg.de",
            "name": "Dominik Heider",
            "typeEntity": "Person"
        }
    ],
    "description": "CORDITE is The Curated CORona Drug InTERactions Database for SARS-CoV-2. CORDITE aggregates all available knowledge on potential drugs for SARS-CoV-2. Since the outbreak in 2019, researchers are trying to find effective drugs against the SARS-CoV-2 virus based on de novo drug design and drug repurposing. The former approach is very time consuming and needs extensive testing in humans, whereas drug repurposing is more promising, as the drugs have already been tested for side effects, etc. At present, there is no treatment for COVID-19 that is clinically effective, but there is a huge amount of data from studies that analyze potential drugs. We developed CORDITE to efficiently combine state-of-the-art knowledge on potential drugs and make it accessible to scientists and clinicians",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Literature search",
                    "uri": "http://edamontology.org/operation_0305"
                }
            ]
        }
    ],
    "homepage": "https://cordite.mathematik.uni-marburg.de",
    "lastUpdate": "2021-02-17T15:23:38Z",
    "name": "CORDITE",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1016/J.ISCI.2020.101297",
            "metadata": {
                "abstract": "© 2020 The AuthorsSince the outbreak in 2019, researchers are trying to find effective drugs against the SARS-CoV-2 virus based on de novo drug design and drug repurposing. The former approach is very time consuming and needs extensive testing in humans, whereas drug repurposing is more promising, as the drugs have already been tested for side effects, etc. At present, there is no treatment for COVID-19 that is clinically effective, but there is a huge amount of data from studies that analyze potential drugs. We developed CORDITE to efficiently combine state-of-the-art knowledge on potential drugs and make it accessible to scientists and clinicians. The web interface also provides access to an easy-to-use API that allows a wide use for other software and applications, e.g., for meta-analysis, design of new clinical studies, or simple literature search. CORDITE is currently empowering many scientists across all continents and accelerates research in the knowledge domains of virology and drug design. © 2020 The AuthorsMedicine; Virology; Drugs; Bioinformatics; Biological Database",
                "authors": [
                    {
                        "name": "Martin R."
                    },
                    {
                        "name": "Lochel H.F."
                    },
                    {
                        "name": "Welzel M."
                    },
                    {
                        "name": "Hattab G."
                    },
                    {
                        "name": "Hauschild A.-C."
                    },
                    {
                        "name": "Heider D."
                    }
                ],
                "citationCount": 1,
                "date": "2020-07-24T00:00:00Z",
                "journal": "iScience",
                "title": "CORDITE: The Curated CORona Drug InTERactions Database for SARS-CoV-2"
            },
            "pmcid": "PMC7305714",
            "pmid": "32619700"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Virology",
            "uri": "http://edamontology.org/topic_0781"
        },
        {
            "term": "Medicinal chemistry",
            "uri": "http://edamontology.org/topic_0209"
        },
        {
            "term": "Preclinical and clinical studies",
            "uri": "http://edamontology.org/topic_3379"
        },
        {
            "term": "Medicine",
            "uri": "http://edamontology.org/topic_3303"
        },
        {
            "term": "Drug development",
            "uri": "http://edamontology.org/topic_3373"
        }
    ]
}