{
    "additionDate": "2021-03-19T09:04:34Z",
    "biotoolsCURIE": "biotools:drpnet",
    "biotoolsID": "drpnet",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "whiteto@missouri.edu",
            "name": "Tommi A. White",
            "orcidid": "https://orcid.org/0000-0001-7283-3755",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Deep Regression Picker Network (DRPnet) is a tool for automated particle picking in cryo-electron micrographs using deep regression. Identification and selection of protein particles in cryo-electron micrographs is an important step in single particle analysis. In this study, we developed a deep learning-based particle picking network to automatically detect particle centers from cryoEM micrographs. This is a challenging task due to the nature of cryoEM data, having low signal-to-noise ratios with variable particle sizes, shapes, distributions, grayscale variations as well as other undesirable artifacts.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                },
                {
                    "term": "Single particle analysis",
                    "uri": "http://edamontology.org/operation_3457"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://github.com/emcoregit/DRPnet",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2021-04-10T11:19:04Z",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/emcoregit/DRPnet/issues"
        }
    ],
    "name": "DRPnet",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1186/S12859-020-03948-X",
            "metadata": {
                "abstract": "© 2021, The Author(s).Background: Identification and selection of protein particles in cryo-electron micrographs is an important step in single particle analysis. In this study, we developed a deep learning-based particle picking network to automatically detect particle centers from cryoEM micrographs. This is a challenging task due to the nature of cryoEM data, having low signal-to-noise ratios with variable particle sizes, shapes, distributions, grayscale variations as well as other undesirable artifacts. Results: We propose a double convolutional neural network (CNN) cascade for automated detection of particles in cryo-electron micrographs. This approach, entitled Deep Regression Picker Network or “DRPnet”, is simple but very effective in recognizing different particle sizes, shapes, distributions and grayscale patterns corresponding to 2D views of 3D particles. Particles are detected by the first network, a fully convolutional regression network (FCRN), which maps the particle image to a continuous distance map that acts like a probability density function of particle centers. Particles identified by FCRN are further refined to reduce false particle detections by the second classification CNN. DRPnet’s first CNN pretrained with only a single cryoEM dataset can be used to detect particles from different datasets without retraining. Compared to RELION template-based autopicking, DRPnet results in better particle picking performance with drastically reduced user interactions and processing time. DRPnet also outperforms the state-of-the-art particle picking networks in terms of the supervised detection evaluation metrics recall, precision, and F-measure. To further highlight quality of the picked particle sets, we compute and present additional performance metrics assessing the resulting 3D reconstructions such as number of 2D class averages, efficiency/angular coverage, Rosenthal-Henderson plots and local/global 3D reconstruction resolution. Conclusion: DRPnet shows greatly improved time-savings to generate an initial particle dataset compared to manual picking, followed by template-based autopicking. Compared to other networks, DRPnet has equivalent or better performance. DRPnet excels on cryoEM datasets that have low contrast or clumped particles. Evaluating other performance metrics, DRPnet is useful for higher resolution 3D reconstructions with decreased particle numbers or unknown symmetry, detecting particles with better angular orientation coverage.",
                "authors": [
                    {
                        "name": "Bunyak F."
                    },
                    {
                        "name": "Ersoy I."
                    },
                    {
                        "name": "Gotberg J."
                    },
                    {
                        "name": "Nguyen N.P."
                    },
                    {
                        "name": "White T.A."
                    }
                ],
                "citationCount": 1,
                "date": "2021-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "DRPnet: automated particle picking in cryo-electron micrographs using deep regression"
            },
            "pmcid": "PMC7869254",
            "pmid": "33557750"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Electron microscopy",
            "uri": "http://edamontology.org/topic_0611"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        }
    ]
}
