{"credit":[{"email":"shzhang@cs.ucf.edu","typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://genome.ucf.edu/"}],"documentation":[{"type":"GENERAL","url":"http://genome.ucf.edu/RNAMotifScan/"}],"function":[{"operation":[{"term":"Sequence motif recognition","uri":"http://edamontology.org/operation_0239"},{"term":"Sequence motif comparison","uri":"http://edamontology.org/operation_0240"}]}],"labels":{"language":["C"],"operatingSystem":["Linux"],"toolType":["Command-line tool"],"topic":[{"term":"RNA","uri":"http://edamontology.org/topic_0099"},{"term":"Nucleic acid structure analysis","uri":"http://edamontology.org/topic_0097"},{"term":"Nucleic acid sites, features and motifs","uri":"http://edamontology.org/topic_3511"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/rnamotifscan-5-3-automatic-comparing-searching-rna-tertiary-motifs.html"}],"publication":[{"abstract":"Recent studies have shown that RNA structural motifs play essential roles in RNA folding and interaction with other molecules. Computational identification and analysis of RNA structural motifs remains a challenging task. Existing motif identification methods based on 3D structure may not properly compare motifs with high structural variations. Other structural motif identification methods consider only nested canonical base-pairing structures and cannot be used to identify complex RNA structural motifs that often consist of various non-canonical base pairs due to uncommon hydrogen bond interactions. In this article, we present a novel RNA structural alignment method for RNA structural motif identification, RNAMotifScan, which takes into consideration the isosteric (both canonical and non-canonical) base pairs and multi-pairings in RNA structural motifs. The utility and accuracy of RNAMotifScan is demonstrated by searching for kink-turn, C-loop, sarcin-ricin, reverse kink-turn and E-loop motifs against a 23S rRNA (PDBid: 1S72), which is well characterized for the occurrences of these motifs. Finally, we search these motifs against the RNA structures in the entire Protein Data Bank and the abundances of them are estimated. RNAMotifScan is freely available at our supplementary website (http://genome.ucf.edu/RNAMotifScan). © The Author(s) 2010. Published by Oxford University Press.","authors":["Zhong C.","Tang H.","Zhang S."],"cit_count":14,"journal":"Nucleic Acids Research","pmid":"20696653","title":"RNAMotifScan: Automatic identification of RNA structural motifs using secondary structural alignment","year":"2010-08-08"}],"summary":{"biotoolsCURIE":"biotools:rnamotifscan","biotoolsID":"rnamotifscan","description":"A tool for automatic comparing and searching for RNA tertiary motifs using secondary structural alignment. It takes into consideration the isosteric (both canonical and non-canonical) base-pairs and multi-pairings in RNA tertiary motifs.","homepage":"http://genome.ucf.edu/RNAMotifScan/","name":"RNAMotifScan"}}