{
    "accessibility": "Open access",
    "additionDate": "2021-03-19T08:26:00Z",
    "biotoolsCURIE": "biotools:alleleshift",
    "biotoolsID": "alleleshift",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "R.Kindt@CGIAR.org",
            "name": "Roeland Kindt",
            "orcidid": "https://orcid.org/0000-0002-7672-0712",
            "typeEntity": "Person"
        }
    ],
    "description": "AlleleShift is an R package to predict and visualize population-level changes in allele frequencies in response to climate change.",
    "download": [
        {
            "type": "Source code",
            "url": "https://github.com/RoelandKindt/AlleleShift/tree/master/data"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                },
                {
                    "term": "Allele frequency distribution analysis",
                    "uri": "http://edamontology.org/operation_0554"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "https://github.com/RoelandKindt/AlleleShift",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-11-09T20:14:42.299546Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/RoelandKindt/AlleleShift/issues"
        }
    ],
    "name": "AlleleShift",
    "operatingSystem": [
        "Mac",
        "Linux",
        "Windows"
    ],
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.7717/PEERJ.11534",
            "metadata": {
                "abstract": "© 2021 PeerJ Inc.. All rights reserved.Background. At any particular location, frequencies of alleles that are associated with adaptive traits are expected to change in future climates through local adaption and migration, including assisted migration (human-implemented when climate change is more rapid than natural migration rates). Making the assumption that the baseline frequencies of alleles across environmental gradients can act as a predictor of patterns in changed climates (typically future but possibly paleo-climates), a methodology is provided by AlleleShift of predicting changes in allele frequencies at the population level. Methods. The prediction procedure involves a first calibration and prediction step through redundancy analysis (RDA), and a second calibration and prediction step through a generalized additive model (GAM) with a binomial family. As such, the procedure is fundamentally different to an alternative approach recently proposed to predict changes in allele frequencies from canonical correspondence analysis (CCA). The RDA step is based on the Euclidean distance that is also the typical distance used in Analysis of Molecular Variance (AMOVA). Because the RDA step or CCA approach sometimes predict negative allele frequencies, the GAM step ensures that allele frequencies are in the range of 0 to 1. Results. AlleleShift provides data sets with predicted frequencies and several visualization methods to depict the predicted shifts in allele frequencies from baseline to changed climates. These visualizations include `dot plot' graphics (function shift.dot.ggplot ), pie diagrams (shift.pie.ggplot ), moon diagrams (shift.moon.ggplot ), `waffle' diagrams (shift.waffle.ggplot ) and smoothed surface diagrams of allele frequencies of baseline or future patterns in geographical space (shift.surf.ggplot ). As these visualizations were generated through the ggplot2 package, methods of generating animations for a climate change time series are straightforward, as shown in the documentation of AlleleShift and in the supplemental videos.",
                "authors": [
                    {
                        "name": "Kindt R."
                    }
                ],
                "citationCount": 1,
                "date": "2021-06-01T00:00:00Z",
                "journal": "PeerJ",
                "title": "AlleleShift: An R package to predict and visualize population-level changes in allele frequencies in response to climate change"
            },
            "pmcid": "PMC8212829",
            "pmid": "34178449"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Population genetics",
            "uri": "http://edamontology.org/topic_3056"
        }
    ]
}