{
    "accessibility": "Open access (with restrictions)",
    "additionDate": "2021-05-05T10:49:32Z",
    "biotoolsCURIE": "biotools:model-vesicle-removal-cryoem",
    "biotoolsID": "model-vesicle-removal-cryoem",
    "collectionID": [
        "MATLAB",
        "File Exchange"
    ],
    "cost": "Free of charge (with restrictions)",
    "credit": [
        {
            "name": "Katrine Hommelhoff Jensen",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://www.mathworks.com/matlabcentral/profile/8266681-katrine-hommelhoff-jensen"
        }
    ],
    "description": "Statistical modeling and removal of vesicles from cryo-EM images",
    "download": [
        {
            "type": "Screenshot",
            "url": "https://www.mathworks.com//matlabcentral/images/default_screenshot.jpg"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "homepage": "https://www.mathworks.com/matlabcentral/fileexchange/57445-statistical-modeling-and-removal-of-vesicles-from-cryo-em-images",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2021-05-10T06:55:32Z",
    "license": "BSD-2-Clause",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/KatrineHommelhoffJensen/vesicle-model-repo"
        },
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/KatrineHommelhoffJensen/vesicle-model-repo/issues"
        }
    ],
    "name": "Statistical modeling and removal of vesicles from cryo-EM images",
    "operatingSystem": [
        "Windows",
        "Linux",
        "Mac"
    ],
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1016/j.jsb.2016.01.012",
            "metadata": {
                "abstract": "© 2016 Elsevier Inc.This paper describes steps in the single-particle cryo-EM 3D structure determination of membrane proteins in their membrane environment. Using images of the Kv1.2 potassium-channel complex reconstituted into lipid vesicles, we describe procedures for the merging of focal-pairs of exposures and the removal of the vesicle-membrane signal from the micrographs. These steps allow 3D reconstruction to be performed from the protein particle images. We construct a 2D statistical model of the vesicle structure based on higher-order singular value decomposition (HOSVD), by taking into account the structural symmetries of the vesicles in polar coordinates. Non-roundness in the vesicle structure is handled with a non-linear shape alignment to a reference, which ensures a compact model representation. The results show that the learned model is an accurate representation of the imaged vesicle structures. Precise removal of the strong membrane signals allows better alignment and classification of images of small membrane-protein particles, and allows higher-resolution 3D reconstruction.",
                "authors": [
                    {
                        "name": "Jensen K.H."
                    },
                    {
                        "name": "Brandt S.S."
                    },
                    {
                        "name": "Shigematsu H."
                    },
                    {
                        "name": "Sigworth F.J."
                    }
                ],
                "citationCount": 6,
                "date": "2016-01-01T00:00:00Z",
                "journal": "Journal of Structural Biology",
                "title": "Statistical modeling and removal of lipid membrane projections for cryo-EM structure determination of reconstituted membrane proteins"
            },
            "type": [
                "Primary"
            ]
        },
        {
            "doi": "10.1109/TIP.2015.2504901",
            "metadata": {
                "abstract": "© 2015 IEEE.In this paper, we address the problem of imaging membrane proteins for single-particle cryo-electron microscopy reconstruction of the isolated protein structure. More precisely, we propose a method for learning and removing the interfering vesicle signals from the micrograph, prior to reconstruction. In our approach, we estimate the subspace of the vesicle structures and project the micrographs onto the orthogonal complement of this subspace. We construct a 2D statistical model of the vesicle structure, based on higher order singular value decomposition (HOSVD), by considering the structural symmetries of the vesicles in the polar coordinate plane. We then propose to lift the HOSVD model to a novel hierarchical model by summarizing the multidimensional HOSVD coefficients by their principal components. Along with the model, a solid vesicle normalization scheme and model selection criterion are proposed to make a compact and general model. The results show that the vesicle structures are accurately separated from the background by the HOSVD model that is also able to adapt to the asymmetries of the vesicles. This is a promising result and suggests even wider applicability of the proposed approach in learning and removal of statistical structures.",
                "authors": [
                    {
                        "name": "Jensen K.H."
                    },
                    {
                        "name": "Sigworth F.J."
                    },
                    {
                        "name": "Brandt S.S."
                    }
                ],
                "citationCount": 5,
                "date": "2016-02-01T00:00:00Z",
                "journal": "IEEE Transactions on Image Processing",
                "title": "Removal of vesicle structures from transmission electron microscope images"
            }
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Physics",
            "uri": "http://edamontology.org/topic_3318"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Biomedical science",
            "uri": "http://edamontology.org/topic_3344"
        },
        {
            "term": "Biology",
            "uri": "http://edamontology.org/topic_3070"
        }
    ],
    "version": [
        "1.0.0.0"
    ]
}