{
    "additionDate": "2017-08-03T19:02:57Z",
    "biotoolsCURIE": "biotools:trust",
    "biotoolsID": "trust",
    "credit": [
        {
            "email": "bioinf-l@few.vu.nl",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.ibi.vu.nl/"
        }
    ],
    "description": "Method for ab-initio determination of internal repeats in proteins. The high sensitivity and accuracy of the method is achieved by exploiting the concept of transitivity of alignments.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://www.ibi.vu.nl/programs/trustwww/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Repeat sequence detection",
                    "uri": "http://edamontology.org/operation_0379"
                }
            ]
        }
    ],
    "homepage": "http://www.ibi.vu.nl/programs/trustwww/",
    "language": [
        "Shell"
    ],
    "lastUpdate": "2018-12-10T12:58:51Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/trust-repeat-detection-method.html"
        }
    ],
    "name": "TRUST",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Motivation: Internal repeats in coding sequences correspond to structural and functional units of proteins. Moreover, duplication of fragments of coding sequences is known to be a mechanism to facilitate evolution. Identification of repeats is crucial to shed light on the function and structure of proteins, and explain their evolutionary past. The task is difficult because during the course of evolution many repeats diverged beyond recognition. Results: We introduce a new method TRUST, for ab initio determination of internal repeats in proteins. It provides an improvement in prediction quality as compared to alternative state-of-the-art methods. The increased sensitivity and accuracy of the method is achieved by exploiting the concept of transitivity of alignments. Starting from significant local sub-optimal alignments, the application of transitivity allows us to (1) identify distant repeat homologues for which no alignments were found; (2) gain confidence about consistently well-aligned regions; and (3) recognize and reduce the contribution of non-homologous repeats. This re-assessment step enables us to derive a virtually noise-free profile representing a generalized repeat with high fidelity. We also obtained superior specificity by employing rigid statistical testing for self-sequence and profile-sequence alignments. Assessment was done using a database of repeat annotations based on structural superpositioning. The results show that TRUST is a useful and reliable tool for mining tandem and non-tandem repeats in protein sequence databases, capable of predicting multiple repeat types with varying intervening segments within a single sequence. Availability: The TRUST server (together with the source code) is available at http://ibivu.cs.vu.nl/programs/ trustwww. © Oxford University Press 2004; all rights reserved.",
                "authors": [
                    {
                        "name": "Heringa J."
                    },
                    {
                        "name": "Szklarczyk R."
                    }
                ],
                "citationCount": 101,
                "date": "2004-12-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Tracking repeats using significance and transitivity"
            },
            "pmid": "15262814"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "Sequence composition, complexity and repeats",
            "uri": "http://edamontology.org/topic_0157"
        }
    ],
    "validated": 1
}
