{
    "additionDate": "2021-01-18T11:25:23Z",
    "biotoolsCURIE": "biotools:ioda",
    "biotoolsID": "ioda",
    "confidence_flag": "tool",
    "description": "An integrated tool for analysis of cancer pathway consistency from heterogeneous multi-omics data.\n\niODA, short for integrative Omics Data Analysis, is an evidence-based bioinformatics model and software tool for omics data analysis.\n\niODA is a graphical user interface (GUI) local tool with the aim of integrating and analyzing data sets including mRNA, microRNA (miRNA), and protein–DNA interaction (chromatin immunoprecipitation followed by high-throughput sequencing, ChIP-Seq) for pathway consistency (Figure 1).",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "miRNA expression analysis",
                    "uri": "http://edamontology.org/operation_3792"
                },
                {
                    "term": "Pathway analysis",
                    "uri": "http://edamontology.org/operation_3928"
                },
                {
                    "term": "Protein-nucleic acid interaction analysis",
                    "uri": "http://edamontology.org/operation_0389"
                }
            ]
        }
    ],
    "homepage": "http://www.sysbio.org.cn/iODA",
    "lastUpdate": "2021-02-05T07:38:03Z",
    "license": "GPL-3.0",
    "name": "iODA",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1016/J.JBI.2020.103605",
            "metadata": {
                "abstract": "© 2020 Elsevier Inc.The latest advances in the next generation sequencing technology have greatly facilitated the extensive research of genomics and transcriptomics, thereby promoting the decoding of carcinogenesis with unprecedented resolution. Considering the contribution of analyzing high-throughput multi-omics data to the exploration of cancer molecular mechanisms, an integrated tool for heterogeneous multi-omics data analysis (iODA) is proposed for the systems-level interpretation of multi-omics data, i.e., transcriptomic profiles (mRNA or miRNA expression data) and protein-DNA interactions (ChIP-Seq data). Considering the data heterogeneity, iODA can compare six statistical algorithms in differential analysis for the selected sample data and assist users in choosing the globally optimal one for dysfunctional mRNA or miRNA identification. Since molecular signatures are more consistent at the pathway level than at the gene level, the tool is able to enrich the identified dysfunctional molecules onto the KEGG pathways and extracted the consistent items as key components for further pathogenesis investigation. Compared with other tools, iODA is multi-functional for the systematic analysis of different level of omics data, and its analytical power was demonstrated through case studies of single and cross-level prostate cancer omics data. iODA is open source under GNU GPL and can be downloaded from http://www.sysbio.org.cn/iODA.",
                "authors": [
                    {
                        "name": "Yu C."
                    },
                    {
                        "name": "Qi X."
                    },
                    {
                        "name": "Lin Y."
                    },
                    {
                        "name": "Li Y."
                    },
                    {
                        "name": "Shen B."
                    }
                ],
                "citationCount": 1,
                "date": "2020-12-01T00:00:00Z",
                "journal": "Journal of Biomedical Informatics",
                "title": "iODA: An integrated tool for analysis of cancer pathway consistency from heterogeneous multi-omics data"
            },
            "pmid": "33096244"
        }
    ],
    "toolType": [
        "Desktop application",
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "ChIP-seq",
            "uri": "http://edamontology.org/topic_3169"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ]
}