
{
    "credit": [
        {
            "email": "huangcibo1208@139.com",
            "name": "Ci-Bo Huang",
            "typeEntity": "Person",
            "typeRoles": [
            ]
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Expression profile clustering",
                    "uri": "http://edamontology.org/operation_0313"
                },
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                },
                {
                    "term": "Differential gene expression analysis",
                    "uri": "http://edamontology.org/operation_3223"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "R"
        ],
        "topic": [
            {
                "term": "Biomarkers",
                "uri": "http://edamontology.org/topic_3360"
            },
            {
                "term": "Microarray experiment",
                "uri": "http://edamontology.org/topic_3518"
            },
            {
                "term": "Molecular interactions, pathways and networks",
                "uri": "http://edamontology.org/topic_0602"
            }
        ]
    },
    "link": [
        {
            "type": "OTHER",
            "url": "http://www.ncbi.nlm.nih.gov/geo"
        }
    ],
    "publication": [
        {
            "doi": "10.3892/IJMM.2019.4332",
            "pmcid": "PMC6777682",
            "pmid": "31545397"
        },
        {
            "abstract": "© 2019 Wiley Periodicals, Inc.This study aimed to disclose differentially expressed genes (DEGs) in dorsal root ganglia (DRGs) of neuropathic pain (NP) from spared nerve injury (SNI) model, thereby identifying specific and meaningful genetic targets for the diagnosis and treatment of NP. The GSE89224 was downloaded from the GEO database. DEGs were screened using the GEO2R online tool. Functional enrichment analysis of DEGs was then performed using the DAVID and constructed using the R ggplot2 package. Protein-protein interaction (PPI) network was constructed from the STRING database and visualized in Cytoscape software. MicroRNA targeting these DEGs was obtained from the TarBase and miRTarBase database, while transcription factor (TF)-targeting DEGs were predicted from the ENCODE database, both of which utilized the visual analytics platform NetworkAnayst. Finally, a merged microRNA-TF network was constructed based on the above two networks and was then analyzed with Cytoscape. Eighty DEGs were screened, only Vstm2b and Htr3a were downregulated and 78 genes were upregulated. The real-time polymerase chain reaction was applied to validate the gene expression of the top five DEGs (Npy, Atf3, Gpr151, Sprr1a, and Cckbr) in the DRG tissue 5 days after SNI surgery. It was found that Npy, Atf3, and Sprr1a have a significant increase after SNI stimulation, while Gpr151 and Cckbr showed a slight upward trend. Functional analysis was performed on all DEGs, of which 58 biological processes were enriched by gene ontology analysis, and 11 signaling pathways were enriched by KEGG analysis. In the PPI network, Atf3, Jun, Timp, and Npy had a higher degree. Thus, combined with various bioinformatic analyses, Npy and Atf3 may serve as the prognostic and therapeutic targets of NP. Key microRNA (mmu-mir-16-5p) and TF (MEF2A) were predicted to be associated with the pathogenetic process of NP with microRNA-TF regulatory network analysis, which were also identified as key regulators in the progression of NP.",
            "authors": [
                "Tang S.",
                "Jing H.",
                "Huang Z.",
                "Huang T.",
                "Lin S.",
                "Liao M.",
                "Zhou J."
            ],
            "cit_count": 0,
            "doi": "10.1002/JCB.29398",
            "journal": "Journal of Cellular Biochemistry",
            "pmid": "31535407",
            "title": "Identification of key candidate genes in neuropathic pain by integrated bioinformatic analysis",
            "year": "2019-01-01"
        },
        {
            "doi": "10.4103/1673-5374.264460",
            "pmid": "31535658"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:GEO2R_autogenerated",
        "biotoolsID": "GEO2R_autogenerated",
        "description": "> LOW CONFIDENCE! | > COMMON LINK WITH (PUB. & NAME DIFFERENT) bio.tools/ncbi_geo (NLM.NIH.GOV/geo ; NCBI.NLM.NIH.GOV/geo), bio.tools/ncbi_resources (NLM.NIH.GOV), bio.tools/genbank (NLM.NIH.GOV) | > CORRECT NAME OF TOOL COULD ALSO BE 'KEGG', 'spinal cord injury', 'TLR4', 'SSc', 'CALU', 'microRNA-TF', 'Npy Atf3', 'DEGs', 'Npy', 'spinal cord injury zebrafish', 'cord injury', 'spinal cord' | Screening and identification of biomarkers for systemic sclerosis via microarray technology | Identification of key candidate genes in neuropathic pain by integrated bioinformatic analysis | Bioinformatic identification of key candidate genes and pathways in axon regeneration after spinal cord injury in zebrafish | Gene Expression Omnibus (GEO) is a database repository of high throughput gene expression data and hybridization arrays, chips, microarrays | Use GEO2R to compare two or more groups of Samples in order to identify genes that are differentially expressed across experimental conditions",
        "homepage": "http://www.ncbi.nlm.nih.gov/geo/geo2r/",
        "name": "GEO2R_autogenerated"
    }
}