{
    "name": "iLoops", 
    "description": "This tool uses protein structural features (protein loops as classified in ArchDB and/or domains as classified in SCOP) to determine whether any pair of proteins interact or not. To do that, it uses data from both known protein interactions and putative non-interacting proteins, assigning positive and negative scores to the structural features. The main result page displays a summary of the predictions for the given protein pairs with available detailed data for each prediction.", 
    "homepage": "http://sbi.imim.es/iLoopsServer", 
    "biotoolsID": "iloops", 
    "biotoolsCURIE": "biotools:iloops", 
    "version": [
        "1"
    ], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_2464", 
                    "term": "Protein-protein interaction prediction"
                }
            ], 
            "input": [
                {
                    "data": {
                        "uri": "http://edamontology.org/data_2886", 
                        "term": "Protein sequence record"
                    }, 
                    "format": [
                        {
                            "uri": "http://edamontology.org/format_1963", 
                            "term": "UniProtKB format"
                        }
                    ]
                }
            ], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Web API"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_2259", 
            "term": "Systems biology"
        }
    ], 
    "operatingSystem": [
        "Linux", 
        "Windows", 
        "Mac"
    ], 
    "language": [], 
    "license": null, 
    "collectionID": [], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [], 
    "download": [], 
    "documentation": [
        {
            "url": "http://sbi.imim.es/iLoopsServer/index.php/init/help.html", 
            "type": "General", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btt401", 
            "pmid": "23842807", 
            "pmcid": null, 
            "type": "Primary", 
            "version": null, 
            "metadata": {
                "title": "ILoops: A protein-protein interaction prediction server based on structural features", 
                "abstract": "Summary: Protein-protein interactions play a critical role in many biological processes. Despite that, the number of servers that provide an easy and comprehensive method to predict them is still limited. Here, we present iLoops, a web server that predicts whether a pair of proteins can interact using local structural features. The inputs of the server are as follows: (i) the sequences of the query proteins and (ii) the pairs to be tested. Structural features are assigned to the query proteins by sequence similarity. Pairs of structural features (formed by loops or domains) are classified according to their likelihood to favor or disfavor a protein-protein interaction, depending on their observation in known interacting and non-interacting pairs. The server evaluates the putative interaction using a random forest classifier. © The Author 2013.", 
                "date": "2013-09-15T00:00:00Z", 
                "citationCount": 14, 
                "authors": [
                    {
                        "name": "Planas-Iglesias J."
                    }, 
                    {
                        "name": "Marin-Lopez M.A."
                    }, 
                    {
                        "name": "Bonet J."
                    }, 
                    {
                        "name": "Garcia-Garcia J."
                    }, 
                    {
                        "name": "Oliva B."
                    }
                ], 
                "journal": "Bioinformatics"
            }
        }, 
        {
            "doi": null, 
            "pmid": "23353828", 
            "pmcid": null, 
            "type": "Other", 
            "version": null, 
            "metadata": {
                "title": "Understanding protein-protein interactions using local structural features", 
                "abstract": "Protein-protein interactions (PPIs) play a relevant role among the different functions of a cell. Identifying the PPI network of a given organism (interactome) is useful to shed light on the key molecular mechanisms within a biological system. In this work, we show the role of structural features (loops and domains) to comprehend the molecular mechanisms of PPIs. A paradox in protein-protein binding is to explain how the unbound proteins of a binary complex recognize each other among a large population within a cell and how they find their best docking interface in a short timescale. We use interacting and non-interacting protein pairs to classify the structural features that sustain the binding (or non-binding) behavior. Our study indicates that not only the interacting region but also the rest of the protein surface are important for the interaction fate. The interpretation of this classification suggests that the balance between favoring and disfavoring structural features determines if a pair of proteins interacts or not. Our results are in agreement with previous works and support the funnel-like intermolecular energy landscape theory that explains PPIs. We have used these features to score the likelihood of the interaction between two proteins and to develop a method for the prediction of PPIs. We have tested our method on several sets with unbalanced ratios of interactions and non-interactions to simulate real conditions, obtaining accuracies higher than 25% in the most unfavorable circumstances. © 2013 Elsevier Ltd.", 
                "date": "2013-04-12T00:00:00Z", 
                "citationCount": 23, 
                "authors": [
                    {
                        "name": "Planas-Iglesias J."
                    }, 
                    {
                        "name": "Bonet J."
                    }, 
                    {
                        "name": "Garcia-Garcia J."
                    }, 
                    {
                        "name": "Marin-Lopez M.A."
                    }, 
                    {
                        "name": "Feliu E."
                    }, 
                    {
                        "name": "Oliva B."
                    }
                ], 
                "journal": "Journal of Molecular Biology"
            }
        }
    ], 
    "credit": [
        {
            "name": "Joan Planas-Iglesias", 
            "email": null, 
            "url": null, 
            "orcidid": "http://orcid.org/0000-0002-6279-2483", 
            "typeEntity": "Person", 
            "typeRole": [
                "Developer"
            ], 
            "note": null
        }, 
        {
            "name": "upf.edu", 
            "email": null, 
            "url": null, 
            "orcidid": null, 
            "typeEntity": "Institute", 
            "typeRole": [
                "Provider"
            ], 
            "note": null
        }, 
        {
            "name": null, 
            "email": "baldo.oliva@upf.edu", 
            "url": null, 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "baldo.oliva@upf.edu", 
    "additionDate": "2016-04-22T12:19:20Z", 
    "lastUpdate": "2019-01-09T17:14:33Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 1, 
    "homepage_status": 0, 
    "elixir_badge": 0
}