
{
    "credit": [
        {
            "name": "Miha Skalic",
            "typeEntity": "Person",
            "typeRoles": [
                "Developer"
            ]
        },
        {
            "name": "Gael P. Alamancos",
            "typeEntity": "Person",
            "typeRoles": [
                "Developer"
            ]
        },
        {
            "name": "Amadí­s Pagès",
            "typeEntity": "Person",
            "typeRoles": [
                "Developer"
            ]
        },
        {
            "name": "JC Entizne",
            "typeEntity": "Person",
            "typeRoles": [
                "Developer"
            ]
        },
        {
            "name": "Pompeu Fabra University",
            "typeEntity": "Institute",
            "typeRoles": [
                "Provider"
            ]
        },
        {
            "name": "upf.edu",
            "typeEntity": "Institute",
            "typeRoles": [
                "Provider"
            ]
        },
        {
            "email": "suppa-users@googlegroups.com",
            "name": "SUPPA Users group",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "https://bitbucket.org/regulatorygenomicsupf/suppa"
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "https://github.com/comprna/SUPPA"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Splicing model analysis",
                    "uri": "http://edamontology.org/operation_2499"
                }
            ]
        }
    ],
    "labels": {
        "cost": "Free of charge",
        "language": [
            "Python"
        ],
        "license": "MIT",
        "maturity": "Mature",
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Transcriptomics",
                "uri": "http://edamontology.org/topic_3308"
            },
            {
                "term": "RNA splicing",
                "uri": "http://edamontology.org/topic_3320"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© 2015 Mefferd et al.Alternative splicing plays an essential role in many cellular processes and bears major relevance in the understanding of multiple diseases, including cancer. High-throughput RNA sequencing allows genome-wide analyses of splicing across multiple conditions. However, the increasing number of available data sets represents a major challenge in terms of computation time and storage requirements. We describe SUPPA, a computational tool to calculate relative inclusion values of alternative splicing events, exploiting fast transcript quantification. SUPPA accuracy is comparable and sometimes superior to standard methods using simulated as well as real RNA-sequencing data compared with experimentally validated events. We assess the variability in terms of the choice of annotation and provide evidence that using complete transcripts rather than more transcripts per gene provides better estimates. Moreover, SUPPA coupled with de novo transcript reconstruction methods does not achieve accuracies as high as using quantification of known transcripts, but remains comparable to existing methods. Finally, we show that SUPPA is more than 1000 times faster than standard methods. Coupled with fast transcript quantification, SUPPA provides inclusion values at a much higher speed than existing methods without compromising accuracy, thereby facilitating the systematic splicing analysis of large data sets with limited computational resources. The software is implemented in Python 2.7 and is available under the MIT license at https://bitbucket.org/regulatorygenomicsupf/suppa.",
            "authors": [
                "Alamancos G.P.",
                "Pages A.",
                "Trincado J.L.",
                "Bellora N.",
                "Eyras E."
            ],
            "cit_count": 43,
            "doi": "10.1261/rna.051557.115",
            "journal": "RNA",
            "title": "Leveraging transcript quantification for fast computation of alternative splicing profiles",
            "type": "Primary",
            "year": "2015-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:suppa",
        "biotoolsID": "suppa",
        "description": "This tool generates Alternative Splicing (AS) events from an annotation and calculates the PSI (\"Percentage Spliced In\") value for each event exploiting fast quantification of transcript abundances from multiple samples.",
        "homepage": "https://bitbucket.org/regulatorygenomicsupf/suppa/",
        "name": "SUPPA",
        "version": [
            "1"
        ]
    }
}