{"credit":[],"function":[{"operation":[{"term":"Service discovery","uri":"http://edamontology.org/operation_3761"},{"term":"Query and retrieval","uri":"http://edamontology.org/operation_0224"}]}],"labels":{"topic":[{"term":"Workflows","uri":"http://edamontology.org/topic_0769"},{"term":"Machine learning","uri":"http://edamontology.org/topic_3474"},{"term":"Literature and language","uri":"http://edamontology.org/topic_3068"}]},"publication":[{"abstract":"As the Internet of Things (IoT) is evolving at a fast pace, the need for contextual intelligence has become more crucial for delivering IoT intelligence, efficiency, effectiveness, performance, and sustainability. Contextual intelligence enables interactions between IoT devices such as sensors/actuators, smartphones and connected vehicles, to name but a few. Context management platforms (CMP) are emerging as a promising solution to deliver contextual intelligence for IoT. However, the development of a generic solution that allows IoT devices and services to publish, consume, monitor, and share context is still in its infancy. In this paper, we propose, validate and explain the details of a novel mechanism called Context Query Engine (CQE), which is an integral part of a pioneering CMP called Context-as-a-Service (CoaaS). CQE is responsible for efficient execution of context queries in near real-time. We present the architecture of CQE and illuminate its workflows. We also conduct extensive experimental performance and scalability evaluation of the proposed CQE. Results of experimental evaluation convincingly demonstrate that CoaaS outperforms its competitors in executing complex context queries. Moreover, the advanced functionality of the embedded query language makes CoaaS a decent candidate for real-life deployments.","authors":["Hassani A.","Medvedev A.","Zaslavsky A.","Delir Haghighi P.","Jayaraman P.P.","Ling S."],"cit_count":0,"doi":"10.3390/S19245457","journal":"Sensors (Basel, Switzerland)","pmid":"31835743","title":"Efficient Execution of Complex Context Queries to Enable Near Real-Time Smart IoT Applications","year":"2019-12-11"}],"summary":{"biotoolsCURIE":"biotools:CoaaS","biotoolsID":"CoaaS","description":"Efficient Execution of Complex Context Queries to Enable Near Real-Time Smart IoT Applications.\n\nAs the Internet of Things (IoT) is evolving at a fast pace, the need for contextual intelligence has become more crucial for delivering IoT intelligence, efficiency, effectiveness, performance, and sustainability. Contextual intelligence enables interactions between IoT devices such as sensors actuators, smartphones and connected vehicles, to name but a few. Context management platforms (CMP) are emerging as a promising solution to deliver contextual intelligence for IoT. However, the development of a generic solution that allows IoT devices and services to publish, consume, monitor, and share context is still in its infancy. In this paper, we propose, validate and explain the details of a novel mechanism called Context Query Engine (CQE), which is an integral part of a pioneering CMP called Context-as-a-Service (CoaaS)","homepage":"https://hub.docker.com/r/coaas","name":"CoaaS"}}