{
    "additionDate": "2020-01-14T09:25:55Z",
    "biotoolsCURIE": "biotools:CNN-SuccSite",
    "biotoolsID": "CNN-SuccSite",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "leetzongyi@cuhk.edu.cn",
            "name": "Tzong-Yi Lee",
            "typeEntity": "Person"
        }
    ],
    "description": "Problems with homepage (January 6th, 2021) |\nCNN-SuccSite is a web server for characterization and identification succinylation sites based on deep learning method.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Post-translation modification site prediction",
                    "uri": "http://edamontology.org/operation_0417"
                },
                {
                    "term": "PTM localisation",
                    "uri": "http://edamontology.org/operation_3755"
                }
            ]
        }
    ],
    "homepage": "http://csb.cse.yzu.edu.tw/CNN-SuccSite/",
    "lastUpdate": "2021-01-09T13:47:42Z",
    "name": "CNN-SuccSite",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1038/S41598-019-52552-4",
            "metadata": {
                "abstract": "© 2019, The Author(s).Succinylation is a type of protein post-translational modification (PTM), which can play important roles in a variety of cellular processes. Due to an increasing number of site-specific succinylated peptides obtained from high-throughput mass spectrometry (MS), various tools have been developed for computationally identifying succinylated sites on proteins. However, most of these tools predict succinylation sites based on traditional machine learning methods. Hence, this work aimed to carry out the succinylation site prediction based on a deep learning model. The abundance of MS-verified succinylated peptides enabled the investigation of substrate site specificity of succinylation sites through sequence-based attributes, such as position-specific amino acid composition, the composition of k-spaced amino acid pairs (CKSAAP), and position-specific scoring matrix (PSSM). Additionally, the maximal dependence decomposition (MDD) was adopted to detect the substrate signatures of lysine succinylation sites by dividing all succinylated sequences into several groups with conserved substrate motifs. According to the results of ten-fold cross-validation, the deep learning model trained using PSSM and informative CKSAAP attributes can reach the best predictive performance and also perform better than traditional machine-learning methods. Moreover, an independent testing dataset that truly did not exist in the training dataset was used to compare the proposed method with six existing prediction tools. The testing dataset comprised of 218 positive and 2621 negative instances, and the proposed model could yield a promising performance with 84.40% sensitivity, 86.99% specificity, 86.79% accuracy, and an MCC value of 0.489. Finally, the proposed method has been implemented as a web-based prediction tool (CNN-SuccSite), which is now freely accessible at http://csb.cse.yzu.edu.tw/CNN-SuccSite/.",
                "authors": [
                    {
                        "name": "Huang K.-Y."
                    },
                    {
                        "name": "Hsu J.B.-K."
                    },
                    {
                        "name": "Lee T.-Y."
                    }
                ],
                "citationCount": 12,
                "date": "2019-12-01T00:00:00Z",
                "journal": "Scientific Reports",
                "title": "Characterization and Identification of Lysine Succinylation Sites based on Deep Learning Method"
            },
            "pmcid": "PMC6838336",
            "pmid": "31700141"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Protein modifications",
            "uri": "http://edamontology.org/topic_0601"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        },
        {
            "term": "Sequence sites, features and motifs",
            "uri": "http://edamontology.org/topic_0160"
        }
    ],
    "validated": 1
}