{
    "additionDate": "2017-12-18T00:11:27Z",
    "biotoolsCURIE": "biotools:pyrosetta",
    "biotoolsID": "pyrosetta",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://graylab.jhu.edu/"
        }
    ],
    "description": "Interactive Python-based interface to the powerful Rosetta molecular modeling suite. It enables a user to create custom molecular modeling algorithms with Rosetta sampling and scoring functions using Python scripting.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://www.pyrosetta.org/documentation"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein sequence analysis",
                    "uri": "http://edamontology.org/operation_2479"
                }
            ]
        }
    ],
    "homepage": "http://www.pyrosetta.org/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-05-09T11:45:36Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/pyrosetta-2-0-python-based-interface-rosetta-molecular-modeling-suite.html"
        }
    ],
    "name": "PyRosetta",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "otherID": [
        {
            "value": "RRID:SCR_018541"
        }
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btq007",
            "metadata": {
                "abstract": "PyRosetta is a stand-alone Python-based imple-mentation of the Rosetta molecular modeling package that allows users to write custom structure prediction and design algorithms using the major Rosetta sampling and scoring functions. PyRosetta contains Python bindings to libraries that define Rosetta functions including those for accessing and manipulating protein structure, calculating energies and running Monte Carlo-based simulations. PyRosetta can be used in two ways: (i) interactively, using iPython and (ii) script-based, using Python scripting. Interactive mode contains a number of help features and is ideal for beginners while script-mode is best suited for algorithm development. PyRosetta has similar computational performance to Rosetta, can be easily scaled up for cluster applications and has been implemented for algorithms demonstrating protein docking, protein folding, loop modeling and design. Availability: PyRosetta is a stand-alone package available at http://www.pyrosetta.org under the Rosetta license which is free for academic and non-profit users. A tutorial, user's manual and sample scripts demonstrating usage are also available on the web site. Contact: pyrosetta@graylab.jhu.edu © The Author 2010. Published by Oxford University Press.",
                "authors": [
                    {
                        "name": "Chaudhury S."
                    },
                    {
                        "name": "Gray J.J."
                    },
                    {
                        "name": "Lyskov S."
                    }
                ],
                "citationCount": 229,
                "date": "2010-01-07T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "PyRosetta: A script-based interface for implementing molecular modeling algorithms using Rosetta"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Algorithms",
            "uri": "http://edamontology.org/topic_3372"
        }
    ],
    "validated": 1,
    "version": [
        "2.012"
    ]
}
