{
    "additionDate": "2019-11-14T18:43:35Z",
    "biotoolsCURIE": "biotools:rs1320632_MMP8_rs11225395_MMP8_rs1799750",
    "biotoolsID": "rs1320632_MMP8_rs11225395_MMP8_rs1799750",
    "confidence_flag": "very low",
    "description": "> VERY_LOW CONFIDENCE! | > HOMEPAGE MISSING! | > CORRECT NAME OF TOOL COULD ALSO BE 'rs11568818 MMP7 rs1320632 MMP8 rs11225395', 'MMP7 rs1320632 MMP8 rs11225395 MMP8', 'MMP8 rs11225395 MMP8 rs1799750', 'rs1320632 MMP8 rs11225395 MMP8' | [Study of associations of polymorphism of matrix metalloproteinases genes with the development of arterial hypertension in men] | The aim of research. To study the association of polymorphic loci of matrix metalloproteinases with the development of essential hypertension (EH) in men of the Central Chernozem Region of Russia. Materials and methods. A study of 564 men with EH and 257 control men was performed. Analysis of the polymorphic loci of metalloproteinases rs11568818 MMР7, rs1320632 MMР8, rs11225395 MMР8, rs1799750 MMР1, rs3025058 MMР3 was performed using real-time PCR",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Haplotype mapping",
                    "uri": "http://edamontology.org/operation_0487"
                },
                {
                    "term": "SNP detection",
                    "uri": "http://edamontology.org/operation_0484"
                }
            ]
        }
    ],
    "homepage": "https://www.ncbi.nlm.nih.gov/pubmed/?term=31441739",
    "lastUpdate": "2019-11-14T18:43:35Z",
    "name": "rs1320632 MMP8 rs11225395 MMP8 rs1799750",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.18087/CARDIO.2598",
            "metadata": {
                "abstract": "The aim of research. To study the association of polymorphic loci of matrix metalloproteinases with the development of essential hypertension (EH) in men of the Central Chernozem Region of Russia. Materials and methods. A study of 564 men with EH and 257 control men was performed. Analysis of the polymorphic loci of metalloproteinases rs11568818 MMР7, rs1320632 MMР8, rs11225395 MMР8, rs1799750 MMР1, rs3025058 MMР3 was performed using real-time PCR. The study of associations of SNPs and their haplotypes with the development of arterial hypertension was carried out using logistic regression analysis in the PLINK software (v. 2.050). The regulatory potential of polymorphic loci was analyzed in the HaploReg software (v. 4.1) (http://archive.broadinstitute.org). The effect of SNP on gene expression was studied using the data of the Genotype-Tissue Expression project (http://www.gtexportal.org/). Results. Haplotype including rs11568818 MMP7, rs1320632 MMP8, rs11225395 MMP8 and rs1799750 MMP1 associated with a high risk of disease in men (OR=2,58, pperm=0,04). These polymorphisms located in region of promoter and enhancer histone marks and in the region of hypersensitivity to DNAse-1. They located in sites of proteins bound (TBP, CJUN, CFOS and GATA2) and they associated with the level of gene expression ММР7, ММР27 and RP11-817J15.3 (in peripheral blood, skeletal muscles, nervous tissue and other). Сonclusion. Haplotype G-A-C-1G for polymorphisms rs11568818 MMP7, rs1320632 MMP8, rs11225395 MMP8, rs1799750 MMP1 are associated with the development of essential hypertension in men in the Central Chernozem Region of Russia.",
                "authors": [
                    {
                        "name": "Moskalenko M.I."
                    },
                    {
                        "name": "Milanova S.N."
                    },
                    {
                        "name": "Ponomarenko I.V."
                    },
                    {
                        "name": "Polonikov A.V."
                    },
                    {
                        "name": "Churnosov M.I."
                    }
                ],
                "date": "2019-08-23T00:00:00Z",
                "journal": "Kardiologiia",
                "title": "Study of associations of polymorphism of matrix metalloproteinases genes with the development of arterial hypertension in men"
            },
            "pmid": "31441739"
        }
    ],
    "topic": [
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ]
}