
{
    "credit": [
        {
            "email": "fabrice.berger@gmail.com",
            "name": "Fabrice Berger",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "url": "http://bioconductor.org/packages/release/bioc/html/affyILM.html"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://bioconductor/packages/release/bioc/src/contrib/affyILM_1.26.0.tar.gz"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Gene expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                }
            ]
        }
    ],
    "labels": {
        "collectionID": [
            "BioConductor"
        ],
        "language": [
            "R"
        ],
        "license": "GPL-3.0",
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Command-line tool",
            "Library"
        ],
        "topic": [
            {
                "term": "Gene expression",
                "uri": "http://edamontology.org/topic_0203"
            },
            {
                "term": "Microarray experiment",
                "uri": "http://edamontology.org/topic_3518"
            },
            {
                "term": "Data quality management",
                "uri": "http://edamontology.org/topic_3572"
            }
        ]
    },
    "publication": [
        {
            "abstract": "Background: One important preprocessing step in the analysis of microarray data is background subtraction. In high-density oligonucleotide arrays this is recognized as a crucial step for the global performance of the data analysis from raw intensities to expression values. Results: We propose here an algorithm for background estimation based on a model in which the cost function is quadratic in a set of fitting parameters such that minimization can be performed through linear algebra. The model incorporates two effects: 1) Correlated intensities between neighboring features in the chip and 2) sequence-dependent affinities for non-specific hybridization fitted by an extended nearest-neighbor model. Conclusion: The algorithm has been tested on 360 GeneChips from publicly available data of recent expression experiments. The algorithm is fast and accurate. Strong correlations between the fitted values for different experiments as well as between the free-energy parameters and their counterparts in aqueous solution indicate that the model captures a significant part of the underlying physical chemistry. © 2009 Kroll et al; licensee BioMed Central Ltd.",
            "authors": [
                "Kroll K.M.",
                "Barkema G.T.",
                "Carlon E."
            ],
            "cit_count": 2,
            "doi": "10.1186/1748-7188-4-15",
            "journal": "Algorithms for Molecular Biology",
            "title": "Linear model for fast background subtraction in oligonucleotide microarrays",
            "type": "Other",
            "year": "2009-11-16"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:affyilm",
        "biotoolsID": "affyilm",
        "description": "Preprocessing tool which estimates gene expression levels for Affymetrix Gene Chips. Input from physical chemistry is employed to first background subtract intensities before calculating concentrations on behalf of the Langmuir model.",
        "homepage": "http://bioconductor.org/packages/release/bioc/html/affyILM.html",
        "name": "affyILM",
        "version": [
            "1.26.0"
        ]
    }
}