{
    "additionDate": "2017-01-17T14:50:43Z",
    "biotoolsCURIE": "biotools:skyline",
    "biotoolsID": "skyline",
    "collectionID": [
        "Proteomics",
        "ms-utils"
    ],
    "credit": [
        {
            "email": "brendanx@u.washington.edu",
            "name": "Brendan MacLean",
            "typeEntity": "Person",
            "typeRole": [
                "Maintainer"
            ]
        },
        {
            "email": "webmaster@ms-utils.org",
            "typeEntity": "Person",
            "typeRole": [
                "Documentor"
            ],
            "url": "http://ms-utils.org"
        }
    ],
    "description": "Builds SRM/MRM methods and analyzes resulting data.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://skyline.ms/wiki/home/software/Skyline/page.view?name=tutorials"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://proteowizard.svn.sourceforge.net/viewvc/proteowizard/trunk/pwiz/pwiz_tools"
        }
    ],
    "editPermission": {
        "authors": [
            "ELIXIR-EE",
            "proteomics.bio.tools"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data handling",
                    "uri": "http://edamontology.org/operation_2409"
                },
                {
                    "term": "MRM/SRM",
                    "uri": "http://edamontology.org/operation_3636"
                },
                {
                    "term": "Mass spectrum visualisation",
                    "uri": "http://edamontology.org/operation_3694"
                },
                {
                    "term": "Spectral library search",
                    "uri": "http://edamontology.org/operation_3801"
                }
            ]
        }
    ],
    "homepage": "https://brendanx-uw1.gs.washington.edu/labkey/project/home/software/Skyline/begin.view",
    "language": [
        "C#"
    ],
    "lastUpdate": "2024-11-24T15:34:15.161432Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://ms-utils.org"
        }
    ],
    "name": "Skyline",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "brendanx",
    "publication": [
        {
            "doi": "10.1038/s41596-022-00714-6",
            "metadata": {
                "abstract": "Lipidomics studies suffer from analytical and annotation challenges because of the great structural similarity of many of the lipid species. To improve lipid characterization and annotation capabilities beyond those afforded by traditional mass spectrometry (MS)-based methods, multidimensional separation methods such as those integrating liquid chromatography, ion mobility spectrometry, collision-induced dissociation and MS (LC-IMS-CID-MS) may be used. Although LC-IMS-CID-MS and other multidimensional methods offer valuable hydrophobicity, structural and mass information, the files are also complex and difficult to assess. Thus, the development of software tools to rapidly process and facilitate confident lipid annotations is essential. In this Protocol Extension, we use the freely available, vendor-neutral and open-source software Skyline to process and annotate multidimensional lipidomic data. Although Skyline (https://skyline.ms/skyline.url) was established for targeted processing of LC-MS-based proteomics data, it has since been extended such that it can be used to analyze small-molecule data as well as data containing the IMS dimension. This protocol uses Skyline’s recently expanded capabilities, including small-molecule spectral libraries, indexed retention time and ion mobility filtering, and provides a step-by-step description for importing data, predicting retention times, validating lipid annotations, exporting results and editing our manually validated 500+ lipid library. Although the time required to complete the steps outlined here varies on the basis of multiple factors such as dataset size and familiarity with Skyline, this protocol takes ~5.5 h to complete when annotations are rigorously verified for maximum confidence.",
                "authors": [
                    {
                        "name": "Baker E.S."
                    },
                    {
                        "name": "Kirkwood K.I."
                    },
                    {
                        "name": "MacCoss M.J."
                    },
                    {
                        "name": "MacLean B.X."
                    },
                    {
                        "name": "Pratt B.S."
                    },
                    {
                        "name": "Shulman N."
                    },
                    {
                        "name": "Tamura K."
                    }
                ],
                "citationCount": 30,
                "date": "2022-11-01T00:00:00Z",
                "journal": "Nature Protocols",
                "title": "Utilizing Skyline to analyze lipidomics data containing liquid chromatography, ion mobility spectrometry and mass spectrometry dimensions"
            },
            "pmcid": "PMC9633456",
            "pmid": "35831612"
        },
        {
            "doi": "10.1093/bioinformatics/btq054",
            "metadata": {
                "abstract": "Summary: Skyline is a Windows client application for targeted proteomics method creation and quantitative data analysis. It is open source and freely available for academic and commercial use. The Skyline user interface simplifies the development of mass spectrometer methods and the analysis of data from targeted proteomics experiments performed using selected reaction monitoring (SRM). Skyline supports using and creating MS/MS spectral libraries from a wide variety of sources to choose SRM filters and verify results based on previously observed ion trap data. Skyline exports transition lists to and imports the native output files from Agilent, Applied Biosystems, Thermo Fisher Scientific and Waters triple quadrupole instruments, seamlessly connecting mass spectrometer output back to the experimental design document. The fast and compact Skyline file format is easily shared, even for experiments requiring many sample injections. A rich array of graphs displays results and provides powerful tools for inspecting data integrity as data are acquired, helping instrument operators to identify problems early. The Skyline dynamic report designer exports tabular data from the Skyline document model for in-depth analysis with common statistical tools. Availability: Single-click, self-updating web installation is available at http://proteome.gs.washington.edu/software/skyline. This website also provides access to instructional videos, a support board, an issues list and a link to the source code project. Contact: brendanx@u.washington.edu. Supplementary information: Supplementary data are available at Bioinformatics online. © The Author 2010. Published by Oxford University Press. All rights reserved. For Permissions, please email: journals.permissions@oxfordjournals.org.",
                "authors": [
                    {
                        "name": "Chambers M."
                    },
                    {
                        "name": "Finney G.L."
                    },
                    {
                        "name": "Frewen B."
                    },
                    {
                        "name": "Kern R."
                    },
                    {
                        "name": "Liebler D.C."
                    },
                    {
                        "name": "MacCoss M.J."
                    },
                    {
                        "name": "MacLean B."
                    },
                    {
                        "name": "Shulman N."
                    },
                    {
                        "name": "Tabb D.L."
                    },
                    {
                        "name": "Tomazela D.M."
                    }
                ],
                "citationCount": 3534,
                "date": "2010-02-09T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Skyline: An open source document editor for creating and analyzing targeted proteomics experiments"
            },
            "pmcid": "PMC2844992",
            "pmid": "20147306",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ],
    "validated": 1
}
