{
    "additionDate": "2017-08-03T18:56:42Z",
    "biotoolsCURIE": "biotools:proteny",
    "biotoolsID": "proteny",
    "collectionID": [
        "Proteomics"
    ],
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://bioinformatics.tudelft.nl/"
        }
    ],
    "description": "Analyze and visualize synteny at the protein level between two organisms.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/thiesgehrmann/proteny"
        }
    ],
    "editPermission": {
        "authors": [
            "proteomics.bio.tools"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Map drawing",
                    "uri": "http://edamontology.org/operation_0573"
                },
                {
                    "term": "Mapping",
                    "uri": "http://edamontology.org/operation_2429"
                },
                {
                    "term": "Protein sequence analysis",
                    "uri": "http://edamontology.org/operation_2479"
                }
            ]
        }
    ],
    "homepage": "https://github.com/thiesgehrmann/proteny",
    "language": [
        "Python"
    ],
    "lastUpdate": "2019-03-26T08:34:41Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/proteny-analyze-synteny-at-the-protein-level.html"
        }
    ],
    "name": "Proteny",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "© The Author 2015. Published by Oxford University Press.Background: With more and more genomes being sequenced, detecting synteny between genomes becomes more and more important. However, for microorganisms the genomic divergence quickly becomes large, resulting in different codon usage and shuffling of gene order and gene elements such as exons. Results: We present Proteny, a methodology to detect synteny between diverged genomes. It operates on the amino acid sequence level to be insensitive to codon usage adaptations and clusters groups of exons disregarding order to handle diversity in genomic ordering between genomes. Furthermore, Proteny assigns significance levels to the syntenic clusters such that they can be selected on statistical grounds. Finally, Proteny provides novel ways to visualize results at different scales, facilitating the exploration and interpretation of syntenic regions. We test the performance of Proteny on a standard ground truth dataset, and we illustrate the use of Proteny on two closely related genomes (two different strains of Aspergillus niger) and on two distant genomes (two species of Basidiomycota). In comparison to other tools, we find that Proteny finds clusters with more true homologies in fewer clusters that contain more genes, i.e. Proteny is able to identify a more consistent synteny. Further, we show how genome rearrangements, assembly errors, gene duplications and the conservation of specific genes can be easily studied with Proteny. Availability and implementation: Proteny is freely available at the Delft Bioinformatics Lab website http://bioinformatics.tudelft.nl/dbl/software.",
                "authors": [
                    {
                        "name": "Gehrmann T."
                    },
                    {
                        "name": "Reinders M.J.T."
                    }
                ],
                "citationCount": 4,
                "date": "2015-12-18T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Proteny: Discovering and visualizing statistically significant syntenic clusters at the proteome level"
            },
            "pmid": "26116928"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        }
    ],
    "validated": 1
}
