{
    "additionDate": "2018-05-05T08:16:21Z",
    "biotoolsCURIE": "biotools:primo",
    "biotoolsID": "primo",
    "credit": [
        {
            "email": "o.tastanbishop@ru.ac.za",
            "name": "Özlem Tastan Bishop",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "An Interactive Homology Modeling Pipeline",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://primo.rubi.ru.ac.za/#documentation"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein modelling",
                    "uri": "http://edamontology.org/operation_0477"
                }
            ]
        }
    ],
    "homepage": "https://primo.rubi.ru.ac.za/",
    "language": [
        "JavaScript"
    ],
    "lastUpdate": "2018-12-10T12:58:57Z",
    "name": "PRIMO",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PONE.0166698",
            "metadata": {
                "abstract": "© 2016 Hatherley et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.The development of automated servers to predict the three-dimensional structure of proteins has seen much progress over the years. These servers make calculations simpler, but largely exclude users from the process. In this study, we present the PRotein Interactive MOdeling (PRIMO) pipeline for homology modeling of protein monomers. The pipeline eases the multi-step modeling process, and reduces the workload required by the user, while still allowing engagement from the user during every step. Default parameters are given for each step, which can either be modified or supplemented with additional external input. PRIMO has been designed for users of varying levels of experience with homology modeling. The pipeline incorporates a user-friendly interface that makes it easy to alter parameters used during modeling. During each stage of the modeling process, the site provides suggestions for novice users to improve the quality of their models. PRIMO provides functionality that allows users to also model ligands and ions in complex with their protein targets. Herein, we assess the accuracy of the fully automated capabilities of the server, including a comparative analysis of the available alignment programs, as well as of the refinement levels used during modeling. The tests presented here demonstrate the reliability of the PRIMO server when producing a large number of protein models. While PRIMO does focus on user involvement in the homology modeling process, the results indicate that in the presence of suitable templates, good quality models can be produced even without user intervention. This gives an idea of the base level accuracy of PRIMO, which users can improve upon by adjusting parameters in their modeling runs. The accuracy of PRIMO's automated scripts is being continuously evaluated by the CAMEO (Continuous Automated Model EvaluatiOn) project. The PRIMO site is free for non-commercial use and can be accessed at https://primo.rubi.ru.ac.za/.",
                "authors": [
                    {
                        "name": "Bishop O.T."
                    },
                    {
                        "name": "Brown D.K."
                    },
                    {
                        "name": "Glenister M."
                    },
                    {
                        "name": "Hatherley R."
                    }
                ],
                "citationCount": 27,
                "date": "2016-11-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "PRIMO: An interactive homology modeling pipeline"
            },
            "pmcid": "PMC5113968",
            "pmid": "27855192"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        },
        {
            "term": "Structure analysis",
            "uri": "http://edamontology.org/topic_0081"
        },
        {
            "term": "Structure prediction",
            "uri": "http://edamontology.org/topic_0082"
        }
    ],
    "validated": 1
}
