{
    "additionDate": "2021-01-18T10:42:58Z",
    "biotoolsCURIE": "biotools:pcamatchr",
    "biotoolsID": "pcamatchr",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "derek.brown@nih.gov",
            "name": "Derek W Brown",
            "typeEntity": "Person"
        }
    ],
    "description": "PCAmatchR is a flexible R package for optimal case-control matching using weighted principal components.\n\nPCAmatchR optimally matches a set of population-based controls to cases. PCAmatchR converts user-provided principal components (PC) into a Mahalanobis distance metric for selecting a set of well-matched controls for each case.\n\nMatches cases to controls based on genotype principal components (PC). In order to produce better results, matches are based on the weighted distance of PCs where the weights are equal to the % variance explained by that PC. A weighted Mahalanobis distance metric is used to determine matches.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Principal component visualisation",
                    "uri": "http://edamontology.org/operation_2939"
                }
            ]
        }
    ],
    "homepage": "https://github.com/machiela-lab/PCAmatchR",
    "language": [
        "R"
    ],
    "lastUpdate": "2024-11-24T20:47:46.641681Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://CRAN.R-project.org/package=PCAmatchR"
        }
    ],
    "name": "PCAmatchR",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btaa784",
            "metadata": {
                "abstract": "Summary: A concern when conducting genome-wide association studies (GWAS) is the potential for population stratification, i.e. ancestry-based genetic differences between cases and controls, that if not properly accounted for, could lead to biased association results. We developed PCAmatchR as an open source R package for performing optimal case-control matching using principal component analysis (PCA) to aid in selecting controls that are well matched by ancestry to cases. PCAmatchR takes user supplied PCA outputs and selects matching controls for cases by utilizing a weighted Mahalanobis distance metric which weights each principal component by the percentage of genetic variation explained. Results from the 1000 Genomes Project data demonstrate both the functionality and performance of PCAmatchR for selecting matching controls for case populations as well as reducing inflation of association test statistics. PCAmatchR improves genomic similarity between matched cases and controls, which minimizes the effects of population stratification in GWAS analyses.",
                "authors": [
                    {
                        "name": "Brown D.W."
                    },
                    {
                        "name": "MacHiela M.J."
                    },
                    {
                        "name": "Myers T.A."
                    }
                ],
                "citationCount": 10,
                "date": "2021-04-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "PCAmatchR: A flexible R package for optimal case-control matching using weighted principal components"
            },
            "pmcid": "PMC8599751",
            "pmid": "32926120"
        }
    ],
    "topic": [
        {
            "term": "GWAS study",
            "uri": "http://edamontology.org/topic_3517"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        }
    ],
    "validated": 1
}
