{
    "additionDate": "2015-01-22T11:31:36Z",
    "biotoolsCURIE": "biotools:ft-comar",
    "biotoolsID": "ft-comar",
    "collectionID": [
        "Bologna Biocomputing Group"
    ],
    "credit": [
        {
            "email": "vassura@cs.unibo.it",
            "name": "Marco Vassura",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "name": "ELIXIR-ITA-BOLOGNA",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        }
    ],
    "description": "Fault Tolerance Reconstruction of 3D Structure from Protein Contact Maps.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://bioinformatics.cs.unibo.it/FT-COMAR/index.html#usage"
        }
    ],
    "editPermission": {
        "authors": [
            "OrangeOcean"
        ],
        "type": "group"
    },
    "elixirNode": [
        "Italy"
    ],
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Protein contact map",
                        "uri": "http://edamontology.org/data_1547"
                    },
                    "format": [
                        {
                            "term": "Matrix format",
                            "uri": "http://edamontology.org/format_3033"
                        }
                    ]
                }
            ],
            "note": "Reconstruction",
            "operation": [
                {
                    "term": "Protein structure prediction",
                    "uri": "http://edamontology.org/operation_0474"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Protein structure",
                        "uri": "http://edamontology.org/data_1460"
                    },
                    "format": [
                        {
                            "term": "PDB",
                            "uri": "http://edamontology.org/format_1476"
                        }
                    ]
                }
            ]
        }
    ],
    "homepage": "http://bioinformatics.cs.unibo.it/FT-COMAR/index.html",
    "lastUpdate": "2024-11-24T14:09:59.820518Z",
    "name": "FT-COMAR",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "ELIXIR-ITA-BOLOGNA",
    "publication": [
        {
            "doi": "10.1109/tcbb.2008.27",
            "metadata": {
                "abstract": "The prediction of the protein tertiary structure from solely its residue sequence (the so-called Protein Folding Problem) is one of the most challenging problems in Structural Bioinformatics. We focus on the protein residue contact map. When this map is assigned, it is possible to reconstruct the 3D structure of the protein backbone. The general problem of recovering a set of 3D coordinates consistent with some given contact map is known as a unit-disk-graph realization problem, and it has been recently proven to be NP-hard. In this paper, we describe a heuristic method (COMAR) that is able to reconstruct with an unprecedented rate (3-15 seconds) a 3D model that exactly matches the target contact map of a protein. Working with a nonredundant set of 1,760 proteins, we find that the scoring efficiency of finding a 3D model very close to the protein native structure depends on the threshold value adopted to compute the protein residue contact map. Contact maps whose threshold values range from 10 to 18 Angstroms allow reconstructing 3D models that are very similar to the proteins' native structure. © 2008 IEEE.",
                "authors": [
                    {
                        "name": "Casadio R."
                    },
                    {
                        "name": "Di Lena P."
                    },
                    {
                        "name": "Fariselli P."
                    },
                    {
                        "name": "Margara L."
                    },
                    {
                        "name": "Medri F."
                    },
                    {
                        "name": "Vassura M."
                    }
                ],
                "citationCount": 72,
                "date": "2008-07-01T00:00:00Z",
                "journal": "IEEE/ACM Transactions on Computational Biology and Bioinformatics",
                "title": "Reconstruction of 3D structures from protein contact maps"
            },
            "pmid": "18670040",
            "type": [
                "Other"
            ]
        },
        {
            "doi": "10.1007/978-3-540-74126-8_4",
            "metadata": {
                "abstract": "In this paper we describe FT-COMAR an algorithm that improves fault tolerance of our heuristic algorithm (COMAR) previously described for protein reconstruction [10]. The algorithm [COMAR-Contact Map Reconstruction] can reconstruct the three-dimensional (3D) structure of the real protein from its contact map with 100% efficiency when tested on 1760 proteins from different structural classes. Here we test the performances of COMAR on native contact maps when a perturbation with random errors is introduced. This is done in order to simulate possible scenarios of reconstruction from predicted (and therefore highly noised) contact maps. From our analysis we obtain that our algorithm performs better reconstructions on blurred contact maps when contacts are under predicted than over predicted. Moreover we modify the algorithm into FT-COMAR [Fault Tolerant-COMAR] in order to use it with incomplete contact maps. FT-COMAR can ignore up to 75% of the contact map and still recover from the remaining 25% entries a 3D structure whose root mean square deviation (RMSD) from the native one is less then 4 Å. Our results indicate that the quality more than the quantity of predicted contacts is relevant to the protein 3D reconstruction and that some hints about \"unsafe\" areas in the predicted contact maps can be useful to improve reconstruction quality. For this, we implement a very simple filtering procedure to detect unsafe areas in contact maps and we show that by this and in the presences of errors the performance of the algorithm can be significantly improved. Furthermore, we show that both COMAR and FT-COMAR overcome a previous state-of-the-art algorithm for the same task [13]. © Springer-Verlag Berlin Heidelberg 2007.",
                "authors": [
                    {
                        "name": "Casadio R."
                    },
                    {
                        "name": "Di Lena P."
                    },
                    {
                        "name": "Fariselli P."
                    },
                    {
                        "name": "Margara L."
                    },
                    {
                        "name": "Medri F."
                    },
                    {
                        "name": "Vassura M."
                    }
                ],
                "citationCount": 5,
                "date": "2007-01-01T00:00:00Z",
                "journal": "Lecture Notes in Computer Science (including subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics)",
                "title": "Fault tolerance for large scale protein 3D reconstruction from contact maps"
            },
            "type": [
                "Other"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Protein secondary structure",
            "uri": "http://edamontology.org/topic_3542"
        },
        {
            "term": "Structure prediction",
            "uri": "http://edamontology.org/topic_0082"
        }
    ],
    "validated": 1,
    "version": [
        "1.0"
    ]
}
