{
    "additionDate": "2021-01-18T08:01:27Z",
    "biotoolsCURIE": "biotools:ccmrd",
    "biotoolsID": "ccmrd",
    "confidence_flag": "tool",
    "credit": [
        {
            "name": "Xue Kang",
            "typeEntity": "Person"
        },
        {
            "name": "Tuo Wang",
            "typeEntity": "Person"
        }
    ],
    "description": "Complex Carbohydrate Magnetic Resonance Database (CCMRD) is a solid-state NMR database for complex carbohydrates. Carbohydrates play key roles in many life activities in living organisms. As an emerging technique with steadily improving resolution, solid-state NMR spectroscopy has the unique capability in revealing the molecular structure and dynamics of insoluble complex carbohydrates. We developed and implemented CCMRD, Complex Carbohydrates Magnetic Resonance Database, a solid-state NMR database for complex carbohydrates. Currently, it holds more than 400 solid-state NMR spectra and expects rapid expansion. The database supports searching by atom, chemical shifts and residue names.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                },
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Spectral analysis",
                    "uri": "http://edamontology.org/operation_3214"
                }
            ]
        }
    ],
    "homepage": "http://www.ccmrd.org",
    "lastUpdate": "2021-02-09T07:56:31Z",
    "name": "CCMRD",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1007/S10858-020-00304-2",
            "metadata": {
                "abstract": "© 2020, Springer Nature B.V.Carbohydrates are essential to various life activities in living organisms and serve as the central component in many biomaterials. As an emerging technique with steadily improving resolution, solid-state Nuclear Magnetic Resonance (NMR) spectroscopy has the unique capability in revealing the polymorphic structure and heterogeneous dynamics of insoluble complex carbohydrates. Here, we report the first solid-state NMR database for complex carbohydrates, Complex Carbohydrates Magnetic Resonance Database (CCMRD). This database currently holds the chemical shift information of more than four hundred solid-state NMR compounds and expects rapid expansion. CCMRD provides open portals for data deposition and supports search options based on NMR chemical shifts, carbohydrate names, and compound classes. With the timely implementation, this platform will facilitate spectral analysis and structure determination of carbohydrates and promote software development to benefit the research community. The database is freely accessible at www.ccmrd.org.",
                "authors": [
                    {
                        "name": "Kang X."
                    },
                    {
                        "name": "Zhao W."
                    },
                    {
                        "name": "Dickwella Widanage M.C."
                    },
                    {
                        "name": "Kirui A."
                    },
                    {
                        "name": "Ozdenvar U."
                    },
                    {
                        "name": "Wang T."
                    }
                ],
                "citationCount": 9,
                "date": "2020-05-01T00:00:00Z",
                "journal": "Journal of Biomolecular NMR",
                "title": "CCMRD: a solid-state NMR database for complex carbohydrates"
            },
            "pmid": "32125579"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "NMR",
            "uri": "http://edamontology.org/topic_0593"
        },
        {
            "term": "Carbohydrates",
            "uri": "http://edamontology.org/topic_0152"
        },
        {
            "term": "Biomaterials",
            "uri": "http://edamontology.org/topic_3368"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "Biotherapeutics",
            "uri": "http://edamontology.org/topic_3374"
        }
    ]
}