{"credit":[{"name":"ugent.be","typeEntity":"Institute","typeRoles":["Provider"]},{"email":"Yvan.Saeys@ugent.be","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"https://github.com/SofieVG/FloReMi"}],"function":[{"operation":[{"term":"Calculation","uri":"http://edamontology.org/operation_3438"}]}],"labels":{"collectionID":["BIG N2N","VIB","UGent"],"language":["R"],"operatingSystem":["Linux","Windows","Mac"],"toolType":["Desktop application"],"topic":[{"term":"Cell biology","uri":"http://edamontology.org/topic_2229"}]},"publication":[{"abstract":"© 2016 International Society for Advancement of Cytometry. Advances in flow cytometry bioinformatics have resulted in a wide variety of clustering, classification and visualization techniques. To objectively evaluate the performance of such methods, common benchmarks such as the FlowCAP initiative have proven to be of great value. In this work, we report on a novel method, FloReMi, which was developed to tackle the most recent FlowCAP IV challenge. This challenge was formulated as a survival modeling problem, where participants were expected to design a model to predict the time until progression to AIDS for HIV patients. It is known that variability in progression rate cannot be fully predicted by simple CD4+ T cell counts. However, it is hypothesized that the immunopathogenesis established early in HIV already indicates the course of future disease. Adequately estimating the progression rate of HIV patients is crucial in their treatment. Using an automated pipeline to preprocess the data, and subsequently identify and select informative cell subsets, a survival regression method based on random survival forests was built, which obtained the best results of all submitted approaches to the FlowCAP IV challenge.","authors":["Van Gassen S.","Vens C.","Dhaene T.","Lambrecht B.N.","Saeys Y."],"cit_count":11,"doi":"10.1002/cyto.a.22734","journal":"Cytometry Part A","title":"FloReMi: Flow density survival regression using minimal feature redundancy","type":"Primary","year":"2016-01-01"}],"summary":{"biotoolsCURIE":"biotools:floremi","biotoolsID":"floremi","description":"Automated analysis for cytometry data.","homepage":"https://github.com/SofieVG/FloReMi","name":"FloReMi","version":["1"]}}