{
    "additionDate": "2019-11-14T18:34:15Z",
    "biotoolsCURIE": "biotools:MM-WHS",
    "biotoolsID": "MM-WHS",
    "confidence_flag": "tool",
    "description": "Evaluation of algorithms for Multi-Modality Whole Heart Segmentation | Multi-Modality Whole Heart Segmentation Challenge | MM-WHS: Multi-Modality Whole Heart Segmentation | Accurate computing, modeling and analysis of the whole heart substructures is important in the development of clinical applications. Segmentation and registration of whole heart images is however challenging and still relies heavily on manual work, which is time-consuming and prone to errors | For evaluation of the test data, the participants should prepare a brief description of their algorithm and email with the segmentation results of the test datasets to the organizers",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "http://www.sdspeople.fudan.edu.cn/zhuangxiahai/0/mmwhs/",
    "lastUpdate": "2024-11-24T20:51:54.528227Z",
    "name": "MM-WHS",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1016/j.media.2019.101537",
            "metadata": {
                "abstract": "Knowledge of whole heart anatomy is a prerequisite for many clinical applications. Whole heart segmentation (WHS), which delineates substructures of the heart, can be very valuable for modeling and analysis of the anatomy and functions of the heart. However, automating this segmentation can be challenging due to the large variation of the heart shape, and different image qualities of the clinical data. To achieve this goal, an initial set of training data is generally needed for constructing priors or for training. Furthermore, it is difficult to perform comparisons between different methods, largely due to differences in the datasets and evaluation metrics used. This manuscript presents the methodologies and evaluation results for the WHS algorithms selected from the submissions to the Multi-Modality Whole Heart Segmentation (MM-WHS) challenge, in conjunction with MICCAI 2017. The challenge provided 120 three-dimensional cardiac images covering the whole heart, including 60 CT and 60 MRI volumes, all acquired in clinical environments with manual delineation. Ten algorithms for CT data and eleven algorithms for MRI data, submitted from twelve groups, have been evaluated. The results showed that the performance of CT WHS was generally better than that of MRI WHS. The segmentation of the substructures for different categories of patients could present different levels of challenge due to the difference in imaging and variations of heart shapes. The deep learning (DL)-based methods demonstrated great potential, though several of them reported poor results in the blinded evaluation. Their performance could vary greatly across different network structures and training strategies. The conventional algorithms, mainly based on multi-atlas segmentation, demonstrated good performance, though the accuracy and computational efficiency could be limited. The challenge, including provision of the annotated training data and the blinded evaluation for submitted algorithms on the test data, continues as an ongoing benchmarking resource via its homepage (www.sdspeople.fudan.edu.cn/zhuangxiahai/0/mmwhs/).",
                "authors": [
                    {
                        "name": "Bagci U."
                    },
                    {
                        "name": "Bian C."
                    },
                    {
                        "name": "Brouard T."
                    },
                    {
                        "name": "Firmin D."
                    },
                    {
                        "name": "Galisot G."
                    },
                    {
                        "name": "Heinrich M.P."
                    },
                    {
                        "name": "Heng P.-A."
                    },
                    {
                        "name": "Keegan J."
                    },
                    {
                        "name": "Li L."
                    },
                    {
                        "name": "Liao X."
                    },
                    {
                        "name": "MacGillivray T."
                    },
                    {
                        "name": "Mohiaddin R."
                    },
                    {
                        "name": "Mortazi A."
                    },
                    {
                        "name": "Newby D."
                    },
                    {
                        "name": "Oster J."
                    },
                    {
                        "name": "Ourselin S."
                    },
                    {
                        "name": "Payer C."
                    },
                    {
                        "name": "Ramel J.-Y."
                    },
                    {
                        "name": "Rhode K."
                    },
                    {
                        "name": "Shi Z."
                    },
                    {
                        "name": "Si W."
                    },
                    {
                        "name": "Smedby O."
                    },
                    {
                        "name": "Stern D."
                    },
                    {
                        "name": "Sun C."
                    },
                    {
                        "name": "Tong Q."
                    },
                    {
                        "name": "Urschler M."
                    },
                    {
                        "name": "Wang C."
                    },
                    {
                        "name": "Wang C."
                    },
                    {
                        "name": "Yang G."
                    },
                    {
                        "name": "Yang G."
                    },
                    {
                        "name": "Yang X."
                    },
                    {
                        "name": "Zeng G."
                    },
                    {
                        "name": "Zheng G."
                    },
                    {
                        "name": "Zhuang X."
                    }
                ],
                "citationCount": 194,
                "date": "2019-12-01T00:00:00Z",
                "journal": "Medical Image Analysis",
                "title": "Evaluation of algorithms for Multi-Modality Whole Heart Segmentation: An open-access grand challenge"
            },
            "pmcid": "PMC6839613",
            "pmid": "31446280"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Cardiology",
            "uri": "http://edamontology.org/topic_3335"
        },
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        }
    ],
    "validated": 1
}
