{
    "additionDate": "2019-11-14T18:23:58Z",
    "biotoolsCURIE": "biotools:MCMap",
    "biotoolsID": "MCMap",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "matthias.ullmann@uni-bayreuth.de",
            "name": "G. Matthias Ullmann",
            "typeEntity": "Person"
        }
    ],
    "description": "Computational Tool for Mapping Energy Landscapes of Transient Protein-Protein Interactions | MCMap is a tool particularly well-suited for analyzing energy landscapes of transient macromolecular complexes. The program applies a Monte Carlo strategy, where the ligand moves randomly in the electrostatic field of the receptor. By applying importance sampling, the major interaction sites are mapped, resulting in a global distribution of ligand-receptor complexes. This approach displays the dynamic character of transiently interacting protein complexes where not a single complex but an ensemble of complexes better describes the protein interactions. The software provides a broad range of analysis options which allow for relating the simulations to experimental data and for interpreting them on a structural level",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Molecular docking",
                    "uri": "http://edamontology.org/operation_0478"
                },
                {
                    "term": "Protein interaction prediction",
                    "uri": "http://edamontology.org/operation_2492"
                }
            ]
        }
    ],
    "homepage": "http://www.bisb.uni-bayreuth.de/index.php?page=downloads",
    "lastUpdate": "2020-12-23T08:09:03Z",
    "name": "MCMap",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1021/ACSOMEGA.8B00572",
            "metadata": {
                "abstract": "© 2018 American Chemical Society.MCMap is a tool particularly well-suited for analyzing energy landscapes of transient macromolecular complexes. The program applies a Monte Carlo strategy, where the ligand moves randomly in the electrostatic field of the receptor. By applying importance sampling, the major interaction sites are mapped, resulting in a global distribution of ligand-receptor complexes. This approach displays the dynamic character of transiently interacting protein complexes where not a single complex but an ensemble of complexes better describes the protein interactions. The software provides a broad range of analysis options which allow for relating the simulations to experimental data and for interpreting them on a structural level. The application of MCMap is exemplified by the electron-transfer complex of cytochrome c peroxidase and cytochrome c from baker's yeast. The functionality of MCMap and the visualization of simulation data are in particular demonstrated by studying the dependence of the association on ionic strength and on the oxidation state of the binding partner. Furthermore, microscopically, a repulsion of a second ligand can be seen in the ternary complex upon the change of the oxidation state of the bound cytochrome c. The software is made available as open source software together with the example and can be downloaded free of charge from http://www.bisb.uni-bayreuth.de/index.php?page=downloads.",
                "authors": [
                    {
                        "name": "Foerster J.M."
                    },
                    {
                        "name": "Poehner I."
                    },
                    {
                        "name": "Ullmann G.M."
                    }
                ],
                "citationCount": 2,
                "date": "2018-06-30T00:00:00Z",
                "journal": "ACS Omega",
                "title": "MCMap - A Computational Tool for Mapping Energy Landscapes of Transient Protein-Protein Interactions"
            },
            "pmcid": "PMC6644659",
            "pmid": "31458826"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Immunoproteins and antigens",
            "uri": "http://edamontology.org/topic_2830"
        },
        {
            "term": "Mathematics",
            "uri": "http://edamontology.org/topic_3315"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        }
    ],
    "validated": 1
}
