{
    "additionDate": "2017-08-03T18:54:16Z",
    "biotoolsCURIE": "biotools:pla",
    "biotoolsID": "pla",
    "credit": [
        {
            "email": "xwan@comp.hkbu.edu.hk",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Piecewise-constant and Low-rank Approximation for Multi-sample aCGH Data Analysis.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://bioinformatics.ust.hk/pla.zip"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Copy number estimation",
                    "uri": "http://edamontology.org/operation_3233"
                }
            ]
        }
    ],
    "homepage": "http://bioinformatics.ust.hk/Software.html",
    "lastUpdate": "2018-12-10T12:58:43Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/pla-piecewise-constant-and-low-rank-approximation-for-multi-sample-acgh-data-analysis.html"
        }
    ],
    "name": "PLA",
    "operatingSystem": [
        "Linux",
        "Windows"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Motivation: The post-genome era sees urgent need for more novel approaches to extracting useful information from the huge amount of genetic data. The identification of recurrent copy number variations (CNVs) from array-based comparative genomic hybridization (aCGH) data can help understand complex diseases, such as cancer. Most of the previous computational methods focused on single-sample analysis or statistical testing based on the results of single-sample analysis. Finding recurrent CNVs from multi-sample data remains a challenging topic worth further study. Results: We present a general and robust method to identify recurrent CNVs from multi-sample aCGH profiles. We express the raw dataset as a matrix and demonstrate that recurrent CNVs will form a low-rank matrix. Hence, we formulate the problem as a matrix recovering problem, where we aim to find a piecewise-constant and low-rank approximation (PLA) to the input matrix. We propose a convex formulation for matrix recovery and an efficient algorithm to globally solve the problem. We demonstrate the advantages of PLA compared with alternative methods using synthesized datasets and two breast cancer datasets. The experimental results show that PLA can successfully reconstruct the recurrent CNV patterns from raw data and achieve better performance compared with alternative methods under a wide range of scenarios. © 2014 The Author 2014.",
                "authors": [
                    {
                        "name": "Zhou X."
                    },
                    {
                        "name": "Liu J."
                    },
                    {
                        "name": "Wan X."
                    },
                    {
                        "name": "Yu W."
                    }
                ],
                "citationCount": 28,
                "date": "2014-07-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Piecewise-constant and low-rank approximation for identification of recurrent copy number variations"
            },
            "pmid": "24642062"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Data architecture, analysis and design",
            "uri": "http://edamontology.org/topic_3365"
        },
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        },
        {
            "term": "GWAS study",
            "uri": "http://edamontology.org/topic_3517"
        }
    ],
    "validated": 1
}