{
    "additionDate": "2018-05-17T17:08:15Z",
    "biotoolsCURIE": "biotools:coloweb",
    "biotoolsID": "coloweb",
    "credit": [
        {
            "email": "binf@insilico.us.com",
            "name": "Support",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "A resource for analysis of colocalization of genomic features.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://projects.insilico.us.com/ColoWeb/help.jsp"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence feature detection",
                    "uri": "http://edamontology.org/operation_0253"
                }
            ]
        }
    ],
    "homepage": "http://projects.insilico.us.com/ColoWeb/",
    "language": [
        "JavaScript",
        "Java"
    ],
    "lastUpdate": "2018-12-10T12:58:58Z",
    "name": "ColoWeb",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1186/S12864-015-1345-3",
            "metadata": {
                "abstract": "© 2015 Kim et al.; licensee BioMed Central.Background: Next-generation sequencing techniques such as ChIP-seq allow researchers to investigate the genomic position of nuclear components and events. These experiments provide researchers with thousands of regions of interest to probe in order to identify biological relevance. As the cost of sequencing decreases and its robustness increases, more and more researchers turn to genome-wide studies to better understand the genomic elements they are studying. One way to interpret the output of sequencing studies is to investigate how the element of interest localizes in relationship to genome annotations and the binding of other nuclear components. Colocalization of genomic features could indicate cooperation and provide evidence for more detailed investigations. Although there are several existing tools for visualizing and analyzing colocalization, either they are difficult to use for experimental researchers, not well maintained, or without measurements for colocalization strength. Here we describe an online tool, ColoWeb, designed to allow experimentalists to compare their datasets to existing genomic features in order to generate hypotheses about biological interactions easily and quickly. Results: ColoWeb is a web-based service for evaluating the colocation of genomic features. Users submit genomic regions of interest, for example, a set of locations from a ChIP-seq analysis. ColoWeb compares the submitted regions of interest to the location of other genomic features such as transcription factors and chromatin modifiers. To facilitate comparisons among various genomic features, the output consists of both graphical representations and quantitative measures of the degree of colocalization between user's genomic regions and selected features. Frequent colocation may indicate a biological relationship. Conclusion: ColoWeb is a biologist-friendly web service that can quickly provide an assessment of thousands of genomic regions to identify colocated genomic features. ColoWeb is freely available at: http://projects.insilico.us.com/ColoWeb .",
                "authors": [
                    {
                        "name": "Kim R.G."
                    },
                    {
                        "name": "Smith O.K."
                    },
                    {
                        "name": "Wong W.C."
                    },
                    {
                        "name": "Ryan A.M."
                    },
                    {
                        "name": "Ryan M.C."
                    },
                    {
                        "name": "Aladjem M.I."
                    }
                ],
                "citationCount": 13,
                "date": "2015-12-12T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "ColoWeb: A resource for analysis of colocalization of genomic features"
            },
            "pmcid": "PMC4364483",
            "pmid": "25887597"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Nucleic acid structure analysis",
            "uri": "http://edamontology.org/topic_0097"
        }
    ],
    "validated": 1
}