{
    "additionDate": "2020-01-14T09:42:51Z",
    "biotoolsCURIE": "biotools:TAP_autogenerated",
    "biotoolsID": "TAP_autogenerated",
    "confidence_flag": "low",
    "credit": [
        {
            "email": "opcodesec@gmail.com",
            "name": "Cheng Huang",
            "orcidid": "https://orcid.org/0000-0002-5871-946X",
            "typeEntity": "Person"
        }
    ],
    "description": "A static analysis model for PHP vulnerabilities based on token and deep learning technology.\n\nWith the widespread usage of Web applications, the security issues of source code are increasing. The exposed vulnerabilities seriously endanger the interests of service providers and customers. There are some models for solving this problem. However, most of them rely on complex graphs generated from source code or regex patterns based on expert experience. In this paper, TAP, which is based on token mechanism and deep learning technology, was proposed as an analysis model to discover the vulnerabilities of PHP: Hypertext Preprocessor (PHP) Web programs conveniently and easily. Based on the token mechanism of PHP language, a custom tokenizer was designed, and it unifies tokens, supports some features of PHP and optimizes the parsing.\n\n||| HOMEPAGE MISSING!.\n\n||| NAME EQUAL TO (PUB. DIFFERENT) bio.tools/tap.\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'tokenizer'",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Parsing",
                    "uri": "http://edamontology.org/operation_1812"
                },
                {
                    "term": "Sorting",
                    "uri": "http://edamontology.org/operation_3802"
                }
            ]
        }
    ],
    "homepage": "https://www.ncbi.nlm.nih.gov/pubmed/?term=31738786",
    "language": [
        "PHP"
    ],
    "lastUpdate": "2020-01-14T09:42:51Z",
    "name": "TAP_autogenerated",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PONE.0225196",
            "metadata": {
                "abstract": "© 2019 Fang et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.With the widespread usage of Web applications, the security issues of source code are increasing. The exposed vulnerabilities seriously endanger the interests of service providers and customers. There are some models for solving this problem. However, most of them rely on complex graphs generated from source code or regex patterns based on expert experience. In this paper, TAP, which is based on token mechanism and deep learning technology, was proposed as an analysis model to discover the vulnerabilities of PHP: Hypertext Preprocessor (PHP) Web programs conveniently and easily. Based on the token mechanism of PHP language, a custom tokenizer was designed, and it unifies tokens, supports some features of PHP and optimizes the parsing. Besides, the tokenizer also implements parameter iteration to achieve data flow analysis. On the Software Assurance Reference Dataset(SARD) and SQLI-LABS dataset, we trained the deep learning model of TAP by combining the word2vec model with Long Short-Term Memory (LSTM) network algorithm. According to the experiment on the dataset of CWE-89, TAP not only achieves the 0.9941 Area Under the Curve(AUC), which is better than other models, but also achieves the highest accuracy: 0.9787. Further, compared with RIPS, TAP shows much better in multiclass classification with 0.8319 Kappa and 0.0840 hamming distance.",
                "authors": [
                    {
                        "name": "Fang Y."
                    },
                    {
                        "name": "Han S."
                    },
                    {
                        "name": "Huang C."
                    },
                    {
                        "name": "Wu R."
                    }
                ],
                "citationCount": 3,
                "date": "2019-11-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "TAP: A static analysis model for PHP vulnerabilities based on token and deep learning technology"
            },
            "pmcid": "PMC6860437",
            "pmid": "31738786"
        }
    ],
    "topic": [
        {
            "term": "RNA immunoprecipitation",
            "uri": "http://edamontology.org/topic_3794"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ]
}