{
    "additionDate": "2021-01-18T07:08:36Z",
    "biotoolsCURIE": "biotools:spvec",
    "biotoolsID": "spvec",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "dqwei@sjtu.edu.cn",
            "name": "Dong-Qing Wei",
            "typeEntity": "Person"
        },
        {
            "email": "xuqin523@sjtu.edu.cn",
            "name": "Qin Xu",
            "typeEntity": "Person"
        }
    ],
    "description": "A Word2vec-Inspired Feature Representation Method for Drug-Target Interaction Prediction.\n\nDrug discovery is an academical and commercial process of global importance.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                },
                {
                    "term": "Feature extraction",
                    "uri": "http://edamontology.org/operation_3937"
                },
                {
                    "term": "Protein interaction prediction",
                    "uri": "http://edamontology.org/operation_2492"
                }
            ]
        }
    ],
    "homepage": "https://github.com/dqwei-lab/SPVec",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-02-21T15:06:25Z",
    "license": "BSD-3-Clause",
    "name": "SPVec",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.3389/FCHEM.2019.00895",
            "metadata": {
                "abstract": "© Copyright © 2020 Zhang, Wang, Kaushik, Chu, Shan, Zhao, Xu and Wei.Drug discovery is an academical and commercial process of global importance. Accurate identification of drug-target interactions (DTIs) can significantly facilitate the drug discovery process. Compared to the costly, labor-intensive and time-consuming experimental methods, machine learning (ML) plays an ever-increasingly important role in effective, efficient and high-throughput identification of DTIs. However, upstream feature extraction methods require tremendous human resources and expert insights, which limits the application of ML approaches. Inspired by the unsupervised representation learning methods like Word2vec, we here proposed SPVec, a novel way to automatically represent raw data such as SMILES strings and protein sequences into continuous, information-rich and lower-dimensional vectors, so as to avoid the sparseness and bit collisions from the cumbersomely manually extracted features. Visualization of SPVec nicely illustrated that the similar compounds or proteins occupy similar vector space, which indicated that SPVec not only encodes compound substructures or protein sequences efficiently, but also implicitly reveals some important biophysical and biochemical patterns. Compared with manually-designed features like MACCS fingerprints and amino acid composition (AAC), SPVec showed better performance with several state-of-art machine learning classifiers such as Gradient Boosting Decision Tree, Random Forest and Deep Neural Network on BindingDB. The performance and robustness of SPVec were also confirmed on independent test sets obtained from DrugBank database. Also, based on the whole DrugBank dataset, we predicted the possibilities of all unlabeled DTIs, where two of the top five predicted novel DTIs were supported by external evidences. These results indicated that SPVec can provide an effective and efficient way to discover reliable DTIs, which would be beneficial for drug reprofiling.",
                "authors": [
                    {
                        "name": "Chu Y."
                    },
                    {
                        "name": "Kaushik A.C."
                    },
                    {
                        "name": "Shan X."
                    },
                    {
                        "name": "Wang X."
                    },
                    {
                        "name": "Wei D.-Q."
                    },
                    {
                        "name": "Xu Q."
                    },
                    {
                        "name": "Zhang Y.-F."
                    },
                    {
                        "name": "Zhao M.-Z."
                    }
                ],
                "citationCount": 8,
                "date": "2020-01-10T00:00:00Z",
                "journal": "Frontiers in Chemistry",
                "title": "SPVec: A Word2vec-Inspired Feature Representation Method for Drug-Target Interaction Prediction"
            },
            "pmcid": "PMC6967417",
            "pmid": "31998687"
        }
    ],
    "topic": [
        {
            "term": "Biophysics",
            "uri": "http://edamontology.org/topic_3306"
        },
        {
            "term": "Drug discovery",
            "uri": "http://edamontology.org/topic_3336"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
