{
    "accessibility": "Open access",
    "additionDate": "2022-06-10T14:49:19.614798Z",
    "biotoolsCURIE": "biotools:cmatch",
    "biotoolsID": "cmatch",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "r.kitney@imperial.ac.uk",
            "name": "Richard Kitney",
            "typeEntity": "Person"
        }
    ],
    "description": "cMatch is a simple, lightweight tool to perform quality control of modular synthetic constructs at speed and scale",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Local alignment",
                    "uri": "http://edamontology.org/operation_0495"
                },
                {
                    "term": "Sequence assembly",
                    "uri": "http://edamontology.org/operation_0310"
                },
                {
                    "term": "Sequence assembly validation",
                    "uri": "http://edamontology.org/operation_3180"
                }
            ]
        }
    ],
    "homepage": "https://github.com/kitneylab/cmatch",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-06-10T14:49:19.617376Z",
    "license": "MIT",
    "name": "cMatch",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.3389/FBIOE.2021.785131",
            "metadata": {
                "abstract": "Copyright © 2022 Casas, Bultelle, Motraghi and Kitney.We present a software tool, called cMatch, to reconstruct and identify synthetic genetic constructs from their sequences, or a set of sub-sequences—based on two practical pieces of information: their modular structure, and libraries of components. Although developed for combinatorial pathway engineering problems and addressing their quality control (QC) bottleneck, cMatch is not restricted to these applications. QC takes place post assembly, transformation and growth. It has a simple goal, to verify that the genetic material contained in a cell matches what was intended to be built - and when it is not the case, to locate the discrepancies and estimate their severity. In terms of reproducibility/reliability, the QC step is crucial. Failure at this step requires repetition of the construction and/or sequencing steps. When performed manually or semi-manually QC is an extremely time-consuming, error prone process, which scales very poorly with the number of constructs and their complexity. To make QC frictionless and more reliable, cMatch performs an operation we have called “construct-matching” and automates it. Construct-matching is more thorough than simple sequence-matching, as it matches at the functional level-and quantifies the matching at the individual component level and across the whole construct. Two algorithms (called CM_1 and CM_2) are presented. They differ according to the nature of their inputs. CM_1 is the core algorithm for construct-matching and is to be used when input sequences are long enough to cover constructs in their entirety (e.g., obtained with methods such as next generation sequencing). CM_2 is an extension designed to deal with shorter data (e.g., obtained with Sanger sequencing), and that need recombining. Both algorithms are shown to yield accurate construct-matching in a few minutes (even on hardware with limited processing power), together with a set of metrics that can be used to improve the robustness of the decision-making process. To ensure reliability and reproducibility, cMatch builds on the highly validated pairwise-matching Smith-Waterman algorithm. All the tests presented have been conducted on synthetic data for challenging, yet realistic constructs - and on real data gathered during studies on a metabolic engineering example (lycopene production).",
                "authors": [
                    {
                        "name": "Bultelle M."
                    },
                    {
                        "name": "Casas A."
                    },
                    {
                        "name": "Kitney R."
                    },
                    {
                        "name": "Motraghi C."
                    }
                ],
                "date": "2022-01-10T00:00:00Z",
                "journal": "Frontiers in Bioengineering and Biotechnology",
                "title": "Removing the Bottleneck: Introducing cMatch - A Lightweight Tool for Construct-Matching in Synthetic Biology"
            },
            "pmcid": "PMC8784771",
            "pmid": "35083201"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Synthetic biology",
            "uri": "http://edamontology.org/topic_3895"
        }
    ],
    "validated": 1
}
