{
    "additionDate": "2017-05-01T17:08:57Z",
    "biotoolsCURIE": "biotools:ad-enm",
    "biotoolsID": "ad-enm",
    "credit": [
        {
            "email": "adenm.help@gmail.com",
            "name": "Wenjun Zheng",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Analysis of Dynamics of Elastic Network Model (AD-ENM) predicts the conformational changes a given protein structure can undergo.",
    "documentation": [
        {
            "type": "General",
            "url": "https://www.java.com/en/download/help/jcp_security.xml"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein modelling",
                    "uri": "http://edamontology.org/operation_0477"
                },
                {
                    "term": "Metabolic network modelling",
                    "uri": "http://edamontology.org/operation_3660"
                },
                {
                    "term": "Protein structure prediction",
                    "uri": "http://edamontology.org/operation_0474"
                },
                {
                    "term": "Protein flexibility and motion analysis",
                    "uri": "http://edamontology.org/operation_0244"
                }
            ]
        }
    ],
    "homepage": "http://enm.lobos.nih.gov",
    "language": [
        "Java"
    ],
    "lastUpdate": "2018-12-10T12:58:56Z",
    "name": "AD-ENM",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "The open/closed transition in polymerases is a crucial event in DNA replication and transcription. We hypothesize that the residues that transmit the signal for the open/closed transition are also strongly conserved. To identify the dynamically relevant residues, we use an elastic network model of polymerases and probe the residue-specific response to a local perturbation. In a variety of DNA/RNA polymerases, a network of residues spanning the fingers and palm domains is involved in the open/closed transition. The similarity in the network of residues responsible for large-scale domain movements supports the notion of a common induced-fit mechanism in the polymerase families for the formation of a closed ternary complex. Multiple sequence alignment shows that many of these residues are also strongly conserved. Residues with the largest sensitivity to local perturbations include those that are not so obviously involved in the polymerase catalysis. Our results suggest that mutations of the mechanical \"hot spots\" can compromise the efficiency of the enzyme. ©2005 Elsevier Ltd. All rights reserved.",
                "authors": [
                    {
                        "name": "Zheng W."
                    },
                    {
                        "name": "Brooks B.R."
                    },
                    {
                        "name": "Doniach S."
                    },
                    {
                        "name": "Thirumalai D."
                    }
                ],
                "citationCount": 93,
                "date": "2005-01-01T00:00:00Z",
                "journal": "Structure",
                "title": "Network of dynamically important residues in the open/closed transition in polymerases is strongly conserved"
            },
            "pmid": "15837195"
        },
        {
            "metadata": {
                "abstract": "In order to systematically analyze functionally relevant dynamical correlations within macromolecular complexes, we have developed computational methods based on the normal mode analysis of an elastic network model. First, we define two types of dynamical correlations (fluctuation-based and density-based), which are computed by summing up contributions from all low-frequency normal modes up to a given cutoff. Then we use them to select dynamically important \"hinge residues\" whose elastic distortion affects the fluctuations of a large number of residues. Second, in order to clarify long-range dynamical correlations, we decompose the dynamical correlations to individual normal modes to identify the most relevant modes. We have applied these methods to the analysis of the motor domain of Dictyostelium myosin and have obtained the following three interesting results that shed light on its mechanism of force generation: first, we find the hinge residues are distributed over several key inter-subdomain joints (including the nucleotide-binding pocket, the relay helix, the SH1 helix, the strut between the upper 50 kDa and the lower 50 kDa subdomains), which is consistent with their hypothesized roles in modulating functionally relevant inter-subdomain conformational changes; second, a single mode 7 (for structure 1VOM) is found to dominate the fluctuation-based correlations between the converter/strut and the nucleotide-binding pocket, revealing a surprising simplicity for their intriguing roles in the force generation mechanism; finally, we find a negative density-based correlation between the strut and the nucleotide-binding pocket, which is consistent with the hypothesized signaling pathway that links the actin-binding site's opening/closing with the nucleotide-binding pocket's closing/opening.",
                "authors": [
                    {
                        "name": "Zheng W."
                    },
                    {
                        "name": "Brooks B."
                    }
                ],
                "citationCount": 96,
                "date": "2005-02-25T00:00:00Z",
                "journal": "Journal of Molecular Biology",
                "title": "Identification of dynamical correlations within the myosin motor domain by the normal mode analysis of an elastic network model"
            },
            "pmid": "15713460"
        },
        {
            "metadata": {
                "abstract": "In this work, we report on a study of the structure-function relationships for three families of motor proteins, including kinesins, myosins, and F1-ATPases, by using a version of the simple elastic-network model of large-scale protein motions originally proposed by Tirion [Tirion, M. (1996) Phys. Rev. Lett. 77, 1905-1908]. We find a surprising dichotomy between kinesins and the other motor proteins (myosins and F1-ATPase). For the latter, there exist one or two dominant lowest-frequency modes (one for myosin, two for F1-ATPase) obtained from normal-mode analysis of the elastic-network model, which overlap remarkably well with the measured conformational changes derived from pairs of solved crystal structures in different states. Furthermore, we find that the computed global conformational changes induced by the measured deformation of the nucleotide-binding pocket also overlap well with the measured conformational changes, which is consistent with the \"nucleotide-binding-induced power-stroke\" scenario. In contrast, for kinesins, this simplicity breaks down. Multiple modes are needed to generate the measured conformational changes, and the computed displacements induced by deforming the nucleotide-binding pocket also overlap poorly with the measured conformational changes, and are insufficient to explain the large-scale motion of the relay helix and the linker region. This finding may suggest the presence of two different mechanisms for myosins and kinesins, despite their strong evolutionary ties and structural similarities.",
                "authors": [
                    {
                        "name": "Zheng W."
                    },
                    {
                        "name": "Doniach S."
                    }
                ],
                "citationCount": 157,
                "date": "2003-11-11T00:00:00Z",
                "journal": "Proceedings of the National Academy of Sciences of the United States of America",
                "title": "A comparative study of motor-protein motions by using a simple elastic-network model"
            },
            "pmid": "14585932"
        },
        {
            "metadata": {
                "abstract": "Based on the elastic network model, we develop a new analysis for protein complexes, which probes the local dynamics of a subsystem that is elastically coupled to a fluctuating environment. This method is applied to a comparative dynamical analysis of the nucleotide-binding pocket of two motor proteins-myosins and kinesins. In myosins, the observed structural changes in the nucleotide-pocket from the transition state to the rigorlike state are dominated by the lowest normal mode that involves significant movements in both switch I and switch II; in kinesins, the measured conformational changes in the nucleotide-pocket are also dominated by the lowest mode, which, however, only involves large movement in switch I. We then compute the global structural changes induced by the nucleotide-pocket deformations as described by the dominant pocket-mode, which yield encouraging results: in myosins, multiple hinge motions involving the opening/closing of the cleft between the upper and lower 50 -kDa subdomains and the swinging movement of the converter are induced, which are dominated by precisely the same global mode that has been recently identified by us as important to the dynamical correlations among the nucleotide-pocket, the actin-binding site, and the converter; in kinesins, the induced global conformational changes are well described by a highly collective global mode which hints for a dynamical pathway spanning from the nucleotide-pocket to the neck-linker via the H6 helix. © 2005 by the Biophysical Society.",
                "authors": [
                    {
                        "name": "Zheng W."
                    },
                    {
                        "name": "Brooks B.R."
                    }
                ],
                "citationCount": 74,
                "date": "2005-01-01T00:00:00Z",
                "journal": "Biophysical Journal",
                "title": "Probing the local dynamics of nucleotide-binding pocket coupled to the global dynamics: Myosin versus kinesin"
            },
            "pmid": "15879477"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Electron microscopy",
            "uri": "http://edamontology.org/topic_0611"
        },
        {
            "term": "Molecular dynamics",
            "uri": "http://edamontology.org/topic_0176"
        },
        {
            "term": "Structure prediction",
            "uri": "http://edamontology.org/topic_0082"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        }
    ],
    "validated": 1
}