{
    "accessibility": "Open access (with restrictions)",
    "additionDate": "2021-05-05T11:05:46Z",
    "biotoolsCURIE": "biotools:auc-comparison-p-value",
    "biotoolsID": "auc-comparison-p-value",
    "collectionID": [
        "MATLAB",
        "File Exchange"
    ],
    "cost": "Free of charge (with restrictions)",
    "credit": [
        {
            "email": "louis.mayaud@gmail.com",
            "name": "Louis Mayaud",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://www.mathworks.com/matlabcentral/profile/3123136-louis"
        }
    ],
    "description": "Compares two AUCs derived from same cases",
    "download": [
        {
            "type": "Screenshot",
            "url": "https://www.mathworks.com//matlabcentral/mlc-downloads/downloads/submissions/43201/versions/1/screenshot.png"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "homepage": "https://www.mathworks.com/matlabcentral/fileexchange/43201-auc-comparison-p-value",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2021-05-24T08:14:41Z",
    "name": "AUC comparison p-value",
    "operatingSystem": [
        "Windows",
        "Linux",
        "Mac"
    ],
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1097/CCM.0b013e3182772adb",
            "metadata": {
                "abstract": "Objectives: To determine if a prediction rule for hospital mortality using dynamic variables in response to treatment of hypotension in patients with sepsis performs better than current models. Design: Retrospective cohort study. Setting: All ICUs at a tertiary care hospital. Patients: Adult patients admitted to ICUs between 2001 and 2007 of whom 2,113 met inclusion criteria and had sufficient data. Interventions: None. Measurements and Main Results: We developed a prediction algorithm for hospital mortality in patients with sepsis and hypotension requiring medical intervention using data from the Multiparameter Intelligent Monitoring in Intensive Care II. We extracted 189 candidate variables, including treatments, physiologic variables and laboratory values collected before, during, and after a hypotensive episode. Thirty predictors were identified using a genetic algorithm on a training set (n = 1500) and validated with a logistic regression model on an independent validation set (n = 613). The final prediction algorithm used included dynamic information and had good discrimination (area under the receiver operating curve = 82.0%) and calibration (Hosmer-Lemeshow C statistic = 10.43, p = 0.06). This model was compared with Acute Physiology and Chronic Health Evaluation IV using reclassification indices and was found to be superior with an Net Reclassification Improvement of 0.19 (p < 0.001) and an Integrated Discrimination Improvement of 0.09 (p < 0.001). Conclusions: Hospital mortality predictions based on dynamic variables surrounding a hypotensive event is a new approach to predicting prognosis. A model using these variables has good discrimination and calibration and offers additional predictive prognostic information beyond established ones. © 2013 by the Society of Critical Care Medicine and Lippincott Williams & Wilkins.",
                "authors": [
                    {
                        "name": "Mayaud L."
                    },
                    {
                        "name": "Lai P.S."
                    },
                    {
                        "name": "Clifford G.D."
                    },
                    {
                        "name": "Tarassenko L."
                    },
                    {
                        "name": "Celi L.A."
                    },
                    {
                        "name": "Annane D."
                    }
                ],
                "citationCount": 37,
                "date": "2013-04-01T00:00:00Z",
                "journal": "Critical Care Medicine",
                "title": "Dynamic data during hypotensive episode improves mortality predictions among patients with sepsis and hypotension"
            },
            "pmcid": "PMC3609896",
            "pmid": "23385106",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Library"
    ],
    "version": [
        "1.0.0.0"
    ]
}