{
    "additionDate": "2019-11-14T18:36:16Z",
    "biotoolsCURIE": "biotools:ResidueDisorder",
    "biotoolsID": "ResidueDisorder",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "lindert.1@osu.edu",
            "name": "Steffen Lindert",
            "typeEntity": "Person"
        }
    ],
    "description": "Measuring Intrinsic Disorder and Tracking Conformational Transitions Using Rosetta ResidueDisorder | Many proteins contain regions of intrinsic disorder, not folding into unique, stable conformations. Numerous experimental methods have been developed to measure the disorder of all or select residues. In the absence of experimental data, computational methods are often utilized to identify these disordered regions and thus gain a better understanding of both structure and function. Many freely available computational methods have been developed to predict regions of intrinsic disorder from the primary sequence of a protein, including our recently developed Rosetta ResidueDisorder. While these methods are very useful, they are only designed to predict intrinsic disorder from the sequence",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Fold recognition",
                    "uri": "http://edamontology.org/operation_0303"
                },
                {
                    "term": "Protein disorder prediction",
                    "uri": "http://edamontology.org/operation_3904"
                },
                {
                    "term": "Simulation analysis",
                    "uri": "http://edamontology.org/operation_0244"
                }
            ]
        }
    ],
    "homepage": "https://www.rosettacommons.org/docs/latest/ResidueDisorder",
    "lastUpdate": "2020-12-13T14:49:47Z",
    "name": "ResidueDisorder",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1021/ACS.JPCB.9B04333",
            "metadata": {
                "abstract": "© 2019 American Chemical Society.Many proteins contain regions of intrinsic disorder, not folding into unique, stable conformations. Numerous experimental methods have been developed to measure the disorder of all or select residues. In the absence of experimental data, computational methods are often utilized to identify these disordered regions and thus gain a better understanding of both structure and function. Many freely available computational methods have been developed to predict regions of intrinsic disorder from the primary sequence of a protein, including our recently developed Rosetta ResidueDisorder. While these methods are very useful, they are only designed to predict intrinsic disorder from the sequence. However, it would be useful to have a method that could also measure intrinsic disorder directly from structure. Such a method might also be used to identify changes in the structure of systems that can transition from folded to unfolded or vice versa, even systems that are not intrinsically disordered. Here we extended the capabilities of Rosetta ResidueDisorder to measure the intrinsic disorder from the coordinates of a single conformation of a protein. As a proof of principle, we show that ResidueDisorder can measure the intrinsic disorder from the coordinates with a higher accuracy (69.2%) than when predicted from sequence (65.4%) using a benchmark set of 229 proteins, showing that intrinsic disorder can be measured accurately from single structures over a large range of intrinsic disorder (0-100%). Additionally, we used ResidueDisorder to analyze unfolding trajectories of 12 fast-folding, nonintrinsically disordered proteins generated using molecular dynamics (MD), specifically steered MD (SMD), higherature MD, and accelerated MD (aMD) as well as long-time scale folding/unfolding trajectories. Using ResidueDisorder, a clear correlation between RMSD with respect to the native structure and measured fraction of denatured residues was observed. Finally, we introduced methods to predict folding/unfolding transitions as well as a native-like structure in the absence of a crystal structure from folding/unfolding MD trajectories. Rosetta ResidueDisorder is available as an application in the Rosetta software suite with the addition of new capabilities for directly identifying denatured regions and predicting events.",
                "authors": [
                    {
                        "name": "Kim S.S."
                    },
                    {
                        "name": "Lindert S."
                    },
                    {
                        "name": "Ren H."
                    },
                    {
                        "name": "Seffernick J.T."
                    }
                ],
                "citationCount": 2,
                "date": "2019-08-22T00:00:00Z",
                "journal": "Journal of Physical Chemistry B",
                "title": "Measuring Intrinsic Disorder and Tracking Conformational Transitions Using Rosetta ResidueDisorder"
            },
            "pmcid": "PMC6748046",
            "pmid": "31411026"
        }
    ],
    "topic": [
        {
            "term": "Protein disordered structure",
            "uri": "http://edamontology.org/topic_3538"
        },
        {
            "term": "Protein folding, stability and design",
            "uri": "http://edamontology.org/topic_0130"
        },
        {
            "term": "Protein folds and structural domains",
            "uri": "http://edamontology.org/topic_0736"
        }
    ],
    "validated": 1
}
