{
    "additionDate": "2021-03-19T09:09:24Z",
    "biotoolsCURIE": "biotools:snpr",
    "biotoolsID": "snpr",
    "confidence_flag": "tool",
    "credit": [
        {
            "name": "Melissa Jones"
        },
        {
            "name": "William Hemstrom"
        }
    ],
    "description": "user friendly population genomics for SNP datasets with categorical metadata.\n\nThe analysis of genomic data can be an intimidating process, particularly for researchers who are not experienced programmers. Commonly used analyses are spread out across programs, each of which require their own input formats, and data must often be.\n\nthis is for holding javascript data.\n\nThe analysis of genomic data can be an intimidating process, particularly for researchers who are not experienced programmers.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Splitting",
                    "uri": "http://edamontology.org/operation_3359"
                }
            ]
        }
    ],
    "homepage": "https://rdrr.io/github/hemstrow/snpR/",
    "language": [
        "R"
    ],
    "lastUpdate": "2024-11-24T15:18:05.351725Z",
    "name": "snpR",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1111/1755-0998.13721",
            "metadata": {
                "abstract": "The analysis of genomic data can be an intimidating process, particularly for researchers who are not experienced programmers. Commonly used analyses are spread across many programs, each requiring their own specific input formats, and so data must often be repeatedly reorganized and transformed into new formats. Analyses often require splitting data according to metadata variables such as population or family, which can be challenging to manage in large data sets. Here, we introduce snpR, a user-friendly data analysis package in R for processing SNP genomic data. snpR is designed to automate data subsetting and analyses across categorical metadata while also streamlining repeated analyses by integrating approaches contained in many different packages in a single ecosystem. snpR facilitates iterative and efficient analyses centred on a single R object for an entire analysis pipeline.",
                "authors": [
                    {
                        "name": "Hemstrom W."
                    },
                    {
                        "name": "Jones M."
                    }
                ],
                "citationCount": 15,
                "date": "2023-05-01T00:00:00Z",
                "journal": "Molecular Ecology Resources",
                "title": "snpR: User friendly population genomics for SNP data sets with categorical metadata"
            },
            "pmid": "36239472"
        }
    ],
    "toolType": [
        "Command-line tool",
        "Library"
    ],
    "topic": [
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Population genomics",
            "uri": "http://edamontology.org/topic_3796"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ]
}
