{
    "accessibility": "Open access",
    "additionDate": "2015-10-07T18:29:49Z",
    "biotoolsCURIE": "biotools:pdb-redo",
    "biotoolsID": "pdb-redo",
    "collectionID": [
        "3D-BioInfo",
        "3D-BioInfo-Nucleic-Acid",
        "3D-BioInfo-Protein-Ligand-Interactions",
        "3D-BioInfo-Structure-Function",
        "DRCAT",
        "INSTRUCT"
    ],
    "cost": "Free of charge",
    "credit": [
        {
            "email": "vriend@cmbi.ru.nl",
            "name": "Gert Vriend",
            "note": "Project initiator",
            "typeEntity": "Person"
        },
        {
            "email": "a.perrakis@nki.nl",
            "name": "Anastassis Perrakis",
            "orcidid": "https://orcid.org/0000-0002-1151-6227",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "r.joosten@nki.nl",
            "name": "Robbie P. Joosten",
            "orcidid": "https://orcid.org/0000-0002-2323-2686",
            "typeEntity": "Person",
            "typeRole": [
                "Developer",
                "Primary contact"
            ]
        },
        {
            "email": "m.hekkelman@nki.nl",
            "name": "Maarten Hekkelman",
            "typeEntity": "Person",
            "typeRole": [
                "Developer"
            ]
        },
        {
            "name": "Netherlands Organization for Scientific Research (NWO)",
            "note": "Various grants (Veni, Vidi, TOP)",
            "typeEntity": "Funding agency"
        },
        {
            "name": "CCP4",
            "note": "Financial and other support",
            "typeEntity": "Project",
            "typeRole": [
                "Contributor"
            ],
            "url": "https://www.ccp4.ac.uk"
        },
        {
            "name": "West-Life Horizon 2020",
            "typeEntity": "Consortium"
        },
        {
            "name": "iNEXT",
            "typeEntity": "Consortium"
        },
        {
            "name": "Bart van Beusekom",
            "typeEntity": "Person",
            "typeRole": [
                "Contributor"
            ]
        },
        {
            "name": "Krista Joosten",
            "typeEntity": "Person",
            "typeRole": [
                "Contributor"
            ]
        },
        {
            "name": "The Netherlands Cancer Institute",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        },
        {
            "name": "Wouter Touw",
            "typeEntity": "Person",
            "typeRole": [
                "Contributor"
            ]
        }
    ],
    "description": "Databank of optimised macromolecular structures. PDB-REDO entries are refined, rebuilt and validated with one consistent protocol using the equivalent entry in the Protein Data Bank and its experimental data. PDB-REDO entries typically have higher structural quality and a better fit to the experimental data.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://pdb-redo.eu"
        }
    ],
    "download": [
        {
            "type": "Downloads page",
            "url": "https://pdb-redo.eu/download-info.html"
        }
    ],
    "editPermission": {
        "authors": [
            "rjoosten"
        ],
        "type": "group"
    },
    "elixirCommunity": [
        "3D-BioInfo"
    ],
    "elixirPlatform": [
        "Data"
    ],
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "PDB ID",
                        "uri": "http://edamontology.org/data_1127"
                    }
                }
            ],
            "operation": [
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Electron density map",
                        "uri": "http://edamontology.org/data_0937"
                    }
                },
                {
                    "data": {
                        "term": "Protein structural quality report",
                        "uri": "http://edamontology.org/data_1539"
                    },
                    "format": [
                        {
                            "term": "JSON",
                            "uri": "http://edamontology.org/format_3464"
                        },
                        {
                            "term": "Textual format",
                            "uri": "http://edamontology.org/format_2330"
                        }
                    ]
                },
                {
                    "data": {
                        "term": "Protein structure",
                        "uri": "http://edamontology.org/data_1460"
                    },
                    "format": [
                        {
                            "term": "dssp",
                            "uri": "http://edamontology.org/format_1454"
                        }
                    ]
                },
                {
                    "data": {
                        "term": "Structure",
                        "uri": "http://edamontology.org/data_0883"
                    },
                    "format": [
                        {
                            "term": "PDB",
                            "uri": "http://edamontology.org/format_1476"
                        },
                        {
                            "term": "mmCIF",
                            "uri": "http://edamontology.org/format_1477"
                        }
                    ]
                }
            ]
        }
    ],
    "homepage": "https://pdb-redo.eu",
    "lastUpdate": "2022-02-09T10:24:38.539314Z",
    "license": "Freeware",
    "maturity": "Mature",
    "name": "PDB-REDO databank of optimised macromolecular structures",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "rjoosten",
    "publication": [
        {
            "doi": "10.1016/j.jmb.2016.02.002",
            "metadata": {
                "abstract": "© 2016 The Authors. Published by Elsevier Ltd.Structure validation is a key component of all steps in the structure determination process, from structure building, refinement, deposition, and evaluation all the way to post-deposition optimisation of structures in the Protein Data Bank (PDB) by re-refinement and re-building. Today, many aspects of protein structures are understood better than 10 years ago, and combined with improved software and more computing power, the automated PDB-REDO procedure can significantly improve about 85% of all X-ray structures ever deposited in the PDB. We review structure validation, structure improvement, and a series of validation resources and facilities that give access to improved PDB files and to reports on the quality of the original and the improved structures. Post-deposition optimisation generally leads to improved protein structures and a series of examples will illustrate how that, in turn, leads to improved or even novel biological insights.",
                "authors": [
                    {
                        "name": "Joosten R.P."
                    },
                    {
                        "name": "Touw W.G."
                    },
                    {
                        "name": "Vriend G."
                    }
                ],
                "citationCount": 24,
                "date": "2016-03-27T00:00:00Z",
                "journal": "Journal of Molecular Biology",
                "title": "New Biological Insights from Better Structure Models"
            },
            "note": "Biological interpretation",
            "type": [
                "Usage"
            ]
        },
        {
            "doi": "10.1093/bioinformatics/btr590",
            "metadata": {
                "abstract": "Motivation: Macromolecular crystal structures in the Protein Data Bank (PDB) are a key source of structural insight into biological processes. These structures, some >30 years old, were constructed with methods of their era. With PDB_REDO, we aim to automatically optimize these structures to better fit their corresponding experimental data, passing the benefits of new methods in crystallography on to a wide base of non-crystallographer structure users. Results: We developed new algorithms to allow automatic rebuilding and remodeling of main chain peptide bonds and side chains in crystallographic electron density maps, and incorporated these and further enhancements in the PDB_REDO procedure. Applying the updated PDB_REDO to the oldest, but also to some of the newest models in the PDB, corrects existing modeling errors and brings these models to a higher quality, as judged by standard validation methods. © The Author(s) 2011. Published by Oxford University Press.",
                "authors": [
                    {
                        "name": "Cohen S.X."
                    },
                    {
                        "name": "Joosten K."
                    },
                    {
                        "name": "Joosten R.P."
                    },
                    {
                        "name": "Perrakis A."
                    },
                    {
                        "name": "Vriend G."
                    }
                ],
                "citationCount": 66,
                "date": "2011-12-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Automatic rebuilding and optimization of crystallographic structures in the Protein Data Bank"
            },
            "note": "Algorithms for model rebuilding",
            "type": [
                "Method"
            ]
        },
        {
            "doi": "10.1107/S0907444911054515",
            "metadata": {
                "abstract": "Developments of the PDB-REDO procedure that combine re-refinement and rebuilding within a unique decision-making framework to improve structures in the PDB are presented. PDB-REDO uses a variety of existing and custom-built software modules to choose an optimal refinement protocol (e.g. anisotropic, isotropic or overall B-factor refinement, TLS model) and to optimize the geometry versus data-refinement weights. Next, it proceeds to rebuild side chains and peptide planes before a final optimization round. PDB-REDO works fully automatically without the need for intervention by a crystallographic expert. The pipeline was tested on 12 000 PDB entries and the great majority of the test cases improved both in terms of crystallographic criteria such as R free and in terms of widely accepted geometric validation criteria. It is concluded that PDB-REDO is useful to update the otherwise static structures in the PDB to modern crystallographic standards. The publically available PDB-REDO database provides better model statistics and contributes to better refinement and validation targets. © International Union of Crystallography 2012.",
                "authors": [
                    {
                        "name": "Joosten K."
                    },
                    {
                        "name": "Joosten R.P."
                    },
                    {
                        "name": "Murshudov G.N."
                    },
                    {
                        "name": "Perrakis A."
                    }
                ],
                "citationCount": 156,
                "date": "2012-04-01T00:00:00Z",
                "journal": "Acta Crystallographica Section D: Biological Crystallography",
                "title": "PDB-REDO: Constructive validation, more than just looking for errors"
            },
            "note": "Describes the decision making algorithms",
            "type": [
                "Method",
                "Primary"
            ]
        },
        {
            "doi": "10.1107/S2059798316013036",
            "metadata": {
                "abstract": "Many crystal structures in the Protein Data Bank contain zinc ions in a geometrically distorted tetrahedral complex with four Cys and/or His ligands. A method is presented to automatically validate and correct these zinc complexes. Analysis of the corrected zinc complexes shows that the average ZnCys distances and Cys-Zn-Cys angles are a function of the number of cysteines and histidines involved. The observed trends can be used to develop more contextsensitive targets for model validation and refinement.",
                "authors": [
                    {
                        "name": "Evers J.M.G."
                    },
                    {
                        "name": "Joosten R.P."
                    },
                    {
                        "name": "Touw W.G."
                    },
                    {
                        "name": "Van Beusekom B."
                    },
                    {
                        "name": "Vriend G."
                    }
                ],
                "citationCount": 19,
                "date": "2016-01-01T00:00:00Z",
                "journal": "Acta Crystallographica Section D: Structural Biology",
                "title": "Validation and correction of ZnCysxHisy complexes"
            },
            "note": "Algorithms for structural zinc site correction",
            "type": [
                "Method"
            ]
        },
        {
            "doi": "10.1107/S2059798319003875",
            "metadata": {
                "abstract": "© 2019, Wiley-Blackwell. All rights reserved.N-Glycosylation is one of the most common post-translational modifications and is implicated in, for example, protein folding and interaction with ligands and receptors. N-Glycosylation trees are complex structures of linked carbohydrate residues attached to asparagine residues. While carbohydrates are typically modeled in protein structures, they are often incomplete or have the wrong chemistry. Here, new tools are presented to automatically rebuild existing glycosylation trees, to extend them where possible, and to add new glycosylation trees if they are missing from the model. The method has been incorporated in the PDB-REDO pipeline and has been applied to build or rebuild 16 452 carbohydrate residues in 11 651 glycosylation trees in 4498 structure models, and is also available from the PDB-REDO web server. With better modeling of N-glycosylation, the biological function of this important modification can be better and more easily understood.",
                "authors": [
                    {
                        "name": "Emsley P."
                    },
                    {
                        "name": "Hekkelman M.L."
                    },
                    {
                        "name": "Joosten R.P."
                    },
                    {
                        "name": "Perrakis A."
                    },
                    {
                        "name": "Wezel N."
                    },
                    {
                        "name": "van Beusekom B."
                    }
                ],
                "citationCount": 10,
                "date": "2019-04-01T00:00:00Z",
                "journal": "Acta Crystallographica Section D: Structural Biology",
                "title": "Building and rebuilding N-glycans in protein structure models"
            },
            "note": "Algorithms for correction and completion of N-glycosylation sites",
            "type": [
                "Method"
            ]
        },
        {
            "doi": "10.1002/pro.3353",
            "metadata": {
                "abstract": "© 2017 The Protein SocietyThe Protein Data Bank (PDB) is the global archive for structural information on macromolecules, and a popular resource for researchers, teachers, and students, amassing more than one million unique users each year. Crystallographic structure models in the PDB (more than 100,000 entries) are optimized against the crystal diffraction data and geometrical restraints. This process of crystallographic refinement typically ignored hydrogen bond (H-bond) distances as a source of information. However, H-bond restraints can improve structures at low resolution where diffraction data are limited. To improve low-resolution structure refinement, we present methods for deriving H-bond information either globally from well-refined high-resolution structures from the PDB-REDO databank, or specifically from on-the-fly constructed sets of homologous high-resolution structures. Refinement incorporating HOmology DErived Restraints (HODER), improves geometrical quality and the fit to the diffraction data for many low-resolution structures. To make these improvements readily available to the general public, we applied our new algorithms to all crystallographic structures in the PDB: using massively parallel computing, we constructed a new instance of the PDB-REDO databank (https://pdb-redo.eu). This resource is useful for researchers to gain insight on individual structures, on specific protein families (as we demonstrate with examples), and on general features of protein structure using data mining approaches on a uniformly treated dataset.",
                "authors": [
                    {
                        "name": "Gilliland G.L."
                    },
                    {
                        "name": "Joosten R.P."
                    },
                    {
                        "name": "Luo J."
                    },
                    {
                        "name": "Perrakis A."
                    },
                    {
                        "name": "Rajagopal G."
                    },
                    {
                        "name": "Somani S."
                    },
                    {
                        "name": "Tatineni M."
                    },
                    {
                        "name": "Touw W.G."
                    },
                    {
                        "name": "van Beusekom B."
                    }
                ],
                "citationCount": 21,
                "date": "2018-03-01T00:00:00Z",
                "journal": "Protein Science",
                "title": "Homology-based hydrogen bond information improves crystallographic structures in the PDB"
            },
            "note": "Algorithms for homology restrains; new databank",
            "type": [
                "Method"
            ],
            "version": "7"
        },
        {
            "doi": "10.1107/S0021889809008784",
            "metadata": {
                "abstract": "Structural biology, homology modelling and rational drug design require accurate three-dimensional macromolecular coordinates. However, the coordinates in the Protein Data Bank (PDB) have not all been obtained using the latest experimental and computational methods. In this study a method is presented for automated re-refinement of existing structure models in the PDB. A large-scale benchmark with 16 807 PDB entries showed that they can be improved in terms of fit to the deposited experimental X-ray data as well as in terms of geometric quality. The re-refinement protocol uses TLS models to describe concerted atom movement. The resulting structure models are made available through the PDB-REDO databank (http://www.cmbi.ru.nl/pdb-redo/). Grid computing techniques were used to overcome the computational requirements of this endeavour. © 2009 International Union of Crystallography.",
                "authors": [
                    {
                        "name": "Berglund A.-C."
                    },
                    {
                        "name": "Blanchet C."
                    },
                    {
                        "name": "Bloch V."
                    },
                    {
                        "name": "Bongcam-Rudloff E."
                    },
                    {
                        "name": "Breton V."
                    },
                    {
                        "name": "Combet C."
                    },
                    {
                        "name": "Da Costa A.L."
                    },
                    {
                        "name": "Deleage G."
                    },
                    {
                        "name": "Diarena M."
                    },
                    {
                        "name": "Fabbretti R."
                    },
                    {
                        "name": "Fettahi G."
                    },
                    {
                        "name": "Flegel V."
                    },
                    {
                        "name": "Gisel A."
                    },
                    {
                        "name": "Joosten R.P."
                    },
                    {
                        "name": "Kasam V."
                    },
                    {
                        "name": "Kervinen T."
                    },
                    {
                        "name": "Korpelainen E."
                    },
                    {
                        "name": "Mattila K."
                    },
                    {
                        "name": "Pagni M."
                    },
                    {
                        "name": "Reichstadt M."
                    },
                    {
                        "name": "Salzemann J."
                    },
                    {
                        "name": "Stockinger H."
                    },
                    {
                        "name": "Tickle I.J."
                    },
                    {
                        "name": "Vriend G."
                    }
                ],
                "citationCount": 143,
                "date": "2009-01-01T00:00:00Z",
                "journal": "Journal of Applied Crystallography",
                "title": "PDB-REDO: Automated re-refinement of X-ray structure models in the PDB"
            },
            "note": "Initial paper on the databank",
            "type": [
                "Primary"
            ],
            "version": "1"
        },
        {
            "doi": "10.1107/S0907444908037591",
            "metadata": {
                "abstract": "The deposition of X-ray data along with the customary structural models defining PDB entries makes it possible to apply large-scale re-refinement protocols to these entries, thus giving users the benefit of improvements in X-ray methods that have occurred since the structure was deposited. Automated gradient refinement is an effective method to achieve this goal, but real-space intervention is most often required in order to adequately address problems detected by structure-validation software. In order to improve the existing protocol, automated re-refinement was combined with structure validation and difference-density peak analysis to produce a catalogue of problems in PDB entries that are amenable to automatic correction. It is shown that re-refinement can be effective in producing improvements, which are often associated with the systematic use of the TLS parameterization of B factors, even for relatively new and high-resolution PDB entries, while the accompanying manual or semi-manual map analysis and fitting steps show good prospects for eventual automation. It is proposed that the potential for simultaneous improvements in methods and in re-refinement results be further encouraged by broadening the scope of depositions to include refinement metadata and ultimately primary rather than reduced X-ray data.",
                "authors": [
                    {
                        "name": "Bricogne G."
                    },
                    {
                        "name": "Joosten R.P."
                    },
                    {
                        "name": "Vriend G."
                    },
                    {
                        "name": "Womack T."
                    }
                ],
                "citationCount": 61,
                "date": "2009-01-20T00:00:00Z",
                "journal": "Acta Crystallographica Section D: Biological Crystallography",
                "title": "Re-refinement from deposited X-ray data can deliver improved models for most PDB entries"
            },
            "type": [
                "Usage"
            ]
        },
        {
            "doi": "10.1107/S2052252518010552",
            "note": "Algorithms for protein model completion",
            "type": [
                "Method"
            ]
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Structure analysis",
            "uri": "http://edamontology.org/topic_0081"
        }
    ],
    "validated": 1
}
