{
    "accessibility": "Open access",
    "additionDate": "2022-11-03T20:02:09.128117Z",
    "biotoolsCURIE": "biotools:qcpa",
    "biotoolsID": "qcpa",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "kentsisresearchgroup@gmail.com",
            "name": "Alex Kentsis",
            "orcidid": "https://orcid.org/0000-0002-8063-9191"
        },
        {
            "name": "Paolo Cifani",
            "orcidid": "https://orcid.org/0000-0002-4403-1277"
        }
    ],
    "description": "The Quantitative Cell Proteomic Atlas is a comprehensive panel of targeted proteomic assays to profile activation of biochemical pathways in cancer cells.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene expression profiling",
                    "uri": "http://edamontology.org/operation_0314"
                },
                {
                    "term": "PTM site prediction",
                    "uri": "http://edamontology.org/operation_0417"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                }
            ]
        }
    ],
    "homepage": "https://qcpa.mskcc.org",
    "lastUpdate": "2022-11-03T20:02:09.130546Z",
    "name": "QCPA",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1021/ACS.JPROTEOME.2C00223",
            "metadata": {
                "abstract": "© 2022 American Chemical Society. All rights reserved.In spite of extensive studies of cellular signaling, many fundamental processes such as pathway integration, cross-talk, and feedback remain poorly understood. To enable integrated and quantitative measurements of cellular biochemical activities, we have developed the Quantitative Cell Proteomics Atlas (QCPA). QCPA consists of panels of targeted mass spectrometry assays to determine the abundance and stoichiometry of regulatory post-translational modifications of sentinel proteins from most known physiologic and pathogenic signaling pathways in human cells. QCPA currently profiles 1 »913 peptides from 469 effectors of cell surface signaling, apoptosis, stress response, gene expression, quiescence, and proliferation. For each protein, QCPA includes triplets of isotopically labeled peptides covering known post-translational regulatory sites to determine their stoichiometries and unmodified protein regions to measure total protein abundance. The QCPA framework incorporates analytes to control for technical variability of sample preparation and mass spectrometric analysis, including TrypQuant, a synthetic substrate for accurate quantification of proteolysis efficiency for proteins containing chemically modified residues. The ability to precisely and accurately quantify most known signaling pathways should enable improved chemoproteomic approaches for the comprehensive analysis of cell signaling and clinical proteomics of diagnostic specimens. QCPA is openly available at https://qcpa.mskcc.org.",
                "authors": [
                    {
                        "name": "Cifani P."
                    },
                    {
                        "name": "Kentsis A."
                    }
                ],
                "date": "2022-10-07T00:00:00Z",
                "journal": "Journal of Proteome Research",
                "title": "Quantitative Cell Proteomic Atlas: Pathway-Scale Targeted Mass Spectrometry for High-Resolution Functional Profiling of Cell Signaling"
            },
            "pmid": "36154077"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Protein modifications",
            "uri": "http://edamontology.org/topic_0601"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        }
    ],
    "validated": 1
}
