
{
    "credit": [
        {
            "email": "yudi.pawitan@ki.se",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://www.meb.ki.se/personal/yudpaw/"
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://fafner.meb.ki.se/personal/yudpaw/?page_id=13"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "R"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Applied mathematics",
                "uri": "http://edamontology.org/topic_3569"
            },
            {
                "term": "Microarray experiment",
                "uri": "http://edamontology.org/topic_3518"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://www.mybiosoftware.com/slr-0-1-9-performing-smoothed-logistic-regression-for-cgh-data.html"
        }
    ],
    "publication": [
        {
            "abstract": "Array comparative genomic hybridization (aCGH) provides a genome-wide information of DNA copy number that is potentially useful for disease classification. One immediate problem is that the data contain many features (probes) but only a few samples. Existing approaches to overcome this problem include features selection, ridge regression and partial least squares. However, these methods typically ignore the spatial characteristic of aCGH data. To explicitly make use of this spatial information we develop a procedure called smoothed logistic regression (SLR) model. The procedure is based on a mixed logistic regression model, where the random component is a mixture distribution that controls smoothness and sparseness. Conceptually such a procedure is straightforward, but its implementation is complicated due to computational problems. We develop a fast and reliable iterative weighted least-squares algorithm based on the singular value decomposition. Simulated data and two real data sets are used to illustrate the procedure. For real data sets, error rates are calculated using the leave-one-out cross validation procedure. For both simulated and real data examples, SLR achieves better misclassification error rates compared with previous methods. Copyright © 2009 John Wiley & Sons, Ltd.",
            "authors": [
                "Huang J.",
                "Salim A.",
                "Lei K.",
                "O'Sullivan K.",
                "Pawitan Y."
            ],
            "cit_count": 6,
            "journal": "Statistics in Medicine",
            "pmid": "19856275",
            "title": "Classification of array CGH data using smoothed logistic regression model",
            "year": "2009-12-30"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:slr",
        "biotoolsID": "slr",
        "description": "A software of fitting smoothed logistic regression with Cauchy-Normal Random Probes Effects with application to aCGH data.",
        "homepage": "http://fafner.meb.ki.se/personal/yudpaw/?page_id=13",
        "name": "SLR"
    }
}