{
    "additionDate": "2020-09-03T19:00:22Z",
    "biotoolsCURIE": "biotools:scop3p",
    "biotoolsID": "scop3p",
    "collectionID": [
        "BIG N2N",
        "VIB",
        "UGent"
    ],
    "description": "A Comprehensive Resource of Human Phosphosites within Their Full Context.\n\nSearch for the desired protein with Uniprot accession, protein name/keyword, ProteomeXchange ID or PDB id.\n\nZoom in and zoom out (both with mouse and buttons on the right top corner) to see modificationson the protein.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://genesis.ugent.be/uvpublicdata/Scop3p/Scop3P_manual.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "elixirNode": [
        "Belgium"
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "PTM identification",
                    "uri": "http://edamontology.org/operation_3645"
                }
            ]
        }
    ],
    "homepage": "https://iomics.ugent.be/scop3p",
    "lastUpdate": "2020-09-05T08:23:57Z",
    "license": "CC-BY-4.0",
    "link": [
        {
            "note": "scop3p.compomics@vib-ugent.be",
            "type": [
                "Helpdesk"
            ],
            "url": "https://iomics.ugent.be/scop3p/index"
        }
    ],
    "name": "Scop3P",
    "owner": "bits@vib.be",
    "publication": [
        {
            "doi": "10.1021/ACS.JPROTEOME.0C00306",
            "metadata": {
                "abstract": "Copyright © 2020 American Chemical Society.Protein phosphorylation is a key post-translational modification in many biological processes and is associated to human diseases such as cancer and metabolic disorders. The accurate identification, annotation, and functional analysis of phosphosites are therefore crucial to understand their various roles. Phosphosites are mainly analyzed through phosphoproteomics, which has led to increasing amounts of publicly available phosphoproteomics data. Several resources have been built around the resulting phosphosite information, but these are usually restricted to the protein sequence and basic site metadata. What is often missing from these resources, however, is context, including protein structure mapping, experimental provenance information, and biophysical predictions. We therefore developed Scop3P: A comprehensive database of human phosphosites within their full context. Scop3P integrates sequences (UniProtKB/Swiss-Prot), structures (PDB), and uniformly reprocessed phosphoproteomics data (PRIDE) to annotate all known human phosphosites. Furthermore, these sites are put into biophysical context by annotating each phosphoprotein with per-residue structural propensity, solvent accessibility, disordered probability, and early folding information. Scop3P, available at https://iomics.ugent.be/scop3p, presents a unique resource for visualization and analysis of phosphosites and for understanding of phosphosite structure-function relationships.",
                "authors": [
                    {
                        "name": "Ramasamy P."
                    },
                    {
                        "name": "Turan D."
                    },
                    {
                        "name": "Tichshenko N."
                    },
                    {
                        "name": "Hulstaert N."
                    },
                    {
                        "name": "Vandermarliere E."
                    },
                    {
                        "name": "Vranken W."
                    },
                    {
                        "name": "Martens L."
                    }
                ],
                "date": "2020-08-07T00:00:00Z",
                "journal": "Journal of Proteome Research",
                "title": "Scop3P: A Comprehensive Resource of Human Phosphosites within Their Full Context"
            },
            "pmid": "32508104"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Protein modifications",
            "uri": "http://edamontology.org/topic_0601"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        }
    ]
}