
{
    "credit": [
        {
            "name": "BioCatalogue",
            "typeEntity": "Project",
            "typeRoles": [
                "Documentor"
            ],
            "url": "https://www.biocatalogue.org"
        },
        {
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://www.dkfz.de/en/kontakt.php"
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://genius.embnet.dkfz-heidelberg.de/menu/hobit/embdoc/needle.html"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence analysis",
                    "uri": "http://edamontology.org/operation_2403"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web service"
        ],
        "topic": [
            {
                "term": "Sequence analysis",
                "uri": "http://edamontology.org/topic_0080"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "https://www.biocatalogue.org/services/3650"
        }
    ],
    "publication": [
        {
            "abstract": "A computer adaptable method for finding similarities in the amino acid sequences of two proteins has been developed. From these findings it is possible to determine whether significant homology exists between the proteins. This information is used to trace their possible evolutionary development. The maximum match is a number dependent upon the similarity of the sequences. One of its definitions is the largest number of amino acids of one protein that can be matched with those of a second protein allowing for all possible interruptions in either of the sequences. While the interruptions give rise to a very large number of comparisons, the method efficiently excludes from consideration those comparisons that cannot contribute to the maximum match. Comparisons are made from the smallest unit of significance, a pair of amino acids, one from each protein. All possible pairs are represented by a two-dimensional array, and all possible comparisons are represented by pathways through the array. For this maximum match only certain of the possible pathways must be evaluated. A numerical value, one in this case, is assigned to every cell in the array representing like amino acids. The maximum match is the largest number that would result from summing the cell values of every pathway. © 1970.",
            "authors": [
                "Needleman S.B.",
                "Wunsch C.D."
            ],
            "cit_count": 6396,
            "doi": "10.1016/0022-2836(70)90057-4",
            "journal": "Journal of Molecular Biology",
            "title": "A general method applicable to the search for similarities in the amino acid sequence of two proteins",
            "type": "Other",
            "year": "1970-03-28"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:needle_ws_husar",
        "biotoolsID": "needle_ws_husar",
        "description": "This program uses the Needleman-Wunsch global alignment algorithm to find the optimum alignment (including gaps) of two sequences when considering their entire length.",
        "homepage": "http://genius.embnet.dkfz-heidelberg.de/menu/hobit/embdoc/needle.html",
        "name": "needle WS (husar)",
        "version": [
            "1"
        ]
    }
}