{
    "additionDate": "2017-08-03T18:55:38Z",
    "biotoolsCURIE": "biotools:phenoman",
    "biotoolsID": "phenoman",
    "credit": [
        {
            "email": "sleal@bcm.edu",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Freeware that provides approaches for efficient exploration and management of phenotype data.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://storage.googleapis.com/google-code-archive-downloads/v2/code.google.com/phenoman/doc_phenoman.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Statistical calculation",
                    "uri": "http://edamontology.org/operation_2238"
                },
                {
                    "term": "Validation",
                    "uri": "http://edamontology.org/operation_2428"
                }
            ]
        }
    ],
    "homepage": "https://code.google.com/p/phenoman/",
    "language": [
        "Python",
        "R"
    ],
    "lastUpdate": "2024-11-24T20:36:54.133767Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/phenoman-1-0rc-exploration-and-management-of-phenotype-data.html"
        }
    ],
    "name": "PhenoMan",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "otherID": [
        {
            "type": "rrid",
            "value": "RRID: SCR_005249"
        }
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btt682",
            "metadata": {
                "abstract": "Motivation:Next-generation sequencing and other high-throughput technology advances have promoted great interest in detecting associations between complex traits and genetic variants. Phenotype selection, quality control (QC) and control of confounders are crucial and can have a great impact on the ability to detect associations. Although there are programs to perform association analyses, e.g. PLINK and GenABEL, they cannot be used for comprehensive management and QC of phenotype data. To address this need PhenoMan was developed: to select individuals based on multiple phenotype criteria or population membership; control for missing covariate data; remove related individuals, duplicate samples and individuals with incorrect sex specification; recode primary traits and covariates; transform data; remove or winsorize outliers; select covariates for analysis; and create residuals. To ensure consistency and harmonization between analyses, a report is generated for every dataset. Summary statistics are also provided in graphical or text format. PhenoMan can be used for selection and manipulation of quantitative, disease and control data.Summary:Phenoman is freeware that provides approaches for efficient exploration and management of phenotype data. Proper QC of phenotypes before proceeding to the association analysis is critical to ensure control of type I and II errors, reliable effect estimates and consistent results between studies. PhenoMan is highly beneficial for the preparation of qualitative and quantitative trait data for association studies using new datasets as well as those obtained from public repositories. © 2013 The Author 2013.",
                "authors": [
                    {
                        "name": "Leal S.M."
                    },
                    {
                        "name": "Li B."
                    },
                    {
                        "name": "Wang G."
                    }
                ],
                "citationCount": 2,
                "date": "2014-02-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "PhenoMan: Phenotypic data exploration, selection, management and quality control for association studies of rare and common variants"
            },
            "pmcid": "PMC3904519",
            "pmid": "24336645"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        }
    ],
    "validated": 1
}
