{
    "additionDate": "2017-08-03T18:50:33Z",
    "biotoolsCURIE": "biotools:maggottracker",
    "biotoolsID": "maggottracker",
    "credit": [
        {
            "email": "mag@wormloco.org",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Single-animal tracking system for Drosophila larval locomotion analysis.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://wormloco.org/mag/doc/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Analysis",
                    "uri": "http://edamontology.org/operation_2945"
                }
            ]
        }
    ],
    "homepage": "http://wormloco.org/mag/doc/",
    "language": [
        "Java"
    ],
    "lastUpdate": "2018-12-10T12:58:50Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/maggottracker-analysis-of-fly-larval-locomotion.html"
        }
    ],
    "name": "MaggotTracker",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "© 2015 Aleman-Meza et al.; licensee BioMed Central. Background: Drosophila larvae have been used as a model to study to genetic and cellular circuitries modulating behaviors. One of the challenges in behavioral study is the quantification of complex phenotypes such as locomotive behaviors. Experimental capability can be greatly enhanced by an automatic single-animal tracker that records an animal at a high resolution for an extended period, and analyzes multiple behavioral parameters. Results: Here we present MaggotTracker, a single-animal tracking system for Drosophila larval locomotion analysis. This system controls the motorized microscope stage while taking a video, so that the animal remains in the viewing center. It then reduces the animal to 13 evenly distributed points along the midline, and computes over 20 parameters evaluating the shape, peristalsis movement, stamina, and track of the animal. To demonstrate its utility, we applied MaggotTracker to analyze both wild-type and mutant animals to identify factors affecting locomotive behaviors. Each animal was tracked for four minutes. Our analysis on Canton-S third-instar larvae revealed that the distance an animal travelled was correlated to its striding speed rather than the percentage of time the animal spent striding, and that the striding speed was correlated to both the distance and the duration of one stride. Sexual dimorphism was observed in body length but not in locomotive parameters such as speed. Locomotive parameters were affected by animal developmental stage and the crawling surface. No significant changes in movement speed were detected in mutants of circadian genes such as period (per), timeout, and timeless (tim). The MaggotTracker analysis showed that ether a go-go (eag), Shaker (Sh), slowpoke (slo), and dunce (dnc) mutant larvae had severe phenotypes in multiple locomotive parameters such as stride distance and speed, consistent with their function in neuromuscular junctions. Further, the phenotypic patterns of the K+ channel genes eag, Sh and slo are highly similar. Conclusions: These results showed that MaggotTracker is an efficient tool for automatic phenotyping. The MaggotTracker software as well as the data presented here can be downloaded from our open-access site www.WormLoco.org/Mag.",
                "authors": [
                    {
                        "name": "Aleman-Meza B."
                    },
                    {
                        "name": "Jung S.-K."
                    },
                    {
                        "name": "Zhong W."
                    }
                ],
                "citationCount": 4,
                "date": "2015-01-01T00:00:00Z",
                "journal": "BMC Developmental Biology",
                "title": "An automated system for quantitative analysis of Drosophila larval locomotion"
            },
            "pmid": "25881248"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Biology",
            "uri": "http://edamontology.org/topic_3070"
        }
    ],
    "validated": 1
}