{
    "accessibility": [
        "Open access"
    ],
    "additionDate": "2015-12-02T15:00:38Z",
    "biotoolsCURIE": "biotools:dolce",
    "biotoolsID": "dolce",
    "collectionID": [
        "Czech Republic",
        "ELIXIR-CZ"
    ],
    "confidence_flag": null,
    "cost": "Free of charge",
    "credit": [
        {
            "email": null,
            "gridid": null,
            "name": "ELIXIR-CZ",
            "note": null,
            "orcidid": null,
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ],
            "url": null
        },
        {
            "email": "daniel.svozil@vscht.cz",
            "gridid": null,
            "name": "Daniel Svozil",
            "note": null,
            "orcidid": null,
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://ich.vscht.cz/~svozil/"
        },
        {
            "email": "petr.cech@vscht.cz",
            "gridid": null,
            "name": "Petr Cech",
            "note": null,
            "orcidid": null,
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": null
        },
        {
            "email": "filip.lankas@vscht.cz",
            "gridid": null,
            "name": "Filip Lankaš",
            "note": null,
            "orcidid": null,
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": null
        },
        {
            "email": "bohdan.schneider@ibt.cas.cz",
            "gridid": null,
            "name": "Bohdan Schneider",
            "note": null,
            "orcidid": null,
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": null
        },
        {
            "email": "jiri.cerny@ibt.cas.cz",
            "gridid": null,
            "name": "Jiří Černý",
            "note": null,
            "orcidid": null,
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": null
        }
    ],
    "description": "Database of local biomolecular conformers, stores DNA structural data including the information about DNA local spatial arrangement.",
    "documentation": [
        {
            "note": null,
            "type": "General",
            "url": "http://dolbico.org/help"
        }
    ],
    "download": [],
    "editPermission": {
        "authors": [],
        "type": "private"
    },
    "elixirNode": [
        "Czech Republic"
    ],
    "elixirPlatform": [
        "Data"
    ],
    "elixir_badge": 0,
    "function": [
        {
            "cmd": null,
            "input": [
                {
                    "data": {
                        "term": "Structure ID",
                        "uri": "http://edamontology.org/data_1070"
                    },
                    "format": [
                        {
                            "term": "PDB database entry format",
                            "uri": "http://edamontology.org/format_1475"
                        }
                    ]
                }
            ],
            "note": null,
            "operation": [
                {
                    "term": "Sequence feature detection",
                    "uri": "http://edamontology.org/operation_0253"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Nucleic acid structure report",
                        "uri": "http://edamontology.org/data_3128"
                    },
                    "format": [
                        {
                            "term": "HTML",
                            "uri": "http://edamontology.org/format_2331"
                        }
                    ]
                }
            ]
        }
    ],
    "homepage": "http://dolbico.org/",
    "homepage_status": 0,
    "language": [],
    "lastUpdate": "2019-11-12T10:30:29Z",
    "license": null,
    "link": [],
    "maturity": "Mature",
    "name": "Dolbico",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "otherID": [],
    "owner": "ELIXIR-CZ",
    "publication": [
        {
            "doi": "10.1186/1471-2105-14-205",
            "metadata": {
                "abstract": "Background: A growing number of crystal and NMR structures reveals a considerable structural polymorphism of DNA architecture going well beyond the usual image of a double helical molecule. DNA is highly variable with dinucleotide steps exhibiting a substantial flexibility in a sequence-dependent manner. An analysis of the conformational space of the DNA backbone and the enhancement of our understanding of the conformational dependencies in DNA are therefore important for full comprehension of DNA structural polymorphism.Results: A detailed classification of local DNA conformations based on the technique of Fourier averaging was published in our previous work. However, this procedure requires a considerable amount of manual work. To overcome this limitation we developed an automatic classification method consisting of the combination of supervised and unsupervised approaches. A proposed workflow is composed of k-NN method followed by a non-hierarchical single-pass clustering algorithm. We applied this workflow to analyze 816 X-ray and 664 NMR DNA structures released till February 2013. We identified and annotated six new conformers, and we assigned four of these conformers to two structurally important DNA families: guanine quadruplexes and Holliday (four-way) junctions. We also compared populations of the assigned conformers in the dataset of X-ray and NMR structures.Conclusions: In the present work we developed a machine learning workflow for the automatic classification of dinucleotide conformations. Dinucleotides with unassigned conformations can be either classified into one of already known 24 classes or they can be flagged as unclassifiable. The proposed machine learning workflow permits identification of new classes among so far unclassifiable data, and we identified and annotated six new conformations in the X-ray structures released since our previous analysis. The results illustrate the utility of machine learning approaches in the classification of local DNA conformations. © 2013 Čech et al.; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Cech P."
                    },
                    {
                        "name": "Kukal J."
                    },
                    {
                        "name": "Cerny J."
                    },
                    {
                        "name": "Schneider B."
                    },
                    {
                        "name": "Svozil D."
                    }
                ],
                "citationCount": 12,
                "date": "2013-06-25T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Automatic workflow for the classification of local DNA conformations"
            },
            "note": null,
            "pmcid": null,
            "pmid": null,
            "type": "Primary",
            "version": null
        },
        {
            "doi": "10.1093/nar/gkn260",
            "metadata": {
                "abstract": "The geometry of the phosphodiester backbone was analyzed for 7739 dinucleotides from 447 selected crystal structures of naked and complexed DNA. Ten torsion angles of a near-dinucleotide unit have been studied by combining Fourier averaging and clustering. Besides the known variants of the A-, B- and Z-DNA forms, we have also identified combined A + B backbone-deformed conformers, e.g. with α/γ switches, and a few conformers with a syn orientation of bases occurring e.g. in G-quadruplex structures. A plethora of A- and B-like conformers show a close relationship between the A- and B-form double helices. A comparison of the populations of the conformers occurring in naked and complexed DNA has revealed a significant broadening of the DNA conformational space in the complexes, but the conformers still remain within the limits defined by the A- and B- forms. Possible sequence preferences, important for sequence-dependent recognition, have been assessed for the main A and B conformers by means of statistical goodness-of-fit tests. The structural properties of the backbone in quadruplexes, junctions and histone-core particles are discussed in further detail. © 2008 The Author(s).",
                "authors": [
                    {
                        "name": "Svozil D."
                    },
                    {
                        "name": "Kalina J."
                    },
                    {
                        "name": "Omelka M."
                    },
                    {
                        "name": "Schneider B."
                    }
                ],
                "citationCount": 117,
                "date": "2008-06-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "DNA conformations and their sequence preferences"
            },
            "note": null,
            "pmcid": null,
            "pmid": null,
            "type": "Benchmarking study",
            "version": null
        },
        {
            "doi": "10.1093/nar/gkt1273",
            "metadata": {
                "abstract": "To investigate the principles driving recognition between proteins and DNA, we analyzed more than thousand crystal structures of protein/DNA complexes. We classified protein and DNA conformations by structural alphabets, protein blocks [de Brevern, Etchebest and Hazout (2000) (Bayesian probabilistic approach for predicting backbone structures in terms of protein blocks. Prots. Struct. Funct. Genet., 41:271-287)] and dinucleotide conformers [Svozil, Kalina, Omelka and Schneider (2008) (DNA conformations and their sequence preferences. Nucleic Acids Res., 36:3690-3706)], respectively. Assembling the mutually interacting protein blocks and dinucleotide conformers into 'interaction matrices' revealed their correlations and conformer preferences at the interface relative to their occurrence outside the interface. The analyzed data demonstrated important differences between complexes of various types of proteins such as transcription factors and nucleases, distinct interaction patterns for the DNA minor groove relative to the major groove and phosphate and importance of water-mediated contacts. Water molecules mediate proportionally the largest number of contacts in the minor groove and form the largest proportion of contacts in complexes of transcription factors. The generally known induction of A-DNA forms by complexation was more accurately attributed to A-like and intermediate A/B conformers rare in naked DNA molecules. © The Author(s) 2013.",
                "authors": [
                    {
                        "name": "Schneider B."
                    },
                    {
                        "name": "Cerny J."
                    },
                    {
                        "name": "Svozil D."
                    },
                    {
                        "name": "Cech P."
                    },
                    {
                        "name": "Gelly J.-C."
                    },
                    {
                        "name": "De Brevern A.G."
                    }
                ],
                "citationCount": 17,
                "date": "2014-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "Bioinformatic analysis of the protein/DNA interface"
            },
            "note": null,
            "pmcid": null,
            "pmid": null,
            "type": "Primary",
            "version": null
        }
    ],
    "relation": [],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Structural biology",
            "uri": "http://edamontology.org/topic_1317"
        }
    ],
    "validated": 0,
    "version": [
        "2"
    ]
}