{
    "accessibility": "Open access",
    "additionDate": "2022-01-28T15:48:43.090149Z",
    "biotoolsCURIE": "biotools:biopyc",
    "biotoolsID": "biopyc",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "aurelien.appriou@flit-sport.fr",
            "name": "Aurélien Appriou",
            "orcidid": "https://orcid.org/0000-0002-0272-3726",
            "typeEntity": "Person"
        }
    ],
    "description": "An open-source and easy-to-use Python platform for offline neurophysiological signals processing and classification.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://gitlab.inria.fr/biopyc/BioPyC/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-01-28T15:48:43.092810Z",
    "license": "Not licensed",
    "name": "BioPyC",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.3390/S21175740",
            "metadata": {
                "abstract": "© 2021 by the authors. Licensee MDPI, Basel, Switzerland.Research on brain–computer interfaces (BCIs) has become more democratic in recent decades, and experiments using electroencephalography (EEG)-based BCIs has dramatically increased. The variety of protocol designs and the growing interest in physiological computing require parallel improvements in processing and classification of both EEG signals and bio signals, such as electrodermal activity (EDA), heart rate (HR) or breathing. If some EEG-based analysis tools are already available for online BCIs with a number of online BCI platforms (e.g., BCI2000 or OpenViBE), it remains crucial to perform offline analyses in order to design, select, tune, validate and test algorithms before using them online. Moreover, studying and comparing those algorithms usually requires expertise in programming, signal processing and machine learning, whereas numerous BCI researchers come from other backgrounds with limited or no training in such skills. Finally, existing BCI toolboxes are focused on EEG and other brain signals but usually do not include processing tools for other bio signals. Therefore, in this paper, we describe BioPyC, a free, open-source and easy-to-use Python platform for offline EEG and biosignal processing and classification. Based on an intuitive and well-guided graphical interface, four main modules allow the user to follow the standard steps of the BCI process without any programming skills: (1) reading different neurophysiological signal data formats, (2) filtering and representing EEG and bio signals, (3) classifying them, and (4) visualizing and performing statistical tests on the results. We illustrate BioPyC use on four studies, namely classifying mental tasks, the cognitive workload, emotions and attention states from EEG signals.",
                "authors": [
                    {
                        "name": "Appriou A."
                    },
                    {
                        "name": "Pillette L."
                    },
                    {
                        "name": "Trocellier D."
                    },
                    {
                        "name": "Dutartre D."
                    },
                    {
                        "name": "Cichocki A."
                    },
                    {
                        "name": "Lotte F."
                    }
                ],
                "date": "2021-09-01T00:00:00Z",
                "journal": "Sensors",
                "title": "BioPyC, an open-source python toolbox for offline electroencephalographic and physiological signals classification"
            },
            "pmcid": "PMC8433891",
            "pmid": "34502629"
        }
    ],
    "toolType": [
        "Suite",
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Neurobiology",
            "uri": "http://edamontology.org/topic_3304"
        },
        {
            "term": "Physiology",
            "uri": "http://edamontology.org/topic_3300"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "Zoology",
            "uri": "http://edamontology.org/topic_3500"
        }
    ]
}