{
    "additionDate": "2017-08-03T19:07:43Z",
    "biotoolsCURIE": "biotools:prnam-pc",
    "biotoolsID": "prnam-pc",
    "credit": [
        {
            "email": "jdzxiaoxuan@163.com",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.jci-bioinfo.cn/"
        }
    ],
    "description": "Predict the dentify the N6-methyladenosine (m6A).",
    "documentation": [
        {
            "type": "General",
            "url": "http://www.jci-bioinfo.cn/pRNAm-PC/pRNAm_readme.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Nucleic acid feature detection",
                    "uri": "http://edamontology.org/operation_0415"
                }
            ]
        }
    ],
    "homepage": "http://www.jci-bioinfo.cn/pRNAm-PC",
    "lastUpdate": "2018-12-10T12:58:43Z",
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/prnam-pc-predicting-n6-methyladenosine-sites-in-rna-sequences.html"
        }
    ],
    "name": "pRNAm-PC",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "© 2015 Elsevier Inc. All rights reserved.Just like PTM or PTLM (post-translational modification) in proteins, PTCM (post-transcriptional modification) in RNA plays very important roles in biological processes. Occurring at adenine (A) with the genetic code motif (GAC), N6-methyldenosine (m6A) is one of the most common and abundant PTCMs in RNA found in viruses and most eukaryotes. Given an uncharacterized RNA sequence containing many GAC motifs, which of them can be methylated, and which cannot? It is important for both basic research and drug development to address this problem. Particularly with the avalanche of RNA sequences generated in the postgenomic age, it is highly demanded to develop computational methods for timely identifying the N6-methyldenosine sites in RNA. Here we propose a new predictor called pRNAm-PC, in which RNA sequence samples are expressed by a novel mode of pseudo dinucleotide composition (PseDNC) whose components were derived from a physical-chemical matrix via a series of auto-covariance and cross covariance transformations. It was observed via a rigorous jackknife test that, in comparison with the existing predictor for the same purpose, pRNAm-PC achieved remarkably higher success rates in both overall accuracy and stability, indicating that the new predictor will become a useful high-throughput tool for identifying methylation sites in RNA, and that the novel approach can also be used to study many other RNA-related problems and conduct genome analysis. A user-friendly Web server for pRNAm-PC has been established at http://www.jci-bioinfo.cn/pRNAm-PC, by which users can easily get their desired results without needing to go through the mathematical details.",
                "authors": [
                    {
                        "name": "Liu Z."
                    },
                    {
                        "name": "Xiao X."
                    },
                    {
                        "name": "Yu D.-J."
                    },
                    {
                        "name": "Jia J."
                    },
                    {
                        "name": "Qiu W.-R."
                    },
                    {
                        "name": "Chou K.-C."
                    }
                ],
                "citationCount": 150,
                "date": "2016-03-15T00:00:00Z",
                "journal": "Analytical Biochemistry",
                "title": "pRNAm-PC: Predicting N6-methyladenosine sites in RNA sequences via physical-chemical properties"
            },
            "pmid": "26748145"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        },
        {
            "term": "Nucleic acid sites, features and motifs",
            "uri": "http://edamontology.org/topic_3511"
        }
    ],
    "validated": 1
}