{
    "additionDate": "2021-06-14T13:32:10Z",
    "biotoolsCURIE": "biotools:coronavirus-network-explorer",
    "biotoolsID": "coronavirus-network-explorer",
    "collectionID": [
        "COVID-19"
    ],
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "andreas.kramer@qiagen.com",
            "name": "Andreas Krämer",
            "orcidid": "https://orcid.org/0000-0003-1352-7242",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Coronavirus Network Explorer is an exploratory tool to connect SARS-CoV-2 viral proteins to selected biological processes, diseases, and pathways. It is a tool for mining a large-scale knowledge graph for effects of SARS-CoV-2 on host cell function.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Network visualisation",
                    "uri": "http://edamontology.org/operation_3925"
                },
                {
                    "term": "Protein interaction network prediction",
                    "uri": "http://edamontology.org/operation_3094"
                },
                {
                    "term": "Pathway analysis",
                    "uri": "http://edamontology.org/operation_3928"
                }
            ]
        }
    ],
    "homepage": "https://digitalinsights.qiagen.com/coronavirus-network-explorer",
    "lastUpdate": "2021-08-23T18:01:03Z",
    "name": "Coronavirus Network Explorer",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1186/S12859-021-04148-X",
            "metadata": {
                "abstract": "© 2021, The Author(s).Background: Leveraging previously identified viral interactions with human host proteins, we apply a machine learning-based approach to connect SARS-CoV-2 viral proteins to relevant host biological functions, diseases, and pathways in a large-scale knowledge graph derived from the biomedical literature. Our goal is to explore how SARS-CoV-2 could interfere with various host cell functions, and to identify drug targets amongst the host genes that could potentially be modulated against COVID-19 by repurposing existing drugs. The machine learning model employed here involves gene embeddings that leverage causal gene expression signatures curated from literature. In contrast to other network-based approaches for drug repurposing, our approach explicitly takes the direction of effects into account, distinguishing between activation and inhibition. Results: We have constructed 70 networks connecting SARS-CoV-2 viral proteins to various biological functions, diseases, and pathways reflecting viral biology, clinical observations, and co-morbidities in the context of COVID-19. Results are presented in the form of interactive network visualizations through a web interface, the Coronavirus Network Explorer (CNE), that allows exploration of underlying experimental evidence. We find that existing drugs targeting genes in those networks are strongly enriched in the set of drugs that are already in clinical trials against COVID-19. Conclusions: The approach presented here can identify biologically plausible hypotheses for COVID-19 pathogenesis, explicitly connected to the immunological, virological and pathological observations seen in SARS-CoV-2 infected patients. The discovery of repurposable drugs is driven by prior knowledge of relevant functional endpoints that reflect known viral biology or clinical observations, therefore suggesting potential mechanisms of action. We believe that the CNE offers relevant insights that go beyond more conventional network approaches, and can be a valuable tool for drug repurposing. The CNE is available at https://digitalinsights.qiagen.com/coronavirus-network-explorer.",
                "authors": [
                    {
                        "name": "Kramer A."
                    },
                    {
                        "name": "Billaud J.-N."
                    },
                    {
                        "name": "Tugendreich S."
                    },
                    {
                        "name": "Shiffman D."
                    },
                    {
                        "name": "Jones M."
                    },
                    {
                        "name": "Green J."
                    }
                ],
                "citationCount": 1,
                "date": "2021-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "The Coronavirus Network Explorer: mining a large-scale knowledge graph for effects of SARS-CoV-2 on host cell function"
            },
            "pmcid": "PMC8091149",
            "pmid": "33941085",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Virology",
            "uri": "http://edamontology.org/topic_0781"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Preclinical and clinical studies",
            "uri": "http://edamontology.org/topic_3379"
        }
    ]
}