{
    "name": "MI-Sim", 
    "description": "Mathematical analysis software specifically for use with mechanistically described microbial interactions described in terms of reactions, substrates/reactants and products. It provides a user-friendly environment in which microbiologists, microbial ecologists and biological mathematicians can rapidly and robustly characterize the dynamics of ecological motifs of up to three microbial species, without the requirement to develop their own code, programme models or rely on a detailed knowledge of the mathematics of dynamical systems analysis.", 
    "homepage": "https://uk.mathworks.com/matlabcentral/fileexchange/55492-mi-sim-mi-sim-final", 
    "biotoolsID": "mi-sim", 
    "biotoolsCURIE": "biotools:mi-sim", 
    "version": [], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_3562", 
                    "term": "Network simulation"
                }, 
                {
                    "uri": "http://edamontology.org/operation_2426", 
                    "term": "Modelling and simulation"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Plug-in"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_3697", 
            "term": "Microbial ecology"
        }, 
        {
            "uri": "http://edamontology.org/topic_3524", 
            "term": "Simulation experiment"
        }
    ], 
    "operatingSystem": [
        "Linux", 
        "Windows", 
        "Mac"
    ], 
    "language": [
        "MATLAB"
    ], 
    "license": null, 
    "collectionID": [], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [], 
    "download": [], 
    "documentation": [
        {
            "url": "http://mi-sim.github.io//", 
            "type": "General", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": "10.1371/journal.pone.0173249", 
            "pmid": null, 
            "pmcid": null, 
            "type": "Primary", 
            "version": null, 
            "metadata": {
                "title": "MI-Sim: A MATLAB package for the numerical analysis of microbial ecological interactions", 
                "abstract": "© 2017 Wade et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited. Food-webs and other classes of ecological network motifs, are a means of describing feeding relationships between consumers and producers in an ecosystem. They have application across scales where they differ only in the underlying characteristics of the organisms and substrates describing the system. Mathematical modelling, using mechanistic approaches to describe the dynamic behaviour and properties of the system through sets of ordinary differential equations, has been used extensively in ecology. Models allow simulation of the dynamics of the various motifs and their numerical analysis provides a greater understanding of the interplay between the system components and their intrinsic properties. We have developed the MI-Sim software for use with MATLAB to allow a rigorous and rapid numerical analysis of several common ecological motifs. MI-Sim contains a series of the most commonly used motifs such as cooperation, competition and predation. It does not require detailed knowledge of mathematical analytical techniques and is offered as a single graphical user interface containing all input and output options. The tools available in the current version of MI-Sim include model simulation, steady-state existence and stability analysis, and basin of attraction analysis. The software includes seven ecological interaction motifs and seven growth function models. Unlike other system analysis tools, MI-Sim is designed as a simple and user-friendly tool specific to ecological population type models, allowing for rapid assessment of their dynamical and behavioural properties.", 
                "date": "2017-03-01T00:00:00Z", 
                "citationCount": 2, 
                "authors": [
                    {
                        "name": "Wade M.J."
                    }, 
                    {
                        "name": "Oakley J."
                    }, 
                    {
                        "name": "Harbisher S."
                    }, 
                    {
                        "name": "Parker N.G."
                    }, 
                    {
                        "name": "Dolfing J."
                    }
                ], 
                "journal": "PLoS ONE"
            }
        }
    ], 
    "credit": [
        {
            "name": "Matthew J. Wade", 
            "email": "matthew.wade@ncl.ac.uk", 
            "url": null, 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "migle_sur", 
    "additionDate": "2018-06-04T19:38:02Z", 
    "lastUpdate": "2018-12-10T12:58:59Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 1, 
    "homepage_status": 0, 
    "elixir_badge": 0
}