
{
    "credit": [
        {
            "email": "gusfield@cs.ucdavis.edu",
            "name": "Dan Gusfield",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://csiflabs.cs.ucdavis.edu/~gusfield/"
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://csiflabs.cs.ucdavis.edu/~gusfield/lpph.html"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Haplotype mapping",
                    "uri": "http://edamontology.org/operation_0487"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "C++"
        ],
        "operatingSystem": [
            "Linux",
            "Windows"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Phylogeny",
                "uri": "http://edamontology.org/topic_0084"
            },
            {
                "term": "Genetics",
                "uri": "http://edamontology.org/topic_3053"
            },
            {
                "term": "Genotype and phenotype",
                "uri": "http://edamontology.org/topic_0625"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://www.mybiosoftware.com/lpph-perfect-phylogeny-haplotyping.html"
        }
    ],
    "publication": [
        {
            "abstract": "Since the introduction of the Perfect Phylogeny Haplotyping (PPH) Problem in RECOMB 2002 (Gusfield, 2002), the problem of finding a linear-time (deterministic, worst-case) solution for it has remained open, despite broad interest in the PPH problem and a series of papers on various aspects of it. In this paper, we solve the open problem, giving a practical, deterministic linear-time algorithm based on a simple data structure and simple operations on it. The method is straightforward to program and has been fully implemented. Simulations show that it is much faster in practice than prior nonlinear methods. The value of a linear-time solution to the PPH problem is partly conceptual and partly for use in the inner loop of algorithms for more complex problems, where the PPH problem must be solved repeatedly. © Mary Ann Liebert, Inc.",
            "authors": [
                "Ding Z.",
                "Filkov V.",
                "Gusfield D."
            ],
            "cit_count": 33,
            "journal": "Journal of Computational Biology",
            "pmid": "16597255",
            "title": "A linear-time algorithm for the Perfect Phylogeny Haplotyping (PPH) Problem",
            "year": "2006-03-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:lpph",
        "biotoolsID": "lpph",
        "description": "Linear-time program for inferring haplotypes from genotypes to determine if there are resulting haplotypes that fit a tree model.In more population genetic terms, LPPH determines whether a set of SNP genotypes can be explained by haplotype pairs that could have evolved on a coalescent under the no-recombination, infinite sites model. Hence it determines for SNP genotype data what the three or four gametes test (depending on whether the tree is rooted or not) determines for haplotype data.",
        "homepage": "http://csiflabs.cs.ucdavis.edu/~gusfield/lpph.html",
        "name": "LPPH"
    }
}