{
    "additionDate": "2022-09-28T11:33:14.691660Z",
    "biotoolsCURIE": "biotools:antimpmod",
    "biotoolsID": "antimpmod",
    "credit": [
        {
            "name": "Gajendra P.S. Raghava",
            "url": "https://webs.iiitd.edu.in/raghava/antimpmod/index.html"
        }
    ],
    "description": "AntiMPmod is an in silico method, which is developed to predict efficient modified antimicrobial peptides (ModAMP).",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://webs.iiitd.edu.in/raghava/antimpmod/index.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein function prediction",
                    "uri": "http://edamontology.org/operation_1777"
                }
            ]
        }
    ],
    "homepage": "https://webs.iiitd.edu.in/raghava/antimpmod/index.html",
    "lastUpdate": "2024-11-24T15:34:37.562557Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "https://webs.iiitd.edu.in/raghava/antimpmod/index.html"
        }
    ],
    "name": "antimpmod",
    "owner": "raghavagps",
    "publication": [
        {
            "doi": "10.3389/fmicb.2018.02551",
            "metadata": {
                "abstract": "Designing novel antimicrobial peptides is a hot area of research in the field of therapeutics especially after the emergence of resistant strains against the conventional antibiotics. In the past number of in silico methods have been developed for predicting the antimicrobial property of the peptide containing natural residues. This study describes models developed for predicting the antimicrobial property of a chemically modified peptide. Our models have been trained, tested and evaluated on a dataset that contains 948 antimicrobial and 931 non-antimicrobial peptides, containing chemically modified and natural residues. Firstly, the tertiary structure of all peptides has been predicted using software PEPstrMOD. Structure analysis indicates that certain type of modifications enhance the antimicrobial property of peptides. Secondly, a wide range of features was computed from the structure of these peptides using software PaDEL. Finally, models were developed for predicting the antimicrobial potential of chemically modified peptides using a wide range of structural features of these peptides. Our best model based on support vector machine achieve maximum MCC of 0.84 with an accuracy of 91.62% on training dataset and MCC of 0.80 with an accuracy of 89.89% on validation dataset. To assist the scientific community, we have developed a web server called \"AntiMPmod\" which predicts the antimicrobial property of the chemically modified peptide.",
                "authors": [
                    {
                        "name": "Agrawal P."
                    },
                    {
                        "name": "Raghava G.P.S."
                    }
                ],
                "citationCount": 37,
                "date": "2018-10-26T00:00:00Z",
                "journal": "Frontiers in Microbiology",
                "title": "Prediction of antimicrobial potential of a chemically modified peptide from its tertiary structure"
            },
            "pmcid": "PMC6212470",
            "pmid": "30416494"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Computational biology",
            "uri": "http://edamontology.org/topic_3307"
        }
    ]
}
