{
    "additionDate": "2021-01-18T09:55:36Z",
    "biotoolsCURIE": "biotools:mars_ml",
    "biotoolsID": "mars_ml",
    "confidence_flag": "high",
    "credit": [
        {
            "email": "kennedya@caltech.edu",
            "name": "Ann Kennedy",
            "typeEntity": "Person"
        },
        {
            "email": "vicente.escudero@salud.madrid.org",
            "name": "Vicente Escudero-Vilaplana",
            "orcidid": "https://orcid.org/0000-0003-4417-8321",
            "typeEntity": "Person"
        }
    ],
    "description": "A software pipeline for automated analysis of social behaviors in mice.\n\nAssessing Apps for Patients with Genitourinary Tumors Using the Mobile Application Rating Scale (MARS).\n\nThe Mouse Action Recognition System (MARS) is a deep learning based system for automated pose estimation and social behavior classification in pairs of interacting mice. It combines a user-friendly graphical user interface with fast and powerful computer vision and machine learning algorithms.\n\nMARS's novel approach to extracting features from the animals' poses and trajectories allows for highly accurate classification of social behavior.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "S/MAR prediction",
                    "uri": "http://edamontology.org/operation_0444"
                },
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                }
            ]
        }
    ],
    "homepage": "https://neuroethology.github.io/MARS/",
    "lastUpdate": "2021-02-19T09:55:07Z",
    "name": "MARS_ML",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1101/2020.07.26.222299"
        },
        {
            "doi": "10.2196/17609",
            "metadata": {
                "abstract": "© Miguel Ángel Amor-García, Roberto Collado-Borrell, Vicente Escudero-Vilaplana, Alejandra Melgarejo-Ortuño, Ana Herranz-Alonso, José Ángel Arranz Arija, María Sanjurjo-Sáez. Originally published in JMIR mHealth and uHealth (http://mhealth.jmir.org), 23.07.2020. This is an open-access article distributed under the terms of the Creative Commons Attribution License (https://creativecommons.org/licenses/by/4.0/)Background: The large number of available cancer apps and their impact on the population necessitates a transparent, objective, and comprehensive evaluation by app experts, health care professionals, and users. To date, there have been no analyses or classifications of apps for patients with genitourinary cancers, which are among the most prevalent types of cancer. Objective: The objective of our study was to analyze the quality of apps for patients diagnosed with genitourinary cancers using the Mobile Application Rating Scale (MARS) and identify high-quality apps. Methods: We performed an observational cross-sectional descriptive study of all smartphone apps for patients diagnosed with genitourinary cancers available on iOS and Android platforms. In July 2019, we searched for all available apps for patients with genitourinary cancers (bladder, prostate, cervical, uterine, endometrial, kidney, testicular, and vulvar) or their caregivers. Apps were downloaded and evaluated, and the general characteristics were entered into a database. The evaluation was performed by 2 independent researchers using the MARS questionnaire, which rates 23 evaluation criteria clustered in 5 domains (Engagement, Functionality, Esthetics, Information, and Subjective Quality) on a scale from 1 to 5. Results: In total, 46 apps were analyzed. Of these, 31 (67%) were available on Android, 6 (13%) on iOS, and 9 (20%) on both platforms. The apps were free in 89% of cases (41/46), and 61% (28/46) had been updated in the previous year. The apps were intended for prostate cancer in 30% of cases (14/46) and cervical cancer in 17% (8/46). The apps were mainly informative (63%, 29/46), preventive (24%, 11/46), and diagnostic (13%, 6/46). Only 7/46 apps (15%) were developed by health care organizations. The mean MARS score for the overall quality of the 46 apps was 2.98 (SD 0.77), with a maximum of 4.63 and a minimum of 1.95. Functionality scores were quite similar for most of the apps, with the greatest differences in Engagement and Esthetics, which showed acceptable scores in one-third of the apps. The 5 apps with the highest MARS score were the following: “Bladder cancer manager,” “Kidney cancer manager,” “My prostate cancer manager,” “Target Ovarian Cancer Symptoms Diary,” and “My Cancer Coach.” We observed statistically significant differences in the MARS score between the operating systems and the developer types (P<.001 and P=.01, respectively), but not for cost (P=.62). Conclusions: MARS is a helpful methodology to decide which apps can be prescribed to patients and to identify which features should be addressed to improve these tools. Most of the apps designed for patients with genitourinary cancers only try to provide data about the disease, without coherent interactivity. The participation of health professionals in the development of these apps is low; nevertheless, we observed that both the participation of health professionals and regular updates were correlated with quality.",
                "authors": [
                    {
                        "name": "Amor-Garcia M.A."
                    },
                    {
                        "name": "Collado-Borrell R."
                    },
                    {
                        "name": "Escudero-Vilaplana V."
                    },
                    {
                        "name": "Melgarejo-Ortuno A."
                    },
                    {
                        "name": "Herranz-Alonso A."
                    },
                    {
                        "name": "Arija J.A.A."
                    },
                    {
                        "name": "Sanjurjo-Saez M."
                    }
                ],
                "citationCount": 1,
                "date": "2020-07-01T00:00:00Z",
                "journal": "JMIR mHealth and uHealth",
                "title": "Assessing apps for patients with genitourinary tumors using the mobile application rating scale (MARS): Systematic search in app stores and content analysis"
            },
            "pmcid": "PMC7413276",
            "pmid": "32706737"
        }
    ],
    "topic": [
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Zoology",
            "uri": "http://edamontology.org/topic_3500"
        },
        {
            "term": "Neurobiology",
            "uri": "http://edamontology.org/topic_3304"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        }
    ]
}