{
    "additionDate": "2022-03-28T07:54:40.903515Z",
    "biotoolsCURIE": "biotools:anexvis",
    "biotoolsID": "anexvis",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "kuby.balagurunathan@utah.edu",
            "name": "Balagurunathan Kuberan",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "anexVis is a transcriptome tool to visualize organ/tissue-specific glycosaminoglycan biosynthetic and catabolic pathways in human health and diseases. anexVis  allows one to analyze a large number of genes that are related to biosynthetic and catabolic pathways of all glycosaminoglycans, such as heparan sulfate, chondroitin sulfate, keratan sulfate, and hyaluronic acid, in parallel across various human tissues organs. Such visual analyses have not been accessible to the broad research community despite the accumulation of a large amount of RNA-seq data.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Expression correlation analysis",
                    "uri": "http://edamontology.org/operation_3463"
                },
                {
                    "term": "Gene expression profiling",
                    "uri": "http://edamontology.org/operation_0314"
                },
                {
                    "term": "Pathway visualisation",
                    "uri": "http://edamontology.org/operation_3926"
                }
            ]
        }
    ],
    "homepage": "https://anexvis.chpc.utah.edu/",
    "lastUpdate": "2022-03-28T08:02:19.033721Z",
    "name": "anexVis",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1007/978-1-0716-1398-6_31",
            "metadata": {
                "abstract": "© 2022, Springer Science+Business Media, LLC, part of Springer Nature.Our lab has developed a new visualization tool, anexVis, for transcriptome analysis of glycosaminoglycan-related genes. This tool allows one to analyze a large number of genes that are related to biosynthetic and catabolic pathways of all glycosaminoglycans, such as heparan sulfate, chondroitin sulfate, keratan sulfate, and hyaluronic acid, in parallel across various human tissues/organs. Such visual analyses have not been accessible to the broad research community despite the accumulation of a large amount of RNA-seq data. We use publicly available data provided by the GTEx project with NIH permission to generate this new framework. Herein, we describe the use of anexVis in understanding the relationship among all biosynthetic and catabolic enzymes, core protein proteoglycans, and various transporters and understanding factors that control organ-specific GAG biosynthesis and catabolism in humans at the transcriptome level. This visualization tool may also assist us in understanding the impact of lysosomal diseases and rare glycan-related diseases on specific organs in humans.",
                "authors": [
                    {
                        "name": "Balagurunathan K."
                    },
                    {
                        "name": "Thambu K."
                    }
                ],
                "date": "2022-01-01T00:00:00Z",
                "journal": "Methods in Molecular Biology",
                "title": "anexVis: A Transcriptome Tool to Visualize Organ/Tissue-Specific Glycosaminoglycan Biosynthetic and Catabolic Pathways in Human Health and Diseases"
            },
            "pmid": "34626395",
            "type": [
                "Primary"
            ]
        }
    ],
    "topic": [
        {
            "term": "Cardiology",
            "uri": "http://edamontology.org/topic_3335"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ]
}
