{
    "additionDate": "2020-01-09T17:34:04Z",
    "biotoolsCURIE": "biotools:RACS",
    "biotoolsID": "RACS",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "jeffrey.fillingham@ryerson.ca",
            "name": "Jeffrey Fillingham",
            "orcidid": "https://orcid.org/0000-0002-9000-1458",
            "typeEntity": "Person"
        }
    ],
    "description": "rapid analysis of ChIP-Seq data for contig based genomes.\n\nRACS: Rapid Analysis of ChIP-Seq data for contig based genomes -- repository",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genome indexing",
                    "uri": "http://edamontology.org/operation_3211"
                },
                {
                    "term": "Peak calling",
                    "uri": "http://edamontology.org/operation_3222"
                },
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                },
                {
                    "term": "Scaffolding",
                    "uri": "http://edamontology.org/operation_3216"
                },
                {
                    "term": "Sequence trimming",
                    "uri": "http://edamontology.org/operation_3192"
                }
            ]
        }
    ],
    "homepage": "https://gitrepos.scinet.utoronto.ca/public/?a=summary&p=RACS",
    "lastUpdate": "2021-01-07T19:55:13.168984Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://bitbucket.org/mjponce/RACS"
        }
    ],
    "name": "RACS",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12859-019-3100-2",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Chromatin immunoprecipitation coupled to next generation sequencing (ChIP-Seq) is a widely-used molecular method to investigate the function of chromatin-related proteins by identifying their associated DNA sequences on a genomic scale. ChIP-Seq generates large quantities of data that is difficult to process and analyze, particularly for organisms with a contig-based sequenced genomes that typically have minimal annotation on their associated set of genes other than their associated coordinates primarily predicted by gene finding programs. Poorly annotated genome sequence makes comprehensive analysis of ChIP-Seq data difficult and as such standardized analysis pipelines are lacking. Results: We present a one-stop computational pipeline, \"Rapid Analysis of ChIP-Seq data\" (RACS), that utilizes traditional High-Performance Computing (HPC) techniques in association with open source tools for processing and analyzing raw ChIP-Seq data. RACS is an open source computational pipeline available from any of the following repositories https://bitbucket.org/mjponce/RACS or https://gitrepos.scinet.utoronto.ca/public/?a=summary&p=RACS. RACS is particularly useful for ChIP-Seq in organisms with contig-based genomes that have poor gene annotation to aid protein function discovery.To test the performance and efficiency of RACS, we analyzed ChIP-Seq data previously published in a model organism Tetrahymena thermophila which has a contig-based genome. We assessed the generality of RACS by analyzing a previously published data set generated using the model organism Oxytricha trifallax, whose genome sequence is also contig-based with poor annotation. Conclusions: The RACS computational pipeline presented in this report is an efficient and reliable tool to analyze genome-wide raw ChIP-Seq data generated in model organisms with poorly annotated contig-based genome sequence. Because RACS segregates the found read accumulations between genic and intergenic regions, it is particularly efficient for rapid downstream analyses of proteins involved in gene expression.",
                "authors": [
                    {
                        "name": "Saettone A."
                    },
                    {
                        "name": "Ponce M."
                    },
                    {
                        "name": "Nabeel-Shah S."
                    },
                    {
                        "name": "Fillingham J."
                    }
                ],
                "citationCount": 1,
                "date": "2019-10-29T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "RACS: Rapid analysis of ChIP-Seq data for contig based genomes"
            },
            "pmcid": "PMC6819487",
            "pmid": "31664892"
        }
    ],
    "topic": [
        {
            "term": "ChIP-seq",
            "uri": "http://edamontology.org/topic_3169"
        },
        {
            "term": "Computer science",
            "uri": "http://edamontology.org/topic_3316"
        },
        {
            "term": "ChIP-on-chip",
            "uri": "http://edamontology.org/topic_3179"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ]
}