{"credit":[{"name":"BioCatalogue","typeEntity":"Project","typeRoles":["Documentor"],"url":"https://www.biocatalogue.org"},{"email":"support@genouest.org","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"http://webservices.genouest.org/opal2/dashboard?command=docs"}],"function":[{"operation":[{"term":"Sequence analysis","uri":"http://edamontology.org/operation_2403"}]}],"labels":{"collectionID":["GenOuest"],"toolType":["Web service"],"topic":[{"term":"Sequence sites, features and motifs","uri":"http://edamontology.org/topic_0160"},{"term":"Sequence analysis","uri":"http://edamontology.org/topic_0080"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"https://www.biocatalogue.org/services/2729"}],"publication":[{"abstract":"Hidden Markov Models HMMs) are applied to the problems of statistical modeling, database searching and multiple sequence alignment of protein families and protein domains. These methods are demonstrated on the globin family, the protein kinase catalytic domain, and the EF-hand calcium binding motif. In each case the parameters of an HMM are estimated from a training set of unaligned sequences. After the HMM is built, it is used to obtain a multiple alignment of all the training sequences. It is also used to search the SWISS-PROT 22 database for other sequences that are members of the given protein family, or contain the given domain. The HMM produces multiple alignments of good quality that agree closely with the alignments produced by programs that incorporate three-dimensional structural information. When employed in discrimination tests (by examining how closely the sequences in a database fit the globin, kinase and EF-hand HMMs), the HMM is able to distinguish members of these families from non-members with a high degree of accuracy. Both the HMM and PROFILESEARCH (a technique used to search for relationships between a protein sequence and multiply aligned sequences) perform better in these tests than PROSITE (a dictionary of sites and patterns in proteins). The HMM appears to have a slight advantage over PROFILESEARCH in terms of lower rates of false negatives and false positives, even though the HMM is trained using only unaligned sequences, whereas PROFILESEARCH requires aligned training sequences. Our results suggest the presence of an EF-hand calcium binding motif in a highly conserved and evolutionary preserved putative intracellular region of 155 residues in the α-l subunit of L-type calcium channels which play an important role in excitation-contraction coupling. This region has been suggested to contain the functional domains that are typical or essential for all L-type calcium channels regardless of whether they couple to ryanodine receptors, conduct ions or both. © 1994 Academic Press Limited.","authors":["Krogh A.","Brown M.","Mian I.S.","Sjolander K.","Haussler D."],"cit_count":1232,"doi":"10.1006/jmbi.1994.1104","journal":"Journal of Molecular Biology","title":"Hidden Markov Models in computational biology applications to protein modeling","type":"Other","year":"1994-02-03"}],"summary":{"biotoolsCURIE":"biotools:hmmconvert_genouest","biotoolsID":"hmmconvert_genouest","description":"Convert between profile HMM file formats.","homepage":"http://webservices.genouest.org/opal2/dashboard?command=docs","name":"hmmconvert (genouest)","version":["1"]}}