{
    "accessibility": "Open access",
    "additionDate": "2022-02-12T22:24:15.357704Z",
    "biotoolsCURIE": "biotools:neuca",
    "biotoolsID": "neuca",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "hxf155@case.edu",
            "name": "Hao Feng",
            "orcidid": "https://orcid.org/0000-0003-2243-9949",
            "typeEntity": "Person"
        },
        {
            "name": "Ziyi Li",
            "orcidid": "https://orcid.org/0000-0001-8359-0533"
        }
    ],
    "description": "NeuCA is is a neural-network based method for scRNA-seq data annotation. It can automatically adjust its classification strategy depending on cell type correlations, to accurately annotate cell. NeuCA can automatically utilize the structure information of the cell types through a hierarchical tree to improve the annotation accuracy. It is especially helpful when the data contain closely correlated cell types.",
    "documentation": [
        {
            "type": [
                "General",
                "User manual"
            ],
            "url": "https://bioconductor.org/packages/release/bioc/manuals/NeuCA/man/NeuCA.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Expression correlation analysis",
                    "uri": "http://edamontology.org/operation_3463"
                },
                {
                    "term": "Gene expression profiling",
                    "uri": "http://edamontology.org/operation_0314"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://github.com/haoharryfeng/NeuCA",
    "language": [
        "R"
    ],
    "lastUpdate": "2022-02-12T22:24:15.360389Z",
    "license": "GPL-2.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://bioconductor.org/packages/release/bioc/html/NeuCA.html"
        }
    ],
    "name": "NeuCA",
    "operatingSystem": [
        "Mac",
        "Linux",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1038/s41598-021-04473-4",
            "metadata": {
                "abstract": "© 2022, The Author(s).The fast-advancing single cell RNA sequencing (scRNA-seq) technology enables researchers to study the transcriptome of heterogeneous tissues at a single cell level. The initial important step of analyzing scRNA-seq data is usually to accurately annotate cells. The traditional approach of annotating cell types based on unsupervised clustering and marker genes is time-consuming and laborious. Taking advantage of the numerous existing scRNA-seq databases, many supervised label assignment methods have been developed. One feature that many label assignment methods shares is to label cells with low confidence as “unassigned.” These unassigned cells can be the result of assignment difficulties due to highly similar cell types or caused by the presence of unknown cell types. However, when unknown cell types are not expected, existing methods still label a considerable number of cells as unassigned, which is not desirable. In this work, we develop a neural network-based cell annotation method called NeuCA (Neural network-based Cell Annotation) for scRNA-seq data obtained from well-studied tissues. NeuCA can utilize the hierarchical structure information of the cell types to improve the annotation accuracy, which is especially helpful when data contain closely correlated cell types. We show that NeuCA can achieve more accurate cell annotation results compared with existing methods. Additionally, the applications on eight real datasets show that NeuCA has stable performance for intra- and inter-study annotation, as well as cross-condition annotation. NeuCA is freely available as an R/Bioconductor package at https://bioconductor.org/packages/NeuCA.",
                "authors": [
                    {
                        "name": "Li Z."
                    },
                    {
                        "name": "Feng H."
                    }
                ],
                "date": "2022-12-01T00:00:00Z",
                "journal": "Scientific Reports",
                "title": "A neural network-based method for exhaustive cell label assignment using single cell RNA-seq data"
            },
            "pmcid": "PMC8766435",
            "pmid": "35042860"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        },
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ]
}