{
    "additionDate": "2021-01-18T10:38:32Z",
    "biotoolsCURIE": "biotools:osconet",
    "biotoolsID": "osconet",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "l.cutillo@leeds.ac.uk",
            "name": "Luisa Cutillo",
            "typeEntity": "Person"
        }
    ],
    "description": "Inferring oscillatory gene networks.\n\nBootstrap-based OscoNet method: Method to infer sinusoidal oscillations in single cell data.\n\nThis software reproduces the approach presented in 'OscoNet: inferring oscillatory gene networks' by Luisa Cutillo, Alexis Boukouvalas, Elli Marinopoulou, Nancy Papalopulu & Magnus Rattray.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "Gene regulatory network prediction",
                    "uri": "http://edamontology.org/operation_2437"
                },
                {
                    "term": "Statistical calculation",
                    "uri": "http://edamontology.org/operation_2238"
                }
            ]
        }
    ],
    "homepage": "https://github.com/alexisboukouvalas/OscoNet",
    "language": [
        "Python",
        "R"
    ],
    "lastUpdate": "2021-03-15T09:38:45Z",
    "license": "MIT",
    "name": "OscoNet",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1186/S12859-020-03561-Y",
            "metadata": {
                "abstract": "© 2020 The Author(s).Background: Oscillatory genes, with periodic expression at the mRNA and/or protein level, have been shown to play a pivotal role in many biological contexts. However, with the exception of the circadian clock and cell cycle, only a few such genes are known. Detecting oscillatory genes from snapshot single-cell experiments is a challenging task due to the lack of time information. Oscope is a recently proposed method to identify co-oscillatory gene pairs using single-cell RNA-seq data. Although promising, the current implementation of Oscope does not provide a principled statistical criterion for selecting oscillatory genes. Results: We improve the optimisation scheme underlying Oscope and provide a well-calibrated non-parametric hypothesis test to select oscillatory genes at a given FDR threshold. We evaluate performance on synthetic data and three real datasets and show that our approach is more sensitive than the original Oscope formulation, discovering larger sets of known oscillators while avoiding the need for less interpretable thresholds. We also describe how our proposed pseudo-time estimation method is more accurate in recovering the true cell order for each gene cluster while requiring substantially less computation time than the extended nearest insertion approach. Conclusions: OscoNet is a robust and versatile approach to detect oscillatory gene networks from snapshot single-cell data addressing many of the limitations of the original Oscope method.",
                "authors": [
                    {
                        "name": "Boukouvalas A."
                    },
                    {
                        "name": "Cutillo L."
                    },
                    {
                        "name": "Marinopoulou E."
                    },
                    {
                        "name": "Papalopulu N."
                    },
                    {
                        "name": "Rattray M."
                    }
                ],
                "date": "2020-08-21T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "OscoNet: Inferring oscillatory gene networks"
            },
            "pmcid": "PMC7445923",
            "pmid": "32838730"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ]
}
