{
    "additionDate": "2021-10-04T11:19:52.209539Z",
    "biotoolsCURIE": "biotools:libxtc",
    "biotoolsID": "libxtc",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "krylovna@gmail.com",
            "name": "Nikolay A. Krylov",
            "orcidid": "https://orcid.org/0000-0002-4520-0351",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "libxtc is an efficient library for reading XTC-compressed MD trajectory data. It is used to optimize the processing of molecular dynamics (MD) trajectory data obtained for large biomolecular systems.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Molecular dynamics",
                    "uri": "http://edamontology.org/operation_2476"
                },
                {
                    "term": "Simulation analysis",
                    "uri": "http://edamontology.org/operation_0244"
                }
            ]
        }
    ],
    "homepage": "https://gitlab.com/impulse_md/libxtc",
    "language": [
        "C++",
        "Python"
    ],
    "lastUpdate": "2021-10-04T11:21:12.066010Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://gitlab.com/impulse_md/libxtc/-/issues"
        }
    ],
    "name": "libxtc",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1186/S13104-021-05536-5",
            "metadata": {
                "abstract": "© 2021, The Author(s).Objective: The purpose of this work is to optimize the processing of molecular dynamics (MD) trajectory data obtained for large biomolecular systems. Two popular software tools were chosen as the reference: the tng and the xdrfile libraries. Current implementation of tng algorithms and library is either fast or storage efficient and xdrfile is storage efficient but slow. Our aim was to combine speed and storage efficiency through the xdrfile’s code modification. Results: Here we present libxtc, a ready-to-use library for reading MD trajectory files in xtc format. The effectiveness of libxtc is demonstrated for several biomolecular systems of various sizes (~ 2 × 104 to ~ 2 × 105 atoms). In sequential mode, the performance of libxtc is up to 1.8 times higher and 1.4 times lower than xdrfile and tng, respectively. In parallel mode, libxtc is about 3 and 1.3 times faster than xdrfile and tng. At the same time, MD data stored in the xtc format require about 1.3 times less disk space than those treated with the tng algorithm in the fastest reading mode, which is a noticeable saving especially when the MD trajectory is long and the number of atoms is large—this applies to most biologically relevant systems.",
                "authors": [
                    {
                        "name": "Efremov R.G."
                    },
                    {
                        "name": "Krylov N.A."
                    }
                ],
                "date": "2021-12-01T00:00:00Z",
                "journal": "BMC Research Notes",
                "title": "libxtc: an efficient library for reading XTC-compressed MD trajectory data"
            },
            "pmcid": "PMC8017739",
            "pmid": "33794973",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Molecular dynamics",
            "uri": "http://edamontology.org/topic_0176"
        },
        {
            "term": "Protein folds and structural domains",
            "uri": "http://edamontology.org/topic_0736"
        }
    ]
}
