{
    "additionDate": "2021-12-13T11:29:56.104758Z",
    "biotoolsCURIE": "biotools:tsm",
    "biotoolsID": "tsm",
    "confidence_flag": "tool",
    "description": "Time-Scale Modification for MATLAB is implementations of time-scale modification, time-scale modification dataset with subjective labels, an objective measure of quality for time-scale modification.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://zygurt.github.io/TSM/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Phasing",
                    "uri": "http://edamontology.org/operation_3454"
                },
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://www.github.com/zygurt/TSM",
    "language": [
        "MATLAB",
        "Python"
    ],
    "lastUpdate": "2021-12-13T11:29:56.107389Z",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://www.github.com/zygurt/TSM/issues"
        }
    ],
    "name": "TSM",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1121/10.0003753",
            "metadata": {
                "abstract": "© 2021 Acoustical Society of America.Objective evaluation of audio processed with time-scale modification (TSM) remains an open problem. Recently, a dataset of time-scaled audio with subjective quality labels was published and used to create an initial objective measure of quality (OMOQ). In this paper, an improved OMOQ for time-scaled audio is proposed. The measure uses handcrafted features and a fully connected network to predict subjective mean opinion scores (SMOS). Basic and advanced perceptual evaluation of audio quality features are used in addition to nine features specific to TSM artefacts. Six methods of alignment are explored with interpolation of the reference magnitude spectrum to the length of the test magnitude spectrum giving the best performance. The proposed measure achieves a mean root mean square error of 0.490 and a mean Pearson correlation of 0.864 to SMOS, equivalent to the 97th and 82nd percentiles of the subjective sessions, respectively. The proposed measure is used to evaluate TSM algorithms, finding that Elastique gives the highest objective quality for solo instrument and voice signals, whereas the identity phase-locking phase vocoder gives the highest objective quality for music signals and the best overall quality. The objective measure is available online at https://www.github.com/zygurt/TSM.",
                "authors": [
                    {
                        "name": "Roberts T."
                    },
                    {
                        "name": "Paliwal K.K."
                    },
                    {
                        "name": "Roberts T."
                    }
                ],
                "citationCount": 2,
                "date": "2021-03-01T00:00:00Z",
                "journal": "Journal of the Acoustical Society of America",
                "title": "An objective measure of quality for time-scale modification of audio"
            },
            "pmid": "33765787"
        }
    ],
    "toolType": [
        "Suite"
    ],
    "topic": [
        {
            "term": "Zoology",
            "uri": "http://edamontology.org/topic_3500"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ]
}