{
    "additionDate": "2019-11-14T18:22:50Z",
    "biotoolsCURIE": "biotools:OSCE",
    "biotoolsID": "OSCE",
    "confidence_flag": "high",
    "credit": [
        {
            "email": "christina.m.yuan.civ@mail.mil",
            "name": "Christina M. Yuan",
            "orcidid": "https://orcid.org/0000-0002-4805-6359",
            "typeEntity": "Person"
        },
        {
            "email": "youyou.duanmu@gmail.com",
            "name": "Youyou Duanmu",
            "orcidid": "https://orcid.org/0000-0002-3430-7866",
            "typeEntity": "Person"
        }
    ],
    "description": "> HOMEPAGE MISSING! | > CORRECT NAME OF TOOL COULD ALSO BE 'ultrasound', 'ultrasound OSCE', 'POCUS', 'emergency' | Fellow Performance on a Formative Assessment of Acute Kidney Replacement Therapy Competence | Correlation of OSCE performance and point-of-care ultrasound scan numbers among a cohort of emergency medicine residents | BACKGROUND AND OBJECTIVES:Acute kidney replacement therapy (KRT) prescription is a critical nephrology skill. We administered a formative objective structured clinical examination (OSCE) to nephrology fellows to assess acute KRT medical knowledge, patient care, and systems-based practice competencies. DESIGN, SETTING, PARTICIPANTS, & MEASUREMENTS:Prospective cohort study of an educational test using the unified model of construct validity. We tested 117 fellows: 25 (four programs) in 2016 and 92 (15 programs) in 2017; 51 first-year and 66 second-year fellows",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://www.ncbi.nlm.nih.gov/pubmed/?term=31409597",
    "lastUpdate": "2019-11-14T18:22:50Z",
    "name": "OSCE",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.2215/CJN.02900319",
            "metadata": {
                "abstract": "© 2019 by the American Society of Nephrology.Background and objectives Acute kidney replacement therapy (KRT) prescription is a critical nephrology skill. We administered a formative objective structured clinical examination (OSCE) to nephrology fellows to assess acute KRT medical knowledge, patient care, and systems-based practice competencies. Design, setting, participants, & measurements Prospective cohort study of an educational test using the unified model of construct validity. We tested 117 fellows: 25 (four programs) in 2016 and 92 (15 programs) in 2017; 51 first-year and 66 second-year fellows. Using institutional protocols and order sets, fellows wrote orders and answered open-ended questions on a three-scenario OSCE, previously validated by board-certified, practicing clinical nephrologists. Outcomes were overall and scenario pass percentage and score; percent correctly answering predetermined, evidence-based questions; second-year score correlation with in-training examination score; and satisfaction survey. Results A total of 76% passed scenario 1 (acute continuous RRT): 92% prescribed a ≥20 ml/kg per hour effluent dose; 63% estimated clearance as effluent volume. Forty-two percent passed scenario 2 (maintenance dialysis initiation); 75% correctly prescribed 3–4 mEq/L K+ dialysate and 12% identified the two absolute, urgent indications for maintenance dialysis initiation (uremic encephalopathy and pericarditis). Six percent passed scenario 3 (acute life-threatening hyperkalemia); 20% checked for rebound hyperkalemia with two separate blood draws. Eighty-three percent correctly withheld intravenous sodium bicarbonate for acute hyperkalemia in a nonacidotic, volume-overloaded patient on maintenance dialysis, and 32% passed overall. Second-year versus first-year fellow overall score was 44.4±4 versus 42.7±5 (one-tailed P=0.02), with 39% versus 24% passing (P=0.08). Second-year in-training examination and OSCE scores were not significantly correlated (r=0.15; P=0.26). Seventy-seven percent of fellows agreed the OSCE was useful in assessing “proficiency in ordering” acute KRT. Limitations include lack of a validated criterion test, and unfamiliarity with open-ended question format. Conclusions The OSCE can provide quantitative data for formative Accreditation Council for Graduate Medical Education competency assessments and identify opportunities for dialysis curriculum development.",
                "authors": [
                    {
                        "name": "Prince L.K."
                    },
                    {
                        "name": "Nee R."
                    },
                    {
                        "name": "Yuan C.M."
                    }
                ],
                "date": "2019-09-06T00:00:00Z",
                "journal": "Clinical Journal of the American Society of Nephrology",
                "title": "The acute dialysis orders objective structured clinical examination (OSCE): Fellow performance on a formative assessment of acute kidney replacement therapy competence"
            },
            "pmcid": "PMC6730513",
            "pmid": "31409597"
        },
        {
            "doi": "10.1186/S13089-019-0118-7",
            "metadata": {
                "abstract": "© 2019, The Author(s).Background: Point-of-care ultrasound (POCUS) is an important clinical tool for a growing number of medical specialties. The current American College of Emergency Physicians (ACEP) Ultrasound Guidelines recommend that trainees perform 150–300 ultrasound scans as part of POCUS training. We sought to assess the relationship between ultrasound scan numbers and performance on an ultrasound-focused observed structured clinical examination (OSCE). Methods: This was a cross-sectional cohort study in which the number of ultrasound scans residents had previously performed were obtained from a prospective database and compared with their total score on an ultrasound OSCE. Ultrasound fellowship trained emergency physicians administered a previously published OSCE that consisted of standardized questions testing image acquisition and interpretation, ultrasound machine mechanics, patient positioning, and troubleshooting. Residents were observed while performing core applications including aorta, biliary, cardiac, deep vein thrombosis, Focused Assessment with Sonography in Trauma (FAST), pelvic, and thoracic ultrasound imaging. Results: Twenty-nine postgraduate year (PGY)-3 and PGY-4 emergency medicine (EM) residents participated in the OSCE. The median OSCE score was 354 [interquartile range (IQR) 343–361] out of a total possible score of 370. Trainees had previously performed a median of 341 [IQR 289–409] total scans. Residents with more than 300 ultrasound scans had a median OSCE score of 355 [IQR 351–360], which was slightly higher than the median OSCE score of 342 [IQR 326–361] in the group with less than 300 total scans (p = 0.04). Overall, a LOWESS curve demonstrated a positive association between scan numbers and OSCE scores with graphical review of the data suggesting a plateau effect. Conclusion: The results of this small single residency program study suggest a pattern of improvement in OSCE performance as scan numbers increased, with the appearance of a plateau effect around 300 scans. Further investigation of this correlation in diverse practice environments and within individual ultrasound modalities will be necessary to create generalizable recommendations for scan requirements as part of overall POCUS proficiency assessment.",
                "authors": [
                    {
                        "name": "Duanmu Y."
                    },
                    {
                        "name": "Henwood P.C."
                    },
                    {
                        "name": "Takhar S.S."
                    },
                    {
                        "name": "Chan W."
                    },
                    {
                        "name": "Rempell J.S."
                    },
                    {
                        "name": "Liteplo A.S."
                    },
                    {
                        "name": "Koskenoja V."
                    },
                    {
                        "name": "Noble V.E."
                    },
                    {
                        "name": "Kimberly H.H."
                    }
                ],
                "date": "2019-12-01T00:00:00Z",
                "journal": "Critical Ultrasound Journal",
                "title": "Correlation of OSCE performance and point-of-care ultrasound scan numbers among a cohort of emergency medicine residents"
            },
            "pmcid": "PMC6638613",
            "pmid": "31359167"
        }
    ],
    "topic": [
        {
            "term": "Urology and nephrology",
            "uri": "http://edamontology.org/topic_3422"
        },
        {
            "term": "Critical care medicine",
            "uri": "http://edamontology.org/topic_3403"
        },
        {
            "term": "Quality affairs",
            "uri": "http://edamontology.org/topic_3393"
        }
    ]
}