{
    "additionDate": "2019-11-14T19:53:26Z",
    "biotoolsCURIE": "biotools:OMH",
    "biotoolsID": "OMH",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "gmarcais@cs.cmu.edu",
            "name": "Guillaume Marçais",
            "typeEntity": "Person"
        },
        {
            "email": "carlk@cs.cmu.edu",
            "name": "Carl Kingsford",
            "typeEntity": "Person"
        }
    ],
    "description": "Locality-sensitive hashing for the edit distance | We have provided the resources necceasary to generate the figures from ``Locality sensitive hashing for the edit distance'' by Guillaume Marçais, Dan DeBlasio, Prashant Pandey, and Carl Kingsford. Which is to appear inthe proceedings of ISMB/ECCB 2019 | The two main directories contain the necceasry code to produce the phylogeny figures (is_trees) and the random sequences figure (random_sequences). All of the figure generation is performed in a combination of perl and python. The omh_compute directory contains the code neccesary for the figure generation and is written in c++. This directory needs to be compiled before anything can be run in the other two",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Editing",
                    "uri": "http://edamontology.org/operation_3096"
                },
                {
                    "term": "Sequence assembly",
                    "uri": "http://edamontology.org/operation_0310"
                }
            ]
        }
    ],
    "homepage": "http://github.com/Kingsford-Group/omhismb2019",
    "language": [
        "C++",
        "Perl",
        "Python"
    ],
    "lastUpdate": "2021-01-04T13:25:33Z",
    "name": "OMH",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ354",
            "metadata": {
                "abstract": "© 2019 The Author(s) 2019. Published by Oxford University Press.Motivation: Sequence alignment is a central operation in bioinformatics pipeline and, despite many improvements, remains a computationally challenging problem. Locality-sensitive hashing (LSH) is one method used to estimate the likelihood of two sequences to have a proper alignment. Using an LSH, it is possible to separate, with high probability and relatively low computation, the pairs of sequences that do not have high-quality alignment from those that may. Therefore, an LSH reduces the overall computational requirement while not introducing many false negatives (i.e. omitting to report a valid alignment). However, current LSH methods treat sequences as a bag of k-mers and do not take into account the relative ordering of k-mers in sequences. In addition, due to the lack of a practical LSH method for edit distance, in practice, LSH methods for Jaccard similarity or Hamming similarity are used as a proxy. Results: We present an LSH method, called Order Min Hash (OMH), for the edit distance. This method is a refinement of the minHash LSH used to approximate the Jaccard similarity, in that OMH is sensitive not only to the k-mer contents of the sequences but also to the relative order of the k-mers in the sequences. We present theoretical guarantees of the OMH as a gapped LSH.",
                "authors": [
                    {
                        "name": "Marcais G."
                    },
                    {
                        "name": "Deblasio D."
                    },
                    {
                        "name": "Pandey P."
                    },
                    {
                        "name": "Kingsford C."
                    }
                ],
                "citationCount": 2,
                "date": "2019-07-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Locality-sensitive hashing for the edit distance"
            },
            "pmcid": "PMC6612865",
            "pmid": "31510667"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Phylogeny",
            "uri": "http://edamontology.org/topic_0084"
        },
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        },
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        }
    ],
    "validated": 1
}