
{
    "credit": [
        {
            "email": "edoardo.colzani@ecdc.europa.eu",
            "name": "Edoardo Colzani",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        },
        {
            "email": "alessandro.cassini@ecdc.europa.eu",
            "name": "Alessandro Cassini",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Prediction and recognition",
                    "uri": "http://edamontology.org/operation_2423"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "C++"
        ],
        "operatingSystem": [
            "Windows"
        ],
        "toolType": [
            "Desktop application"
        ],
        "topic": [
            {
                "term": "Infectious disease",
                "uri": "http://edamontology.org/topic_3324"
            },
            {
                "term": "Statistics and probability",
                "uri": "http://edamontology.org/topic_2269"
            },
            {
                "term": "Public health and epidemiology",
                "uri": "http://edamontology.org/topic_3305"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© 2017 Colzani et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.The burden of disease framework facilitates the assessment of the health impact of diseases through the use of summary measures of population health such as Disability- Adjusted Life Years (DALYs). However, calculating, interpreting and communicating the results of studies using this methodology poses a challenge. The aim of the Burden of Communicable Disease in Europe (BCoDE) project is to summarize the impact of communicable disease in the European Union and European Economic Area Member States (EU/EEA MS). To meet this goal, a user-friendly software tool (BCoDE toolkit), was developed. This stand-alone application, written in C++, is open-access and freely available for download from the website of the European Centre for Disease Prevention and Control (ECDC). With the BCoDE toolkit, one can calculate DALYs by simply entering the age group- and sexspecific number of cases for one or more of selected sets of 32 communicable diseases (CDs) and 6 healthcare associated infections (HAIs). Disease progression models (i.e., outcome trees) for these communicable diseases were created following a thorough literature review of their disease progression pathway. The BCoDE toolkit runs Monte Carlo simulations of the input parameters and provides disease-specific results, including 95% uncertainty intervals, and permits comparisons between the different disease models entered. Results can be displayed as mean and median overall DALYs, DALYs per 100,000 population, and DALYs related to mortality vs. disability. Visualization options summarize complex epidemiological data, with the goal of improving communication and knowledge transfer for decision-making.",
            "authors": [
                "Colzani E.",
                "Cassini A.",
                "Lewandowski D.",
                "Mangen M.-J.J.",
                "Plass D.",
                "McDonald S.A.",
                "Van Lier A.",
                "Haagsma J.A.",
                "Maringhini G.",
                "Pini A.",
                "Kramarz P.",
                "Kretzschmar M.E."
            ],
            "cit_count": 7,
            "doi": "10.1371/journal.pone.0170662",
            "journal": "PLoS ONE",
            "title": "A software tool for estimation of burden of infectious diseases in Europe using incidence-based disability adjusted life years",
            "type": "Primary",
            "year": "2017-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:bcode",
        "biotoolsID": "bcode",
        "description": "Stand-alone software application which allows calculation of disability-adjusted life years (DALYs) for a selection of 32 communicable diseases and six healthcare-associated infections.",
        "homepage": "https://ecdc.europa.eu/en/publications-data/toolkit-application-calculate-dalys",
        "name": "BCoDE"
    }
}