
{
    "credit": [
        {
            "email": "guanglan_zhang@dfci.harvard.edu",
            "name": "Guang LanZhang",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://cvc.dfci.harvard.edu/multipred2/index.php"
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://cvc.dfci.harvard.edu/multipred2/HTML/reference.php"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Protein interaction prediction",
                    "uri": "http://edamontology.org/operation_2492"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Java"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Protein binding sites",
                "uri": "http://edamontology.org/topic_3534"
            },
            {
                "term": "Immunoproteins, genes and antigens",
                "uri": "http://edamontology.org/topic_2830"
            },
            {
                "term": "Proteins",
                "uri": "http://edamontology.org/topic_0078"
            },
            {
                "term": "Genotype and phenotype",
                "uri": "http://edamontology.org/topic_0625"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/multipred2-large-scale-screening-of-allele-genotype-and-supertype-specific-hla-associated-peptides.html"
        }
    ],
    "publication": [
        {
            "abstract": "MULTIPRED2 is a computational system for facile prediction of peptide binding to multiple alleles belonging to human leukocyte antigen (HLA) class I and class II DR molecules. It enables prediction of peptide binding to products of individual HLA alleles, combination of alleles, or HLA supertypes. NetMHCpan and NetMHCIIpan are used as prediction engines. The 13 HLA Class I supertypes are A1, A2, A3, A24, B7, B8, B27, B44, B58, B62, C1, and C4. The 13 HLA Class II DR supertypes are DR1, DR3, DR4, DR6, DR7, DR8, DR9, DR11, DR12, DR13, DR14, DR15, and DR16. In total, MULTIPRED2 enables prediction of peptide binding to 1077 variants representing 26 HLA supertypes. MULTIPRED2 has visualization modules for mapping promiscuous T-cell epitopes as well as those regions of high target concentration - referred to as T-cell epitope hotspots. Novel graphic representations are employed to display the predicted binding peptides and immunological hotspots in an intuitive manner and also to provide a global view of results as heat maps. Another function of MULTIPRED2, which has direct relevance to vaccine design, is the calculation of population coverage. Currently it calculates population coverage in five major groups in North America. MULTIPRED2 is an important tool to complement wet-lab experimental methods for identification of T-cell epitopes. It is available at http://cvc.dfci.harvard.edu/multipred2/. © 2010 Elsevier B.V..",
            "authors": [
                "Zhang G.L.",
                "DeLuca D.S.",
                "Keskin D.B.",
                "Chitkushev L.",
                "Zlateva T.",
                "Lund O.",
                "Reinherz E.L.",
                "Brusic V."
            ],
            "cit_count": 37,
            "journal": "Journal of Immunological Methods",
            "pmid": "21130094",
            "title": "MULTIPRED2: A computational system for large-scale identification of peptides predicted to bind to HLA supertypes and alleles",
            "year": "2011-11-30"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:multipred2",
        "biotoolsID": "multipred2",
        "description": "Computational system for large-scale screening of peptide binding to multiple alleles belonging to human leukocyte antigen (HLA) class I and class II DR supertypes as well as to alleles belonging to an individual’s genotype.",
        "homepage": "http://cvc.dfci.harvard.edu/multipred2/index.php",
        "name": "MULTIPRED2"
    }
}