{
    "additionDate": "2020-01-09T18:35:29Z",
    "biotoolsCURIE": "biotools:La_isla_de_tomato",
    "biotoolsID": "La_isla_de_tomato",
    "confidence_flag": "tool",
    "description": "Diverse traits contribute to salinity tolerance of wild tomato seedlings from the Galapagos Islands.\n\nAnalyzing natural variation in Galapagos tomatoes.\n\nLa_isla_de_tomato App user guide.\n\nThe manuscript is currently undergoing submission / revision, but this App is available to explore the data freely. The App can be accessed here or run locally from your machine, by typing the following: library(\"shiny\") shiny::runGitHub(\"mmjulkowska/La_isla_de_tomato\", \"mmjulkowska\").",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Scatter plot plotting",
                    "uri": "http://edamontology.org/operation_2940"
                },
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                }
            ]
        }
    ],
    "homepage": "https://github.com/mmjulkowska/La_isla_de_tomato",
    "language": [
        "R"
    ],
    "lastUpdate": "2020-12-14T14:31:41Z",
    "license": "Apache-2.0",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "https://mmjulkowska.shinyapps.io/La_isla_de_tomato/"
        },
        {
            "type": [
                "Other"
            ],
            "url": "https://mmjulkowska.github.io/La_isla_de_tomato/"
        }
    ],
    "name": "La isla de tomato",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1104/PP.19.00700",
            "metadata": {
                "abstract": "© 2020 American Society of Plant Biologists.Traits of modern crops have been heavily selected in agriculture, leaving commercial lines often more susceptible to harsh conditions compared with their wild relatives. Understanding the mechanisms of stress tolerance in wild relatives can enhance crop performance under stress conditions such as high salinity. In this study, we investigated salinity tolerance of two species of wild tomato endemic to the Galapagos Islands, Solanum cheesmaniae and Solanum galapagense. Since these tomatoes grow well despite being constantly splashed with seawater, they represent a valuable genetic resource for improving salinity tolerance in commercial tomatoes. To explore their potential, we recorded over 20 traits reflecting plant growth, physiology, and ion content in 67 accessions and two commercial tomato lines of Solanum lycopersicum. Salt treatments were applied for 10 d using supported hydroponics. The Galapagos tomatoes displayed greater tolerance to salt stress than the commercial lines and showed substantial natural variation in their responses. The accessions LA0317, LA1449, and LA1403 showed particularly high salinity tolerance based on growth under salinity stress. Therefore, Galapagos tomatoes should be further explored to identify the genes underlying their high tolerance and be used as a resource for increasing the salinity tolerance of commercial tomatoes. The generated data, along with useful analysis tools, have been packaged and made publicly available via an interactive online application (https://mmjulkowska.shinyapps.io/La_isla_de_tomato/) to facilitate trait selection and the use of Galapagos tomatoes for the development of salt-tolerant commercial tomatoes.",
                "authors": [
                    {
                        "name": "Pailles Y."
                    },
                    {
                        "name": "Awlia M."
                    },
                    {
                        "name": "Julkowska M."
                    },
                    {
                        "name": "Passone L."
                    },
                    {
                        "name": "Zemmouri K."
                    },
                    {
                        "name": "Negrao S."
                    },
                    {
                        "name": "Schmockel S.M."
                    },
                    {
                        "name": "Tester M."
                    }
                ],
                "citationCount": 9,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Plant Physiology",
                "title": "Diverse traits contribute to salinity tolerance of wild tomato seedlings from the galapagos islands"
            },
            "pmid": "31653717"
        }
    ],
    "toolType": [
        "Library",
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Agricultural science",
            "uri": "http://edamontology.org/topic_3810"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        }
    ],
    "validated": 1
}