{
    "additionDate": "2020-01-14T20:12:26Z",
    "biotoolsCURIE": "biotools:miRcode",
    "biotoolsID": "miRcode",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "gouxin2017@126.com",
            "name": "Xin Gou",
            "orcidid": "https://orcid.org/0000-0001-5707-0753",
            "typeEntity": "Person"
        }
    ],
    "description": "Identification and analysis of long non-coding RNA related miRNA sponge regulatory network in bladder urothelial carcinoma.\n\ntranscriptome-wide microRNA target prediction including lncRNAs.\n\nmiRcode 11 (June 2012) based on: UCSC GRCh37/hg19, GENCODE 11 transcripts, Multiz 46 species, TargetScan6 families.\n\nMiRcode provides \"whole transcriptome\" human microRNA target predictions based on the comprehensive GENCODE gene annotation, including >10,000 long non-coding RNA genes.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "miRNA target prediction",
                    "uri": "http://edamontology.org/operation_0463"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                },
                {
                    "term": "miRNA expression analysis",
                    "uri": "http://edamontology.org/operation_3792"
                }
            ]
        }
    ],
    "homepage": "http://www.mircode.org/",
    "language": [
        "R"
    ],
    "lastUpdate": "2020-12-29T09:01:44Z",
    "name": "miRcode",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12935-019-1052-2",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: The aim of this study was to investigate the regulatory network of lncRNAs as competing endogenous RNAs (ceRNA) in bladder urothelial carcinoma (BUC) based on gene expression data derived from The Cancer Genome Atlas (TCGA). Materials and methods: RNA sequence profiles and clinical information from 414 BUC tissues and 19 non-tumor adjacent tissues were downloaded from TCGA. Differentially expressed RNAs derived from BUC and non-tumor adjacent samples were identified using the R package \"edgeR\". Kyoto Encyclopedia of Genes and Genomes (KEGG) pathway analysis was performed using the \"clusterProfiler\" package. Gene ontology and protein-protein interaction (PPI) networks were analyzed for the differentially expressed mRNAs using the \"STRING\" database. The network for the dysregulated lncRNA associated ceRNAs was then constructed for BUC using miRcode, miRTarBase, miRDB, and TargetScan. Cox regression analysis was performed to identify independent prognostic RNAs associated with BUC overall survival (OS). Survival analysis for the independent prognostic RNAs within the ceRNA network was calculated using Kaplan-Meier curves. Results: Based on our analysis, a total of 666, 1819 and 157 differentially expressed lncRNAs, mRNAs and miRNAs were identified respectively. The ceRNA network was then constructed and contained 59 lncRNAs, 23 DEmiRNAs, and 52 DEmRNAs. In total, 5 lncRNAs (HCG22, ADAMTS9-AS1, ADAMTS9-AS2, AC078778.1, and AC112721.1), 2 miRNAs (hsa-mir-145 and hsa-mir-141) and 6 mRNAs (ZEB1, TMEM100, MAP1B, DUSP2, JUN, and AIFM3) were found to be related to OS. Two lncRNAs (ADAMTS9-AS1 and ADAMTS9-AS2) and 4 mRNA (DUSP2, JUN, MAP1B, and TMEM100) were validated using GEPIA. Thirty key hub genes were identified using the ranking method of degree. KEGG analysis demonstrated that the majority of the DEmRNAs were involved in pathways associated with cancer. Conclusion: Our findings provide an understanding of the important role of lncRNA-related ceRNAs in BUC. Additional experimental and clinical validations are required to support our findings.",
                "authors": [
                    {
                        "name": "Wang J."
                    },
                    {
                        "name": "Zhang C."
                    },
                    {
                        "name": "Wu Y."
                    },
                    {
                        "name": "He W."
                    },
                    {
                        "name": "Gou X."
                    }
                ],
                "citationCount": 9,
                "date": "2019-12-03T00:00:00Z",
                "journal": "Cancer Cell International",
                "title": "Identification and analysis of long non-coding RNA related miRNA sponge regulatory network in bladder urothelial carcinoma"
            },
            "pmcid": "PMC6892182",
            "pmid": "31827401"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        }
    ],
    "validated": 1
}