{
    "additionDate": "2020-01-14T09:10:09Z",
    "biotoolsCURIE": "biotools:RWE_Framework",
    "biotoolsID": "RWE_Framework",
    "confidence_flag": "high",
    "credit": [
        {
            "email": "Matthew.Hirst@mundipharma.com",
            "name": "Matthew J. Hirst",
            "orcidid": "https://orcid.org/0000-0002-3485-0690",
            "typeEntity": "Person"
        }
    ],
    "description": "An Interactive Visual Tool to Support a Real-World Evidence Study Design.\n\nThis ﬂow diagram is a tool to aid initial planning for and design of an RWE study.\n\nDefine Objectives and Endpoint(s).\n\nWelcome to the RWE Framework, a tool developed to aid the planning and design of real-world evidence (RWE) studies. Once completed, results will be summarised to support next steps in the study design development. To start, please tick the appropriate box below:.\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'RWE'",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Validation",
                    "uri": "http://edamontology.org/operation_2428"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                },
                {
                    "term": "Literature search",
                    "uri": "http://edamontology.org/operation_0305"
                }
            ]
        }
    ],
    "homepage": "https://rweframework.com/",
    "lastUpdate": "2020-01-14T09:10:09Z",
    "name": "RWE Framework",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1007/S40801-019-00167-6",
            "metadata": {
                "abstract": "© 2019, The Author(s).Objectives: Real-world evidence (RWE) is essential for the development of pharmaceutical and medical technologies and informs treatment-related decisions by regulatory agencies, payers, healthcare providers, and patients. Given that planning RWE studies present diverse challenges, we developed the RWE Framework, a concise, visual, interactive tool designed to align multidisciplinary stakeholders toward common goals and encourage a methodical approach to RWE study planning. Methods: A search of published literature and internet-based resources was performed to identify guidance on RWE study planning with decision and/or visual aids. A conceptual framework for a study design tool was developed based on best practices for RWE studies, enhanced with an infographic design, and refined by multidisciplinary input from RWE researchers. Results: The searches confirmed an unmet need for a concise tool to support a broad range of RWE study designs: only two sources with decision/visual aids were identified. The novel RWE Framework comprises sequential decision steps with instructions to guide users through consideration of research objectives, product approval status, study setting, outcomes of interest, data availability in routine practice, need for primary data collection and/or randomization, study type and methodology, and applicable regulatory standards. Pilot testing using case studies of pharmaceutical assets demonstrated the utility of RWE Framework and applicability for use in team environments. Conclusions: The RWE Framework is a novel, concise, visual, and interactive tool to inform RWE study planning. It addresses a broad range of real-world study types and research objectives and was found to enhance RWE decision-making by multidisciplinary teams. Further validation is warranted.",
                "authors": [
                    {
                        "name": "Xia A.D."
                    },
                    {
                        "name": "Schaefer C.P."
                    },
                    {
                        "name": "Szende A."
                    },
                    {
                        "name": "Jahn E."
                    },
                    {
                        "name": "Hirst M.J."
                    }
                ],
                "date": "2019-12-01T00:00:00Z",
                "journal": "Drugs - Real World Outcomes",
                "title": "RWE Framework: An Interactive Visual Tool to Support a Real-World Evidence Study Design"
            },
            "pmcid": "PMC6879703",
            "pmid": "31741199"
        }
    ],
    "topic": [
        {
            "term": "Toxicology",
            "uri": "http://edamontology.org/topic_2840"
        },
        {
            "term": "Public health and epidemiology",
            "uri": "http://edamontology.org/topic_3305"
        },
        {
            "term": "Preclinical and clinical studies",
            "uri": "http://edamontology.org/topic_3379"
        },
        {
            "term": "Pharmacology",
            "uri": "http://edamontology.org/topic_0202"
        },
        {
            "term": "Pharmacovigilance",
            "uri": "http://edamontology.org/topic_3378"
        }
    ]
}