{
    "additionDate": "2021-01-18T07:56:09Z",
    "biotoolsCURIE": "biotools:millefy",
    "biotoolsID": "millefy",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "haruka.ozaki@md.tsukuba.ac.jp",
            "name": "Haruka Ozaki",
            "orcidid": "https://orcid.org/0000-0002-1606-2762",
            "typeEntity": "Person"
        }
    ],
    "description": "Visualizing cell-to-cell heterogeneity in read coverage of single-cell RNA sequencing datasets.\n\nMillefy is a tool for visualizing read coverage of single-cell RNA sequensing (scRNA-seq) datasets in genomic contexts. By dynamically and automatically reorder single cells based on 'locus-specific' pseudotime, Millefy highlights cell-to-cell heterogeneity in read covreage of scRNA-seq data.",
    "download": [
        {
            "type": "Container file",
            "url": "https://hub.docker.com/r/yuifu/datascience-notebook-millefy"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Read mapping",
                    "uri": "http://edamontology.org/operation_3198"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://github.com/yuifu/millefy",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-02-24T07:55:28Z",
    "name": "Millefy",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1186/S12864-020-6542-Z",
            "metadata": {
                "abstract": "© 2020 The Author(s).Background: Read coverage of RNA sequencing data reflects gene expression and RNA processing events. Single-cell RNA sequencing (scRNA-seq) methods, particularly \"full-length\" ones, provide read coverage of many individual cells and have the potential to reveal cellular heterogeneity in RNA transcription and processing. However, visualization tools suited to highlighting cell-to-cell heterogeneity in read coverage are still lacking. Results: Here, we have developed Millefy, a tool for visualizing read coverage of scRNA-seq data in genomic contexts. Millefy is designed to show read coverage of all individual cells at once in genomic contexts and to highlight cell-to-cell heterogeneity in read coverage. By visualizing read coverage of all cells as a heat map and dynamically reordering cells based on diffusion maps, Millefy facilitates discovery of \"local\" region-specific, cell-to-cell heterogeneity in read coverage. We applied Millefy to scRNA-seq data sets of mouse embryonic stem cells and triple-negative breast cancers and showed variability of transcribed regions including antisense RNAs, 3 ′ UTR lengths, and enhancer RNA transcription. Conclusions: Millefy simplifies the examination of cellular heterogeneity in RNA transcription and processing events using scRNA-seq data. Millefy is available as an R package (https://github.com/yuifu/millefy) and as a Docker image for use with Jupyter Notebook (https://hub.docker.com/r/yuifu/datascience-notebook-millefy).",
                "authors": [
                    {
                        "name": "Hayashi T."
                    },
                    {
                        "name": "Nikaido I."
                    },
                    {
                        "name": "Ozaki H."
                    },
                    {
                        "name": "Umeda M."
                    }
                ],
                "citationCount": 2,
                "date": "2020-03-03T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "Millefy: Visualizing cell-to-cell heterogeneity in read coverage of single-cell RNA sequencing datasets"
            },
            "pmcid": "PMC7053140",
            "pmid": "32122302"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Regenerative medicine",
            "uri": "http://edamontology.org/topic_3395"
        }
    ]
}
