{
    "additionDate": "2021-03-19T09:03:24Z",
    "biotoolsCURIE": "biotools:icat",
    "biotoolsID": "icat",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "richard.dipaolo@health.slu.edu",
            "name": "Richard J. DiPaolo",
            "typeEntity": "Person"
        },
        {
            "email": "taehyuk.ahn@slu.edu",
            "name": "Tae-Hyuk Ahn",
            "typeEntity": "Person"
        }
    ],
    "description": "iCAT: Immune Cells Analysis software Tool.\n\nHigh throughput sequencing of immune cell receptor sequences presents a unique opportunity to inform our understanding of immunological response to infection and how we can detect it. iCAT is a user-friendly, graphical-interface software that takes exposed and non-exposed samples of T-cell receptor (TCR) clonotypes as input and identifies pathogen-specific TCR sequences. Using these sequences, iCAT can also classify independent samples of TCR clonotypes. iCAT was able to identify vaccine-associated TCR sequences with up to 95% prediction accuracy in mice.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Prediction and recognition",
                    "uri": "http://edamontology.org/operation_2423"
                }
            ]
        }
    ],
    "homepage": "https://github.com/BioHPC/iCAT",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-03-31T18:08:55Z",
    "license": "MIT",
    "name": "iCAT",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.12688/F1000RESEARCH.27214.1",
            "metadata": {
                "abstract": "Copyright: © 2021 Rajeh A et al.The pathogen exposure history of an individual is recorded in their T-cell repertoire and can be accessed through the study of T-cell receptors (TCRs) if the tools to identify them were available. For each T-cell, the TCR loci undergoes genetic rearrangement that creates a unique DNA sequence. In theory these unique sequences can be used as biomarkers for tracking T-cell responses and cataloging immunological history. We developed the immune Cell Analysis Tool (iCAT), an R software package that analyzes TCR sequencing data from exposed (positive) and unexposed (negative) samples to identify TCR sequences statistically associated with positive samples. The presence and absence of associated sequences in samples trains a classifier to diagnose pathogen-specific exposure. We demonstrate the high accuracy of iCAT by testing on three TCR sequencing datasets. First, iCAT successfully diagnosed smallpox vaccinated versus naïve samples in an independent cohort of mice with 95% accuracy. Second, iCAT displayed 100% accuracy classifying naïve and monkeypox vaccinated mice. Finally, we demonstrate the use of iCAT on human samples before and after exposure to SARS-CoV-2, the virus behind the COVID-19 global pandemic. We were able to correctly classify the exposed samples with perfect accuracy. These experimental results show that iCAT capitalizes on the power of TCR sequencing to simplify infection diagnostics. iCAT provides the option of a graphical, user-friendly interface on top of usual R interface allowing it to reach a wider audience.",
                "authors": [
                    {
                        "name": "Rajeh A."
                    },
                    {
                        "name": "Wolf K."
                    },
                    {
                        "name": "Schiebout C."
                    },
                    {
                        "name": "Sait N."
                    },
                    {
                        "name": "Kosfeld T."
                    },
                    {
                        "name": "DiPaolo R.J."
                    },
                    {
                        "name": "Ahn T.-H."
                    }
                ],
                "date": "2021-01-01T00:00:00Z",
                "journal": "F1000Research",
                "title": "iCAT: diagnostic assessment tool of immunological history using high-throughput T-cell receptor sequencing"
            }
        }
    ],
    "toolType": [
        "Command-line tool",
        "Library",
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Immunology",
            "uri": "http://edamontology.org/topic_0804"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}