{
    "additionDate": "2018-04-21T09:07:39Z",
    "biotoolsCURIE": "biotools:webgivi",
    "biotoolsID": "webgivi",
    "credit": [
        {
            "email": "sunliang@udel.edu",
            "name": "Liang Sun",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "The tool  can accept a gene list that will be used to retrieve a gene symbol and iTerm list. This list can be resubmitted to visualize the gene-iTerm pairs using Cytoscape or Concept Map.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://raven.anr.udel.edu/webgivi/webGIVI_Tutorial.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                },
                {
                    "term": "Expression data visualisation",
                    "uri": "http://edamontology.org/operation_0571"
                }
            ]
        }
    ],
    "homepage": "http://raven.anr.udel.edu/webgivi/",
    "lastUpdate": "2018-12-10T12:58:57Z",
    "license": "BSD-Protection",
    "name": "WebGIVI",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1186/s12859-017-1664-2",
            "metadata": {
                "abstract": "© 2017 The Author(s).Background: A major challenge of high throughput transcriptome studies is presenting the data to researchers in an interpretable format. In many cases, the outputs of such studies are gene lists which are then examined for enriched biological concepts. One approach to help the researcher interpret large gene datasets is to associate genes and informative terms (iTerm) that are obtained from the biomedical literature using the eGIFT text-mining system. However, examining large lists of iTerm and gene pairs is a daunting task. Results: We have developed WebGIVI, an interactive web-based visualization tool ( http://raven.anr.udel.edu/webgivi/ ) to explore gene:iTerm pairs. WebGIVI was built via Cytoscape and Data Driven Document JavaScript libraries and can be used to relate genes to iTerms and then visualize gene and iTerm pairs. WebGIVI can accept a gene list that is used to retrieve the gene symbols and corresponding iTerm list. This list can be submitted to visualize the gene iTerm pairs using two distinct methods: a Concept Map or a Cytoscape Network Map. In addition, WebGIVI also supports uploading and visualization of any two-column tab separated data. Conclusions: WebGIVI provides an interactive and integrated network graph of gene and iTerms that allows filtering, sorting, and grouping, which can aid biologists in developing hypothesis based on the input gene lists. In addition, WebGIVI can visualize hundreds of nodes and generate a high-resolution image that is important for most of research publications. The source code can be freely downloaded at https://github.com/sunliang3361/WebGIVI. The WebGIVI tutorial is available at http://raven.anr.udel.edu/webgivi/tutorial.php.",
                "authors": [
                    {
                        "name": "Sun L."
                    },
                    {
                        "name": "Zhu Y."
                    },
                    {
                        "name": "Mahmood A.S.M.A."
                    },
                    {
                        "name": "Tudor C.O."
                    },
                    {
                        "name": "Ren J."
                    },
                    {
                        "name": "Vijay-Shanker K."
                    },
                    {
                        "name": "Chen J."
                    },
                    {
                        "name": "Schmidt C.J."
                    }
                ],
                "citationCount": 5,
                "date": "2017-05-04T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "WebGIVI: A web-based gene enrichment analysis and visualization tool"
            },
            "pmcid": "PMC5418709",
            "pmid": "28472919"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        },
        {
            "term": "Data visualisation",
            "uri": "http://edamontology.org/topic_0092"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ],
    "validated": 1
}