{
    "additionDate": "2020-01-14T19:49:53Z",
    "biotoolsCURIE": "biotools:MathIOmica",
    "biotoolsID": "MathIOmica",
    "confidence_flag": "tool",
    "description": "General Analysis Utilities for Dynamic Omics Datasets.\n\nMathIOmica is a package for bioinformatics, written in the Wolfram language, that provides multiple utilities to facilitate the analysis of longitudinal data generated from omics experiments, including transcriptomics, proteomics, and metabolomics data, as well as any generalized time series. MathIOmica uses Mathematica's notebook interface, wherein users can import longitudinal datasets, carry out quality control and normalization, generate time series, and classify temporal trends. MathIOmica provides spectral methods based on periodograms and autocorrelations for automatically detecting classes of temporal behavior and allowing the user to visualize collective temporal behavior, and also assess biological significance through Gene Ontology and pathway enrichment analyses. MathIOmica's time-series classification methods address common issues including missing data and uneven sampling in measurements.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "RNA-seq time series data analysis",
                    "uri": "http://edamontology.org/operation_3565"
                },
                {
                    "term": "Pathway or network visualisation",
                    "uri": "http://edamontology.org/operation_3083"
                }
            ]
        }
    ],
    "homepage": "https://mathiomica.org/",
    "lastUpdate": "2020-12-23T07:51:55Z",
    "name": "MathIOmica",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1002/CPBI.91",
            "metadata": {
                "abstract": "© 2019 John Wiley & Sons, Inc.MathIOmica is a package for bioinformatics, written in the Wolfram language, that provides multiple utilities to facilitate the analysis of longitudinal data generated from omics experiments, including transcriptomics, proteomics, and metabolomics data, as well as any generalized time series. MathIOmica uses Mathematica's notebook interface, wherein users can import longitudinal datasets, carry out quality control and normalization, generate time series, and classify temporal trends. MathIOmica provides spectral methods based on periodograms and autocorrelations for automatically detecting classes of temporal behavior and allowing the user to visualize collective temporal behavior, and also assess biological significance through Gene Ontology and pathway enrichment analyses. MathIOmica's time-series classification methods address common issues including missing data and uneven sampling in measurements. As such, the software is ideally suited for the analysis of experimental data from individualized profiling of subjects, can facilitate analysis of data from the emerging field of individualized health monitoring, and can detect temporal trends that may be associated with adverse health events. In this article, we import a transcriptomics (RNA-sequencing) dataset collected over multiple timepoints and generate time series for each transcript represented in the data. We classify the time series to identify classes of significant temporal trends (using autocorrelations). We assess statistical significance cutoffs in the classification by generating null distributions using randomly resampled time series. We then visualize the significant trends in heatmaps and assess biological significance using enrichment analyses. Finally, we visualize pathway results for statistically significant pathways of interest. © 2019 by John Wiley & Sons, Inc. Basic Protocol: Time series analysis of transcriptomics expression dataset.",
                "authors": [
                    {
                        "name": "Mias G.I."
                    },
                    {
                        "name": "Zheng M."
                    }
                ],
                "citationCount": 2,
                "date": "2020-03-01T00:00:00Z",
                "journal": "Current Protocols in Bioinformatics",
                "title": "The MathIOmica Toolbox: General Analysis Utilities for Dynamic Omics Datasets"
            },
            "pmid": "31851777"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        },
        {
            "term": "Personalised medicine",
            "uri": "http://edamontology.org/topic_3577"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ],
    "validated": 1
}