{
    "accessibility": "Open access",
    "additionDate": "2021-10-12T12:46:02.624200Z",
    "biotoolsCURIE": "biotools:transat",
    "biotoolsID": "transat",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "tplu@ntu.edu.tw",
            "name": "Tzu-Pin Lu",
            "orcidid": "https://orcid.org/0000-0003-3697-0386",
            "typeEntity": "Person"
        }
    ],
    "description": "TransAT is a package within the R programming language for converting RefSeq ID to Ensembl ID and mapping the genomic position, followed by providing variant allele frequencies and gene annotations.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/ShihChingYu/TransAT"
        }
    ],
    "download": [
        {
            "type": "Command-line specification",
            "url": "https://github.com/ShihChingYu/TransAT"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Sequence",
                        "uri": "http://edamontology.org/data_2044"
                    },
                    "format": [
                        {
                            "term": "CSV",
                            "uri": "http://edamontology.org/format_3752"
                        }
                    ]
                }
            ],
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "SNP annotation",
                    "uri": "http://edamontology.org/operation_3661"
                },
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Ensembl transcript ID",
                        "uri": "http://edamontology.org/data_2725"
                    }
                }
            ]
        }
    ],
    "homepage": "https://github.com/ShihChingYu/TransAT",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-10-12T12:52:35.658868Z",
    "license": "Not licensed",
    "name": "TransAT",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1186/S12859-021-04243-Z",
            "metadata": {
                "abstract": "© 2021, The Author(s).Background: An individual’s genetics play a role in how RNA transcripts are generated from DNA and consequently in their translation into protein. Transcriptional and translational profiling of patients furnishes the information that a specific marker is present; however, it fails to provide evidence whether the marker correlates with response to a therapeutic agent. A comparative analysis of the frequency of genetic variants, such as single nucleotide polymorphisms (SNPs), in diseased and general populations can identify pathogenic variants in individual patients. This is in part because SNPs have considerable effects on protein function and gene expression when they occur in coding regions and regulatory sequences, respectively. Therefore, a tool that can help users to obtain the allele frequency for a corresponding transcript is the need of the day. Several annotation tools such as SNPnexus and VariED are publicly available; however, none of them can use transcript IDs as input and provide the corresponding genomic positions of variants. Results: In this study, we developed an R package, called transcript annotation tool (TransAT), that provides (i) SNP ID and genomic position for a user-provided transcript ID from patients, and (ii) allele frequencies for the SNPs from publicly available global populations. All data elements are extracted, collected, and displayed in an easily downloadable format in two simple command lines. TransAT is available on Windows/Linux/MacOS and is operative for R version 4.0.4 or later. It is available at https://github.com/ShihChingYu/TransAT and can be downloaded and installed using devtools::install_github(\"ShihChingYu/TransAT\", force=T) on the R execution page. Thereafter, all functions can be executed by loading the package into R with library(TransAT). Conclusions: TransAT is a novel tool that seamlessly provides genetic annotations for queried transcripts. Such easily obtainable information would be greatly advantageous for physicians, assisting them to make individualized decisions about specific drug treatments. Moreover, allele frequencies from user-chosen global ethnic populations will highlight the importance of ethnicity and its effect on patient pathogenicity.",
                "authors": [
                    {
                        "name": "Chattopadhyay A."
                    },
                    {
                        "name": "Lu T.-P."
                    },
                    {
                        "name": "Shih C.-Y."
                    },
                    {
                        "name": "Tien Y.-W."
                    },
                    {
                        "name": "Wu C.-H."
                    }
                ],
                "date": "2021-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Transcript annotation tool (TransAT): an R package for retrieving annotations for transcript-specific genetic variants"
            },
            "pmcid": "PMC8240296",
            "pmid": "34182919"
        }
    ],
    "toolType": [
        "Command-line tool",
        "Library"
    ],
    "topic": [
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        }
    ],
    "validated": 1
}
