{
    "additionDate": "2022-08-11T10:12:56.556645Z",
    "biotoolsCURIE": "biotools:cbea",
    "biotoolsID": "cbea",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "hildreth.r.frost@dartmouth.edu",
            "name": "H. Robert Frost",
            "orcidid": "https://orcid.org/0000-0002-6794-9945",
            "typeEntity": "Person"
        },
        {
            "name": "Quang P. Nguyen",
            "orcidid": "https://orcid.org/0000-0002-2072-3279"
        }
    ],
    "description": "R package for performing enrichment analysis for microbiome relative abundance data using the CBEA approach.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                },
                {
                    "term": "Dimensionality reduction",
                    "uri": "http://edamontology.org/operation_3935"
                },
                {
                    "term": "Gene-set enrichment analysis",
                    "uri": "http://edamontology.org/operation_2436"
                },
                {
                    "term": "Statistical calculation",
                    "uri": "http://edamontology.org/operation_2238"
                }
            ]
        }
    ],
    "homepage": "http://www.github.com/qpmnguyen/CBEA",
    "language": [
        "R"
    ],
    "lastUpdate": "2022-08-11T10:12:56.558928Z",
    "license": "Not licensed",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://qpmnguyen.github.io/CBEA/"
        }
    ],
    "name": "CBEA",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PCBI.1010091",
            "metadata": {
                "abstract": "Copyright: © 2022 Nguyen et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Research in human-associated microbiomes often involves the analysis of taxonomic count tables generated via high-throughput sequencing. It is difficult to apply statistical tools as the data is high-dimensional, sparse, and compositional. An approachable way to alleviate high-dimensionality and sparsity is to aggregate variables into pre-defined sets. Set-based analysis is ubiquitous in the genomics literature and has demonstrable impact on improving interpretability and power of downstream analysis. Unfortunately, there is a lack of sophisticated set-based analysis methods specific to microbiome taxonomic data, where current practice often employs abundance summation as a technique for aggregation. This approach prevents comparison across sets of different sizes, does not preserve inter-sample distances, and amplifies protocol bias. Here, we attempt to fill this gap with a new single-sample taxon enrichment method that uses a novel log-ratio formulation based on the competitive null hypothesis commonly used in the enrichment analysis literature. Our approach, titled competitive balances for taxonomic enrichment analysis (CBEA), generates sample-specific enrichment scores as the scaled log-ratio of the subcomposition defined by taxa within a set and the subcomposition defined by its complement. We provide sample-level significance testing by estimating an empirical null distribution of our test statistic with valid p-values. Herein, we demonstrate, using both real data applications and simulations, that CBEA controls for type I error, even under high sparsity and high inter-taxa correlation scenarios. Additionally, CBEA provides informative scores that can be inputs to downstream analyses such as prediction tasks.",
                "authors": [
                    {
                        "name": "Hoen A.G."
                    },
                    {
                        "name": "Nguyen Q.P."
                    },
                    {
                        "name": "Robert Frost H."
                    }
                ],
                "date": "2022-05-01T00:00:00Z",
                "journal": "PLoS Computational Biology",
                "title": "CBEA: Competitive balances for taxonomic enrichment analysis"
            },
            "pmcid": "PMC9154102",
            "pmid": "35584140"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Literature and language",
            "uri": "http://edamontology.org/topic_3068"
        },
        {
            "term": "Microbial ecology",
            "uri": "http://edamontology.org/topic_3697"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Whole genome sequencing",
            "uri": "http://edamontology.org/topic_3673"
        }
    ]
}
