
{
    "credit": [
        {
            "email": "J.Mill@exeter.ac.uk",
            "name": "Jonathan MillEmail author",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Nucleic acid sequence analysis",
                    "uri": "http://edamontology.org/operation_2478"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "R"
        ],
        "license": "GPL-2.0",
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Library"
        ],
        "topic": [
            {
                "term": "Epigenetics",
                "uri": "http://edamontology.org/topic_3295"
            },
            {
                "term": "Methylated DNA immunoprecipitation",
                "uri": "http://edamontology.org/topic_3674"
            },
            {
                "term": "Pathology",
                "uri": "http://edamontology.org/topic_0634"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© 2016 The Author(s). Background: Schizophrenia is a highly heritable, neuropsychiatric disorder characterized by episodic psychosis and altered cognitive function. Despite success in identifying genetic variants associated with schizophrenia, there remains uncertainty about the causal genes involved in disease pathogenesis and how their function is regulated. Results: We performed a multi-stage epigenome-wide association study, quantifying genome-wide patterns of DNA methylation in a total of 1714 individuals from three independent sample cohorts. We have identified multiple differentially methylated positions and regions consistently associated with schizophrenia across the three cohorts; these effects are independent of important confounders such as smoking. We also show that epigenetic variation at multiple loci across the genome contributes to the polygenic nature of schizophrenia. Finally, we show how DNA methylation quantitative trait loci in combination with Bayesian co-localization analyses can be used to annotate extended genomic regions nominated by studies of schizophrenia, and to identify potential regulatory variation causally involved in disease. Conclusions: This study represents the first systematic integrated analysis of genetic and epigenetic variation in schizophrenia, introducing a methodological approach that can be used to inform epigenome-wide association study analyses of other complex traits and diseases. We demonstrate the utility of using a polygenic risk score to identify molecular variation associated with etiological variation, and of using DNA methylation quantitative trait loci to refine the functional and regulatory variation associated with schizophrenia risk variants. Finally, we present strong evidence for the co-localization of genetic associations for schizophrenia and differential DNA methylation.",
            "authors": [
                "Hannon E.",
                "Dempster E.",
                "Viana J.",
                "Burrage J.",
                "Smith A.R.",
                "Macdonald R.",
                "St Clair D.",
                "Mustard C.",
                "Breen G.",
                "Therman S.",
                "Kaprio J.",
                "Toulopoulou T.",
                "Pol H.E.H.",
                "Bohlken M.M.",
                "Kahn R.S.",
                "Nenadic I.",
                "Hultman C.M.",
                "Murray R.M.",
                "Collier D.A.",
                "Bass N.",
                "Gurling H.",
                "McQuillin A.",
                "Schalkwyk L.",
                "Mill J."
            ],
            "cit_count": 63,
            "doi": "10.1186/s13059-016-1041-x",
            "journal": "Genome Biology",
            "title": "An integrated genetic-epigenetic analysis of schizophrenia: Evidence for co-localization of genetic associations and differential DNA methylation",
            "year": "2016-08-30"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:sczewas",
        "biotoolsID": "sczewas",
        "description": "Analysis of co-localization of genetic associations and differential DNA methylation.",
        "homepage": "https://github.com/ejh243/SCZEWAS",
        "name": "SCZEWAS"
    }
}