{"credit":[{"email":"t.wong@garvan.org.au","name":"Ted Wong","typeEntity":"Person","typeRoles":["Primary contact"]},{"name":"Simon Hardwick","typeEntity":"Person","typeRoles":["Contributor"]}],"documentation":[{"url":"http://bioconductor.org/packages/release/bioc/html/Anaquin.html"}],"download":[{"type":"Source code","url":"http://bioconductor/packages/release/bioc/src/contrib/Anaquin_1.0.0.tar.gz"}],"function":[{"operation":[{"term":"Deposition","uri":"http://edamontology.org/operation_3431"}]}],"labels":{"collectionID":["BioConductor"],"language":["R"],"license":"BSD-4-Clause","operatingSystem":["Linux","Windows","Mac"],"toolType":["Command-line tool","Library"],"topic":[{"term":"Sequencing","uri":"http://edamontology.org/topic_3168"},{"term":"Sequence analysis","uri":"http://edamontology.org/topic_0080"},{"term":"Data visualisation","uri":"http://edamontology.org/topic_0092"}]},"link":[{"type":"MIRROR","url":"http://www.sequin.xyz"}],"publication":[{"abstract":"© 2016 Nature America, Inc. All rights reserved. RNA sequencing (RNA-seq) can be used to assemble spliced isoforms, quantify expressed genes and provide a global profile of the transcriptome. However, the size and diversity of the transcriptome, the wide dynamic range in gene expression and inherent technical biases confound RNA-seq analysis. We have developed a set of spike-in RNA standards, termed 'sequins' (sequencing spike-ins), that represent full-length spliced mRNA isoforms. Sequins have an entirely artificial sequence with no homology to natural reference genomes, but they align to gene loci encoded on an artificial in silico chromosome. The combination of multiple sequins across a range of concentrations emulates alternative splicing and differential gene expression, and it provides scaling factors for normalization between samples. We demonstrate the use of sequins in RNA-seq experiments to measure sample-specific biases and determine the limits of reliable transcript assembly and quantification in accompanying human RNA samples. In addition, we have designed a complementary set of sequins that represent fusion genes arising from rearrangements of the in silico chromosome to aid in cancer diagnosis. RNA sequins provide a qualitative and quantitative reference with which to navigate the complexity of the human transcriptome.","authors":["Hardwick S.A.","Chen W.Y.","Wong T.","Deveson I.W.","Blackburn J.","Andersen S.B.","Nielsen L.K.","Mattick J.S.","Mercer T.R."],"cit_count":24,"doi":"10.1038/nmeth.3958","journal":"Nature Methods","pmid":"27502218","title":"Spliced synthetic genes as internal controls in RNA sequencing experiments","type":"Primary","year":"2016-08-30"}],"summary":{"biotoolsCURIE":"biotools:anaquin","biotoolsID":"anaquin","description":"The project is intended to support the use of sequins (synthetic sequencing spike-in controls) owned and made available by the Garvan Institute of Medical Research. The goal is to provide a standard open source library for quantitative analysis, modelling and visualization of spike-in controls.","homepage":"http://bioconductor.org/packages/release/bioc/html/Anaquin.html","name":"Anaquin","version":["1.0.0"]}}