{
    "accessibility": [
        "Open access"
    ],
    "additionDate": "2019-05-31T15:24:26Z",
    "biotoolsCURIE": "biotools:NeOGen",
    "biotoolsID": "NeOGen",
    "collectionID": [],
    "confidence_flag": null,
    "cost": "Free of charge (with restrictions)",
    "credit": [
        {
            "email": "j.ovenden@uq.edu.au",
            "gridid": null,
            "name": "J. R. Ovenden",
            "note": null,
            "orcidid": null,
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": null
        }
    ],
    "description": "NeOGen (genetic Ne for Overlapping Generations analysis; pronounced Neo-gen) is point-&-click genetic effective population size (Ne) and demographic modelling software.",
    "documentation": [
        {
            "note": null,
            "type": "User manual",
            "url": "http://2ut9n61bkk06pj0x74a5nwzu.wpengine.netdna-cdn.com/wp-content/uploads/2018/08/NeOGen-Power_v1_3_0_6_a1__Guide_0__User_Manual_v1_1_3.pdf"
        }
    ],
    "download": [],
    "editPermission": {
        "authors": [],
        "type": "private"
    },
    "elixirNode": [],
    "elixirPlatform": [],
    "elixir_badge": 0,
    "function": [
        {
            "cmd": null,
            "input": [],
            "note": null,
            "operation": [
                {
                    "term": "Linkage disequilibrium calculation",
                    "uri": "http://edamontology.org/operation_0488"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                }
            ],
            "output": []
        }
    ],
    "homepage": "http://www.molecularfisherieslaboratory.com.au/neogen-v1-3-0-6-a1-software/",
    "homepage_status": 0,
    "language": [
        "C++"
    ],
    "lastUpdate": "2019-05-31T15:24:26Z",
    "license": "GPL-3.0",
    "link": [],
    "maturity": "Emerging",
    "name": "NeOGen",
    "operatingSystem": [
        "Windows"
    ],
    "otherID": [],
    "owner": "Ruta",
    "publication": [
        {
            "doi": "10.1111/1755-0998.12941",
            "metadata": {
                "abstract": "© 2018 John Wiley & Sons Ltd Molecular genetic estimates of population effective size (N e ) lose accuracy and precision when insufficient numbers of samples or loci are used. Ideally, researchers would like to forecast the necessary power when planning their project. neogen (genetic N e for Overlapping Generations) enables estimates of precision and accuracy in advance of empirical investigation and allows exploration of the power available in different user-specified age-structured sampling schemes. neogen provides a population simulation and genetic power analysis framework that simulates the demographics, genetic composition, and N e , from species-specific life history, mortality, population size, and genetic priors. neogen guides the user to establish a tractable sampling regime and to determine the numbers of samples and microsatellite or SNP loci required for accurate and precise genetic N e estimates when sampling a natural population. neogen is useful at multiple stages of a study's life cycle: when budgeting, as sampling and locus development progresses, and for corroboration when empirical N e estimates are available. The underlying model is applicable to a wide variety of iteroparous species with overlapping generations (e.g., mammals, birds, reptiles, long-lived fishes). In this paper, we describe the neogen model, detail the workflow for the point-and-click software, and explain the graphical results. We demonstrate the use of neogen with empirical Australian east coast zebra shark (Stegostoma fasciatum) data. For researchers wishing to make accurate and precise genetic N e estimates for overlapping generations species, neogen facilitates planning for sample and locus acquisition, and with existing empirical genetic N e estimates neogen can corroborate population demographic and life history properties.",
                "authors": [
                    {
                        "name": "Blower D.C."
                    },
                    {
                        "name": "Riginos C."
                    },
                    {
                        "name": "Ovenden J.R."
                    }
                ],
                "citationCount": 0,
                "date": "2019-01-01T00:00:00Z",
                "journal": "Molecular Ecology Resources",
                "title": "neogen: A tool to predict genetic effective population size (N e ) for species with generational overlap and to assist empirical N e study design"
            },
            "note": null,
            "pmcid": null,
            "pmid": null,
            "type": "Primary",
            "version": null
        }
    ],
    "relation": [],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Population genetics",
            "uri": "http://edamontology.org/topic_3056"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        }
    ],
    "validated": 0,
    "version": [
        "1.3.0.6.a1"
    ]
}