{
    "accessibility": "Open access",
    "additionDate": "2024-03-21T10:31:28.274001Z",
    "biotoolsCURIE": "biotools:esomir",
    "biotoolsID": "esomir",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "abbaskhan@sjtu.edu.cn",
            "name": "Abbas Khan",
            "orcidid": "https://orcid.org/0000-0002-4288-7602",
            "typeEntity": "Person"
        },
        {
            "email": "dqwei@sjtu.edu.cn",
            "name": "Dong-Qing Wei",
            "typeEntity": "Person"
        }
    ],
    "description": "Curated database of biomarker genes and miRNAs associated with esophageal cancer.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "miRNA expression analysis",
                    "uri": "http://edamontology.org/operation_3792"
                },
                {
                    "term": "miRNA target prediction",
                    "uri": "http://edamontology.org/operation_0463"
                }
            ]
        }
    ],
    "homepage": "https://esomir.dqweilab-sjtu.com",
    "lastUpdate": "2024-03-21T10:31:28.278089Z",
    "name": "ESOMIR",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/DATABASE/BAAD063",
            "metadata": {
                "abstract": "‘Esophageal cancer’ (EC) is a highly aggressive and deadly complex disease. It comprises two types, esophageal adenocarcinoma (EAC) and esophageal squamous cell carcinoma (ESCC), with Barrett’s esophagus (BE) being the only known precursor. Recent research has revealed that microRNAs (miRNAs) play a crucial role in the development, prognosis and treatment of EC and are involved in various human diseases. Biological databases have become essential for cancer research as they provide information on genes, proteins, pathways and their interactions. These databases collect, store and manage large amounts of molecular data, which can be used to identify patterns, predict outcomes and generate hypotheses. However, no comprehensive database exists for EC and miRNA relationships. To address this gap, we developed a dynamic database named ‘ESOMIR (miRNA in esophageal cancer) (https://esomir.dqweilab-sjtu.com)’, which includes information about targeted genes and miRNAs associated with EC.The database uses analysis and prediction methods, including experimentally endorsed miRNA(s) information. ESOMIR is a user-friendly interface that allows easy access to EC-associated data by searching for miRNAs, target genes, sequences, chromosomal positions and associated signaling pathways. The search modules are designed to provide specific data access to users based on their requirements. Additionally, the database provides information about network interactions, signaling pathways and region information of chromosomes associated with the 3′untranslated region (3′UTR) or 5′UTR and exon sites. Users can also access energy levels of specific miRNAs with targeted genes. A fuzzy term search is included in each module to enhance the ease of use for researchers. ESOMIR can be a valuable tool for researchers and clinicians to gain insight into EC, including identifying biomarkers and treatments for this aggressive tumor.",
                "authors": [
                    {
                        "name": "Alshammari A."
                    },
                    {
                        "name": "Casida M.E."
                    },
                    {
                        "name": "Khan A."
                    },
                    {
                        "name": "Selvaraj G."
                    },
                    {
                        "name": "Sindhoo A."
                    },
                    {
                        "name": "Sipy S."
                    },
                    {
                        "name": "Wei D.-Q."
                    }
                ],
                "citationCount": 2,
                "date": "2023-01-01T00:00:00Z",
                "journal": "Database",
                "title": "ESOMIR: a curated database of biomarker genes and miRNAs associated with esophageal cancer"
            },
            "pmcid": "PMC10563827",
            "pmid": "37815872"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        }
    ]
}
