{
    "additionDate": "2021-01-18T08:06:04Z",
    "biotoolsCURIE": "biotools:boltzmatch",
    "biotoolsID": "boltzmatch",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "akerteszfarkas@hse.ru",
            "name": "Attila Kertész-Farkas",
            "typeEntity": "Person"
        }
    ],
    "description": "BoltzMatch is machine-learning-based peptide-spectrum-matching scoring method for spectrum identification in tandem mass spectrometry, shotgun proteomics. Annotation of tandem mass spectrometry data using stochastic neural networks in shotgun proteomics.\n\nAuthors: Anastasia Voronkova, Pavel Sulimov, and Attila Kertesz-Farkas National Research University Higher School of Economics (HSE), Moscow, Russia.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Peptide identification",
                    "uri": "http://edamontology.org/operation_3631"
                },
                {
                    "term": "Protein identification",
                    "uri": "http://edamontology.org/operation_3767"
                },
                {
                    "term": "Spectrum calculation",
                    "uri": "http://edamontology.org/operation_3860"
                }
            ]
        }
    ],
    "homepage": "https://github.com/kfattila/BoltzMatch",
    "language": [
        "Python",
        "Shell"
    ],
    "lastUpdate": "2021-02-04T18:28:18Z",
    "name": "BoltzMatch",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAA206",
            "metadata": {
                "abstract": "© 2020 The Author(s) 2020. Published by Oxford University Press. All rights reserved. For permissions, please e-mail: journals.permissions@oup.com.Motivation: The discrimination ability of score functions to separate correct from incorrect peptide-spectrum-matches in database-searching-based spectrum identification is hindered by many superfluous peaks belonging to unexpected fragmentation ions or by the lacking peaks of anticipated fragmentation ions. Results: Here, we present a new method, called BoltzMatch, to learn score functions using a particular stochastic neural networks, called restricted Boltzmann machines, in order to enhance their discrimination ability. BoltzMatch learns chemically explainable patterns among peak pairs in the spectrum data, and it can augment peaks depending on their semantic context or even reconstruct lacking peaks of expected ions during its internal scoring mechanism. As a result, BoltzMatch achieved 50% and 33% more annotations on high- and low-resolution MS2 data than XCorr at a 0.1% false discovery rate in our benchmark; conversely, XCorr yielded the same number of spectrum annotations as BoltzMatch, albeit with 4-6 times more errors. In addition, BoltzMatch alone does yield 14% more annotations than Prosit (which runs with Percolator), and BoltzMatch with Percolator yields 32% more annotations than Prosit at 0.1% FDR level in our benchmark. Contact: akerteszfarkas@hse.ru Supporting information: Supplementary data are available at Bioinformatics online.",
                "authors": [
                    {
                        "name": "Kertesz-Farkas A."
                    },
                    {
                        "name": "Sulimov P."
                    },
                    {
                        "name": "Voronkova A."
                    }
                ],
                "date": "2020-03-31T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Annotation of tandem mass spectrometry data using stochastic neural networks in shotgun proteomics"
            },
            "pmid": "32207518"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        }
    ]
}
