
{
    "credit": [
        {
            "email": "vbur@iceht.forth.gr",
            "name": "Vassilios Burganos",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Protein modelling",
                    "uri": "http://edamontology.org/operation_0477"
                },
                {
                    "term": "Molecular model refinement",
                    "uri": "http://edamontology.org/operation_0322"
                },
                {
                    "term": "Molecular dynamics",
                    "uri": "http://edamontology.org/operation_2476"
                },
                {
                    "term": "Protein property calculation",
                    "uri": "http://edamontology.org/operation_0250"
                }
            ]
        }
    ],
    "labels": {
        "toolType": [
            "Script",
            "Workbench"
        ],
        "topic": [
            {
                "term": "Applied mathematics",
                "uri": "http://edamontology.org/topic_3569"
            },
            {
                "term": "Biotechnology",
                "uri": "http://edamontology.org/topic_3297"
            },
            {
                "term": "Bioengineering",
                "uri": "http://edamontology.org/topic_3398"
            },
            {
                "term": "Enzymes",
                "uri": "http://edamontology.org/topic_0821"
            },
            {
                "term": "Biophysics",
                "uri": "http://edamontology.org/topic_3306"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© 2016 Elsevier B.V. Two-layered hollow-fiber membrane bioreactors containing immobilized enzymes are investigated in this work at mesoscopic and macroscopic scales. Layer-by-layer reconstruction of the membrane in three dimensions is achieved using two different stochastic techniques that draw data only from electron microscopy images of the structure. The reconstructed layers are subsequently used for the prediction of effective transport properties through the numerical solution of the relevant transport equations. The methodology is used for the investigation of hydrolysis of lactose, employing a convective diffusion and reaction macroscopic model. Direct comparison of model predictions with experimental data from the literature reveals a good agreement, provided that one uses the effective transport coefficients that are calculated from the reconstruction process. A parametric investigation of the hydrolysis process and its efficiency was conducted. The three-dimensional reconstructions are also used for the modeling of the hydrolysis of lactose at the pore scale, taking into account mass transport limitations and applying the same hydrolysis kinetics as in the macroscopic model. The agreement was quite satisfactory. Among the advantages of the pore scale approach that is formulated here is its ability to correlate pore structure details with the performance of the lactose hydrolysis process at the inevitable expense of computational resources.",
            "authors": [
                "Bali N.",
                "Petsi A.J.",
                "Skouras E.D.",
                "Burganos V.N."
            ],
            "cit_count": 2,
            "doi": "10.1016/j.memsci.2016.11.013",
            "journal": "Journal of Membrane Science",
            "title": "Three-dimensional reconstruction of bioactive membranes and pore-scale simulation of enzymatic reactions: The case of lactose hydrolysis",
            "type": "Primary",
            "year": "2017-02-15"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:3dmem-enzyme",
        "biotoolsID": "3dmem-enzyme",
        "description": "This is an in-house code of the FORTH/ICE-HT Laboratory of Simulation of Advanced Materials and Processes, Patras, Greece, providing a reliable 3D reconstruction and simulation of a membrane bioreactor for lactose hydrolysis with immobilized enzymes. The membrane model is coupled to a macroscopic model of a single membrane fiber unit to produce lactose concentration profiles, lactose consumption predictions, and performance index estimates.",
        "homepage": "http://www.iceht.forth.gr/staff/burganos.html",
        "name": "3DMem-enzyme"
    }
}