{
    "additionDate": "2020-01-14T09:52:33Z",
    "biotoolsCURIE": "biotools:ribosome_profiling",
    "biotoolsID": "ribosome_profiling",
    "confidence_flag": "tool",
    "description": "Computational methods for ribosome profiling data analysis.\n\nRibosome Profiling Data Analysis: from BAM to Data Representation and Interpretation.\n\nStarting with a BAM file, this package provides the necessary functions for quality assessment, read start position recalibration, the counting of reads on CDS, 3'UTR, and 5'UTR, plotting of count data: pairs, log fold-change, codon frequency and coverage assessment, principal component analysis on codon coverage.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Principal component visualisation",
                    "uri": "http://edamontology.org/operation_2939"
                },
                {
                    "term": "Differential gene expression analysis",
                    "uri": "http://edamontology.org/operation_3223"
                },
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                }
            ]
        }
    ],
    "homepage": "http://bioconductor.org/packages/release/bioc/html/RiboProfiling.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-01-15T19:34:54Z",
    "license": "GPL-3.0",
    "name": "ribosome profiling",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1002/WRNA.1577",
            "metadata": {
                "abstract": "© 2019 Wiley Periodicals, Inc.Since the introduction of the ribosome profiling technique in 2009 its popularity has greatly increased. It is widely used for the comprehensive assessment of gene expression and for studying the mechanisms of regulation at the translational level. As the number of ribosome profiling datasets being produced continues to grow, so too does the need for reliable software that can provide answers to the biological questions it can address. This review describes the computational methods and tools that have been developed to analyze ribosome profiling data at the different stages of the process. It starts with initial routine processing of raw data and follows with more specific tasks such as the identification of translated open reading frames, differential gene expression analysis, or evaluation of local or global codon decoding rates. The review pinpoints challenges associated with each step and explains the ways in which they are currently addressed. In addition it provides a comprehensive, albeit incomplete, list of publicly available software applicable to each step, which may be a beneficial starting point to those unexposed to ribosome profiling analysis. The outline of current challenges in ribosome profiling data analysis may inspire computational biologists to search for novel, potentially superior, solutions that will improve and expand the bioinformatician's toolbox for ribosome profiling data analysis. This article is characterized under: Translation > Ribosome Structure/Function RNA Evolution and Genomics > Computational Analyses of RNA Translation > Translation Mechanisms Translation > Translation Regulation.",
                "authors": [
                    {
                        "name": "Kiniry S.J."
                    },
                    {
                        "name": "Michel A.M."
                    },
                    {
                        "name": "Baranov P.V."
                    }
                ],
                "citationCount": 10,
                "date": "2020-05-01T00:00:00Z",
                "journal": "Wiley Interdisciplinary Reviews: RNA",
                "title": "Computational methods for ribosome profiling data analysis"
            },
            "pmid": "31760685"
        }
    ],
    "topic": [
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Protein expression",
            "uri": "http://edamontology.org/topic_0108"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        }
    ],
    "validated": 1
}