{
    "additionDate": "2021-01-18T07:09:23Z",
    "biotoolsCURIE": "biotools:wintf",
    "biotoolsID": "wintf",
    "confidence_flag": "tool",
    "description": "A New Weighted Imputed Neighborhood-regularized Tri-factorization One-class Collaborative Filtering Algorithm.\n\nWeighted, Imputed, Neighbor-regularized matrix TriFactorization, WINTF.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Filtering",
                    "uri": "http://edamontology.org/operation_3695"
                },
                {
                    "term": "Gene regulatory network prediction",
                    "uri": "http://edamontology.org/operation_2437"
                },
                {
                    "term": "Imputation",
                    "uri": "http://edamontology.org/operation_3557"
                },
                {
                    "term": "Protein interaction prediction",
                    "uri": "http://edamontology.org/operation_2492"
                }
            ]
        }
    ],
    "homepage": "https://github.com/XieResearchGroup/WINTF",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2021-03-18T09:50:38Z",
    "name": "WINTF",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1109/TCBB.2020.2968442",
            "metadata": {
                "abstract": "© 2004-2012 IEEE.Identifying target genes of transcription factors (TFs) is crucial to understand transcriptional regulation. However, our understanding of genome-wide TF targeting profile is limited due to the cost of large-scale experiments and intrinsic complexity of gene regulation. Thus, computational prediction methods are useful to predict unobserved TF-gene associations. Here, we develop a new Weighted Imputed Neighborhood-regularized Tri-Factorization one-class collaborative filtering algorithm, WINTF. It predicts unobserved target genes for TFs using known but noisy, incomplete, and biased TF-gene associations and protein-protein interaction networks. Our benchmark study shows that WINTF significantly outperforms its counterpart matrix factorization-based algorithms and tri-factorization methods that do not include weight, imputation, and neighbor-regularization, for TF-gene association prediction. When evaluated by independent datasets, accuracy is 37.8 percent on the top 495 predicted associations, an enrichment factor of 4.19 compared with random guess. Furthermore, many predicted novel associations are supported by literature evidence. Although we only use canonical TF-gene interaction data, WINTF can directly be applied to tissue-specific data when available. Thus, WINTF provides a potentially useful framework to integrate multiple omics data for further improvement of TF-gene prediction and applications to other sparse and noisy biological data. The benchmark dataset and source code are freely available at https://github.com/XieResearchGroup/WINTF.",
                "authors": [
                    {
                        "name": "Lim H."
                    },
                    {
                        "name": "Xie L."
                    }
                ],
                "citationCount": 1,
                "date": "2021-01-01T00:00:00Z",
                "journal": "IEEE/ACM Transactions on Computational Biology and Bioinformatics",
                "title": "A New Weighted Imputed Neighborhood-Regularized Tri-Factorization One-Class Collaborative Filtering Algorithm: Application to Target Gene Prediction of Transcription Factors"
            },
            "pmcid": "PMC7382975",
            "pmid": "31995498"
        }
    ],
    "topic": [
        {
            "term": "Gene regulation",
            "uri": "http://edamontology.org/topic_0204"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ]
}
