{
    "additionDate": "2017-08-03T18:51:11Z",
    "biotoolsCURIE": "biotools:metatreemap",
    "biotoolsID": "metatreemap",
    "credit": [
        {
            "email": "taylor@riken.jp",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://metasystems.riken.jp/contact"
        }
    ],
    "description": "Visualize phylogenic trees where each species (node) has a number of reads (quantity) that map on the reference genome of this species. Each species is represented by a rectangle and its area is proportional to the number of assigned reads. The final figure is nested rectangles representing tree branches.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://metasystems.riken.jp/visualization/treemap/html/documentation.htm"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Phylogenetic tree visualisation",
                    "uri": "http://edamontology.org/operation_0567"
                }
            ]
        }
    ],
    "homepage": "http://metasystems.riken.jp/visualization/treemap/index.htm",
    "language": [
        "JavaScript"
    ],
    "lastUpdate": "2018-12-10T12:58:58Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/metatreemap-an-alternative-visualization-method-for-displaying-metagenomic-phylogenic-trees.html"
        }
    ],
    "name": "MetaTreeMap",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "© 2016 Hebrard, Taylor. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited. Metagenomic samples can contain hundreds or thousands of different species. The most common method to identify these species is to sequence the samples and then classify the reads to nodes along a phylogenic tree. Linear representations of trees with so many nodes face legibility issues. In addition, such views are not optimal for appreciating the read quantity assigned to each node. The problem is exaggerated when comparison between multiple samples is needed. MetaTreeMap adapts a visualization method that addresses these weaknesses. The tree is represented by nested rectangles that illustrate the number or percentage of assigned reads. MetaTreeMap implements various options specific to phylogenic trees that allow for quick overview and investigation of the information. More generally, the goal of this software is to provide the user with the ability to easily display phylogenic trees based on various quantities assigned to the nodes, such as read number, percentage or other values.",
                "authors": [
                    {
                        "name": "Hebrard M."
                    },
                    {
                        "name": "Taylor T.D."
                    }
                ],
                "citationCount": 2,
                "date": "2016-06-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "Metatreemap: An alternative visualization method for displaying metagenomic phylogenic trees"
            },
            "pmid": "27336370"
        }
    ],
    "toolType": [
        "Web service"
    ],
    "topic": [
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        },
        {
            "term": "Phylogeny",
            "uri": "http://edamontology.org/topic_0084"
        },
        {
            "term": "Microbiology",
            "uri": "http://edamontology.org/topic_3301"
        }
    ],
    "validated": 1
}