{
    "additionDate": "2018-05-06T15:10:21Z",
    "biotoolsCURIE": "biotools:occupeak",
    "biotoolsID": "occupeak",
    "credit": [
        {
            "email": "info@hfrc.nl",
            "name": "Support",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "ChIP-Seq Peak Calling Based on Internal Background Modelling.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://www.hartfaalcentrum.nl/index.php?main=files&fileName=ManualOccuPeak_V2.pdf&description=Occupeak%20manual&sub=ManualOccuPeak_V2"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Peak calling",
                    "uri": "http://edamontology.org/operation_3222"
                }
            ]
        }
    ],
    "homepage": "http://www.hartfaalcentrum.nl/index.php?main=files&fileName=ManualOccuPeak_V2.pdf&description=Occupeak%20manual&sub=ManualOccuPeak_V2",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2018-12-10T12:58:57Z",
    "name": "OccuPeak",
    "operatingSystem": [
        "Linux",
        "Windows"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PONE.0099844",
            "metadata": {
                "abstract": "ChIP-seq has become a major tool for the genome-wide identification of transcription factor binding or histone modification sites. Most peak-calling algorithms require input control datasets to model the occurrence of background reads to account for local sequencing and GC bias. However, the GC-content of reads in Input-seq datasets deviates significantly from that in ChIP-seq datasets. Moreover, we observed that a commonly used peak calling program performed equally well when the use of a simulated uniform background set was compared to an Input-seq dataset. This contradicts the assumption that input control datasets are necessary to fatefully reflect the background read distribution. Because the GC-content of the abundant single reads in ChIP-seq datasets is similar to those of randomly sampled regions we designed a peak-calling algorithm with a background model based on overlapping single reads. The application, OccuPeak, uses the abundant low frequency tags present in each ChIP-seq dataset to model the background, thereby avoiding the need for additional datasets. Analysis of the performance of OccuPeak showed robust model parameters. Its measure of peak significance, the excess ratio, is only dependent on the tag density of a peak and the global noise levels. Compared to the commonly used peak-calling applications MACS and CisGenome, OccuPeak had the highest sensitivity in an enhancer identification benchmark test, and performed similar in an overlap tests of transcription factor occupation with DNase I hypersensitive sites and H3K27ac sites. Moreover, peaks called by OccuPeak were significantly enriched with cardiac disease-associated SNPs. OccuPeak runs as a standalone application and does not require extensive tweaking of parameters, making its use straightforward and user friendly. Availability: http://occupeak.hfrc.nl © 2014 de Boer et al.",
                "authors": [
                    {
                        "name": "Barnett P."
                    },
                    {
                        "name": "Christoffels V.M."
                    },
                    {
                        "name": "De Boer B.A."
                    },
                    {
                        "name": "Ruijter J.M."
                    },
                    {
                        "name": "Van Den Boogaard M."
                    },
                    {
                        "name": "Van Duijvenboden K."
                    }
                ],
                "citationCount": 7,
                "date": "2014-06-17T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "OccuPeak: ChIP-seq peak calling based on internal background modelling"
            },
            "pmcid": "PMC4061025",
            "pmid": "24936875"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "ChIP-seq",
            "uri": "http://edamontology.org/topic_3169"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ],
    "validated": 1
}
