{
    "additionDate": "2018-10-14T21:22:23Z",
    "biotoolsCURIE": "biotools:neuroncyto_ii",
    "biotoolsID": "neuroncyto_ii",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://sites.google.com/site/neuroncyto/contact-your-intructor"
        }
    ],
    "description": "NeuronCyto II is an interactive and user‐friendly software package for automatic neurite quantification.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://docs.google.com/viewer?a=v&pid=sites&srcid=ZGVmYXVsdGRvbWFpbnxuZXVyb25jeXRvfGd4OjIyMGM5OGI5OTEzMjYwODE"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                }
            ]
        }
    ],
    "homepage": "https://sites.google.com/site/neuroncyto/",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2018-12-10T12:59:01Z",
    "license": "Other",
    "name": "NeuronCyto II",
    "operatingSystem": [
        "Windows"
    ],
    "owner": "daniel_stefan",
    "publication": [
        {
            "doi": "10.1002/cyto.a.22872",
            "metadata": {
                "abstract": "© 2016 The Authors. Cytometry Part A Published by Wiley Periodicals, Inc. on behalf of ISAC.Microscopy is a fundamental technology driving new biological discoveries. Today microscopy allows a large number of images to be acquired using, for example, High Throughput Screening (HTS) and 4D imaging. It is essential to be able to interrogate these images and extract quantitative information in an automated fashion. In the context of neurobiology, it is important to automatically quantify the morphology of neurons in terms of neurite number, length, branching and complexity, etc. One major issue in quantification of neuronal morphology is the “crossover” problem where neurites cross and it is difficult to assign which neurite belongs to which cell body. In the present study, we provide a solution to the “crossover” problem, the software package NeuronCyto II. NeuronCyto II is an interactive and user-friendly software package for automatic neurite quantification. It has a well-designed graphical user interface (GUI) with only a few free parameters allowing users to optimize the software by themselves and extract relevant quantitative information routinely. Users are able to interact with the images and the numerical features through the Result Inspector. The processing of neurites without crossover was presented in our previous work. Our solution for the “crossover” problem is developed based on our recently published work with directed graph theory. Both methods are implemented in NeuronCyto II. The results show that our solution is able to significantly improve the reliability and accuracy of the neurons displaying “crossover.” NeuronCyto II is freely available at the website: https://sites.google.com/site/neuroncyto/, which includes user support and where software upgrades will also be placed in the future. © 2016 The Authors. Cytometry Part A Published by Wiley Periodicals, Inc. on behalf of ISAC.",
                "authors": [
                    {
                        "name": "Ong K.H."
                    },
                    {
                        "name": "De J."
                    },
                    {
                        "name": "Cheng L."
                    },
                    {
                        "name": "Ahmed S."
                    },
                    {
                        "name": "Yu W."
                    }
                ],
                "citationCount": 4,
                "date": "2016-08-01T00:00:00Z",
                "journal": "Cytometry Part A",
                "title": "NeuronCyto II: An automatic and quantitative solution for crossover neural cells in high throughput screening"
            },
            "pmcid": "PMC5089663",
            "pmid": "27233092",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Neurology",
            "uri": "http://edamontology.org/topic_3334"
        },
        {
            "term": "Light microscopy",
            "uri": "http://edamontology.org/topic_3385"
        },
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        }
    ],
    "validated": 1,
    "version": [
        "1.0"
    ]
}