{
    "additionDate": "2017-12-18T00:07:46Z",
    "biotoolsCURIE": "biotools:intreped",
    "biotoolsID": "intreped",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://sunflower.kuicr.kyoto-u.ac.jp/"
        }
    ],
    "description": "INTeractive dna REPair prEDiction is a collection of services for predicting properties relating to DNA repair. DNA repair is thought to exist in all organisms that have an active metabolism, and repair systems are crucial for repairing many types of DNA damage. External damage includes (but is not limited to) ionizing (UV) radiation, tobacco smoke, and chemical alteration. Examples of internal damage are DNA copying errors, oxygen byproducts resulting from metabolism, and hydrolysis.",
    "documentation": [
        {
            "type": "General",
            "url": "http://sunflower.kuicr.kyoto-u.ac.jp/~jbbrown/dnaRepairPrediction/v2/introduction.py"
        },
        {
            "type": "User manual",
            "url": "http://sunflower.kuicr.kyoto-u.ac.jp/~jbbrown/dnaRepairPrediction/v2/howtouse.py"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein sequence analysis",
                    "uri": "http://edamontology.org/operation_2479"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Prediction",
                    "uri": "http://edamontology.org/operation_2423"
                }
            ]
        }
    ],
    "homepage": "http://sunflower.kuicr.kyoto-u.ac.jp/~jbbrown/dnaRepairPrediction/v2/index.py",
    "lastUpdate": "2018-12-10T12:58:59Z",
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/intreped-2-0-dna-repair-protein-prediction-server.html"
        }
    ],
    "name": "INTREPED",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1186/1471-2105-10-25",
            "metadata": {
                "abstract": "Background: DNA repair is the general term for the collection of critical mechanisms which repair many forms of DNA damage such as methylation or ionizing radiation. DNA repair has mainly been studied in experimental and clinical situations, and relatively few information-based approaches to new extracting DNA repair knowledge exist. As a first step, automatic detection of DNA repair proteins in genomes via informatics techniques is desirable; however, there are many forms of DNA repair and it is not a straightforward process to identify and classify repair proteins with a single optimal method. We perform a study of the ability of homology and machine learning-based methods to identify and classify DNA repair proteins, as well as scan vertebrate genomes for the presence of novel repair proteins. Combinations of primary sequence polypeptide frequency, secondary structure, and homology information are used as feature information for input to a Support Vector Machine (SVM). Results: We identify that SVM techniques are capable of identifying portions of DNA repair protein datasets without admitting false positives; at low levels of false positive tolerance, homology can also identify and classify proteins with good performance. Secondary structure information provides improved performance compared to using primary structure alone. Furthermore, we observe that machine learning methods incorporating homology information perform best when data is filtered by some clustering technique. Analysis by applying these methodologies to the scanning of multiple vertebrate genomes confirms a positive correlation between the size of a genome and the number of DNA repair protein transcripts it is likely to contain, and simultaneously suggests that all organisms have a non-zero minimum number of repair genes. In addition, the scan result clusters several organisms' repair abilities in an evolutionarily consistent fashion. Analysis also identifies several functionally unconfirmed proteins that are highly likely to be involved in the repair process. A new web service, INTREPED, has been made available for the immediate search and annotation of DNA repair proteins in newly sequenced genomes. Conclusion: Despite complexity due to a multitude of repair pathways, combinations of sequence, structure, and homology with Support Vector Machines offer good methods in addition to existing homology searches for DNA repair protein identification and functional annotation. Most importantly, this study has uncovered relationships between the size of a genome and a genome's available repair repetoire, and offers a number of new predictions as well as a prediction service, both which reduce the search time and cost for novel repair genes and proteins. © 2009 Brown and Akutsu; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Brown J.B."
                    },
                    {
                        "name": "Akutsu T."
                    }
                ],
                "citationCount": 10,
                "date": "2009-01-20T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Identification of novel DNA repair proteins via primary sequence, secondary structure, and homology"
            },
            "type": "Primary"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Metabolism",
            "uri": "http://edamontology.org/topic_3407"
        },
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        }
    ],
    "validated": 1,
    "version": [
        "2.0"
    ]
}