{
    "additionDate": "2021-01-18T11:35:28Z",
    "biotoolsCURIE": "biotools:lipydomics",
    "biotoolsID": "lipydomics",
    "confidence_flag": "tool",
    "description": "A Python Package for Comprehensive Prediction of Lipid Collision Cross Sections and Retention Times and Analysis of Ion Mobility-Mass Spectrometry-Based Lipidomics Data.\n\nlipydomics is a Python package for performing standard lipidomics analysis protocols on data in an efficient and reproducible fashion.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Retention time prediction",
                    "uri": "http://edamontology.org/operation_3633"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/dylanhross/lipydomics",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-02-17T07:02:09Z",
    "license": "MIT",
    "name": "LiPydomics",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1021/ACS.ANALCHEM.0C02560",
            "metadata": {
                "abstract": "© Comprehensive profiling of lipid species in a biological sample, or lipidomics, is a valuable approach to elucidating disease pathogenesis and identifying biomarkers. Currently, a typical lipidomics experiment may track hundreds to thousands of individual lipid species. However, drawing biological conclusions requires multiple steps of data processing to enrich significantly altered features and confident identification of these features. Existing solutions for these data analysis challenges (i.e., multivariate statistics and lipid identification) involve performing various steps using different software applications, which imposes a practical limitation and potentially a negative impact on reproducibility. Hydrophilic interaction liquid chromatography-ion mobility-mass spectrometry (HILIC-IM-MS) has shown advantages in separating lipids through orthogonal dimensions. However, there are still gaps in the coverage of lipid classes in the literature. To enable reproducible and efficient analysis of HILIC-IM-MS lipidomics data, we developed an open-source Python package, LiPydomics, which enables performing statistical and multivariate analyses (\"stats\"module), generating informative plots (\"plotting\"module), identifying lipid species at different confidence levels (\"identification\"module), and carrying out all functions using a user-friendly text-based interface (\"interactive\"module). To support lipid identification, we assembled a comprehensive experimental database of m/z and CCS of 45 lipid classes with 23 classes containing HILIC retention times. Prediction models for CCS and HILIC retention time for 22 and 23 lipid classes, respectively, were trained using the large experimental data set, which enabled the generation of a large predicted lipid database with 145,388 entries. Finally, we demonstrated the utility of the Python package using Staphylococcus aureus strains that are resistant to various antimicrobials.",
                "authors": [
                    {
                        "name": "Cho J.H."
                    },
                    {
                        "name": "Hines K.M."
                    },
                    {
                        "name": "Ross D.H."
                    },
                    {
                        "name": "Xu L."
                    },
                    {
                        "name": "Zhang R."
                    }
                ],
                "citationCount": 2,
                "date": "2020-11-17T00:00:00Z",
                "journal": "Analytical Chemistry",
                "title": "LiPydomics: A Python Package for Comprehensive Prediction of Lipid Collision Cross Sections and Retention Times and Analysis of Ion Mobility-Mass Spectrometry-Based Lipidomics Data"
            },
            "pmid": "33119270"
        }
    ],
    "toolType": [
        "Command-line tool",
        "Library"
    ],
    "topic": [
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Endocrinology and metabolism",
            "uri": "http://edamontology.org/topic_3407"
        },
        {
            "term": "Lipids",
            "uri": "http://edamontology.org/topic_0153"
        },
        {
            "term": "Literature and language",
            "uri": "http://edamontology.org/topic_3068"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        }
    ]
}
