{"credit":[],"function":[{"operation":[{"term":"Essential dynamics","uri":"http://edamontology.org/operation_3891"},{"term":"Sequence trimming","uri":"http://edamontology.org/operation_3192"},{"term":"Taxonomic classification","uri":"http://edamontology.org/operation_3460"}]}],"labels":{"language":["Python"],"topic":[{"term":"DNA polymorphism","uri":"http://edamontology.org/topic_2885"},{"term":"Plant biology","uri":"http://edamontology.org/topic_0780"},{"term":"Phylogenetics","uri":"http://edamontology.org/topic_3293"}]},"link":[{"type":"REPOSITORY","url":"https://github.com/kevmu/CpnClassiPhyR"}],"publication":[{"abstract":"Phytoplasmas are plant-pathogenic bacteria that are associated with yield losses in many crop plants worldwide. Phytoplasma strain differentiation is accomplished using in silico restriction fragment length polymorphism (RFLP) analysis of 16S ribosomal RNA-encoding gene sequences, which has resulted in the definition of ribosomal groups and subgroups of phytoplasmas. Due to limitations associated with this approach, a complementary classification scheme was recently developed based on RFLP analysis of the single-copy, protein-encoding gene chaperonin-60 (cpn60). We present the CpnClassiPhyR, software that facilitates phytoplasma strain classification using both RFLP and automated phylogenetic analysis of cpn60 sequences. This software is available through a web interface at http://cpnclassiphyr.ca.","authors":["Muirhead K.","Perez-Lopez E.","Bahder B.W.","Hill J.E.","Dumonceaux T."],"cit_count":1,"doi":"10.1094/PDIS-03-19-0454-A","journal":"Plant disease","pmid":"31453748","title":"The CpnClassiPhyR Is a Resource for cpn60 Universal Target-Based Classification of Phytoplasmas","year":"2019-10-01"}],"summary":{"biotoolsCURIE":"biotools:CpnClassiPhyR","biotoolsID":"CpnClassiPhyR","description":"> CORRECT NAME OF TOOL COULD ALSO BE 'CpnClassiPhyR Resource' | The CpnClassiPhyR Is a Resource for cpn60 Universal Target-Based Classification of Phytoplasmas | Welcome to the CpnClassiPhyR Github Page! | a cpn60 universal target-based classification tool for phytoplasma | Phytoplasmas (‘Candidatus Phytoplasma’), first known as mycoplasma-like organisms, are wall-less, insect vectored bacteria that cause disease in more than a thousand different plant hosts, affecting weedy, ornamental and crop plants worldwide | Following the strategy previously used in the phytoplasma classification scheme based on the 16S rRNA gene, we developed a complementary, coherent system to classify phytoplasmas based on RFLP analysis of cpn60 UT sequences with seven endonucleases","homepage":"http://cpnclassiphyr.ca","name":"CpnClassiPhyR"}}