{
    "additionDate": "2024-03-18T17:32:33.335435Z",
    "biotoolsCURIE": "biotools:sam_clinical",
    "biotoolsID": "sam_clinical",
    "confidence_flag": "high",
    "credit": [
        {
            "email": "Zengzxeng@hnu.edu.cn",
            "name": "Xiangxiang Zeng",
            "typeEntity": "Person"
        }
    ],
    "description": "Self-adapting mixture prior to dynamically borrow information from historical data in clinical trials.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                },
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Formatting",
                    "uri": "http://edamontology.org/operation_0335"
                }
            ]
        }
    ],
    "homepage": "https://cran.r-project.org/web/packages/SAMprior",
    "language": [
        "C",
        "C++",
        "Python",
        "R"
    ],
    "lastUpdate": "2024-03-18T17:32:33.337930Z",
    "license": "BSD-3-Clause",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "http://project.org/package=SAMprior"
        },
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/pengyang0411/SAMprior"
        }
    ],
    "name": "SAM",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIB/BBAD320",
            "metadata": {
                "abstract": "The Sequence Alignment/Map (SAM) format file is the text file used to record alignment information. Alignment is the core of sequencing analysis, and downstream tasks accept mapping results for further processing. Given the rapid development of the sequencing industry today, a comprehensive understanding of the SAM format and related tools is necessary to meet the challenges of data processing and analysis. This paper is devoted to retrieving knowledge in the broad field of SAM. First, the format of SAM is introduced to understand the overall process of the sequencing analysis. Then, existing work is systematically classified in accordance with generation, compression and application, and the involved SAM tools are specifically mined. Lastly, a summary and some thoughts on future directions are provided.",
                "authors": [
                    {
                        "name": "Gong Y."
                    },
                    {
                        "name": "Liu Y."
                    },
                    {
                        "name": "Liu Y."
                    },
                    {
                        "name": "Shen X."
                    },
                    {
                        "name": "Song B."
                    },
                    {
                        "name": "Zeng X."
                    }
                ],
                "citationCount": 2,
                "date": "2023-09-01T00:00:00Z",
                "journal": "Briefings in Bioinformatics",
                "title": "Sequence Alignment/Map format: A comprehensive review of approaches and applications"
            },
            "pmid": "37668049"
        },
        {
            "doi": "10.1111/BIOM.13927",
            "metadata": {
                "abstract": "Mixture priors provide an intuitive way to incorporate historical data while accounting for potential prior-data conflict by combining an informative prior with a noninformative prior. However, prespecifying the mixing weight for each component remains a crucial challenge. Ideally, the mixing weight should reflect the degree of prior-data conflict, which is often unknown beforehand, posing a significant obstacle to the application and acceptance of mixture priors. To address this challenge, we introduce self-adapting mixture (SAM) priors that determine the mixing weight using likelihood ratio test statistics or Bayes factors. SAM priors are data-driven and self-adapting, favoring the informative (noninformative) prior component when there is little (substantial) evidence of prior-data conflict. Consequently, SAM priors achieve dynamic information borrowing. We demonstrate that SAM priors exhibit desirable properties in both finite and large samples and achieve information-borrowing consistency. Moreover, SAM priors are easy to compute, data-driven, and calibration-free, mitigating the risk of data dredging. Numerical studies show that SAM priors outperform existing methods in adopting prior-data conflicts effectively. We developed R package “SAMprior” and web application that are freely available at CRAN and www.trialdesign.org to facilitate the use of SAM priors.",
                "authors": [
                    {
                        "name": "Nie L."
                    },
                    {
                        "name": "Vallejo J."
                    },
                    {
                        "name": "Yang P."
                    },
                    {
                        "name": "Yuan Y."
                    },
                    {
                        "name": "Zhao Y."
                    }
                ],
                "citationCount": 1,
                "date": "2023-12-01T00:00:00Z",
                "journal": "Biometrics",
                "title": "SAM: Self-adapting mixture prior to dynamically borrow information from historical data in clinical trials"
            },
            "pmid": "37721513"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Preclinical and clinical studies",
            "uri": "http://edamontology.org/topic_3379"
        },
        {
            "term": "Rare diseases",
            "uri": "http://edamontology.org/topic_3325"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ]
}
