{
    "additionDate": "2018-07-21T16:01:05Z",
    "biotoolsCURIE": "biotools:autoroot",
    "biotoolsID": "autoroot",
    "credit": [
        {
            "email": "michael.pound@nottingham.ac.uk",
            "name": "Michael P. Pound",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Open-source software employing a novel image analysis approach to support fully-automated plant phenotyping.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://zenodo.org/record/60433#.W1NXONj7TOQ"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                }
            ]
        }
    ],
    "homepage": "https://zenodo.org/record/60433#.W1NXONj7TOQ",
    "lastUpdate": "2018-12-10T12:59:00Z",
    "license": "MIT",
    "name": "AutoRoot",
    "operatingSystem": [
        "Windows"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1186/s13007-017-0161-y",
            "metadata": {
                "abstract": "© 2017 The Author(s).Background: Computer-based phenotyping of plants has risen in importance in recent years. Whilst much software has been written to aid phenotyping using image analysis, to date the vast majority has been only semi-automatic. However, such interaction is not desirable in high throughput approaches. Here, we present a system designed to analyse plant images in a completely automated manner, allowing genuine high throughput measurement of root traits. To do this we introduce a new set of proxy traits. Results: We test the system on a new, automated image capture system, the Microphenotron, which is able to image many 1000s of roots/h. A simple experiment is presented, treating the plants with differing chemical conditions to produce different phenotypes. The automated imaging setup and the new software tool was used to measure proxy traits in each well. A correlation matrix was calculated across automated and manual measures, as a validation. Some particular proxy measures are very highly correlated with the manual measures (e.g. proxy length to manual length, r2 > 0.9). This suggests that while the automated measures are not directly equivalent to classic manual measures, they can be used to indicate phenotypic differences (hence the term, proxy). In addition, the raw discriminative power of the new proxy traits was examined. Principal component analysis was calculated across all proxy measures over two phenotypically-different groups of plants. Many of the proxy traits can be used to separate the data in the two conditions. Conclusion: The new proxy traits proposed tend to correlate well with equivalent manual measures, where these exist. Additionally, the new measures display strong discriminative power. It is suggested that for particular phenotypic differences, different traits will be relevant, and not all will have meaningful manual equivalent measures. However, approaches such as PCA can be used to interrogate the resulting data to identify differences between datasets. Select images can then be carefully manually inspected if the nature of the precise differences is required. We suggest such flexible measurement approaches are necessary for fully automated, high throughput systems such as the Microphenotron.",
                "authors": [
                    {
                        "name": "Pound M.P."
                    },
                    {
                        "name": "Fozard S."
                    },
                    {
                        "name": "Torres Torres M."
                    },
                    {
                        "name": "Forde B.G."
                    },
                    {
                        "name": "French A.P."
                    }
                ],
                "citationCount": 8,
                "date": "2017-03-08T00:00:00Z",
                "journal": "Plant Methods",
                "title": "AutoRoot: Open-source software employing a novel image analysis approach to support fully-automated plant phenotyping"
            },
            "pmcid": "PMC5341458",
            "pmid": "28286542"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Biological imaging",
            "uri": "http://edamontology.org/topic_3383"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        }
    ],
    "validated": 1
}