{
    "additionDate": "2017-12-18T00:09:31Z",
    "biotoolsCURIE": "biotools:motifscan",
    "biotoolsID": "motifscan",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://batzogloulab.stanford.edu/"
        }
    ],
    "description": "MotifScan is a non-parametric DNA motif scanning algorithm.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Motif scanning",
                    "uri": "http://edamontology.org/operation_0239"
                }
            ]
        }
    ],
    "homepage": "http://motifscan.stanford.edu/",
    "homepage_status": 1,
    "language": [
        "Python"
    ],
    "lastUpdate": "2018-12-10T12:58:57Z",
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/motifscan-dna-motif-scanning.html"
        }
    ],
    "name": "MotifScan",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1093/nar/gkl585",
            "metadata": {
                "abstract": "Given a set of known binding sites for a specific transcription factor, it is possible to build a model of the transcription factor binding site, usually called a motif model, and use this model to search for other sites that bind the same transcription factor. Typically, this search is performed using a position-specific scoring matrix (PSSM), also known as a position weight matrix. In this paper we analyze a set of eukaryotic transcription factor binding sites and show that there is extensive clustering of similar k-mers in eukaryotic motifs, owing to both functional and evolutionary constraints. The apparent limitations of probabilistic models in representing complex nucleotide dependencies lead us to a graph-based representation of motifs. When deciding whether a candidate k-mer is part of a motif or not, we base our decision not on how well the k-mer conforms to a model of the motif as a whole, but how similar it is to specific, known k-mers in the motif. We elucidate the reasons why we expect graph-based methods to perform well on motif data. Our MotifScan algorithm shows greatly improved performance over the prevalent PSSM-based method for the detection of eukaryotic motifs. © 2006 Oxford University Press.",
                "authors": [
                    {
                        "name": "Naughton B.T."
                    },
                    {
                        "name": "Fratkin E."
                    },
                    {
                        "name": "Batzoglou S."
                    },
                    {
                        "name": "Brutlag D.L."
                    }
                ],
                "citationCount": 19,
                "date": "2006-11-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "A graph-based motif detection algorithm models complex nucleotide dependencies in transcription factor binding sites"
            },
            "type": "Primary"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        }
    ],
    "validated": 1
}