{
    "additionDate": "2021-12-15T18:28:17.714804Z",
    "biotoolsCURIE": "biotools:chempix",
    "biotoolsID": "chempix",
    "confidence_flag": "tool",
    "credit": [
        {
            "name": "Todd J. Martínez",
            "orcidid": "https://orcid.org/0000-0002-4798-8947",
            "typeEntity": "Person"
        }
    ],
    "description": "ChemPix: an offline, hand-drawn hydrocarbon structure recognition tool using deep learning.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                },
                {
                    "term": "Small molecule design",
                    "uri": "http://edamontology.org/operation_4009"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://github.com/mtzgroup/ChemPixCH",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-12-15T18:28:17.717909Z",
    "license": "Apache-2.0",
    "name": "ChemPix",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1039/D1SC02957F",
            "metadata": {
                "abstract": "© The Royal Society of Chemistry 2021.Inputting molecules into chemistry software, such as quantum chemistry packages, currently requires domain expertise, expensive software and/or cumbersome procedures. Leveraging recent breakthroughs in machine learning, we develop ChemPix: an offline, hand-drawn hydrocarbon structure recognition tool designed to remove these barriers. A neural image captioning approach consisting of a convolutional neural network (CNN) encoder and a long short-term memory (LSTM) decoder learned a mapping from photographs of hand-drawn hydrocarbon structures to machine-readable SMILES representations. We generated a large auxiliary training dataset, based on RDKit molecular images, by combining image augmentation, image degradation and background addition. Additionally, a small dataset of ∼600 hand-drawn hydrocarbon chemical structures was crowd-sourced using a phone web application. These datasets were used to train the image-to-SMILES neural network with the goal of maximizing the hand-drawn hydrocarbon recognition accuracy. By forming a committee of the trained neural networks where each network casts one vote for the predicted molecule, we achieved a nearly 10 percentage point improvement of the molecule recognition accuracy and were able to assign a confidence value for the prediction based on the number of agreeing votes. The ensemble model achieved an accuracy of 76% on hand-drawn hydrocarbons, increasing to 86% if the top 3 predictions were considered.",
                "authors": [
                    {
                        "name": "Braun A."
                    },
                    {
                        "name": "Choi B."
                    },
                    {
                        "name": "Martinez T.J."
                    },
                    {
                        "name": "Thompson K."
                    },
                    {
                        "name": "Weir H."
                    },
                    {
                        "name": "Woodward A."
                    }
                ],
                "citationCount": 1,
                "date": "2021-08-21T00:00:00Z",
                "journal": "Chemical Science",
                "title": "ChemPix: automated recognition of hand-drawn hydrocarbon structures using deep learning"
            },
            "pmcid": "PMC8365825",
            "pmid": "34447555"
        }
    ],
    "topic": [
        {
            "term": "Chemistry",
            "uri": "http://edamontology.org/topic_3314"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Molecular biology",
            "uri": "http://edamontology.org/topic_3047"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
