
{
    "credit": [
        {
            "name": "ELIXIR-ITA-PADOVA",
            "typeEntity": "Institute",
            "typeRoles": [
                "Provider"
            ]
        },
        {
            "email": "silvio.tosatto@unipd.it",
            "name": "Silvio C.E. Tosatto",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://protein.bio.unipd.it/raphael/help.html"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Prediction and recognition",
                    "uri": "http://edamontology.org/operation_2423"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Structure analysis",
                "uri": "http://edamontology.org/topic_0081"
            }
        ]
    },
    "publication": [
        {
            "abstract": "Motivation: Repeat proteins form a distinct class of structures where folding is greatly simplified. Several classes have been defined, with solenoid repeats of periodicity between ca. 5 and 40 being the most challenging to detect. Such proteins evolve quickly and their periodicity may be rapidly hidden at sequence level. From a structural point of view, finding solenoids may be complicated by the presence of insertions or multiple domains. To the best of our knowledge, no automated methods are available to characterize solenoid repeats from structure. Results: Here we introduce RAPHAEL, a novel method for the detection of solenoids in protein structures. It reliably solves three problems of increasing difficulty: (1) recognition of solenoid domains, (2) determination of their periodicity and (3) assignment of insertions. RAPHAEL uses a geometric approach mimicking manual classification, producing several numeric parameters that are optimized for maximum performance. The resulting method is very accurate, with 89.5% of solenoid proteins and 97.2% of non-solenoid proteins correctly classified. RAPHAEL periodicities have a Spearman correlation coefficient of 0.877 against the manually established ones. A baseline algorithm for insertion detection in identified solenoids has a Q2 value of 79.8%, suggesting room for further improvement. RAPHAEL finds 1931 highly confident repeat structures not previously annotated as solenoids in the Protein Data Bank records. © 2012 The Author.",
            "authors": [
                "Walsh I.",
                "Sirocco F.G.",
                "Minervini G.",
                "Di Domenico T.",
                "Ferrari C.",
                "Tosatto S.C.E."
            ],
            "cit_count": 15,
            "doi": "10.1093/bioinformatics/bts550",
            "journal": "Bioinformatics",
            "title": "RAPHAEL: Recognition, periodicity and insertion assignment of solenoid protein structures",
            "type": "Primary",
            "year": "2012-12-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:raphael",
        "biotoolsID": "raphael",
        "description": "Protein Repeats. This server allows the analysis of one protein structure of interested to determine periodicity in protein structures.",
        "homepage": "http://protein.bio.unipd.it/raphael/",
        "name": "Raphael",
        "version": [
            "1.0"
        ]
    }
}