{
    "additionDate": "2019-11-14T18:11:33Z",
    "biotoolsCURIE": "biotools:NGSReadsTreatment",
    "biotoolsID": "NGSReadsTreatment",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "allanveras@ufpa.br",
            "name": "Adonney Allan de Oliveira Veras",
            "orcidid": "https://orcid.org/0000-0002-7227-0590",
            "typeEntity": "Person"
        }
    ],
    "description": "A Cuckoo Filter-based Tool for Removing Duplicate Reads in NGS Data | NGSReadsTreatment, a computational tool for the removal of duplicated reads in paired-end or single-end datasets. NGSReadsTreatment can handle reads from any platform with the same or different sequence lengths. Using the probabilistic structure Cuckoo Filter, the redundant reads are identified and removed by comparing the reads with themselves. Thus, no prerequisite is required beyond the set of reads. NGSReadsTreatment was compared with other redundancy removal tools in analyzing different sets of reads. The results demonstrated that NGSReadsTreatment was better than the other tools in both the amount of redundancies removed and the use of computational memory for all analyses performed",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence redundancy removal",
                    "uri": "http://edamontology.org/operation_0290"
                },
                {
                    "term": "Scaffolding",
                    "uri": "http://edamontology.org/operation_3216"
                },
                {
                    "term": "Chemical redundancy removal",
                    "uri": "http://edamontology.org/operation_3564"
                }
            ]
        }
    ],
    "homepage": "https://sourceforge.net/projects/ngsreadstreatment/",
    "lastUpdate": "2021-01-04T08:17:01Z",
    "name": "NGSReadsTreatment",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1038/S41598-019-48242-W",
            "metadata": {
                "abstract": "© 2019, The Author(s).The Next-Generation Sequencing (NGS) platforms provide a major approach to obtaining millions of short reads from samples. NGS has been used in a wide range of analyses, such as for determining genome sequences, analyzing evolutionary processes, identifying gene expression and resolving metagenomic analyses. Usually, the quality of NGS data impacts the final study conclusions. Moreover, quality assessment is generally considered the first step in data analyses to ensure the use of only reliable reads for further studies. In NGS platforms, the presence of duplicated reads (redundancy) that are usually introduced during library sequencing is a major issue. These might have a serious impact on research application, as redundancies in reads can lead to difficulties in subsequent analysis (e.g., de novo genome assembly). Herein, we present NGSReadsTreatment, a computational tool for the removal of duplicated reads in paired-end or single-end datasets. NGSReadsTreatment can handle reads from any platform with the same or different sequence lengths. Using the probabilistic structure Cuckoo Filter, the redundant reads are identified and removed by comparing the reads with themselves. Thus, no prerequisite is required beyond the set of reads. NGSReadsTreatment was compared with other redundancy removal tools in analyzing different sets of reads. The results demonstrated that NGSReadsTreatment was better than the other tools in both the amount of redundancies removed and the use of computational memory for all analyses performed. Available in https://sourceforge.net/projects/ngsreadstreatment/.",
                "authors": [
                    {
                        "name": "Gaia A.S.C."
                    },
                    {
                        "name": "de Sa P.H.C.G."
                    },
                    {
                        "name": "de Oliveira M.S."
                    },
                    {
                        "name": "Veras A.A.O."
                    }
                ],
                "citationCount": 1,
                "date": "2019-12-01T00:00:00Z",
                "journal": "Scientific Reports",
                "title": "NGSReadsTreatment – A Cuckoo Filter-based Tool for Removing Duplicate Reads in NGS Data"
            },
            "pmcid": "PMC6690869",
            "pmid": "31406180"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        }
    ],
    "validated": 1
}