{
    "additionDate": "2020-01-14T19:59:49Z",
    "biotoolsCURIE": "biotools:PySpacell",
    "biotoolsID": "PySpacell",
    "confidence_flag": "tool",
    "description": "PySpacell is a Python Package for Spatial Analysis of Cell Images.\n\nTechnologies such as microscopy, sequential hybridization, and mass spectrometry enable quantitative single-cell phenotypic and molecular measurements in situ. Deciphering spatial phenotypic and molecular effects on the single-cell level is one of the grand challenges and a key to understanding the effects of cell-cell interactions and microenvironment. However, spatial information is usually overlooked by downstream data analyses, which usually consider single-cell read-out values as independent measurements for further averaging or clustering, thus disregarding spatial locations. With this work, we attempt to fill this gap. We developed a toolbox that allows one to test for the presence of a spatial effect in microscopy images of adherent cells and estimate the spatial scale of this effect.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                },
                {
                    "term": "Microscope image visualisation",
                    "uri": "http://edamontology.org/operation_3552"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://pypi.org/project/pySpacell/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-01-13T18:25:33Z",
    "name": "PySpacell",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1002/CYTO.A.23955",
            "metadata": {
                "abstract": "© 2019 International Society for Advancement of CytometryTechnologies such as microscopy, sequential hybridization, and mass spectrometry enable quantitative single-cell phenotypic and molecular measurements in situ. Deciphering spatial phenotypic and molecular effects on the single-cell level is one of the grand challenges and a key to understanding the effects of cell–cell interactions and microenvironment. However, spatial information is usually overlooked by downstream data analyses, which usually consider single-cell read-out values as independent measurements for further averaging or clustering, thus disregarding spatial locations. With this work, we attempt to fill this gap. We developed a toolbox that allows one to test for the presence of a spatial effect in microscopy images of adherent cells and estimate the spatial scale of this effect. The proposed Python module can be used for any light microscopy images of cells as well as other types of single-cell data such as in situ transcriptomics or metabolomics. The input format of our package matches standard output formats from image analysis tools such as CellProfiler, Fiji, or Icy and thus makes our toolbox easy and straightforward to use, yet offering a powerful statistical approach for a wide range of applications. © 2019 International Society for Advancement of Cytometry.",
                "authors": [
                    {
                        "name": "Alexandrov T."
                    },
                    {
                        "name": "Genovesio A."
                    },
                    {
                        "name": "Rappez L."
                    },
                    {
                        "name": "Rose F."
                    },
                    {
                        "name": "Triana S.H."
                    }
                ],
                "citationCount": 2,
                "date": "2020-03-01T00:00:00Z",
                "journal": "Cytometry Part A",
                "title": "PySpacell: A Python Package for Spatial Analysis of Cell Images"
            },
            "pmid": "31872957"
        }
    ],
    "topic": [
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        }
    ],
    "validated": 1
}
