{
    "additionDate": "2020-01-14T19:44:38Z",
    "biotoolsCURIE": "biotools:ASRD",
    "biotoolsID": "ASRD",
    "confidence_flag": "tool",
    "description": "An online database for exploring over 2,000 Arabidopsis small RNA libraries.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                }
            ]
        }
    ],
    "homepage": "http://ipf.sustech.edu.cn/pub/asrd",
    "lastUpdate": "2021-01-14T16:04:08Z",
    "name": "ASRD",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1104/PP.19.00959",
            "metadata": {
                "abstract": "© 2020 American Society of Plant Biologists. All Rights Reserved.Small RNAs (sRNAs) play a wide range of important roles in plants, from maintaining genome stability and enhancing disease resistance to regulating developmental processes. Over the past decade, next-generation sequencing technologies have allowed us to explore the sRNA populations with unprecedented depth and accuracy. The community has accumulated a tremendous amount of sRNA sequencing (sRNA-seq) data from various genotypes, tissues, and treatments. However, it has become increasingly challenging to access these “big data” and extract useful information, particularly for researchers lacking sophisticated bioinformatics tools and expensive computational resources. Here, we constructed an online website, Arabidopsis Small RNA Database (ASRD, http://ipf.sustech.edu.cn/pub/asrd), that allows users to easily explore the information from publicly available Arabidopsis (Arabidopsis thaliana) sRNA libraries. Our database contains;2.3 billion sRNA reads, representing;250 million unique sequences from 2,024 sRNA-seq libraries. We downloaded the raw data for all libraries and reprocessed them with a unified pipeline so that the normalized abundance of any particular sRNA or the sum of abundances of sRNAs from a genic or transposable element region can be compared across all libraries. We also integrated an online Integrative Genomics Viewer browser into our Web site for convenient visualization. ASRD is a free, web-accessible, and user-friendly database that supports the direct query of over 2,000 Arabidopsis sRNA-seq libraries. We believe this resource will help plant researchers take advantage of the vast next-generation sequencing datasets available in the public domain.",
                "authors": [
                    {
                        "name": "Feng L."
                    },
                    {
                        "name": "Zhang F."
                    },
                    {
                        "name": "Zhang H."
                    },
                    {
                        "name": "Zhao Y."
                    },
                    {
                        "name": "Meyers B.C."
                    },
                    {
                        "name": "Zhai J."
                    }
                ],
                "citationCount": 2,
                "date": "2020-02-01T00:00:00Z",
                "journal": "Plant Physiology",
                "title": "An online database for exploring over 2,000 Arabidopsis small RNA Libraries1[open]"
            },
            "pmid": "31843802"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        }
    ],
    "validated": 1
}