{
    "additionDate": "2017-08-20T15:58:42Z",
    "biotoolsCURIE": "biotools:phasebook",
    "biotoolsID": "phasebook",
    "collectionID": [
        "Animal and Crop Genomics"
    ],
    "credit": [
        {
            "email": "tom.druet@ulg.ac.be",
            "name": "Tom Druet",
            "orcidid": "http://orcid.org/0000-0003-1637-1706",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Haplotyping programs package: LinkPHASE,HiddenPHASE, DualPHASE and DAGPHASE. The proposed methods work in two steps. First, haplotypes are reconstructed based on familial information (Mendelian segregation rules and linkage information) and next it fills in the gaps by applying a Hidden Markov Model (models from fastPHASE (Scheet and Stephens, 2006) or from Beagle (Browning and Browning, 2007)).",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://www.giga.ulg.ac.be/cms/c_55143/fr/phasebook-2-5-tar"
        }
    ],
    "editPermission": {
        "authors": [
            "animalandcropgenomics",
            "daniel_stefan"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Haplotype mapping",
                    "uri": "http://edamontology.org/operation_0487"
                }
            ]
        }
    ],
    "homepage": "http://www.giga.ulg.ac.be/cms/c_20703/en/unit-of-animal-genomics-software",
    "language": [
        "Fortran"
    ],
    "lastUpdate": "2019-09-04T08:38:24Z",
    "license": "GPL-3.0",
    "name": "PHASEBOOK",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "admin",
    "publication": [
        {
            "doi": "10.1534/genetics.109.108431",
            "metadata": {
                "abstract": "Faithful reconstruction of haplotypes from diploid marker data (phasing) is important for many kinds of genetic analyses, including mapping of trait loci, prediction of genomic breeding values, and identification of signatures of selection. In human genetics, phasing most often exploits population information (linkage disequilibrium), while in animal genetics the primary source of information is familial (Mendelian segregation and linkage). We herein develop and evaluate a method that simultaneously exploits both sources of information. It builds on hidden Markov models that were initially developed to exploit population information only.We demonstrate that the approach improves the accuracy of allele phasing as well as imputation of missing genotypes. Reconstructed haplotypes are assigned to hidden states that are shown to correspond to clusters of genealogically related chromosomes.We show that these cluster states can directly be used to fine map QTL. The method is computationally effective at handling large data sets based on high-density SNP panels. Copyright © 2010 by the Genetics Society of America.",
                "authors": [
                    {
                        "name": "Druet T."
                    },
                    {
                        "name": "Georges M."
                    }
                ],
                "citationCount": 161,
                "date": "2010-03-01T00:00:00Z",
                "journal": "Genetics",
                "title": "A hidden Markov model combining linkage and linkage disequilibrium information for haplotype reconstruction and quantitative trait locus fine mapping"
            },
            "pmcid": "PMC2845346",
            "pmid": "20008575",
            "type": [
                "Primary"
            ]
        },
        {
            "doi": "10.1093/bioinformatics/btu859",
            "metadata": {
                "abstract": "© The Author 2015. Published by Oxford University Press.Summary: Many applications in genetics require haplotype reconstruction. We present a phasing program designed for large half-sibs families (as observed in plant and animals) that is robust to genotyping and map errors. We demonstrate that it is more efficient than previous versions and other programs, particularly in the presence of genotyping errors.",
                "authors": [
                    {
                        "name": "Druet T."
                    },
                    {
                        "name": "Georges M."
                    }
                ],
                "citationCount": 17,
                "date": "2015-05-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "LINKPHASE3: An improved pedigree-based phasing algorithm robust to genotyping and map errors"
            },
            "pmid": "25573918",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Suite"
    ],
    "topic": [
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        }
    ],
    "validated": 1
}
