{
    "additionDate": "2017-08-03T18:50:40Z",
    "biotoolsCURIE": "biotools:massshiftfinder",
    "biotoolsID": "massshiftfinder",
    "collectionID": [
        "Proteomics"
    ],
    "credit": [
        {
            "email": "post@uib.no",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.uib.no/rg/probe"
        }
    ],
    "description": "Software tool for doing blind search using peptide mass fingerprints from two proteases with different cleavage specificities. The algorithm relies on overlapping peptides for the two proteases used, and can indicate both modifications and amino acid substitutions. The method can help restrict the area where the modification has occurred.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://services.cbu.uib.no/software//massShiftFinder"
        },
        {
            "type": [
                "Training material"
            ],
            "url": "http://services.cbu.uib.no/software/massShiftFinder/tutorial"
        }
    ],
    "editPermission": {
        "authors": [
            "proteomics.bio.tools"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein post-translation modification site prediction",
                    "uri": "http://edamontology.org/operation_0417"
                }
            ]
        }
    ],
    "homepage": "http://www.uib.no/en/rg/probe/65790/massshiftfinder",
    "language": [
        "Java"
    ],
    "lastUpdate": "2024-11-25T14:14:19.382020Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/massshiftfinder-1-09-blind-search-post-translational-modifications-amino-acid-substitutions.html"
        }
    ],
    "name": "MassShiftFinder",
    "operatingSystem": [
        "Linux",
        "Windows"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1186/1756-0500-1-130",
            "metadata": {
                "abstract": "Background. Mass spectrometric analysis of peptides is an essential part of protein identification and characterization, the latter meaning the identification of modifications and amino acid substitutions. There are two main approaches for characterization: (i) using a predefined set of possible modifications and substitutions or (ii) performing a blind search. The first option is straightforward, but can not detect modifications or substitutions outside the predefined set. A blind search does not have this limitation, and therefore has the potential of detecting both known and unknown modifications and substitutions. Combining the peptide mass fingerprints from two proteases result in overlapping sequence coverage of the protein, thereby offering alternative views of the protein and a novel way of indicating post-translational modifications and amino acid substitutions. Results. We have developed an algorithm and a software tool, MassShiftFinder, that performs a blind search using peptide mass fingerprints from two proteases with different cleavage specificities. The algorithm is based on equal mass shifts for overlapping peptides from the two proteases used, and can indicate both post-translational modifications and amino acid substitutions. In most cases it is possible to suggest a restricted area within the overlapping peptides where the mass shift can occur. The program is available at http://www.bioinfo.no/ software/massShiftFinder. Conclusion. Without any prior assumptions on their presence the described algorithm is able to indicate post-translational modifications or amino acid substitutions in MALDI-TOF experiments on identified proteins, and can thereby direct the involved peptides to subsequent TOF-TOF analysis. The algorithm is designed for detailed and low-throughput characterization of single proteins. © 2008 Barsnes et al; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Barsnes H."
                    },
                    {
                        "name": "Eidhammer I."
                    },
                    {
                        "name": "Mikalsen S.-O."
                    }
                ],
                "citationCount": 4,
                "date": "2008-12-01T00:00:00Z",
                "journal": "BMC Research Notes",
                "title": "Blind search for post-translational modifications and amino acid substitutions using peptide mass fingerprints from two proteases"
            },
            "pmcid": "PMC2653020",
            "pmid": "19099572"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Protein modifications",
            "uri": "http://edamontology.org/topic_0601"
        },
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        }
    ],
    "validated": 1
}
