
{
    "credit": [
        {
            "email": "spantano@pasteur.edu.uy",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://www.sirahff.com/2012/06/members.html"
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://www.sirahff.com/2012/06/sirah-forcefield.html"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Molecular dynamics simulation",
                    "uri": "http://edamontology.org/operation_2476"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "R",
            "Perl"
        ],
        "operatingSystem": [
            "Linux",
            "Mac"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Molecular modelling",
                "uri": "http://edamontology.org/topic_2275"
            },
            {
                "term": "Mapping",
                "uri": "http://edamontology.org/topic_0102"
            },
            {
                "term": "Cheminformatics",
                "uri": "http://edamontology.org/topic_2258"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://www.mybiosoftware.com/sirah-mapping-backmapping-and-visualization-of-coarse-grained-models.html"
        }
    ],
    "publication": [
        {
            "abstract": "© 2016 The Author 2016. Published by Oxford University Press. All rights reserved. Summary: Coarse-grained (CG) models reduce the cost of molecular dynamics simulations keeping the essence of molecular interactions. Still, the diversity of CG representations (sizes, connectivity, naming, etc.) hampers the handling and visualization of such models. SIRAH Tools comprises a set of utilities to convert all-atoms coordinates to arbitrary residue-based CG schemes, write GROMACS' topological information at any resolution into PSF format and a VMD plugin to visualize, analyze and retrieve pseudo-atomistic information from CG trajectories performed with the SIRAH force field. These tools facilitate the use of intricate CG force fields outside the small developer's community. Availability and implementation: Different utilities of SIRAH Tools are written in Perl, Tcl, or R. Documentation and source codes are freely distributed at http://www.sirahff.com.",
            "authors": [
                "Machado M.R.",
                "Pantano S."
            ],
            "cit_count": 20,
            "journal": "Bioinformatics",
            "pmid": "26773132",
            "title": "SIRAH tools: Mapping, backmapping and visualization of coarse-grained models",
            "year": "2016-05-15"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:sirah",
        "biotoolsID": "sirah",
        "description": "The tool comprises a set of utilities to convert all-atoms coordinates to arbitrary residue-based CG schemes, write GROMACS’ topological information at any resolution into PSF format and a VMD plugin to visualize, analyze and retrieve pseudo-atomistic information from CG trajectories performed with the force field.",
        "homepage": "http://www.sirahff.com/",
        "name": "SIRAH"
    }
}