
{
    "credit": [
        {
            "email": "fraley@stat.washington.edu",
            "name": "Chris Fraley",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "url": "http://bioconductor.org/packages/release/bioc/html/spotSegmentation.html"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://bioconductor/packages/release/bioc/src/contrib/spotSegmentation_1.48.0.tar.gz"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                }
            ]
        }
    ],
    "labels": {
        "collectionID": [
            "BioConductor"
        ],
        "license": "GPL-2.0",
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Command-line tool",
            "Library"
        ],
        "topic": [
            {
                "term": "Microarray experiment",
                "uri": "http://edamontology.org/topic_3518"
            },
            {
                "term": "Data quality management",
                "uri": "http://edamontology.org/topic_3572"
            }
        ]
    },
    "link": [
        {
            "type": "MIRROR",
            "url": "http://www.stat.washington.edu/fraley"
        }
    ],
    "publication": [
        {
            "abstract": "Motivation: Inner holes, artifacts and blank spots are common in microarray images, but current image analysis methods do not pay them enough attention. We propose a new robust model-based method for processing microarray images so as to estimate foreground and background intensities. The method starts with a very simple but effective automatic gridding method, and then proceeds in two steps. The first step applies model-based clustering to the distribution of pixel intensities, using the Bayesian Information Criterion (BIC) to choose the number of groups up to a maximum of three. The second step is spatial, finding the large spatially connected components in each cluster of pixels. The method thus combines the strengths of the histogram-based and spatial approaches. It deals effectively with inner holes in spots and with artifacts. It also provides a formal inferential basis for deciding when the spot is blank, namely when the BIC favors one group over two or three. Results: We apply our methods for gridding and segmentation to cDNA microarray images from an HIV infection experiment. In these experiments, our method had better stability across replicates than a fixed-circle segmentation method or the seeded region growing method in the SPOT software, without introducing noticeable bias when estimating the intensities of differentially expressed gene. © The Author 2005. Published by Oxford University Press. All rights reserved.",
            "authors": [
                "Li Q.",
                "Fraley C.",
                "Bumgarner R.E.",
                "Yeung K.Y.",
                "Raftery A.E."
            ],
            "cit_count": 77,
            "doi": "10.1093/bioinformatics/bti447",
            "journal": "Bioinformatics",
            "title": "Donuts, scratches and blanks: Robust model-based segmentation of microarray images",
            "type": "Primary",
            "year": "2005-06-15"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:spotsegmentation",
        "biotoolsID": "spotsegmentation",
        "description": "Spot segmentation via model-based clustering and gridding for blocks within microarray slides, as described in Li et al, Robust Model-Based Segmentation of Microarray Images, Technical Report no. 473, Department of Statistics, University of Washington.",
        "homepage": "http://bioconductor.org/packages/release/bioc/html/spotSegmentation.html",
        "name": "spotSegmentation",
        "version": [
            "1.48.0"
        ]
    }
}