{
    "additionDate": "2019-11-14T18:45:54Z",
    "biotoolsCURIE": "biotools:ensemblgenomes",
    "biotoolsID": "ensemblgenomes",
    "confidence_flag": "very low",
    "credit": [
        {
            "email": "yerlant@yahoo.com",
            "name": "Yerlan Turuspekov",
            "orcidid": "https://orcid.org/0000-0001-8590-1745",
            "typeEntity": "Person"
        }
    ],
    "description": "> VERY_LOW CONFIDENCE! | > COMMON LINK WITH (PUB. & NAME DIFFERENT) bio.tools/ensembl_genomes (ENSEMBLGENOMES.ORG) | > CORRECT NAME OF TOOL COULD ALSO BE 'six-rowed barley', 'Kazakhstan', 'six-rowed', 'barley' | Association mapping for agronomic traits in six-rowed spring barley from the USA harvested in Kazakhstan | Ensembl Genomes: Extending Ensembl across the taxonomic space | Ensembl Genomes Archive Sites Now Available | Ensembl Genomes now has a new set of archive sites from July 2018. These can be found at the following URLs",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                }
            ]
        }
    ],
    "homepage": "http://ensemblgenomes.org",
    "lastUpdate": "2019-11-14T18:45:54Z",
    "name": "ensemblgenomes",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PONE.0221064",
            "metadata": {
                "abstract": "© 2019 Almerekova et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.In barley, six-rowed barley is advantageous over two-rowed barley for feed due to the larger number of seeds per spike and the higher seed protein content. The growth of six-rowed barley is potentially important for breeding in agriculturally oriented countries, such as Kazakhstan. Nevertheless, until recently, very little attention was given to six-rowed barley in breeding projects in Kazakhstan, one of the largest countries in the world. In this study, phenotyping and single nucleotide polymorphism (SNP) genotyping data were generated from 275 accessions originating from six different breeding organizations in the USA as well as 9 accessions from Kazakhstan in field trials at six breeding institutions. The USA sixrowed barley was tested in comparison to local accessions over three years (2009-2011) based on analyses of key agronomic traits. It was determined that the average yield in the USA accessions in comparison to local lines showed heavier yield in all six tested sites. Principal Coordinate Analysis based on 1618 polymorphic SNP markers separated Kazakh lines from six USA barley origin groups based on PC1 (77.9%), and Montana lines from the remaining five USA groups based on PC2 (15.1%). A genome-wide association study based on eighteen field trials allowed the identification of 47 stable marker-trait associations (MTA) for ten agronomic traits, including key yield related characters such as yield per square meter, thousand grain weight, number of kernels per spike, and productive tillers. The comparison of chromosomal positions of identified MTA with positions of known genes and quantitative trait loci suggests that 25 out of those 47 MTAs are presumably novel. The analysis of 42 SNPs associated with 47 MTAs in the Ensemble genome annotation system (http://ensemblgenomes.org) suggested that 40 SNPs were in genic positions of the genome, as their sequences successfully aligned with corresponding Gen ID.",
                "authors": [
                    {
                        "name": "Almerekova S."
                    },
                    {
                        "name": "Sariev B."
                    },
                    {
                        "name": "Abugalieva A."
                    },
                    {
                        "name": "Chudinov V."
                    },
                    {
                        "name": "Sereda G."
                    },
                    {
                        "name": "Tokhetova L."
                    },
                    {
                        "name": "Ortaev A."
                    },
                    {
                        "name": "Tsygankov V."
                    },
                    {
                        "name": "Blake T."
                    },
                    {
                        "name": "Chao S."
                    },
                    {
                        "name": "Genievskaya Y."
                    },
                    {
                        "name": "Abugalieva S."
                    },
                    {
                        "name": "Turuspekov Y."
                    }
                ],
                "citationCount": 2,
                "date": "2019-08-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "Association mapping for agronomic traits in six-rowed spring barley from the USA harvested in Kazakhstan"
            },
            "pmcid": "PMC6690582",
            "pmid": "31404111"
        }
    ],
    "topic": [
        {
            "term": "Agricultural science",
            "uri": "http://edamontology.org/topic_3810"
        },
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "GWAS study",
            "uri": "http://edamontology.org/topic_3517"
        }
    ]
}