{"credit":[{"email":"seq-info@lanl.gov","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"https://www.hiv.lanl.gov/content/sequence/PRIMER_DESIGN/help.html"}],"function":[{"operation":[{"term":"Primer and probe design","uri":"http://edamontology.org/operation_2419"}]},{"operation":[{"term":"PCR primer design","uri":"http://edamontology.org/operation_0308"}]}],"labels":{"operatingSystem":["Linux","Windows","Mac"],"toolType":["Web application"],"topic":[{"term":"Sequence analysis","uri":"http://edamontology.org/topic_0080"},{"term":"Sequencing","uri":"http://edamontology.org/topic_3168"},{"term":"Probes and primers","uri":"http://edamontology.org/topic_0632"},{"term":"DNA","uri":"http://edamontology.org/topic_0654"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/primerdesign-m-multiple-alignment-based-multiple-primer-design-tool.html"}],"publication":[{"abstract":"© 2014 Published by Oxford University Press. Analyses of entire viral genomes or mtDNA requires comprehensive design of many primers across their genomes. Furthermore, simultaneous optimization of several DNA primer design criteria may improve overall experimental efficiency and downstream bioinformatic processing. To achieve these goals, we developed PrimerDesign-M. It includes several options for multiple-primer design, allowing researchers to efficiently design walking primers that cover long DNA targets, such as entire HIV-1 genomes, and that optimizes primers simultaneously informed by genetic diversity in multiple alignments and experimental design constraints given by the user. PrimerDesign-M can also design primers that include DNA barcodes and minimize primer dimerization. PrimerDesign-M finds optimal primers for highly variable DNA targets and facilitates design flexibility by suggesting alternative designs to adapt to experimental conditions.","authors":["Yoon H.","Leitner T."],"cit_count":11,"journal":"Bioinformatics","pmid":"25524896","title":"PrimerDesign-M: A multiple-alignment based multiple-primer design tool for walking across variable genomes","year":"2015-01-01"}],"summary":{"biotoolsCURIE":"biotools:primerdesign-m","biotoolsID":"primerdesign-m","description":"Primer design for highly variable sets of aligned sequences. It includes design requirements for next-generation sequences (NGS) including 454 sequences. It can also be used for primer and probe design for PCR, Sanger sequencing, and other systems with custom barcodes and DNA handles for universal primer annealing. The tool will design several alternative primer sets, whenever possible.","homepage":"http://www.hiv.lanl.gov/content/sequence/PRIMER_DESIGN/primer_design.html","name":"PrimerDesign-M"}}