{
    "accessibility": "Open access",
    "additionDate": "2022-03-15T13:02:20.417523Z",
    "biotoolsCURIE": "biotools:transtermhp",
    "biotoolsID": "transtermhp",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Carleton L Kingsford"
        },
        {
            "name": "Kunmi Ayanbule"
        },
        {
            "name": "Steven L Salzberg"
        }
    ],
    "description": "TransTermHP finds rho-independent transcription terminators in bacterial genomes. Each terminator found by the program is assigned a confidence value that estimates its probability of being a true terminator",
    "download": [
        {
            "note": "Source code for version 2.09 (updated Feb 28, 2011)",
            "type": "Source code",
            "url": "http://transterm.cbcb.umd.edu/transterm_hp_v2.09.zip"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Transcriptional regulatory element prediction",
                    "uri": "http://edamontology.org/operation_0438"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Score",
                        "uri": "http://edamontology.org/data_1772"
                    }
                }
            ]
        }
    ],
    "homepage": "http://transterm.cbcb.umd.edu/",
    "language": [
        "C++"
    ],
    "lastUpdate": "2022-03-15T13:02:20.419917Z",
    "name": "TransTermHP",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1186/gb-2007-8-2-r22",
            "metadata": {
                "abstract": "Background: In many prokaryotes, transcription of DNA to RNA is terminated by a thymine-rich stretch of DNA following a hairpin loop. Detecting such Rho-independent transcription terminators can shed light on the organization of bacterial genomes and can improve genome annotation. Previous computational methods to predict Rho-independent terminators have been slow or limited in the organisms they consider. Results: We describe TransTermHP, a new computational method to rapidly and accurately detect Rho-independent transcription terminators. We predict the locations of terminators in 343 prokaryotic genomes, representing the largest collection of predictions available. In Bacillus subtilis, we can detect 93% of known terminators with a false positive rate of just 6%, comparable to the best-known methods. Outside the Firmicutes division, we find that Rho-independent termination plays a large role in the Neisseria and Vibrio genera, the Pasteurellaceae (including the Haemophilus genus) and several other species. In Neisseria and Pasteurellaceae, terminator hairpins are frequently formed by closely spaced, complementary instances of exogenous DNA uptake signal sequences. We quantify the propensity for terminators to include these sequences. In the process, we provide the first discussion of potential uptake signals in Haemophilus ducreyi and Mannheimia succiniciproducens, and we discuss the preference for a particular configuration of uptake signal sequences within terminators. Conclusion: Our new fast and accurate method for detecting transcription terminators has allowed us to identify and analyze terminators in many new genomes and to identify DNA uptake signal sequences in several species where they have not been previously reported. Our software and predictions are freely available. © 2007 Kingsford et al.; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Ayanbule K."
                    },
                    {
                        "name": "Kingsford C.L."
                    },
                    {
                        "name": "Salzberg S.L."
                    }
                ],
                "citationCount": 355,
                "date": "2007-02-21T00:00:00Z",
                "journal": "Genome Biology",
                "title": "Rapid, accurate, computational discovery of Rho-independent transcription terminators illuminates their relationship to DNA uptake"
            },
            "pmcid": "PMC1852404",
            "pmid": "17313685"
        }
    ],
    "topic": [
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ]
}
