
{
    "credit": [
        {
            "name": "Contact form",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "https://www.nature.com/articles/s41598-018-22091-5/email/correspondent/c2/new"
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://www.marilisacortesi.com/"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                }
            ]
        }
    ],
    "labels": {
        "license": "GPL-2.0",
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Desktop application"
        ],
        "topic": [
            {
                "term": "Oncology",
                "uri": "http://edamontology.org/topic_2640"
            },
            {
                "term": "Cell biology",
                "uri": "http://edamontology.org/topic_2229"
            },
            {
                "term": "Biological imaging",
                "uri": "http://edamontology.org/topic_3383"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© 2018 The Author(s). The quantification of invasion and migration is an important aspect of cancer research, used both in the study of the molecular processes involved in this collection of diseases and the evaluation of the efficacy of new potential treatments. The transwell assay, while being one of the most widely used techniques for the evaluation of these characteristics, shows a high dependence on the operator's ability to correctly identify the cells and a low protocol standardization. Here we present I-AbACUS, a software tool specifically designed to aid the analysis of transwell assays that automatically and specifically recognizes cells in images of stained membranes and provides the user with a suggested cell count. A complete description of this instrument, together with its validation against the standard analysis technique for this assay is presented. Furthermore, we show that I-AbACUS is versatile and able to elaborate images containing cells with different morphologies and that the obtained results are less dependent on the operator and their experience. We anticipate that this instrument, freely available (Gnu Public Licence GPL v2) at www.marilisacortesi.com as a standalone application, could significantly improve the quantification of invasion and migration of cancer cells.",
            "authors": [
                "Cortesi M.",
                "Llamosas E.",
                "Henry C.E.",
                "Kumaran R.-Y.A.",
                "Ng B.",
                "Youkhana J.",
                "Ford C.E."
            ],
            "cit_count": 0,
            "doi": "10.1038/s41598-018-22091-5",
            "journal": "Scientific Reports",
            "title": "I-AbACUS: A Reliable Software Tool for the Semi-Automatic Analysis of Invasion and Migration Transwell Assays",
            "year": "2018-12-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:i-abacus",
        "biotoolsID": "i-abacus",
        "description": "Semi-Automatic Analysis of Invasion and Migration Transwell Assays.",
        "homepage": "http://www.marilisacortesi.com/",
        "name": "I-AbACUS"
    }
}