{
    "accessibility": "Open access (with restrictions)",
    "additionDate": "2021-05-05T11:11:25Z",
    "biotoolsCURIE": "biotools:b-cosfire-filters",
    "biotoolsID": "b-cosfire-filters",
    "collectionID": [
        "MATLAB",
        "File Exchange"
    ],
    "cost": "Free of charge (with restrictions)",
    "credit": [
        {
            "name": "Nicola Strisciuglio",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://www.mathworks.com/matlabcentral/profile/4308618-nicola-strisciuglio"
        }
    ],
    "description": "B-COSFIRE filters detect line at different orientations by combining the responses of DoG filters.",
    "download": [
        {
            "type": "Screenshot",
            "url": "https://www.mathworks.com//matlabcentral/mlc-downloads/downloads/submissions/49172/versions/7/screenshot.jpg"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Filtering",
                    "uri": "http://edamontology.org/operation_3695"
                },
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://www.mathworks.com/matlabcentral/fileexchange/49172-trainable-cosfire-filters-for-curvilinear-structure-delineation-in-images",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2021-05-22T13:12:49.110302Z",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "https://gitlab.com/nicstrisc/B-COSFIRE-MATLAB"
        }
    ],
    "name": "Trainable COSFIRE filters for curvilinear structure delineation in images",
    "operatingSystem": [
        "Windows",
        "Linux",
        "Mac"
    ],
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1016/j.media.2014.08.002",
            "metadata": {
                "abstract": "© 2014 Elsevier B.V.Retinal imaging provides a non-invasive opportunity for the diagnosis of several medical pathologies. The automatic segmentation of the vessel tree is an important pre-processing step which facilitates subsequent automatic processes that contribute to such diagnosis.We introduce a novel method for the automatic segmentation of vessel trees in retinal fundus images. We propose a filter that selectively responds to vessels and that we call B-COSFIRE with B standing for bar which is an abstraction for a vessel. It is based on the existing COSFIRE (Combination Of Shifted Filter Responses) approach. A B-COSFIRE filter achieves orientation selectivity by computing the weighted geometric mean of the output of a pool of Difference-of-Gaussians filters, whose supports are aligned in a collinear manner. It achieves rotation invariance efficiently by simple shifting operations. The proposed filter is versatile as its selectivity is determined from any given vessel-like prototype pattern in an automatic configuration process. We configure two B-COSFIRE filters, namely symmetric and asymmetric, that are selective for bars and bar-endings, respectively. We achieve vessel segmentation by summing up the responses of the two rotation-invariant B-COSFIRE filters followed by thresholding.The results that we achieve on three publicly available data sets (DRIVE: Se. =. 0.7655, Sp. =. 0.9704; STARE: Se. =. 0.7716, Sp. =. 0.9701; CHASE_DB1: Se. =. 0.7585, Sp. =. 0.9587) are higher than many of the state-of-the-art methods. The proposed segmentation approach is also very efficient with a time complexity that is significantly lower than existing methods.",
                "authors": [
                    {
                        "name": "Azzopardi G."
                    },
                    {
                        "name": "Strisciuglio N."
                    },
                    {
                        "name": "Vento M."
                    },
                    {
                        "name": "Petkov N."
                    }
                ],
                "citationCount": 403,
                "date": "2015-01-01T00:00:00Z",
                "journal": "Medical Image Analysis",
                "title": "Trainable COSFIRE filters for vessel delineation with application to retinal images"
            },
            "type": [
                "Other"
            ]
        },
        {
            "doi": "10.1007/s00138-016-0781-7",
            "metadata": {
                "abstract": "© 2016, The Author(s).The inspection of retinal fundus images allows medical doctors to diagnose various pathologies. Computer-aided diagnosis systems can be used to assist in this process. As a first step, such systems delineate the vessel tree from the background. We propose a method for the delineation of blood vessels in retinal images that is effective for vessels of different thickness. In the proposed method, we employ a set of B-COSFIRE filters selective for vessels and vessel-endings. Such a set is determined in an automatic selection process and can adapt to different applications. We compare the performance of different selection methods based upon machine learning and information theory. The results that we achieve by performing experiments on two public benchmark data sets, namely DRIVE and STARE, demonstrate the effectiveness of the proposed approach.",
                "authors": [
                    {
                        "name": "Strisciuglio N."
                    },
                    {
                        "name": "Azzopardi G."
                    },
                    {
                        "name": "Vento M."
                    },
                    {
                        "name": "Petkov N."
                    }
                ],
                "citationCount": 58,
                "date": "2016-11-01T00:00:00Z",
                "journal": "Machine Vision and Applications",
                "title": "Supervised vessel delineation in retinal fundus images with the automatic selection of B-COSFIRE filters"
            },
            "type": [
                "Other"
            ]
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Neurobiology",
            "uri": "http://edamontology.org/topic_3304"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Biology",
            "uri": "http://edamontology.org/topic_3070"
        }
    ],
    "version": [
        "1.4.0.0"
    ]
}