{
    "accessibility": "Open access",
    "additionDate": "2021-01-18T09:08:17Z",
    "biotoolsCURIE": "biotools:fgviewer",
    "biotoolsID": "fgviewer",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "Pora.Kim@uth.tmc.edu",
            "name": "Pora Kim",
            "orcidid": "https://orcid.org/0000-0002-8321-6864",
            "typeEntity": "Person"
        },
        {
            "email": "Xiaobo.Zhou@uth.tmc.edu",
            "name": "Xiaobo Zhou",
            "orcidid": "https://orcid.org/0000-0001-7191-6495",
            "typeEntity": "Person"
        },
        {
            "email": "yiyake96@qq.com",
            "name": "Ke Yiya",
            "typeEntity": "Person"
        }
    ],
    "description": "FGviewer is an online visualization tool for functional features of human fusion genes. FGviewer is aiming for the effective visualization of the functional features of fusion genes for better prioritization of therapeutic target selection. FGviewer provides functional feature annotations at four different levels: DNA-, RNA-, protein-, and pathogenic-levels. The same breakpoint line across four tiers will classify between FG involving or non-involving zone with multiple types of functional features. Those features include fusion mRNA and amino acid sequences based on the user’s breakpoint coordinates, swapped gene expression regulatory (i.e., transcription factor or miRNA binding sites), protein functional features (i.e., protein domains, protein- protein interactions, binding sites of all molecules, secondary structure level feature, etc.), clinically relevant variants, etc.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene functional annotation",
                    "uri": "http://edamontology.org/operation_3672"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                },
                {
                    "term": "miRNA target prediction",
                    "uri": "http://edamontology.org/operation_0463"
                }
            ]
        }
    ],
    "homepage": "https://ccsmweb.uth.edu/FGviewer",
    "lastUpdate": "2021-03-11T08:35:38Z",
    "name": "FGviewer",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/NAR/GKAA364",
            "metadata": {
                "abstract": "© The Author(s) 2020. Published by Oxford University Press on behalf of Nucleic Acids Research.Among the diverse location of the breakpoints (BPs) of structural variants (SVs), the breakpoints of fusion genes (FGs) are located in the gene bodies. This broken gene context provided the aberrant functional clues to study disease genesis. Many tumorigenic fusion genes have retained or lost functional or regulatory domains and these features impacted tumorigenesis. Full annotation of fusion genes aided by the visualization tool based on two gene bodies will be helpful to study the functional aspect of fusion genes. To date, a specialized tool with effective visualization of the functional features of fusion genes is not available. In this study, we built FGviewer, a tool for visualizing functional features of human fusion genes, which is available at https://ccsmweb.uth.edu/FGviewer. FGviewer gets the input of fusion gene symbols, breakpoint information, or structural variants from whole-genome sequence (WGS) data. For any combination of gene pairs/breakpoints to be involved in fusion genes, the users can search the functional/regulatory aspect of the fusion gene in the three bio-molecular levels (DNA-, RNA-, and protein-levels) and one clinical level (pathogenic-level). FGviewer will be a unique online tool in disease research communities.",
                "authors": [
                    {
                        "name": "Kim P."
                    },
                    {
                        "name": "Yiya K."
                    },
                    {
                        "name": "Zhou X."
                    }
                ],
                "date": "2021-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "FGviewer: An online visualization tool for functional features of human fusion genes"
            },
            "pmcid": "PMC7319540",
            "pmid": "32421816"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "Whole genome sequencing",
            "uri": "http://edamontology.org/topic_3673"
        }
    ]
}
