{
    "additionDate": "2017-12-18T00:03:56Z",
    "biotoolsCURIE": "biotools:bfrm",
    "biotoolsID": "bfrm",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.stat.duke.edu/research/software/west/bfrm/index.html"
        }
    ],
    "description": "Software for Bayesian Factor Regression Models – modelling and analysis of sparse latent factor models use in applications in pathway analysis and predictive modelling with large-scale gene expression data sets, with links to studies in gene expression analysis.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://www2.stat.duke.edu/research/software/west/bfrm/examples.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Pathway or network analysis",
                    "uri": "http://edamontology.org/operation_2497"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Gene expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                }
            ]
        }
    ],
    "homepage": "http://www.stat.duke.edu/research/software/west/bfrm/",
    "homepage_status": 1,
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2018-12-10T12:58:54Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/bfrm-2-0-bayesian-factor-regression-models.html"
        }
    ],
    "name": "BFRM",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1198/016214508000000869",
            "metadata": {
                "abstract": "We describe studies in molecular profiling and biological pathway analysis that use sparse latent factor and regression models for microarray gene expression data. We discuss breast cancer applications and key aspects of the modeling and computational methodology. Our case studies aim to investigate and characterize heterogeneity of structure related to specific oncogenic pathways, as well as links between aggregate patterns in gene expression profiles and clinical biomarkers. Based on the metaphor of statistically derived \"factors\" as representing biological \"subpathway\" structure, we explore the decomposition of fitted sparse factor models into pathway subcomponents and investigate how these components overlay multiple aspects of known biological activity. Our methodology is based on sparsity modeling of multivariate regression, ANOVA, and latent factor models, as well as a class of models that combines all components. Hierarchical sparsity priors address questions of dimension reduction and multiple comparisons, as well as scalability of the methodology. The models include practically relevant non-Gaussian/nonparametric components for latent structure, underlying often quite complex non-Gaussianity in multivariate expression patterns. Model search and fitting are addressed through stochastic simulation and evolutionary stochastic search methods that are exemplified in the oncogenic pathway studies. Supplementary supporting material provides more details of the applications, as well as examples of the use of freely available software tools for implementing the methodology. © 2008 American Statistical Association.",
                "authors": [
                    {
                        "name": "Carvalho C.M."
                    },
                    {
                        "name": "Chang J."
                    },
                    {
                        "name": "Lucas J.E."
                    },
                    {
                        "name": "Nevins J.R."
                    },
                    {
                        "name": "Wang Q."
                    },
                    {
                        "name": "West M."
                    }
                ],
                "citationCount": 255,
                "date": "2008-12-01T00:00:00Z",
                "journal": "Journal of the American Statistical Association",
                "title": "High-dimensional sparse factor modeling: Applications in gene expression genomics"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Systems biology",
            "uri": "http://edamontology.org/topic_2259"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ],
    "validated": 1,
    "version": [
        "2.0"
    ]
}