{"credit":[{"email":"juan.prada_salcedo@uni-wuerzburg.de","name":"Juan Prada","typeEntity":"Person","typeRoles":["Primary contact"]},{"email":"Blum_R@UKW.de","name":"Robert Blum","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"https://github.com/jpits30/NeuronActivityTool"},{"url":"https://www.biozentrum.uni-wuerzburg.de/fileadmin/07030400/computing/NACubic_Data/NAcubic_User_Manual.pdf"}],"function":[{"operation":[{"term":"Image analysis","uri":"http://edamontology.org/operation_3443"}]}],"labels":{"language":["R"],"operatingSystem":["Linux","Windows","Mac"],"toolType":["Command-line tool"],"topic":[{"term":"Neurobiology","uri":"http://edamontology.org/topic_3304"},{"term":"Imaging","uri":"http://edamontology.org/topic_3382"},{"term":"Molecular interactions, pathways and networks","uri":"http://edamontology.org/topic_0602"}]},"publication":[{"abstract":"© 2018 Prada et al.Local and spontaneous calcium signals play important roles in neurons and neuronal networks. Spontaneous or cell-autonomous calcium signals may be difficult to assess because they appear in an unpredictable spatiotemporal pattern and in very small neuronal loci of axons or dendrites. We developed an open source bioinformatics tool for an unbiased assessment of calcium signals in x,y-t imaging series. The tool bases its algorithm on a continuous wavelet transform-guided peak detection to identify calcium signal candidates. The highly sensitive calcium event definition is based on identification of peaks in 1D data through analysis of a 2D wavelet transform surface. For spatial analysis, the tool uses a grid to separate the x,y-image field in independently analyzed grid windows. A document containing a graphical summary of the data is automatically created and displays the loci of activity for a wide range of signal intensities. Furthermore, the number of activity events is summed up to create an estimated total activity value, which can be used to compare different experimental situations, such as calcium activity before or after an experimental treatment. All traces and data of active loci become documented. The tool can also compute the signal variance in a sliding window to visualize activity-dependent signal fluctuations. We applied the calcium signal detector to monitor activity states of cultured mouse neurons. Our data show that both the total activity value and the variance area created by a sliding window can distinguish experimental manipulations of neuronal activity states. Notably, the tool is powerful enough to compute local calcium events and ‘signal-close-to-noise’ activity in small loci of distal neurites of neurons, which remain during pharmacological blockade of neuronal activity with inhibitors such as tetrodotoxin, to block action potential firing, or inhibitors of ionotropic glutamate receptors. The tool can also offer information about local homeostatic calcium activity events in neurites.","authors":["Prada J.","Sasi M.","Martin C.","Jablonka S.","Dandekar T.","Blum R."],"cit_count":3,"doi":"10.1371/journal.pcbi.1006054","journal":"PLoS Computational Biology","title":"An open source tool for automatic spatiotemporal assessment of calcium transients and local ‘signal-close-to-noise’ activity in calcium imaging data","type":"Primary","year":"2018-03-01"}],"summary":{"biotoolsCURIE":"biotools:neuronactivitytool","biotoolsID":"neuronactivitytool","description":"tool to automatically extract, count, and localize calcium signals from the whole x,y-t image series. The tool is useful for an unbiased comparison of activity states of neurons, helps to assess local calcium transients, and even visualizes local homeostatic calcium activity.","homepage":"https://www.biozentrum.uni-wuerzburg.de/bioinfo/computing/neuralactivitycubic/","name":"NeuronActivityTool"}}