{
    "additionDate": "2020-01-14T19:48:11Z",
    "biotoolsCURIE": "biotools:PhySigs",
    "biotoolsID": "PhySigs",
    "confidence_flag": "tool",
    "description": "Phylogenetic Inference of Mutational Signature Dynamics.\n\nPhylogenetic inference of exposures of mutational signatures.\n\nThe input to PhySigs is a phylogeny with nodes representing clones in a patient tumor, a signature matrix containing the set of mutational signatures to use in the analysis, and a feature matrix for the set of mutations introduced in each clone. In particular, the mutational categories in the feature matrix should correspond to the mutational categories used in the signature matrix. Currently, PhySigs supports the standard 96 mutational categories for SNVs for COSMIC V2 signatures",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Phylogenetic tree generation",
                    "uri": "http://edamontology.org/operation_0323"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/elkebir-group/PhySigs",
    "lastUpdate": "2020-12-05T10:37:15.596329Z",
    "name": "PhySigs",
    "owner": "Pub2Tools",
    "publication": [
        {
            "metadata": {
                "abstract": "© 2019 The Authors.Distinct mutational processes shape the genomes of the clones comprising a tumor. These processes result in distinct mutational patterns, summarized by a small number of mutational signatures. Current analyses of clone-specific exposures to mutational signatures do not fully incorporate a tumor's evolutionary context, either inferring identical exposures for all tumor clones, or inferring exposures for each clone independently. Here, we introduce the Tree-constrained Exposure problem to infer a small number of exposure shifts along the edges of a given tumor phylogeny. Our algorithm, PhySigs, solves this problem and includes model selection to identify the number of exposure shifts that best explain the data. We validate our approach on simulated data and identify exposure shifts in lung cancer data, including at least one shift with a matching subclonal driver mutation in the mismatch repair pathway. Moreover, we show that our approach enables the prioritization of alternative phylogenies inferred from the same sequencing data. PhySigs is publicly available at https://github.com/elkebir-group/PhySigs.",
                "authors": [
                    {
                        "name": "Christensen S."
                    },
                    {
                        "name": "Leiserson M.D.M."
                    },
                    {
                        "name": "El-Kebir M."
                    }
                ],
                "date": "2020-01-01T00:00:00Z",
                "journal": "Pacific Symposium on Biocomputing",
                "title": "PhySigs: Phylogenetic inference of mutational signature dynamics"
            },
            "pmid": "31797599"
        }
    ],
    "topic": [
        {
            "term": "Phylogeny",
            "uri": "http://edamontology.org/topic_0084"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Exome sequencing",
            "uri": "http://edamontology.org/topic_3676"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ]
}