{"credit":[],"labels":{"topic":[{"term":"Gene expression","uri":"http://edamontology.org/topic_0203"},{"term":"Genotype and phenotype","uri":"http://edamontology.org/topic_0625"},{"term":"Human genetics","uri":"http://edamontology.org/topic_3574"},{"term":"Population genetics","uri":"http://edamontology.org/topic_3056"},{"term":"Workflows","uri":"http://edamontology.org/topic_0769"}]},"publication":[{"abstract":"© 2019 The AuthorsWe propose a computational workflow (I3) for intuitive integrative interpretation of complex genetic data mainly building on the self-organising principle. We illustrate the use in interpreting genetics of gene expression and understanding genetic regulators of protein phenotypes, particularly in conjunction with information from human population genetics and/or evolutionary history of human genes. We reveal that loss-of-function intolerant genes tend to be depleted of tissue-sharing genetics of gene expression in brains, and if highly expressed, have broad effects on the protein phenotypes studied. We suggest that this workflow presents a general solution to the challenge of complex genetic data interpretation. I3 is available at http://suprahex.r-forge.r-project.org/I3.html.","authors":["Tan Y.","Jiang L.","Wang K.","Fang H."],"cit_count":0,"doi":"10.1016/J.GPB.2018.10.006","journal":"Genomics, Proteomics and Bioinformatics","pmid":"31765831","title":"I3: A Self-organising Learning Workflow for Intuitive Integrative Interpretation of Complex Genetic Data","year":"2019-01-01"}],"summary":{"biotoolsCURIE":"biotools:I3","biotoolsID":"I3","description":"A Self-organising Learning Workflow for Intuitive Integrative Interpretation of Complex Genetic Data.\n\nIntuitive Integrative Interpretation (I3) of complex genetic data.\n\n3 Interpreting genetics of gene expression in brains.\n\n1 State Key Laboratory of Medical Genomics and Shanghai Institute of Hematology, Ruijin Hospital, Shanghai Jiao Tong University School of Medicine, Shanghai 200025, China","homepage":"http://suprahex.r-forge.r-project.org/I3.html","name":"I3"}}