{
    "additionDate": "2021-03-19T09:01:17Z",
    "biotoolsCURIE": "biotools:phenospace",
    "biotoolsID": "phenospace",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "jsegrestin@gmail.com",
            "name": "Jules Segrestin",
            "orcidid": "https://orcid.org/0000-0001-7661-6061",
            "typeEntity": "Person"
        }
    ],
    "description": "A Shiny application to visualize trait data in the phenotypic space of the global spectrum of plant form and function.\n\nPhenoSpace is a Shiny application – built using the Shiny R package – that helps users to manipulate and visualize data pertaining to the global spectrum of plant form and function.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Principal component visualisation",
                    "uri": "http://edamontology.org/operation_2939"
                },
                {
                    "term": "Spectral analysis",
                    "uri": "http://edamontology.org/operation_3214"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://shiny.cefe.cnrs.fr/PhenoSpace/",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-03-28T09:03:45Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/jsegrestin/phenospace"
        }
    ],
    "name": "PhenoSpace",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1002/ECE3.6928",
            "metadata": {
                "abstract": "© 2020 The Authors. Ecology and Evolution published by John Wiley & Sons LtdA recent analysis of variation in six major traits conducted on a large worldwide sample of vascular plant species showed that three-quarters of trait variation was captured by a two-dimensional global spectrum of plant form and function (“global spectrum” hereafter). We developed the PhenoSpace application, whose aim is to visualize and export the position of any individual/population/species in the phenotypic space of the global spectrum. PhenoSpace is a Shiny application that helps users to manipulate and visualize data pertaining to the global spectrum of plant form and function. It is freely accessible at the following URL: https://shiny.cefe.cnrs.fr/PhenoSpace/. PhenoSpace has three main functionalities. First, it allows users to visualize the phenotypic space of the global spectrum using different combinations of traits and growth forms. Second, trait data from any new user-defined dataset can be projected onto the phenotypic space of the global spectrum, provided that at least two of the six traits are available. Finally, figures produced and loadings of the imported data on the PCA axes can be downloaded, allowing users to conduct further analyses. PhenoSpace fulfills the practical goal of positioning plants in the phenotypic space of the global spectrum, making it possible to compare trait variation at any level of organization against the worldwide background. This serves a major aim of comparative plant ecology, which is to put specific sets of individuals, populations or species into a broader context, facilitating comparison and synthesis of results across different continents and environments using relevant indicators of plant design and function.",
                "authors": [
                    {
                        "name": "Segrestin J."
                    },
                    {
                        "name": "Sartori K."
                    },
                    {
                        "name": "Navas M.-L."
                    },
                    {
                        "name": "Kattge J."
                    },
                    {
                        "name": "Diaz S."
                    },
                    {
                        "name": "Garnier E."
                    }
                ],
                "citationCount": 1,
                "date": "2021-02-01T00:00:00Z",
                "journal": "Ecology and Evolution",
                "title": "PhenoSpace: A Shiny application to visualize trait data in the phenotypic space of the global spectrum of plant form and function"
            },
            "pmcid": "PMC7882932",
            "pmid": "33613986"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Ecology",
            "uri": "http://edamontology.org/topic_0610"
        },
        {
            "term": "Data visualisation",
            "uri": "http://edamontology.org/topic_0092"
        }
    ]
}