{
    "additionDate": "2020-01-14T09:51:01Z",
    "biotoolsCURIE": "biotools:cAMP_PKA",
    "biotoolsID": "cAMP_PKA",
    "confidence_flag": "very low",
    "description": "Computational Modeling Reveals Frequency Modulation of Calcium-cAMP/PKA Pathway in Dendritic Spines.\n\nDendritic spines are the primary excitatory postsynaptic sites that act as subcompartments of signaling. Ca2+ is often the first and most rapid signal in spines. Downstream of calcium, the cyclic adenosine monophosphate (cAMP) protein kinase A (PKA) pathway plays a critical role in the regulation of spine formation, morphological modifications, and ultimately, learning and memory. Although the dynamics of calcium are reasonably well-studied, calcium-induced cAMP PKA dynamics, particularly with respect to frequency modulation, are not fully explored. In this study, we present a well-mixed model for the dynamics of calcium-induced cAMP PKA dynamics in dendritic spines. The model is constrained using experimental observations in the literature.\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'dendritic spines', 'spines', 'well-mixed', 'calcium-induced'",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Pathway or network prediction",
                    "uri": "http://edamontology.org/operation_3439"
                },
                {
                    "term": "Neurite measurement",
                    "uri": "http://edamontology.org/operation_3450"
                }
            ]
        }
    ],
    "homepage": "https://github.com/donya26/cAMP-PKA-temporal.git",
    "language": [
        "Pascal"
    ],
    "lastUpdate": "2020-01-14T09:51:01Z",
    "name": "cAMP PKA",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1016/J.BPJ.2019.10.003",
            "metadata": {
                "abstract": "© 2019 Biophysical SocietyDendritic spines are the primary excitatory postsynaptic sites that act as subcompartments of signaling. Ca2+ is often the first and most rapid signal in spines. Downstream of calcium, the cyclic adenosine monophosphate (cAMP)/protein kinase A (PKA) pathway plays a critical role in the regulation of spine formation, morphological modifications, and ultimately, learning and memory. Although the dynamics of calcium are reasonably well-studied, calcium-induced cAMP/PKA dynamics, particularly with respect to frequency modulation, are not fully explored. In this study, we present a well-mixed model for the dynamics of calcium-induced cAMP/PKA dynamics in dendritic spines. The model is constrained using experimental observations in the literature. Further, we measured the calcium oscillation frequency in dendritic spines of cultured hippocampal CA1 neurons and used these dynamics as model inputs. Our model predicts that the various steps in this pathway act as frequency modulators for calcium, and the high frequency of calcium input is filtered by adenylyl cyclase 1 and phosphodiesterases in this pathway such that cAMP/PKA only responds to lower frequencies. This prediction has important implications for noise filtering and long-timescale signal transduction in dendritic spines. A companion manuscript presents a three-dimensional spatial model for the same pathway.",
                "authors": [
                    {
                        "name": "Ohadi D."
                    },
                    {
                        "name": "Schmitt D.L."
                    },
                    {
                        "name": "Calabrese B."
                    },
                    {
                        "name": "Halpain S."
                    },
                    {
                        "name": "Zhang J."
                    },
                    {
                        "name": "Rangamani P."
                    }
                ],
                "date": "2019-11-19T00:00:00Z",
                "journal": "Biophysical Journal",
                "title": "Computational Modeling Reveals Frequency Modulation of Calcium-cAMP/PKA Pathway in Dendritic Spines"
            },
            "pmid": "31668749"
        }
    ],
    "topic": [
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Literature and language",
            "uri": "http://edamontology.org/topic_3068"
        }
    ]
}