{
    "additionDate": "2020-01-09T18:03:00Z",
    "biotoolsCURIE": "biotools:iCite",
    "biotoolsID": "iCite",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "george.santangelo@nih.gov",
            "name": "George M. Santangelo",
            "orcidid": "https://orcid.org/0000-0002-7201-3164",
            "typeEntity": "Person"
        }
    ],
    "description": "A public access, broad coverage resource.\n\nNIH Office of Portfolio Analysis.\n\niCite is a tool to access a dashboard of bibliometrics for papers associated with a portfolio. Users type in a PubMed query or upload the PubMed IDs of articles of interest. iCite has three modules: Influence, Translation, and Open Citations.\n\niCite: Influence delivers metrics of scientific influence such as the Relative Citation Ratio (RCR), which is field- and time-adjusted, and benchmarked to NIH publications as the baseline. Read about how RCR is calculated at PLOS Biology.\n\nBulk data can be accessed at the iCite database snapshot repository",
    "documentation": [
        {
            "type": [
                "API documentation"
            ],
            "url": "https://icite.od.nih.gov/api"
        }
    ],
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                },
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                },
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                }
            ]
        }
    ],
    "homepage": "https://icite.od.nih.gov",
    "lastUpdate": "2020-12-11T08:56:09Z",
    "license": "Proprietary",
    "name": "iCite",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PBIO.3000385",
            "metadata": {
                "abstract": "© This is an open access article, free of all copyright, and may be freely reproduced, distributed, transmitted, modified, built upon, or otherwise used by anyone for any lawful purpose. The work is made available under the Creative Commons CC0 public domain dedication.Citation data have remained hidden behind proprietary, restrictive licensing agreements, which raises barriers to entry for analysts wishing to use the data, increases the expense of performing large-scale analyses, and reduces the robustness and reproducibility of the conclusions. For the past several years, the National Institutes of Health (NIH) Office of Portfolio Analysis (OPA) has been aggregating and enhancing citation data that can be shared publicly. Here, we describe the NIH Open Citation Collection (NIH-OCC), a public access database for biomedical research that is made freely available to the community. This dataset, which has been carefully generated from unrestricted data sources such as MedLine, PubMed Central (PMC), and CrossRef, now underlies the citation statistics delivered in the NIH iCite analytic platform. We have also included data from a machine learning pipeline that identifies, extracts, resolves, and disambiguates references from full-text articles available on the internet. Open citation links are available to the public in a major update of iCite (https://icite.od.nih.gov).",
                "authors": [
                    {
                        "name": "Ian Hutchins B."
                    },
                    {
                        "name": "Baker K.L."
                    },
                    {
                        "name": "Davis M.T."
                    },
                    {
                        "name": "Diwersy M.A."
                    },
                    {
                        "name": "Haque E."
                    },
                    {
                        "name": "Harriman R.M."
                    },
                    {
                        "name": "Hoppe T.A."
                    },
                    {
                        "name": "Leicht S.A."
                    },
                    {
                        "name": "Meyer P."
                    },
                    {
                        "name": "Santangelo G.M."
                    }
                ],
                "citationCount": 6,
                "date": "2019-01-01T00:00:00Z",
                "journal": "PLoS Biology",
                "title": "The NIH open citation collection: A public access, broad coverage resource"
            },
            "pmcid": "PMC6786512",
            "pmid": "31600197"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Zoology",
            "uri": "http://edamontology.org/topic_3500"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        },
        {
            "term": "Medicine",
            "uri": "http://edamontology.org/topic_3303"
        },
        {
            "term": "Preclinical and clinical studies",
            "uri": "http://edamontology.org/topic_3379"
        }
    ],
    "validated": 1
}