{
    "additionDate": "2020-01-14T09:17:02Z",
    "biotoolsCURIE": "biotools:LINCS_Data_Portal_2.0",
    "biotoolsID": "LINCS_Data_Portal_2.0",
    "confidence_flag": "tool",
    "description": "next generation access point for perturbation-response signatures.\n\nThe Library of Integrated Network-Based Cellular Signatures (LINCS) is an NIH Common Fund program with the goal of generating a large-scale and comprehensive catalogue of perturbation-response signatures by utilizing a diverse collection of perturbations across many model systems and assay types. The LINCS Data Portal (LDP) has been the primary access point for the compendium of LINCS data and has been widely utilized. Here, we report the first major update of LDP (http: lincsportal.ccs.miami.edu signatures) with substantial changes in the data architecture and APIs, a completely redesigned user interface, and enhanced curated metadata annotations to support more advanced, intuitive and deeper querying, exploration and analysis capabilities.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene-set enrichment analysis",
                    "uri": "http://edamontology.org/operation_2436"
                },
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                }
            ]
        }
    ],
    "homepage": "http://lincsportal.ccs.miami.edu/signatures",
    "lastUpdate": "2021-01-14T08:24:47Z",
    "name": "LINCS Data Portal 2.0",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/NAR/GKZ1023",
            "metadata": {
                "abstract": "© 2019 The Author(s) 2019. Published by Oxford University Press on behalf of Nucleic Acids Research.The Library of Integrated Network-Based Cellular Signatures (LINCS) is an NIH Common Fund program with the goal of generating a large-scale and comprehensive catalogue of perturbation-response signatures by utilizing a diverse collection of perturbations across many model systems and assay types. The LINCS Data Portal (LDP) has been the primary access point for the compendium of LINCS data and has been widely utilized. Here, we report the first major update of LDP (http://lincsportal.ccs.miami.edu/signatures) with substantial changes in the data architecture and APIs, a completely redesigned user interface, and enhanced curated metadata annotations to support more advanced, intuitive and deeper querying, exploration and analysis capabilities. The cornerstone of this update has been the decision to reprocess all high-level LINCS datasets and make them accessible at the data point level enabling users to directly access and download any subset of signatures across the entire library independent from the originating source, project or assay. Access to the individual signatures also enables the newly implemented signature search functionality, which utilizes the iLINCS platform to identify conditions that mimic or reverse gene set queries. A newly designed query interface enables global metadata search with autosuggest across all annotations associated with perturbations, model systems, and signatures.",
                "authors": [
                    {
                        "name": "Chung C."
                    },
                    {
                        "name": "Clarke D.J.B."
                    },
                    {
                        "name": "Cooper D."
                    },
                    {
                        "name": "Evangelista J.E."
                    },
                    {
                        "name": "Fazel-Najafabadi M."
                    },
                    {
                        "name": "Koleti A."
                    },
                    {
                        "name": "Lachmann A."
                    },
                    {
                        "name": "Ma'Ayan A."
                    },
                    {
                        "name": "Medvedovic M."
                    },
                    {
                        "name": "Pilarczyk M."
                    },
                    {
                        "name": "Schurer S.C."
                    },
                    {
                        "name": "Stathias V."
                    },
                    {
                        "name": "Terryn R."
                    },
                    {
                        "name": "Turner J."
                    },
                    {
                        "name": "Umeano A."
                    },
                    {
                        "name": "Vidovic D."
                    }
                ],
                "citationCount": 22,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "LINCS Data Portal 2.0: Next generation access point for perturbation-response signatures"
            },
            "pmid": "31701147"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Data architecture, analysis and design",
            "uri": "http://edamontology.org/topic_3365"
        },
        {
            "term": "Database management",
            "uri": "http://edamontology.org/topic_3489"
        },
        {
            "term": "Drug discovery",
            "uri": "http://edamontology.org/topic_3336"
        }
    ],
    "validated": 1
}
