{"credit":[{"name":"Contact Form","typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://feedback.wishartlab.com/?site=PHAST"}],"documentation":[{"type":"GENERAL","url":"http://phast.wishartlab.com/documentation.html"}],"function":[{"operation":[{"term":"Genome visualisation","uri":"http://edamontology.org/operation_3208"}]}],"labels":{"operatingSystem":["Linux","Windows","Mac"],"toolType":["Web application"],"topic":[{"term":"Protein interaction experiment","uri":"http://edamontology.org/topic_3557"},{"term":"Sequencing","uri":"http://edamontology.org/topic_3168"},{"term":"Molecular interactions, pathways and networks","uri":"http://edamontology.org/topic_0602"},{"term":"Genomics","uri":"http://edamontology.org/topic_0622"}]},"publication":[{"abstract":"PHAge Search Tool (PHAST) is a web server designed to rapidly and accurately identify, annotate and graphically display prophage sequences within bacterial genomes or plasmids. It accepts either raw DNA sequence data or partially annotated GenBank formatted data and rapidly performs a number of database comparisons as well as phage 'cornerstone' feature identification steps to locate, annotate and display prophage sequences and prophage features. Relative to other prophage identification tools, PHAST is up to 40 times faster and up to 15 more sensitive. It is also able to process and annotate both raw DNA sequence data and Genbank files, provide richly annotated tables on prophage features and prophage 'quality' and distinguish between intact and incomplete prophage. PHAST also generates downloadable, high quality, interactive graphics that display all identified prophage components in both circular and linear genomic views. PHAST is available at (http://phast.wishartlab.com). © 2011 The Author(s).","authors":["Zhou Y.","Liang Y.","Lynch K.H.","Dennis J.J.","Wishart D.S."],"cit_count":960,"journal":"Nucleic Acids Research","pmid":"21672955","title":"PHAST: A Fast Phage Search Tool","year":"2011-07-01"}],"summary":{"biotoolsCURIE":"biotools:phast","biotoolsID":"phast","description":"PHAST (PHAge Search Tool) is a web server designed to rapidly and accurately identify, annotate and graphically display prophage sequences within bacterial genomes or plasmids. PHAST also generates downloadable, high quality, interactive graphics that display all identified prophage components in both circular and linear genomic views.","homepage":"http://phast.wishartlab.com/","name":"PHAST"}}