{
    "additionDate": "2021-01-18T09:34:56Z",
    "biotoolsCURIE": "biotools:metabokit",
    "biotoolsID": "metabokit",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "hyung_won_choi@nus.edu.sg",
            "name": "Hyungwon Choi",
            "typeEntity": "Person"
        }
    ],
    "description": "A comprehensive data extraction tool for untargeted metabolomics.\n\nWe have developed MetaboKit, a comprehensive software package for compound identification and relative quantification in mass spectrometry-based untargeted metabolomics analysis. In data dependent acquisition (DDA) analysis, MetaboKit constructs a customized spectral library with compound identities from reference spectral libraries, adducts, dimers, in-source fragments (ISF), MS MS fragmentation spectra, and more importantly the retention time information unique to the chromatography system used in the experiment. Using the customized library, the software performs targeted peak integration for precursor ions in DDA analysis and for precursor and product ions in data independent acquisition (DIA) analysis",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Natural product identification",
                    "uri": "http://edamontology.org/operation_3803"
                },
                {
                    "term": "Peak detection",
                    "uri": "http://edamontology.org/operation_3215"
                }
            ]
        }
    ],
    "homepage": "https://github.com/MetaboKit",
    "lastUpdate": "2021-02-22T07:23:40Z",
    "name": "MetaboKit",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1039/D0MO00030B",
            "metadata": {
                "abstract": "© The Royal Society of Chemistry.We have developed MetaboKit, a comprehensive software package for compound identification and relative quantification in mass spectrometry-based untargeted metabolomics analysis. In data dependent acquisition (DDA) analysis, MetaboKit constructs a customized spectral library with compound identities from reference spectral libraries, adducts, dimers, in-source fragments (ISF), MS/MS fragmentation spectra, and more importantly the retention time information unique to the chromatography system used in the experiment. Using the customized library, the software performs targeted peak integration for precursor ions in DDA analysis and for precursor and product ions in data independent acquisition (DIA) analysis. With its stringent identification algorithm requiring matches by both MS and MS/MS data, MetaboKit provides identification results with significantly greater specificity than the competing software packages without loss in sensitivity. The proposed MS/MS-based screening of ISFs also reduces the chance of unverifiable identification of ISFs considerably. MetaboKit's quantification module produced peak area values highly correlated with known concentrations in a DIA analysis of the metabolite standards at both MS1 and MS2 levels. Moreover, the analysis of Cdk1Liv-/- mouse livers showed that MetaboKit can identify a wide range of lipid species and their ISFs, and quantitatively reconstitute the well-characterized fatty liver phenotype in these mice. In DIA data, the MS1-level and MS2-level peak area data produced similar fold change estimates in the differential abundance analysis, and the MS2-level peak area data allowed for quantitative comparisons in compounds whose precursor ion chromatogram was too noisy for peak integration. This journal is",
                "authors": [
                    {
                        "name": "Narayanaswamy P."
                    },
                    {
                        "name": "Teo G."
                    },
                    {
                        "name": "Ow J.R."
                    },
                    {
                        "name": "Lau A."
                    },
                    {
                        "name": "Kaldis P."
                    },
                    {
                        "name": "Tate S."
                    },
                    {
                        "name": "Choi H."
                    }
                ],
                "citationCount": 2,
                "date": "2020-10-01T00:00:00Z",
                "journal": "Molecular Omics",
                "title": "MetaboKit: A comprehensive data extraction tool for untargeted metabolomics"
            },
            "pmid": "32519713"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        },
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        },
        {
            "term": "Compound libraries and screening",
            "uri": "http://edamontology.org/topic_3343"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Lipids",
            "uri": "http://edamontology.org/topic_0153"
        }
    ]
}