
{
    "credit": [
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence motif discovery",
                    "uri": "http://edamontology.org/operation_0238"
                },
                {
                    "term": "Sequence motif recognition",
                    "uri": "http://edamontology.org/operation_0239"
                },
                {
                    "term": "Sequence motif comparison",
                    "uri": "http://edamontology.org/operation_0240"
                },
                {
                    "term": "Sequence motif analysis",
                    "uri": "http://edamontology.org/operation_2404"
                },
                {
                    "term": "Protein structural motif recognition",
                    "uri": "http://edamontology.org/operation_0245"
                }
            ]
        }
    ],
    "labels": {
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Sequence sites, features and motifs",
                "uri": "http://edamontology.org/topic_0160"
            },
            {
                "term": "Protein structural motifs and surfaces",
                "uri": "http://edamontology.org/topic_0166"
            },
            {
                "term": "Proteins",
                "uri": "http://edamontology.org/topic_0078"
            },
            {
                "term": "Gene and protein families",
                "uri": "http://edamontology.org/topic_0623"
            },
            {
                "term": "Protein structure analysis",
                "uri": "http://edamontology.org/topic_2814"
            }
        ]
    },
    "publication": [
        {
            "abstract": "Sequence motifs are important in the study of molecular biology. Motif discovery tools efficiently deliver many function related signatures of proteins and largely facilitate sequence annotation. As increasing numbers of motifs are detected experimentally or predicted computationally, characterizing the functional roles of motifs and identifying the potential synergetic relationships between them are important next steps. A good way to investigate novel motifs is to utilize the abundant 3D structures that have also been accumulated at an astounding rate in recent years. This article reports the development of the web service seeMotif, which provides users with an interactive interface for visualizing sequence motifs on protein structures from the Protein Data Bank (PDB). Researchers can quickly see the locations and conformation of multiple motifs among a number of related structures simultaneously. Considering the fact that PDB sequences are usually shorter than those in sequence databases and/or may have missing residues, seeMotif has two complementary approaches for selecting structures and mapping motifs to protein chains in structures. As more and more structures belonging to previously uncharacterized protein families become available, combining sequence and structure information gives good opportunities to facilitate understanding of protein functions in large-scale genome projects. Available at: http://seemotif.csie.ntu.edu.tw, http://seemotif.ee.ncku.edu.tw or http://seemotif.csbb.ntu.edu.tw.",
            "authors": [
                "Chang D.T.-H.",
                "Chien T.-Y.",
                "Chen C.-Y."
            ],
            "cit_count": 2,
            "journal": "Nucleic Acids Research",
            "pmid": "19477961",
            "title": "seeMotif: Exploring and visualizing sequence motifs in 3D structures",
            "year": "2009-08-04"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:seemotif",
        "biotoolsID": "seemotif",
        "description": "Allows users to interactively visualize sequence motifs on protein structures from Protein Data Bank (PDB).",
        "homepage": "http://seemotif.csie.ntu.edu.tw",
        "name": "seeMotif"
    }
}