{
    "additionDate": "2024-02-08T22:15:58.752756Z",
    "biotoolsCURIE": "biotools:validated_gpcr_antibodies",
    "biotoolsID": "validated_gpcr_antibodies",
    "description": "provides validated GPCR antibodies and detailed information concerning the validation",
    "editPermission": {
        "type": "private"
    },
    "homepage": "https://leod.shinyapps.io/gpcr_abval_2022/",
    "lastUpdate": "2024-02-08T22:15:58.755463Z",
    "name": "Validated GPCR Antibodies",
    "owner": "Friederike",
    "publication": [
        {
            "doi": "10.1126/sciadv.adf9297",
            "metadata": {
                "abstract": "G protein–coupled receptors (GPCRs) control critical cellular signaling pathways. Therapeutic agents including anti-GPCR antibodies (Abs) are being developed to modulate GPCR function. However, validating the selectivity of anti-GPCR Abs is challenging because of sequence similarities among individual receptors within GPCR subfamilies. To address this challenge, we developed a multiplexed immunoassay to test >400 anti-GPCR Abs from the Human Protein Atlas targeting a customized library of 215 expressed and solubilized GPCRs representing all GPCR subfamilies. We found that ~61% of Abs tested were selective for their intended target, ~11% bound off-target, and ~28% did not bind to any GPCR. Antigens of on-target Abs were, on average, significantly longer, more disordered, and less likely to be buried in the interior of the GPCR protein than the other Abs. These results provide important insights into the immunogenicity of GPCR epitopes and form a basis for designing therapeutic Abs and for detecting pathological auto-Abs against GPCRs.",
                "authors": [
                    {
                        "name": "Bendes A."
                    },
                    {
                        "name": "Dahl L."
                    },
                    {
                        "name": "Dodig-Crnkovic T."
                    },
                    {
                        "name": "Elofsson A."
                    },
                    {
                        "name": "Fromm S."
                    },
                    {
                        "name": "Kotliar I.B."
                    },
                    {
                        "name": "Sakmar T.P."
                    },
                    {
                        "name": "Schwenk J.M."
                    },
                    {
                        "name": "Uhlen M."
                    }
                ],
                "date": "2023-01-01T00:00:00Z",
                "journal": "Science Advances",
                "title": "Multiplexed selectivity screening of anti-GPCR antibodies"
            }
        }
    ]
}
