{"credit":[{"email":"uenoyt@ni.aist.go.jp","name":"Yutaka Ueno","typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://staff.aist.go.jp/yutaka.ueno/about/top.html"}],"documentation":[{"type":"TRAINING_MATERIAL","url":"https://staff.aist.go.jp/yutaka.ueno/guppy/examples.html"},{"type":"GENERAL","url":"https://staff.aist.go.jp/yutaka.ueno/guppy/docs.html"}],"function":[{"operation":[{"term":"Sequence visualisation","uri":"http://edamontology.org/operation_0564"}]}],"labels":{"language":["Lua"],"operatingSystem":["Linux"],"toolType":["Desktop application"],"topic":[{"term":"Sequencing","uri":"http://edamontology.org/topic_3168"},{"term":"Data visualisation","uri":"http://edamontology.org/topic_0092"},{"term":"Genomics","uri":"http://edamontology.org/topic_0622"},{"term":"Genetics","uri":"http://edamontology.org/topic_3053"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/guppy-0-988-visualize-sequence-annotation-data.html"}],"publication":[{"abstract":"The data processing language in a graphical software tool that manages sequence annotation data from genome databases should provide flexible functions for the tasks in molecular biology research. Among currently available languages we adopted the Lua programming language. It fulfills our requirements to perform computational tasks for sequence map layouts, i.e. the handling of data containers, symbolic reference to data, and a simple programming syntax. Upon importing a foreign file, the original data are first decomposed in the Lua language while maintaining the original data schema. The converted data are parsed by the Lua interpreter and the contents are stored in our data warehouse. Then, portions of annotations are selected and arranged into our catalog format to be depicted on the sequence map. Our sequence visualization program was successfully implemented, embedding the Lua language for processing of annotation data and layout script. The program is available at http://staff.aist.go.jp/yutaka.ueno/guppy/.","authors":["Ueno Y.","Arita M.","Kumagai T.","Asai K."],"cit_count":1,"journal":"Genome informatics. International Conference on Genome Informatics","pmid":"15706530","title":"Processing sequence annotation data using the Lua programming language.","year":"2003-01-01"}],"summary":{"biotoolsCURIE":"biotools:guppy","biotoolsID":"guppy","description":"Program to visualize sequence annotation data of the genetic sequence data with graphical layout. This highly interactive program allows scrolling and zooming from the genomic landscape to discrete nucleic acid sequences. Its main function is quick rendering of data on a standalone personal computer to save the layout as a parsonal file. With optional link to the internet resources, and printing support, this program tries to make more greater use of computational media in research actitiviy.","homepage":"http://staff.aist.go.jp/yutaka.ueno/guppy/","name":"GUPPY"}}