{
    "accessibility": "Open access",
    "additionDate": "2022-03-30T19:41:15.425750Z",
    "biotoolsCURIE": "biotools:quickfigures",
    "biotoolsID": "quickfigures",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "mazog@mskcc.org",
            "name": "Gregory Mazo",
            "orcidid": "https://orcid.org/0000-0002-3877-1359",
            "typeEntity": "Person"
        }
    ],
    "description": "A toolkit and ImageJ PlugIn to quickly transform microscope images into scientific figures",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://github.com/grishkam/QuickFigures/blob/master/UserGuide/User%20Guide.md"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                },
                {
                    "term": "Editing",
                    "uri": "http://edamontology.org/operation_3096"
                },
                {
                    "term": "Sequence alignment",
                    "uri": "http://edamontology.org/operation_0292"
                },
                {
                    "term": "Splitting",
                    "uri": "http://edamontology.org/operation_3359"
                }
            ]
        }
    ],
    "homepage": "https://github.com/grishkam/QuickFigures",
    "language": [
        "Java"
    ],
    "lastUpdate": "2022-03-30T19:41:15.428432Z",
    "license": "Apache-2.0",
    "name": "QuickFigures",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PONE.0240280",
            "metadata": {
                "abstract": "© 2021 Gregory Mazo. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Publications involving fluorescent microscopy images generally contain many panels with split channels, merged images, scale bars and label text. Similar layouts of panels are used when displaying other microscopy images, electron micrographs, photographs, and other images. Assembling and editing these figures with even spacing, consistent font, text position, accurate scale bars, and other features can be tedious and time consuming. In order to save time, I have created a toolset and ImageJ Plugin called QuickFigures. QuickFigures includes many helpful features that streamline the process of creating, aligning, and editing scientific figures. Those features include tools that automatically create split channel figures from a region of interest (\"Quick Figure\"button and \"Inset Tool\"), layouts that make it easy to rearrange panels, multiple tools to align objects, and \"Figure Format\"menu options that help a user ensure that large numbers of figures have consistent appearance. QuickFigures was compared to previous tools by measuring the amount of time needed for a user to create a figure using each software (QuickFigures, OMERO.figure. EZFig, FigureJ and PowerPoint). QuickFigures significantly reduced the amount of time required to create a figure. The toolsets were also compared by checking each software against a list of features. QuickFigures had the most extensive set of features. Therefore, QuickFigures is an advantageous alternative to traditional methods of constructing scientific figures. After a user has saved time by creating their work in QuickFigures, the figures can be exported to a variety of formats including PowerPoint, PDF, SVG, PNG, TIFF and Adobe Illustrator. Export was successfully tested for each file format and object type. Exported objects and text are editable in their target software, making them suitable for sharing with collaborators. The software is free, open source and can be installed easily.",
                "authors": [
                    {
                        "name": "Mazo G."
                    }
                ],
                "date": "2021-11-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "QuickFigures: A toolkit and ImageJ PlugIn to quickly transform microscope images into scientific figures"
            },
            "pmcid": "PMC8577749",
            "pmid": "34752463"
        }
    ],
    "toolType": [
        "Plug-in"
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ],
    "validated": 1
}
