{
    "additionDate": "2021-01-18T08:34:36Z",
    "biotoolsCURIE": "biotools:dicoexpress",
    "biotoolsID": "dicoexpress",
    "confidence_flag": "tool",
    "description": "DiCoExpress is a tool to process multifactorial RNAseq experiments from quality controls to co-expression analysis through differential analysis based on contrasts inside GLM models.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Expression correlation analysis",
                    "uri": "http://edamontology.org/operation_3463"
                },
                {
                    "term": "RNA-Seq analysis",
                    "uri": "http://edamontology.org/operation_3680"
                },
                {
                    "term": "Weighted correlation network analysis",
                    "uri": "http://edamontology.org/operation_3766"
                },
                {
                    "term": "Differential gene expression analysis",
                    "uri": "http://edamontology.org/operation_3223"
                }
            ]
        }
    ],
    "homepage": "https://forgemia.inra.fr/GNet/dicoexpress",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-03-01T08:49:11Z",
    "name": "DiCoExpress",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.21203/RS.2.19732/V2"
        },
        {
            "doi": "10.1186/s13007-020-00611-7",
            "metadata": {
                "abstract": "© 2020 The Author(s).Background: RNAseq is nowadays the method of choice for transcriptome analysis. In the last decades, a high number of statistical methods, and associated bioinformatics tools, for RNAseq analysis were developed. More recently, statistical studies realised neutral comparison studies using benchmark datasets, shedding light on the most appropriate approaches for RNAseq data analysis. Results: DiCoExpress is a script-based tool implemented in R that includes methods chosen based on their performance in neutral comparisons studies. DiCoExpress uses pre-existing R packages including FactoMineR, edgeR and coseq, to perform quality control, differential, and co-expression analysis of RNAseq data. Users can perform the full analysis, providing a mapped read expression data file and a file containing the information on the experimental design. Following the quality control step, the user can move on to the differential expression analysis performed using generalized linear models thanks to the automated contrast writing function. A co-expression analysis is implemented using the coseq package. Lists of differentially expressed genes and identified co-expression clusters are automatically analyzed for enrichment of annotations provided by the user. We used DiCoExpress to analyze a publicly available RNAseq dataset on the transcriptional response of Brassica napus L. to silicon treatment in plant roots and mature leaves. This dataset, including two biological factors and three replicates for each condition, allowed us to demonstrate in a tutorial all the features of DiCoExpress. Conclusions: DiCoExpress is an R script-based tool allowing users to perform a full RNAseq analysis from quality controls to co-expression analysis through differential analysis based on contrasts inside generalized linear models. DiCoExpress focuses on the statistical modelling of gene expression according to the experimental design and facilitates the data analysis leading the biological interpretation of the results.",
                "authors": [
                    {
                        "name": "Lambert I."
                    },
                    {
                        "name": "Paysant-Le Roux C."
                    },
                    {
                        "name": "Colella S."
                    },
                    {
                        "name": "Martin-Magniette M.-L."
                    }
                ],
                "date": "2020-05-12T00:00:00Z",
                "journal": "Plant Methods",
                "title": "DiCoExpress: A tool to process multifactorial RNAseq experiments from quality controls to co-expression analysis through differential analysis based on contrasts inside GLM models"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "topic": [
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        }
    ]
}