
{
    "credit": [
        {
            "name": "Robert Homann",
            "typeEntity": "Person",
            "typeRoles": [
                "Developer"
            ]
        },
        {
            "name": "Michael Beckstette",
            "typeEntity": "Person",
            "typeRoles": [
                "Developer"
            ]
        },
        {
            "name": "CeBiTec",
            "typeEntity": "Institute",
            "typeRoles": [
                "Provider"
            ]
        },
        {
            "name": "Bielefeld university",
            "typeEntity": "Institute",
            "typeRoles": [
                "Provider"
            ]
        },
        {
            "name": "BiBiServ",
            "typeEntity": "Institute",
            "typeRoles": [
                "Provider"
            ]
        },
        {
            "email": "bibi-help@cebitec.uni-bielefeld.de",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "https://bibiserv.cebitec.uni-bielefeld.de/possumsearch"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "https://bibiserv.cebitec.uni-bielefeld.de/possumsearch?id=possumsearch_download"
        },
        {
            "type": "Binaries",
            "url": "https://bibiserv.cebitec.uni-bielefeld.de/resources/download/possumsearch/"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence analysis",
                    "uri": "http://edamontology.org/operation_2403"
                }
            ]
        }
    ],
    "labels": {
        "collectionID": [
            "BiGi",
            "de.NBI"
        ],
        "cost": "Free of charge (with restrictions)",
        "language": [
            "C"
        ],
        "maturity": "Mature",
        "operatingSystem": [
            "Linux"
        ],
        "toolType": [
            "Library"
        ],
        "topic": [
            {
                "term": "Sequence analysis",
                "uri": "http://edamontology.org/topic_0080"
            }
        ]
    },
    "link": [
        {
            "type": "Repository",
            "url": "https://bibiserv.cebitec.uni-bielefeld.de/possumsearch?id=possumsearch_download"
        }
    ],
    "publication": [
        {
            "abstract": "Background: In biological sequence analysis, position specific scoring matrices (PSSMs) are widely used to represent sequence motifs in nucleotide as well as amino acid sequences. Searching with PSSMs in complete genomes or large sequence databases is a common, but computationally expensive task. Results: We present a new non-heuristic algorithm, called ESAsearch, to efficiently find matches of PSSMs in large databases. Our approach preprocesses the search space, e.g., a complete genome or a set of protein sequences, and builds an enhanced suffix array that is stored on file. This allows the searching of a database with a PSSM in sublinear expected time. Since ESAsearch benefits from small alphabets, we present a variant operating on sequences recoded according to a reduced alphabet. We also address the problem of non-comparable PSSM-scores by developing a method which allows the efficient computation of a matrix similarity threshold for a PSSM, given an E-value or a p-value. Our method is based on dynamic programming and, in contrast to other methods, it employs lazy evaluation of the dynamic programming matrix. We evaluated algorithm ESAsearch with nucleotide PSSMs and with amino acid PSSMs. Compared to the best previous methods, ESAsearch shows speedups of a factor between 17 and 275 for nucleotide PSSMs, and speedups up to factor 1.8 for amino acid PSSMs. Comparisons with the most widely used programs even show speedups by a factor of at least 3.8. Alphabet reduction yields an additional speedup factor of 2 on amino acid sequences compared to results achieved with the 20 symbol standard alphabet. The lazy evaluation method is also much faster than previous methods, with speedups of a factor between 3 and 330. Conclusion: Our analysis of ESAsearch reveals sublinear runtime in the expected case, and linear runtime in the worst case for sequences not shorter than A m + m - 1, where m is the length of the PSSM and A a finite alphabet. In practice, ESAsearch shows superior performance over the most widely used programs, especially for DNA sequences. The new algorithm for accurate on-the-fly calculations of thresholds has the potential to replace formerly used approximation approaches. Beyond the algorithmic contributions, we provide a robust, well documented, and easy to use software package, implementing the ideas and algorithms presented in this manuscript. © 2006 Beckstette et al; licensee BioMed Central Ltd.",
            "authors": [
                "Beckstette M.",
                "Homann R.",
                "Giegerich R.",
                "Kurtz S."
            ],
            "cit_count": 83,
            "doi": "10.1186/1471-2105-7-389",
            "journal": "BMC Bioinformatics",
            "title": "Fast index based algorithms and software for matching position specific scoring matrices",
            "type": "Primary",
            "year": "2006-08-24"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:possumsearch",
        "biotoolsID": "possumsearch",
        "description": "This tool find matches of PSSM in large databases. Our approach preprocesses the search space and builds an enhanced suffix array which is stored on file. Since ESAsearch benefits from small alphabets, we present a variant operating on sequences recoded according to a reduced alphabet. We also address the problem of non-comparable PSSM-scores by developing a method which allows to efficiently compute a matrix similarity threshold for a PSSM, given an E-value or a P-value.",
        "homepage": "https://bibiserv.cebitec.uni-bielefeld.de/possumsearch",
        "name": "PoSSuMsearch",
        "version": [
            "1"
        ]
    }
}