{
    "additionDate": "2019-11-14T18:20:20Z",
    "biotoolsCURIE": "biotools:rPowerlib",
    "biotoolsID": "rPowerlib",
    "confidence_flag": "high",
    "credit": [
        {
            "email": "deborah.glueck@ucdenver.edu",
            "name": "D.H. Glueck",
            "typeEntity": "Person"
        }
    ],
    "description": "Calculating Power for the General Linear Multivariate Model With One or More Gaussian Covariates | An R package implementing power and sample size methods for the general linear multivariate model | The rPowerlib package for R (>3.0.0) calculates power for the general linear multivariate model with or without Gaussian covariates | This package is based on the SAS/IML product POWERLIB (http://www.jstatsoft.org/v30/i05) developed by Keith E. Muller and colleagues. At present, the rPowerlib package DOES NOT include the full functionality of POWERLIB. For features such as power confidence intervals and more statistical tests, please try POWERLIB (http://github.com/samplesizeshop/powerlib) or GLIMMPSE (https://glimmpse.samplesizeshop.org). Please visit http://SampleSizeShop.org for more information about calculating power and sample size",
    "editPermission": {
        "type": "public"
    },
    "homepage": "http://github.com/SampleSizeShop/rPowerlib",
    "language": [
        "R",
        "Java"
    ],
    "lastUpdate": "2019-11-14T18:20:20Z",
    "license": "GPL-3.0",
    "name": "rPowerlib",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1080/03610926.2018.1433849",
            "metadata": {
                "abstract": "© 2018, © 2018 Taylor & Francis Group, LLC.We describe a noncentral F power approximation for hypotheses about fixed predictors in general linear multivariate models with one or more Gaussian covariates. The results apply to both single and multiple parameter hypotheses. The approach extends power approximations for models with only fixed predictors, and for models with a single Gaussian covariate. The new method approximates the noncentrality parameter under the alternative hypothesis using a Taylor series expansion for the matrix-variate beta distribution of type I. We used a Monte Carlo simulation to evaluate the accuracy of both the novel power approximation, and published power approximations. The simulation study accounted for randomness in both the predictors and the errors. We varied the number of outcomes, the number of parameters in the hypothesis, the per-treatment sample size, and the correlations between the random predictors and the outcomes. We demonstrate that our approximation is more accurate than published methods, both in small and large samples. We show that the run time for a single power calculation with the new method is on the order of milliseconds, compared to an average empirical simulation time of roughly three minutes. Approximate and simulated power can be calculated using the free, open-source rPowerlib package (http://github.com/SampleSizeShop/rPowerlib).",
                "authors": [
                    {
                        "name": "Kreidler S.M."
                    },
                    {
                        "name": "Ringham B.M."
                    },
                    {
                        "name": "Muller K.E."
                    },
                    {
                        "name": "Glueck D.H."
                    }
                ],
                "date": "2019-03-19T00:00:00Z",
                "journal": "Communications in Statistics - Theory and Methods",
                "title": "Calculating power for the general linear multivariate model with one or more Gaussian covariates"
            },
            "pmcid": "PMC6715143",
            "pmid": "31467462"
        }
    ],
    "topic": [
        {
            "term": "Mathematics",
            "uri": "http://edamontology.org/topic_3315"
        },
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        }
    ]
}