{
    "additionDate": "2017-08-20T15:40:22Z",
    "biotoolsCURIE": "biotools:famflm",
    "biotoolsID": "famflm",
    "collectionID": [
        "Animal and Crop Genomics"
    ],
    "credit": [
        {
            "email": "gulsvi@mail.ru",
            "name": "Gulnara Svishcheva",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "belon@bionet.nsc.ru",
            "name": "Nadezhda Belonogova",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "A region-based association test for familial data under functional linear models",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://mga.bionet.nsc.ru/soft/famFLM/"
        }
    ],
    "editPermission": {
        "authors": [
            "animalandcropgenomics"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genetic variation analysis",
                    "uri": "http://edamontology.org/operation_3197"
                }
            ]
        }
    ],
    "homepage": "http://mga.bionet.nsc.ru/soft/famFLM/",
    "language": [
        "R"
    ],
    "lastUpdate": "2019-09-04T08:38:03Z",
    "license": "GPL-3.0",
    "name": "famFLM",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "admin",
    "publication": [
        {
            "doi": "10.1371/journal.pone.0128999",
            "metadata": {
                "abstract": "© 2015 Svishcheva et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited. Region-based association analysis is a more powerful tool for gene mapping than testing of individual genetic variants, particularly for rare genetic variants. The most powerful methods for regional mapping are based on the functional data analysis approach, which assumes that the regional genome of an individual may be considered as a continuous stochastic function that contains information about both linkage and linkage disequilibrium. Here, we extend this powerful approach, earlier applied only to independent samples, to the samples of related individuals. To this end, we additionally include a random polygene effects in functional linear model used for testing association between quantitative traits and multiple genetic variants in the region.We compare the statistical power of different methods using Genetic Analysis Workshop 17 mini-exome family data and a wide range of simulation scenarios. Our method increases the power of regional association analysis of quantitative traits compared with burden-based and kernel-based methods for the majority of the scenarios. In addition, we estimate the statistical power of our method using regions with small number of genetic variants, and show that our method retains its advantage over burdenbased and kernel-based methods in this case as well. The new method is implemented as the R-function 'famFLM' using two types of basis functions: the B-spline and Fourier bases. We compare the properties of the new method using models that differ from each other in the type of their function basis. The models based on the Fourier basis functions have an advantage in terms of speed and power over the models that use the B-spline basis functions and those that combine B-spline and Fourier basis functions. The 'famFLM' function is distributed under GPLv3 license and is freely available at http://mga.bionet.nsc.ru/soft/famFLM/.",
                "authors": [
                    {
                        "name": "Svishcheva G.R."
                    },
                    {
                        "name": "Belonogova N.M."
                    },
                    {
                        "name": "Axenovich T.I."
                    }
                ],
                "citationCount": 9,
                "date": "2015-06-25T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "Region-based association test for familial data under functional linear models"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "GWAS study",
            "uri": "http://edamontology.org/topic_3517"
        }
    ],
    "validated": 1
}