{
    "additionDate": "2021-01-18T06:59:58Z",
    "biotoolsCURIE": "biotools:ilncrnadis-fb",
    "biotoolsID": "ilncrnadis-fb",
    "confidence_flag": "tool",
    "description": "Identify lncRNA-disease associations by fusing biological feature blocks through deep neural network.\n\nA new predictor for identifying lncRNA-disease associations by fusing biological feature blocks through deep neural network.",
    "editPermission": {
        "authors": [
            "Peixoni"
        ],
        "type": "group"
    },
    "homepage": "http://bliulab.net/iLncRNAdis-FB/",
    "lastUpdate": "2024-11-24T14:36:54.827265Z",
    "name": "iLncRNAdis-FB",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1109/tcbb.2020.2964221",
            "metadata": {
                "abstract": "Identification of lncRNA-disease associations is not only important for exploring the disease mechanism, but will also facilitate the molecular targeting drug discovery. Fusing multiple biological information is able to generate a more comprehensive view of lncRNA-disease association feature. However, the existing fusion strategies in this field fail to remove the noisy and irrelevant information from each data source. As a result, their predictive performance is still too low to be applied to real world applications. In this regard, a novel computational predictor called iLncRNAdis-FB is proposed based on the Convolution Neural Network (CNN) to integrate different data sources by using the feature blocks in a supervised manner. The lncRNA similarity matrix and disease similarity matrix are constructed, based on which the three-dimensional feature blocks are generated. These feature blocks are then fed into CNN to train the model so as to predict unknown lncRNA-disease associations. Experimental results show that iLncRNAdis-FB achieves better performance compared with other state-of-the-art predictors. Furthermore, a web server of iLncRNAdis-FB has been established at http://bliulab.net/iLncRNAdis-FB/, by which users can submit lncRNA sequences to detect their potential associated diseases.",
                "authors": [
                    {
                        "name": "Liao Q."
                    },
                    {
                        "name": "Liu B."
                    },
                    {
                        "name": "Wei H."
                    }
                ],
                "citationCount": 36,
                "date": "2021-01-01T00:00:00Z",
                "journal": "IEEE/ACM Transactions on Computational Biology and Bioinformatics",
                "title": "ILncRNAdis-FB: Identify lncRNA-Disease Associations by Fusing Biological Feature Blocks through Deep Neural Network"
            },
            "pmid": "31905146"
        }
    ],
    "toolType": [
        "Web service"
    ],
    "topic": [
        {
            "term": "Drug discovery",
            "uri": "http://edamontology.org/topic_3336"
        },
        {
            "term": "Endocrinology and metabolism",
            "uri": "http://edamontology.org/topic_3407"
        },
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ]
}
