{
    "name": "MESBL GC-MS metabolite peak database", 
    "description": "The MESBL GC-MS metabolite peak database is a standardized library of more than 900 metabolite peaks from MS-reconstructed gas chromatograms integrating the in-house standard compound and peak library of the FORTH/ICE-HT Metabolic Engineering and Systems Biology Laboratory, Greece, appropriately filtered GOLM database peak information and Human Metabolome database information.", 
    "homepage": "http://miolite2.iceht.forth.gr", 
    "biotoolsID": "miolite", 
    "biotoolsCURIE": "biotools:miolite", 
    "version": [
        "1.0"
    ], 
    "otherID": [], 
    "relation": [
        {
            "biotoolsID": "m-iolite", 
            "type": "usedBy"
        }
    ], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_3215", 
                    "term": "Peak detection"
                }, 
                {
                    "uri": "http://edamontology.org/operation_0224", 
                    "term": "Query and retrieval"
                }, 
                {
                    "uri": "http://edamontology.org/operation_0335", 
                    "term": "Formatting"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Library"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_3172", 
            "term": "Metabolomics"
        }, 
        {
            "uri": "http://edamontology.org/topic_3361", 
            "term": "Laboratory techniques"
        }, 
        {
            "uri": "http://edamontology.org/topic_3345", 
            "term": "Data identity and mapping"
        }, 
        {
            "uri": "http://edamontology.org/topic_2258", 
            "term": "Cheminformatics"
        }, 
        {
            "uri": "http://edamontology.org/topic_2259", 
            "term": "Systems biology"
        }, 
        {
            "uri": "http://edamontology.org/topic_3292", 
            "term": "Biochemistry"
        }, 
        {
            "uri": "http://edamontology.org/topic_3292", 
            "term": "Biochemistry"
        }
    ], 
    "operatingSystem": [
        "Linux", 
        "Windows", 
        "Mac"
    ], 
    "language": [
        "Python"
    ], 
    "license": null, 
    "collectionID": [], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [
        {
            "url": "http://miolite2.iceht.forth.gr", 
            "type": "Other", 
            "note": "The download website"
        }
    ], 
    "download": [
        {
            "url": "http://miolite2.iceht.forth.gr", 
            "type": "Downloads page", 
            "note": "List is incorporated in the M-IOLITE software but can also be obtained as a separate file upon request.", 
            "version": "1.0"
        }
    ], 
    "documentation": [
        {
            "url": "http://miolite2.iceht.forth.gr", 
            "type": "General", 
            "note": "The website provides information about citing the respective tool and how to contact the developer for obtaining the database."
        }
    ], 
    "publication": [
        {
            "doi": "10.1016/j.ifacol.2016.12.140", 
            "pmid": null, 
            "pmcid": null, 
            "type": "Other", 
            "version": null, 
            "metadata": {
                "title": "Streamlining GC-MS metabolomic analysis using the M-IOLITE software suite", 
                "abstract": "© 2016 Metabolomics, as a rapidly growing omic analysis, has being used extensively to explore the dynamic response of biological systems in several diseases/disorders and contexts. Therefore, it has become commonplace in a wide variety of disciplines and there is an intense need for development of software suites that provide the user with a less complicated and invalid analysis. These suites must integrate meta-analysis, a standardized data normalization method and a safe repository for all types of biological samples. In the case of the Gas Chromatography-Mass Spectrometry (GC-MS) metabolomics, due to the complexity of the analysis, multiple procedures that are essential for the metabolite identification require special manipulation. Moreover, metabolomic analysis produces a vast amount of unidentified compound data, so there is a need for unknown peak identification methods. While a number of tools offer access to datasets, constantly providing new releases for data processing and the fact that considerable progress has been made in that area, there is no computational platform that emerges as a standardized approach which includes specialized normalization methods for GC-MS metabolomic analysis and incorporates the metabolic network analysis into data interpretation and unknown peak identification. To address these issues, as the datasets obtained from metabolomics experiments still remain extremely large and dense, we have implemented M-IOLITE, a computational suite for the efficient and automatic analysis of high-throughput metabolomic experiments. The aim of the suite is to streamline GC-MS metabolomic data analysis and to reduce complexity enabling the use of a friendly interface for processing, validating and annotating data. It integrates specialized normalization methods, a safe data repository and a peak library providing through its pipeline a useful tool which enables rapid and accurate analysis of the metabolomic profiles into an interactive system.", 
                "date": "2016-01-01T00:00:00Z", 
                "citationCount": 2, 
                "authors": [
                    {
                        "name": "Maga-Nteve C."
                    }, 
                    {
                        "name": "Klapa M.I."
                    }
                ], 
                "journal": "IFAC-PapersOnLine"
            }
        }
    ], 
    "credit": [
        {
            "name": "Maria Klapa", 
            "email": "mklapa@iceht.forth.gr", 
            "url": "http://miolite2.iceht.forth.gr", 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "mklapa", 
    "additionDate": "2017-09-11T15:08:17Z", 
    "lastUpdate": "2019-07-26T16:58:29Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 0, 
    "homepage_status": 0, 
    "elixir_badge": 0
}