{
    "additionDate": "2020-03-10T13:05:45Z",
    "biotoolsCURIE": "biotools:rp2paths",
    "biotoolsID": "rp2paths",
    "description": "Pathway enumeration from RetroPath2.0 retrosynthesis output",
    "documentation": [
        {
            "type": [
                "API documentation"
            ],
            "url": "https://github.com/brsynth/rp2paths/blob/master/README.md"
        }
    ],
    "editPermission": {
        "authors": [
            "tduigou"
        ],
        "type": "group"
    },
    "function": [
        {
            "cmd": "python RP2paths.py all examples/naringenin/rp2-results.csv --outdir examples/naringenin/pathways",
            "input": [
                {
                    "data": {
                        "term": "Pathway or network",
                        "uri": "http://edamontology.org/data_2600"
                    },
                    "format": [
                        {
                            "term": "CSV",
                            "uri": "http://edamontology.org/format_3752"
                        }
                    ]
                }
            ],
            "note": "Enumerate pathways from RetroPath2.0",
            "operation": [
                {
                    "term": "Metabolic pathway prediction",
                    "uri": "http://edamontology.org/operation_3929"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Pathway or network",
                        "uri": "http://edamontology.org/data_2600"
                    },
                    "format": [
                        {
                            "term": "CSV",
                            "uri": "http://edamontology.org/format_3752"
                        }
                    ]
                },
                {
                    "data": {
                        "term": "SMILES string",
                        "uri": "http://edamontology.org/data_2301"
                    },
                    "format": [
                        {
                            "term": "TSV",
                            "uri": "http://edamontology.org/format_3475"
                        }
                    ]
                }
            ]
        }
    ],
    "homepage": "https://github.com/brsynth/rp2paths",
    "lastUpdate": "2020-05-21T07:52:28Z",
    "name": "rp2paths",
    "owner": "melclic",
    "publication": [
        {
            "doi": "10.1016/j.ymben.2017.12.002",
            "metadata": {
                "abstract": "© 2017 The AuthorsSynthetic biology applied to industrial biotechnology is transforming the way we produce chemicals. However, despite advances in the scale and scope of metabolic engineering, the research and development process still remains costly. In order to expand the chemical repertoire for the production of next generation compounds, a major engineering biology effort is required in the development of novel design tools that target chemical diversity through rapid and predictable protocols. Addressing that goal involves retrosynthesis approaches that explore the chemical biosynthetic space. However, the complexity associated with the large combinatorial retrosynthesis design space has often been recognized as the main challenge hindering the approach. Here, we provide RetroPath2.0, an automated open source workflow for retrosynthesis based on generalized reaction rules that perform the retrosynthesis search from chassis to target through an efficient and well-controlled protocol. Its easiness of use and the versatility of its applications make this tool a valuable addition to the biological engineer bench desk. We show through several examples the application of the workflow to biotechnological relevant problems, including the identification of alternative biosynthetic routes through enzyme promiscuity or the development of biosensors. We demonstrate in that way the ability of the workflow to streamline retrosynthesis pathway design and its major role in reshaping the design, build, test and learn pipeline by driving the process toward the objective of optimizing bioproduction. The RetroPath2.0 workflow is built using tools developed by the bioinformatics and cheminformatics community, because it is open source we anticipate community contributions will likely expand further the features of the workflow.",
                "authors": [
                    {
                        "name": "Delepine B."
                    },
                    {
                        "name": "Duigou T."
                    },
                    {
                        "name": "Carbonell P."
                    },
                    {
                        "name": "Faulon J.-L."
                    }
                ],
                "citationCount": 67,
                "date": "2018-01-01T00:00:00Z",
                "journal": "Metabolic Engineering",
                "title": "RetroPath2.0: A retrosynthesis workflow for metabolic engineers"
            }
        }
    ],
    "validated": 1,
    "version": [
        "1.1.0"
    ]
}