{
    "additionDate": "2016-03-18T09:58:17Z",
    "biotoolsCURIE": "biotools:motiflab",
    "biotoolsID": "motiflab",
    "collectionID": [
        "ELIXIR-Norway",
        "NTNU tools",
        "NeLS",
        "SEQwiki"
    ],
    "cost": "Free of charge",
    "credit": [
        {
            "email": "finn.drablos@ntnu.no",
            "name": "Finn Drabløs",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.motiflab.org/index.php?page=contact"
        },
        {
            "email": "kjetil.klepper@ntnu.no",
            "name": "Kjetil Klepper",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.motiflab.org/index.php?page=contact"
        },
        {
            "email": "finn.drablos@ntnu.no",
            "name": "Finn Drabløs",
            "typeRole": [
                "Support"
            ],
            "url": "http://www.motiflab.org/index.php?page=contact"
        },
        {
            "email": "kjetil.klepper@ntnu.no",
            "name": "Kjetil Klepper",
            "typeRole": [
                "Maintainer"
            ],
            "url": "http://www.motiflab.org/index.php?page=contact"
        },
        {
            "name": "ELIXIR-Norway",
            "typeEntity": "Consortium"
        },
        {
            "name": "NeLS (Norwegian e-Infrastructure for Life Sciences)",
            "typeEntity": "Consortium"
        },
        {
            "name": "Kjetil Klepper",
            "typeEntity": "Person",
            "typeRole": [
                "Developer"
            ]
        },
        {
            "name": "NTNU",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        },
        {
            "name": "Norwegian infrastructure for bioinformatics ELIXIR.no",
            "typeEntity": "Funding agency",
            "typeRole": [
                "Contributor"
            ]
        },
        {
            "name": "The National Programme for Research in Functional Genomics in Norway",
            "typeEntity": "Funding agency",
            "typeRole": [
                "Contributor"
            ]
        },
        {
            "name": "Finn Drabløs",
            "typeRole": [
                "Contributor"
            ]
        }
    ],
    "description": "General workbench for analyzing regulatory sequence regions and discovering transcription factor binding sites and cis-regulatory modules. It can improve performance of binding site predictions by allowing users to integrate several motif discovery tools, as well as different types of data: phylogenetic conservation, epigenetic marks, DNase hypersensitive sites, ChIP-Seq data, positional binding preferences of transcription factors, TF-TF interactions, TF-expression and target gene expression.",
    "documentation": [
        {
            "type": [
                "Citation instructions"
            ],
            "url": "http://www.motiflab.org/index.php?page=publications"
        },
        {
            "type": [
                "General"
            ],
            "url": "http://www.motiflab.org/index.php?page=documentation"
        }
    ],
    "download": [
        {
            "type": "Binaries",
            "url": "http://www.motiflab.org/index.php?page=download"
        },
        {
            "type": "Source code",
            "url": "http://www.motiflab.org/MotifLab_source.zip"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence visualisation",
                    "uri": "http://edamontology.org/operation_0564"
                }
            ]
        }
    ],
    "homepage": "http://www.motiflab.org",
    "language": [
        "Java"
    ],
    "lastUpdate": "2018-12-10T12:58:52Z",
    "link": [
        {
            "type": [
                "Helpdesk"
            ],
            "url": "http://www.motiflab.org/index.php?page=contact"
        },
        {
            "type": [
                "Repository"
            ],
            "url": "http://www.motiflab.org/index.php?page=download"
        }
    ],
    "maturity": "Mature",
    "name": "MotifLab",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "NTNU",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btq357",
            "metadata": {
                "abstract": "Summary: Computational methods designed to discover transcription factor binding sites in DNA sequences often have a tendency to make a lot of false predictions. One way to improve accuracy in motif discovery is to rely on positional priors to focus the search to parts of a sequence that are considered more likely to contain functional binding sites. We present here a program called PriorsEditor that can be used to create such positional priors tracks based on a combination of several features, including phylogenetic conservation, nucleosome occupancy, histone modifications, physical properties of the DNA helix and many more. © The Author(s) 2010. Published by Oxford University Press.",
                "authors": [
                    {
                        "name": "Drablos F."
                    },
                    {
                        "name": "Klepper K."
                    }
                ],
                "citationCount": 6,
                "date": "2010-07-13T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "PriorsEditor: A tool for the creation and use of positional priors in motif discovery"
            },
            "type": [
                "Other"
            ]
        },
        {
            "doi": "10.1186/1471-2105-14-9",
            "metadata": {
                "abstract": "Background: Traditional methods for computational motif discovery often suffer from poor performance. In particular, methods that search for sequence matches to known binding motifs tend to predict many non-functional binding sites because they fail to take into consideration the biological state of the cell. In recent years, genome-wide studies have generated a lot of data that has the potential to improve our ability to identify functional motifs and binding sites, such as information about chromatin accessibility and epigenetic states in different cell types. However, it is not always trivial to make use of this data in combination with existing motif discovery tools, especially for researchers who are not skilled in bioinformatics programming.Results: Here we present MotifLab, a general workbench for analysing regulatory sequence regions and discovering transcription factor binding sites and cis-regulatory modules. MotifLab supports comprehensive motif discovery and analysis by allowing users to integrate several popular motif discovery tools as well as different kinds of additional information, including phylogenetic conservation, epigenetic marks, DNase hypersensitive sites, ChIP-Seq data, positional binding preferences of transcription factors, transcription factor interactions and gene expression. MotifLab offers several data-processing operations that can be used to create, manipulate and analyse data objects, and complete analysis workflows can be constructed and automatically executed within MotifLab, including graphical presentation of the results.Conclusions: We have developed MotifLab as a flexible workbench for motif analysis in a genomic context. The flexibility and effectiveness of this workbench has been demonstrated on selected test cases, in particular two previously published benchmark data sets for single motifs and modules, and a realistic example of genes responding to treatment with forskolin. MotifLab is freely available at http://www.motiflab.org. © 2013 Klepper and Drabløs; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Drablos F."
                    },
                    {
                        "name": "Klepper K."
                    }
                ],
                "citationCount": 21,
                "date": "2013-01-16T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "MotifLab: A tools and data integration workbench for motif discovery and regulatory sequence analysis"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool",
        "Desktop application",
        "Workbench"
    ],
    "topic": [
        {
            "term": "Gene regulation",
            "uri": "http://edamontology.org/topic_0204"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ],
    "validated": 1,
    "version": [
        "1.8"
    ]
}
