{
    "accessibility": "Open access",
    "additionDate": "2022-06-08T09:04:39.547691Z",
    "biotoolsCURIE": "biotools:alzcode",
    "biotoolsID": "alzcode",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "jxwang@mail.csu.edu.cn",
            "name": "Jianxin Wang",
            "typeEntity": "Person"
        },
        {
            "email": "xqpeng@csu.edu.cn",
            "name": "Xiaoqing Peng",
            "typeEntity": "Person"
        }
    ],
    "description": "AlzCode is a web resource that developed pipeline to evaluate the association of genes with AD. The association of genes with AD are validated by multiple lines of functional genomic evidence with statistical approaches.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Differential gene expression profiling",
                    "uri": "http://edamontology.org/operation_3223"
                },
                {
                    "term": "Expression correlation analysis",
                    "uri": "http://edamontology.org/operation_3463"
                },
                {
                    "term": "Gene regulatory network analysis",
                    "uri": "http://edamontology.org/operation_1781"
                }
            ]
        }
    ],
    "homepage": "http://www.alzcode.xyz",
    "lastUpdate": "2022-06-08T09:04:39.550094Z",
    "name": "AlzCode",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAC033",
            "metadata": {
                "abstract": "© 2022 The Author(s) 2022. Published by Oxford University Press. All rights reserved. For permissions, please e-mail: journals.permissions@oup.com.Motivation: Alzheimer's disease (AD) is a complex brain disorder with risk genes incompletely identified. The candidate genes are dominantly obtained by computational approaches. In order to obtain biological insights of candidate genes or screen genes for experimental testing, it is essential to assess their relevance to AD. A platform that integrates different types of omics data and approaches would facilitate the analysis of candidate genes and is in great need. Results: We report AlzCode, a platform for multiview analysis of genes related to AD. First, this platform integrates a rich collection of functional genomic data, including expression data of AD samples (gene expression, single-cell RNA-seq data and protein expression), AD-specific biological networks (co-expression networks and functional gene networks), neuropathological and clinical traits (CERAD score, Braak staging score, Clinical Dementia Rating, cognitive function and clinical severity) and general data such as protein-protein interaction, regulatory networks, sequence similarity and miRNA-target interactions. These data provide basis for analyzing genes from different views. Second, the platform integrates multiple approaches designed for the various types of data. We implement functions to analyze both individual genes and gene sets. We also compare AlzCode with two existing platforms for AD analysis, which are Agora and AD Atlas. We pinpoint the features of each platform and highlight their differences. This platform would be valuable to the understanding of AD genetics and pathological mechanisms.",
                "authors": [
                    {
                        "name": "Deng C."
                    },
                    {
                        "name": "Erhardt S."
                    },
                    {
                        "name": "Li H.-D."
                    },
                    {
                        "name": "Lin C.-X."
                    },
                    {
                        "name": "Peng X."
                    },
                    {
                        "name": "Wang J."
                    },
                    {
                        "name": "Wang J."
                    }
                ],
                "date": "2022-04-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "AlzCode: A platform for multiview analysis of genes related to Alzheimer's disease"
            },
            "pmid": "35040932"
        }
    ],
    "toolType": [
        "Web application",
        "Workflow"
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ]
}
