{
    "additionDate": "2017-01-13T13:15:50Z",
    "biotoolsCURIE": "biotools:pecan",
    "biotoolsID": "pecan",
    "credit": [
        {
            "email": "benedict@soe.ucsc.edu",
            "name": "Benedict Paten",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Alignment method practical for large genomic sequences.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/benedictpaten/pecan/blob/master/README.md"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence alignment",
                    "uri": "http://edamontology.org/operation_0292"
                }
            ]
        }
    ],
    "homepage": "https://github.com/benedictpaten/pecan",
    "language": [
        "Java",
        "Python"
    ],
    "lastUpdate": "2018-12-10T12:58:53Z",
    "maturity": "Legacy",
    "name": "PECAN",
    "owner": "seqwiki_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Pairwise whole-genome alignment involves the creation of a homology map, capable of performing a near complete transformation of one genome into another. For multiple genomes this problem is generalized to finding a set of consistent homology maps for converting each genome in the set of aligned genomes into any of the others. The problem can be divided into two principal stages. First, the partitioning of the input genomes into a set of colinear segments, a process which essentially deals with the complex processes of rearrangement. Second, the generation of a base pair level alignment map for each colinear segment. We have developed a new genome-wide segmentation program, Enredo, which produces colinear segments from extant genomes handling rearrangements, including duplications. We have then applied the new alignment program Pecan, which makes the consistency alignment methodology practical at a large scale, to create a new set of genome-wide mammalian alignments. We test both Enredo and Pecan using novel and existing assessment analyses that incorporate both real biological data and simulations, and show that both independently and in combination they outperform existing programs. Alignments from our pipeline are publicly available within the Ensembl genome browser. ©2008 by Cold Spring Harbor Laboratory Press.",
                "authors": [
                    {
                        "name": "Paten B."
                    },
                    {
                        "name": "Herrero J."
                    },
                    {
                        "name": "Beal K."
                    },
                    {
                        "name": "Fitzgerald S."
                    },
                    {
                        "name": "Birney E."
                    }
                ],
                "citationCount": 192,
                "date": "2008-11-01T00:00:00Z",
                "journal": "Genome Research",
                "title": "Enredo and Pecan: Genome-wide mammalian consistency-based multiple alignment with paralogs"
            },
            "pmid": "18849524"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        }
    ],
    "validated": 1
}