{
    "accessibility": "Open access",
    "additionDate": "2022-05-19T22:41:06.399139Z",
    "biotoolsCURIE": "biotools:multicapsnet",
    "biotoolsID": "multicapsnet",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "juncai@big.ac.cn",
            "name": "Jun Cai",
            "typeEntity": "Person"
        },
        {
            "email": "zhangjiang@bnu.edu.cn",
            "name": "Jiang Zhang",
            "typeEntity": "Person"
        },
        {
            "name": "Zhang Zhang"
        }
    ],
    "description": "A General Framework for Data Integration and Interpretable Classification.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                },
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                },
                {
                    "term": "Variant classification",
                    "uri": "http://edamontology.org/operation_3225"
                }
            ]
        }
    ],
    "homepage": "https://github.com/wanglf19/MultiCapsNet",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-05-19T22:41:06.401649Z",
    "license": "Not licensed",
    "name": "MultiCapsNet",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.3389/FGENE.2021.767602",
            "metadata": {
                "abstract": "Copyright © 2021 Wang, Miao, Nie, Zhang, Zhang and Cai.The latest progresses of experimental biology have generated a large number of data with different formats and lengths. Deep learning is an ideal tool to deal with complex datasets, but its inherent “black box” nature needs more interpretability. At the same time, traditional interpretable machine learning methods, such as linear regression or random forest, could only deal with numerical features instead of modular features often encountered in the biological field. Here, we present MultiCapsNet (https://github.com/wanglf19/MultiCapsNet), a new deep learning model built on CapsNet and scCapsNet, which possesses the merits such as easy data integration and high model interpretability. To demonstrate the ability of this model as an interpretable classifier to deal with modular inputs, we test MultiCapsNet on three datasets with different data type and application scenarios. Firstly, on the labeled variant call dataset, MultiCapsNet shows a similar classification performance with neural network model, and provides importance scores for data sources directly without an extra importance determination step required by the neural network model. The importance scores generated by these two models are highly correlated. Secondly, on single cell RNA sequence (scRNA-seq) dataset, MultiCapsNet integrates information about protein-protein interaction (PPI), and protein-DNA interaction (PDI). The classification accuracy of MultiCapsNet is comparable to the neural network and random forest model. Meanwhile, MultiCapsNet reveals how each transcription factor (TF) or PPI cluster node contributes to classification of cell type. Thirdly, we made a comparison between MultiCapsNet and SCENIC. The results show several cell type relevant TFs identified by both methods, further proving the validity and interpretability of the MultiCapsNet.",
                "authors": [
                    {
                        "name": "Cai J."
                    },
                    {
                        "name": "Miao X."
                    },
                    {
                        "name": "Nie R."
                    },
                    {
                        "name": "Wang L."
                    },
                    {
                        "name": "Zhang J."
                    },
                    {
                        "name": "Zhang Z."
                    }
                ],
                "date": "2021-11-24T00:00:00Z",
                "journal": "Frontiers in Genetics",
                "title": "MultiCapsNet: A General Framework for Data Integration and Interpretable Classification"
            },
            "pmcid": "PMC8652257",
            "pmid": "34899854"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ]
}
