{
    "additionDate": "2021-01-18T07:37:48Z",
    "biotoolsCURIE": "biotools:omixlitminer",
    "biotoolsID": "omixlitminer",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "hschluet@uke.de",
            "name": "Hartmut Schlüter",
            "orcidid": "https://orcid.org/0000-0002-9358-7036",
            "typeEntity": "Person"
        },
        {
            "email": "m.molloy@sydney.edu.au",
            "name": "Mark P. Molloy",
            "typeEntity": "Person"
        }
    ],
    "description": "A Bioinformatics Tool for Prioritizing Biological Leads from 'Omics Data Using Literature Retrieval and Data Mining.\n\nOmixLitMiner is a new tool that aims to help researchers reduce time spent on literature research post analysis and streamline the decision about which proteins or genes are the most interesting and most promising for follow-up experiments.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Literature search",
                    "uri": "http://edamontology.org/operation_0305"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Sydney-Informatics-Hub/OmixLitMiner",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-03-13T19:08:55Z",
    "license": "MIT",
    "name": "OmixLitMiner",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.3390/IJMS21041374",
            "metadata": {
                "abstract": "© 2020 by the authors. Licensee MDPI, Basel, Switzerland.Proteomics and genomics discovery experiments generate increasingly large result tables, necessitating more researcher time to convert the biological data into new knowledge. Literature review is an important step in this process and can be tedious for large scale experiments. An informed and strategic decision about which biomolecule targets should be pursued for follow-up experiments thus remains a considerable challenge. To streamline and formalise this process of literature retrieval and analysis of discovery based ‘omics data and as a decision-facilitating support tool for follow-up experiments we present OmixLitMiner, a package written in the computational language R. The tool automates the retrieval of literature from PubMed based on UniProt protein identifiers, gene names and their synonyms, combined with user defined contextual keyword search (i.e., gene ontology based). The search strategy is programmed to allow either strict or more lenient literature retrieval and the outputs are assigned to three categories describing how well characterized a regulated gene or protein is. The category helps to meet a decision, regarding which gene/protein follow-up experiments may be performed for gaining new knowledge and to exclude following already known biomarkers. We demonstrate the tool’s usefulness in this retrospective study assessing three cancer proteomics and one cancer genomics publication. Using the tool, we were able to corroborate most of the decisions in these papers as well as detect additional biomolecule leads that may be valuable for future research.",
                "authors": [
                    {
                        "name": "Hariharan S."
                    },
                    {
                        "name": "Molloy M.P."
                    },
                    {
                        "name": "Raghunath V."
                    },
                    {
                        "name": "Schluter H."
                    },
                    {
                        "name": "Steffen P."
                    },
                    {
                        "name": "Voss H."
                    },
                    {
                        "name": "Wu J."
                    }
                ],
                "citationCount": 2,
                "date": "2020-02-02T00:00:00Z",
                "journal": "International Journal of Molecular Sciences",
                "title": "Omixlitminer: A bioinformatics tool for prioritizing biological leads from ‘omics data using literature retrieval and data mining"
            },
            "pmcid": "PMC7073124",
            "pmid": "32092871"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Data mining",
            "uri": "http://edamontology.org/topic_3473"
        },
        {
            "term": "Natural language processing",
            "uri": "http://edamontology.org/topic_0218"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        }
    ]
}
