{
    "additionDate": "2015-06-11T13:36:37Z",
    "biotoolsCURIE": "biotools:enzyme_portal",
    "biotoolsID": "enzyme_portal",
    "credit": [
        {
            "name": "EMBL-EBI Databases",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        },
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.ebi.ac.uk/support/index.php?query=Enzyme+portal&referrer=http://www.ebi.ac.uk/enzymeportal/"
        }
    ],
    "description": "Web service which integrates publicly available information about enzymes, such as small-molecule chemistry, biochemical pathways and drug compounds.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://www.ebi.ac.uk/enzymeportal/about"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "elixirNode": [
        "EMBL"
    ],
    "elixirPlatform": [
        "Data"
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                }
            ]
        }
    ],
    "homepage": "http://www.ebi.ac.uk/enzymeportal/",
    "lastUpdate": "2024-11-25T14:20:59.744443Z",
    "name": "Enzyme Portal",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "EMBL-EBI_Databases",
    "publication": [
        {
            "doi": "10.1186/1471-2105-14-103",
            "metadata": {
                "abstract": "User-centred design (UCD) is a type of user interface design in which the needs and desires of users are taken into account at each stage of the design process for a service or product; often for software applications and websites. Its goal is to facilitate the design of software that is both useful and easy to use. To achieve this, you must characterise users' requirements, design suitable interactions to meet their needs, and test your designs using prototypes and real life scenarios.For bioinformatics, there is little practical information available regarding how to carry out UCD in practice. To address this we describe a complete, multi-stage UCD process used for creating a new bioinformatics resource for integrating enzyme information, called the Enzyme Portal (http://www.ebi.ac.uk/enzymeportal). This freely-available service mines and displays data about proteins with enzymatic activity from public repositories via a single search, and includes biochemical reactions, biological pathways, small molecule chemistry, disease information, 3D protein structures and relevant scientific literature.We employed several UCD techniques, including: persona development, interviews, 'canvas sort' card sorting, user workflows, usability testing and others. Our hope is that this case study will motivate the reader to apply similar UCD approaches to their own software design for bioinformatics. Indeed, we found the benefits included more effective decision-making for design ideas and technologies; enhanced team-working and communication; cost effectiveness; and ultimately a service that more closely meets the needs of our target audience. © 2013 de Matos et al.; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Alcantara R."
                    },
                    {
                        "name": "Cao H."
                    },
                    {
                        "name": "Cham J.A."
                    },
                    {
                        "name": "Lopez R."
                    },
                    {
                        "name": "Rowland F."
                    },
                    {
                        "name": "Steinbeck C."
                    },
                    {
                        "name": "de Matos P."
                    }
                ],
                "citationCount": 17,
                "date": "2013-03-20T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "The Enzyme Portal: A case study in applying user-centred design methods in bioinformatics"
            },
            "pmcid": "PMC3623738",
            "pmid": "23514033",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Enzymes",
            "uri": "http://edamontology.org/topic_0821"
        }
    ],
    "validated": 1
}
