{
    "additionDate": "2021-01-18T10:19:31Z",
    "biotoolsCURIE": "biotools:wheelcon",
    "biotoolsID": "wheelcon",
    "confidence_flag": "tool",
    "description": "A Wheel Control-Based Gaming Platform for Studying Human Sensorimotor Control.\n\nFeedback control theory has been extensively implemented to theoretically model human sensorimotor control. However, experimental platforms capable of manipulating important components of multiple feedback loops lack development. This paper describes WheelCon, an open-source platform aimed at resolving such insufficiencies. Using only a computer, a standard display, and inexpensive gaming steering wheel equipped with a force feedback motor, WheelCon safely simulates the canonical sensorimotor task of riding a mountain bike down a steep, twisting, bumpy trail. The platform provides flexibility, as will be demonstrated in the demos provided, so that researchers may manipulate the disturbances, delay, and quantization (data rate) in the layered feedback loops, including a high-level advanced plan layer and a low-level delayed reflex layer",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://github.com/Doyle-Lab/WheelCon/blob/master/Platform%20Manual.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Modelling and simulation",
                    "uri": "http://edamontology.org/operation_2426"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Doyle-Lab/WheelCon",
    "language": [
        "C#"
    ],
    "lastUpdate": "2021-03-14T11:53:30Z",
    "name": "WheelCon",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.3791/61092",
            "metadata": {
                "abstract": "© 2020 JoVE Journal of Visualized Experiments.Feedback control theory has been extensively implemented to theoretically model human sensorimotor control. However, experimental platforms capable of manipulating important components of multiple feedback loops lack development. This paper describes WheelCon, an open-source platform aimed at resolving such insufficiencies. Using only a computer, a standard display, and inexpensive gaming steering wheel equipped with a force feedback motor, WheelCon safely simulates the canonical sensorimotor task of riding a mountain bike down a steep, twisting, bumpy trail. The platform provides flexibility, as will be demonstrated in the demos provided, so that researchers may manipulate the disturbances, delay, and quantization (data rate) in the layered feedback loops, including a high-level advanced plan layer and a low-level delayed reflex layer. In this paper, we illustrate WheelCon's graphical user interface (GUI), the input and output of existing demos, and how to design new games. In addition, we present the basic feedback model and the experimental results from the demo games, which align well with the model's prediction. The WheelCon platform can be downloaded at https://github.com/Doyle-Lab/WheelCon. In short, the platform is featured to be cheap, simple to use, and flexible to program for effective sensorimotor neuroscience research and control engineering education.",
                "authors": [
                    {
                        "name": "Choi S.H."
                    },
                    {
                        "name": "Dai A."
                    },
                    {
                        "name": "Doyle J.C."
                    },
                    {
                        "name": "Ho D.M."
                    },
                    {
                        "name": "Liang Z."
                    },
                    {
                        "name": "Liu Q."
                    },
                    {
                        "name": "Mohideen A."
                    },
                    {
                        "name": "Nakahira Y."
                    },
                    {
                        "name": "Pan A."
                    }
                ],
                "citationCount": 1,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Journal of Visualized Experiments",
                "title": "Wheelcon: A wheel control-based gaming platform for studying human sensorimotor control"
            },
            "pmid": "32865525"
        }
    ],
    "topic": [
        {
            "term": "Human biology",
            "uri": "http://edamontology.org/topic_2815"
        },
        {
            "term": "Neurobiology",
            "uri": "http://edamontology.org/topic_3304"
        }
    ]
}
