{
    "accessibility": "Open access",
    "additionDate": "2019-05-27T14:27:11Z",
    "biotoolsCURIE": "biotools:OMeta",
    "biotoolsID": "OMeta",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "dlwebsupport@jcvi.org",
            "name": "J. Craig Venter Institute",
            "typeEntity": "Institute",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.jcvi.org/"
        }
    ],
    "description": "Ontology-based, data-driven metadata tracking system.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                },
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Ontology comparison",
                    "uri": "http://edamontology.org/operation_3352"
                }
            ]
        }
    ],
    "homepage": "https://github.com/JCVenterInstitute/OMeta-Public",
    "language": [
        "Java",
        "SQL"
    ],
    "lastUpdate": "2020-06-16T10:55:22Z",
    "license": "GPL-3.0",
    "maturity": "Mature",
    "name": "OMeta",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "Ruta",
    "publication": [
        {
            "doi": "10.1186/s12859-018-2580-9",
            "metadata": {
                "abstract": "© 2019 The Author(s). Background: The development of high-throughput sequencing and analysis has accelerated multi-omics studies of thousands of microbial species, metagenomes, and infectious disease pathogens. Omics studies are enabling genotype-phenotype association studies which identify genetic determinants of pathogen virulence and drug resistance, as well as phylogenetic studies designed to track the origin and spread of disease outbreaks. These omics studies are complex and often employ multiple assay technologies including genomics, metagenomics, transcriptomics, proteomics, and metabolomics. To maximize the impact of omics studies, it is essential that data be accompanied by detailed contextual metadata (e.g., specimen, spatial-temporal, phenotypic characteristics) in clear, organized, and consistent formats. Over the years, many metadata standards developed by various metadata standards initiatives have arisen; the Genomic Standards Consortium's minimal information standards (MIxS), the GSCID/BRC Project and Sample Application Standard. Some tools exist for tracking metadata, but they do not provide event based capabilities to configure, collect, validate, and distribute metadata. To address this gap in the scientific community, an event based data-driven application, OMeta, was created that allows users to quickly configure, collect, validate, distribute, and integrate metadata. Results: A data-driven web application, OMeta, has been developed for use by researchers consisting of a browser-based interface, a command-line interface (CLI), and server-side components that provide an intuitive platform for configuring, capturing, viewing, and sharing metadata. Project and sample metadata can be set based on existing standards or based on projects goals. Recorded information includes details on the biological samples, procedures, protocols, and experimental technologies, etc. This information can be organized based on events, including sample collection, sample quantification, sequencing assay, and analysis results. OMeta enables configuration in various presentation types: checkbox, file, drop-box, ontology, and fields can be configured to use the National Center for Biomedical Ontology (NCBO), a biomedical ontology server. Furthermore, OMeta maintains a complete audit trail of all changes made by users and allows metadata export in comma separated value (CSV) format for convenient deposition of data into public databases. Conclusions: We present, OMeta, a web-based software application that is built on data-driven principles for configuring and customizing data standards, capturing, curating, and sharing metadata.",
                "authors": [
                    {
                        "name": "Singh I."
                    },
                    {
                        "name": "Kuscuoglu M."
                    },
                    {
                        "name": "Harkins D.M."
                    },
                    {
                        "name": "Sutton G."
                    },
                    {
                        "name": "Fouts D.E."
                    },
                    {
                        "name": "Nelson K.E."
                    }
                ],
                "date": "2019-01-07T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "OMeta: An ontology-based, data-driven metadata tracking system"
            }
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "Ontology and terminology",
            "uri": "http://edamontology.org/topic_0089"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        }
    ]
}