
{
    "credit": [
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Phasing",
                    "uri": "http://edamontology.org/operation_3454"
                }
            ]
        }
    ],
    "publication": [
        {
            "abstract": "© 2019 American Speech-Language-Hearing AssociationPurpose: Improving vocabulary knowledge is important for many adolescents, but there are few evidence-based vocabulary instruction programs available for high school students. The purpose of this article is to describe the iterative development of the DictionarySquared research platform, a web-based vocabulary program that provides individualized vocabulary instruction, and to report the results of 2 pilot studies examining the feasibility of implementation and potential effectiveness with high school students. Method: We describe our theory of change and 5 phases of iterative development. In Phases 1 and 2, we evaluated the initial implementation of DictionarySquared and revised the instructional materials. In Phase 3, we conducted a feasibility study involving 169 high school students who used the program for 4 weeks. Student usage data and feedback from teachers were used to guide program revisions in Phase 4. In Phase 5, we examined potential effectiveness for 264 high school students who were assigned to use the program for 1 semester. Results: Results of the Phase 3 study indicated that implementation of the program was feasible, although usage was below assigned levels. Results of the Phase 5 study indicated that the duration of active program usage significantly predicted posttest vocabulary scores on the proximal assessment after controlling for pretest standardized vocabulary scores. Analyses using propensity score matching revealed positive, but nonsignificant, gains on standardized assessments between pre-and posttests. Conclusion: Together, the results of early-stage pilot studies are promising and suggest that a more rigorous test of efficacy is warranted. Successful implementation of the DictionarySquared research program, as well as lessons learned from the program development process, will expand the range of evidence-based treatment options that clinicians and educators can use to improve adolescent vocabulary and reading comprehension skills.",
            "authors": [
                "Adlof S.M.",
                "Baron L.S.",
                "Scoggins J.",
                "Kapelner A.",
                "McKeown M.G.",
                "Perfetti C.A.",
                "Miller E.",
                "Soterwood J.",
                "Petscher Y."
            ],
            "cit_count": 1,
            "doi": "10.1044/2019_LSHSS-VOIA-18-0143",
            "journal": "Language, Speech, and Hearing Services in Schools",
            "pmid": "31600471",
            "title": "Accelerating adolescent vocabulary growth: Development of an individualized, web-based, vocabulary instruction program",
            "year": "2019-10-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:DictionarySquared",
        "biotoolsID": "DictionarySquared",
        "description": "Development of an Individualized, Web-Based, Vocabulary Instruction Program.\n\nPurpose Improving vocabulary knowledge is important for many adolescents, but there are few evidence-based vocabulary instruction programs available for high school students. The purpose of this article is to describe the iterative development of the DictionarySquared research platform, a web-based vocabulary program that provides individualized vocabulary instruction, and to report the results of 2 pilot studies examining the feasibility of implementation and potential effectiveness with high school students. Method We describe our theory of change and 5 phases of iterative development. In Phases 1 and 2, we evaluated the initial implementation of DictionarySquared and revised the instructional materials.\n\n||| HOMEPAGE MISSING!.\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'Accelerating Adolescent Vocabulary Growth', 'vocabulary', 'individualized'",
        "homepage": "https://www.ncbi.nlm.nih.gov/pubmed/?term=31600471",
        "name": "DictionarySquared"
    }
}