{
    "name": "MED", 
    "description": "MED is a non-supervised prokaryotic gene prediction method which integrates MED2.0 and TriTISA, an iterative self-learning translation initiation site (TIS) prediction algorithm. As the update of MED2.0, MED 2.1 modifies the TIS model by replacing the previous one to TriTISA, which imoroves the prediction accuracies for both 3′ and 5′ ends.", 
    "homepage": "http://cqb.pku.edu.cn/ZhuLab/med2_1/MED2.htm", 
    "biotoolsID": "med", 
    "biotoolsCURIE": "biotools:med", 
    "version": [
        "2.1"
    ], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_2454", 
                    "term": "Gene prediction"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }, 
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_2423", 
                    "term": "Prediction"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Command-line tool"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_0203", 
            "term": "Gene expression"
        }, 
        {
            "uri": "http://edamontology.org/topic_0654", 
            "term": "DNA"
        }
    ], 
    "operatingSystem": [
        "Linux", 
        "Windows"
    ], 
    "language": [
        "C++"
    ], 
    "license": null, 
    "collectionID": [], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [
        {
            "url": "http://www.mybiosoftware.com/med-2-1-gene-prediction-prokaryotic-genomes-multivariate-entropy-distance-method.html", 
            "type": "Registry", 
            "note": null
        }
    ], 
    "download": [], 
    "documentation": [], 
    "publication": [
        {
            "doi": "10.1186/1471-2105-8-97", 
            "pmid": null, 
            "pmcid": null, 
            "type": "Primary", 
            "version": null, 
            "metadata": {
                "title": "MED: A new non-supervised gene prediction algorithm for bacterial and archaeal genomes", 
                "abstract": "Background: Despite a remarkable success in the computational prediction of genes in Bacteria and Archaea, a lack of comprehensive understanding of prokaryotic gene structures prevents from further elucidation of differences among genomes. It continues to be interesting to develop new ab initio algorithms which not only accurately predict genes, but also facilitate comparative studies of prokaryotic genomes. Results: This paper describes a new prokaryotic genefinding algorithm based on a comprehensive statistical model of protein coding Open Reading Frames (ORFs) and Translation Initiation Sites (TISs). The former is based on a linguistic \"Entropy Density Profile\" (EDP) model of coding DNA sequence and the latter comprises several relevant features related to the translation initiation. They are combined to form a so-called Multivariate Entropy Distance (MED) algorithm, MED 2.0, that incorporates several strategies in the iterative program. The iterations enable us to develop a non-supervised learning process and to obtain a set of genome-specific parameters for the gene structure, before making the prediction of genes. Conclusion: Results of extensive tests show that MED 2.0 achieves a competitive high performance in the gene prediction for both 5′ and 3′ end matches, compared to the current best prokaryotic gene finders. The advantage of the MED 2.0 is particularly evident for GC-rich genomes and archaeal genomes. Furthermore, the genome-specific parameters given by MED 2.0 match with the current understanding of prokaryotic genomes and may serve as tools for comparative genomic studies. In particular, MED 2.0 is shown to reveal divergent translation initiation mechanisms in archaeal genomes while making a more accurate prediction of TISs compared to the existing gene finders and the current GenBank annotation. © 2007 Zhu et al; licensee BioMed Central Ltd.", 
                "date": "2007-04-18T00:00:00Z", 
                "citationCount": 38, 
                "authors": [
                    {
                        "name": "Zhu H."
                    }, 
                    {
                        "name": "Hu G.-Q."
                    }, 
                    {
                        "name": "Yang Y.-F."
                    }, 
                    {
                        "name": "Wang J."
                    }, 
                    {
                        "name": "She Z.-S."
                    }
                ], 
                "journal": "BMC Bioinformatics"
            }
        }
    ], 
    "credit": [
        {
            "name": null, 
            "email": null, 
            "url": "http://cqb.pku.edu.cn/ZhuLab/", 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "mbs_import", 
    "additionDate": "2017-12-18T00:08:43Z", 
    "lastUpdate": "2018-12-10T12:58:57Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 1, 
    "homepage_status": 0, 
    "elixir_badge": 0
}