{
    "additionDate": "2020-01-14T19:57:43Z",
    "biotoolsCURIE": "biotools:CCC-Tool",
    "biotoolsID": "CCC-Tool",
    "confidence_flag": "tool",
    "description": "CCC-Tool (Charting Continuous Colormaps) is a tool for creating, editing, and analyzing such application-specific colormaps.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Editing",
                    "uri": "http://edamontology.org/operation_3096"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://ccctool.com",
    "lastUpdate": "2021-01-14T18:21:29Z",
    "name": "CCC-Tool",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1109/TVCG.2019.2961674",
            "metadata": {
                "abstract": "© 1995-2012 IEEE.Continuous colormaps are integral parts of many visualization techniques, such as heat-maps, surface plots, and flow visualization. Despite that the critiques of rainbow colormaps have been around and well-acknowledged for three decades, rainbow colormaps are still widely used today. One reason behind the resilience of rainbow colormaps is the lack of tools for users to create a continuous colormap that encodes semantics specific to the application concerned. In this paper, we present a web-based software system, CCC-Tool (short for Charting Continuous Colormaps) under the URL https://ccctool.com, for creating, editing, and analyzing such application-specific colormaps. We introduce the notion of 'colormap specification (CMS)' that maintains the essential semantics required for defining a color mapping scheme. We provide users with a set of advanced utilities for constructing CMS's with various levels of complexity, examining their quality attributes using different plots, and exporting them to external application software. We present two case studies, demonstrating that the CCC-Tool can help domain scientists as well as visualization experts in designing semantically-rich colormaps.",
                "authors": [
                    {
                        "name": "Nardini P."
                    },
                    {
                        "name": "Chen M."
                    },
                    {
                        "name": "Samsel F."
                    },
                    {
                        "name": "Bujack R."
                    },
                    {
                        "name": "Bottinger M."
                    },
                    {
                        "name": "Scheuermann G."
                    }
                ],
                "citationCount": 3,
                "date": "2021-06-01T00:00:00Z",
                "journal": "IEEE Transactions on Visualization and Computer Graphics",
                "title": "The Making of Continuous Colormaps"
            },
            "pmid": "31870986"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Probes and primers",
            "uri": "http://edamontology.org/topic_0632"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Mathematics",
            "uri": "http://edamontology.org/topic_3315"
        }
    ],
    "validated": 1
}