{
    "additionDate": "2021-01-18T11:27:22Z",
    "biotoolsCURIE": "biotools:pathadin",
    "biotoolsID": "pathadin",
    "confidence_flag": "tool",
    "description": "The essential set of tools to start with whole slide analysis. A simple way to experience computer-assisted WSI.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                }
            ]
        }
    ],
    "homepage": "https://gitlab.com/Digipathology/Pathadin",
    "lastUpdate": "2021-01-22T18:04:42Z",
    "license": "GPL-3.0",
    "name": "Pathadin",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1016/J.ACTHIS.2020.151619",
            "metadata": {
                "abstract": "© 2020 Elsevier GmbHPathadin (https://gitlab.com/Digipathology/Pathadin) was designed as a WSI oriented open-source set of tools for beginners to experience the advantages of computer-assisted image analysis and cover essential features, frequently strenuous to access with the alternative programs. It is mainly oriented to work with histology slides but also includes a significant part of modern image formats. Introducing Pathadin, the manuscript aims to improve understanding of contemporary image analysis components, resolve technophobia and misbeliefs in the computational field, simplifying pathology research work, and shifting it into a quantitative paradigm. Despite being easy to use, Pathadin includes both basic and advanced analytical algorithms, as the application of machine learning. The functionality of Pathadin is demonstrated by AI-enhanced quantification of epithelial and stromal changes in prostate carcinoma, and their dependence on ISUP grade. The material included 5 radical prostatectomy samples for training and 83 (including 11 autopsies) samples for analysis. The analytical material was stained with Masson's trichrome and Ki67, as widely available and potentially prognostic markers. An integrated solution by HistomicsTK for Ki67 evaluation was used. A U-net model for separating glands and stroma was trained, simplifying the independent analysis of these components. During the process, the model successfully highlighted glands and stroma. Masson's trichrome stain demonstrated a gradual increase in collagen expression, being statistically significant between controls vs. G1, and G3 vs. G4. Although there was considerable overlap between adjacent groups, there was only a minor overlap in collagen amount between high- and low-grade carcinomas, affirming that with further research, stroma could be an additional diagnostic marker in prostate adenocarcinoma. Ki67 showed a statistically significant gradual increase in all groups except G1 vs. G2 and G4 vs. G5. Pathadin demonstrates that there is no need for significant resources to experience the advantages of modern computer-assisted analysis.",
                "authors": [
                    {
                        "name": "Dzaparidze G."
                    },
                    {
                        "name": "Kazachonok D."
                    },
                    {
                        "name": "Laht K."
                    },
                    {
                        "name": "Taelma H."
                    },
                    {
                        "name": "Minajeva A."
                    }
                ],
                "citationCount": 1,
                "date": "2020-10-01T00:00:00Z",
                "journal": "Acta Histochemica",
                "title": "Pathadin – The essential set of tools to start with whole slide analysis"
            },
            "pmid": "33066841"
        }
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        }
    ],
    "validated": 1
}