{
    "accessibility": "Open access",
    "additionDate": "2022-10-09T20:23:29.443184Z",
    "biotoolsCURIE": "biotools:pras_server",
    "biotoolsID": "pras_server",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Osita Sunday Nnyigide"
        },
        {
            "name": "Tochukwu Olunna Nnyigide"
        },
        {
            "name": "Kyu Hyun",
            "orcidid": "https://orcid.org/0000-0001-5129-5169"
        },
        {
            "name": "Sun-Gu Lee",
            "orcidid": "https://orcid.org/0000-0002-3331-1791"
        }
    ],
    "description": "A Web Server to Repair PDB Structures, Add Missing Heavy Atoms and Hydrogen Atoms, and Assign Secondary Structures by Amide Interactions.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "PDB ID",
                        "uri": "http://edamontology.org/data_1127"
                    }
                }
            ],
            "operation": [
                {
                    "term": "Protein secondary structure assignment",
                    "uri": "http://edamontology.org/operation_0319"
                },
                {
                    "term": "Protein secondary structure comparison",
                    "uri": "http://edamontology.org/operation_2488"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "http://www.protein-science.com",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T15:27:53.822560Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/osita-sunday-nnyigide/Pras_Server"
        }
    ],
    "name": "PRAS",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1021/acs.jcim.2c00571",
            "metadata": {
                "abstract": "The Protein Data Bank (PDB) file format developed at Brookhaven National Laboratory is the most popular file format to store biological data and is widely supported by many software programs for the editing and visualization of macromolecular structures. Unfortunately, many of these structures have variety of issues ranging from missing side chains and/or atoms to alternate locations (rotamers). To fix these flaws, one has to learn a new program, compile modules, and install libraries. To overcome these challenges, we present Protein Repair and Analysis Server (PRAS), an easy-to-use web server to repair protein structures and add missing atoms. The PRAS program flow has two main sections. In the first section, several subroutines are called to deal with sequence microheterogeneity, rotamers, missing side chains, heavy atoms, or hydrogen atoms. A log file is generated detailing irregularities and their fixes as carried out by the program. In the later section, the program uses the error-corrected protein structure to assign secondary structure elements based on amide-amide interactions of the backbone. Plots of four Ramachandran types (general, glycine, proline, and pre-proline) and percentage of secondary structure elements; a log file and the error-corrected PDB file can be downloaded by clicking on the download link generated by the server. The server is freely available and is accessed through its web address at www.protein-science.com. Alternatively, users can download the source code from the server or install the program on their local machines following the instructions at https://pypi.org/project/Pras-Server/ or https://github.com/osita-sunday-nnyigide/Pras_Server. While the present work focuses on the repair of structural data in the PDB format, the server is capable of fixing similar errors in the extensible and newly adopted mmCIF format.",
                "authors": [
                    {
                        "name": "Hyun K."
                    },
                    {
                        "name": "Lee S.-G."
                    },
                    {
                        "name": "Nnyigide O.S."
                    },
                    {
                        "name": "Nnyigide T.O."
                    }
                ],
                "citationCount": 18,
                "date": "2022-09-12T00:00:00Z",
                "journal": "Journal of Chemical Information and Modeling",
                "title": "Protein Repair and Analysis Server: A Web Server to Repair PDB Structures, Add Missing Heavy Atoms and Hydrogen Atoms, and Assign Secondary Structures by Amide Interactions"
            },
            "pmid": "36000562"
        }
    ],
    "toolType": [
        "Library",
        "Web application"
    ],
    "topic": [
        {
            "term": "Protein secondary structure",
            "uri": "http://edamontology.org/topic_3542"
        },
        {
            "term": "Structural biology",
            "uri": "http://edamontology.org/topic_1317"
        }
    ],
    "validated": 1
}
