{
    "additionDate": "2017-01-17T15:02:54Z",
    "biotoolsCURIE": "biotools:gem",
    "biotoolsID": "gem",
    "collectionID": [
        "BioConductor"
    ],
    "credit": [
        {
            "email": "pan_hong@sics.a-star.edu.sg",
            "name": "Hong Pan",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "andrey.shabalin@gmail.com",
            "name": "Andrey Shabalin",
            "orcidid": "http://orcid.org/0000-0003-0309-6821",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://shabal.in/"
        }
    ],
    "description": "Tools for analyzing EWAS, methQTL and GxE genome widely.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://bioconductor.org/packages/release/bioc/html/GEM.html"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://bioconductor/packages/release/bioc/src/contrib/GEM_1.0.0.tar.gz"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Gene expression QTL analysis",
                    "uri": "http://edamontology.org/operation_3232"
                }
            ]
        }
    ],
    "homepage": "http://bioconductor.org/packages/release/bioc/html/GEM.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-30T17:00:32Z",
    "license": "Artistic-2.0",
    "name": "GEM",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "bioconductor_import",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/bts163",
            "metadata": {
                "abstract": "Motivation: Expression quantitative trait loci (eQTL) analysis links variations in gene expression levels to genotypes. For modern datasets, eQTL analysis is a computationally intensive task as it involves testing for association of billions of transcript-SNP (single-nucleotide polymorphism) pair. The heavy computational burden makes eQTL analysis less popular and sometimes forces analysts to restrict their attention to just a small subset of transcript-SNP pairs. As more transcripts and SNPs get interrogated over a growing number of samples, the demand for faster tools for eQTL analysis grows stronger.Results: We have developed a new software for computationally efficient eQTL analysis called Matrix eQTL. In tests on large datasets, it was 2-3 orders of magnitude faster than existing popular tools for QTL/eQTL analysis, while finding the same eQTLs. The fast performance is achieved by special preprocessing and expressing the most computationally intensive part of the algorithm in terms of large matrix operations. Matrix eQTL supports additive linear and ANOVA models with covariates, including models with correlated and heteroskedastic errors. The issue of multiple testing is addressed by calculating false discovery rate; this can be done separately for cis- and trans-eQTLs. © The Author 2012. Published by Oxford University Press. All rights reserved.",
                "authors": [
                    {
                        "name": "Shabalin A.A."
                    }
                ],
                "citationCount": 536,
                "date": "2012-05-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Matrix eQTL: Ultra fast eQTL analysis via large matrix operations"
            },
            "pmcid": "PMC3348564",
            "pmid": "22492648",
            "type": [
                "Primary"
            ]
        },
        {
            "doi": "10.1186/s12859-016-1161-z",
            "metadata": {
                "abstract": "© 2016 The Author(s).Background: The interplay among genetic, environment and epigenetic variation is not fully understood. Advances in high-throughput genotyping methods, high-density DNA methylation detection and well-characterized sample collections, enable epigenetic association studies at the genomic and population levels (EWAS). The field has extended to interrogate the interaction of environmental and genetic (GxE) influences on epigenetic variation. Also, the detection of methylation quantitative trait loci (methQTLs) and their association with health status has enhanced our knowledge of epigenetic mechanisms in disease trajectory. However analysis of this type of data brings computational challenges and there are few practical solutions to enable large scale studies in standard computational environments. Results: GEM is a highly efficient R tool suite for performing epigenome wide association studies (EWAS). GEM provides three major functions named GEM_Emodel, GEM_Gmodel and GEM_GxEmodel to study the interplay of Gene, Environment and Methylation (GEM). Within GEM, the pre-existing \"Matrix eQTL\" package is utilized and extended to study methylation quantitative trait loci (methQTL) and the interaction of genotype and environment (GxE) to determine DNA methylation variation, using matrix based iterative correlation and memory-efficient data analysis. Benchmarking presented here on a publicly available dataset, demonstrated that GEM can facilitate reliable genome-wide methQTL and GxE analysis on a standard laptop computer within minutes. Conclusions: The GEM package facilitates efficient EWAS study in large cohorts. It is written in R code and can be freely downloaded from Bioconductor at https://www.bioconductor.org/packages/GEM/.",
                "authors": [
                    {
                        "name": "Pan H."
                    },
                    {
                        "name": "Holbrook J.D."
                    },
                    {
                        "name": "Karnani N."
                    },
                    {
                        "name": "Kwoh C.K."
                    }
                ],
                "citationCount": 10,
                "date": "2016-08-02T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Gene, Environment and Methylation (GEM): A tool suite to efficiently navigate large scale epigenome wide association studies and integrate genotype and interaction between genotype and environment"
            },
            "pmcid": "PMC4970299",
            "pmid": "27480116",
            "type": [
                "Primary"
            ]
        },
        {
            "doi": "10.1093/bioinformatics/btu146",
            "metadata": {
                "abstract": "Motivation: Next-generation sequencing has become an important tool in molecular biology. Various protocols to investigate genomic, transcriptomic and epigenomic features across virtually all species and tissues have been devised. For most of these experiments, one of the first crucial steps of bioinformatic analysis is the mapping of reads to reference genomes. Results: Here, we present thorough benchmarks of our read aligner segemehl in comparison with other state-of-the-art methods. Furthermore, we introduce the tool lack to rescue unmapped RNA-seq reads which works in conjunction with segemehl and many other frequently used split-read aligners. © The Author 2014.",
                "authors": [
                    {
                        "name": "Otto C."
                    },
                    {
                        "name": "Stadler P.F."
                    },
                    {
                        "name": "Hoffmann S."
                    }
                ],
                "citationCount": 22,
                "date": "2014-07-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Lacking alignments? The next-generation sequencing mapper segemehl revisited"
            },
            "pmid": "24626854",
            "type": [
                "Benchmarking study"
            ]
        }
    ],
    "toolType": [
        "Command-line tool",
        "Library"
    ],
    "topic": [
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "GWAS study",
            "uri": "http://edamontology.org/topic_3517"
        }
    ],
    "validated": 1,
    "version": [
        "1.0.0"
    ]
}