{
    "accessibility": "Open access",
    "additionDate": "2023-03-23T23:54:08.586350Z",
    "biotoolsCURIE": "biotools:magnetique",
    "biotoolsID": "magnetique",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "christoph.dieterich@uni-heidelberg.de",
            "name": "Federico Marini",
            "orcidid": "http://orcid.org/0000-0003-3252-7758",
            "typeEntity": "Person"
        },
        {
            "email": "marinif@uni-mainz.de",
            "name": "Christoph Dieterich",
            "orcidid": "http://orcid.org/0000-0001-9468-6311",
            "typeEntity": "Person"
        },
        {
            "name": "Annekathrin Ludt",
            "orcidid": "http://orcid.org/0000-0002-2475-4945"
        },
        {
            "name": "Thiago Britto-Borges",
            "orcidid": "http://orcid.org/0000-0002-6218-4429"
        }
    ],
    "description": "An interactive web application to explore transcriptome signatures of heart failure.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Differential gene expression profiling",
                    "uri": "http://edamontology.org/operation_3223"
                },
                {
                    "term": "Filtering",
                    "uri": "http://edamontology.org/operation_3695"
                },
                {
                    "term": "Gene-set enrichment analysis",
                    "uri": "http://edamontology.org/operation_2436"
                },
                {
                    "term": "RNA-binding protein prediction",
                    "uri": "http://edamontology.org/operation_3901"
                }
            ]
        }
    ],
    "homepage": "https://shiny.dieterichlab.org/app/magnetique",
    "language": [
        "R"
    ],
    "lastUpdate": "2023-03-23T23:54:08.647790Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/AnnekathrinSilvia/magnetique"
        },
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/dieterich-lab/magnetiqueCode2022"
        }
    ],
    "name": "Magnetique",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1186/s12967-022-03694-z",
            "metadata": {
                "abstract": "Background: Despite a recent increase in the number of RNA-seq datasets investigating heart failure (HF), accessibility and usability remain critical issues for medical researchers. We address the need for an intuitive and interactive web application to explore the transcriptional signatures of heart failure with this work. Methods: We reanalysed the Myocardial Applied Genomics Network RNA-seq dataset, one of the largest publicly available datasets of left ventricular RNA-seq samples from patients with dilated (DCM) or hypertrophic (HCM) cardiomyopathy, as well as unmatched non-failing hearts (NFD) from organ donors and patient characteristics that allowed us to model confounding factors. We analyse differential gene expression, associated pathway signatures and reconstruct signaling networks based on inferred transcription factor activities through integer linear programming. We additionally focus, for the first time, on differential RNA transcript isoform usage (DTU) changes and predict RNA-binding protein (RBP) to target transcript interactions using a Global test approach. We report results for all pairwise comparisons (DCM, HCM, NFD). Results: Focusing on the DCM versus HCM contrast (DCMvsHCM), we identified 201 differentially expressed genes, some of which can be clearly associated with changes in ERK1 and ERK2 signaling. Interestingly, the signs of the predicted activity for these two kinases have been inferred to be opposite to each other: In the DCMvsHCM contrast, we predict ERK1 to be consistently less activated in DCM while ERK2 was more activated in DCM. In the DCMvsHCM contrast, we identified 149 differently used transcripts. One of the top candidates is the O-linked N-acetylglucosamine (GlcNAc) transferase (OGT), which catalyzes a common post-translational modification known for its role in heart arrhythmias and heart hypertrophy. Moreover, we reconstruct RBP – target interaction networks and showcase the examples of CPEB1, which is differentially expressed in the DCMvsHCM contrast. Conclusion: Magnetique (https://shiny.dieterichlab.org/app/magnetique) is the first online application to provide an interactive view of the HF transcriptome at the RNA isoform level and to include transcription factor signaling and RBP:RNA interaction networks. The source code for both the analyses (https://github.com/dieterich-lab/magnetiqueCode2022) and the web application (https://github.com/AnnekathrinSilvia/magnetique) is available to the public. We hope that our application will help users to uncover the molecular basis of heart failure.",
                "authors": [
                    {
                        "name": "Boileau E."
                    },
                    {
                        "name": "Britto-Borges T."
                    },
                    {
                        "name": "Dieterich C."
                    },
                    {
                        "name": "Gjerga E."
                    },
                    {
                        "name": "Ludt A."
                    },
                    {
                        "name": "Marini F."
                    }
                ],
                "date": "2022-12-01T00:00:00Z",
                "journal": "Journal of Translational Medicine",
                "title": "Magnetique: an interactive web application to explore transcriptome signatures of heart failure"
            },
            "pmcid": "PMC9641957",
            "pmid": "36345035"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Cardiology",
            "uri": "http://edamontology.org/topic_3335"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ]
}
