{
    "accessibility": "Open access",
    "additionDate": "2022-07-29T20:52:12.895026Z",
    "biotoolsCURIE": "biotools:gmhcc",
    "biotoolsID": "gmhcc",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "lixt314@jlu.edu.cn",
            "name": "Xiangtao Li",
            "orcidid": "https://orcid.org/0000-0002-8716-9823",
            "typeEntity": "Person"
        },
        {
            "name": "Yifu Lu"
        },
        {
            "name": "Yunhe Wang"
        },
        {
            "name": "Zhiqiang Ma"
        },
        {
            "name": "Zhuohan Yu"
        },
        {
            "name": "Ka-Chun Wong",
            "orcidid": "https://orcid.org/0000-0001-6062-733X"
        }
    ],
    "description": "High-throughput Analysis of Biomolecular Data using Graph-based Multiple Hierarchical Consensus Clustering.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "Differential gene expression profiling",
                    "uri": "http://edamontology.org/operation_3223"
                },
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                }
            ]
        }
    ],
    "homepage": "https://github.com/yifuLu/GMHCC",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2022-07-29T20:52:12.900760Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "https://figshare.com/articles/software/GMHCC/17111291"
        }
    ],
    "name": "GMHCC",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAC290",
            "metadata": {
                "abstract": "© 2022 The Author(s). Published by Oxford University Press. All rights reserved.Motivation: Thanks to the development of high-throughput sequencing technologies, massive amounts of various biomolecular data have been accumulated to revolutionize the study of genomics and molecular biology. One of the main challenges in analyzing this biomolecular data is to cluster their subtypes into subpopulations to facilitate subsequent downstream analysis. Recently, many clustering methods have been developed to address the biomolecular data. However, the computational methods often suffer from many limitations such as high dimensionality, data heterogeneity and noise. Results: In our study, we develop a novel Graph-based Multiple Hierarchical Consensus Clustering (GMHCC) method with an unsupervised graph-based feature ranking (FR) and a graph-based linking method to explore the multiple hierarchical information of the underlying partitions of the consensus clustering for multiple types of biomolecular data. Indeed, we first propose to use a graph-based unsupervised FR model to measure each feature by building a graph over pairwise features and then providing each feature with a rank. Subsequently, to maintain the diversity and robustness of basic partitions (BPs), we propose multiple diverse feature subsets to generate several BPs and then explore the hierarchical structures of the multiple BPs by refining the global consensus function. Finally, we develop a new graph-based linking method, which explicitly considers the relationships between clusters to generate the final partition. Experiments on multiple types of biomolecular data including 35 cancer gene expression datasets and eight single-cell RNA-seq datasets validate the effectiveness of our method over several state-of-the-art consensus clustering approaches. Furthermore, differential gene analysis, gene ontology enrichment analysis and KEGG pathway analysis are conducted, providing novel insights into cell developmental lineages and characterization mechanisms.",
                "authors": [
                    {
                        "name": "Li X."
                    },
                    {
                        "name": "Lu Y."
                    },
                    {
                        "name": "Ma Z."
                    },
                    {
                        "name": "Wang Y."
                    },
                    {
                        "name": "Wong K.-C."
                    },
                    {
                        "name": "Yu Z."
                    }
                ],
                "date": "2022-06-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "GMHCC: High-throughput analysis of biomolecular data using graph-based multiple hierarchical consensus clustering"
            },
            "pmid": "35451457"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Molecular biology",
            "uri": "http://edamontology.org/topic_3047"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Ontology and terminology",
            "uri": "http://edamontology.org/topic_0089"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ],
    "validated": 1
}
