{
    "additionDate": "2020-01-14T08:52:33Z",
    "biotoolsCURIE": "biotools:MiPepid",
    "biotoolsID": "MiPepid",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "mgribsko@purdue.edu",
            "name": "Michael Gribskov",
            "orcidid": "https://orcid.org/0000-0002-1718-0242",
            "typeEntity": "Person"
        }
    ],
    "description": "MicroPeptide identification tool using machine learning.\n\nMiPepid is a software specifically for predicting the coding capabilities of sORFs.\n\nGiven a fasta file containing DNA fasta sequences, for each sequence, MiPepid will find all the sORFs (length <= 303 bp) present in all the 3 translation frames of the sequence, and for each sORF it will return the predicted class label (coding or noncoding) as well as the probability of being in that class. All the results will be written in an output .csv file",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Coding region prediction",
                    "uri": "http://edamontology.org/operation_0436"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                },
                {
                    "term": "miRNA expression analysis",
                    "uri": "http://edamontology.org/operation_3792"
                }
            ]
        }
    ],
    "homepage": "https://github.com/MindAI/MiPepid",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-12-29T08:58:25Z",
    "name": "MiPepid",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12859-019-3033-9",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Micropeptides are small proteins with length < = 100 amino acids. Short open reading frames that could produces micropeptides were traditionally ignored due to technical difficulties, as few small peptides had been experimentally confirmed. In the past decade, a growing number of micropeptides have been shown to play significant roles in vital biological activities. Despite the increased amount of data, we still lack bioinformatics tools for specifically identifying micropeptides from DNA sequences. Indeed, most existing tools for classifying coding and noncoding ORFs were built on datasets in which \"normal-sized\" proteins were considered to be positives and short ORFs were generally considered to be noncoding. Since the functional and biophysical constraints on small peptides are likely to be different from those on \"normal\" proteins, methods for predicting short translated ORFs must be trained independently from those for longer proteins. Results: In this study, we have developed MiPepid, a machine-learning tool specifically for the identification of micropeptides. We trained MiPepid using carefully cleaned data from existing databases and used logistic regression with 4-mer features. With only the sequence information of an ORF, MiPepid is able to predict whether it encodes a micropeptide with 96% accuracy on a blind dataset of high-confidence micropeptides, and to correctly classify newly discovered micropeptides not included in either the training or the blind test data. Compared with state-of-the-art coding potential prediction methods, MiPepid performs exceptionally well, as other methods incorrectly classify most bona fide micropeptides as noncoding. MiPepid is alignment-free and runs sufficiently fast for genome-scale analyses. It is easy to use and is available at https://github.com/MindAI/MiPepid. Conclusions: MiPepid was developed to specifically predict micropeptides, a category of proteins with increasing significance, from DNA sequences. It shows evident advantages over existing coding potential prediction methods on micropeptide identification. It is ready to use and runs fast.",
                "authors": [
                    {
                        "name": "Gribskov M."
                    },
                    {
                        "name": "Zhu M."
                    }
                ],
                "citationCount": 11,
                "date": "2019-11-08T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "MiPepid: MicroPeptide identification tool using machine learning"
            },
            "pmcid": "PMC6842143",
            "pmid": "31703551"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Biophysics",
            "uri": "http://edamontology.org/topic_3306"
        },
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ],
    "validated": 1
}
