{
    "additionDate": "2015-01-22T11:13:26Z",
    "biotoolsCURIE": "biotools:gosummaries",
    "biotoolsID": "gosummaries",
    "collectionID": [
        "Elixir-EE"
    ],
    "credit": [
        {
            "name": "ELIXIR-EE",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        },
        {
            "email": "kolde@ut.ee",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Visualizes the GO enrichment results as word clouds and arranges them together with figures of experimental data. This allows us to draw informative summary plots for analyses such as differential expression or clustering, where for each gene list we display its behaviour in the experiment alongside with its GO annotations.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/raivokolde/GOsummaries"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Nucleic acid features",
                        "uri": "http://edamontology.org/data_1276"
                    }
                }
            ],
            "operation": [
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Image",
                        "uri": "http://edamontology.org/data_2968"
                    }
                }
            ]
        }
    ],
    "homepage": "http://raivokolde.github.io/GOsummaries/",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-10T12:58:51Z",
    "name": "GOsummaries",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "doi": "10.12688/f1000research.6925.1",
            "metadata": {
                "abstract": "© 2015 Kolde R and Vilo J. Functional characterisation of gene lists using Gene Ontology (GO) enrichment analysis is a common approach in computational biology, since many analysis methods end up with a list of genes as a result. Often there can be hundreds of functional terms that are significantly associated with a single list of genes and proper interpretation of such results can be a challenging endeavour. There are methods to visualise and aid the interpretation of these results, but most of them are limited to the results associated with one list of genes. However, in practice the number of gene lists can be considerably higher and common tools are not effective in such situations. We introduce a novel R package, 'GOsummaries' that visualises the GO enrichment results as concise word clouds that can be combined together if the number of gene lists is larger. By also adding the graphs of corresponding raw experimental data, GOsummaries can create informative summary plots for various analyses such as differential expression or clustering. The case studies show that the GOsummaries plots allow rapid functional characterisation of complex sets of gene lists. The GOsummaries approach is particularly effective for Principal Component Analysis (PCA). By adding functional annotation to the principal components, GOsummaries improves significantly the interpretability of PCA results. The GOsummaries layout for PCA can be effective even in situations where we cannot directly apply the GO analysis. For example, in case of metabolomics or metagenomics data it is possible to show the features with significant associations to the components instead of GO terms.",
                "authors": [
                    {
                        "name": "Kolde R."
                    },
                    {
                        "name": "Vilo J."
                    }
                ],
                "citationCount": 11,
                "date": "2015-01-01T00:00:00Z",
                "journal": "F1000Research",
                "title": "GOsummaries: An R Package for Visual Functional Annotation of Experimental Data"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Data architecture, analysis and design",
            "uri": "http://edamontology.org/topic_3365"
        },
        {
            "term": "Data visualisation",
            "uri": "http://edamontology.org/topic_0092"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ],
    "validated": 1,
    "version": [
        "1"
    ]
}