{
    "additionDate": "2018-10-20T00:23:48Z",
    "biotoolsCURIE": "biotools:snpgenesets",
    "biotoolsID": "snpgenesets",
    "credit": [
        {
            "email": "hmei@umc.edu",
            "name": "Hao Mei",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "snpGeneSets is a package that simplifies annotation and analysis of GWS results. The package integrates local copies of knowledge bases for SNPs, genes, and gene sets, and implements wrapper functions in the R language to enable transparent access to low-level databases for efficient annotation of large genomic data.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://www.umc.edu/SoPH/Departments-and-Faculty/Data-Science/files/files/snpgenesets_v1.12.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "SNP annotation",
                    "uri": "http://edamontology.org/operation_3661"
                }
            ]
        }
    ],
    "homepage": "https://www.umc.edu/SoPH/Departments-and-Faculty/Data-Science/Research/Services/Software.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-10T12:59:01Z",
    "license": "Other",
    "name": "snpGeneSets",
    "operatingSystem": [
        "Windows"
    ],
    "owner": "daniel_stefan",
    "publication": [
        {
            "doi": "10.1534/g3.116.034694",
            "metadata": {
                "abstract": "© 2016 Mei et al.Genome-wide studies (GWS) of SNP associations and differential gene expressions have generated abundant results; next-generation sequencing technology has further boosted the number of variants and genes identified. Effective interpretation requires massive annotation and downstream analysis of these genome-wide results, a computationally challenging task. We developed the snpGeneSets package to simplify annotation and analysis of GWS results. Our package integrates local copies of knowledge bases for SNPs, genes, and gene sets, and implements wrapper functions in the R language to enable transparent access to low-level databases for efficient annotation of large genomic data. The package contains functions that execute three types of annotations: (1) genomic mapping annotation for SNPs and genes and functional annotation for gene sets; (2) bidirectional mapping between SNPs and genes, and genes and gene sets; and (3) calculation of gene effect measures from SNP associations and performance of gene set enrichment analyses to identify functional pathways. We applied snpGeneSets to type 2 diabetes (T2D) results from the NHGRI genome-wide association study (GWAS) catalog, a Finnish GWAS, and a genome-wide expression study (GWES). These studies demonstrate the usefulness of snpGeneSets for annotating and performing enrichment analysis of GWS results. The package is open-source, free, and can be downloaded at: https://www.umc.edu/biostats_software/.",
                "authors": [
                    {
                        "name": "Griswold M."
                    },
                    {
                        "name": "Jiang F."
                    },
                    {
                        "name": "Li L."
                    },
                    {
                        "name": "Liu S."
                    },
                    {
                        "name": "Mei H."
                    },
                    {
                        "name": "Mosley T."
                    },
                    {
                        "name": "Simino J."
                    }
                ],
                "citationCount": 5,
                "date": "2016-01-01T00:00:00Z",
                "journal": "G3: Genes, Genomes, Genetics",
                "title": "Snpgenesets: An r package for genome-wide study annotation"
            },
            "pmcid": "PMC5144977",
            "pmid": "27807048",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "GWAS study",
            "uri": "http://edamontology.org/topic_3517"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Nucleic acid structure analysis",
            "uri": "http://edamontology.org/topic_0097"
        }
    ],
    "validated": 1,
    "version": [
        "V1.12"
    ]
}
