{
    "additionDate": "2021-01-18T12:24:50Z",
    "biotoolsCURIE": "biotools:cozine",
    "biotoolsID": "cozine",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "MJHa@mdanderson.org",
            "name": "Min Jin Ha",
            "orcidid": "https://orcid.org/0000-0002-5165-1642",
            "typeEntity": "Person"
        }
    ],
    "description": "The COmpositional Zero-Inflated Network Estimation (COZINE) method for inference of microbial networks which addresses these critical aspects of the data while maintaining computational scalability. COZINE relies on the multivariate Hurdle model to infer a sparse set of conditional dependencies which reflect not only relationships among the continuous values, but also among binary indicators of presence or absence and between the binary and continuous representations of the data.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                },
                {
                    "term": "Relation extraction",
                    "uri": "http://edamontology.org/operation_3625"
                },
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                }
            ]
        }
    ],
    "homepage": "https://github.com/MinJinHa/COZINE",
    "language": [
        "Shell",
        "R",
        "Perl"
    ],
    "lastUpdate": "2021-02-18T14:18:22Z",
    "name": "COZINE",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1186/S12859-020-03911-W",
            "metadata": {
                "abstract": "© 2020, The Author(s).Background: The estimation of microbial networks can provide important insight into the ecological relationships among the organisms that comprise the microbiome. However, there are a number of critical statistical challenges in the inference of such networks from high-throughput data. Since the abundances in each sample are constrained to have a fixed sum and there is incomplete overlap in microbial populations across subjects, the data are both compositional and zero-inflated. Results: We propose the COmpositional Zero-Inflated Network Estimation (COZINE) method for inference of microbial networks which addresses these critical aspects of the data while maintaining computational scalability. COZINE relies on the multivariate Hurdle model to infer a sparse set of conditional dependencies which reflect not only relationships among the continuous values, but also among binary indicators of presence or absence and between the binary and continuous representations of the data. Our simulation results show that the proposed method is better able to capture various types of microbial relationships than existing approaches. We demonstrate the utility of the method with an application to understanding the oral microbiome network in a cohort of leukemic patients. Conclusions: Our proposed method addresses important challenges in microbiome network estimation, and can be effectively applied to discover various types of dependence relationships in microbial communities. The procedure we have developed, which we refer to as COZINE, is available online at https://github.com/MinJinHa/COZINE.",
                "authors": [
                    {
                        "name": "Ha M.J."
                    },
                    {
                        "name": "Kim J."
                    },
                    {
                        "name": "Galloway-Pena J."
                    },
                    {
                        "name": "Do K.-A."
                    },
                    {
                        "name": "Peterson C.B."
                    }
                ],
                "citationCount": 2,
                "date": "2020-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Compositional zero-inflated network estimation for microbiome data"
            },
            "pmcid": "PMC7768662",
            "pmid": "33371887"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Microbial ecology",
            "uri": "http://edamontology.org/topic_3697"
        },
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        },
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        }
    ]
}