{
    "additionDate": "2017-08-03T19:07:38Z",
    "biotoolsCURIE": "biotools:optnetaligncpp",
    "biotoolsID": "optnetaligncpp",
    "credit": [
        {
            "email": "connor.r.clark@gmail.com",
            "name": "Connor Clark",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://github.com/crclark"
        }
    ],
    "description": "A multiobjective memetic algorithm for the problem of PPI network alignment that uses extremely efficient swap-based local search, mutation, and crossover operations to create a population of alignments.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/crclark/optnetaligncpp/blob/master/README.md"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Pathway or network analysis",
                    "uri": "http://edamontology.org/operation_2497"
                }
            ]
        }
    ],
    "homepage": "https://github.com/crclark/optnetaligncpp",
    "language": [
        "C++"
    ],
    "lastUpdate": "2018-12-10T12:58:51Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/optnetaligncpp-optimizing-network-aligner.html"
        }
    ],
    "name": "optnetaligncpp",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "© The Author 2015. Published by Oxford University Press.Motivation: There recently has been great interest in aligning protein-protein interaction (PPI) networks to identify potentially orthologous proteins between species. It is thought that the topological information contained in these networks will yield better orthology predictions than sequence similarity alone. Recent work has found that existing aligners have difficulty making use of both topological and sequence similarity when aligning, with either one or the other being better matched. This can be at least partially attributed to the fact that existing aligners try to combine these two potentially conflicting objectives into a single objective. Results: We present Optnetalign, a multiobjective memetic algorithm for the problem of PPI network alignment that uses extremely efficient swap-based local search, mutation and crossover operations to create a population of alignments. This algorithm optimizes the conflicting goals of topological and sequence similarity using the concept of Pareto dominance, exploring the tradeoff between the two objectives as it runs. This allows us to produce many high-quality candidate alignments in a single run. Our algorithm produces alignments that are much better compromises between topological and biological match quality than previous work, while better characterizing the diversity of possible good alignments between two networks. Our aligner's results have several interesting implications for future research on alignment evaluation, the design of network alignment objectives and the interpretation of alignment results.",
                "authors": [
                    {
                        "name": "Clark C."
                    },
                    {
                        "name": "Kalita J."
                    }
                ],
                "citationCount": 34,
                "date": "2015-06-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "A multiobjective memetic algorithm for PPI network alignment"
            },
            "pmid": "25667548"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Systems biology",
            "uri": "http://edamontology.org/topic_2259"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        }
    ],
    "validated": 1
}