{
    "name": "CANU", 
    "description": "De-novo assembly tool for long read chemistry like Nanopore data and PacBio data.", 
    "homepage": "https://github.com/marbl/canu", 
    "biotoolsID": "canu", 
    "biotoolsCURIE": "biotools:canu", 
    "version": [], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_0524", 
                    "term": "De-novo assembly"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Command-line tool"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_0622", 
            "term": "Genomics"
        }
    ], 
    "operatingSystem": [
        "Linux", 
        "Mac"
    ], 
    "language": [
        "Shell", 
        "Perl"
    ], 
    "license": null, 
    "collectionID": [], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [], 
    "download": [], 
    "documentation": [
        {
            "url": "https://github.com/marbl/canu/blob/master/README.md", 
            "type": "General", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": "10.1101/gr.215087.116", 
            "pmid": null, 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "Canu: Scalable and accurate long-read assembly via adaptive κ-mer weighting and repeat separation", 
                "abstract": "© 2017 Koren et al. Long-read single-molecule sequencing has revolutionized de novo genome assembly and enabled the automated reconstruction of reference-quality genomes. However, given the relatively high error rates of such technologies, efficient and accurate assembly of large repeats and closely related haplotypes remains challenging. We address these issues with Canu, a successor of Celera Assembler that is specifically designed for noisy single-molecule sequences. Canu introduces support for nanopore sequencing, halves depth-of-coverage requirements, and improves assembly continuity while simultaneously reducing runtime by an order of magnitude on large genomes versus Celera Assembler 8.2. These advances result from new overlapping and assembly algorithms, including an adaptive overlapping strategy based on tf-idf weighted MinHash and a sparse assembly graph construction that avoids collapsing diverged repeats and haplotypes. We demonstrate that Canu can reliably assemble complete microbial genomes and near-complete eukaryotic chromosomes using either Pacific Biosciences (PacBio) or Oxford Nanopore technologies and achieves a contig NG50 of >21 Mbp on both human and Drosophila melanogaster PacBio data sets. For assembly structures that cannot be linearly represented, Canu provides graph-based assembly outputs in graphical fragment assembly (GFA) format for analysis or integration with complementary phasing and scaffolding techniques. The combination of such highly resolved assembly graphs with long-range scaffolding information promises the complete and automated assembly of complex genomes.", 
                "date": "2017-05-01T00:00:00Z", 
                "citationCount": 374, 
                "authors": [
                    {
                        "name": "Koren S."
                    }, 
                    {
                        "name": "Walenz B.P."
                    }, 
                    {
                        "name": "Berlin K."
                    }, 
                    {
                        "name": "Miller J.R."
                    }, 
                    {
                        "name": "Bergman N.H."
                    }, 
                    {
                        "name": "Phillippy A.M."
                    }
                ], 
                "journal": "Genome Research"
            }
        }
    ], 
    "credit": [
        {
            "name": null, 
            "email": "adam.phillippy@nih.gov", 
            "url": null, 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "balaji", 
    "additionDate": "2017-11-27T15:24:53Z", 
    "lastUpdate": "2018-12-10T12:58:56Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 1, 
    "homepage_status": 0, 
    "elixir_badge": 0
}