{
    "additionDate": "2017-02-10T11:35:06Z",
    "biotoolsCURIE": "biotools:mavid",
    "biotoolsID": "mavid",
    "description": "Performs multiple sequence alignments for large sequences, constructs phylogenetic trees and displays VISTA plots of conserved regions.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Tree-based sequence alignment",
                    "uri": "http://edamontology.org/operation_0499"
                },
                {
                    "term": "Multiple sequence alignment",
                    "uri": "http://edamontology.org/operation_0492"
                },
                {
                    "term": "Phylogenetic tree generation",
                    "uri": "http://edamontology.org/operation_0323"
                },
                {
                    "term": "Sequence alignment",
                    "uri": "http://edamontology.org/operation_0292"
                }
            ]
        }
    ],
    "homepage": "http://pachterlab.github.io/software.html",
    "homepage_status": 2,
    "lastUpdate": "2018-12-10T12:58:55Z",
    "maturity": "Legacy",
    "name": "MAVID",
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "MAVID is a multiple alignment program suitable for many large genomic regions. The MAVID web server allows biomedical researchers to quickly obtain multiple alignments for genomic sequences and to subsequently analyse the alignments for conserved regions. MAVID has been successfully used for the alignment of closely related species such as primates and also for the alignment of more distant organisms such as human and fugu. The server is fast, capable of aligning hundreds of kilobases in less than a minute. The multiple alignment is used to build a phylogenetic tree for the sequences, which is subsequently used as a basis for identifying conserved regions in the alignment. The server can be accessed at http://baboon.math.berkeley.edu/mavid/.",
                "authors": [
                    {
                        "name": "Bray N."
                    },
                    {
                        "name": "Pachter L."
                    }
                ],
                "citationCount": 50,
                "date": "2003-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "MAVID multiple alignment server"
            },
            "pmid": "12824358"
        },
        {
            "metadata": {
                "abstract": "We describe a new global multiple-alignment program capable of aligning a large number of genomic regions. Our progressive-alignment approach incorporates the following ideas: maximum-likelihood inference of ancestral sequences, automatic guide-tree construction, protein-based anchoring of ab-initio gene predictions, and constraints derived from a global homology map of the sequences. We have implemented these ideas in the MAVID program, which is able to accurately align multiple genomic regions up to megabases long. MAVID is able to effectively align divergent sequences, as well as incomplete unfinished sequences. We demonstrate the capabilities of the program on the benchmark CFTR region, which consists of 1.8 Mb of human sequence and 20 orthologous regions in marsupials, birds, fish, and mammals. Finally, we describe two large MAVID alignments, an alignment of all the available HIV genomes and a multiple alignment of the entire human, mouse, and rat genomes. © 2004 by Cold Spring Harbor Laboratory Press.",
                "authors": [
                    {
                        "name": "Bray N."
                    },
                    {
                        "name": "Pachter L."
                    }
                ],
                "citationCount": 221,
                "date": "2004-04-01T00:00:00Z",
                "journal": "Genome Research",
                "title": "MAVID: Constrained ancestral alignment of multiple sequences"
            },
            "pmid": "15060012"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        },
        {
            "term": "Phylogeny",
            "uri": "http://edamontology.org/topic_0084"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        }
    ],
    "validated": 1
}