{
    "accessibility": "Open access",
    "additionDate": "2022-09-04T12:23:21.740541Z",
    "biotoolsCURIE": "biotools:quco",
    "biotoolsID": "quco",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "smirarab@ucsd.edu",
            "name": "Siavash Mirarab",
            "orcidid": "https://orcid.org/0000-0001-5410-1518",
            "typeEntity": "Person"
        },
        {
            "name": "Maryam Rabiee"
        }
    ],
    "description": "Quartet-based co-estimation of species trees and gene trees.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Phylogenetic inference (maximum likelihood and Bayesian methods)",
                    "uri": "http://edamontology.org/operation_0547"
                },
                {
                    "term": "Phylogenetic tree reconciliation",
                    "uri": "http://edamontology.org/operation_3947"
                },
                {
                    "term": "Species tree construction",
                    "uri": "http://edamontology.org/operation_0544"
                }
            ]
        }
    ],
    "homepage": "https://github.com/maryamrabiee/quco",
    "language": [
        "C++",
        "Python"
    ],
    "lastUpdate": "2024-11-24T15:43:23.801799Z",
    "license": "Apache-2.0",
    "name": "QuCo",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btac265",
            "metadata": {
                "abstract": "Motivation: Phylogenomics faces a dilemma: on the one hand, most accurate species and gene tree estimation methods are those that co-estimate them; on the other hand, these co-estimation methods do not scale to moderately large numbers of species. The summary-based methods, which first infer gene trees independently and then combine them, are much more scalable but are prone to gene tree estimation error, which is inevitable when inferring trees from limited-length data. Gene tree estimation error is not just random noise and can create biases such as long-branch attraction. Results: We introduce a scalable likelihood-based approach to co-estimation under the multi-species coalescent model. The method, called quartet co-estimation (QuCo), takes as input independently inferred distributions over gene trees and computes the most likely species tree topology and internal branch length for each quartet, marginalizing over gene tree topologies and ignoring branch lengths by making several simplifying assumptions. It then updates the gene tree posterior probabilities based on the species tree. The focus on gene tree topologies and the heuristic division to quartets enables fast likelihood calculations. We benchmark our method with extensive simulations for quartet trees in zones known to produce biased species trees and further with larger trees. We also run QuCo on a biological dataset of bees. Our results show better accuracy than the summary-based approach ASTRAL run on estimated gene trees.",
                "authors": [
                    {
                        "name": "Mirarab S."
                    },
                    {
                        "name": "Rabiee M."
                    }
                ],
                "citationCount": 1,
                "date": "2022-07-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "QuCo: Quartet-based co-estimation of species trees and gene trees"
            },
            "pmcid": "PMC9235488",
            "pmid": "35758818"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        },
        {
            "term": "Phylogenomics",
            "uri": "http://edamontology.org/topic_0194"
        },
        {
            "term": "Phylogeny",
            "uri": "http://edamontology.org/topic_0084"
        },
        {
            "term": "Zoology",
            "uri": "http://edamontology.org/topic_3500"
        }
    ],
    "validated": 1
}
