{
    "additionDate": "2024-03-18T16:27:42.028608Z",
    "biotoolsCURIE": "biotools:circust",
    "biotoolsID": "circust",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "yolanda.larriba@uva.es",
            "name": "Yolanda Larriba",
            "orcidid": "https://orcid.org/0000-0003-0254-4928",
            "typeEntity": "Person"
        }
    ],
    "description": "A novel methodology for temporal order reconstruction of molecular rhythms; validation and application towards a daily rhythm gene expression atlas in humans.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Expression correlation analysis",
                    "uri": "http://edamontology.org/operation_3463"
                },
                {
                    "term": "Expression profile clustering",
                    "uri": "http://edamontology.org/operation_0313"
                },
                {
                    "term": "Gene expression profiling",
                    "uri": "http://edamontology.org/operation_0314"
                }
            ]
        }
    ],
    "homepage": "https://github.com/yolandalago/CIRCUST/",
    "language": [
        "R"
    ],
    "lastUpdate": "2024-11-24T14:08:24.414676Z",
    "name": "CIRCUST",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1371/journal.pcbi.1011510",
            "metadata": {
                "abstract": "The circadian system drives near-24-h oscillations in behaviors and biological processes. The underlying core molecular clock regulates the expression of other genes, and it has been shown that the expression of more than 50 percent of genes in mammals displays 24-h rhythmic patterns, with the specific genes that cycle varying from one tissue to another. Determining rhythmic gene expression patterns in human tissues sampled as single timepoints has several challenges, including the reconstruction of temporal order of highly noisy data. Previous methodologies have attempted to address these challenges in one or a small number of tissues for which clock gene evolutionary conservation is assumed to be preserved. Here we introduce CIRCUST, a novel CIRCular-robUST methodology for analyzing molecular rhythms, that relies on circular statistics, is robust against noise, and requires fewer assumptions than existing methodologies. Next, we validated the method against four controlled experiments in which sampling times were known, and finally, CIRCUST was applied to 34 tissues from the Genotype-Tissue Expression (GTEx) dataset with the aim towards building a comprehensive daily rhythm gene expression atlas in humans. The validation and application shown here indicate that CIRCUST provides a flexible framework to formulate and solve the issues related to the analysis of molecular rhythms in human tissues. CIRCUST methodology is publicly available at https://github.com/yolandalago/CIRCUST/.",
                "authors": [
                    {
                        "name": "Larriba Y."
                    },
                    {
                        "name": "Mason I.C."
                    },
                    {
                        "name": "Rueda C."
                    },
                    {
                        "name": "Saxena R."
                    },
                    {
                        "name": "Scheer F.A.J.L."
                    }
                ],
                "citationCount": 1,
                "date": "2023-09-01T00:00:00Z",
                "journal": "PLoS Computational Biology",
                "title": "CIRCUST: A novel methodology for temporal order reconstruction of molecular rhythms; validation and application towards a daily rhythm gene expression atlas in humans"
            },
            "pmcid": "PMC10564179",
            "pmid": "37769026"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Biobank",
            "uri": "http://edamontology.org/topic_3337"
        },
        {
            "term": "Biology",
            "uri": "http://edamontology.org/topic_3070"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ]
}
