{
    "accessibility": "Open access",
    "additionDate": "2022-11-21T12:33:17.821671Z",
    "biotoolsCURIE": "biotools:able",
    "biotoolsID": "able",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "afernandez@hggm.es",
            "name": "Alberto Fernández-Pena",
            "orcidid": "http://orcid.org/0000-0002-2844-2965",
            "typeEntity": "Person"
        },
        {
            "name": "Daniel Martín de Blas",
            "orcidid": "http://orcid.org/0000-0001-6985-9460"
        },
        {
            "name": "Manuel Desco",
            "orcidid": "http://orcid.org/0000-0003-0989-3231"
        },
        {
            "name": "Yasser Alemán-Gómez",
            "orcidid": "http://orcid.org/0000-0001-6067-8639"
        }
    ],
    "description": "Automated Brain Lines Extraction Based on Laplacian Surface Collapse.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Collapsing methods",
                    "uri": "http://edamontology.org/operation_3791"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/HGGM-LIM/ABLE",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2022-11-21T12:33:17.825277Z",
    "license": "MIT",
    "name": "ABLE",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1007/s12021-022-09601-7",
            "metadata": {
                "abstract": "© 2022, The Author(s), under exclusive licence to Springer Science+Business Media, LLC, part of Springer Nature.The archetypical folded shape of the human cortex has been a long-standing topic for neuroscientific research. Nevertheless, the accurate neuroanatomical segmentation of sulci remains a challenge. Part of the problem is the uncertainty of where a sulcus transitions into a gyrus and vice versa. This problem can be avoided by focusing on sulcal fundi and gyral crowns, which represent the topological opposites of cortical folding. We present Automated Brain Lines Extraction (ABLE), a method based on Laplacian surface collapse to reliably segment sulcal fundi and gyral crown lines. ABLE is built to work on standard FreeSurfer outputs and eludes the delineation of anastomotic sulci while maintaining sulcal fundi lines that traverse the regions with the highest depth and curvature. First, it segments the cortex into gyral and sulcal surfaces; then, each surface is spatially filtered. A Laplacian-collapse-based algorithm is applied to obtain a thinned representation of the surfaces. This surface is then used for careful detection of the endpoints of the lines. Finally, sulcal fundi and gyral crown lines are obtained by eroding the surfaces while preserving the connectivity between the endpoints. The method is validated by comparing ABLE with three other sulcal extraction methods using the Human Connectome Project (HCP) test-retest database to assess the reproducibility of the different tools. The results confirm ABLE as a reliable method for obtaining sulcal lines with an accurate representation of the sulcal topology while ignoring anastomotic branches and the overestimation of the sulcal fundi lines. ABLE is publicly available via https://github.com/HGGM-LIM/ABLE.",
                "authors": [
                    {
                        "name": "Aleman-Gomez Y."
                    },
                    {
                        "name": "Carmona S."
                    },
                    {
                        "name": "Desco M."
                    },
                    {
                        "name": "Fernandez-Pena A."
                    },
                    {
                        "name": "Janssen J."
                    },
                    {
                        "name": "M. Gordaliza P."
                    },
                    {
                        "name": "Marcos-Vidal L."
                    },
                    {
                        "name": "Martin de Blas D."
                    },
                    {
                        "name": "Navas-Sanchez F.J."
                    },
                    {
                        "name": "Santonja J."
                    }
                ],
                "date": "2022-01-01T00:00:00Z",
                "journal": "Neuroinformatics",
                "title": "ABLE: Automated Brain Lines Extraction Based on Laplacian Surface Collapse"
            },
            "pmid": "36008650"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ],
    "validated": 1
}
