
{
    "credit": [
        {
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "https://simtk.org/users/altman"
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "https://simtk.org/tracker/?group_id=23"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Structure visualisation",
                    "uri": "http://edamontology.org/operation_0570"
                },
                {
                    "term": "Protein structure analysis",
                    "uri": "http://edamontology.org/operation_2406"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux"
        ],
        "toolType": [
            "Desktop application"
        ],
        "topic": [
            {
                "term": "Molecular modelling",
                "uri": "http://edamontology.org/topic_2275"
            },
            {
                "term": "Protein structure analysis",
                "uri": "http://edamontology.org/topic_2814"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/proteand-1-0-display-macromolecular-structural-uncertainty.html"
        }
    ],
    "publication": [
        {
            "abstract": "Most molecular graphics programs ignore any uncertainty in the atomic coordinates being displayed. Structures are displayed in terms of perfect points, spheres, and lines with no uncertainty. However, all experimental methods for defining structures, and many methods for predicting and comparing structures, associate uncertainties with each atomic coordinate. We have developed graphical representations that highlight these uncertainties. These representations are encapsulated in a new interactive display program, PROTEAND. PROTEAND represents structural uncertainty in three ways: (1) The traditional way: The program shows a collection of structures as superposed and overlapped stick-figure models. (2) Ellipsoids: At each atom position, the program shows an ellipsoid derived from a three-dimensional Gaussian model of uncertainty. This probabilistic model provides additional information about the relationship between atoms that can be displayed as a correlation matrix. (3) Rigid-body volumes: Using clouds of dots, the program can show the range of rigid-body motion of selected substructures, such as individual α helices. We illustrate the utility of these display modalities by the applying PROTEAND to the globin family of proteins, and show that certain types of structural variation are best illustrated with different methods of display. © 1995.",
            "authors": [
                "Altman R.B.",
                "Hughes C.",
                "Gerstein M.B."
            ],
            "cit_count": 12,
            "journal": "Journal of Molecular Graphics",
            "pmid": "7577841",
            "title": "Methods for displaying macromolecular structural uncertainty: Application to the globins",
            "year": "1995-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:proteand",
        "biotoolsID": "proteand",
        "description": "Generate interactive graphical representations that highlight uncertainty in atomic coordinate, in three ways: traditional spheres, ellipsoids, and rigid-body volumes.",
        "homepage": "https://simtk.org/home/proteand",
        "name": "PROTEAND"
    }
}