{"credit":[],"function":[{"operation":[{"term":"Collapsing methods","uri":"http://edamontology.org/operation_3791"},{"term":"Imputation","uri":"http://edamontology.org/operation_3557"},{"term":"Regression analysis","uri":"http://edamontology.org/operation_3659"}]}],"labels":{"language":[],"license":"MIT","topic":[{"term":"GWAS study","uri":"http://edamontology.org/topic_3517"},{"term":"Biobank","uri":"http://edamontology.org/topic_3337"},{"term":"Genotype and phenotype","uri":"http://edamontology.org/topic_0625"},{"term":"Exome sequencing","uri":"http://edamontology.org/topic_3676"}]},"publication":[{"abstract":"© 2019 Wiley Periodicals, Inc.Logistic regression is the primary analysis tool for binary traits in genome-wide association studies (GWAS). Multinomial regression extends logistic regression to multiple categories. However, many phenotypes more naturally take ordered, discrete values. Examples include (a) subtypes defined from multiple sources of clinical information and (b) derived phenotypes generated by specific phenotyping algorithms for electronic health records (EHR). GWAS of ordinal traits have been problematic. Dichotomizing can lead to a range of arbitrary cutoff values, generating inconsistent, hard to interpret results. Using multinomial regression ignores trait value hierarchy and potentially loses power. Treating ordinal data as quantitative can lead to misleading inference. To address these issues, we analyze ordinal traits with an ordered, multinomial model. This approach increases power and leads to more interpretable results. We derive efficient algorithms for computing test statistics, making ordinal trait GWAS computationally practical for Biobank scale data. Our method is available as a Julia package OrdinalGWAS.jl. Application to a COPDGene study confirms previously found signals based on binary case–control status, but with more significance. Additionally, we demonstrate the capability of our package to run on UK Biobank data by analyzing hypertension as an ordinal trait.","authors":["German C.A.","Sinsheimer J.S.","Klimentidis Y.C.","Zhou H.","Zhou J.J."],"cit_count":0,"doi":"10.1002/GEPI.22276","journal":"Genetic Epidemiology","pmid":"31879980","title":"Ordered multinomial regression for genetic association analysis of ordinal phenotypes at Biobank scale","year":"2019-01-01"}],"summary":{"biotoolsCURIE":"biotools:OrdinalGWAS.jl","biotoolsID":"OrdinalGWAS.jl","description":"Ordered multinomial regression for genetic association analysis of ordinal phenotypes at Biobank scale.\n\nGenome-wide association studies (GWAS) for ordered categorical phenotypes.\n\nOrdinalGWAS.jl is a Julia package for performing genome-wide association studies (GWAS) for ordered categorical phenotypes. It is useful when the phenotype takes ordered discrete values, e.g., disease status (undiagnosed, pre-disease, mild, moderate, severe).\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'GWAS'","homepage":"https://github.com/OpenMendel/OrdinalGWAS.jl","name":"OrdinalGWAS.jl"}}