
{
    "credit": [
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "labels": {
        "topic": [
            {
                "term": "Epigenetics",
                "uri": "http://edamontology.org/topic_3295"
            },
            {
                "term": "DNA",
                "uri": "http://edamontology.org/topic_0654"
            },
            {
                "term": "Machine learning",
                "uri": "http://edamontology.org/topic_3474"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© 2018 Elsevier B.V.One of the most important epigenetic modifications is N4-methylcytosine, which regulates many biological processes including DNA replication and chromosome stability. Identification of N4-methylcytosine sites is pivotal to understand specific biological functions. Herein, we developed the first bioinformatics tool called i4mC-ROSE for identifying N4-methylcytosine sites in the genomes of Fragaria vesca and Rosa chinensis in the Rosaceae, which utilizes a random forest classifier with six encoding methods that cover various aspects of DNA sequence information. The i4mC-ROSE predictor achieves area under the curve scores of 0.883 and 0.889 for the two genomes during cross-validation. Moreover, the i4mC-ROSE outperforms other classifiers tested in this study when objectively evaluated on the independent datasets. The proposed i4mC-ROSE tool can serve users' demand for the prediction of 4mC sites in the Rosaceae genome. The i4mC-ROSE predictor and utilized datasets are publicly accessible at http://kurata14.bio.kyutech.ac.jp/i4mC-ROSE/.",
            "authors": [
                "Hasan M.M.",
                "Manavalan B.",
                "Khatun M.S.",
                "Kurata H."
            ],
            "cit_count": 0,
            "doi": "10.1016/J.IJBIOMAC.2019.12.009",
            "journal": "International Journal of Biological Macromolecules",
            "pmid": "31805335",
            "title": "i4mC-ROSE, a bioinformatics tool for the identification of DNA N4-methylcytosine sites in the Rosaceae genome",
            "year": "2019-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:i4mC-ROSE",
        "biotoolsID": "i4mC-ROSE",
        "description": "bioinformatics tool for the identification of DNA N4-methylcytosine sites in the Rosaceae genome.\n\ni4mC-ROSE is available for public",
        "homepage": "http://kurata14.bio.kyutech.ac.jp/i4mC-ROSE/",
        "name": "i4mC-ROSE"
    }
}