{
    "accessibility": "Open access",
    "additionDate": "2023-08-30T13:59:38.109797Z",
    "biotoolsCURIE": "biotools:neuropred-plm",
    "biotoolsID": "neuropred-plm",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "yanw@hust.edu.cn",
            "name": "Zhidong Xue",
            "typeEntity": "Person"
        },
        {
            "email": "zdxue@hust.edu.cn",
            "name": "Yan Wang",
            "typeEntity": "Person"
        }
    ],
    "description": "Interpretable and robust model for neuropeptide prediction by protein language model.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                },
                {
                    "term": "Protein modelling",
                    "uri": "http://edamontology.org/operation_0477"
                }
            ]
        }
    ],
    "homepage": "https://github.com/isyslab-hust/NeuroPred-PLM",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T14:42:33.996890Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "https://pypi.org/project/NeuroPredPLM/"
        }
    ],
    "name": "NeuroPred-PLM",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/bib/bbad077",
            "metadata": {
                "abstract": "Neuropeptides are a diverse and complex class of signaling molecules that regulate a variety of biological processes. Neuropeptides provide many opportunities for the discovery of new drugs and targets for the treatment of a wide range of diseases, and thus, computational tools for the rapid and accurate large-scale identification of neuropeptides are of great significance for peptide research and drug development. Although several machine learning-based prediction tools have been developed, there is room for improvement in the performance and interpretability of the proposed methods. In this work, we developed an interpretable and robust neuropeptide prediction model, named NeuroPred-PLM. First, we employed a language model (ESM) of proteins to obtain semantic representations of neuropeptides, which could reduce the complexity of feature engineering. Next, we adopted a multi-scale convolutional neural network to enhance the local feature representation of neuropeptide embeddings. To make the model interpretable, we proposed a global multi-head attention network that could be used to capture the position-wise contribution to neuropeptide prediction via the attention scores. In addition, NeuroPred-PLM was developed based on our newly constructed NeuroPep 2.0 database. Benchmarks based on the independent test set show that NeuroPred-PLM achieves superior predictive performance compared with other state-of-the-art predictors. For the convenience of researchers, we provide an easy-to-install PyPi package (https://pypi.org/project/NeuroPredPLM/) and a web server (https://huggingface.co/spaces/isyslab/NeuroPred-PLM).",
                "authors": [
                    {
                        "name": "Huang C."
                    },
                    {
                        "name": "Wang L."
                    },
                    {
                        "name": "Wang M."
                    },
                    {
                        "name": "Wang Y."
                    },
                    {
                        "name": "Xue Z."
                    }
                ],
                "citationCount": 14,
                "date": "2023-03-01T00:00:00Z",
                "journal": "Briefings in Bioinformatics",
                "title": "NeuroPred-PLM: an interpretable and robust model for neuropeptide prediction by protein language model"
            },
            "pmid": "36892166"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Drug development",
            "uri": "http://edamontology.org/topic_3373"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
