{
    "accessibility": "Open access",
    "additionDate": "2022-06-20T12:58:00.580959Z",
    "biotoolsCURIE": "biotools:abc4pwm",
    "biotoolsID": "abc4pwm",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "junbai.wang@medisin.uio.no",
            "name": "Junbai Wang",
            "orcidid": "https://orcid.org/0000-0001-5505-5613",
            "typeEntity": "Person"
        }
    ],
    "description": "abc4pwm is a software tool for clustering of pwms, classficiation of pwms to their DNA binding Domain, motif search, and other supportive modules.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "Sequence motif discovery",
                    "uri": "http://edamontology.org/operation_0238"
                },
                {
                    "term": "Sequence motif recognition",
                    "uri": "http://edamontology.org/operation_0239"
                },
                {
                    "term": "Sequence trimming",
                    "uri": "http://edamontology.org/operation_3192"
                }
            ]
        }
    ],
    "homepage": "https://omer0191.github.io/abc4pwm/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-06-20T12:58:00.583973Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/abc4pwm/abc4pwm"
        }
    ],
    "name": "abc4pwm",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1186/S12859-022-04615-Z",
            "metadata": {
                "abstract": "© 2022, The Author(s).Background: Transcription factor (TF) binding motifs are identified by high throughput sequencing technologies as means to capture Protein-DNA interactions. These motifs are often represented by consensus sequences in form of position weight matrices (PWMs). With ever-increasing pool of TF binding motifs from multiple sources, redundancy issues are difficult to avoid, especially when every source maintains its own database for collection. One solution can be to cluster biologically relevant or similar PWMs, whether coming from experimental detection or in silico predictions. However, there is a lack of efficient tools to cluster PWMs. Assessing quality of PWM clusters is yet another challenge. Therefore, new methods and tools are required to efficiently cluster PWMs and assess quality of clusters. Results: A new Python package Affinity Based Clustering for Position Weight Matrices (abc4pwm) was developed. It efficiently clustered PWMs from multiple sources with or without using DNA-Binding Domain (DBD) information, generated a representative motif for each cluster, evaluated the clustering quality automatically, and filtered out incorrectly clustered PWMs. Additionally, it was able to update human DBD family database automatically, classified known human TF PWMs to the respective DBD family, and performed TF motif searching and motif discovery by a new ensemble learning approach. Conclusion: This work demonstrates applications of abc4pwm in the DNA sequence analysis for various high throughput sequencing data using ~ 1770 human TF PWMs. It recovered known TF motifs at gene promoters based on gene expression profiles (RNA-seq) and identified true TF binding targets for motifs predicted from ChIP-seq experiments. Abc4pwm is a useful tool for TF motif searching, clustering, quality assessment and integration in multiple types of sequence data analysis including RNA-seq, ChIP-seq and ATAC-seq.",
                "authors": [
                    {
                        "name": "Ali O."
                    },
                    {
                        "name": "Bjoras M."
                    },
                    {
                        "name": "Farooq A."
                    },
                    {
                        "name": "Jin V.X."
                    },
                    {
                        "name": "Wang J."
                    },
                    {
                        "name": "Yang M."
                    }
                ],
                "date": "2022-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "abc4pwm: affinity based clustering for position weight matrices in applications of DNA sequence analysis"
            },
            "pmcid": "PMC8896320",
            "pmid": "35240993"
        }
    ],
    "toolType": [
        "Command-line tool",
        "Workflow"
    ],
    "topic": [
        {
            "term": "ChIP-on-chip",
            "uri": "http://edamontology.org/topic_3179"
        },
        {
            "term": "ChIP-seq",
            "uri": "http://edamontology.org/topic_3169"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ]
}
