{
    "additionDate": "2021-01-18T08:01:14Z",
    "biotoolsCURIE": "biotools:deqms",
    "biotoolsID": "deqms",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "janne.lehtio@ki.se",
            "name": "Janne Lehtiö",
            "typeEntity": "Person"
        }
    ],
    "description": "DEqMS is a statistical package for testing differential protein expression in quantitative proteomic analysis. It is a method for accurate variance estimation in differential protein expression analysis.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Differential protein expression analysis",
                    "uri": "http://edamontology.org/operation_3741"
                },
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                },
                {
                    "term": "Label-free quantification",
                    "uri": "http://edamontology.org/operation_3634"
                },
                {
                    "term": "TMT-tag",
                    "uri": "http://edamontology.org/operation_3641"
                },
                {
                    "term": "iTRAQ",
                    "uri": "http://edamontology.org/operation_3639"
                }
            ]
        }
    ],
    "homepage": "https://bioconductor.org/packages/release/bioc/html/DEqMS.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-03-01T07:35:58Z",
    "license": "LGPL-3.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/yafeng/DEqMS"
        }
    ],
    "name": "DEqMS",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1074/MCP.TIR119.001646",
            "metadata": {
                "abstract": "© 2020 Zhu et al. Published by The American Society for Biochemistry and Molecular Biology, Inc.Quantitative proteomics by mass spectrometry is widely used in biomarker research and basic biology research for investigation of phenotype level cellular events. Despite the wide application, the methodology for statistical analysis of differentially expressed proteins has not been unified. Various methods such as t test, linear model and mixed effect models are used to define changes in proteomics experiments. However, none of these methods consider the specific structure of MS-data. Choices between methods, often originally developed for other types of data, are based on compromises between features such as statistical power, general applicability and user friendliness. Furthermore, whether to include proteins identified with one peptide in statistical analysis of differential protein expression varies between studies. Here we present DEqMS, a robust statistical method developed specifically for differential protein expression analysis in mass spectrometry data. In all data sets investigated there is a clear dependence of variance on the number of PSMs or peptides used for protein quantification. DEqMS takes this feature into account when assessing differential protein expression. This allows for a more accurate data-dependent estimation of protein variance and inclusion of single peptide identifications without increasing false discoveries. The method was tested in several data sets including E. coli proteome spike-in data, using both label-free and TMT-labeled quantification. Compared with previous statistical methods used in quantitative proteomics, DEqMS showed consistently better accuracy in detecting altered protein levels compared with other statistical methods in both label-free and labeled quantitative proteomics data. DEqMS is available as an R package in Bioconductor.",
                "authors": [
                    {
                        "name": "Anders S."
                    },
                    {
                        "name": "Johansson H.J."
                    },
                    {
                        "name": "Lehtio J."
                    },
                    {
                        "name": "Malyutina A."
                    },
                    {
                        "name": "Mermelekas G."
                    },
                    {
                        "name": "Orre L.M."
                    },
                    {
                        "name": "Tran Y.Z."
                    },
                    {
                        "name": "Zhu Y."
                    }
                ],
                "citationCount": 10,
                "date": "2020-03-23T00:00:00Z",
                "journal": "Molecular and Cellular Proteomics",
                "title": "DEqMS: A method for accurate variance estimation in differential protein expression analysis"
            },
            "pmcid": "PMC7261819",
            "pmid": "32205417"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Protein expression",
            "uri": "http://edamontology.org/topic_0108"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
