
{
    "credit": [
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Genome comparison",
                    "uri": "http://edamontology.org/operation_3209"
                }
            ]
        }
    ],
    "labels": {
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Gene transcripts",
                "uri": "http://edamontology.org/topic_3512"
            },
            {
                "term": "Gene expression",
                "uri": "http://edamontology.org/topic_0203"
            }
        ]
    },
    "publication": [
        {
            "abstract": "An increasing number of eukaryotic and prokaryotic genes are being found to have natural antisense transcripts (NATs). There is also growing evidence to suggest that antisense transcription could play a key role in many human diseases. Consequently, there have been several recent attempts to set up computational procedures aimed at identifying novel NATs. Our group has developed the AntiHunter program for the identification of expressed sequence tag (EST) antisense transcripts from BLAST output. In order to perform an analysis, the program requires a genomic sequence plus an associated list of transcript names and coordinates of the genomic region. After masking the repeated regions, the program carries out a BLASTN search of this sequence in the selected EST database, reporting via email the EST entries that reveal an antisense transcript according to the user-supplied list. Here, we present the newly developed version 2.0 of the AntiHunter tool. Several improvements have been added to this version of the program in order to increase its ability to detect a larger number of antisense ESTs. As a result, AntiHunter can now detect, on average, >45% more antisense ESTs with little or no increase in the percentage of the false positives. We also raised the maximum query size to 3 Mb (previously 1 Mb). Moreover, we found that a reasonable trade-off between the program search sensitivity and the maximum allowed size of the input-query sequence could be obtained by querying the database with the MEGABLAST program, rather than by using the BLAST one. We now offer this new opportunity to users, i.e. if choosing the MEGABLAST option, users can input a query sequence up to 30 Mb long, thus considerably improving the possibility to analyze longer query regions. The AntiHunter tool is freely available at http://bioinfo.crs4.it/AH2.0. © 2005 Oxford University Press.",
            "authors": [
                "Lavorgna G.",
                "Triunfo R.",
                "Santoni F.",
                "Orfanelli U.",
                "Noci S.",
                "Bulfone A.",
                "Zanetti G.",
                "Casari G."
            ],
            "cit_count": 11,
            "journal": "Nucleic Acids Research",
            "pmid": "15980558",
            "title": "AntiHunter 2.0: Increased speed and sensitivity in searching BLAST output for EST antisense transcripts",
            "year": "2005-07-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:antihunter_2.0",
        "biotoolsID": "antihunter_2.0",
        "description": "Tool to detect potential EST antisense transcripts within a given genomic region from the analysis of BLAST output.",
        "homepage": "http://bio.ifom-ieo-campus.it/antihunter",
        "name": "AntiHunter 2.0"
    }
}