
{
    "credit": [
        {
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://bioinfo.sookmyung.ac.kr/"
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://lage.sookmyung.ac.kr/help.html"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Microarray data analysis",
                    "uri": "http://edamontology.org/operation_2495"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Gene expression",
                "uri": "http://edamontology.org/topic_0203"
            },
            {
                "term": "Databases",
                "uri": "http://edamontology.org/topic_3489"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/gs-lage-gene-specific-analysis-of-microarray-global-data.html"
        }
    ],
    "publication": [
        {
            "abstract": "Motivation: It is expected that individual genes have intrinsically different variability in the global expressional trend among them. Thus, the consideration of gene-specific expressional properties will help us to distinguish target-selective gene expression over non-selective over-expression. Results: The re-standardization and integration of heterogeneous microarray datasets, available from public databases, have enabled us to determine the global expression properties of individual genes across a wide variety of experimental conditions and samples. The global averages and SDs of expression for each gene in the integrated microarray datasets were found to be intrinsic properties, which were consistent among independent collections of datasets using different microarray platforms. Using the genespecific intrinsic parameters to rescale the microarray data, we were able to distinguish novel selective gene expression [cartilage oligomeric matrix protein (COMP) and Collagen X] in breast cancer tissues from non-selective over-expression, a difference that has not been detectable by conventional methods. © The Author 2010.",
            "authors": [
                "Kim C.",
                "Choi J.",
                "Park H.",
                "Park Y.",
                "Park J.",
                "Park T.",
                "Cho K.",
                "Yang Y.",
                "Yoon S."
            ],
            "cit_count": 7,
            "doi": "10.1093/bioinformatics/btq279",
            "journal": "Bioinformatics",
            "title": "Global analysis of microarray data reveals intrinsic properties in gene expression and tissue selectivity",
            "type": "Primary",
            "year": "2010-05-28"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:gs-lage",
        "biotoolsID": "gs-lage",
        "description": "GS-LAGE (Gene Specific Large-scale Analysis of Gene Expression) is a global analysis strategy for large-scale microarray datasets integrated from public databases such as NCBI GEO.",
        "homepage": "http://lage.sookmyung.ac.kr/",
        "name": "GS-LAGE"
    }
}