{
    "additionDate": "2021-01-18T07:45:35Z",
    "biotoolsCURIE": "biotools:pdac-ann",
    "biotoolsID": "pdac-ann",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "leandromartins@ufba.br",
            "name": "Leandro Martins de Freitas",
            "orcidid": "https://orcid.org/0000-0003-4327-2922",
            "typeEntity": "Person"
        }
    ],
    "description": "PDAC-ANN is an artificial neural network to predict pancreatic ductal adenocarcinoma based on gene expression.\n\nThe script runs a deep learning model (PDAC-ANN) to classify samples in normal or pancreatic ductal adenocarcinoma (PDAC) using gene expression information. The genes for the prediction are AHNAK Nucleoprotein 2 (AHNAK2),Laminin Subunit Beta 3 (LAMB3), Laminin Subunit Gamma 2 (LAMC2),Keratin 19 (KRT19), and S100 Calcium Binding Protein P (S100P).",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Differential gene expression analysis",
                    "uri": "http://edamontology.org/operation_3223"
                },
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                },
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                }
            ]
        }
    ],
    "homepage": "https://github.com/freitasleandro/PDAC-ANN",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-01-23T07:06:12Z",
    "license": "GPL-3.0",
    "name": "PDAC-ANN",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1186/S12885-020-6533-0",
            "metadata": {
                "abstract": "© 2020 The Author(s).Background: Although the pancreatic ductal adenocarcinoma (PDAC) presents high mortality and metastatic potential, there is a lack of effective therapies and a low survival rate for this disease. This PDAC scenario urges new strategies for diagnosis, drug targets, and treatment. Methods: We performed a gene expression microarray meta-analysis of the tumor against normal tissues in order to identify differentially expressed genes (DEG) shared among all datasets, named core-genes (CG). We confirmed the CG protein expression in pancreatic tissue through The Human Protein Atlas. It was selected five genes with the highest area under the curve (AUC) among these proteins with expression confirmed in the tumor group to train an artificial neural network (ANN) to classify samples. Results: This microarray included 461 tumor and 187 normal samples. We identified a CG composed of 40 genes, 39 upregulated, and one downregulated. The upregulated CG included proteins and extracellular matrix receptors linked to actin cytoskeleton reorganization. With the Human Protein Atlas, we verified that fourteen genes of the CG are translated, with high or medium expression in most of the pancreatic tumor samples. To train our ANN, we selected the best genes (AHNAK2, KRT19, LAMB3, LAMC2, and S100P) to classify the samples based on AUC using mRNA expression. The network classified tumor samples with an f1-score of 0.83 for the normal samples and 0.88 for the PDAC samples, with an average of 0.86. The PDAC-ANN could classify the test samples with a sensitivity of 87.6 and specificity of 83.1. Conclusion: The gene expression meta-analysis and confirmation of the protein expression allow us to select five genes highly expressed PDAC samples. We could build a python script to classify the samples based on RNA expression. This software can be useful in the PDAC diagnosis.",
                "authors": [
                    {
                        "name": "Almeida P.P."
                    },
                    {
                        "name": "Cardoso C.P."
                    },
                    {
                        "name": "De Freitas L.M."
                    }
                ],
                "citationCount": 7,
                "date": "2020-01-31T00:00:00Z",
                "journal": "BMC Cancer",
                "title": "PDAC-ANN: An artificial neural network to predict pancreatic ductal adenocarcinoma based on gene expression"
            },
            "pmcid": "PMC6995241",
            "pmid": "32005189"
        }
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Protein expression",
            "uri": "http://edamontology.org/topic_0108"
        }
    ],
    "validated": 1
}