
{
    "credit": [
        {
            "email": "xing@biology.rutgers.edu",
            "name": "Jinchuan Xing",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        },
        {
            "email": "ysun@diagnoa.com",
            "name": "Yazhou Sun",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "https://www.npmjs.com/package/pipelinedog"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Formatting",
                    "uri": "http://edamontology.org/operation_0335"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "JavaScript"
        ],
        "operatingSystem": [
            "Linux",
            "Mac"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Bioinformatics",
                "uri": "http://edamontology.org/topic_0091"
            },
            {
                "term": "Data management",
                "uri": "http://edamontology.org/topic_3071"
            },
            {
                "term": "Laboratory information management",
                "uri": "http://edamontology.org/topic_0607"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© The Author 2017. Published by Oxford University Press. All rights reserved. For Permissions, please e-mail: journals.permissions@oup.com. Analysis pipelines are an essential part of bioinformatics research, and ad hoc pipelines are frequently created by researchers for prototyping and proof-of-concept purposes. However, most existing pipeline management system or workflow engines are too complex for rapid prototyping or learning the pipeline concept. A lightweight, user-friendly and flexible solution is thus desirable. In this study, we developed a new pipeline construction and maintenance tool, PipelineDog. This is a web-based integrated development environment with a modern web graphical user interface. It offers cross-platform compatibility, project management capabilities, code formatting and error checking functions and an online repository. It uses an easy-to-read/write script system that encourages code reuse. With the online repository, it also encourages sharing of pipelines, which enhances analysis reproducibility and accountability. For most users, PipelineDog requires no software installation. Overall, this web application provides a way to rapidly create and easily manage pipelines. Availability and implementation PipelineDog web app is freely available at http://web.pipeline.dog. The command line version is available at http://www.npmjs.com/package/pipelinedog and online repository at http://repo.pipeline.dog. Contact ysun@kean.edu or xing@biology.rutgers.edu or ysun@diagnoa.com Supplementary informationSupplementary dataare available at Bioinformatics online.",
            "authors": [
                "Zhou A.",
                "Zhang Y.",
                "Sun Y.",
                "Xing J."
            ],
            "cit_count": 0,
            "doi": "10.1093/bioinformatics/btx759",
            "journal": "Bioinformatics",
            "title": "PipelineDog: A simple and flexible graphic pipeline construction and maintenance tool",
            "year": "2018-05-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:pipelinedog",
        "biotoolsID": "pipelinedog",
        "description": "Simple and flexible graphic pipeline construction and maintenance tool.",
        "homepage": "https://www.npmjs.com/package/pipelinedog",
        "name": "PipelineDog"
    }
}