{
    "additionDate": "2017-02-14T09:34:53Z",
    "biotoolsCURIE": "biotools:biomet_toolbox",
    "biotoolsID": "biomet_toolbox",
    "credit": [
        {
            "email": "biomet2@sysbio.se",
            "name": "Intawat Nookaew",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "BioMet Toolbox 2.0 is a web server for genome-wide analysis of metabolism and omics data. BioMet Toolbox exploits the capabilites of metabolic networks described in genome scale models using flux analysis and random sampling, and gene set analysis and basic microarray analysis, thereby providing an integrated analysis to identify coregulated subnetwork structures within the metabolic network and also for identifying statistically significant gene sets enabling biological interpretation.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://biomet-toolbox.chalmers.se/index.php?page=about"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Pathway or network analysis",
                    "uri": "http://edamontology.org/operation_2497"
                },
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                },
                {
                    "term": "Metabolic labeling",
                    "uri": "http://edamontology.org/operation_3715"
                },
                {
                    "term": "Gene-set enrichment analysis",
                    "uri": "http://edamontology.org/operation_2436"
                },
                {
                    "term": "Metabolic network modelling",
                    "uri": "http://edamontology.org/operation_3660"
                },
                {
                    "term": "Modelling and simulation",
                    "uri": "http://edamontology.org/operation_2426"
                }
            ]
        }
    ],
    "homepage": "http://biomet-toolbox.chalmers.se/",
    "language": [
        "JavaScript",
        "PHP",
        "MATLAB",
        "C++"
    ],
    "lastUpdate": "2019-02-16T11:37:44Z",
    "name": "BioMet Toolbox",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "The rapid progress of molecular biology tools for directed genetic modifications, accurate quantita-tive experimental approaches, high-throughput measurements, together with development of genome sequencing has made the foundation for a new area of metabolic engineering that is driven by metabolic models. Systematic analysis of biological processes by means of modelling and simulations has made the identification of metabolic networks and prediction of metabolic capabilities under dif-ferent conditions possible. For facilitating such systemic analysis, we have developed the BioMet Toolbox, a web-based resource for stoichiometric analysis and for integration of transcriptome and interactome data, thereby exploiting the capabilities of genome-scale metabolic models. The BioMet Toolbox provides an effective user-friendly way to perform linear programming simulations towards maximized or minimized growth rates, substrate uptake rates and metabolic production rates by de-tecting relevant fluxes, simulate single and double gene deletions or detect metabolites around which major transcriptional changes are concentrated. These tools can be used for high-throughput in silico screening and allows fully standardized simulations. Model files for various model organ-isms (fungi and bacteria) are included. Overall, the BioMet Toolbox serves as a valuable resource for exploring the capabilities of these metabolic networks. BioMet Toolbox is freely available at www.sysbio.se/BioMet/. © The Author(s) 2010. Published by Oxford University Press.",
                "authors": [
                    {
                        "name": "Cvijovic M."
                    },
                    {
                        "name": "Olivares-Hernandez R."
                    },
                    {
                        "name": "Agren R."
                    },
                    {
                        "name": "Dahr N."
                    },
                    {
                        "name": "Vongsangnak W."
                    },
                    {
                        "name": "Nookaew I."
                    },
                    {
                        "name": "Patil K.R."
                    },
                    {
                        "name": "Nielsen J."
                    }
                ],
                "citationCount": 83,
                "date": "2010-05-18T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "BioMet Toolbox: Genome-wide analysis of metabolism"
            },
            "pmid": "20483918",
            "type": [
                "Primary"
            ]
        },
        {
            "doi": "10.1093/nar/gku371",
            "metadata": {
                "abstract": "Analysis of large data sets using computational and mathematical tools have become a central part of biological sciences. Large amounts of data are being generated each year from different biological research fields leading to a constant development of software and algorithms aimed to deal with the increasing creation of information. The BioMet Toolbox 2.0 integrates a number of functionalities in a user-friendly environment enabling the user to work with biological data in a web interface. The unique and distinguishing feature of the BioMet Toolbox 2.0 is to provide a web user interface to tools for metabolic pathways and omics analysis developed under different platform-dependent environments enabling easy access to these computational tools. © 2014 The Author(s).",
                "authors": [
                    {
                        "name": "Garcia-Albornoz M."
                    },
                    {
                        "name": "Thankaswamy-Kosalai S."
                    },
                    {
                        "name": "Nilsson A."
                    },
                    {
                        "name": "Varemo L."
                    },
                    {
                        "name": "Nookaew I."
                    },
                    {
                        "name": "Nielsen J."
                    }
                ],
                "citationCount": 27,
                "date": "2014-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "BioMet Toolbox 2.0: Genome-wide analysis of metabolism and omics data"
            },
            "pmcid": "PMC4086127",
            "pmid": "24792167",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application",
        "Suite"
    ],
    "topic": [
        {
            "term": "Endocrinology and metabolism",
            "uri": "http://edamontology.org/topic_3407"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        }
    ],
    "validated": 1
}