{
    "additionDate": "2022-01-03T07:27:20.890588Z",
    "biotoolsCURIE": "biotools:xaom",
    "biotoolsID": "xaom",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "istajduh@riteh.hr",
            "name": "Ivan Štajduhar",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "XAOM (X-ray Alignment and Orientation Method) is a method for automatic alignment and orientation of radiographs for computer-aided medical diagnosis.  XAOM is a two-stage method for X-ray image alignment and orientation. The first stage of the XAOM is aligning images, while the second stage is orienting them by giving an orientation label (north, south, east, west).",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Principal component analysis",
                    "uri": "http://edamontology.org/operation_3960"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/fhrzic/XAOM",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-01-03T07:27:20.893121Z",
    "license": "GPL-2.0",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/fhrzic/XAOM/issues"
        }
    ],
    "name": "XAOM",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1016/J.COMPBIOMED.2021.104300",
            "metadata": {
                "abstract": "© 2021 Elsevier LtdBackground and objectives: Computer-aided diagnosis relies on machine learning algorithms that require filtered and preprocessed data as the input. Aligning the image in the desired direction is an additional manual step in post-processing, commonly overlooked due to workload issues. Several state-of-the-art approaches for fracture detection and disease-struck region segmentation benefit from correctly oriented images, thus requiring such preprocessing of X-ray images. Furthermore, it is desirable to have archived studies in a standardized format. Radiograph hanging protocols also differ from case to case, which means that images are not always aligned and oriented correctly. As a solution, the paper proposes XAOM, an X-ray Alignment and Orientation Method for images from 21 different body regions. Methods: Typically, other methods are crafted for this purpose to suit a specific body region and form of usage. In contrast, the method proposed in this paper is comprehensive and easily tuned to align and orient X-ray images of any body region. XAOM consists of two stages. For the first stage of the method, aligning X-ray images, we experimented with the following approaches: Hough transform, Fast line detection algorithm, and Principal Component Analysis method. For the second stage, we have experimented with the adaptations of several well known convolutional neural network topologies for correctly predicting image orientation: LeNet5, AlexNet, VGG16, VGG19, and ResNet50. Results: In the first stage, the PCA-based approach performed best. The average difference between the angle detected by the algorithm and the angle marked by the experts on the test set containing 200 pediatric X-ray images was 1.65∘, while the median value was 0.11∘. In the second stage, the VGG16-based network topology achieved the best accuracy of 0.993 on a test set containing 4,221 images. Conclusion: XAOM is highly accurate at aligning and orienting pediatric X-ray images of 21 common body regions according to a set standard. The proposed method is also robust and can be easily adjusted to the different alignment and rotation criteria. Availability: The Python source code of the best performing implementation of XAOM is publicly available at https://github.com/fhrzic/XAOM.",
                "authors": [
                    {
                        "name": "Hrzic F."
                    },
                    {
                        "name": "Sorantin E."
                    },
                    {
                        "name": "Stajduhar I."
                    },
                    {
                        "name": "Tschauner S."
                    }
                ],
                "citationCount": 2,
                "date": "2021-05-01T00:00:00Z",
                "journal": "Computers in Biology and Medicine",
                "title": "XAOM: A method for automatic alignment and orientation of radiographs for computer-aided medical diagnosis"
            },
            "pmid": "33714842",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Structure analysis",
            "uri": "http://edamontology.org/topic_0081"
        }
    ]
}
