{
    "accessibility": "Open access",
    "additionDate": "2022-07-24T21:25:03.445873Z",
    "biotoolsCURIE": "biotools:sriq",
    "biotoolsID": "sriq",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "johan.staaf@med.lu.se",
            "name": "Johan Staaf",
            "orcidid": "https://orcid.org/0000-0001-5254-5115",
            "typeEntity": "Person"
        },
        {
            "email": "srinivas.veerla@med.lu.se",
            "name": "Srinivas Veerla",
            "orcidid": "https://orcid.org/0000-0001-7328-6239",
            "typeEntity": "Person"
        },
        {
            "name": "Jacob Karlström"
        },
        {
            "name": "Mattias Aine",
            "orcidid": "https://orcid.org/0000-0002-0851-5952"
        }
    ],
    "description": "This is an implementation of Systematic Random forest Integration to Qualitative threshold (SRIQ) clustering. SRIQ clusters by finding a core clusters of highly correlated observations, then spiralling out from them to create bigger clusters. SRIQ evaluates clustering solution stability on its own and won't need user input for what number of cluster solutions to be evaluated.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "Differential gene expression profiling",
                    "uri": "http://edamontology.org/operation_3223"
                },
                {
                    "term": "Expression correlation analysis",
                    "uri": "http://edamontology.org/operation_3463"
                }
            ]
        }
    ],
    "homepage": "https://github.com/StaafLab/SRIQ",
    "language": [
        "Java",
        "Python"
    ],
    "lastUpdate": "2022-07-24T21:25:03.449179Z",
    "license": "GPL-3.0",
    "name": "SRIQ",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1016/J.CSBJ.2022.03.036",
            "metadata": {
                "abstract": "© 2022 The Author(s)Gene expression profiling together with unsupervised analysis methods, typically clustering methods, has been used extensively in cancer research to unravel, e.g., new molecular subtypes that hold promise of disease refinement that may ultimately benefit patients. However, many of the commonly used methods require a prespecified number of clusters to extract and frequently require some type of feature pre-selection, e.g. variance filtering. This introduces subjectivity to the process of cluster discovery and the definition of putative novel tumor subtypes. Here, we introduce SRIQ, a novel unsupervised clustering method that could circumvent some of the issues in commonly used unsupervised analysis methods. SRIQ incorporates concepts from random forest machine learning as well as quality threshold- and k-nearest neighbor clustering. It is implemented as a Java and Python pipeline including data pre-processing, differential expression analysis, and pathway analysis. Using 434 lung adenocarcinomas profiled by RNA sequencing, we demonstrate the technical reproducibility of SRIQ and benchmark its performance compared to the commonly used consensus clustering method. Based on differential gene expression analysis and auxiliary molecular data we show that SRIQ can define new tumor subsets that appear biologically relevant and consistent compared and that these new subgroups seem to refine existing transcriptional subtypes that were defined using consensus clustering. Together, this provides support that SRIQ may be a useful new tool for unsupervised analysis of gene expression data from human malignancies.",
                "authors": [
                    {
                        "name": "Aine M."
                    },
                    {
                        "name": "Karlstrom J."
                    },
                    {
                        "name": "Staaf J."
                    },
                    {
                        "name": "Veerla S."
                    }
                ],
                "date": "2022-01-01T00:00:00Z",
                "journal": "Computational and Structural Biotechnology Journal",
                "title": "SRIQ clustering: A fusion of Random Forest, QT clustering, and KNN concepts"
            },
            "pmcid": "PMC9010551",
            "pmid": "35465158"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Epigenomics",
            "uri": "http://edamontology.org/topic_3173"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ]
}
