{"credit":[{"email":"jy2@bcm.edu","typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://www.hgsc.bcm.tmc.edu/"},{"email":"fyu@bcm.edu","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"https://www.hgsc.bcm.edu/sites/default/files/software/SNPTools/SNPTools.txt"}],"function":[{"operation":[{"term":"SNP detection","uri":"http://edamontology.org/operation_0484"},{"term":"Genetic variation analysis","uri":"http://edamontology.org/operation_3197"}]}],"labels":{"language":["C++"],"operatingSystem":["Linux"],"toolType":["Suite"],"topic":[{"term":"DNA polymorphism","uri":"http://edamontology.org/topic_2885"},{"term":"Sequencing","uri":"http://edamontology.org/topic_3168"},{"term":"Genetics","uri":"http://edamontology.org/topic_3053"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/snptools-1-0-snp-analysis-generation-sequencing-data.html"}],"publication":[{"abstract":"Next-generation sequencing is a powerful approach for discovering genetic variation. Sensitive variant calling and hap-lotype inference from population sequencing data remain challenging. We describe methods for high-quality discovery, genotyping, and phasing of SNPs for low-coverage (approximately 53) sequencing of populations, implemented in a pipeline called SNPTools. Our pipeline contains several innovations that specifically address challenges caused by low-coverage population sequencing: (1) effective base depth (EBD), a nonparametric statistic that enables more accurate statistical modeling of sequencing data; (2) variance ratio scoring, a variance-based statistic that discovers polymorphic loci with high sensitivity and specificity; and (3) BAM-specific binomial mixture modeling (BBMM), a clustering algorithm that generates robust genotype likelihoods from heterogeneous sequencing data. Last, we develop an imputation engine that refines raw genotype likelihoods to produce high-quality phased genotypes/haplotypes. Designed for large population studies, SNPTools' input/output (I/O) and storage aware design leads to improved computing performance on large sequencing data sets. We apply SNPTools to the International 1000 Genomes Project (1000G) Phase 1 low-coverage data set and obtain genotyping accuracy comparable to that of SNP microarray. © 2013, Published by Cold Spring Harbor Laboratory Press.","authors":["Wang Y.","Lu J.","Yu J.","Gibbs R.A.","Yu F."],"cit_count":40,"journal":"Genome Research","pmid":"23296920","title":"An integrative variant analysis pipeline for accurate genotype/haplotype inference in population NGS data","year":"2013-05-01"}],"summary":{"biotoolsCURIE":"biotools:snptools","biotoolsID":"snptools","description":"A suite of tools that enables integrative SNP analysis in next generation sequencing data with large cohorts. It not only calls SNP in a population with high sensitivity and accuracy, but also employs a novel imputation engine to achieve highly accurate genotype calls in an efficient way.","homepage":"https://www.hgsc.bcm.edu/software/snptools","name":"SNPTools"}}