{
    "accessibility": "Open access",
    "additionDate": "2024-05-06T09:30:27.917035Z",
    "biotoolsCURIE": "biotools:alerax",
    "biotoolsID": "alerax",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "benoit.morel@h-its.org",
            "name": "Benoit Morel",
            "typeEntity": "Person"
        },
        {
            "name": "Gergely J Szöllősi",
            "typeEntity": "Person"
        }
    ],
    "description": "A tool for gene and species tree co-estimation and reconciliation under a probabilistic model of gene duplication, transfer, and loss.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene tree construction",
                    "uri": "http://edamontology.org/operation_0553"
                },
                {
                    "term": "Phylogenetic reconstruction",
                    "uri": "http://edamontology.org/operation_3478"
                },
                {
                    "term": "Phylogenetic tree reconciliation",
                    "uri": "http://edamontology.org/operation_3947"
                },
                {
                    "term": "Species tree construction",
                    "uri": "http://edamontology.org/operation_0544"
                },
                {
                    "term": "Tree dating",
                    "uri": "http://edamontology.org/operation_3942"
                }
            ]
        }
    ],
    "homepage": "https://github.com/BenoitMorel/AleRax",
    "language": [
        "C++",
        "Python"
    ],
    "lastUpdate": "2024-11-24T14:01:31.758853Z",
    "license": "GPL-3.0",
    "name": "AleRax",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btae162",
            "metadata": {
                "abstract": "Motivation: Genomes are a rich source of information on the pattern and process of evolution across biological scales. How best to make use of that information is an active area of research in phylogenetics. Ideally, phylogenetic methods should not only model substitutions along gene trees, which explain differences between homologous gene sequences, but also the processes that generate the gene trees themselves along a shared species tree. To conduct accurate inferences, one needs to account for uncertainty at both levels, that is, in gene trees estimated from inherently short sequences and in their diverse evolutionary histories along a shared species tree. Results: We present AleRax, a software that can infer reconciled gene trees together with a shared species tree using a simple, yet powerful, probabilistic model of gene duplication, transfer, and loss. A key feature of AleRax is its ability to account for uncertainty in the gene tree and its reconciliation by using an efficient approximation to calculate the joint phylogenetic - reconciliation likelihood and sample reconciled gene trees accordingly. Simulations and analyses of empirical data show that AleRax is one order of magnitude faster than competing gene tree inference tools while attaining the same accuracy. It is consistently more robust than species tree inference methods such as SpeciesRax and ASTRAL-Pro 2 under gene tree uncertainty. Finally, AleRax can process multiple gene families in parallel thereby allowing users to compare competing phylogenetic hypotheses and estimate model parameters, such as duplication, transfer, and loss probabilities for genome-scale datasets with hundreds of taxa.",
                "authors": [
                    {
                        "name": "Morel B."
                    },
                    {
                        "name": "Stamatakis A."
                    },
                    {
                        "name": "Szollosi G.J."
                    },
                    {
                        "name": "Williams T.A."
                    }
                ],
                "citationCount": 2,
                "date": "2024-04-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "AleRax: a tool for gene and species tree co-estimation and reconciliation under a probabilistic model of gene duplication, transfer, and loss"
            },
            "pmcid": "PMC10990685",
            "pmid": "38514421"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Gene and protein families",
            "uri": "http://edamontology.org/topic_0623"
        },
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        },
        {
            "term": "Phylogenomics",
            "uri": "http://edamontology.org/topic_0194"
        }
    ]
}
