{
    "additionDate": "2017-01-17T15:05:26Z",
    "biotoolsCURIE": "biotools:rontotools",
    "biotoolsID": "rontotools",
    "collectionID": [
        "BioConductor"
    ],
    "credit": [
        {
            "email": "calin@wayne.edu",
            "name": "Calin Voichita",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Suite of tools for functional analysis.",
    "documentation": [
        {
            "type": "User manual",
            "url": "http://bioconductor.org/packages/release/bioc/html/ROntoTools.html"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://bioconductor/packages/release/bioc/src/contrib/ROntoTools_2.2.0.tar.gz"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein function analysis",
                    "uri": "http://edamontology.org/operation_2414"
                }
            ]
        }
    ],
    "homepage": "http://bioconductor.org/packages/release/bioc/html/ROntoTools.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-10T12:58:55Z",
    "license": "CC-BY-NC-ND-4.0",
    "name": "ROntoTools",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "bioconductor_import",
    "publication": [
        {
            "doi": "10.1109/JPROC.2016.2531000",
            "metadata": {
                "abstract": "© 1963-2012 IEEE. A crucial step in the understanding of any phenotype is the correct identification of the signaling pathways that are significantly impacted in that phenotype. However, most current pathway analysis methods produce both false positives as well as false negatives in certain circumstances. We hypothesized that such incorrect results are due to the fact that the existing methods fail to distinguish between the primary dis-regulation of a given gene itself and the effects of signaling coming from upstream. Furthermore, a modern whole-genome experiment performed with a next-generation technology spends a great deal of effort to measure the entire set of 30000-100000 transcripts in the genome. This is followed by the selection of a few hundreds differentially expressed genes, step that literally discards more than 99% of the collected data. We also hypothesized that such a drastic filtering could discard many genes that play crucial roles in the phenotype. We propose a novel topology-based pathway analysis method that identifies significantly impacted pathways using the entire set of measurements, thus allowing the full use of the data provided by NGS techniques. The results obtained on 24 real data sets involving 12 different human diseases, as well as on 8 yeast knock-out data sets show that the proposed method yields significant improvements with respect to the state-of-the-art methods: SPIA, GSEA, and GSA. Availability: Primary dis-regulation analysis is implemented in R and included in ROntoTools Bioconductor package (versions ≥2.0.0). https://www.bioconductor.org/packages/release/bioc/html/ROntoTools.html.",
                "authors": [
                    {
                        "name": "Ansari S."
                    },
                    {
                        "name": "Voichita C."
                    },
                    {
                        "name": "Donato M."
                    },
                    {
                        "name": "Tagett R."
                    },
                    {
                        "name": "Draghici S."
                    }
                ],
                "citationCount": 2,
                "date": "2017-03-01T00:00:00Z",
                "journal": "Proceedings of the IEEE",
                "title": "A Novel Pathway Analysis Approach Based on the Unexplained Disregulation of Genes: This paper describes a new computational analysis method for gene expression data that utilizes all the data effectively for identifying the dynamics of biological pathways"
            },
            "type": "Primary"
        }
    ],
    "toolType": [
        "Command-line tool",
        "Library"
    ],
    "topic": [
        {
            "term": "Function analysis",
            "uri": "http://edamontology.org/topic_1775"
        }
    ],
    "validated": 1,
    "version": [
        "2.2.0"
    ]
}