{"credit":[{"email":"sekar@iisc.ac.in","name":"Dr. K. Sekar","typeEntity":"Person","typeRoles":["Primary contact"]},{"email":"aanand@vit.ac.in","name":"Dr. Anand Anbarasu","typeEntity":"Person","typeRoles":["Primary contact"]}],"function":[{"operation":[{"term":"Annotation","uri":"http://edamontology.org/operation_0226"}]},{"operation":[{"term":"Sequence analysis","uri":"http://edamontology.org/operation_2403"}]},{"operation":[{"term":"Protein structure analysis","uri":"http://edamontology.org/operation_2406"}]}],"labels":{"language":["JavaScript","Perl"],"operatingSystem":["Linux","Windows","Mac"],"toolType":["Database portal"],"topic":[{"term":"Microbiology","uri":"http://edamontology.org/topic_3301"},{"term":"Virology","uri":"http://edamontology.org/topic_0781"}]},"publication":[{"abstract":"© 2014 Elsevier Ltd. Background: Haemophilus influenzae (. H. Influenzae) is the causative agent of pneumonia, bacteraemia and meningitis. The organism is responsible for large number of deaths in both developed and developing countries. Even-though the first bacterial genome to be sequenced was that of H. Influenzae, there is no exclusive database dedicated for H. Influenzae. This prompted us to develop the Haemophilus influenzae Genome Database (HIGDB). Methods: All data of HIGDB are stored and managed in MySQL database. The HIGDB is hosted on Solaris server and developed using PERL modules. Ajax and JavaScript are used for the interface development. Results: The HIGDB contains detailed information on 42,741 proteins, 18,077 genes including 10 whole genome sequences and also 284 three dimensional structures of proteins of H. influenzae. In addition, the database provides \"Motif search\" and \"GBrowse\". The HIGDB is freely accessible through the URL: http://bioserver1.physics.iisc.ernet.in/HIGDB/. Discussion: The HIGDB will be a single point access for bacteriological, clinical, genomic and proteomic information of H. influenzae. The database can also be used to identify DNA motifs within H. influenzae genomes and to compare gene or protein sequences of a particular strain with other strains of H. influenzae.","authors":["Swetha R.G.","Kala Sekar D.K.","Ramaiah S.","Anbarasu A.","Sekar K."],"cit_count":2,"doi":"10.1016/J.COMPBIOMED.2014.10.001","journal":"Computers in Biology and Medicine","pmid":"25450223","title":"Haemophilus influenzae Genome Database (HIGDB): A single point web resource for Haemophilus influenzae","year":"2014-12-01"}],"summary":{"biotoolsCURIE":"biotools:higdb","biotoolsID":"higdb","description":"Bacteriological, clinical, genomic and proteomic database of H. influenzae.","homepage":"http://bioserver1.physics.iisc.ernet.in/HIGDB/","name":"HIGDB"}}