{
    "additionDate": "2021-01-18T09:27:59Z",
    "biotoolsCURIE": "biotools:psi-mouse",
    "biotoolsID": "psi-mouse",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "zhen.wei@xjtlu.edu.cn",
            "name": "Zhen Wei",
            "typeEntity": "Person"
        }
    ],
    "description": "Predicting Mouse Pseudouridine Sites From Sequence and Genome-Derived Features.\n\nPseudouridine (Ψ) is the first discovered and the most abundant RNA modification that has been widely study in the past decades.\n\nExperimental-validated mouse Ψ Sites.\n\nHigh-accuracy predictor for mouse Ψ site identification.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "PTM site prediction",
                    "uri": "http://edamontology.org/operation_0417"
                },
                {
                    "term": "Sequence feature detection",
                    "uri": "http://edamontology.org/operation_0253"
                },
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                },
                {
                    "term": "Splice site prediction",
                    "uri": "http://edamontology.org/operation_0433"
                }
            ]
        }
    ],
    "homepage": "http://www.xjtlu.edu.cn/biologicalsciences/psimouse",
    "lastUpdate": "2021-01-29T18:00:06Z",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "http://psimouse.rnamd.com"
        }
    ],
    "name": "PSI-MOUSE",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1177/1176934320925752",
            "metadata": {
                "abstract": "© The Author(s) 2020.Pseudouridine (Ψ) is the first discovered and the most prevalent posttranscriptional modification, which has been widely studied during the past decades. Pseudouridine was observed in almost all kinds of RNAs and shown to have important biological functions. Currently, the time-consuming and high-cost procedures of experimental approaches limit its uses in real-life Ψ site detection. Alternatively, by taking advantage of the explosive growth of Ψ sequencing data, the computational methods may provide a more cost-effective avenue. To date, the existing mouse Ψ site predictors were all developed based on sequence-derived features, and their performance can be further improved by adding the domain knowledge derived feature. Therefore, it is highly desirable to propose a genomic feature-based computational method to increase the accuracy and efficiency of the identification of Ψ RNA modification in the mouse transcriptome. In our study, a predictive framework PSI-MOUSE was built. Besides the conventional sequence-based features, PSI-MOUSE first introduced 38 additional genomic features derived from the mouse genome, which achieved a satisfactory improvement in the prediction performance, compared with other existing models. Moreover, PSI-MOUSE also features in automatically annotating the putative Ψ sites with diverse types of posttranscriptional regulations (RNA-binding protein [RBP]-binding regions, miRNA-RNA interactions, and splicing sites), which can serve as a useful research tool for the study of Ψ RNA modification in the mouse genome. Finally, 3282 experimentally validated mouse Ψ sites were also collected in a database with customized query functions. For the convenience of academic users, a website was built to provide a user-friendly interface for the query and analysis on the database. The website is freely accessible at www.xjtlu.edu.cn/biologicalsciences/psimouse and http://psimouse.rnamd.com. We introduced the genome-derived features to mouse for the first time, and we achieved a good performance in mouse Ψ site prediction. Compared with the existing state-of-art methods, our newly developed approach PSI-MOUSE obtained a substantial improvement in prediction accuracy, marking the reliable contributions of genomic features for the prediction of RNA modifications in a species other than human.",
                "authors": [
                    {
                        "name": "Song B."
                    },
                    {
                        "name": "Chen K."
                    },
                    {
                        "name": "Tang Y."
                    },
                    {
                        "name": "Ma J."
                    },
                    {
                        "name": "Meng J."
                    },
                    {
                        "name": "Wei Z."
                    }
                ],
                "citationCount": 1,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Evolutionary Bioinformatics",
                "title": "PSI-MOUSE: Predicting Mouse Pseudouridine Sites From Sequence and Genome-Derived Features"
            },
            "pmcid": "PMC7285933",
            "pmid": "32565674"
        }
    ],
    "topic": [
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "RNA splicing",
            "uri": "http://edamontology.org/topic_3320"
        },
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        },
        {
            "term": "DNA binding sites",
            "uri": "http://edamontology.org/topic_3125"
        }
    ]
}