{
    "additionDate": "2020-01-14T09:02:44Z",
    "biotoolsCURIE": "biotools:TransPrise",
    "biotoolsID": "TransPrise",
    "confidence_flag": "high",
    "credit": [
        {
            "email": "ttatarinova@laverne.edu",
            "name": "Tatiana V. Tatarinova",
            "typeEntity": "Person"
        }
    ],
    "description": "a novel machine learning approach for eukaryotic promoter prediction.\n\nApproach for prediction of eukaryotic transcription start sites.\n\nA deep learning approach for precise prediction of eukaryotic transcription start sites. Our approach offers significant improvement over existing promoter prediction methods. We provide the full basis for the comparison and encourage users to freely access our computational method to facilitate and streamline their own analyses.\n\n./data/ contains some data files. TSS_MSU.txt was used for TSS sequence taking. Rice genome can be downloaded from MSU rice experiment official page",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Homology-based gene prediction",
                    "uri": "http://edamontology.org/operation_3663"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                },
                {
                    "term": "Promoter prediction",
                    "uri": "http://edamontology.org/operation_0440"
                }
            ]
        }
    ],
    "homepage": "https://github.com/StepanAbstro/TransPrise",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-01-14T09:02:44Z",
    "license": "GPL-2.0",
    "name": "TransPrise",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.7717/PEERJ.7990",
            "metadata": {
                "abstract": "Copyright 2019 Pachganov et al.As interest in genetic resequencing increases, so does the need for effective mathematical, computational, and statistical approaches. One of the difficult problems in genome annotation is determination of precise positions of transcription start sites. In this paper we present TransPrise—an efficient deep learning tool for prediction of positions of eukaryotic transcription start sites. Our pipeline consists of two parts: the binary classifier operates the first, and if a sequence is classified as TSS-containing the regression step follows, where the precise location of TSS is being identified. TransPrise offers significant improvement over existing promoter-prediction methods. To illustrate this, we compared predictions of TransPrise classification and regression models with the TSSPlant approach for the well annotated genome of Oryza sativa. Using a computer equipped with a graphics processing unit, the run time of TransPrise is 250 minutes on a genome of 374 Mb long. The Matthews correlation coefficient value for TransPrise is 0.79, more than two times larger than the 0.31 for TSSPlant classification models. This represents a high level of prediction accuracy. Additionally, the mean absolute error for the regression model is 29.19 nt, allowing for accurate prediction of TSS location. TransPrise was also tested in Homo sapiens, where mean absolute error of the regression model was 47.986 nt. We provide the full basis for the comparison and encourage users to freely access a set of our computational tools to facilitate and streamline their own analyses. The ready-to-use Docker image with all necessary packages, models, code as well as the source code of the TransPrise algorithm are available at (http://compubioverne.group/). The source code is ready to use and customizable to predict TSS in any eukaryotic organism.",
                "authors": [
                    {
                        "name": "Pachganov S."
                    },
                    {
                        "name": "Murtazalieva K."
                    },
                    {
                        "name": "Zarubin A."
                    },
                    {
                        "name": "Sokolov D."
                    },
                    {
                        "name": "Chartier D.R."
                    },
                    {
                        "name": "Tatarinova T.V."
                    }
                ],
                "citationCount": 2,
                "date": "2019-01-01T00:00:00Z",
                "journal": "PeerJ",
                "title": "Transprise: A novel machine learning approach for eukaryotic promoter prediction"
            },
            "pmcid": "PMC6827441",
            "pmid": "31695967"
        }
    ],
    "topic": [
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ]
}