{
    "additionDate": "2020-01-09T17:36:43Z",
    "biotoolsCURIE": "biotools:Pharmmaker",
    "biotoolsID": "Pharmmaker",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "hongchun@pitt.edu",
            "name": "Hongchun Li",
            "typeEntity": "Person"
        },
        {
            "email": "bahar@pitt.edu",
            "name": "Ivet Bahar",
            "orcidid": "https://orcid.org/0000-0001-9959-4176",
            "typeEntity": "Person"
        }
    ],
    "description": "Pharmacophore is a tool for modeling and hit identification based on druggability simulations.",
    "documentation": [
        {
            "type": [
                "Training material"
            ],
            "url": "http://prody.csb.pitt.edu/tutorials/pharmmaker/"
        }
    ],
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Molecular dynamics",
                    "uri": "http://edamontology.org/operation_2476"
                },
                {
                    "term": "Protein-ligand docking",
                    "uri": "http://edamontology.org/operation_0482"
                }
            ]
        }
    ],
    "homepage": "http://prody.csb.pitt.edu/pharmmaker",
    "lastUpdate": "2021-01-09T12:53:01Z",
    "name": "Pharmmaker",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1002/PRO.3732",
            "metadata": {
                "abstract": "© 2019 The Authors. Protein Science published by Wiley Periodicals, Inc. on behalf of The Protein Society.Recent years have seen progress in druggability simulations, that is, molecular dynamics simulations of target proteins in solutions containing drug-like probe molecules to characterize their drug-binding abilities, if any. An important consecutive step is to analyze the trajectories to construct pharmacophore models (PMs) to use for virtual screening of libraries of small molecules. While considerable success has been observed in this type of computer-aided drug discovery, a systematic tool encompassing multiple steps from druggability simulations to pharmacophore modeling, to identifying hits by virtual screening of libraries of compounds, has been lacking. We address this need here by developing a new tool, Pharmmaker, building on the DruGUI module of our ProDy application programming interface. Pharmmaker is composed of a suite of steps: (Step 1) identification of high affinity residues for each probe molecule type; (Step 2) selecting high affinity residues and hot spots in the vicinity of sites identified by DruGUI; (Step 3) ranking of the interactions between high affinity residues and specific probes; (Step 4) obtaining probe binding poses and corresponding protein conformations by collecting top-ranked snapshots; and (Step 5) using those snapshots for constructing PMs. The PMs are then used as filters for identifying hits in structure-based virtual screening. Pharmmaker, accessible online at http://prody.csb.pitt.edu/pharmmaker, can be used in conjunction with other tools available in ProDy.",
                "authors": [
                    {
                        "name": "Lee J.Y."
                    },
                    {
                        "name": "Krieger J.M."
                    },
                    {
                        "name": "Li H."
                    },
                    {
                        "name": "Bahar I."
                    }
                ],
                "citationCount": 6,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Protein Science",
                "title": "Pharmmaker: Pharmacophore modeling and hit identification based on druggability simulations"
            },
            "pmcid": "PMC6933858",
            "pmid": "31576621"
        }
    ],
    "topic": [
        {
            "term": "Molecular dynamics",
            "uri": "http://edamontology.org/topic_0176"
        },
        {
            "term": "Probes and primers",
            "uri": "http://edamontology.org/topic_0632"
        },
        {
            "term": "Drug discovery",
            "uri": "http://edamontology.org/topic_3336"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Molecular biology",
            "uri": "http://edamontology.org/topic_3047"
        }
    ],
    "validated": 1
}