{
    "additionDate": "2017-12-18T00:11:36Z",
    "biotoolsCURIE": "biotools:queen",
    "biotoolsID": "queen",
    "credit": [
        {
            "email": "queen@cmbi.ru.nl",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "QUantitative Evaluation of Experimental Nmr restraints is a new software for quantifying the information contained in the experimental NMR restraints. The method is based on a description of the structure in distance space and concepts derived from information theory. It allows for an objective description of the amount of available experimental information, which is shown to be related to the positional uncertainty of the NMR ensemble.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://www.cmbi.ru.nl/software/queen/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein sequence analysis",
                    "uri": "http://edamontology.org/operation_2479"
                }
            ]
        }
    ],
    "homepage": "http://www.cmbi.ru.nl/software/queen/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-25T14:42:05.821222Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/queen-1-1-quantitative-evaluation-experimental-nmr-restraints.html"
        }
    ],
    "name": "QUEEN",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1021/ja035440f",
            "metadata": {
                "abstract": "Nuclear Overhauser effect (NOE) data are an indispensable source of structural information in biomolecular structure determination by NMR spectroscopy. The number and type of experimental restraints used in the structure calculation and the RMS deviation of the restraints are usually reported. We present a new method for quantifying the information contained in the experimental NMR restraints. The method is based on a description of the structure in distance space and concepts derived from information theory. It allows for an objective description of the amount of available experimental information, which we show to be related to the positional uncertainty of the NMR ensemble. The measure of information presented is not affected by redundancy in the experimental restraints. Using various examples, we show that the method successfully identifies the crucial restraints in a structure determination: those restraints that are both important and unique. Finally, we demonstrate that the method can detect a wider range of redundancy in experimental datasets when compared to currently available methods. Because our method describes the quantitative evaluation of experimental NMR restraints, we propose the acronym QUEEN.",
                "authors": [
                    {
                        "name": "Krieger E."
                    },
                    {
                        "name": "Maassen H."
                    },
                    {
                        "name": "Nabuurs S.B."
                    },
                    {
                        "name": "Spronk C.A.E.M."
                    },
                    {
                        "name": "Vriend G."
                    },
                    {
                        "name": "Vuister G.W."
                    }
                ],
                "citationCount": 79,
                "date": "2003-10-01T00:00:00Z",
                "journal": "Journal of the American Chemical Society",
                "title": "Quantitative evaluation of experimental NMR restraints"
            },
            "pmid": "14505424",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "NMR",
            "uri": "http://edamontology.org/topic_0593"
        }
    ],
    "validated": 1,
    "version": [
        "1.1"
    ]
}
