{
    "additionDate": "2017-12-18T00:15:20Z",
    "biotoolsCURIE": "biotools:ngloc",
    "biotoolsID": "ngloc",
    "credit": [
        {
            "email": "babu.guda@unmc.edu",
            "name": "Babu Guda",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://genome.unmc.edu/"
        },
        {
            "email": "sanjit.pandey@unmc.edu",
            "name": "Sanjit Pandey",
            "orcidid": "http://orcid.org/0000-0001-7304-3376",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "An n-gram-based Bayesian classifier that predicts subcellular localization of proteins both in prokaryotes and eukaryotes. The overall prediction accuracy varies from 85.3% to 91.4% across species.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://genome.unmc.edu/ngLOC/faq.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein sequence analysis",
                    "uri": "http://edamontology.org/operation_2479"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Prediction",
                    "uri": "http://edamontology.org/operation_2423"
                }
            ]
        }
    ],
    "homepage": "http://genome.unmc.edu/ngLOC/index.html",
    "lastUpdate": "2021-04-26T07:58:28.320942Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/ngloc-1-0-bayesian-method-predicting-protein-subcellular-localization.html"
        }
    ],
    "name": "ngLOC",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "otherID": [
        {
            "type": "rrid",
            "value": "RRID:SCR_003150"
        }
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1186/1756-0500-5-351",
            "metadata": {
                "abstract": "Background: Understanding protein subcellular localization is a necessary component toward understanding the overall function of a protein. Numerous computational methods have been published over the past decade, with varying degrees of success. Despite the large number of published methods in this area, only a small fraction of them are available for researchers to use in their own studies. Of those that are available, many are limited by predicting only a small number of organelles in the cell. Additionally, the majority of methods predict only a single location for a sequence, even though it is known that a large fraction of the proteins in eukaryotic species shuttle between locations to carry out their function. Findings. We present a software package and a web server for predicting the subcellular localization of protein sequences based on the ngLOC method. ngLOC is an n-gram-based Bayesian classifier that predicts subcellular localization of proteins both in prokaryotes and eukaryotes. The overall prediction accuracy varies from 89.8% to 91.4% across species. This program can predict 11 distinct locations each in plant and animal species. ngLOC also predicts 4 and 5 distinct locations on gram-positive and gram-negative bacterial datasets, respectively. Conclusions: ngLOC is a generic method that can be trained by data from a variety of species or classes for predicting protein subcellular localization. The standalone software is freely available for academic use under GNU GPL, and the ngLOC web server is also accessible at. © 2012 King et al.; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "King B.R."
                    },
                    {
                        "name": "Vural S."
                    },
                    {
                        "name": "Pandey S."
                    },
                    {
                        "name": "Barteau A."
                    },
                    {
                        "name": "Guda C."
                    }
                ],
                "citationCount": 33,
                "date": "2012-07-12T00:00:00Z",
                "journal": "BMC Research Notes",
                "title": "NgLOC: Software and web server for predicting protein subcellular localization in prokaryotes and eukaryotes"
            },
            "pmcid": "PMC3532370",
            "pmid": "22780965",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        }
    ],
    "validated": 1,
    "version": [
        "1.0"
    ]
}