{
    "additionDate": "2021-06-14T12:32:28Z",
    "biotoolsCURIE": "biotools:amrmap",
    "biotoolsID": "amrmap",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "alina.vinogradova@antibiotic.ru",
            "name": "Alina G. Vinogradova",
            "typeEntity": "Person"
        }
    ],
    "description": "AMRmap is a interactive web platform for  the monitoring of antibiotic resistance in Russia, which contains a set of tools for the analysis and visualization of data on the susceptibility of microorganisms to antimicrobial agents.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Antimicrobial resistance prediction",
                    "uri": "http://edamontology.org/operation_3482"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://amrmap.net/",
    "lastUpdate": "2021-08-13T07:18:58Z",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "https://amrmap.net/?id"
        }
    ],
    "name": "AMRmap",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.3389/FMICB.2021.620002",
            "metadata": {
                "abstract": "© Copyright © 2021 Kuzmenkov, Trushin, Vinogradova, Avramenko, Sukhorukova, Malhotra-Kumar, Dekhnich, Edelstein and Kozlov.Surveillance of antimicrobial resistance (AMR) is crucial for identifying trends in resistance and developing strategies for prevention and treatment of infections. Globally, AMR surveillance systems differ in terms of organizational principles, comprehensiveness, accessibility, and usability of data presentation. Until recently, the data on AMR in Russia were scarcely available, especially to international community, despite the fact that the large prospective multicenter surveillance in Russia was conducted and data were accumulated for over 20 years. We describe the source of data, structure, and functionality of a new-generation web platform, called AMRmap (https://amrmap.net/), for analysis of AMR surveillance data in Russia. The developed platform currently comprises susceptibility data of >40,000 clinical isolates, and the data on abundance of key resistance determinants, including acquired carbapenemases in gram-negatives, are updated annually with information on >5,000 new isolates. The AMRmap allows smart data filtration by multiple parameters and provides interactive data analysis and visualization tools: MIC and S/I/R distribution plots, time-trends and regression plots, associated resistance plots, prevalence maps, statistical significance graphs, and tables.",
                "authors": [
                    {
                        "name": "Avramenko A.A."
                    },
                    {
                        "name": "Dekhnich A.V."
                    },
                    {
                        "name": "Edelstein M.V."
                    },
                    {
                        "name": "Kozlov R.S."
                    },
                    {
                        "name": "Kuzmenkov A.Y."
                    },
                    {
                        "name": "Malhotra-Kumar S."
                    },
                    {
                        "name": "Sukhorukova M.V."
                    },
                    {
                        "name": "Trushin I.V."
                    },
                    {
                        "name": "Vinogradova A.G."
                    }
                ],
                "citationCount": 1,
                "date": "2021-03-12T00:00:00Z",
                "journal": "Frontiers in Microbiology",
                "title": "AMRmap: An Interactive Web Platform for Analysis of Antimicrobial Resistance Surveillance Data in Russia"
            },
            "pmcid": "PMC7994358",
            "pmid": "33776956"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Infectious disease",
            "uri": "http://edamontology.org/topic_3324"
        },
        {
            "term": "Microbiology",
            "uri": "http://edamontology.org/topic_3301"
        }
    ]
}
