{
    "accessibility": "Open access",
    "additionDate": "2024-01-08T08:51:37.141952Z",
    "biotoolsCURIE": "biotools:redirection",
    "biotoolsID": "redirection",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "siddhartha_kundu@yahoo.co.in",
            "name": "Siddhartha Kundu",
            "typeEntity": "Person"
        }
    ],
    "description": "R-package to characterize every reaction of a user-defined biochemical network with the probable dissociation constant.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Metabolic network modelling",
                    "uri": "http://edamontology.org/operation_3660"
                },
                {
                    "term": "Modelling and simulation",
                    "uri": "http://edamontology.org/operation_2426"
                },
                {
                    "term": "Sequence trimming",
                    "uri": "http://edamontology.org/operation_3192"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://cran.r-project.org/package=ReDirection",
    "language": [
        "R"
    ],
    "lastUpdate": "2024-11-24T14:22:49.669940Z",
    "license": "GPL-3.0",
    "name": "ReDirection",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.3389/fmolb.2023.1206502",
            "metadata": {
                "abstract": "Biochemical networks integrate enzyme-mediated substrate conversions with non-enzymatic complex formation and disassembly to accomplish complex biochemical and physiological functions. The choice of parameters and constraints used in most of these studies is numerically motivated and network-specific. Although sound in theory, the outcomes that result depart significantly from the intracellular milieu and are less likely to retain relevance in a clinical setting. There is a need for a computational tool which is biochemically relevant, mathematically rigorous, and unbiased, and can ascribe functionality to and generate potentially testable hypotheses for a user-defined biochemical network. Here, we present “ReDirection,” an R-package which computes the probable dissociation constant for every reaction of a biochemical network directly from a null space-generated subspace of the stoichiometry number matrix of the modeled network. “ReDirection” delineates this subspace by excluding all trivial and redundant or duplicate occurrences of non-trivial vectors, combinatorially summing the vectors that remain and verifying that the upper or lower bounds of the sequence of terms formed by each row of this subspace belong to the open real-valued intervals (Formula presented.) or (Formula presented.) or whether the number of terms that are differently signed are almost equal. “ReDirection” iterates these steps until these bounds are consistent and unambiguous for all reactions of the modeled biochemical network. Thereafter, “ReDirection” filters the terms from each row of this subspace, bins them to outcome-specific subsets, sums and maps this to an outcome-specific reaction vector, and computes the p1-norm, which is the probable dissociation constant for a reaction. “ReDirection” works on first principles, does not discriminate between enzymatic and non-enzymatic reactions, offers a biochemically relevant and mathematically rigorous environment to explore user-defined biochemical networks under baseline and perturbed conditions, and can be used to address empirically intractable biochemical problems. The utility and relevance of “ReDirection” are highlighted by numerical studies on stoichiometric number models of biochemical networks of galactose metabolism and heme and cholesterol biosynthesis. “ReDirection” is freely available and accessible from the comprehensive R archive network (CRAN) with the URL (https://cran.r-project.org/package=ReDirection).",
                "authors": [
                    {
                        "name": "Kundu S."
                    }
                ],
                "citationCount": 2,
                "date": "2023-01-01T00:00:00Z",
                "journal": "Frontiers in Molecular Biosciences",
                "title": "ReDirection: an R-package to compute the probable dissociation constant for every reaction of a user-defined biochemical network"
            },
            "pmcid": "PMC10628733",
            "pmid": "37942290"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Chemistry",
            "uri": "http://edamontology.org/topic_3314"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Physiology",
            "uri": "http://edamontology.org/topic_3300"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ]
}
