{
    "accessibility": "Open access",
    "additionDate": "2022-02-12T13:30:27.784408Z",
    "biotoolsCURIE": "biotools:pacnnrl",
    "biotoolsID": "pacnnrl",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "baotianchina@gmail.com",
            "name": "Baotian Hu",
            "orcidid": "https://orcid.org/0000-0001-7490-684X",
            "typeEntity": "Person"
        },
        {
            "name": "Qingcai Chen",
            "orcidid": "https://orcid.org/0000-0001-8473-7293"
        },
        {
            "name": "Tiantian Zhu"
        },
        {
            "name": "Yang Qin"
        },
        {
            "name": "Yang Xiang"
        },
        {
            "name": "Weihua Peng"
        }
    ],
    "description": "Distantly supervised biomedical relation extraction using piecewise attentive convolutional neural network and reinforcement learning.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Relation extraction",
                    "uri": "http://edamontology.org/operation_3625"
                }
            ]
        }
    ],
    "homepage": "http://112.74.48.115:9000/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-02-12T13:30:27.786908Z",
    "name": "PACNN+RL",
    "operatingSystem": [
        "Mac",
        "Linux",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1093/JAMIA/OCAB176",
            "metadata": {
                "abstract": "© 2021 The Author(s) 2021.Objective: There have been various methods to deal with the erroneous training data in distantly supervised relation extraction (RE), however, their performance is still far from satisfaction. We aimed to deal with the insufficient modeling problem on instance-label correlations for predicting biomedical relations using deep learning and reinforcement learning. Materials and Methods: In this study, a new computational model called piecewise attentive convolutional neural network and reinforcement learning (PACNN+RL) was proposed to perform RE on distantly supervised data generated from Unified Medical Language System with MEDLINE abstracts and benchmark datasets. In PACNN+RL, PACNN was introduced to encode semantic information of biomedical text, and the RL method with memory backtracking mechanism was leveraged to alleviate the erroneous data issue. Extensive experiments were conducted on 4 biomedical RE tasks. Results: The proposed PACNN+RL model achieved competitive performance on 8 biomedical corpora, outperforming most baseline systems. Specifically, PACNN+RL outperformed all baseline methods with the F1-score of 0.5592 on the may-prevent dataset, 0.6666 on the may-treat dataset, and 0.3838 on the DDI corpus, 2011. For the protein-protein interaction RE task, we obtained new state-of-the-art performance on 4 out of 5 benchmark datasets. Conclusions: The performance on many distantly supervised biomedical RE tasks was substantially improved, primarily owing to the denoising effect of the proposed model. It is anticipated that PACNN+RL will become a useful tool for large-scale RE and other downstream tasks to facilitate biomedical knowledge acquisition. We also made the demonstration program and source code publicly available at http://112.74.48.115:9000/.",
                "authors": [
                    {
                        "name": "Zhu T."
                    },
                    {
                        "name": "Qin Y."
                    },
                    {
                        "name": "Xiang Y."
                    },
                    {
                        "name": "Hu B."
                    },
                    {
                        "name": "Chen Q."
                    },
                    {
                        "name": "Peng W."
                    }
                ],
                "date": "2021-12-01T00:00:00Z",
                "journal": "Journal of the American Medical Informatics Association",
                "title": "Distantly supervised biomedical relation extraction using piecewise attentive convolutional neural network and reinforcement learning"
            },
            "pmcid": "PMC8633639",
            "pmid": "34524450"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Medicine",
            "uri": "http://edamontology.org/topic_3303"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        }
    ]
}