{
    "additionDate": "2021-01-18T08:40:40Z",
    "biotoolsCURIE": "biotools:shallowhrd",
    "biotoolsID": "shallowhrd",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "alexandre.eeckhoutte@curie.fr",
            "name": "Alexandre Eeckhoutte",
            "orcidid": "https://orcid.org/0000-0003-3574-9911",
            "typeEntity": "Person"
        }
    ],
    "description": "detection of homologous recombination deficiency from shallow whole genome sequencing.\n\nThis method uses shallow Whole Genome Sequencing (sWGS ~ 0.4-1x) and the segmentation of a tumor genomic profile to infer the Homologous Recombination status of a breast, ovarian tumor based on the number of Large-scale Genomic Alterations (LGAs), evaluated in a similar way to LSTs (Large-scale State Transitions) but independent of the ploidy, with no reference to an absolute copy number. This can also be applied to pancreatic and prostate tumor.\n\nshallowHRD is a R script that can be launched from the command line. It relies on a ratio file characterizing the normalized read counts of a shallow Whole Genome Sequencing (0.4-1x) in sliding windows along the genome and its segmentation. It was developped on the output of ControlFREEC (Boeva,V. et al., 2012) but is adapted to similar softwares (see sections \"run shallowHRD\" and \"Nota Bene\").",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Recombination detection",
                    "uri": "http://edamontology.org/operation_0451"
                }
            ]
        }
    ],
    "homepage": "https://github.com/aeeckhou/shallowHRD",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-02-16T15:50:41Z",
    "name": "shallowHRD",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAA261",
            "metadata": {
                "abstract": "© 2020 The Author(s) 2020. Published by Oxford University Press. We introduce shallowHRD, a software tool to evaluate tumor homologous recombination deficiency (HRD) based on whole genome sequencing (WGS) at low coverage (shallow WGS or sWGS; ∼1X coverage). The tool, based on mining copy number alterations profile, implements a fast and straightforward procedure that shows 87.5% sensitivity and 90.5% specificity for HRD detection. shallowHRD could be instrumental in predicting response to poly(ADP-ribose) polymerase inhibitors, to which HRD tumors are selectively sensitive. shallowHRD displays efficiency comparable to most state-of-art approaches, is cost-effective, generates low-storable outputs and is also suitable for fixed-formalin paraffin embedded tissues.",
                "authors": [
                    {
                        "name": "Bidard F.-C."
                    },
                    {
                        "name": "Bieche I."
                    },
                    {
                        "name": "Eeckhoutte A."
                    },
                    {
                        "name": "Goundiam O."
                    },
                    {
                        "name": "Houy A."
                    },
                    {
                        "name": "Manie E."
                    },
                    {
                        "name": "Marangoni E."
                    },
                    {
                        "name": "Popova T."
                    },
                    {
                        "name": "Reverdy M."
                    },
                    {
                        "name": "Stern M.-H."
                    },
                    {
                        "name": "Stoppa-Lyonnet D."
                    },
                    {
                        "name": "Vincent-Salomon A."
                    }
                ],
                "citationCount": 2,
                "date": "2020-03-31T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "ShallowHRD: Detection of homologous recombination deficiency from shallow whole genome sequencing"
            },
            "pmcid": "PMC7320600",
            "pmid": "32315385"
        }
    ],
    "topic": [
        {
            "term": "Exome sequencing",
            "uri": "http://edamontology.org/topic_3676"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Whole genome sequencing",
            "uri": "http://edamontology.org/topic_3673"
        }
    ]
}
