{
    "accessibility": "Open access",
    "additionDate": "2023-01-09T08:47:52.132055Z",
    "biotoolsCURIE": "biotools:cronos",
    "biotoolsID": "cronos",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "ilias.lagkouvardos@tum.de",
            "name": "Ilias Lagkouvardos",
            "typeEntity": "Person"
        }
    ],
    "description": "Cronos, an analytical pipeline written in R. Cronos' inputs are a microbial composition table (e.g., OTU table), their phylogenetic relations as a tree, and the associated metadata.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "RNA-seq time series data analysis",
                    "uri": "http://edamontology.org/operation_3565"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Lagkouvardos/Cronos",
    "language": [
        "R"
    ],
    "lastUpdate": "2024-11-24T15:13:15.846565Z",
    "license": "MIT",
    "name": "Cronos",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.3389/fbinf.2022.866902",
            "metadata": {
                "abstract": "Microbial time-series analysis, typically, examines the abundances of individual taxa over time and attempts to assign etiology to observed patterns. This approach assumes homogeneous groups in terms of profiles and response to external effectors. These assumptions are not always fulfilled, especially in complex natural systems, like the microbiome of the human gut. It is actually established that humans with otherwise the same demographic or dietary backgrounds can have distinct microbial profiles. We suggest an alternative approach to the analysis of microbial time-series, based on the following premises: 1) microbial communities are organized in distinct clusters of similar composition at any time point, 2) these intrinsic subsets of communities could have different responses to the same external effects, and 3) the fate of the communities is largely deterministic given the same external conditions. Therefore, tracking the transition of communities, rather than individual taxa, across these states, can enhance our understanding of the ecological processes and allow the prediction of future states, by incorporating applied effects. We implement these ideas into Cronos, an analytical pipeline written in R. Cronos’ inputs are a microbial composition table (e.g., OTU table), their phylogenetic relations as a tree, and the associated metadata. Cronos detects the intrinsic microbial profile clusters on all time points, describes them in terms of composition, and records the transitions between them. Cluster assignments, combined with the provided metadata, are used to model the transitions and predict samples’ fate under various effects. We applied Cronos to available data from growing infants’ gut microbiomes, and we observe two distinct trajectories corresponding to breastfed and formula-fed infants that eventually converge to profiles resembling those of mature individuals. Cronos is freely available at https://github.com/Lagkouvardos/Cronos.",
                "authors": [
                    {
                        "name": "Intze E."
                    },
                    {
                        "name": "Lagkouvardos I."
                    },
                    {
                        "name": "Litos A."
                    },
                    {
                        "name": "Pavlidis P."
                    }
                ],
                "citationCount": 2,
                "date": "2022-01-01T00:00:00Z",
                "journal": "Frontiers in Bioinformatics",
                "title": "Cronos: A Machine Learning Pipeline for Description and Predictive Modeling of Microbial Communities Over Time"
            },
            "pmcid": "PMC9580867",
            "pmid": "36304308"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Microbial ecology",
            "uri": "http://edamontology.org/topic_3697"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ],
    "validated": 1
}
