{
    "additionDate": "2018-05-03T17:11:56Z",
    "biotoolsCURIE": "biotools:dinc",
    "biotoolsID": "dinc",
    "credit": [
        {
            "name": "Contact form",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://dinc.kavrakilab.org/contact/"
        }
    ],
    "description": "A new AutoDock-based protocol for docking large ligands.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://dinc.kavrakilab.org/help/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein-ligand docking",
                    "uri": "http://edamontology.org/operation_0482"
                }
            ]
        }
    ],
    "homepage": "http://dinc.kavrakilab.org/",
    "lastUpdate": "2018-12-10T12:58:57Z",
    "name": "DINC",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1186/1472-6807-13-S1-S11",
            "metadata": {
                "abstract": "Background: Using the popular program AutoDock, computer-aided docking of small ligands with 6 or fewer rotatable bonds, is reasonably fast and accurate. However, docking large ligands using AutoDock's recommended standard docking protocol is less accurate and computationally slow. Results: In our earlier work, we presented a novel AutoDock-based incremental protocol (DINC) that addresses the limitations of AutoDock's standard protocol by enabling improved docking of large ligands. Instead of docking a large ligand to a target protein in one single step as done in the standard protocol, our protocol docks the large ligand in increments. In this paper, we present three detailed examples of docking using DINC and compare the docking results with those obtained using AutoDock's standard protocol. We summarize the docking results from an extended docking study that was done on 73 protein-ligand complexes comprised of large ligands. We demonstrate not only that DINC is up to 2 orders of magnitude faster than AutoDock's standard protocol, but that it also achieves the speed-up without sacrificing docking accuracy. We also show that positional restraints can be applied to the large ligand using DINC: this is useful when computing a docked conformation of the ligand. Finally, we introduce a webserver for docking large ligands using DINC. Conclusions: Docking large ligands using DINC is significantly faster than AutoDock's standard protocol without any loss of accuracy. Therefore, DINC could be used as an alternative protocol for docking large ligands. DINC has been implemented as a webserver and is available at http://dinc.kavrakilab.org. Applications such as therapeutic drug design, rational vaccine design, and others involving large ligands could benefit from DINC and its webserver implementation. © 2013 Dhanik et al; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Dhanik A."
                    },
                    {
                        "name": "McMurray J.S."
                    },
                    {
                        "name": "Kavraki L.E."
                    }
                ],
                "citationCount": 32,
                "date": "2013-11-18T00:00:00Z",
                "journal": "BMC Structural Biology",
                "title": "DINC: A new AutoDock-based protocol for docking large ligands"
            },
            "pmcid": "PMC3952135",
            "pmid": "24564952"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        },
        {
            "term": "Molecular modelling",
            "uri": "http://edamontology.org/topic_2275"
        },
        {
            "term": "Protein binding sites",
            "uri": "http://edamontology.org/topic_3534"
        }
    ],
    "validated": 1
}