{
    "additionDate": "2017-01-13T13:16:07Z",
    "biotoolsCURIE": "biotools:rmap",
    "biotoolsID": "rmap",
    "credit": [
        {
            "email": "andrewds@usc.edu",
            "name": "Andrew D Smith",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "chung@cshl.edu",
            "name": "Wen-Yu Chung",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Assembles 20 - 64 bp Solexa reads to a FASTA reference genome. By Andrew D. Smith and Zhenyu Xuan at CSHL. (published in BMC Bioinformatics). POSIX OS required.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://rulai.cshl.edu/rmap/rmap_manual.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Read mapping",
                    "uri": "http://edamontology.org/operation_3198"
                },
                {
                    "term": "Bisulfite mapping",
                    "uri": "http://edamontology.org/operation_3186"
                }
            ]
        }
    ],
    "homepage": "http://rulai.cshl.edu/rmap",
    "lastUpdate": "2018-12-10T12:58:59Z",
    "license": "GPL-3.0",
    "name": "RMAP",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "seqwiki_import",
    "publication": [
        {
            "doi": "10.1186/1471-2105-9-128",
            "metadata": {
                "abstract": "Background: Second-generation sequencing has the potential to revolutionize genomics and impact all areas of biomedical science. New technologies will make re-sequencing widely available for such applications as identifying genome variations or interrogating the oligonucleotide content of a large sample (e.g. ChIP-sequencing). The increase in speed, sensitivity and availability of sequencing technology brings demand for advances in computational technology to perform associated analysis tasks. The Solexa/Illumina 1G sequencer can produce tens of millions of reads, ranging in length from ∼25-50 nt, in a single experiment. Accurately mapping the reads back to a reference genome is a critical task in almost all applications. Two sources of information that are often ignored when mapping reads from the Solexa technology are the 3' ends of longer reads, which contain a much higher frequency of sequencing errors, and the base-call quality scores. Results: To investigate whether these sources of information can be used to improve accuracy when mapping reads, we developed the RMAP tool, which can map reads having a wide range of lengths and allows base-call quality scores to determine which positions in each read are more important when mapping. We applied RMAP to analyze data re-sequenced from two human BAC regions for varying read lengths, and varying criteria for use of quality scores. RMAP is freely available for downloading at http://rulai.cshl.edu/rmap/. Conclusion: Our results indicate that significant gains in Solexa read mapping performance can be achieved by considering the information in 3′ ends of longer reads, and appropriately using the base-call quality scores. The RMAP tool we have developed will enable researchers to effectively exploit this information in targeted re-sequencing projects. © 2008 Smith et al; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Smith A.D."
                    },
                    {
                        "name": "Xuan Z."
                    },
                    {
                        "name": "Zhang M.Q."
                    }
                ],
                "citationCount": 230,
                "date": "2008-02-28T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Using quality scores and longer reads improves accuracy of Solexa read mapping"
            },
            "pmcid": "PMC2335322",
            "pmid": "18307793",
            "type": [
                "Primary"
            ]
        },
        {
            "doi": "10.1186/1471-2105-14-184",
            "metadata": {
                "abstract": "Background: The development of next-generation sequencing instruments has led to the generation of millions of short sequences in a single run. The process of aligning these reads to a reference genome is time consuming and demands the development of fast and accurate alignment tools. However, the current proposed tools make different compromises between the accuracy and the speed of mapping. Moreover, many important aspects are overlooked while comparing the performance of a newly developed tool to the state of the art. Therefore, there is a need for an objective evaluation method that covers all the aspects. In this work, we introduce a benchmarking suite to extensively analyze sequencing tools with respect to various aspects and provide an objective comparison.Results: We applied our benchmarking tests on 9 well known mapping tools, namely, Bowtie, Bowtie2, BWA, SOAP2, MAQ, RMAP, GSNAP, Novoalign, and mrsFAST (mrFAST) using synthetic data and real RNA-Seq data. MAQ and RMAP are based on building hash tables for the reads, whereas the remaining tools are based on indexing the reference genome. The benchmarking tests reveal the strengths and weaknesses of each tool. The results show that no single tool outperforms all others in all metrics. However, Bowtie maintained the best throughput for most of the tests while BWA performed better for longer read lengths. The benchmarking tests are not restricted to the mentioned tools and can be further applied to others.Conclusion: The mapping process is still a hard problem that is affected by many factors. In this work, we provided a benchmarking suite that reveals and evaluates the different factors affecting the mapping process. Still, there is no tool that outperforms all of the others in all the tests. Therefore, the end user should clearly specify his needs in order to choose the tool that provides the best results. © 2013 Hatem et al.; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Hatem A."
                    },
                    {
                        "name": "Bozdag D."
                    },
                    {
                        "name": "Toland A.E."
                    },
                    {
                        "name": "Catalyurek U.V."
                    }
                ],
                "citationCount": 119,
                "date": "2013-06-07T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Benchmarking short sequence mapping tools"
            },
            "pmcid": "PMC3694458",
            "pmid": "23758764",
            "type": [
                "Benchmarking study"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        }
    ],
    "validated": 1
}