{
    "accessibility": "Open access (with restrictions)",
    "additionDate": "2021-05-05T10:58:26Z",
    "biotoolsCURIE": "biotools:gtom",
    "biotoolsID": "gtom",
    "collectionID": [
        "MATLAB",
        "File Exchange"
    ],
    "cost": "Free of charge (with restrictions)",
    "credit": [
        {
            "name": "Joaquín Goñi",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://www.mathworks.com/matlabcentral/profile/1184671-joaquin-goni"
        }
    ],
    "description": "Efficient implementation of the Generalized Topological Overlaping Measure (GTOM)",
    "download": [
        {
            "type": "Screenshot",
            "url": "https://www.mathworks.com//matlabcentral/mlc-downloads/downloads/submissions/17668/versions/1/screenshot.PNG"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                }
            ]
        }
    ],
    "homepage": "https://www.mathworks.com/matlabcentral/fileexchange/17668-gtom-generalized-topological-overlaping-measure",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2021-05-21T15:40:01.491750Z",
    "name": "GTOM - Generalized Topological Overlaping Measure",
    "operatingSystem": [
        "Windows",
        "Linux",
        "Mac"
    ],
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1186/1471-2105-8-22",
            "metadata": {
                "abstract": "Background: Network methods are increasingly used to represent the interactions of genes and/or proteins. Genes or proteins that are directly linked may have a similar biological function or may be part of the same biological pathway. Since the information on the connection (adjacency) between 2 nodes may be noisy or incomplete, it can be desirable to consider alternative measures of pairwise interconnectedness. Here we study a class of measures that are proportional to the number of neighbors that a pair of nodes share in common. For example, the topological overlap measure by Ravasz et al. 1 can be interpreted as a measure of agreement between the m = 1 step neighborhoods of 2 nodes. Several studies have shown that two proteins having a higher topological overlap are more likely to belong to the same functional class than proteins having a lower topological overlap. Here we address the question whether a measure of topological overlap based on higher-order neighborhoods could give rise to a more robust and sensitive measure of interconnectedness. Results: We generalize the topological overlap measure from m = 1 step neighborhoods to m ≥ 2 step neighborhoods. This allows us to define the m-th order generalized topological overlap measure (GTOM) by (i) counting the number of m-step neighbors that a pair of nodes share and (ii) normalizing it to take a value between 0 and 1. Using theoretical arguments, a yeast co-expression network application, and a fly protein network application, we illustrate the usefulness of the proposed measure for module detection and gene neighborhood analysis. Conclusion: Topological overlap can serve as an important filter to counter the effects of spurious or missing connections between network nodes. The m-th order topological overlap measure allows one to trade-off sensitivity versus specificity when it comes to defining pairwise interconnectedness and network modules. © 2007 Yip and Horvath; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Yip A.M."
                    },
                    {
                        "name": "Horvath S."
                    }
                ],
                "citationCount": 331,
                "date": "2007-02-27T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Gene network interconnectedness and the generalized topological overlap measure"
            },
            "type": [
                "Other"
            ]
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ],
    "version": [
        "1.0.0.0"
    ]
}