{
    "additionDate": "2021-01-18T09:05:11Z",
    "biotoolsCURIE": "biotools:medea",
    "biotoolsID": "medea",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "lmariani@bwh.harvard.edu",
            "name": "Luca Mariani",
            "orcidid": "https://orcid.org/0000-0002-3502-7364",
            "typeEntity": "Person"
        },
        {
            "name": "Kathryn Weinand",
            "orcidid": "https://orcid.org/0000-0001-8491-7251",
            "typeEntity": "Person"
        }
    ],
    "description": "Analysis of transcription factor binding motifs in accessible chromatin.\n\nMEDEA identifies lineage-specifying transcription factors (TFs) from chromatin accessibility assays by:.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                },
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                },
                {
                    "term": "Peak calling",
                    "uri": "http://edamontology.org/operation_3222"
                },
                {
                    "term": "Sequence motif recognition",
                    "uri": "http://edamontology.org/operation_0239"
                }
            ]
        }
    ],
    "homepage": "https://github.com/BulykLab/MEDEA",
    "language": [
        "Python",
        "R"
    ],
    "lastUpdate": "2021-02-20T17:47:20Z",
    "license": "MIT",
    "name": "MEDEA",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1101/GR.260877.120",
            "metadata": {
                "abstract": "© 2020 Mariani et al. This article is distributed exclusively by Cold Spring Harbor Laboratory Press for the first six months after the full-issue publication date (see http://genome.cshlp.org/site/misc/terms.xhtml). After six months, it is available under a Creative Commons License (Attribution-NonCommercial 4.0 International), as described at http://creativecommons.org/licenses/by-nc/4.0/.Deciphering the interplay between chromatin accessibility and transcription factor (TF) binding is fundamental to understanding transcriptional regulation, control of cellular states, and the establishment of new phenotypes. Recent genome-wide chromatin accessibility profiling studies have provided catalogs of putative open regions, where TFs can recognize their motifs and regulate gene expression programs. Here, we present motif enrichment in differential elements of accessibility (MEDEA), a computational tool that analyzes high-throughput chromatin accessibility genomic data to identify cell-type-specific accessible regions and lineage-specific motifs associated with TF binding therein. To benchmark MEDEA, we used a panel of reference cell lines profiled by ENCODE and curated by the ENCODE Project Consortium for the ENCODE-DREAM Challenge. By comparing results with RNA-seq data, ChIP-seq peaks, and DNase-seq footprints, we show that MEDEA improves the detection of motifs associated with known lineage specifiers. We then applied MEDEA to 610 ENCODE DNase-seq data sets, where it revealed significant motifs even when absolute enrichment was low and where it identified novel regulators, such as NRF1 in kidney development. Finally, we show that MEDEA performs well on both bulk and single-cell ATAC-seq data. MEDEA is publicly available as part of our Glossary-GENRE suite for motif enrichment analysis.",
                "authors": [
                    {
                        "name": "Bulyk M.L."
                    },
                    {
                        "name": "Gisselbrecht S.S."
                    },
                    {
                        "name": "Mariani L."
                    },
                    {
                        "name": "Weinand K."
                    }
                ],
                "date": "2020-05-01T00:00:00Z",
                "journal": "Genome Research",
                "title": "MedeA: Analysis of transcription factor binding motifs in accessible chromatin"
            },
            "pmcid": "PMC7263192",
            "pmid": "32424069"
        }
    ],
    "toolType": [
        "Command-line tool",
        "Library"
    ],
    "topic": [
        {
            "term": "Chromosome conformation capture",
            "uri": "http://edamontology.org/topic_3940"
        },
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ]
}
