{
    "accessibility": "Open access",
    "additionDate": "2017-05-02T10:01:15Z",
    "biotoolsCURIE": "biotools:ssaha2",
    "biotoolsID": "ssaha2",
    "collectionID": [
        "galaxyPasteur"
    ],
    "credit": [
        {
            "email": "zn1@sanger.ac.uk",
            "name": "Zemin Ning",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "aws@sanger.ac.uk",
            "name": "Adam Spargo",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "hp3@sanger.ac.uk",
            "name": "Hannes Ponstingl",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Pairwise sequence alignment program designed for the efficient mapping of sequencing reads onto genomic reference sequences.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "ftp://ftp.sanger.ac.uk/pub/resources/software/ssaha2/ssaha2-manual.pdf"
        }
    ],
    "download": [
        {
            "type": "Software package",
            "url": "ftp://ftp.sanger.ac.uk/pub/resources/software/ssaha2/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Sequence alignment",
                        "uri": "http://edamontology.org/data_0863"
                    },
                    "format": [
                        {
                            "term": "FASTQ",
                            "uri": "http://edamontology.org/format_1930"
                        },
                        {
                            "term": "FASTA",
                            "uri": "http://edamontology.org/format_1929"
                        }
                    ]
                }
            ],
            "operation": [
                {
                    "term": "Pairwise sequence alignment",
                    "uri": "http://edamontology.org/operation_0491"
                },
                {
                    "term": "Read mapping",
                    "uri": "http://edamontology.org/operation_3198"
                }
            ]
        }
    ],
    "homepage": "https://www.sanger.ac.uk/science/tools/ssaha2-0",
    "lastUpdate": "2020-06-16T10:55:21Z",
    "license": "GPL-3.0",
    "maturity": "Mature",
    "name": "SSAHA2",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "doi": "10.1101/gr.194201",
            "metadata": {
                "abstract": "We describe an algorithm, SSAHA (Sequence Search and Alignment by Hashing Algorithm), for performing fast searches on databases containing multiple gigabases of DNA. Sequences in the database are preprocessed by breaking them into consecutive k-tuples of k contiguous bases and then using a hash table to store the position of each occurrence of each k-tuple. Searching for a query sequence in the database is done by obtaining from the hash table the \"hits\" for each k-tuple in the query sequence and then performing a sort on the results. We discuss the effect of the tuple length k on the search speed, memory usage, and sensitivity of the algorithm and present the results of computational experiments which show that SSAHA can be three to four orders of magnitude faster than BLAST or FASTA, while requiring less memory than suffix tree methods. The SSAHA algorithm is used for high-throughput single nucleotide polymorphism (SNP) detection and very large scale sequence assembly. Also, it provides Web-based sequence search facilities for Ensembl projects.",
                "authors": [
                    {
                        "name": "Ning Z."
                    },
                    {
                        "name": "Cox A.J."
                    },
                    {
                        "name": "Mullikin J.C."
                    }
                ],
                "citationCount": 732,
                "date": "2001-11-20T00:00:00Z",
                "journal": "Genome Research",
                "title": "SSAHA: A fast search method for large DNA databases"
            },
            "pmcid": "PMC311141",
            "pmid": "11591649",
            "type": [
                "Primary"
            ]
        },
        {
            "doi": "10.1186/1471-2164-15-264",
            "metadata": {
                "abstract": "Background: The rapid evolution in high-throughput sequencing (HTS) technologies has opened up new perspectives in several research fields and led to the production of large volumes of sequence data. A fundamental step in HTS data analysis is the mapping of reads onto reference sequences. Choosing a suitable mapper for a given technology and a given application is a subtle task because of the difficulty of evaluating mapping algorithms.Results: In this paper, we present a benchmark procedure to compare mapping algorithms used in HTS using both real and simulated datasets and considering four evaluation criteria: computational resource and time requirements, robustness of mapping, ability to report positions for reads in repetitive regions, and ability to retrieve true genetic variation positions. To measure robustness, we introduced a new definition for a correctly mapped read taking into account not only the expected start position of the read but also the end position and the number of indels and substitutions. We developed CuReSim, a new read simulator, that is able to generate customized benchmark data for any kind of HTS technology by adjusting parameters to the error types. CuReSim and CuReSimEval, a tool to evaluate the mapping quality of the CuReSim simulated reads, are freely available. We applied our benchmark procedure to evaluate 14 mappers in the context of whole genome sequencing of small genomes with Ion Torrent data for which such a comparison has not yet been established.Conclusions: A benchmark procedure to compare HTS data mappers is introduced with a new definition for the mapping correctness as well as tools to generate simulated reads and evaluate mapping quality. The application of this procedure to Ion Torrent data from the whole genome sequencing of small genomes has allowed us to validate our benchmark procedure and demonstrate that it is helpful for selecting a mapper based on the intended application, questions to be addressed, and the technology used. This benchmark procedure can be used to evaluate existing or in-development mappers as well as to optimize parameters of a chosen mapper for any application and any sequencing platform. © 2014 Caboche et al.; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Caboche S."
                    },
                    {
                        "name": "Audebert C."
                    },
                    {
                        "name": "Lemoine Y."
                    },
                    {
                        "name": "Hot D."
                    }
                ],
                "citationCount": 51,
                "date": "2014-04-05T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "Comparison of mapping algorithms used in high-throughput sequencing: Application to Ion Torrent data"
            },
            "pmcid": "PMC4051166",
            "pmid": "24708189",
            "type": [
                "Benchmarking study"
            ]
        },
        {
            "doi": "10.7490/f1000research.1114334.1",
            "type": [
                "Other"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        }
    ],
    "validated": 1
}