{"credit":[{"email":"mviterson@gmail.com","name":"Maarten van Iterson","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"url":"http://bioconductor.org/packages/release/bioc/html/SSPA.html"}],"download":[{"type":"Source code","url":"http://bioconductor/packages/release/bioc/src/contrib/SSPA_2.14.0.tar.gz"}],"function":[{"operation":[{"term":"Statistical calculation","uri":"http://edamontology.org/operation_2238"}]}],"labels":{"collectionID":["BioConductor"],"language":["R"],"license":"GPL-2.0","operatingSystem":["Linux","Windows","Mac"],"toolType":["Command-line tool","Library"],"topic":[{"term":"Gene expression","uri":"http://edamontology.org/topic_0203"},{"term":"Microarray experiment","uri":"http://edamontology.org/topic_3518"},{"term":"RNA-seq","uri":"http://edamontology.org/topic_3170"}]},"link":[{"type":"MIRROR","url":"http://www.humgen.nl/MicroarrayAnalysisGroup.html"}],"publication":[{"abstract":"In the design of microarray or next-generation sequencing experiments it is crucial to choose the appropriate number of biological replicates. As often the number of differentially expressed genes and their effect sizes are small and too few replicates will lead to insufficient power to detect these. On the other hand, too many replicates unnecessary leads to high experimental costs. Power and sample size analysis can guide experimentalist in choosing the appropriate number of biological replicates. Several methods for power and sample size analysis have recently been proposed for microarray data. However, most of these are restricted to two group comparisons and require user-defined effect sizes. Here we propose a pilot-data based method for power and sample size analysis which can handle more general experimental designs and uses pilotdata to obtain estimates of the effect sizes. The method can also handle?2 distributed test statistics which enables power and sample size calculations for a much wider class of models, including high-dimensional generalized linear models which are used, e.g., for RNA-seq data analysis. The performance of the method is evaluated using simulated and experimental data from several microarray and next-generation sequencing experiments. Furthermore, we compare our proposed method for estimation of the density of effect sizes from pilot data with a recent proposed method specific for two group comparisons. © 2013 Walter de Gruyter GmbH, Berlin/Boston.","authors":["Van Iterson M.","Van De Wiel M.A.","Boer J.M.","De Menezes R.X."],"cit_count":7,"doi":"10.1515/sagmb-2012-0046","journal":"Statistical Applications in Genetics and Molecular Biology","pmid":"23934609","title":"General power and sample size calculations for high-dimensional genomic data","type":"Primary","year":"2013-08-01"}],"summary":{"biotoolsCURIE":"biotools:sspa","biotoolsID":"sspa","description":"General Sample size and power analysis for microarray and next-generation sequencing data.","homepage":"http://bioconductor.org/packages/release/bioc/html/SSPA.html","name":"SSPA","version":["2.14.0"]}}