{
    "accessibility": "Open access",
    "additionDate": "2023-11-07T14:56:37.281049Z",
    "biotoolsCURIE": "biotools:vsolassobag",
    "biotoolsID": "vsolassobag",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "zhaoqi@sysucc.org.cn",
            "name": "Qi Zhao",
            "typeEntity": "Person"
        },
        {
            "name": "Chaoye Wang",
            "typeEntity": "Person"
        },
        {
            "name": "Di Zhang",
            "typeEntity": "Person"
        },
        {
            "name": "Jiaqi Liang",
            "typeEntity": "Person"
        }
    ],
    "description": "A variable-selection oriented LASSO bagging algorithm for biomarker discovery in omic-based translational research.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Feature selection",
                    "uri": "http://edamontology.org/operation_3936"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "https://seqworld.com/VSOLassoBag/",
    "language": [
        "R"
    ],
    "lastUpdate": "2023-11-07T14:56:37.283838Z",
    "license": "GPL-3.0",
    "name": "VSOLassoBag",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1016/J.JGG.2022.12.005",
            "metadata": {
                "abstract": "Screening biomolecular markers from high-dimensional biological data is one of the long-standing tasks for biomedical translational research. With its advantages in both feature shrinkage and biological interpretability, Least Absolute Shrinkage and Selection Operator (LASSO) algorithm is one of the most popular methods for the scenarios of clinical biomarker development. However, in practice, applying LASSO on omics-based data with high dimensions and low-sample size may usually result in an excess number of predictive variables, leading to the overfitting of the model. Here, we present VSOLassoBag, a wrapped LASSO approach by integrating an ensemble learning strategy to help select efficient and stable variables with high confidence from omics-based data. Using a bagging strategy in combination with a parametric method or inflection point search method, VSOLassoBag can integrate and vote variables generated from multiple LASSO models to determine the optimal candidates. The application of VSOLassoBag on both simulation datasets and real-world datasets shows that the algorithm can effectively identify markers for either case-control binary classification or prognosis prediction. In addition, by comparing with multiple existing algorithms, VSOLassoBag shows a comparable performance under different scenarios while resulting in fewer features than others. In summary, VSOLassoBag, which is available at https://seqworld.com/VSOLassoBag/ under the GPL v3 license, provides an alternative strategy for selecting reliable biomarkers from high-dimensional omics data. For user's convenience, we implement VSOLassoBag as an R package that provides multithreading computing configurations.",
                "authors": [
                    {
                        "name": "Li T."
                    },
                    {
                        "name": "Liang J."
                    },
                    {
                        "name": "Ren J."
                    },
                    {
                        "name": "Wang C."
                    },
                    {
                        "name": "Xie Y."
                    },
                    {
                        "name": "Zeng Y."
                    },
                    {
                        "name": "Zhang D."
                    },
                    {
                        "name": "Zhao Q."
                    },
                    {
                        "name": "Zuo Z."
                    }
                ],
                "citationCount": 2,
                "date": "2023-03-01T00:00:00Z",
                "journal": "Journal of Genetics and Genomics",
                "title": "VSOLassoBag: a variable-selection oriented LASSO bagging algorithm for biomarker discovery in omic-based translational research"
            },
            "pmid": "36608930"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Protein expression",
            "uri": "http://edamontology.org/topic_0108"
        }
    ]
}
