
{
    "credit": [
        {
            "email": "raghava@imtech.res.in",
            "name": "Dr. G.P.S. Raghava",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://crdd.osdd.net/raghava//alphapred/who.html"
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://crdd.osdd.net/raghava//alphapred/help.html"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Multiple sequence alignment",
                    "uri": "http://edamontology.org/operation_0492"
                },
                {
                    "term": "Protein secondary structure prediction",
                    "uri": "http://edamontology.org/operation_0267"
                }
            ]
        }
    ],
    "labels": {
        "collectionID": [
            "Proteomics"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Structure prediction",
                "uri": "http://edamontology.org/topic_0082"
            },
            {
                "term": "Proteomics",
                "uri": "http://edamontology.org/topic_0121"
            },
            {
                "term": "Proteins",
                "uri": "http://edamontology.org/topic_0078"
            }
        ]
    },
    "link": [
        {
            "type": "MIRROR",
            "url": "http://crdd.osdd.net/raghava//alphapred/"
        }
    ],
    "publication": [
        {
            "abstract": "In this paper a systematic attempt has been made to develop a better method for predicting α-turns in proteins. Most of the commonly used approaches in the field of protein structure prediction have been tried in this study, which includes statistical approach \"Sequence Coupled Model\" and machine learning approaches; i) artificial neural network (ANN); ii) Weka (Waikato Environment for Knowledge Analysis) Classifiers and iii) Parallel Exemplar Based Learning (PEBLS). We have also used multiple sequence alignment obtained from PSIBLAST and secondary structure information predicted by PSIPRED. The training and testing of all methods has been performed on a data set of 193 non-homologous protein X-ray structures using five-fold cross-validation. It has been observed that ANN with multiple sequence alignment and predicted secondary structure information outperforms other methods. Based on our observations we have developed an ANN-based method for predicting α-turns in proteins. The main components of the method are two feed-forward back-propagation networks with a single hidden layer. The first sequence-structure network is trained with the multiple sequence alignment in the form of PSI-BLAST-generated position specific scoring matrices. The initial predictions obtained from the first network and PSIPRED predicted secondary structure are used as input to the second structure-structure network to refine the predictions obtained from the first net. The final network yields an overall prediction accuracy of 78.0% and MCC of 0.16. © 2004 Wiley-Liss, Inc.",
            "authors": [
                "Kaur H.",
                "Raghava G.P.S."
            ],
            "cit_count": 42,
            "journal": "Proteins: Structure, Function and Genetics",
            "pmid": "14997542",
            "title": "Prediction of α-Turns in Proteins Using PSI-BLAST Profiles and Secondary Structure Information",
            "year": "2004-04-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:alphapred",
        "biotoolsID": "alphapred",
        "description": "This server predicts the alpha turn residues in the given protein sequence. The method is based on the neural network training on PSI-BLAST generated position specific matrices and PSIPRED predicted secondary structure.",
        "homepage": "http://www.imtech.res.in/raghava/alphapred/",
        "name": "AlphaPred"
    }
}