{
    "accessibility": "Open access",
    "additionDate": "2024-03-27T14:49:49.217330Z",
    "biotoolsCURIE": "biotools:alexandrusps",
    "biotoolsID": "alexandrusps",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "m.levin@imb.de",
            "name": "Michal Levin",
            "orcidid": "https://orcid.org/0000-0003-3484-890X",
            "typeEntity": "Person"
        },
        {
            "email": "f.butter@imb.de",
            "name": "Falk Butter",
            "typeEntity": "Person"
        }
    ],
    "description": "Pipeline for the automated detection of orthologous gene clusters and subsequent positive selection analysis.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Homology-based gene prediction",
                    "uri": "http://edamontology.org/operation_3663"
                },
                {
                    "term": "Phylogenetic analysis",
                    "uri": "http://edamontology.org/operation_0324"
                }
            ]
        }
    ],
    "homepage": "https://github.com/alejocn5/AlexandrusPS",
    "language": [
        "Perl",
        "Shell"
    ],
    "lastUpdate": "2024-11-24T14:06:15.337318Z",
    "name": "AlexandrusPS",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/gbe/evad187",
            "metadata": {
                "abstract": "The detection of adaptive selection in a system approach considering all protein-coding genes allows for the identification of mechanisms and pathways that enabled adaptation to different environments. Currently, available programs for the estimation of positive selection signals can be divided into two groups. They are either easy to apply but can analyze only one gene family at a time, restricting system analysis; or they can handle larger cohorts of gene families, but require considerable prerequisite data such as orthology associations, codon alignments, phylogenetic trees, and proper configuration files. All these steps require extensive computational expertise, restricting this endeavor to specialists. Here, we introduce AlexandrusPS, a high-throughput pipeline that overcomes technical challenges when conducting transcriptome-wide positive selection analyses on large sets of nucleotide and protein sequences. The pipeline streamlines 1) the execution of an accurate orthology prediction as a precondition for positive selection analysis, 2) preparing and organizing configuration files for CodeML, 3) performing positive selection analysis using CodeML, and 4) generating an output that is easy to interpret, including all maximum likelihood and log-likelihood test results. The only input needed from the user is the CDS and peptide FASTA files of proteins of interest. The pipeline is provided in a Docker image, requiring no program or module installation, enabling the application of the pipeline in any computing environment. AlexandrusPS and its documentation are available via GitHub (https://github.com/alejocn5/AlexandrusPS).",
                "authors": [
                    {
                        "name": "Butter F."
                    },
                    {
                        "name": "Ceron-Noriega A."
                    },
                    {
                        "name": "Levin M."
                    },
                    {
                        "name": "Schoonenberg V.A.C."
                    }
                ],
                "date": "2023-10-01T00:00:00Z",
                "journal": "Genome Biology and Evolution",
                "title": "AlexandrusPS: A User-Friendly Pipeline for the Automated Detection of Orthologous Gene Clusters and Subsequent Positive Selection Analysis"
            },
            "pmcid": "PMC10612477",
            "pmid": "37831426"
        }
    ],
    "toolType": [
        "Workflow"
    ],
    "topic": [
        {
            "term": "Computer science",
            "uri": "http://edamontology.org/topic_3316"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ]
}
