{
    "additionDate": "2019-11-14T18:31:51Z",
    "biotoolsCURIE": "biotools:Curatopes_Melanoma",
    "biotoolsID": "Curatopes_Melanoma",
    "confidence_flag": "medium",
    "description": "> MEDIUM CONFIDENCE! | A Database of Predicted T-cell Epitopes from Overly Expressed Proteins in Metastatic Cutaneous Melanoma | Browse and download predicted melanoma epitopes with high expected clinical efficacy in anti-cancer immunotherapy | This page acts as a gateway to the Curatopes Melanoma database",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Epitope mapping",
                    "uri": "http://edamontology.org/operation_0416"
                }
            ]
        }
    ],
    "homepage": "https://www.curatopes.com",
    "lastUpdate": "2019-11-14T18:31:51Z",
    "name": "Curatopes Melanoma",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1158/0008-5472.CAN-19-0296",
            "metadata": {
                "abstract": "© 2019 American Association for Cancer Research.Therapeutic anticancer vaccination has been adapted as an immunotherapy in several solid tumors. However, the selection of promising candidates from the total quantity of possible epitopes poses a challenge to clinicians and bioinformaticians alike, and very few epitopes have been tested in experimental or clinical settings to validate their efficacy. Here, we present a comprehensive database of predicted nonmutated peptide epitopes derived from genes that are overly expressed in a group of 32 melanoma biopsies compared with healthy tissues and that were filtered against expression in a curated list of survival-critical tissues. We hypothesize that these \"self-tolerant\" epitopes have two desirable properties: they do not depend on mutations, being immediately applicable to a large patient collective, and they potentially cause fewer autoimmune reactions. To support epitope selection, we provide an aggregated score of expected therapeutic efficiency as a shortlist mechanism. The database has applications in facilitating epitope selection and trial design and is freely accessible at https://www.curatopes.com. Significance: A database is presented that predicts and scores antitumor T-cell epitopes, with a focus on tolerability and avoidance of severe autoimmunity, offering a supplementary epitope set for further investigation in immunotherapy.",
                "authors": [
                    {
                        "name": "Lischer C."
                    },
                    {
                        "name": "Eberhardt M."
                    },
                    {
                        "name": "Jaitly T."
                    },
                    {
                        "name": "Schinzel C."
                    },
                    {
                        "name": "Schaft N."
                    },
                    {
                        "name": "Dorrie J."
                    },
                    {
                        "name": "Schuler G."
                    },
                    {
                        "name": "Vera J."
                    }
                ],
                "date": "2019-10-15T00:00:00Z",
                "journal": "Cancer Research",
                "title": "Curatopes melanoma: A Database of Predicted T-cell Epitopes from Overly Expressed Proteins in Metastatic Cutaneous Melanoma"
            },
            "pmid": "31416842"
        }
    ],
    "topic": [
        {
            "term": "Immunology",
            "uri": "http://edamontology.org/topic_0804"
        },
        {
            "term": "Allergy, clinical immunology and immunotherapeutics",
            "uri": "http://edamontology.org/topic_3400"
        },
        {
            "term": "Preclinical and clinical studies",
            "uri": "http://edamontology.org/topic_3379"
        }
    ]
}