
{
    "credit": [
        {
            "email": "cpg@usal.es",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://ibfg.es/en/francisco-antequera-en"
        }
    ],
    "documentation": [
        {
            "url": "http://nucleosome.usal.es/nucwave/"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Nucleosome formation or exclusion sequence prediction",
                    "uri": "http://edamontology.org/operation_0432"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Python"
        ],
        "operatingSystem": [
            "Linux",
            "Windows"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "DNA",
                "uri": "http://edamontology.org/topic_0654"
            },
            {
                "term": "Nucleic acid structure analysis",
                "uri": "http://edamontology.org/topic_0097"
            },
            {
                "term": "DNA binding sites",
                "uri": "http://edamontology.org/topic_3125"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://www.mybiosoftware.com/nucwave-v1-generates-nucleosome-occupation-maps.html"
        }
    ],
    "publication": [
        {
            "abstract": "© The Author 2014. Published by Oxford University Press. Nucleosomes contribute to compacting the genome into the nucleus and regulate the physical access of regulatory proteins to DNA either directly or through the epigenetic modifications of the histone tails. Precise mapping of nucleosome positioning across the genome is, therefore, essential to understanding the genome regulation. In recent years, several experimental protocols have been developed for this purpose that include the enzymatic digestion, chemical cleavage or immunoprecipitation of chromatin followed by next-generation sequencing of the resulting DNA fragments. Here, we compare the performance and resolution of these methods from the initial biochemical steps through the alignment of the millions of short-sequence reads to a reference genome to the final computational analysis to generate genome-wide maps of nucleosome occupancy. Because of the lack of a unified protocol to process data sets obtained through the different approaches, we have developed a new computational tool (NUCwave), which facilitates their analysis, comparison and assessment and will enable researchers to choose the most suitable method for any particular purpose. NUCwave is freely available at http://nucleosome.usal.es/nucwave along with a step-by-step protocol for its use.",
            "authors": [
                "Quintales L.",
                "Vazquez E.",
                "Antequera F."
            ],
            "cit_count": 14,
            "journal": "Briefings in Bioinformatics",
            "pmid": "25296770",
            "title": "Comparative analysis of methods for genome-wide nucleosome cartography",
            "year": "2014-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:nucwave",
        "biotoolsID": "nucwave",
        "description": "Bioinformatic tool that generates nucleosome occupation maps.",
        "homepage": "http://nucleosome.usal.es/nucwave/",
        "name": "NUCwave"
    }
}