{
    "additionDate": "2021-01-18T08:38:00Z",
    "biotoolsCURIE": "biotools:zebra2",
    "biotoolsID": "zebra2",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "d.a.suplatov@belozersky.msu.ru",
            "name": "Dmitry Suplatov",
            "orcidid": "https://orcid.org/0000-0002-7054-3487",
            "typeEntity": "Person"
        }
    ],
    "description": "advanced and easy-to-use web-server for bioinformatic analysis of subfamily-specific and conserved positions in diverse protein superfamilies.\n\nThe Zebra parameters can be classified into three sections: (1) select positions (columns in the multiple alignment) that will be used to suggest classifications of proteins into functional subfamilies and to estimate the statistical significance of the corresponding subfamily-specific positions; (2) define parameters to improve the scoring and statistical assessment of the subfamily-specific positions; and, finally, (3) setup the algorithm to automatically classify proteins into functional subfamilies, or provide the manual classification file.",
    "documentation": [
        {
            "type": [
                "Training material"
            ],
            "url": "https://biokinet.belozersky.msu.ru/zebra-examples"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Multiple sequence alignment",
                    "uri": "http://edamontology.org/operation_0492"
                },
                {
                    "term": "Multiple structure alignment",
                    "uri": "http://edamontology.org/operation_0504"
                },
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Pairwise structure alignment",
                    "uri": "http://edamontology.org/operation_0503"
                },
                {
                    "term": "Structure-based sequence alignment",
                    "uri": "http://edamontology.org/operation_0294"
                }
            ]
        }
    ],
    "homepage": "https://biokinet.belozersky.msu.ru/zebra2",
    "lastUpdate": "2021-03-18T14:38:48Z",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "https://biokinet.belozersky.msu.ru/zebra-parameters"
        },
        {
            "type": [
                "Other"
            ],
            "url": "https://biokinet.belozersky.msu.ru/zebra-input"
        },
        {
            "type": [
                "Other"
            ],
            "url": "https://biokinet.belozersky.msu.ru/zebra-output"
        }
    ],
    "name": "Zebra2",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1093/NAR/GKAA276",
            "metadata": {
                "abstract": "© The Author(s) 2020. Published by Oxford University Press on behalf of Nucleic Acids Research.Zebra2 is a highly automated web-tool to search for subfamily-specific and conserved positions (i.e. the determinants of functional diversity as well as the key catalytic and structural residues) in protein superfamilies. The bioinformatic analysis is facilitated by Mustguseal––a companion web-server to automatically collect and superimpose a large representative set of functionally diverse homologs with high structure similarity but low sequence identity to the selected query protein. The results are automatically prioritized and provided at four information levels to facilitate the knowledge-driven expert selection of the most promising positions on-line: as a sequence similarity network; interfaces to sequence-based and 3D-structure-based analysis of conservation and variability; and accompanied by the detailed annotation of proteins accumulated from the integrated databases with links to the external resources. The integration of Zebra2 and Mustguseal web-tools provides the first of its kind out-of-the-box open-access solution to conduct a systematic analysis of evolutionarily related proteins implementing different functions within a shared 3D-structure of the superfamily, determine common and specific patterns of function-associated local structural elements, assist to select hot-spots for rational design and to prepare focused libraries for directed evolution. The web-servers are free and open to all users at https://biokinet.belozersky.msu.ru/zebra2, no lo-gin required.",
                "authors": [
                    {
                        "name": "Suplatov D."
                    },
                    {
                        "name": "Sharapova Y."
                    },
                    {
                        "name": "Geraseva E."
                    },
                    {
                        "name": "Svedas V."
                    }
                ],
                "citationCount": 8,
                "date": "2021-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "Zebra2: advanced and easy-to-use web-server for bioinformatic analysis of subfamily-specific and conserved positions in diverse protein superfamilies"
            },
            "pmcid": "PMC7319439",
            "pmid": "32313959"
        }
    ],
    "topic": [
        {
            "term": "Enzymes",
            "uri": "http://edamontology.org/topic_0821"
        },
        {
            "term": "Protein folding, stability and design",
            "uri": "http://edamontology.org/topic_0130"
        },
        {
            "term": "Evolutionary biology",
            "uri": "http://edamontology.org/topic_3299"
        },
        {
            "term": "Gene and protein families",
            "uri": "http://edamontology.org/topic_0623"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}