{
    "additionDate": "2021-01-18T09:35:39Z",
    "biotoolsCURIE": "biotools:dosepredict",
    "biotoolsID": "dosepredict",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "Malek.f.okour@gmail.com",
            "name": "Malek Okour BDS, PhD",
            "typeEntity": "Person"
        }
    ],
    "description": "DosePredict is a Shiny-based graphical user interface software that can be used for the conduct of dose predictions.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Modelling and simulation",
                    "uri": "http://edamontology.org/operation_2426"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Simulation analysis",
                    "uri": "http://edamontology.org/operation_0244"
                }
            ]
        }
    ],
    "homepage": "http://www.DosePredict.com",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-03-01T20:00:11Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "https://mokour.shinyapps.io/DosePredict/"
        },
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/malekokour1/DosePredict"
        }
    ],
    "name": "DosePredict",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1002/JCPH.1649",
            "metadata": {
                "abstract": "© 2020, The American College of Clinical PharmacologyIn drug development, dose prediction is a routinely conducted quantitative data analysis. It involves combining available relevant preclinical and/or clinical data to conduct modeling and simulation analyses where various dose prediction scenarios are usually considered. As further data emerges during drug development, dose prediction may undergo several rounds of refinement. In this article, I present DosePredict, a Shiny-based graphical user interface software that can be used for the conduct of dose predictions. DosePredict is built based on pharmacokinetic (PK) models, including 1-, 2-, and 3-compartment models. The user specifies the desired PK model and then provides input parameter values and variables associated with the evaluated dose prediction scenario. On that basis, DosePredict conducts stochastic simulations for a specified number of subjects and follows that by providing detailed PK and dose prediction outputs. An HTML report can then be generated in which all the input parameters and variables and all the output plots and tables are captured. DosePredict is deployed through the Shiny server. A Shiny dose prediction software, DosePredict, was developed to assist scientists involved in the drug discovery and development process in their dose prediction analyses. This software comes as a step forward in developing individualized solutions as it provides a comprehensive dose prediction analysis. The software allows for expediting the analysis process in a reproducible manner, therefore allowing exploration of various scenarios in a timely fashion.",
                "authors": [
                    {
                        "name": "Okour M."
                    }
                ],
                "date": "2020-11-01T00:00:00Z",
                "journal": "Journal of Clinical Pharmacology",
                "title": "DosePredict: A Shiny Application for Generalized Pharmacokinetics-Based Dose Predictions"
            },
            "pmid": "32542731"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Drug development",
            "uri": "http://edamontology.org/topic_3373"
        },
        {
            "term": "Drug discovery",
            "uri": "http://edamontology.org/topic_3336"
        },
        {
            "term": "Drug metabolism",
            "uri": "http://edamontology.org/topic_3375"
        },
        {
            "term": "Pharmacology",
            "uri": "http://edamontology.org/topic_0202"
        }
    ]
}
