
{
    "credit": [
        {
            "name": "uma.es",
            "typeEntity": "Institute",
            "typeRoles": [
                "Provider"
            ]
        },
        {
            "email": "estebanpw@uma.es",
            "name": "Esteban Pérez-Wohlfeil",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://bitlab-es.com/jorca/"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://bitlab-es.com/jorca/documents/jORCA-full.pdf"
        },
        {
            "type": "Binaries",
            "url": "http://bitlab-es.com/jorca/files/jORCAApr2014.zip"
        }
    ],
    "function": [
        {
            "note": "Browsing, discovering and invocating Web Services registered in meta-data repositories",
            "operation": [
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                },
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Service discovery",
                    "uri": "http://edamontology.org/operation_3761"
                }
            ]
        }
    ],
    "labels": {
        "collectionID": [
            "ELIXIR-ES"
        ],
        "cost": "Free of charge",
        "language": [
            "Java"
        ],
        "license": "GPL-3.0",
        "maturity": "Mature",
        "operatingSystem": [
            "Windows"
        ],
        "toolType": [
            "Desktop application"
        ],
        "topic": [
            {
                "term": "Biology",
                "uri": "http://edamontology.org/topic_3070"
            },
            {
                "term": "Software engineering",
                "uri": "http://edamontology.org/topic_3372"
            },
            {
                "term": "Data acquisition",
                "uri": "http://edamontology.org/topic_3077"
            }
        ]
    },
    "link": [
        {
            "type": "Repository",
            "url": "http://bitlab-es.com/jorca/documents/jORCA-full.pdf"
        }
    ],
    "publication": [
        {
            "abstract": "Motivation: Web services technology is becoming the option of choice to deploy bioinformatics tools that are universally available. One of the major strengths of this approach is that it supports machine-to-machine interoperability over a network. However, a weakness of this approach is that various Web Services differ in their definition and invocation protocols, as well as their communication and data formats-and this presents a barrier to service interoperability. Results: jORCA is a desktop client aimed at facilitating seamless integration of Web Services. It does so by making a uniform representation of the different web resources, supporting scalable service discovery, and automatic composition of workflows. Usability is at the top of the jORCA agenda; thus it is a highly customizable and extensible application that accommodates a broad range of user skills featuring double-click invocation of services in conjunction with advanced execution-control, on the fly data standardization, extensibility of viewer plug-ins, drag-and-drop editing capabilities, plus a file-based browsing style and organization of favourite tools. The integration of bioinformatics Web Services is made easier to support a wider range of users. Availability and Implementation: jORCA binaries and extended documentation are freely available at http://www.bitlab-es.com/jorca under the Creative Commons Attribution-No Derivative Works 2.5 Spain License and jORCA source code (implemented in Java) is available under request. (GPL v3 license). jORCA has been tested under UNIX (Fedora 11, open SUSE 11 and Ubuntu 8.1), MS-Windows and Mac OS 10.5 operating systems. Java VM version 1.6.0 later is required. Contact: ots@uma.es or vickymr@uma.es Supplementary information: Supplementary data are available at Bioinformatics online. © The Author 2010. Published by Oxford University Press.",
            "authors": [
                "Martin-Requena V.",
                "Rios J.",
                "Garcia M.",
                "Ramirez S.",
                "Trelles O."
            ],
            "cit_count": 25,
            "doi": "10.1093/bioinformatics/btp709",
            "journal": "Bioinformatics",
            "pmid": "20047879",
            "title": "jORCA: Easily integrating bioinformatics Web Services",
            "type": "Primary",
            "year": "2010-01-03"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:jorca",
        "biotoolsID": "jorca",
        "description": "A desktop client able to efficiently integrate different type of web-services repositories mapping metadata over a general definition to support scalable service discovery and to achieve flexible inter-communication between tools.",
        "homepage": "http://bitlab-es.com/jorca/",
        "name": "jORCA",
        "version": [
            "1"
        ]
    }
}