{
    "additionDate": "2019-11-14T18:22:41Z",
    "biotoolsCURIE": "biotools:TM-IMC",
    "biotoolsID": "TM-IMC",
    "confidence_flag": "high",
    "credit": [
        {
            "email": "kexiaoyan@njmu.edu.cn",
            "name": "Xiaoyan Ke",
            "typeEntity": "Person"
        },
        {
            "email": "zhng@umich.edu",
            "name": "Yang Zhang",
            "typeEntity": "Person"
        }
    ],
    "description": "> CORRECT NAME OF TOOL COULD ALSO BE 'text mining induction matrix completion', 'text mining inductive matrix completion' | Function Prediction for G Protein-Coupled Receptors through Text Mining and Induction Matrix Completion | TM-IMC: Text Mining and Induce Matrix Completion for GPCR function prediction | TM-IMC is an algorithm for automated annotation of Gene Ontology (GO) term for G protein-coupled receptors (GPCRs) using features derived from text mining and induced matrix completion of GPCR-GO associatation matrix",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Side chain modelling",
                    "uri": "http://edamontology.org/operation_0480"
                },
                {
                    "term": "Protein secondary structure prediction",
                    "uri": "http://edamontology.org/operation_0267"
                },
                {
                    "term": "Text mining",
                    "uri": "http://edamontology.org/operation_0306"
                }
            ]
        }
    ],
    "homepage": "https://zhanglab.ccmb.med.umich.edu/TM-IMC",
    "lastUpdate": "2019-11-14T18:22:41Z",
    "name": "TM-IMC",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1021/ACSOMEGA.8B02454",
            "metadata": {
                "abstract": "© 2019 American Chemical Society.G protein-coupled receptors (GPCRs) constitute the key component of cellular signal transduction. Accurately annotating the biological functions of GPCR proteins is vital to the understanding of the physiological processes they involve in. With the rapid development of text mining technologies and the exponential growth of biomedical literature, it becomes urgent to explore biological functional information from various literature for systematically and reliably annotating these known GPCRs. We design a novel three-stage approach, TM-IMC, using text mining and inductive matrix completion, for automated prediction of the gene ontology (GO) terms of the GPCR proteins. Large-scale benchmark tests show that inductive matrix completion models contribute to GPCR-GO association prediction for both molecular function and biological process aspects. Moreover, our detailed data analysis shows that information extracted from GPCR-associated literature indeed contributes to the prediction of GPCR-GO associations. The study demonstrated a new avenue to enhance the accuracy of GPCR function annotation through the combination of text mining and induction matrix completion over baseline methods in critical assessment of protein function annotation algorithms and literature-based GO annotation methods. Source codes of TM-IMC and the involved datasets can be freely downloaded from https://zhanglab.ccmb.med.umich.edu/TM-IMC for academic purposes.",
                "authors": [
                    {
                        "name": "Wu J."
                    },
                    {
                        "name": "Yin Q."
                    },
                    {
                        "name": "Zhang C."
                    },
                    {
                        "name": "Geng J."
                    },
                    {
                        "name": "Wu H."
                    },
                    {
                        "name": "Hu H."
                    },
                    {
                        "name": "Ke X."
                    },
                    {
                        "name": "Zhang Y."
                    }
                ],
                "citationCount": 1,
                "date": "2019-02-12T00:00:00Z",
                "journal": "ACS Omega",
                "title": "Function prediction for g protein-coupled receptors through text mining and induction matrix completion"
            },
            "pmcid": "PMC6649004",
            "pmid": "31459527"
        }
    ],
    "topic": [
        {
            "term": "Natural language processing",
            "uri": "http://edamontology.org/topic_0218"
        },
        {
            "term": "Ontology and terminology",
            "uri": "http://edamontology.org/topic_0089"
        },
        {
            "term": "Physiology",
            "uri": "http://edamontology.org/topic_3300"
        }
    ]
}