{
    "additionDate": "2021-10-11T08:27:43.417264Z",
    "biotoolsCURIE": "biotools:mrpc",
    "biotoolsID": "mrpc",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "mbbadshar@gmail.com",
            "name": "Md. Bahadur Badsha",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "audreyf@uidaho.edu",
            "name": "Audrey Qiuyan Fu",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "MRPC is an R package for inference of Causal Graphs. MRPC builds on existing PC algorithms and learns a causal network with increased accuracy. The inferred causal network contains directed and undirected edges, with the direction indicating causality. For genomic data, MRPC determines edge direction under the principle of Mendelian randomization when genotype and molecular phenotype (e.g. gene expression) data are both available at the individual level. Nodes in the inferred network may be a genotype or a molecular phenotype.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Weighted correlation network analysis",
                    "uri": "http://edamontology.org/operation_3766"
                },
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Imputation",
                    "uri": "http://edamontology.org/operation_3557"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://cran.r-project.org/package=MRPC",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-10-11T08:27:43.420012Z",
    "license": "GPL-2.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/audreyqyfu/mrpc"
        },
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/audreyqyfu/mrpc/issues"
        }
    ],
    "name": "MRPC",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.3389/FGENE.2021.651812",
            "metadata": {
                "abstract": "© Copyright © 2021 Badsha, Martin and Fu.Understanding the causal relationships between variables is a central goal of many scientific inquiries. Causal relationships may be represented by directed edges in a graph (or equivalently, a network). In biology, for example, gene regulatory networks may be viewed as a type of causal networks, where X→Y represents gene X regulating (i.e., being causal to) gene Y. However, existing general-purpose graph inference methods often result in a high number of false edges, whereas current causal inference methods developed for observational data in genomics can handle only limited types of causal relationships. We present MRPC (a PC algorithm with the principle of Mendelian Randomization), an R package that learns causal graphs with improved accuracy over existing methods. Our algorithm builds on the powerful PC algorithm (named after its developers Peter Spirtes and Clark Glymour), a canonical algorithm in computer science for learning directed acyclic graphs. The improvements in MRPC result in increased accuracy in identifying v-structures (i.e., X→Y←Z), and robustness to how the nodes are arranged in the input data. In the special case of genomic data that contain genotypes and phenotypes (e.g., gene expression) at the individual level, MRPC incorporates the principle of Mendelian randomization as constraints on edge direction to help orient the edges. MRPC allows for inference of causal graphs not only for general purposes, but also for biomedical data where multiple types of data may be input to provide evidence for causality. The R package is available on CRAN and is a free open-source software package under a GPL (≥2) license.",
                "authors": [
                    {
                        "name": "Badsha M.B."
                    },
                    {
                        "name": "Martin E.A."
                    },
                    {
                        "name": "Fu A.Q."
                    }
                ],
                "date": "2021-04-30T00:00:00Z",
                "journal": "Frontiers in Genetics",
                "title": "MRPC: An R Package for Inference of Causal Graphs"
            },
            "pmcid": "PMC8120292",
            "pmid": "33995486",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        }
    ]
}