{
    "additionDate": "2021-09-27T06:39:50.375459Z",
    "biotoolsCURIE": "biotools:hvf_extraction_script",
    "biotoolsID": "hvf_extraction_script",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "ying.han@ucsf.edu",
            "name": "Ying Han",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Python module for Humphrey Visual Field (HVF) report data extraction. The package can taken in HVF single field analysis report images (from HFA2 or HFA3), and using OCR (tesseract) and image processing techniques (openCV), extracts data into an object oriented format for further processing.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                },
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                },
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Information extraction",
                    "uri": "http://edamontology.org/operation_3907"
                }
            ]
        }
    ],
    "homepage": "https://github.com/msaifee786/hvf_extraction_script",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-09-27T06:39:50.377818Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/msaifee786/hvf_extraction_script/issues"
        },
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://pypi.org/project/hvf-extraction-script/"
        }
    ],
    "name": "hvf_extraction_script",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.3389/FMED.2021.625487",
            "metadata": {
                "abstract": "© Copyright © 2021 Saifee, Wu, Liu, Ma, Patlidanon, Yu, Ying and Han.Purpose: To introduce and validate hvf_extraction_script, an open-source software script for the automated extraction and structuring of metadata, value plot data, and percentile plot data from Humphrey visual field (HVF) report images. Methods: Validation was performed on 90 HVF reports over three different report layouts, including a total of 1,530 metadata fields, 15,536 value plot data points, and 10,210 percentile data points, between the computer script and four human extractors, compared against DICOM reference data. Computer extraction and human extraction were compared on extraction time as well as accuracy of extraction for metadata, value plot data, and percentile plot data. Results: Computer extraction required 4.9-8.9 s per report, compared to the 6.5-19 min required by human extractors, representing a more than 40-fold difference in extraction speed. Computer metadata extraction error rate varied from an aggregate 1.2-3.5%, compared to 0.2-9.2% for human metadata extraction across all layouts. Computer value data point extraction had an aggregate error rate of 0.9% for version 1, <0.01% in version 2, and 0.15% in version 3, compared to 0.8-9.2% aggregate error rate for human extraction. Computer percentile data point extraction similarly had very low error rates, with no errors occurring in version 1 and 2, and 0.06% error rate in version 3, compared to 0.06-12.2% error rate for human extraction. Conclusions: This study introduces and validates hvf_extraction_script, an open-source tool for fast, accurate, automated data extraction of HVF reports to facilitate analysis of large-volume HVF datasets, and demonstrates the value of image processing tools in facilitating faster and cheaper large-volume data extraction in research settings.",
                "authors": [
                    {
                        "name": "Saifee M."
                    },
                    {
                        "name": "Wu J."
                    },
                    {
                        "name": "Liu Y."
                    },
                    {
                        "name": "Ma P."
                    },
                    {
                        "name": "Patlidanon J."
                    },
                    {
                        "name": "Yu Y."
                    },
                    {
                        "name": "Ying G.-S."
                    },
                    {
                        "name": "Han Y."
                    }
                ],
                "date": "2021-04-29T00:00:00Z",
                "journal": "Frontiers in Medicine",
                "title": "Development and Validation of Automated Visual Field Report Extraction Platform Using Computer Vision Tools"
            },
            "pmcid": "PMC8116600",
            "pmid": "33996848",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Human biology",
            "uri": "http://edamontology.org/topic_2815"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        }
    ]
}