{
    "additionDate": "2021-01-18T12:14:49Z",
    "biotoolsCURIE": "biotools:longgf",
    "biotoolsID": "longgf",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "wangk@email.chop.edu",
            "name": "Kai Wang",
            "orcidid": "https://orcid.org/0000-0002-5585-982X",
            "typeEntity": "Person"
        }
    ],
    "description": "Computational algorithm and software tool for fast and accurate detection of gene fusions by long-read transcriptome sequencing.\n\nA computational algorithm and software tool for fast and accurate detection of gene fusion by long-read transcriptome sequencing.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Base-calling",
                    "uri": "http://edamontology.org/operation_3185"
                },
                {
                    "term": "Transcriptome assembly",
                    "uri": "http://edamontology.org/operation_3258"
                },
                {
                    "term": "Read mapping",
                    "uri": "http://edamontology.org/operation_3198"
                }
            ]
        }
    ],
    "homepage": "https://github.com/WGLab/LongGF",
    "language": [
        "C",
        "C++"
    ],
    "lastUpdate": "2021-02-19T07:56:00Z",
    "license": "GPL-3.0",
    "name": "LongGF",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1186/S12864-020-07207-4",
            "metadata": {
                "abstract": "© 2020, The Author(s).Background: Long-read RNA-Seq techniques can generate reads that encompass a large proportion or the entire mRNA/cDNA molecules, so they are expected to address inherited limitations of short-read RNA-Seq techniques that typically generate < 150 bp reads. However, there is a general lack of software tools for gene fusion detection from long-read RNA-seq data, which takes into account the high basecalling error rates and the presence of alignment errors. Results: In this study, we developed a fast computational tool, LongGF, to efficiently detect candidate gene fusions from long-read RNA-seq data, including cDNA sequencing data and direct mRNA sequencing data. We evaluated LongGF on tens of simulated long-read RNA-seq datasets, and demonstrated its superior performance in gene fusion detection. We also tested LongGF on a Nanopore direct mRNA sequencing dataset and a PacBio sequencing dataset generated on a mixture of 10 cancer cell lines, and found that LongGF achieved better performance to detect known gene fusions over existing computational tools. Furthermore, we tested LongGF on a Nanopore cDNA sequencing dataset on acute myeloid leukemia, and pinpointed the exact location of a translocation (previously known in cytogenetic resolution) in base resolution, which was further validated by Sanger sequencing. Conclusions: In summary, LongGF will greatly facilitate the discovery of candidate gene fusion events from long-read RNA-Seq data, especially in cancer samples. LongGF is implemented in C++ and is available at https://github.com/WGLab/LongGF.",
                "authors": [
                    {
                        "name": "Liu Q."
                    },
                    {
                        "name": "Hu Y."
                    },
                    {
                        "name": "Stucky A."
                    },
                    {
                        "name": "Fang L."
                    },
                    {
                        "name": "Zhong J.F."
                    },
                    {
                        "name": "Wang K."
                    }
                ],
                "date": "2020-12-01T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "LongGF: computational algorithm and software tool for fast and accurate detection of gene fusions by long-read transcriptome sequencing"
            },
            "pmcid": "PMC7771079",
            "pmid": "33372596"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        }
    ]
}