{
    "additionDate": "2020-01-14T19:30:24Z",
    "biotoolsCURIE": "biotools:UNet",
    "biotoolsID": "UNet",
    "confidence_flag": "tool",
    "description": "Redesigning Skip Connections to Exploit Multiscale Features in Image Segmentation.\n\nOfficial Keras Implementation for UNet++ in IEEE Transactions on Medical Imaging and DLMIA 2018.\n\nUNet++: A Nested U-Net Architecture for Medical Image Segmentation.\n\nUNet++ is a new general purpose image segmentation architecture for more accurate image segmentation. UNet++ consists of U-Nets of varying depths whose decoders are densely connected at the same resolution via the redesigned skip pathways, which aim to address two key challenges of the U-Net: 1) unknown depth of the optimal architecture and 2) the unnecessarily restrictive design of skip connections",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                },
                {
                    "term": "Backbone modelling",
                    "uri": "http://edamontology.org/operation_0479"
                }
            ]
        }
    ],
    "homepage": "https://github.com/MrGiovanni/UNetPlusPlus",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-01-02T09:47:25Z",
    "license": "MIT",
    "name": "UNet++",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1109/TMI.2019.2959609",
            "metadata": {
                "abstract": "© 1982-2012 IEEE.The state-of-the-art models for medical image segmentation are variants of U-Net and fully convolutional networks (FCN). Despite their success, these models have two limitations: (1) their optimal depth is apriori unknown, requiring extensive architecture search or inefficient ensemble of models of varying depths; and (2) their skip connections impose an unnecessarily restrictive fusion scheme, forcing aggregation only at the same-scale feature maps of the encoder and decoder sub-networks. To overcome these two limitations, we propose UNet++, a new neural architecture for semantic and instance segmentation, by (1) alleviating the unknown network depth with an efficient ensemble of U-Nets of varying depths, which partially share an encoder and co-learn simultaneously using deep supervision; (2) redesigning skip connections to aggregate features of varying semantic scales at the decoder sub-networks, leading to a highly flexible feature fusion scheme; and (3) devising a pruning scheme to accelerate the inference speed of UNet++. We have evaluated UNet++ using six different medical image segmentation datasets, covering multiple imaging modalities such as computed tomography (CT), magnetic resonance imaging (MRI), and electron microscopy (EM), and demonstrating that (1) UNet++ consistently outperforms the baseline models for the task of semantic segmentation across different datasets and backbone architectures; (2) UNet++ enhances segmentation quality of varying-size objects - an improvement over the fixed-depth U-Net; (3) Mask RCNN++ (Mask R-CNN with UNet++ design) outperforms the original Mask R-CNN for the task of instance segmentation; and (4) pruned UNet++ models achieve significant speedup while showing only modest performance degradation. Our implementation and pre-trained models are available at https://github.com/MrGiovanni/UNetPlusPlus.",
                "authors": [
                    {
                        "name": "Liang J."
                    },
                    {
                        "name": "Siddiquee M.M.R."
                    },
                    {
                        "name": "Tajbakhsh N."
                    },
                    {
                        "name": "Zhou Z."
                    }
                ],
                "citationCount": 148,
                "date": "2020-06-01T00:00:00Z",
                "journal": "IEEE Transactions on Medical Imaging",
                "title": "UNet++: Redesigning Skip Connections to Exploit Multiscale Features in Image Segmentation"
            },
            "pmid": "31841402"
        }
    ],
    "topic": [
        {
            "term": "Electron microscopy",
            "uri": "http://edamontology.org/topic_0611"
        },
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        },
        {
            "term": "Tomography",
            "uri": "http://edamontology.org/topic_3452"
        }
    ],
    "validated": 1
}
