{
    "additionDate": "2017-03-25T13:09:42Z",
    "biotoolsCURIE": "biotools:depth",
    "biotoolsID": "depth",
    "credit": [
        {
            "email": "cospisupport@acads.iiserpune.ac.in",
            "name": "COSPI Support",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "DEPTH web tool computes depth and solvent-accessible surface area values for the prediction of small molecule ligand binding cavities in proteins.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://cospi.iiserpune.ac.in/depth/htdocs/help.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Residue distance calculation",
                    "uri": "http://edamontology.org/operation_2950"
                },
                {
                    "term": "Molecular surface calculation",
                    "uri": "http://edamontology.org/operation_0387"
                },
                {
                    "term": "Protein binding site prediction",
                    "uri": "http://edamontology.org/operation_2575"
                },
                {
                    "term": "Molecular docking",
                    "uri": "http://edamontology.org/operation_0478"
                },
                {
                    "term": "Read depth analysis",
                    "uri": "http://edamontology.org/operation_3230"
                }
            ]
        }
    ],
    "homepage": "http://mspc.bii.a-star.edu.sg/depth",
    "lastUpdate": "2018-12-10T12:58:56Z",
    "name": "DEPTH",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "Depth measures the extent of atom/residue burial within a protein. It correlates with properties such as protein stability, hydrogen exchange rate, protein-protein interaction hot spots, post-translational modification sites and sequence variability. Our server, DEPTH, accurately computes depth and solvent-accessible surface area (SASA) values. We show that depth can be used to predict small molecule ligand binding cavities in proteins. Often, some of the residues lining a ligand binding cavity are both deep and solvent exposed. Using the depth-SASA pair values for a residue, its likelihood to form part of a small molecule binding cavity is estimated. The parameters of the method were calibrated over a training set of 900 high-resolution X-ray crystal structures of single-domain proteins bound to small molecules (molecular weight <1.5KDa). The prediction accuracy of DEPTH is comparable to that of other geometry-based prediction methods including LIGSITE, SURFNET and Pocket-Finder (all with Matthew's correlation coefficient of ∼0.4) over a testing set of 225 single and multi-chain protein structures. Users have the option of tuning several parameters to detect cavities of different sizes, for example, geometrically flat binding sites. The input to the server is a protein 3D structure in PDB format. The users have the option of tuning the values of four parameters associated with the computation of residue depth and the prediction of binding cavities. The computed depths, SASA and binding cavity predictions are displayed in 2D plots and mapped onto 3D representations of the protein structure using Jmol. Links are provided to download the outputs. Our server is useful for all structural analysis based on residue depth and SASA, such as guiding site-directed mutagenesis experiments and small molecule docking exercises, in the context of protein functional annotation and drug discovery. © 2011 The Author(s).",
                "authors": [
                    {
                        "name": "Tan K.P."
                    },
                    {
                        "name": "Varadarajan R."
                    },
                    {
                        "name": "Madhusudhan M.S."
                    }
                ],
                "citationCount": 42,
                "date": "2011-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "DEPTH: A web server to compute depth and predict small-molecule binding cavities in proteins"
            },
            "pmid": "21576233"
        },
        {
            "metadata": {
                "abstract": "Residue depth accurately measures burial and parameterizes local protein environment. Depth is the distance of any atom/residue to the closest bulk water. We consider the non-bulk waters to occupy cavities, whose volumes are determined using a Voronoi procedure. Our estimation of cavity sizes is statistically superior to estimates made by CASTp and VOIDOO, and on par with McVol over a data set of 40 cavities. Our calculated cavity volumes correlated best with the experimentally determined destabilization of 34 mutants from five proteins. Some of the cavities identified are capable of binding small molecule ligands. In this study, we have enhanced our depth-based predictions of binding sites by including evolutionary information. We have demonstrated that on a database (LigASite) of ∼200 proteins, we perform on par with ConCavity and better than MetaPocket 2.0. Our predictions, while less sensitive, are more specific and precise. Finally, we use depth (and other features) to predict pKas of GLU, ASP, LYS and HIS residues. Our results produce an average error of just <1 pH unit over 60 predictions. Our simple empirical method is statistically on par with two and superior to three other methods while inferior to only one. The DEPTH server (http://mspc.bii.a-star.edu.sg/depth/) is an ideal tool for rapid yet accurate structural analyses of protein structures.",
                "authors": [
                    {
                        "name": "Tan K.P."
                    },
                    {
                        "name": "Nguyen T.B."
                    },
                    {
                        "name": "Patel S."
                    },
                    {
                        "name": "Varadarajan R."
                    },
                    {
                        "name": "Madhusudhan M.S."
                    }
                ],
                "citationCount": 64,
                "date": "2013-01-01T00:00:00Z",
                "journal": "Nucleic acids research",
                "title": "Depth: a web server to compute depth, cavity sizes, detect potential small-molecule ligand-binding cavities and predict the pKa of ionizable residues in proteins."
            },
            "pmid": "23766289"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Protein structural motifs and surfaces",
            "uri": "http://edamontology.org/topic_0166"
        },
        {
            "term": "Protein folding, stability and design",
            "uri": "http://edamontology.org/topic_0130"
        },
        {
            "term": "Protein binding sites",
            "uri": "http://edamontology.org/topic_3534"
        },
        {
            "term": "Protein modifications",
            "uri": "http://edamontology.org/topic_0601"
        }
    ],
    "validated": 1
}