{
    "accessibility": "Open access",
    "additionDate": "2019-08-09T13:11:05Z",
    "biotoolsCURIE": "biotools:Fetal_XCMR",
    "biotoolsID": "Fetal_XCMR",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "christopher.macgowan@sickkids.ca",
            "name": "Christopher K. Macgowan",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "fetal.xcmr@gmail.com",
            "name": "Chris Roy",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Numerical phantom for fetal cardiovascular magnetic resonance imaging.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/cwroy/Fetal-XCMR/blob/master/README.txt"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "https://github.com/cwroy/Fetal-XCMR/releases"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "homepage": "https://github.com/cwroy/Fetal-XCMR/",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2020-06-16T10:55:25Z",
    "license": "Unlicense",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/cwroy/Fetal-XCMR/issues"
        }
    ],
    "maturity": "Mature",
    "name": "Fetal XCMR",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "hans",
    "publication": [
        {
            "doi": "10.1186/S12968-019-0539-2",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Validating new techniques for fetal cardiovascular magnetic resonance (CMR) is challenging due to random fetal movement that precludes repeat measurements. Consequently, fetal CMR development has been largely performed using physical phantoms or postnatal volunteers. In this work, we present an open-source simulation designed to aid in the development and validation of new approaches for fetal CMR. Our approach, fetal extended Cardiac-Torso cardiovascular magnetic resonance imaging (Fetal XCMR), builds on established methods for simulating CMR acquisitions but is tailored toward the dynamic physiology of the fetal heart and body. We present comparisons between the Fetal XCMR phantom and data acquired in utero, resulting in image quality, anatomy, tissue signals and contrast. Methods: Existing extended Cardiac-Torso models are modified to create maternal and fetal anatomy, combined according to simulated motion, mapped to CMR contrast, and converted to CMR data. To provide a comparison between the proposed simulation and experimental fetal CMR images acquired in utero, images from a typical scan of a pregnant woman are included and simulated acquisitions were generated using matching CMR parameters, motion and noise levels. Three reconstruction (static, real-time, and CINE), and two motion estimation methods (translational motion, fetal heart rate) from data acquired in transverse, sagittal, coronal, and short-axis planes of the fetal heart were performed to compare to in utero acquisitions and demonstrate feasibility of the proposed simulation framework. Results: Overall, CMR contrast, morphologies, and relative proportions of the maternal and fetal anatomy are well represented by the Fetal XCMR images when comparing the simulation to static images acquired in utero. Additionally, visualization of maternal respiratory and fetal cardiac motion is comparable between Fetal XCMR and in utero real-time images. Finally, high quality CINE image reconstructions provide excellent delineation of fetal cardiac anatomy and temporal dynamics for both data types. Conclusion: The fetal CMR phantom provides a new method for evaluating fetal CMR acquisition and reconstruction methods by simulating the underlying anatomy and physiology. As the field of fetal CMR continues to grow, new methods will become available and require careful validation. The fetal CMR phantom is therefore a powerful and convenient tool in the continued development of fetal cardiac imaging.",
                "authors": [
                    {
                        "name": "Roy C.W."
                    },
                    {
                        "name": "Marini D."
                    },
                    {
                        "name": "Segars W.P."
                    },
                    {
                        "name": "Seed M."
                    },
                    {
                        "name": "Macgowan C.K."
                    }
                ],
                "citationCount": 2,
                "date": "2019-05-23T00:00:00Z",
                "journal": "Journal of Cardiovascular Magnetic Resonance",
                "title": "Fetal XCMR: A numerical phantom for fetal cardiovascular magnetic resonance imaging"
            },
            "pmcid": "PMC6532268",
            "pmid": "31118056",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        },
        {
            "term": "NMR",
            "uri": "http://edamontology.org/topic_0593"
        },
        {
            "term": "Anatomy",
            "uri": "http://edamontology.org/topic_3067"
        }
    ]
}