{
    "accessibility": "Open access",
    "additionDate": "2019-07-30T08:54:38Z",
    "biotoolsCURIE": "biotools:mineXpert",
    "biotoolsID": "mineXpert",
    "cost": "Free of charge",
    "description": "mineXpert is a graphical user interface software piece that allows the user to:\n- load mass spectrometry data files [ (x,y) text files or mzML standard format ] \n- visualize the TIC chromatogram and the intensity=(mz, dt) colormap in case of ion mobility mass spectrometry\n- integrate the mass data in many different ways and display them, effectively permitting the exploration of the mass data in their full depth\n- many other features",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://msxpertsuite.org/wiki/pmwiki.php/Main/UserManual"
        }
    ],
    "download": [
        {
            "type": "Downloads page",
            "url": "https://sourcesup.renater.fr/frs/?group_id=3534"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "elixirNode": [
        "France"
    ],
    "elixirPlatform": [
        "Tools"
    ],
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Mass spectrometry data",
                        "uri": "http://edamontology.org/data_2536"
                    }
                }
            ],
            "operation": [
                {
                    "term": "Chromatogram visualisation",
                    "uri": "http://edamontology.org/operation_3203"
                },
                {
                    "term": "Mass spectrum visualisation",
                    "uri": "http://edamontology.org/operation_3694"
                },
                {
                    "term": "Isotopic distributions calculation",
                    "uri": "http://edamontology.org/operation_3632"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Plot",
                        "uri": "http://edamontology.org/data_2884"
                    }
                }
            ]
        }
    ],
    "homepage": "http://msxpertsuite.org",
    "lastUpdate": "2020-06-16T10:55:24Z",
    "license": "GPL-3.0",
    "link": [
        {
            "note": "Main software site",
            "type": [
                "Other"
            ],
            "url": "http://msxpertsuite.org"
        },
        {
            "note": "Publication at the American Chemical Society web site",
            "type": [
                "Other"
            ],
            "url": "https://pubs.acs.org/doi/10.1021/acs.jproteome.9b00099"
        },
        {
            "note": "Pubmed record page",
            "type": [
                "Other"
            ],
            "url": "https://www.ncbi.nlm.nih.gov/pubmed/30950277"
        }
    ],
    "maturity": "Mature",
    "name": "mineXpert",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "otherID": [
        {
            "type": "doi",
            "value": "doi:10.1021/acs.jproteome.9b00099"
        }
    ],
    "owner": "rusconi",
    "publication": [
        {
            "doi": "10.1021/acs.jproteome.9b00099",
            "metadata": {
                "abstract": "© Copyright 2019 American Chemical Society. Biological mass spectrometry mainly comprises three fields of endeavor, namely, proteomics, metabolomics, and structural biology. In each of these specialties, the mass spectrometrist needs to access MS 1 mass spectral data, although not necessarily on the same basis. For example, the bottom-up proteomics scientist will occasionally access MS 1 data to perform data inspection, quality assessments, and quantitation measurements, whereas top-down proteomics, structural biology, or metabolomics scientists will actually spend most of their time mining profile-mode MS 1 data. Furthermore, the advent of ion mobility-mass spectrometry imposes new manners of mass spectral data visualization. An open-source MS 1 -only mass data visualization software for the desktop was developed to allow scientists to visualize conventional and drift time mass data. Various mass data integrations are possible, allowing a thorough mass spectral data scrutiny. Isotopic cluster calculations are easily carried over from the chemical formula up to the display of the mass spectrum. Deconvolution of mass peaks can be achieved with a simple mouse drag. Flexible reporting of data inspection events and of mining discoveries is provided. Very large sparse data sets can be sliced into smaller chunks replicating the original data without data loss. Task automation is achieved in a JavaScript environment. This project allows users of mass spectrometry facilities to inspect and mine their MS 1 mass data outside of these facilities without having to resort to the closed-source vendor software shipped with the instruments. mineXpert requires no proprietary software whatsoever once the mass spectrometry data have been converted to mzML. The reference implementation is version 5.8.2 or greater. Reference material, a detailed user manual, and video tutorials are available at http://www.msxpertsuite.org.",
                "authors": [
                    {
                        "name": "Rusconi F."
                    }
                ],
                "date": "2019-05-03T00:00:00Z",
                "journal": "Journal of Proteome Research",
                "title": "MineXpert: Biological Mass Spectrometry Data Visualization and Mining with Full JavaScript Ability"
            },
            "pmid": "30950277",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Script",
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Biochemistry",
            "uri": "http://edamontology.org/topic_3292"
        },
        {
            "term": "Analytical chemistry",
            "uri": "http://edamontology.org/topic_3370"
        },
        {
            "term": "Computational chemistry",
            "uri": "http://edamontology.org/topic_3332"
        }
    ]
}