{
    "additionDate": "2021-03-19T08:25:56Z",
    "biotoolsCURIE": "biotools:targetdbpplus",
    "biotoolsID": "targetdbpplus",
    "confidence_flag": "tool",
    "description": "Enhancing the Performance of Identifying DNA-Binding Proteins via Weighted Convolutional Features.\n\nA DNA-binding protein identification method via using sequence-driven features.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "DNA-binding protein prediction",
                    "uri": "http://edamontology.org/operation_3900"
                },
                {
                    "term": "DNA binding site prediction",
                    "uri": "http://edamontology.org/operation_3903"
                },
                {
                    "term": "Protein secondary structure prediction",
                    "uri": "http://edamontology.org/operation_0267"
                }
            ]
        }
    ],
    "homepage": "http://csbio.njust.edu.cn/bioinf/targetdbpplus/",
    "lastUpdate": "2021-04-11T10:55:20Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/jun-csbio/TargetDBPplus"
        }
    ],
    "name": "TargetDBP+",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1021/ACS.JCIM.0C00735",
            "metadata": {
                "abstract": "© 2021 American Chemical Society.Protein-DNA interactions exist ubiquitously and play important roles in the life cycles of living cells. The accurate identification of DNA-binding proteins (DBPs) is one of the key steps to understand the mechanisms of protein-DNA interactions. Although many DBP identification methods have been proposed, the current performance is still unsatisfactory. In this study, a new method, called TargetDBP+, is developed to further enhance the performance of identifying DBPs. In TargetDBP+, five convolutional features are first extracted from five feature sources, i.e., amino acid one-hot matrix (AAOHM), position-specific scoring matrix (PSSM), predicted secondary structure probability matrix (PSSPM), predicted solvent accessibility probability matrix (PSAPM), and predicted probabilities of DNA-binding sites (PPDBSs); second, the five features are weightedly and serially combined using the weights of all of the elements learned by the differential evolution algorithm; and finally, the DBP identification model of TargetDBP+ is trained using the support vector machine (SVM) algorithm. To evaluate the developed TargetDBP+ and compare it with other existing methods, a new gold-standard benchmark data set, called UniSwiss, is constructed, which consists of 4881 DBPs and 4881 non-DBPs extracted from the UniprotKB/Swiss-Prot database. Experimental results demonstrate that TargetDBP+ can obtain an accuracy of 85.83% and precision of 88.45% covering 82.41% of all DBP data on the independent validation subset of UniSwiss, with the MCC value (0.718) being significantly higher than those of other state-of-the-art control methods. The web server of TargetDBP+ is accessible at http://csbio.njust.edu.cn/bioinf/targetdbpplus/; the UniSwiss data set and stand-alone program of TargetDBP+ are accessible at https://github.com/jun-csbio/TargetDBPplus.",
                "authors": [
                    {
                        "name": "Hu J."
                    },
                    {
                        "name": "Rao L."
                    },
                    {
                        "name": "Zhu Y.-H."
                    },
                    {
                        "name": "Zhang G.-J."
                    },
                    {
                        "name": "Yu D.-J."
                    }
                ],
                "citationCount": 1,
                "date": "2021-01-25T00:00:00Z",
                "journal": "Journal of Chemical Information and Modeling",
                "title": "TargetDBP+: Enhancing the Performance of Identifying DNA-Binding Proteins via Weighted Convolutional Features"
            },
            "pmid": "33410688"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "DNA binding sites",
            "uri": "http://edamontology.org/topic_3125"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        },
        {
            "term": "ChIP-on-chip",
            "uri": "http://edamontology.org/topic_3179"
        }
    ]
}