{"credit":[{"email":"jinzhang@engr.uconn.edu","name":"Jin Zhang","typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://www.engr.uconn.edu/~jiz08001/"}],"documentation":[{"type":"TRAINING_MATERIAL","url":"http://www.engr.uconn.edu/~jiz08001/software/HapReads/Demo/"}],"function":[{"operation":[{"term":"Haplotype mapping","uri":"http://edamontology.org/operation_0487"},{"term":"Phylogenetic tree analysis","uri":"http://edamontology.org/operation_0324"}]}],"labels":{"operatingSystem":["Linux","Mac"],"toolType":["Command-line tool"],"topic":[{"term":"Phylogeny","uri":"http://edamontology.org/topic_0084"},{"term":"Phylogenetics","uri":"http://edamontology.org/topic_3293"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/hapreads-infering-haplotypes-with-shot-reads.html"}],"publication":[{"abstract":"High-throughput sequencing is currently a major transforming technology in biology. In this paper, we study a population genomics problem motivated by the newly available short reads data from high-throughput sequencing. In this problem, we are given short reads collected from individuals in a population. The objective is to infer haplotypes with the given reads. We first formulate the computational problem of haplotype inference with short reads. Based on a simple probabilistic model on short reads, we present a new approach of inferring haplotypes directly from given reads (i.e. without first calling genotypes). Our method is finding the most likely haplotypes whose local genealogical history can be approximately modeled as a perfect phylogeny. We show that the optimal haplotypes under this objective can be found for many data using integer linear programming for modest sized data when there is no recombination. We then develop a related heuristic method which can work with larger data, and also allows recombination. Simulation shows that the performance of our method is competitive against alternative approaches. © 2011 World Scientific Publishing Co. Pte. Ltd.","authors":["Zhang J.","Wu Y."],"cit_count":0,"journal":"Pacific Symposium on Biocomputing 2011, PSB 2011","pmid":"21121056","title":"Haplotype inference from short sequence reads using a population genealogical history model","year":"2011-12-01"}],"summary":{"biotoolsCURIE":"biotools:hapreads","biotoolsID":"hapreads","description":"A ILP program for infering haplotypes with shot reads, which finds the most likely haplotypes by approximating local genealogical history as a perfect phylogeny.","homepage":"http://www.engr.uconn.edu/~jiz08001/hapreads.html","name":"HapReads"}}