{
    "additionDate": "2017-03-27T07:20:20Z",
    "biotoolsCURIE": "biotools:3dnalandscapes",
    "biotoolsID": "3dnalandscapes",
    "description": "Database for exploring the conformational features of DNA. It enables searches of conformational information across multiple structures. The database contains a wide variety of structural parameters and molecular images, computed with the 3DNA software package and known to be useful for characterizing and understanding the sequence-dependent spatial arrangements of the DNA sugar-phosphate backbone, sugar-base side groups, base pairs, base-pair steps, groove structure, etc.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                },
                {
                    "term": "Protein structural motif recognition",
                    "uri": "http://edamontology.org/operation_0245"
                },
                {
                    "term": "Structure database search",
                    "uri": "http://edamontology.org/operation_0339"
                },
                {
                    "term": "Structural similarity search",
                    "uri": "http://edamontology.org/operation_0360"
                },
                {
                    "term": "DNA structure prediction",
                    "uri": "http://edamontology.org/operation_2442"
                }
            ]
        }
    ],
    "homepage": "http://dcp.rutgers.edu",
    "homepage_status": 1,
    "lastUpdate": "2018-12-10T12:58:40Z",
    "name": "3DNALandscapes",
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "3DNALandscapes, located at: http://3DNAscapes.rutgers.edu, is a new database for exploring the conformational features of DNA. In contrast to most structural databases, which archive the Cartesian coordinates and/or derived parameters and images for individual structures, 3DNALandscapes enables searches of conformational information across multiple structures. The database contains a wide variety of structural parameters and molecular images, computed with the 3DNA software package and known to be useful for characterizing and understanding the sequence-dependent spatial arrangements of the DNA sugar-phosphate backbone, sugar-base side groups, base pairs, base-pair steps, groove structure, etc. The data comprise all DNA-containing structures-both free and bound to proteins, drugs and other ligands-currently available in the Protein Data Bank. The web interface allows the user to link, report, plot and analyze this information from numerous perspectives and thereby gain insight into DNA conformation, deformability and interactions in different sequence and structural contexts. The data accumulated from known, well-resolved DNA structures can serve as useful benchmarks for the analysis and simulation of new structures. The collective data can also help to understand how DNA deforms in response to proteins and other molecules and undergoes conformational rearrangements. © The Author(s) 2009. Published by Oxford University Press.",
                "authors": [
                    {
                        "name": "Zheng G."
                    },
                    {
                        "name": "Colasanti A.V."
                    },
                    {
                        "name": "Lu X."
                    },
                    {
                        "name": "Olson W.K."
                    }
                ],
                "citationCount": 10,
                "date": "2009-11-10T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "3DNALandscapes: A database for exploring the conformational features of DNA"
            },
            "pmid": "19906722"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Structure analysis",
            "uri": "http://edamontology.org/topic_0081"
        },
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Structure prediction",
            "uri": "http://edamontology.org/topic_0082"
        },
        {
            "term": "Protein structural motifs and surfaces",
            "uri": "http://edamontology.org/topic_0166"
        }
    ],
    "validated": 1
}