
{
    "credit": [
        {
            "name": "imr.no",
            "typeEntity": "Institute",
            "typeRoles": [
                "Provider"
            ]
        },
        {
            "email": "ketil@malde.org",
            "name": "Ketil Malde",
            "typeRoles": [
                "Developer"
            ]
        },
        {
            "email": "ketil@malde.org",
            "name": "Ketil Malde",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://blog.malde.org/posts/transitive-alignments.html"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://malde.org/~ketil/biohaskell/transalign/"
        }
    ],
    "function": [
        {
            "note": "More sensitive pairwise sequence alignment",
            "operation": [
                {
                    "term": "Sequence alignment",
                    "uri": "http://edamontology.org/operation_0292"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Haskell"
        ],
        "operatingSystem": [
            "Linux",
            "Mac"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Molecular biology",
                "uri": "http://edamontology.org/topic_3047"
            }
        ]
    },
    "publication": [
        {
            "abstract": "Sequence alignment is an important bioinformatics tool for identifying homology, but searching against the full set of available sequences is likely to result in many hits to poorly annotated sequences providing very little information. Consequently, we often want alignments against a specific subset of sequences: for instance, we are looking for sequences from a particular species, sequences that have known 3d-structures, sequences that have a reliable (curated) function annotation, and so on. Although such subset databases are readily available, they only represent a small fraction of all sequences. Thus, the likelihood of finding close homologs for query sequences is smaller, and the alignments will in general have lower scores. This makes it difficult to distinguish hits to homologous sequences from random hits to unrelated sequences. Here, we propose a method that addresses this problem by first aligning query sequences against a large database representing the corpus of known sequences, and then constructing indirect (or transitive) alignments by combining the results with alignments from the large database against the desired target database. We compare the results to direct pairwise alignments, and show that our method gives us higher sensitivity alignments against the target database. © 2013 Malde, Furmanek.",
            "authors": [
                "Malde K.",
                "Furmanek T."
            ],
            "cit_count": 1,
            "doi": "10.1371/journal.pone.0054422",
            "journal": "PLoS ONE",
            "title": "Increasing Sequence Search Sensitivity with Transitive Alignments",
            "type": "Primary",
            "year": "2013-02-14"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:transalign",
        "biotoolsID": "transalign",
        "description": "Calculate more accurate pairwise alignments by making use of a (large) database of uncurated sequences to aid matching against a (small) database of curated target sequences.",
        "homepage": "http://malde.org/~ketil/biohaskell/transalign/",
        "name": "transalign",
        "version": [
            "0.1"
        ]
    }
}