{
    "additionDate": "2017-01-13T13:16:51Z",
    "biotoolsCURIE": "biotools:tasr",
    "biotoolsID": "tasr",
    "credit": [
        {
            "email": "rwarren@bcgsc.ca",
            "name": "Rene Warren",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Exome capture of short read data to identify the presence of variants",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence assembly",
                    "uri": "http://edamontology.org/operation_0310"
                }
            ]
        }
    ],
    "homepage": "http://www.bcgsc.ca/platform/bioinfo/software/tasr",
    "language": [
        "Perl"
    ],
    "lastUpdate": "2018-12-10T12:58:47Z",
    "license": "GPL-2.0",
    "maturity": "Mature",
    "name": "TASR",
    "owner": "seqwiki_import",
    "publication": [
        {
            "metadata": {
                "abstract": "As next-generation sequence (NGS) production continues to increase, analysis is becoming a significant bottleneck. However, in situations where information is required only for specific sequence variants, it is not necessary to assemble or align whole genome data sets in their entirety. Rather, NGS data sets can be mined for the presence of sequence variants of interest by localized assembly, which is a faster, easier, and more accurate approach. We present TASR, a streamlined assembler that interrogates very large NGS data sets for the presence of specific variants by only considering reads within the sequence space of input target sequences provided by the user. The NGS data set is searched for reads with an exact match to all possible short words within the target sequence, and these reads are then assembled stringently to generate a consensus of the target and flanking sequence. Typically, variants of a particular locus are provided as different target sequences, and the presence of the variant in the data set being interrogated is revealed by a successful assembly outcome. However, TASR can also be used to find unknown sequences that flank a given target. We demonstrate that TASR has utility in finding or confirming genomic mutations, polymorphisms, fusions and integration events. Targeted assembly is a powerful method for interrogating large data sets for the presence of sequence variants of interest. TASR is a fast, flexible and easy to use tool for targeted assembly. © 2011 Warren, Holt.",
                "authors": [
                    {
                        "name": "Holt R.A."
                    },
                    {
                        "name": "Warren R.L."
                    }
                ],
                "citationCount": 29,
                "date": "2011-05-17T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "Targeted assembly of short sequence reads"
            },
            "pmid": "21589938"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Exome sequencing",
            "uri": "http://edamontology.org/topic_3676"
        }
    ],
    "validated": 1
}
