{
    "accessibility": "Open access (with restrictions)",
    "additionDate": "2023-08-07T19:13:57.435306Z",
    "biotoolsCURIE": "biotools:seqapass",
    "biotoolsID": "seqapass",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "Vliet.Sara@epa.gov",
            "name": "Sara M. F. Vliet",
            "orcidid": "https://orcid.org/0000-0002-7429-0771"
        }
    ],
    "description": "A web-based tool for addressing the challenges of cross-species extrapolation of chemical toxicity.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://www.epa.gov/chemical-research/seqapass-user-guide"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "GI number (protein)",
                        "uri": "http://edamontology.org/data_2327"
                    }
                },
                {
                    "data": {
                        "term": "NCBI taxonomy ID",
                        "uri": "http://edamontology.org/data_1179"
                    }
                }
            ],
            "operation": [
                {
                    "term": "Prediction and recognition",
                    "uri": "http://edamontology.org/operation_2423"
                },
                {
                    "term": "Sequence alignment",
                    "uri": "http://edamontology.org/operation_0292"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Database search results",
                        "uri": "http://edamontology.org/data_2080"
                    }
                },
                {
                    "data": {
                        "term": "Report",
                        "uri": "http://edamontology.org/data_2048"
                    }
                }
            ]
        }
    ],
    "homepage": "https://seqapass.epa.gov/seqapass",
    "lastUpdate": "2023-08-07T19:13:57.438037Z",
    "name": "SeqAPASS",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1002/ETC.5591",
            "metadata": {
                "abstract": "New approach methodologies (NAMs) are being developed to reduce and replace vertebrate animal testing in support of ecotoxicology and risk assessment. The US Environmental Protection Agency's Sequence Alignment to Predict Across Species Susceptibility (SeqAPASS) bioinformatic tool was used to evaluate amino acid sequence conservation of the type 3 iodothyronine deiodinase (DIO3) enzyme across species to demonstrate NAM applications for understanding effects of chemical interactions with a specific protein target. Existing literature was used to identify critical amino acids for thyroid hormone binding and interaction with a reducing cofactor. The SeqAPASS tool identifies whether known critical amino acids involved in ligand binding are exact, partial, or not matches across species compared with a template species based on molecular weight and side chain classification. This evaluation guided the design of variant proteins representing critical amino acid substitutions found in various species. Site-directed mutagenesis of the wild-type (WT) human DIO3 gene sequence was used to create six variant proteins expressed in cell culture, which were then tested in vitro for chemical inhibition. Significant differences in in vitro median inhibitory concentration results were observed among variants for potential competitive inhibitors. A molecular model representing the WT human DIO3 was constructed using Molecular Operating Environment (MOE) software and mutated in silico to create the six variants. The MOE Site Finder tool identified the proposed catalytic and cofactor sites and potential alternative binding sites. Virtual docking did not provide affinity scores with sufficient resolution to rank the potency of the chemical inhibitors. Chemical characteristics, function and location of substituted amino acids, and complexities of the protein target are important considerations in developing NAMs to evaluate chemical susceptibility across species. Environ Toxicol Chem 2023;42:1032–1048. © 2023 University of Wisconsin-Madison. Environmental Toxicology and Chemistry published by Wiley Periodicals LLC on behalf of SETAC. This article has been contributed to by U.S. Government employees and their work is in the public domain in the USA.",
                "authors": [
                    {
                        "name": "Goldsmith M.R."
                    },
                    {
                        "name": "LaLone C.A."
                    },
                    {
                        "name": "Mattingly K.Z."
                    },
                    {
                        "name": "Mayasich S.A."
                    }
                ],
                "date": "2023-05-01T00:00:00Z",
                "journal": "Environmental Toxicology and Chemistry",
                "title": "Combining In Vitro and In Silico New Approach Methods to Investigate Type 3 Iodothyronine Deiodinase Chemical Inhibition Across Species"
            },
            "pmid": "36825751"
        },
        {
            "doi": "10.3791/63970",
            "metadata": {
                "abstract": "The US Environmental Protection Agency Sequence Alignment to Predict Across Species Susceptibility (SeqAPASS) tool is a fast, freely available, online screening application that allows researchers and regulators to extrapolate toxicity information across species. For biological targets in model systems such as human cells, mice, rats, and zebrafish, toxicity data are available for a variety of chemicals. Through the evaluation of protein target conservation, this tool can be used to extrapolate data generated from such model systems to thousands of other species lacking toxicity data, yielding predictions of relative intrinsic chemical susceptibility. The latest releases of the tool (versions 2.0-6.1) have incorporated new features that allow for the rapid synthesis, interpretation, and use of the data for publication plus presentation-quality graphics. Among these features are customizable data visualizations and a comprehensive summary report designed to summarize SeqAPASS data for ease of interpretation. This paper describes the protocol to guide users through submitting jobs, navigating the various levels of protein sequence comparisons, and interpreting and displaying the resulting data. New features of SeqAPASS v2.0-6.0 are highlighted. Furthermore, two use-cases focused on transthyretin and opioid receptor protein conservation using this tool are described. Finally, SeqAPASS' strengths and limitations are discussed to define the domain of applicability for the tool and highlight different applications for cross-species extrapolation.",
                "authors": [
                    {
                        "name": "Blatz D."
                    },
                    {
                        "name": "Hazemi M."
                    },
                    {
                        "name": "Jensen M."
                    },
                    {
                        "name": "Lalone C.A."
                    },
                    {
                        "name": "Mayasich S."
                    },
                    {
                        "name": "Simmons C."
                    },
                    {
                        "name": "Transue T.R."
                    },
                    {
                        "name": "Vliet S.M.F."
                    },
                    {
                        "name": "Wilkinson A."
                    }
                ],
                "date": "2023-02-01T00:00:00Z",
                "journal": "Journal of Visualized Experiments",
                "title": "Demonstration of the Sequence Alignment to Predict Across Species Susceptibility Tool for Rapid Assessment of Protein Conservation"
            },
            "pmid": "36847398"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Chemistry",
            "uri": "http://edamontology.org/topic_3314"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Molecular modelling",
            "uri": "http://edamontology.org/topic_2275"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Toxicology",
            "uri": "http://edamontology.org/topic_2840"
        }
    ]
}
