{
    "additionDate": "2021-09-27T07:20:38.186718Z",
    "biotoolsCURIE": "biotools:ibddb",
    "biotoolsID": "ibddb",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "mandeep.kaur@wits.ac.za",
            "name": "Mandeep Kaur",
            "orcidid": "https://orcid.org/0000-0002-9757-4048",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Inflammatory Bowel Disease (IBD) Database (IBDDB) is a manually curated and text-mining-enhanced database of genes involved in inflammatory bowel disease.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Named-entity and concept recognition",
                    "uri": "http://edamontology.org/operation_3280"
                },
                {
                    "term": "Parsing",
                    "uri": "http://edamontology.org/operation_1812"
                }
            ]
        }
    ],
    "homepage": "https://www.cbrc.kaust.edu.sa/ibd/",
    "lastUpdate": "2021-09-27T07:20:38.189328Z",
    "name": "IBDDB",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/DATABASE/BAAB022",
            "metadata": {
                "abstract": "© 2021 The Author(s). Published by Oxford University Press.To date, research on inflammatory bowel disease (IBD, encompassing Crohn's disease and ulcerative colitis), a chronic complex disorder, has generated a large amount of data scattered across published literature (1 06 333) listed in PubMed on 14 October 2020, and no dedicated database currently exists that catalogues information on genes associated with IBD. We aimed to manually curate 289 genes that are experimentally validated to be linked with IBD and its known phenotypes. Furthermore, we have developed an integrated platform providing information about different aspects of these genes by incorporating several resources and an extensive text-mined knowledgebase. The curated IBD database (IBDDB) allows the selective display of collated 34 subject-specific concepts (listed as columns) exportable through a user-friendly IBDDB portal. The information embedded in concepts was acquired via text-mining of PubMed (manually cleaned and curated), accompanied by data-mining from varied resources. The user can also explore different biomedical entities and their co-occurrence with other entities (about one million) from 11 curated dictionaries in the indexed PubMed records. This functionality permits the user to generate and cross-examine a new hypothesis that is otherwise not easy to comprehend by just reading the published abstracts and papers. Users can download required information using various file formats and can display information in the form of networks. To our knowledge, no curated database of IBD-related genes is available so far. IBDDB is free for academic users and can be accessed at https://www.cbrc.kaust.edu.sa/ibd/.",
                "authors": [
                    {
                        "name": "Gojobori T."
                    },
                    {
                        "name": "Kaur M."
                    },
                    {
                        "name": "Khan F."
                    },
                    {
                        "name": "Radovanovic A."
                    }
                ],
                "date": "2021-01-01T00:00:00Z",
                "journal": "Database",
                "title": "IBDDB: A manually curated and text-mining-enhanced database of genes involved in inflammatory bowel disease"
            },
            "pmcid": "PMC8086236",
            "pmid": "33929018",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Bioinformatics portal"
    ],
    "topic": [
        {
            "term": "Drug metabolism",
            "uri": "http://edamontology.org/topic_3375"
        },
        {
            "term": "Endocrinology and metabolism",
            "uri": "http://edamontology.org/topic_3407"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
