{
    "additionDate": "2020-01-09T18:24:33Z",
    "biotoolsCURIE": "biotools:BEFORE",
    "biotoolsID": "BEFORE",
    "confidence_flag": "low",
    "credit": [
        {
            "email": "Nancy.Baxter@unityhealth.to",
            "name": "Nancy N. Baxter",
            "orcidid": "https://orcid.org/0000-0003-4793-4620",
            "typeEntity": "Person"
        }
    ],
    "description": "development and alpha testing of a fertility tool for premenopausal breast cancer patients.\n\nBACKGROUND:Premenopausal breast cancer patients are at risk of treatment-related infertility. Many patients do not receive sufficient fertility information before treatment. As such, our team developed and alpha tested the Begin Exploring Fertility Options, Risks, and Expectations decision aid (BEFORE DA). METHODS:The BEFORE DA development process was guided by the International Patient Decision Aids Standards and the Ottawa Decision Support Framework. Our team used integrated knowledge translation by collaborating with multiple stakeholders throughout the development process including breast cancer survivors, multi-disciplinary health care providers (HCPs), advocates, and cancer organization representatives.\n\n||| HOMEPAGE MISSING!.\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'fertilityaid', 'fertility', 'fertility fertility', 'premenopausal'",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Splitting",
                    "uri": "http://edamontology.org/operation_3359"
                }
            ]
        }
    ],
    "homepage": "https://www.ncbi.nlm.nih.gov/pubmed/?term=31660965",
    "lastUpdate": "2020-01-09T18:24:33Z",
    "name": "BEFORE",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12911-019-0912-Y",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Premenopausal breast cancer patients are at risk of treatment-related infertility. Many patients do not receive sufficient fertility information before treatment. As such, our team developed and alpha tested the Begin Exploring Fertility Options, Risks, and Expectations decision aid (BEFORE DA). Methods: The BEFORE DA development process was guided by the International Patient Decision Aids Standards and the Ottawa Decision Support Framework. Our team used integrated knowledge translation by collaborating with multiple stakeholders throughout the development process including breast cancer survivors, multi-disciplinary health care providers (HCPs), advocates, and cancer organization representatives. Based on previously conducted literature reviews and a needs assessment by our team - we developed a paper prototype. The paper prototype was finalized at an engagement meeting with stakeholders and created into a graphically designed paper and mirrored online decision aid. Alpha testing was conducted with new and previously engaged stakeholders through a questionnaire, telephone interviews, or focus group. Iterative reviews followed each step in the development process to ensure a wide range of stakeholder input. Results: Our team developed an 18-page paper prototype containing information deemed valuable by stakeholders for fertility decision-making. The engagement meeting brought together 28 stakeholders to finalize the prototype. Alpha testing of the paper and online BEFORE DA occurred with 17 participants. Participants found the BEFORE DA usable, acceptable, and most provided enthusiastic support for its use with premenopausal breast cancer patients facing a fertility decision. Participants also identified areas for improvement including clarifying content/messages and modifying the design/photos. The final BEFORE DA is a 32-page paper and mirrored online decision aid (https://fertilityaid.rethinkbreastcancer.com). The BEFORE DA includes information on fertility, fertility options before/after treatment, values clarification, question list, next steps, glossary and reference list, and tailored information on the cost of fertility preservation and additional resources by geographic location. Conclusion: The BEFORE DA, designed in collaboration with stakeholders, is a new tool for premenopausal breast cancer patients and HCPs to assist with fertility discussions and decision-making. The BEFORE DA helps to fill the information gap as it is a tool that HCPs can refer patients to for supplementary information surrounding fertility.",
                "authors": [
                    {
                        "name": "Speller B."
                    },
                    {
                        "name": "Metcalfe K."
                    },
                    {
                        "name": "Kennedy E.D."
                    },
                    {
                        "name": "Facey M."
                    },
                    {
                        "name": "Greenblatt E."
                    },
                    {
                        "name": "Scheer A.S."
                    },
                    {
                        "name": "Warner E."
                    },
                    {
                        "name": "Joy A.A."
                    },
                    {
                        "name": "Wright F.C."
                    },
                    {
                        "name": "Baxter N.N."
                    }
                ],
                "date": "2019-10-28T00:00:00Z",
                "journal": "BMC Medical Informatics and Decision Making",
                "title": "The \"Begin Exploring Fertility Options, Risks and Expectations\" (BEFORE) decision aid: Development and alpha testing of a fertility tool for premenopausal breast cancer patients"
            },
            "pmcid": "PMC6819618",
            "pmid": "31660965"
        }
    ],
    "topic": [
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Reproductive health",
            "uri": "http://edamontology.org/topic_3420"
        },
        {
            "term": "Surgery",
            "uri": "http://edamontology.org/topic_3421"
        },
        {
            "term": "Literature and language",
            "uri": "http://edamontology.org/topic_3068"
        }
    ]
}