{
    "additionDate": "2021-01-18T11:48:14Z",
    "biotoolsCURIE": "biotools:tcrd",
    "biotoolsID": "tcrd",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "toprea@salud.unm.edu",
            "name": "Tudor I Oprea",
            "typeEntity": "Person"
        }
    ],
    "description": "Target Central Resource Database mining the human proteome for disease biology.\n\nThis page contains information related to the implementation and current status of the Target Central Resource Database (TCRD) at UNM.\n\nTCRD is the central resource behind the Illuminating the Druggable Genome Knowledge Management Center (IDG-KMC). TCRD contains information about human targets, with special emphasis on four families of targets that are central to the NIH IDG initiative: GPCRs, kinases, ion channels and nuclear receptors. Olfactory GPCRs (oGPCRs) are treated as a separate family. A key aim of the KMC is to classify the development/druggability level of targets. We currently categorize targets into four development/druggability levels (TDLs) defined as follows:.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                },
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "http://juniper.health.unm.edu/tcrd/",
    "lastUpdate": "2021-02-26T17:49:48Z",
    "name": "TCRD",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1093/NAR/GKAA993",
            "metadata": {
                "abstract": "© 2021 The Author(s) 2020. Published by Oxford University Press on behalf of Nucleic Acids Research.In 2014, the National Institutes of Health (NIH) initiated the Illuminating the Druggable Genome (IDG) program to identify and improve our understanding of poorly characterized proteins that can potentially be modulated using small molecules or biologics. Two resources produced from these efforts are: The Target Central Resource Database (TCRD) (http://juniper.health.unm.edu/tcrd/) and Pharos (https://pharos.nih.gov/), a web interface to browse the TCRD. The ultimate goal of these resources is to highlight and facilitate research into currently understudied proteins, by aggregating a multitude of data sources, and ranking targets based on the amount of data available, and presenting data in machine learning ready format. Since the 2017 release, both TCRD and Pharos have produced two major releases, which have incorporated or expanded an additional 25 data sources. Recently incorporated data types include human and viral-human protein-protein interactions, protein-disease and protein-phenotype associations, and drug-induced gene signatures, among others. These aggregated data have enabled us to generate new visualizations and content sections in Pharos, in order to empower users to find new areas of study in the druggable genome.",
                "authors": [
                    {
                        "name": "Bocci G."
                    },
                    {
                        "name": "Bologa C.G."
                    },
                    {
                        "name": "Dharkar P."
                    },
                    {
                        "name": "Holmes J."
                    },
                    {
                        "name": "Jensen L.J."
                    },
                    {
                        "name": "Kelleher K.J."
                    },
                    {
                        "name": "Koleti A."
                    },
                    {
                        "name": "Mathe E."
                    },
                    {
                        "name": "Mathias S.L."
                    },
                    {
                        "name": "Nguyen D.-T."
                    },
                    {
                        "name": "Oprea T.I."
                    },
                    {
                        "name": "Schurer S.C."
                    },
                    {
                        "name": "Sheils T.K."
                    },
                    {
                        "name": "Simeonov A."
                    },
                    {
                        "name": "Siramshetty V.B."
                    },
                    {
                        "name": "Southall N."
                    },
                    {
                        "name": "Vidovic D."
                    },
                    {
                        "name": "Waller A."
                    },
                    {
                        "name": "Yang J.J."
                    }
                ],
                "citationCount": 6,
                "date": "2021-01-08T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "TCRD and Pharos 2021: Mining the human proteome for disease biology"
            },
            "pmid": "33156327"
        }
    ],
    "topic": [
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Molecular biology",
            "uri": "http://edamontology.org/topic_3047"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        }
    ]
}
