{
    "additionDate": "2015-10-07T17:47:40Z",
    "biotoolsCURIE": "biotools:nextbio",
    "biotoolsID": "nextbio",
    "collectionID": [
        "DRCAT"
    ],
    "credit": [
        {
            "name": "DRCAT",
            "typeEntity": "Project",
            "typeRole": [
                "Documentor"
            ]
        },
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.nextbio.com/b/corp/contact.nb"
        }
    ],
    "description": "The platform enables biologists to examine a gene, protein, compound or disease of interest in a global, biological, or clinical context.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://www.nextbio.com/b/authentication/login.nb"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Identifier",
                        "uri": "http://edamontology.org/data_0842"
                    }
                }
            ],
            "operation": [
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Gene report",
                        "uri": "http://edamontology.org/data_0916"
                    },
                    "format": [
                        {
                            "term": "HTML",
                            "uri": "http://edamontology.org/format_2331"
                        }
                    ]
                }
            ]
        }
    ],
    "homepage": "http://www.nextbio.com/",
    "lastUpdate": "2018-12-29T15:07:16Z",
    "name": "NextBio gene-centric data",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "DRCAT",
    "publication": [
        {
            "doi": "10.1371/journal.pone.0013066",
            "metadata": {
                "abstract": "Background: The investigation of the interconnections between the molecular and genetic events that govern biological systems is essential if we are to understand the development of disease and design effective novel treatments. Microarray and next-generation sequencing technologies have the potential to provide this information. However, taking full advantage of these approaches requires that biological connections be made across large quantities of highly heterogeneous genomic datasets. Leveraging the increasingly huge quantities of genomic data in the public domain is fast becoming one of the key challenges in the research community today. Methodology/Results: We have developed a novel data mining framework that enables researchers to use this growing collection of public high-throughput data to investigate any set of genes or proteins. The connectivity between molecular states across thousands of heterogeneous datasets from microarrays and other genomic platforms is determined through a combination of rank-based enrichment statistics, meta-analyses, and biomedical ontologies. We address data quality concerns through dataset replication and meta-analysis and ensure that the majority of the findings are derived using multiple lines of evidence. As an example of our strategy and the utility of this framework, we apply our data mining approach to explore the biology of brown fat within the context of the thousands of publicly available gene expression datasets. Conclusions: Our work presents a practical strategy for organizing, mining, and correlating global collections of large-scale genomic data to explore normal and disease biology. Using a hypothesis-free approach, we demonstrate how a data-driven analysis across very large collections of genomic data can reveal novel discoveries and evidence to support existing hypothesis. © 2010 Kupershmidt et al.",
                "authors": [
                    {
                        "name": "Kupershmidt I."
                    },
                    {
                        "name": "Su Q.J."
                    },
                    {
                        "name": "Grewal A."
                    },
                    {
                        "name": "Sundaresh S."
                    },
                    {
                        "name": "Halperin I."
                    },
                    {
                        "name": "Flynn J."
                    },
                    {
                        "name": "Shekar M."
                    },
                    {
                        "name": "Wang H."
                    },
                    {
                        "name": "Park J."
                    },
                    {
                        "name": "Cui W."
                    },
                    {
                        "name": "Wall G.D."
                    },
                    {
                        "name": "Wisotzkey R."
                    },
                    {
                        "name": "Alag S."
                    },
                    {
                        "name": "Akhtari S."
                    },
                    {
                        "name": "Ronaghi M."
                    }
                ],
                "citationCount": 246,
                "date": "2010-11-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "Ontology-based meta-analysis of global collections of high-throughput public data"
            },
            "pmcid": "PMC2947508",
            "pmid": "20927376",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Comparative genomics",
            "uri": "http://edamontology.org/topic_0797"
        }
    ],
    "validated": 1
}