{
    "additionDate": "2021-04-21T19:26:16Z",
    "biotoolsCURIE": "biotools:fastp",
    "biotoolsID": "fastp",
    "description": "A tool designed to provide fast all-in-one preprocessing for FastQ files. This tool is developed in C++ with multithreading supported to afford high performance.",
    "editPermission": {
        "authors": [
            "alexcorm",
            "paulzierep"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence contamination filtering",
                    "uri": "http://edamontology.org/operation_3187"
                },
                {
                    "term": "Sequencing quality control",
                    "uri": "http://edamontology.org/operation_3218"
                }
            ]
        }
    ],
    "homepage": "https://github.com/OpenGene/fastp",
    "language": [
        "C",
        "C++"
    ],
    "lastUpdate": "2024-11-24T14:35:42.621732Z",
    "license": "MIT",
    "name": "fastp",
    "owner": "leipzig",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/bty560",
            "metadata": {
                "abstract": "Motivation Quality control and preprocessing of FASTQ files are essential to providing clean data for downstream analysis. Traditionally, a different tool is used for each operation, such as quality control, adapter trimming and quality filtering. These tools are often insufficiently fast as most are developed using high-level programming languages (e.g. Python and Java) and provide limited multi-threading support. Reading and loading data multiple times also renders preprocessing slow and I/O inefficient. Results We developed fastp as an ultra-fast FASTQ preprocessor with useful quality control and data-filtering features. It can perform quality control, adapter trimming, quality filtering, per-read quality pruning and many other operations with a single scan of the FASTQ data. This tool is developed in C++ and has multi-threading support. Based on our evaluation, fastp is 2-5 times faster than other FASTQ preprocessing tools such as Trimmomatic or Cutadapt despite performing far more operations than similar tools. Availability and implementation The open-source code and corresponding instructions are available at https://github.com/OpenGene/fastp.",
                "authors": [
                    {
                        "name": "Chen S."
                    },
                    {
                        "name": "Chen Y."
                    },
                    {
                        "name": "Gu J."
                    },
                    {
                        "name": "Zhou Y."
                    }
                ],
                "citationCount": 12047,
                "date": "2018-09-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Fastp: An ultra-fast all-in-one FASTQ preprocessor"
            },
            "pmcid": "PMC6129281",
            "pmid": "30423086"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Probes and primers",
            "uri": "http://edamontology.org/topic_0632"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        }
    ],
    "version": [
        "v0.23.2"
    ]
}
