{"credit":[{"email":"vinaykmittal@gatech.edu","name":"Vinay Mittal","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"http://www.mcdonaldlab.biology.gatech.edu/r-sap/README_1.1.pdf"}],"function":[{"operation":[{"term":"RNA-Seq analysis","uri":"http://edamontology.org/operation_3680"}]}],"labels":{"language":["Perl"],"operatingSystem":["Linux","Windows"],"toolType":["Command-line tool"],"topic":[{"term":"Nucleic acids","uri":"http://edamontology.org/topic_0077"},{"term":"RNA-Seq","uri":"http://edamontology.org/topic_3170"},{"term":"RNA","uri":"http://edamontology.org/topic_0099"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/r-sap-1-1-rna-seq-analysis-pipeline.html"}],"publication":[{"abstract":"The rapid expansion in the quantity and quality of RNA-Seq data requires the development of sophisticated high-performance bioinformatics tools capable of rapidly transforming this data into meaningful information that is easily interpretable by biologists. Currently available analysis tools are often not easily installed by the general biologist and most of them lack inherent parallel processing capabilities widely recognized as an essential feature of next-generation bioinformatics tools. We present here a user-friendly and fully automated RNA-Seq analysis pipeline (R-SAP) with built-in multi-threading capability to analyze and quantitate high-throughput RNA-Seq datasets. R-SAP follows a hierarchical decision making procedure to accurately characterize various classes of transcripts and achieves a near linear decrease in data processing time as a result of increased multi-threading. In addition, RNA expression level estimates obtained using R-SAP display high concordance with levels measured by microarrays. © 2012 The Author(s).","authors":["Mittal V.K.","McDonald J.F."],"cit_count":5,"journal":"Nucleic Acids Research","pmid":"22287631","title":"R-SAP: A multi-threading computational pipeline for the characterization of high-throughput RNA-sequencing data","year":"2012-05-01"}],"summary":{"biotoolsCURIE":"biotools:r-sap","biotoolsID":"r-sap","description":"User-friendly and fully automated bioinformatics pipeline that analyzes and quantitates high-throughput RNA-Seq datasets. It accurately characterizes various classes of transcripts resulted from aberrant splicing and chimeric transcripts. Expression level estimates are reported as RPKM (reads per kilobase of exon model per million mapped reads) values.","homepage":"http://www.mcdonaldlab.biology.gatech.edu/r-sap.htm","name":"R-SAP"}}