{
    "additionDate": "2020-01-14T09:35:35Z",
    "biotoolsCURIE": "biotools:OpenFmriAnalysis",
    "biotoolsID": "OpenFmriAnalysis",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "t.vanmourik@donders.ru.nl",
            "name": "Tim van Mourik",
            "orcidid": "https://orcid.org/0000-0002-8155-8641",
            "typeEntity": "Person"
        }
    ],
    "description": "Improved cortical boundary registration for locally distorted fMRI scans.\n\nAn MRI analysis toolbox, primarily for laminar analysis.\n\nIn order to protect your privacy, we only use cookies that are essential for the functioning of this website.\n\nMany of the functions for general fMRI preprocessing are wrappers for existing well-established neuroimaging tools. The wrappers should be seen as a consistent MATLAB command line interface to these functions, not as a reimplementation. A large part of these functions are written for my own convenience. A substantial part is new method development, mainly regarding laminar analysis.\n\nFrom this project root, run tvm_installLaminarAnalysisToolbox.m in MATLAB.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Phasing",
                    "uri": "http://edamontology.org/operation_3454"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/TimVanMourik/OpenFmriAnalysis",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2021-01-04T14:00:56Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "https://giraffe.tools/workflow/TimVanMourik/OpenFmriAnalysis"
        }
    ],
    "name": "OpenFmriAnalysis",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PONE.0223440",
            "metadata": {
                "abstract": "© 2019 Public Library of Science. All rights reserved.With continuing advances in MRI techniques and the emergence of higher static field strengths, submillimetre spatial resolution is now possible in human functional imaging experiments. This has opened up the way for more specific types of analysis, for example investigation of the cortical layers of the brain. With this increased specificity, it is important to correct for the geometrical distortions that are inherent to echo planar imaging (EPI). Inconveniently, higher field strength also increases these distortions. The resulting displacements can easily amount to several millimetres and as such pose a serious problem for laminar analysis. We here present a method, Recursive Boundary Registration (RBR), that corrects distortions between an anatomical and an EPI volume. By recursively applying Boundary Based Registration (BBR) on progressively smaller subregions of the brain we generate an accurate whole-brain registration, based on the grey-white matter contrast. Explicit care is taken that the deformation does not break the topology of the cortical surface, which is an important requirement for several of the most common subsequent steps in laminar analysis. We show that RBR obtains submillimetre accuracy with respect to a manually distorted gold standard, and apply it to a set of human in vivo scans to show a clear increase in spacial specificity. RBR further automates the process of non-linear distortion correction. This is an important step towards routine human laminar fMRI for large field of view acquisitions. We provide the code for the RBR algorithm, as well as a variety of functions to better investigate registration performance in a public GitHub repository, https://github.com/ TimVanMourik/OpenFmriAnalysis, under the GPL 3.0 license.",
                "authors": [
                    {
                        "name": "Koopmans P.J."
                    },
                    {
                        "name": "Norris D.G."
                    },
                    {
                        "name": "Van Mourik T."
                    }
                ],
                "citationCount": 3,
                "date": "2019-11-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "Improved cortical boundary registration for locally distorted fMRI scans"
            },
            "pmcid": "PMC6860425",
            "pmid": "31738777"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Data acquisition",
            "uri": "http://edamontology.org/topic_3077"
        },
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        }
    ],
    "validated": 1
}
