{
    "additionDate": "2021-03-19T08:45:58Z",
    "biotoolsCURIE": "biotools:basdas",
    "biotoolsID": "basdas",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "kimsy@kribb.re.kr",
            "name": "Seon-Young Kim",
            "orcidid": "https://orcid.org/0000-0002-1030-7730",
            "typeEntity": "Person"
        }
    ],
    "description": "BaSDAS (Barcode-Seq Data Analysis System) is a GUI-based pooled knockout screening data analysis system to facilitate the analysis of pooled knockout screen data easily and effectively by researchers with limited bioinformatics skills. The BaSDAS supports the analysis of various pooled screening libraries, including yeast, human, and mouse libraries, and provides many useful statistical and visualization functions with a user-friendly web interface for convenience. We expect that BaSDAS will be a useful tool for the analysis of genome-wide screening data and will support the development of novel drugs based on functional genomics information",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Pathway analysis",
                    "uri": "http://edamontology.org/operation_3928"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "http://barcode.appex.kr/barcode/",
    "lastUpdate": "2021-04-11T10:50:15Z",
    "name": "BaSDAS",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.5808/GI.2020.18.4.E46",
            "metadata": {
                "abstract": "© 2020, Korea Genome Organization.We developed the BaSDAS (Barcode-Seq Data Analysis System), a GUI-based pooled knockout screening data analysis system, to facilitate the analysis of pooled knockout screen data easily and effectively by researchers with limited bioinformatics skills. The BaS-DAS supports the analysis of various pooled screening libraries, including yeast, human, and mouse libraries, and provides many useful statistical and visualization functions with a user-friendly web interface for convenience. We expect that BaSDAS will be a useful tool for the analysis of genome-wide screening data and will support the development of novel drugs based on functional genomics information.",
                "authors": [
                    {
                        "name": "Kim B.K."
                    },
                    {
                        "name": "Kim S.-Y."
                    },
                    {
                        "name": "Park S.-J."
                    },
                    {
                        "name": "Park Y.-K."
                    },
                    {
                        "name": "Yoon B.-H."
                    }
                ],
                "date": "2020-01-01T00:00:00Z",
                "journal": "Genomics and Informatics",
                "title": "Basdas: A web-based pooled CRISPR-Cas9 knockout screening data analysis system"
            },
            "pmcid": "PMC7808871",
            "pmid": "33412762"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ]
}
