{
    "accessibility": "Open access",
    "additionDate": "2019-05-29T15:33:38Z",
    "biotoolsCURIE": "biotools:EuroForMix",
    "biotoolsID": "EuroForMix",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "help@euroformix.com",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "oyvble@hotmail.com",
            "name": "Øyvind Bleka",
            "typeEntity": "Person",
            "typeRole": [
                "Maintainer"
            ]
        }
    ],
    "description": "Open source software based on a continuous model to evaluate STR DNA profiles from a mixture of contributors with artefacts.",
    "download": [
        {
            "type": "Source code",
            "url": "https://github.com/oyvble/euroformix"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Deisotoping",
                    "uri": "http://edamontology.org/operation_3629"
                }
            ]
        }
    ],
    "homepage": "http://www.euroformix.com/",
    "language": [
        "R",
        "C++"
    ],
    "lastUpdate": "2020-06-16T10:55:22Z",
    "license": "GPL-3.0",
    "maturity": "Mature",
    "name": "EuroForMix",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "Ruta",
    "publication": [
        {
            "doi": "10.1016/j.fsigen.2015.11.008",
            "metadata": {
                "abstract": "© 2015 Elsevier Ireland Ltd. All rights reserved.We have released a software named EuroForMix to analyze STR DNA profiles in a user-friendly graphical user interface. The software implements a model to explain the allelic peak height on a continuous scale in order to carry out weight-of-evidence calculations for profiles which could be from a mixture of contributors. Through a properly parameterized model we are able to do inference on mixture proportions, the peak height properties, stutter proportion and degradation. In addition, EuroForMix includes models for allele drop-out, allele drop-in and sub-population structure. EuroForMix supports two inference approaches for likelihood ratio calculations. The first approach uses maximum likelihood estimation of the unknown parameters. The second approach is Bayesian based which requires prior distributions to be specified for the parameters involved. The user may specify any number of known and unknown contributors in the model, however we find that there is a practical computing time limit which restricts the model to a maximum of four unknown contributors. EuroForMix is the first freely open source, continuous model (accommodating peak height, stutter, drop-in, drop-out, population substructure and degradation), to be reported in the literature. It therefore serves an important purpose to act as an unrestricted platform to compare different solutions that are available. The implementation of the continuous model used in the software showed close to identical results to the R-package DNAmixtures, which requires a HUGIN Expert license to be used. An additional feature in EuroForMix is the ability for the user to adapt the Bayesian inference framework by incorporating their own prior information.",
                "authors": [
                    {
                        "name": "Bleka O."
                    },
                    {
                        "name": "Storvik G."
                    },
                    {
                        "name": "Gill P."
                    }
                ],
                "citationCount": 98,
                "date": "2016-03-01T00:00:00Z",
                "journal": "Forensic Science International: Genetics",
                "title": "EuroForMix: An open source software based on a continuous model to evaluate STR DNA profiles from a mixture of contributors with artefacts"
            },
            "pmid": "26720812",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        }
    ],
    "validated": 1,
    "version": [
        "2.1.0"
    ]
}