
{
    "credit": [
        {
            "email": "jeromew@cs.mcgill.ca",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://csb.cs.mcgill.ca/"
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://amyloid.cs.mcgill.ca/semba.php"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Protein modelling (mutation)",
                    "uri": "http://edamontology.org/operation_0331"
                },
                {
                    "term": "Protein binding site prediction",
                    "uri": "http://edamontology.org/operation_2575"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Python"
        ],
        "operatingSystem": [
            "Linux"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Protein binding sites",
                "uri": "http://edamontology.org/topic_3534"
            },
            {
                "term": "Proteins",
                "uri": "http://edamontology.org/topic_0078"
            },
            {
                "term": "DNA mutation",
                "uri": "http://edamontology.org/topic_2533"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/semba-single-residue-mutational-based-binding-affinity.html"
        }
    ],
    "publication": [
        {
            "abstract": "© The Author 2015. Published by Oxford University Press. All rights reserved. Motivation: Amyloids play a role in the degradation of β-cells in diabetes patients. In particular, short amyloid oligomers inject themselves into the membranes of these cells and create pores that disrupt the strictly controlled flow of ions through the membranes. This leads to cell death. Getting rid of the short oligomers either by a deconstruction process or by elongating them into longer fibrils will reduce this toxicity and allow the β-cells to live longer. Results: We develop a computational method to probe the binding affinity of amyloid structures and produce an amylin analog that binds to oligomers and extends their length. The binding and extension lower toxicity and β-cell death. The amylin analog is designed through a parsimonious selection of mutations and is to be administered with the pramlintide drug, but not to interact with it. The mutations (T9K L12K S28H T30K) produce a stable native structure, strong binding affinity to oligomers, and long fibrils. We present an extended mathematical model for the insulin-glucose relationship and demonstrate how affecting the concentration of oligomers with such analog is strictly coupled with insulin release and β-cell fitness.",
            "authors": [
                "Smaoui M.R.",
                "Orland H.",
                "Waldispuhl J."
            ],
            "cit_count": 3,
            "journal": "Bioinformatics",
            "pmid": "25777526",
            "title": "Probing the binding affinity of amyloids to reduce toxicity of oligomers in diabetes",
            "year": "2015-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:semba",
        "biotoolsID": "semba",
        "description": "A program for analyzing the binding affinity of amyloid proteins. It uses an energy function that computes the Lennard-Jones, Coulomb, and solvation energies\nto determine the effect of a mutation on a protein’s stability.",
        "homepage": "http://amyloid.cs.mcgill.ca/semba.php",
        "name": "SEMBA"
    }
}