
{
    "credit": [
        {
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://mblab.wustl.edu/index.html"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Gene prediction",
                    "uri": "http://edamontology.org/operation_2454"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Prediction",
                    "uri": "http://edamontology.org/operation_2423"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Perl"
        ],
        "operatingSystem": [
            "Linux"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "DNA",
                "uri": "http://edamontology.org/topic_0654"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/ppfinder-1-0-find-processed-pseudogenes-genome-annotations.html"
        }
    ],
    "publication": [
        {
            "abstract": "Correct gene prediction is impaired by the presence of processed pseudogenes: nonfunctional, intronless copies of real genes found elsewhere in the genome. Gene prediction programs frequently mistake processed pseudogenes for real genes or exons, leading to biologically irrelevant gene predictions. While methods exist to identify processed pseudogenes in genomes, no attempt has been made to integrate pseudogene removal with gene prediction, or even to provide a freestanding tool that identifies such erroneous gene predictions. We have created PPFINDER (for Processed Pseudogene finder), a program that integrates several methods of processed pseudogene finding in mammalian gene annotations. We used PPFINDER to remove pseudogenes from N-SCAN gene predictions, and show that gene prediction improves substantially when gene prediction and pseudogene masking are interleaved. In addition, we used PPFINDER with gene predictions as a parent database, eliminating the need for libraries of known genes. This allows us to run the gene prediction/PPFINDER procedure on newly sequenced genomes for which few genes are known. ©2006 by Cold Spring Harbor Laboratory Press.",
            "authors": [
                "Van Baren M.J.",
                "Brent M.R."
            ],
            "cit_count": 37,
            "doi": "10.1101/gr.4766206",
            "journal": "Genome Research",
            "title": "Iterative gene prediction and pseudogene removal improves genome annotation",
            "type": "Primary",
            "year": "2006-05-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:ppfinder",
        "biotoolsID": "ppfinder",
        "description": "PPFINDER is a Perl-based procedure for finding processed pseudogenes in genome annotations (GTF format). PPFINDER identifies pseudogenes using two different methods, and creates a GTF file with pseudogene coordinates that can be used for masking the genome sequence. In gene prediction mode, PPFINDER will mask out the genomic sequence and rerun gene prediction. Rounds of pseudogene masking and gene prediction are iterated until convergence.",
        "homepage": "http://mblab.wustl.edu/software.html#ppfinderLink",
        "name": "PPFINDER",
        "version": [
            "1.0"
        ]
    }
}