{
    "additionDate": "2021-01-18T10:52:12Z",
    "biotoolsCURIE": "biotools:lindeconseq",
    "biotoolsID": "lindeconseq",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "xsun@seu.edu.cn",
            "name": "Xiao Sun",
            "typeEntity": "Person"
        },
        {
            "email": "liuhongde@seu.edu.cn",
            "name": "Hongde Liu",
            "orcidid": "https://orcid.org/0000-0001-8768-764X",
            "typeEntity": "Person"
        }
    ],
    "description": "A deconvolution method and its application in analyzing the cellular fractions in acute myeloid leukemia samples.\n\nCell Type Deconvolution using gene expression data for bulk samples.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Deisotoping",
                    "uri": "http://edamontology.org/operation_3629"
                },
                {
                    "term": "Expression profile comparison",
                    "uri": "http://edamontology.org/operation_0315"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "https://github.com/lihuamei/LinDeconSeq",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-02-16T08:49:36Z",
    "name": "LinDeconSeq",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1186/S12864-020-06888-1",
            "metadata": {
                "abstract": "© 2020 The Author(s).Background: The identification of cell type-specific genes (markers) is an essential step for the deconvolution of the cellular fractions, primarily, from the gene expression data of a bulk sample. However, the genes with significant changes identified by pair-wise comparisons cannot indeed represent the specificity of gene expression across multiple conditions. In addition, the knowledge about the identification of gene expression markers across multiple conditions is still paucity. Results: Herein, we developed a hybrid tool, LinDeconSeq, which consists of 1) identifying marker genes using specificity scoring and mutual linearity strategies across any number of cell types, and 2) predicting cellular fractions of bulk samples using weighted robust linear regression with the marker genes identified in the first stage. On multiple publicly available datasets, the marker genes identified by LinDeconSeq demonstrated better accuracy and reproducibility compared to MGFM and RNentropy. Among deconvolution methods, LinDeconSeq showed low average deviations (≤0.0958) and high average Pearson correlations (≥0.8792) between the predicted and actual fractions on the benchmark datasets. Importantly, the cellular fractions predicted by LinDeconSeq appear to be relevant in the diagnosis of acute myeloid leukemia (AML). The distinct cellular fractions in granulocyte-monocyte progenitor (GMP), lymphoid-primed multipotent progenitor (LMPP) and monocytes (MONO) were found to be closely associated with AML compared to the healthy samples. Moreover, the heterogeneity of cellular fractions in AML patients divided these patients into two subgroups, differing in both prognosis and mutation patterns. GMP fraction was the most pronounced between these two subgroups, particularly, in SubgroupA, which was strongly associated with the better AML prognosis and the younger population. Totally, the identification of marker genes by LinDeconSeq represents the improved feature for deconvolution. The data processing strategy with regard to the cellular fractions used in this study also showed potential for the diagnosis and prognosis of diseases. Conclusions: Taken together, we developed a freely-available and open-source tool LinDeconSeq (https://github.com/lihuamei/LinDeconSeq), which includes marker identification and deconvolution procedures. LinDeconSeq is comparable to other current methods in terms of accuracy when applied to benchmark datasets and has broad application in clinical outcome and disease-specific molecular mechanisms.",
                "authors": [
                    {
                        "name": "Li H."
                    },
                    {
                        "name": "Sharma A."
                    },
                    {
                        "name": "Ming W."
                    },
                    {
                        "name": "Sun X."
                    },
                    {
                        "name": "Liu H."
                    }
                ],
                "date": "2020-09-23T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "A deconvolution method and its application in analyzing the cellular fractions in acute myeloid leukemia samples"
            },
            "pmcid": "PMC7510109",
            "pmid": "32967610"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        },
        {
            "term": "Cytometry",
            "uri": "http://edamontology.org/topic_3934"
        }
    ]
}