{
    "accessibility": "Open access",
    "additionDate": "2019-06-20T16:13:28Z",
    "biotoolsCURIE": "biotools:Recentrifuge",
    "biotoolsID": "Recentrifuge",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "jse.mnl@gmail.com",
            "name": "Jose Manuel Martí",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.dynomics.org/"
        }
    ],
    "description": "Robust comparative analysis and contamination removal for metagenomics.",
    "download": [
        {
            "type": "Downloads page",
            "url": "https://pypi.org/project/recentrifuge/#files"
        },
        {
            "type": "Source code",
            "url": "https://github.com/khyox/recentrifuge/releases"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Taxonomic classification",
                    "uri": "http://edamontology.org/operation_3460"
                },
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                },
                {
                    "term": "Cross-assembly",
                    "uri": "http://edamontology.org/operation_3730"
                }
            ]
        }
    ],
    "homepage": "https://sites.google.com/view/recentrifuge",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-06-16T10:55:23Z",
    "license": "AGPL-3.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/khyox/recentrifuge"
        },
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/khyox/recentrifuge/issues"
        }
    ],
    "maturity": "Mature",
    "name": "Recentrifuge",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "Ruta",
    "publication": [
        {
            "doi": "10.1371/journal.pcbi.1006967",
            "metadata": {
                "abstract": "© 2019 Jose Manuel Martí. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Metagenomic sequencing is becoming widespread in biomedical and environmental research, and the pace is increasing even more thanks to nanopore sequencing. With a rising number of samples and data per sample, the challenge of efficiently comparing results within a specimen and between specimens arises. Reagents, laboratory, and host related contaminants complicate such analysis. Contamination is particularly critical in low microbial biomass body sites and environments, where it can comprise most of a sample if not all. Recentrifuge implements a robust method for the removal of negative-control and crossover taxa from the rest of samples. With Recentrifuge, researchers can analyze results from taxonomic classifiers using interactive charts with emphasis on the confidence level of the classifications. In addition to contamination-subtracted samples, Recentrifuge provides shared and exclusive taxa per sample, thus enabling robust contamination removal and comparative analysis in environmental and clinical metagenomics. Regarding the first area, Recentrifuge’s novel approach has already demonstrated its benefits showing that microbiomes of Arctic and Antarctic solar panels display similar taxonomic profiles. In the clinical field, to confirm Recentrifuge’s ability to analyze complex metagenomes, we challenged it with data coming from a metagenomic investigation of RNA in plasma that suffered from critical contamination to the point of preventing any positive conclusion. Recentrifuge provided results that yielded new biological insight into the problem, supporting the growing evidence of a blood microbiota even in healthy individuals, mostly translocated from the gut, the oral cavity, and the genitourinary tract. We also developed a synthetic dataset carefully designed to rate the robust contamination removal algorithm, which demonstrated a significant improvement in specificity while retaining a high sensitivity even in the presence of cross-contaminants. Recentrifuge’s official website is www.recentrifuge.org. The data and source code are anonymously and freely available on GitHub and PyPI. The computing code is licensed under the AGPLv3. The Recentrifuge Wiki is the most extensive and continually-updated source of documentation for Recentrifuge, covering installation, use cases, testing, and other useful topics.",
                "authors": [
                    {
                        "name": "Marti J.M."
                    }
                ],
                "citationCount": 13,
                "date": "2019-01-01T00:00:00Z",
                "journal": "PLoS Computational Biology",
                "title": "Recentrifuge: Robust comparative analysis and contamination removal for metagenomics"
            },
            "pmcid": "PMC6472834",
            "pmid": "30958827",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "Microbial ecology",
            "uri": "http://edamontology.org/topic_3697"
        },
        {
            "term": "Metagenomic sequencing",
            "uri": "http://edamontology.org/topic_3837"
        }
    ],
    "validated": 1,
    "version": [
        "0.28.10"
    ]
}