{
    "additionDate": "2018-08-06T14:31:33Z",
    "biotoolsCURIE": "biotools:octopus-toolkit",
    "biotoolsID": "octopus-toolkit",
    "credit": [
        {
            "email": "Octopustoolkit@gmail.com",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Retrieve and process large sets of next-generation sequencing (NGS) data with a single step. Automated set-up-and-analysis pipeline utilizing the Aspera, SRA Toolkit, bwtool, Samtools FastQC, Trimmomatic, HISAT2, STAR, and HOMER applications.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://octopus-toolkit2.readthedocs.io/en/latest/guide.html"
        },
        {
            "type": [
                "Training material"
            ],
            "url": "http://octopus-toolkit2.readthedocs.io/en/latest/tutorial.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence analysis",
                    "uri": "http://edamontology.org/operation_2403"
                },
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Sequence motif recognition",
                    "uri": "http://edamontology.org/operation_0239"
                },
                {
                    "term": "Protein binding site prediction",
                    "uri": "http://edamontology.org/operation_2575"
                }
            ]
        }
    ],
    "homepage": "http://octopus-toolkit2.readthedocs.io/en/latest/",
    "language": [
        "R",
        "Java"
    ],
    "lastUpdate": "2018-12-10T12:59:01Z",
    "license": "GPL-3.0",
    "name": "OCTOPUS-toolkit",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "aotamendi.1",
    "publication": [
        {
            "doi": "10.1093/nar/gky083",
            "metadata": {
                "abstract": "© The Author(s) 2018. Published by Oxford University Press on behalf of Nucleic Acids Research.Octopus-toolkit is a stand-alone application for retrieving and processing large sets of next-generation sequencing (NGS) data with a single step. Octopus-toolkit is an automated set-up-and-analysis pipeline utilizing the Aspera, SRA Toolkit, FastQC, Trimmomatic, HISAT2, STAR, Samtools, and HOMER applications. All the applications are installed on the user’s computer when the program starts. Upon the installation, it can automatically retrieve original files of various epigenomic and transcriptomic data sets, including ChIP-seq, ATAC-seq, DNase-seq, MeDIP-seq, MNase-seq and RNA-seq, from the gene expression omnibus data repository. The downloaded files can then be sequentially processed to generate BAM and BigWig files, which are used for advanced analyses and visualization. Currently, it can process NGS data from popular model genomes such as, human (Homo sapiens), mouse (Mus musculus), dog (Canis lupus familiaris), plant (Arabidopsis thaliana), zebrafish (Danio rerio), fruit fly (Drosophila melanogaster), worm (Caenorhabditis elegans), and budding yeast (Saccharomyces cerevisiae) genomes. With the processed files from Octopus-toolkit, the meta-analysis of various data sets, motif searches for DNA-binding proteins, and the identification of differentially expressed genes and/or protein-binding sites can be easily conducted with few commands by users. Overall, Octopus-toolkit facilitates the systematic and integrative analysis of available epigenomic and transcriptomic NGS big data.",
                "authors": [
                    {
                        "name": "Kim T."
                    },
                    {
                        "name": "Seo H.D."
                    },
                    {
                        "name": "Hennighausen L."
                    },
                    {
                        "name": "Lee D."
                    },
                    {
                        "name": "Kang K."
                    }
                ],
                "citationCount": 25,
                "date": "2018-05-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "Octopus-toolkit: A workflow to automate mining of public epigenomic and transcriptomic next-generation sequencing data"
            },
            "pmcid": "PMC5961211",
            "pmid": "29420797",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        }
    ],
    "validated": 1,
    "version": [
        "2.1.1"
    ]
}