
{
    "credit": [
        {
            "email": "yannisun@msu.edu",
            "name": "Yanni Sun",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "https://sites.google.com/site/yannisun/"
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://www.cse.msu.edu/~achawana/grammar-string/index.htm"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Structure alignment",
                    "uri": "http://edamontology.org/operation_0295"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Sequence alignment",
                    "uri": "http://edamontology.org/operation_0292"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "RNA secondary structure prediction",
                    "uri": "http://edamontology.org/operation_0278"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Functional, regulatory and non-coding RNA",
                "uri": "http://edamontology.org/topic_0659"
            },
            {
                "term": "Nucleic acid structure analysis",
                "uri": "http://edamontology.org/topic_0097"
            },
            {
                "term": "Structure prediction",
                "uri": "http://edamontology.org/topic_0082"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://www.mybiosoftware.com/grammar-string-ncrna-secondary-structure-representation.html"
        }
    ],
    "publication": [
        {
            "abstract": "Many noncoding RNAs (ncRNAs) function through both their sequences and secondary structures. Thus, secondary structure derivation is an important issue in today's RNA research. The state-of-the-art structure annotation tools are based on comparative analysis, which derives consensus structure of homologous ncRNAs. Despite promising results from existing ncRNA aligning and consensus structure derivation tools, there is a need for more efficient and accurate ncRNA secondary structure modeling and alignment methods. In this work, we introduce a consensus structure derivation approach based on grammar string, a novel ncRNA secondary structure representation that encodes an ncRNA's sequence and secondary structure in the parameter space of a context-free grammar (CFG) and a full RNA grammar including pseudoknots. Being a string defined on a special alphabet constructed from a grammar, grammar string converts ncRNA alignment into sequence alignment. We derive consensus secondary structures from hundreds of ncRNA families from BraliBase 2.1 and 25 families containing pseudoknots using grammar string alignment. Our experiments have shown that grammar string-based structure derivation competes favorably in consensus structure quality with Murlet and RNASampler. Source code and experimental data are available at http://www.cse.msu.edu/~yannisun/grammar-string.",
            "authors": [
                "Achawanantakun R.",
                "Sun Y.",
                "Takyar S.S."
            ],
            "cit_count": 4,
            "journal": "Journal of bioinformatics and computational biology",
            "pmid": "21523935",
            "title": "ncRNA consensus secondary structure derivation using grammar strings.",
            "year": "2011-04-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:grammar_string",
        "biotoolsID": "grammar_string",
        "description": "Novel representation of noncoding RNA secondary structure. By encoding both the sequence and secondary structure of ncRNAs in a string, ncRNA structural alignment is converted to sequence alignment. The software package provides an ncRNA consensus secondary structure derivation tool.",
        "homepage": "http://www.cse.msu.edu/~achawana/grammar-string/",
        "name": "Grammar String"
    }
}