{
    "additionDate": "2018-10-18T11:22:33Z",
    "biotoolsCURIE": "biotools:vasp",
    "biotoolsID": "vasp",
    "credit": [
        {
            "email": "vasp.materialphysik@univie.ac.at",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Vienna Ab initio Simulation Package. Tool for comparison of binding sites in aligned protein structures. Uses solid volumes to represent protein shape and the shape of surface cavities, clefts and tunnels that are defined with other methods.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://cms.mpi.univie.ac.at/wiki/index.php/The_VASP_Manual"
        },
        {
            "type": [
                "User manual"
            ],
            "url": "https://www.vasp.at/index.php/documentation"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Molecular surface calculation",
                    "uri": "http://edamontology.org/operation_0387"
                },
                {
                    "term": "Protein-ligand docking",
                    "uri": "http://edamontology.org/operation_0482"
                },
                {
                    "term": "Scaffolding",
                    "uri": "http://edamontology.org/operation_3216"
                }
            ]
        }
    ],
    "homepage": "https://www.vasp.at",
    "language": [
        "C",
        "C++"
    ],
    "lastUpdate": "2018-12-10T12:59:01Z",
    "name": "VASP",
    "operatingSystem": [
        "Windows"
    ],
    "owner": "aotamendi.1",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PCBI.1000881",
            "metadata": {
                "abstract": "Many algorithms that compare protein structures can reveal similarities that suggest related biological functions, even at great evolutionary distances. Proteins with related function often exhibit differences in binding specificity, but few algorithms identify structural variations that effect specificity. To address this problem, we describe the Volumetric Analysis of Surface Properties (VASP), a novel volumetric analysis tool for the comparison of binding sites in aligned protein structures. VASP uses solid volumes to represent protein shape and the shape of surface cavities, clefts and tunnels that are defined with other methods. Our approach, inspired by techniques from constructive solid geometry, enables the isolation of volumetrically conserved and variable regions within three dimensionally superposed volumes. We applied VASP to compute a comparative volumetric analysis of the ligand binding sites formed by members of the steroidogenic acute regulatory protein (StAR)-related lipid transfer (START) domains and the serine proteases. Within both families, VASP isolated individual amino acids that create structural differences between ligand binding cavities that are known to influence differences in binding specificity. Also, VASP isolated cavity subregions that differ between ligand binding cavities which are essential for differences in binding specificity. As such, VASP should prove a valuable tool in the study of protein-ligand binding specificity. © 2010 Chen, Honig.",
                "authors": [
                    {
                        "name": "Chen B.Y."
                    },
                    {
                        "name": "Honig B."
                    }
                ],
                "citationCount": 43,
                "date": "2010-08-01T00:00:00Z",
                "journal": "PLoS Computational Biology",
                "title": "VASP: A volumetric analysis of surface properties yields insights into protein-ligand binding specificity"
            },
            "pmcid": "PMC2930297",
            "pmid": "20814581",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Protein folds and structural domains",
            "uri": "http://edamontology.org/topic_0736"
        },
        {
            "term": "Protein structural motifs and surfaces",
            "uri": "http://edamontology.org/topic_0166"
        }
    ],
    "validated": 1,
    "version": [
        "5.4.4"
    ]
}
