{"credit":[{"email":"lei.xie@hunter.cuny.edu","name":"Lei Xie","typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://compsci.hunter.cuny.edu/~leixie/"}],"documentation":[{"url":"https://github.com/john525/Efficient-KSP-Search"}],"function":[{"operation":[{"term":"Protein folding analysis","uri":"http://edamontology.org/operation_2415"}]}],"labels":{"language":["Java"],"operatingSystem":["Linux"],"toolType":["Command-line tool"],"topic":[{"term":"Proteins","uri":"http://edamontology.org/topic_0078"},{"term":"Protein structure analysis","uri":"http://edamontology.org/topic_2814"},{"term":"Protein folds and structural domains","uri":"http://edamontology.org/topic_0736"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/sskdsp-single-source-k-diverse-shortest-paths-algorithm.html"}],"publication":[{"abstract":"© 2016 Wiley Periodicals, Inc. Protein structure prediction, when construed as a fold recognition problem, is one of the most important applications of similarity search in bioinformatics. A new protein-fold recognition method is reported which combines a single-source K diverse shortest path (SSKDSP) algorithm with Enrichment of Network Topological Similarity (ENTS) algorithm to search a graphic feature space generated using sequence similarity and structural similarity metrics. A modified, more efficient SSKDSP algorithm is developed to improve the performance of graph searching. The new implementation of the SSKDSP algorithm empirically requires 82% less memory and 61% less time than the current implementation, allowing for the analysis of larger, denser graphs. Furthermore, the statistical significance of fold ranking generated from SSKDSP is assessed using ENTS. The reported ENTS-SSKDSP algorithm outperforms original ENTS that uses random walk with restart for the graph search as well as other state-of-the-art protein structure prediction algorithms HHSearch and Sparks-X, as evaluated by a benchmark of 600 query proteins. The reported methods may easily be extended to other similarity search problems in bioinformatics and chemoinformatics. The SSKDSP software is available at http://compsci.hunter.cuny.edu/~leixie/sskdsp.html.","authors":["Lhota J.","Xie L."],"cit_count":0,"journal":"Proteins: Structure, Function and Bioinformatics","pmid":"26800480","title":"Protein-fold recognition using an improved single-source K diverse shortest paths algorithm","year":"2016-04-01"}],"summary":{"biotoolsCURIE":"biotools:sskdsp","biotoolsID":"sskdsp","description":"A scalable implementation of Single Source K Diverse Shortest Paths Algorithm.","homepage":"http://compsci.hunter.cuny.edu/~leixie/sskdsp.html","name":"SSKDSP"}}