{
    "accessibility": "Open access",
    "additionDate": "2020-05-08T13:16:27Z",
    "biotoolsCURIE": "biotools:plantannot",
    "biotoolsID": "plantannot",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "marcos.viana@embrapa.br",
            "name": "Marcos Viana",
            "note": "Bioinformatician at Embrapa",
            "orcidid": "https://orcid.org/0000-0002-4047-1398",
            "typeEntity": "Person",
            "typeRole": [
                "Maintainer"
            ]
        },
        {
            "email": "mauricio.mudadu@embrapa.br",
            "name": "Mauricio de Alvarenga Mudadu",
            "note": "Reseacher at Embrapa",
            "orcidid": "https://orcid.org/0000-0002-2767-2507",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "adhemar.zerlotini@embrapa.br",
            "name": "Adhemar Zerlotini",
            "note": "Researcher at Embrapa",
            "orcidid": "https://orcid.org/0000-0002-7739-0284",
            "typeEntity": "Person",
            "typeRole": [
                "Developer"
            ]
        }
    ],
    "description": "The Plant Co-expression Annotation Resource, or plantannot in short, is a system developed to find proteins that have no annotation or function assigned (PUFs, or Proteins of Unknown Function) and could be related to molecular mechanisms regarding abiotic stresses in plants. The systems aggregates orthology, coexpression networks and genomic data to filter the genomes of 53 plants (downloaded from Phytozome and NCBI) and select candidate proteins in that regard.",
    "editPermission": {
        "authors": [
            "azneto",
            "marcos.viana"
        ],
        "type": "group"
    },
    "homepage": "https://www.machado.cnptia.embrapa.br/plantannot2",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-03-28T12:19:41Z",
    "license": "GPL-3.0",
    "link": [
        {
            "note": "First version of plantannot",
            "type": [
                "Other"
            ],
            "url": "https://www.machado.cnptia.embrapa.br/plantannot"
        }
    ],
    "maturity": "Emerging",
    "name": "plantannot",
    "owner": "mauricio.mudadu",
    "publication": [
        {
            "doi": "10.1101/2020.05.22.110510",
            "note": "preprint of the first version of plantannot",
            "type": [
                "Method"
            ]
        },
        {
            "doi": "10.1186/s12859-020-03792-z",
            "metadata": {
                "abstract": "© 2021, The Author(s).The development of genetically modified crops (GM) includes the discovery of candidate genes through bioinformatics analysis using genomics data, gene expression, and others. Proteins of unknown function (PUFs) are interesting targets for GM crops breeding pipelines for the novelty associated with such targets and also to avoid copyright protection. One method of inferring the putative function of PUFs is by relating them to factors of interest such as abiotic stresses using orthology and co-expression networks, in a guilt-by-association manner. In this regard, we have downloaded, analyzed, and processed genomics data of 53 angiosperms, totaling 1,862,010 genes and 2,332,974 RNA. Diamond and InterproScan were used to discover 72,266 PUFs for all organisms. RNA-seq datasets related to abiotic stresses were downloaded from NCBI/GEO. The RNA-seq data was used as input to the LSTrAP software to construct co-expression networks. LSTrAP also created clusters of transcripts with correlated expression, whose members are more probably related to the molecular mechanisms associated with abiotic stresses in the plants. Orthologous groups were created (OrhtoMCL) using all 2,332,974 proteins in order to associate PUFs to abiotic stress-related clusters of co-expression and therefore infer their function in a guilt-by-association manner. A freely available web resource named “Plant Co-expression Annotation Resource” (https://www.machado.cnptia.embrapa.br/plantannot), Plantannot, was created to provide indexed queries to search for PUF putatively associated with abiotic stresses. The web interface also allows browsing, querying, and retrieving of public genomics data from 53 plants. We hope Plantannot to be useful for researchers trying to obtain novel GM crops resistant to climate change hazards.",
                "authors": [
                    {
                        "name": "Jose Andrade Viana M."
                    },
                    {
                        "name": "Zerlotini A."
                    },
                    {
                        "name": "de Alvarenga Mudadu M."
                    }
                ],
                "date": "2021-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Plant Co-expression Annotation Resource: a web server for identifying targets for genetically modified crop breeding pipelines"
            }
        }
    ],
    "relation": [
        {
            "biotoolsID": "machado",
            "type": "uses"
        }
    ],
    "toolType": [
        "Web application",
        "Database portal"
    ],
    "topic": [
        {
            "term": "Omics",
            "uri": "http://edamontology.org/topic_3391"
        },
        {
            "term": "Bioinformatics",
            "uri": "http://edamontology.org/topic_0091"
        },
        {
            "term": "Biological databases",
            "uri": "http://edamontology.org/topic_3071"
        }
    ],
    "validated": 1,
    "version": [
        "0.0.1",
        "2.0"
    ]
}