{
    "additionDate": "2020-01-14T09:20:24Z",
    "biotoolsCURIE": "biotools:RareLSD",
    "biotoolsID": "RareLSD",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "raghava@iiitd.ac.in",
            "name": "Gajendra P S Raghava",
            "orcidid": "https://orcid.org/0000-0002-8902-2876",
            "typeEntity": "Person"
        }
    ],
    "description": "a manually curated database of lysosomal enzymes associated with rare diseases.\n\nRareLSD: Database for Human Lysosomal Enzymes.\n\nRareLSD: A Database for Human Lysosomal Enzymes. RareLSD is a manually curated database of 63 lysosomal enzymes present in the humans. Deficiency or malfunctioning of any enzyme leads to accumulation of toxic metabolites and thus, various storage defects. One major application of this database is, all the necessary information about these enzymes can be found in this portal",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Local alignment",
                    "uri": "http://edamontology.org/operation_0495"
                }
            ]
        }
    ],
    "homepage": "https://webs.iiitd.edu.in/raghava/rarelsd/",
    "lastUpdate": "2024-11-24T15:37:04.696169Z",
    "name": "RareLSD",
    "owner": "raghavagps",
    "publication": [
        {
            "doi": "10.1093/database/baz112",
            "metadata": {
                "abstract": "RareLSD is a manually curated database of lysosomal enzymes associated with rare diseases that maintains comprehensive information of 63 unique lysosomal enzymes and 93 associated disorders. Each entry provides a complete information on the disorder that includes the name of the disease, organ affected, age of onset, available drug, inheritance pattern, defected enzyme and single nucleotide polymorphism. To facilitate users in designing drugs against these diseases, we predicted and maintained structures of lysosomal enzymes. Our information portal also contains information on biochemical assays against disease-associated enzymes obtained from PubChem. Each lysosomal entry is supported by information that includes disorders, inheritance pattern, drugs, family members, active inhibitors, etc. Eventually, a user-friendly web interface has been developed to facilitate the users in searching and browsing data in RareLSD with a wide range of options. RareLSD is integrated with sequence similarity search tools (e.g. BLAST and Smith-Waterman algorithm) for analysis. It is built on responsive templates that are compatible with most of browsers and screens including smartphones and gadgets (mobile, iPhone, iPad, tablets, etc.).",
                "authors": [
                    {
                        "name": "Agrawal P."
                    },
                    {
                        "name": "Akhter S."
                    },
                    {
                        "name": "Kaur H."
                    },
                    {
                        "name": "Raghava G.P.S."
                    }
                ],
                "citationCount": 5,
                "date": "2019-01-01T00:00:00Z",
                "journal": "Database",
                "title": "RareLSD: A manually curated database of lysosomal enzymes associated with rare diseases"
            },
            "pmcid": "PMC6830269",
            "pmid": "31688938"
        }
    ],
    "topic": [
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Enzymes",
            "uri": "http://edamontology.org/topic_0821"
        },
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        },
        {
            "term": "Rare diseases",
            "uri": "http://edamontology.org/topic_3325"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ],
    "validated": 1
}
