{
    "additionDate": "2021-01-18T11:32:18Z",
    "biotoolsCURIE": "biotools:dna-scanner",
    "biotoolsID": "dna-scanner",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "johannes@kabisch-lab.de",
            "name": "Johannes Kabisch",
            "typeEntity": "Person"
        }
    ],
    "description": "DNA Scanner is a web application for comparing DNA synthesis feasibility, price and turnaround time across vendors.",
    "editPermission": {
        "type": "private"
    },
    "homepage": "https://github.com/Global-Biofoundries-Alliance/DNA-scanner",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-03-01T18:57:00Z",
    "license": "MIT",
    "name": "DNA Scanner",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/SYNBIO/YSAA011",
            "metadata": {
                "abstract": "© 2020 Oxford University Press. All rights reserved.DNA synthesis has become a major enabler of modern bioengineering, allowing scientists to simply order online in silico-designed DNA molecules. Rapidly decreasing DNA synthesis service prices and the concomitant increase of research and development scales bolstered by computer-aided DNA design tools and laboratory automation has driven up the demand for synthetic DNA. While vendors provide user-friendly online portals for purchasing synthetic DNA, customers still face the time-consuming task of checking each vendor of choice for their ability and pricing to synthesize the desired sequences. As a result, ordering large batches of DNA sequences can be a laborious manual procedure in an otherwise increasingly automatable workflow. Even when they are available, there is a high degree of technical knowledge and effort required to integrate vendors’ application programming interfaces (APIs) into computer-aided DNA design tools or automated lab processes. Here, we introduce DNA Scanner, a software package comprising (i) a web-based user interface enabling users to compare the feasibility, price and turnaround time of synthetic DNA sequences across selected vendors and (ii) a Python API enabling integration of these functionalities into computer-aided DNA design tools and automated lab processes. We have developed DNA Scanner to uniformly streamline interactions between synthetic DNA vendors, members of the Global Biofoundry Alliance and the scientific community at large.",
                "authors": [
                    {
                        "name": "Doci G."
                    },
                    {
                        "name": "Fuchs L."
                    },
                    {
                        "name": "Kharbanda Y."
                    },
                    {
                        "name": "Schickling P."
                    },
                    {
                        "name": "Zulkower V."
                    },
                    {
                        "name": "Hillson N."
                    },
                    {
                        "name": "Oberortner E."
                    },
                    {
                        "name": "Swainston N."
                    },
                    {
                        "name": "Kabisch J."
                    }
                ],
                "citationCount": 1,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Synthetic Biology",
                "title": "DNA scanner: A web application for comparing DNA synthesis feasibility, price and turnaround time across vendors"
            },
            "pmcid": "PMC7585645"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Bioengineering",
            "uri": "http://edamontology.org/topic_3398"
        },
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        },
        {
            "term": "Probes and primers",
            "uri": "http://edamontology.org/topic_0632"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        }
    ]
}